//BCHJOB  JOB(BCALCTOP) JOBD(*LIBL/MCMGR) JOBQ(*JOBD) LOG(*JOBD +
             *JOBD *JOBD) LOGCLPGM(*YES)
             OVRPRTF    FILE(MCPRT) TOFILE(MCPRT99)
             CALL       PGM(TRCALCAV)
