//BCHJOB  JOB(BCSASR99) JOBD(*LIBL/MCMGR) JOBQ(*JOBD) LOG(*JOBD +
             *JOBD *MSG) LOGCLPGM(*YES)
OVRPRTF FILE(MCPRT) TOFILE(MCPRT97) COPIES(01) SHARE(*YES)
CALL PGM(TCSASR99)
JIM COFFMAN    ACCT097T881S03 MCPRD   MCPRD   34  X 01
09FRT INV ISS RET             ALL             DALL
ALL                             ALL                             ALL
ALL                            010000099999
//ENDBCHJOB
