//BCHJOB  JOB(BCSLIFSD) JOBD(*libl/MCMGR) JOBQ(*JOBD) LOG(*JOBD +
             *JOBD *MSG) LOGCLPGM(*YES)
/*##################################################################*/
/*##       C S A S  JOB 'BCSLIFSD'      (SR14)                    ##*/
/*## SEND LIFO REPORT (DATA) TO AKRON BY SUBMITTING AN RJE JOB.   ##*/
/*##################################################################*/
             SBMRJEJOB  FILE(MCPRD/QRJEJCL) MBR(RJRAWJCL) +
                          SSND(QRJE/RJESSN) CMD(*YES)
//ENDBCHJOB
