//BCHJOB  JOB(BEDITOP) JOBD(*LIBL/MCMGR) JOBQ(*JOBD) LOG(*JOBD +
             *JOBD *MSG) LOGCLPGM(*YES)
CALL FOTEDIABST
ALL
/* PRINT THE EDI PO REPORT                              */
/* OVERRIDE TO THE DESIRED REPORT FILE                            */
                 OVRDBF     FILE(MCFPRPT) TOFILE(*LIBL/EDIRPTFL)
/* SPOOL TYPE: SHOULD ALWAYS BE 'N'                               */
/*               CHGDTAARA  DTAARA(*LDA (291 1)) VALUE('N')       */
/* PRINT NUM                                                      */
                 CHGDTAARA  DTAARA(*LDA (292 3)) VALUE('015')
/* PAPER WIDTH: 'Y' IS COMPRESSED                                 */
                 CHGDTAARA  DTAARA(*LDA (295 1)) VALUE('Y')
/* NUMBER OF COPIES                                               */
                 CHGDTAARA  DTAARA(*LDA (296 2)) VALUE('01')
/* RANGE OF DATES. 'Y' = BRING UP SCRN , 'N' = NO SCRN            */
                 CHGDTAARA  DTAARA(*LDA (298 1)) VALUE('N')
/* TODAY'S REPORT ONLY                                            */
                 CHGDTAARA  DTAARA(*LDA (299 1)) VALUE('Y')
                 CALL TPRTRPT
/* PRINT THE EDI PURCHASE ORDER ERROR REPORT                      */
/* OVERRIDE TO THE DESIRED REPORT FILE                            */
                 OVRDBF     FILE(MCFPRPT) TOFILE(*LIBL/EDIERRFL)
/* SPOOL TYPE: SHOULD ALWAYS BE 'N'                               */
/*               CHGDTAARA  DTAARA(*LDA (291 1)) VALUE('N')       */
/* PRINT NUM                                                      */
                 CHGDTAARA  DTAARA(*LDA (292 3)) VALUE('015')
/* PAPER WIDTH: 'Y' IS COMPRESSED                                 */
                 CHGDTAARA  DTAARA(*LDA (295 1)) VALUE('Y')
/* NUMBER OF COPIES                                               */
                 CHGDTAARA  DTAARA(*LDA (296 2)) VALUE('01')
/* RANGE OF DATES. 'Y' = BRING UP SCRN , 'N' = NO SCRN            */
                 CHGDTAARA  DTAARA(*LDA (298 1)) VALUE('N')
/* TODAY'S REPORT ONLY                                            */
                 CHGDTAARA  DTAARA(*LDA (299 1)) VALUE('Y')
                 CALL TPRTRPT

             DLTF       FILE(RLEDIACT)
//ENDBCHJOB
