//BCHJOB   JOB(BFRTPROC2) JOBD(*LIBL/MCMGR) JOBQ(*LIBL/HLBATCH) +
             LOG(*JOBD *JOBD *JOBD) LOGCLPGM(*YES)

/* * * * * * * * * * * * * * * * * * * * * */
/*   THIS JOB WILL PROCESS FREIGHT INFO.   */
/*   THE PARM OF "2" INDICATES THAT IT     */
/*   WILL LOOK FOR THE MONTH END HOLD FILE.*/
/* * * * * * * * * * * * * * * * * * * * * */

/*** 04JAN1995 ADDED THE FOLLOWING STMT TO TRY TO REORGANIZE MCFPCA1100 */
             CALL PGM(FRTRGZPFM)

             CALL PGM(BFRTRENAME)

             CALL PGM(TFRTPROC)
2

  STRDBRDR   FILE(QJOBSRC) MBR(BXFRTSTT) JOBQ(HBATCH) RDR(BXFRTSTT)
             CALL PGM(BFRTERR)

/***** 06OCT1993 COMMENTED OUT THE FOLLOWING STRDBRDR STMT - DAVE PLUM */
/*****    - BCSASTRN NO LONGER NEEDS TO BE STARTED AS PART OF THIS JOB */
/*STRDBRDR   FILE(QJOBSRC) MBR(BCSASTRN) JOBQ(HBATCH) RDR(BCSASTRN) */

             CALL PGM(TFRTCLNUP)

//ENDBCHJOB
