   PGM PARM(&MBR &FILE &LIB)
   /**************************************************************/
   /*** BR3MNFUP:  JOB TO START PROGRAM TO UPDATE CSIS         ***/
   /***            MANUFACTURER/PART NUMBERS FROM SAP.         ***/
   /**************************************************************/
   /*** NOTE!!!!! THIS JOB MUST RUN IN A SINGLE-THREADED JOB   ***/
   /*** QUEUE!!!!!!!!!!                                        ***/
   /**************************************************************/
             DCL        VAR(&MBR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FILE) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&RECORDS) TYPE(*DEC) LEN(10 0)

             DCL        VAR(&HR) TYPE(*CHAR) LEN(2)
             DCL        VAR(&MIN) TYPE(*CHAR) LEN(2)
             DCL        VAR(&SEC) TYPE(*CHAR) LEN(2)
             DCL        VAR(&MM) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DD) TYPE(*CHAR) LEN(2)
             DCL        VAR(&NEWMBR) TYPE(*CHAR) LEN(10)

             CHGCURLIB  CURLIB(MCPRD1)


/*** ALLOCATE THE FILE TO PREVENT A COLLISION WITH RJE, WHICH      */
/*** MIGHT BE SENDING DATA INTO R3MNFUP AT THE TIME THIS JOB RUNS */
ALLOCATIT:
             ALCOBJ     OBJ((*CURLIB/R3MNFUP *FILE *EXCL R3MNFUP)) +
                          WAIT(5)
             MONMSG     MSGID(CPF0000) EXEC(DO)
                DLYJOB     DLY(30)
                GOTO ALLOCATIT
             ENDDO

/*** MOVE FROM R/3 FILE TO R3MNFUP FOR BATCH PROCESSING ***/
             CPYF       FROMFILE(&LIB/&FILE) TOFILE(*CURLIB/R3MNFUP) +
                          FROMMBR(&MBR) TOMBR(R3MNFUP) +
                          MBROPT(*REPLACE) FMTOPT(*NOCHK)
             MONMSG MSGID(CPF0000) EXEC(DO)
               SNDPGMMSG  MSG('Copy from R3MNF file to R3MNFUP was +
                          not successful.  Please check job log.')
               GOTO CMDLBL(FINI)
             ENDDO

 /*** RETRIEVE NUMBER OF RECORDS IN FILE.  IF ZERO THEN DATA HAS    ***/
 /*** BEEN PROCESSED ALREADY BY A PREVIOUS JOB.  SIMPLY END THE JOB ***/
             RTVMBRD    FILE(*CURLIB/R3MNFUP) MBR(R3MNFUP) +
                          NBRCURRCD(&RECORDS)
             IF         COND(&RECORDS *EQ 0) THEN(DO)
               DLCOBJ   OBJ((*CURLIB/R3MNFUP *FILE *EXCL R3MNFUP))
               GOTO     CMDLBL(FINI)
             ENDDO


   /********************************************************/
   /*** CREATE A NEW MEMBER FOR THE MNF/PART NUMB UPDATE ***/
   /*** FILE FROM SAP.  THE MEMBER NAME STARTS WITH      ***/
   /*** "R" FOLLOWED BY THE MONTH, DAY, AND TIME (ONLY   ***/
   /*** FIRST DIGIT OF SECONDS BECAUSE 1ST CHARACTER     ***/
   /*** OF MEMBER HAD TO BE ALPHABETIC).                 ***/
   /********************************************************/

             RTVSYSVAL  SYSVAL(QHOUR) RTNVAR(&HR)
             RTVSYSVAL  SYSVAL(QMINUTE) RTNVAR(&MIN)
             RTVSYSVAL  SYSVAL(QSECOND) RTNVAR(&SEC)
             RTVSYSVAL  SYSVAL(QMONTH) RTNVAR(&MM)
             RTVSYSVAL  SYSVAL(QDAY) RTNVAR(&DD)
             CHGVAR     VAR(&NEWMBR) VALUE('R' *CAT &MM *CAT &DD +
                          *CAT &HR *CAT &MIN *CAT &SEC)

             CPYF       FROMFILE(*CURLIB/R3MNFUP) +
                          TOFILE(*CURLIB/R3MNFUP) FROMMBR(R3MNFUP) +
                          TOMBR(&NEWMBR) MBROPT(*REPLACE)
             MONMSG MSGID(CPF0000)

             CLRPFM     FILE(*CURLIB/R3MNFUP) MBR(R3MNFUP)
             MONMSG MSGID(CPF0000)

             OVRDBF     FILE(R3MNFUP) TOFILE(*CURLIB/R3MNFUP) +
                          MBR(&NEWMBR)

             DLCOBJ     OBJ((*CURLIB/R3MNFUP *FILE *EXCL R3MNFUP))

   /**********************************************/
   /* CALL THE R/3 MANUF/PART NUM UPDATE PROGRAM */
   /**********************************************/

    CALL TR3MNFUP

FINI:

/** REMOVE R/3 MEMBER FROM THE R/3 FILE **/

    RMVM       FILE(&LIB/&FILE) MBR(&MBR)
    MONMSG MSGID(CPF0000) EXEC(DO)
         SNDPGMMSG  MSG('Removal of member from file was not +
                      successful.  Please check job log.')
    ENDDO

    ENDPGM
