//BCHJOB  JOB(BRELTOP) JOBD(MCPRD1/MCMGR) JOBQ(*JOBD) LOG(*JOBD +
             *JOBD *MSG) LOGCLPGM(*YES)
             OVRPRTF    FILE(MCPRT) TOFILE(MCPRT99)
             CALL       PGM(TRELRPT)
