//BCHJOB  JOB(BMOVERPT) JOBD(*LIBL/MCMGR) JOBQ(*JOBD) LOG(*JOBD +
             *JOBD *MSG) LOGCLPGM(*YES)
             DCL VAR(&NEWMONTH) TYPE(*CHAR) LEN(1)
//ENDBCHJOB
