//BCHJOB  JOB(BUPDPRC) JOBD(MCPRD1/MCMGR) JOBQ(*JOBD) LOG(*JOBD +
             *JOBD *MSG) LOGCLPGM(*YES)
             OVRPRTF    FILE(MCPRT) TOFILE(MCPRT25)
             CALL       PGM(TUPDPRCB)
