//BCHJOB  JOB(BXBDLREQ) JOBD(*LIBL/MCMGR) JOBQ(*JOBD) LOG(*JOBD +
             *JOBD *MSG) LOGCLPGM(*YES)
/*##################################################################*/
/*##      C S I S  JOB  'BXBDLREQ'    (PAD)                       ##*/
/*## THIS IS THE AUTOMATIC REQ DELETE JOB THAT DELETES REQS       ##*/
/*## IN PURCHASING THAT ARE 60 DAYS OLD OR OLDER AND ARE NOT      ##*/
/*## ATTACHED TO A WORK ORDER                                     ##*/
/*##################################################################*/
             CALL       PGM(TBTDLREQ)
//ENDBCHJOB
