//BCHJOB  JOB(BXMTDTRN) JOBD(*libl/MCMGR) JOBQ(*JOBD) LOG(*JOBD +
             *JOBD *MSG) LOGCLPGM(*YES)
/*############################################################*/
/*##        C S A S  JOB  'BXMTDTRN'     (SR1)              ##*/
/*##  MONTH-TO-DATE TRANSACTIONS BY CODE REPORT.            ##*/
/*############################################################*/
CSISOVR:
             OVRDBF     FILE(MCFLCS0201) SHARE(*YES)  /*MSTORERM*/
             OVRDBF     FILE(MCFLCS1401) SHARE(*YES)  /*DDESC*/
             OVRDBF     FILE(MCFLCS3101) SHARE(*YES)  /*DDESC2*/
             OVRDBF     FILE(MCFLCS3603) SHARE(*YES)  /*DMANPART*/
CSISOPN:
             OPNDBF     FILE(MCFLCS0201) OPTION(*ALL) /*MSTORERM*/
             OPNDBF     FILE(MCFLCS1401) OPTION(*ALL) /*DDESC*/
             OPNDBF     FILE(MCFLCS3101) OPTION(*ALL) /*DDESC2*/
             OPNDBF     FILE(MCFLCS3603) OPTION(*ALL) /*DMANPART*/
CMDCALL:
             OVRPRTF    FILE(MCPRT) TOFILE(*LIBL/MCPRT97)
             CALL       PGM(TMTDTRNS)
CSISCLS:
             CLOF       OPNID(MCFLCS0201)             /*MSTORERM*/
             CLOF       OPNID(MCFLCS1401)             /*DDESC*/
             CLOF       OPNID(MCFLCS3101)             /*DDESC2*/
             CLOF       OPNID(MCFLCS3603)             /*DMANPART*/
//ENDBCHJOB
