//BCHJOB  JOB(BXPURREQ) JOBD(MCPRD1/MCMGR) JOBQ(QBATCH) LOG(*JOBD +
             *JOBD *MSG) LOGCLPGM(*YES)
       OVRDBF     FILE(R3PURREQ) TOFILE(MCPRD1/R3PURREQ) MBR(PWO0000000)
       CALL       PGM(TR3POREQ)

//ENDBCHJOB
