//BCHJOB  JOB(BXRCVTRK) JOBD(*LIBL/MCMGR) JOBQ(*JOBD) LOG(*JOBD +
             *JOBD *MSG) LOGCLPGM(*YES)
OVRPRTF FILE(MCPRT) TOFILE(MCPRT14) COPIES(01) SHARE(*YES)
CALL PGM(TRCVTRKS)
PURCHASING     PURC039MCMGR   MCPRD1  MCPRD1  00  X 01
//ENDBCHJOB
