PGM

/* MAKE THE CURRENT LIBRARY THE SAME AS THE FIRST USER LIBRARY */

       DCL       VAR(&USRLIBL) TYPE(*CHAR) LEN(275)
       DCL       VAR(&CURRENT) TYPE(*CHAR) LEN(10)
       RTVJOBA   USRLIBL(&USRLIBL)
       CHGVAR    &CURRENT VALUE(%SST(&USRLIBL 1 10))
       CHGLIBL   CURLIB(&CURRENT)

/* CREATE AND SEND MMIS HISTORY */

       CLRPFM    FILE(MCFPMMHIST)
       CALL      PGM(TMODSTAT)
             SBMRJEJOB  FILE(MCPRD/QRJEJCL) MBR(MMISJCL1) +
                          SSND(QRJE/RJESSN) CMD(*YES) RESUBMIT(*YES)

ENDPGM
