PGM    PARM(&PARM)

       DCL       VAR(&PARM)    TYPE(*CHAR) LEN(200)
       DCL       VAR(&USRLIBL) TYPE(*CHAR) LEN(275)
       DCL       VAR(&CURRENT) TYPE(*CHAR) LEN(10)

/* MAKE THE CURRENT LIBRARY THE SAME AS THE FIRST USER LIBRARY */

       RTVJOBA   USRLIBL(&USRLIBL)
       CHGVAR    &CURRENT VALUE(%SST(&USRLIBL 1 10))
       CHGLIBL   CURLIB(&CURRENT)

/* RETRIEVE AND SEND MMIS HISTORY */

       CLRPFM    FILE(MCFPMMHIST)
       CALL      PGM(TRETHIST) PARM(&PARM)
       SBMRJEJOB FILE(MCPRD/QRJEJCL) MBR(RJJCLWO) SSND(QRJE/RJESSN) +
          CMD(*YES)

ENDPGM
