PGM

       DCL       VAR(&USRLIBL) TYPE(*CHAR) LEN(275)
       DCL       VAR(&CURRENT) TYPE(*CHAR) LEN(10)

/* MAKE THE CURRENT LIBRARY THE SAME AS THE FIRST USER LIBRARY */

       RTVJOBA   USRLIBL(&USRLIBL)
       CHGVAR    &CURRENT VALUE(%SST(&USRLIBL 1 10))
       CHGLIBL   CURLIB(&CURRENT)

/* SEND EDI DATA TO AKRON MAINFRAME */

       CLRPFM    FILE(EDIABS80)
       CLRPFM    FILE(EDIABST)
       CALL      PGM(SEDIABSL)
       SBMRJEJOB FILE(MCPRD/QRJEJCL) MBR(RJJCLEDI) SSND(QRJE/RJESSN) +
          CMD(*YES)

ENDPGM
