       PGM     PARM(&PGM &PARM1 &PARM2 &JOB &JOBD &OUTQ &USER)

       DCL       VAR(&PGM)     TYPE(*CHAR) LEN(10)
       DCL       VAR(&PARM1)   TYPE(*CHAR) LEN(80)
       DCL       VAR(&PARM2)   TYPE(*CHAR) LEN(112)
       DCL       VAR(&JOB)     TYPE(*CHAR) LEN(10)
       DCL       VAR(&JOBD)    TYPE(*CHAR) LEN(10)
       DCL       VAR(&OUTQ)    TYPE(*CHAR) LEN(10)
       DCL       VAR(&USER)    TYPE(*CHAR) LEN(10)
             SBMJOB     CMD(CALL PGM(&PGM) PARM(&PARM1 &PARM2)) +
                          JOB(&JOB) JOBD(*LIBL/MCMGR) OUTQ(&OUTQ) +
                          USER(&USER) INLLIBL(*JOBD)

ENDPGM
