             PGM PARM(&BUDTAARA &BUDTALIB)
             DCL        VAR(&BUDTAARA) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BUDTALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&ACTION) TYPE(*CHAR) LEN(1)
                          /*  0-no action, 1-enable, 2-disable */
             DCL        VAR(&RC) TYPE(*CHAR) LEN(2)
                       /* 00-System name OK, 23-System Name not DEFINED */
             DCL        VAR(&DEFAULTS) TYPE(*CHAR) LEN(1000)
                       /* DEFAULT BACKUP VALUES */
             DCL        VAR(&BUSYS1)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&BUSYS2)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&BUSYS3)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&BUSYSLIB)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&BUFILE1)    TYPE(*CHAR) LEN(10)
             DCL        VAR(&BUFILE2)    TYPE(*CHAR) LEN(10)
             DCL        VAR(&BUFILE3)    TYPE(*CHAR) LEN(10)
             DCL        VAR(&BUFILE4)    TYPE(*CHAR) LEN(10)
             DCL        VAR(&BUFILE5)    TYPE(*CHAR) LEN(10)
             DCL        VAR(&BUFLIB1)    TYPE(*CHAR) LEN(10)
             DCL        VAR(&BUFLIB2)    TYPE(*CHAR) LEN(10)
             DCL        VAR(&BUFLIB3)    TYPE(*CHAR) LEN(10)
             DCL        VAR(&BUFLIB4)    TYPE(*CHAR) LEN(10)
             DCL        VAR(&BUFLIB5)    TYPE(*CHAR) LEN(10)
             DCL        VAR(&BULIB1)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&BULIB2)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&BULIB3)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&BULIB4)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&BULIB5)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&BUREORG)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&BUSAVE)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&BULORF)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&BUUSER)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&BUJOBQ1)    TYPE(*CHAR) LEN(10)
             DCL        VAR(&BUJOBQ2)    TYPE(*CHAR) LEN(10)
             DCL        VAR(&BUSAVF)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&BUSAVFLIB)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&BUMEDIUM)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&BUERR)      TYPE(*CHAR) LEN(140)
             DCL        VAR(&BUREPLY)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&BUWARN)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&BUWARNOP)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&BUSAVFNN)   TYPE(*CHAR) LEN(10)
     /****************************************************************/
     /*   GET THE DEFAULTS FROM THE DATA AREA WHERE THEY ARE STORED  */
     /****************************************************************/
             RTVDTAARA  DTAARA(&BUDTALIB/&BUDTAARA) RTNVAR(&DEFAULTS)
             CHGVAR     VAR(&BUSYS1)     VALUE(%SST(&DEFAULTS 1   10))
             CHGVAR     VAR(&BUSYS2)     VALUE(%SST(&DEFAULTS 11  10))
             CHGVAR     VAR(&BUSYS3)     VALUE(%SST(&DEFAULTS 21  10))
             CHGVAR     VAR(&BUSYSLIB)   VALUE(%SST(&DEFAULTS 31  10))
             CHGVAR     VAR(&BUFILE1)    VALUE(%SST(&DEFAULTS 41  10))
             CHGVAR     VAR(&BUFILE2)    VALUE(%SST(&DEFAULTS 51  10))
             CHGVAR     VAR(&BUFILE3)    VALUE(%SST(&DEFAULTS 61  10))
             CHGVAR     VAR(&BUFILE4)    VALUE(%SST(&DEFAULTS 71  10))
             CHGVAR     VAR(&BUFILE5)    VALUE(%SST(&DEFAULTS 81  10))
             CHGVAR     VAR(&BUFLIB1)    VALUE(%SST(&DEFAULTS 91  10))
             CHGVAR     VAR(&BUFLIB2)    VALUE(%SST(&DEFAULTS 101 10))
             CHGVAR     VAR(&BUFLIB3)    VALUE(%SST(&DEFAULTS 111 10))
             CHGVAR     VAR(&BUFLIB4)    VALUE(%SST(&DEFAULTS 121 10))
             CHGVAR     VAR(&BUFLIB5)    VALUE(%SST(&DEFAULTS 131 10))
             CHGVAR     VAR(&BULIB1)     VALUE(%SST(&DEFAULTS 141 10))
             CHGVAR     VAR(&BULIB2)     VALUE(%SST(&DEFAULTS 151 10))
             CHGVAR     VAR(&BULIB3)     VALUE(%SST(&DEFAULTS 161 10))
             CHGVAR     VAR(&BULIB4)     VALUE(%SST(&DEFAULTS 171 10))
             CHGVAR     VAR(&BULIB5)     VALUE(%SST(&DEFAULTS 181 10))
             CHGVAR     VAR(&BUREORG)    VALUE(%SST(&DEFAULTS 191 1))
             CHGVAR     VAR(&BUSAVE)     VALUE(%SST(&DEFAULTS 192 1))
             CHGVAR     VAR(&BULORF)     VALUE(%SST(&DEFAULTS 193 1))
             CHGVAR     VAR(&BUUSER)     VALUE(%SST(&DEFAULTS 194 10))
             CHGVAR     VAR(&BUJOBQ1)    VALUE(%SST(&DEFAULTS 204 10))
             CHGVAR     VAR(&BUJOBQ2)    VALUE(%SST(&DEFAULTS 214 10))
             CHGVAR     VAR(&BUSAVF)     VALUE(%SST(&DEFAULTS 224 08))
             CHGVAR     VAR(&BUSAVFLIB)  VALUE(%SST(&DEFAULTS 232 10))
             CHGVAR     VAR(&BUMEDIUM)   VALUE(%SST(&DEFAULTS 242 10))
             CHGVAR     VAR(&BUWARN)     VALUE(%SST(&DEFAULTS 252  1))
             CHGVAR     VAR(&BUWARNOP)   VALUE(%SST(&DEFAULTS 253  1))

            /**************************************************************/
            /*      VERIFY THE EXISTENCE OF THE REQUISITE OBJECTS         */
            /**************************************************************/
 START:      IF         COND(&BUFILE1 *NE ' ') THEN(DO)
             CHKOBJ     OBJ(&BUFLIB1/&BUFILE1) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF0000) EXEC(DO)
             CHGVAR     VAR(&BUERR) VALUE('            not found.  +
                          Backup procedure will not take place.  +
                          Please notify operations.')
             CHGVAR     VAR(%SST(&BUERR 1 10)) VALUE(&BUFILE1)
             SNDPGMMSG  MSG(&BUERR) TOUSR(*SYSOPR) MSGTYPE(*INFO)
             RCVMSG
             GOTO       CMDLBL(ENDPGM)
             ENDDO
             ENDDO
             IF         COND(&BUFILE2 *NE ' ') THEN(DO)
             CHKOBJ     OBJ(&BUFLIB2/&BUFILE2) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF0000) EXEC(DO)
             CHGVAR     VAR(&BUERR) VALUE('            not found.  +
                          Backup procedure will not take place.  +
                          Please notify operations.')
             CHGVAR     VAR(%SST(&BUERR 1 10)) VALUE(&BUFILE2)
             SNDPGMMSG  MSG(&BUERR) TOUSR(*SYSOPR) MSGTYPE(*INFO)
             RCVMSG
             GOTO ENDPGM
             ENDDO
             ENDDO
             IF         COND(&BUFILE3 *NE ' ') THEN(DO)
             CHKOBJ     OBJ(&BUFLIB3/&BUFILE3) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF0000) EXEC(DO)
             CHGVAR     VAR(&BUERR) VALUE('            not found.  +
                          Backup procedure will not take place.  +
                          Please notify operations.')
             CHGVAR     VAR(%SST(&BUERR 1 10)) VALUE(&BUFILE3)
             SNDPGMMSG  MSG(&BUERR) TOUSR(*SYSOPR) MSGTYPE(*INFO)
             RCVMSG
             GOTO ENDPGM
             ENDDO
             ENDDO
             IF         COND(&BUFILE4 *NE ' ') THEN(DO)
             CHKOBJ     OBJ(&BUFLIB4/&BUFILE4) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF0000) EXEC(DO)
             CHGVAR     VAR(&BUERR) VALUE('            not found.  +
                          Backup procedure will not take place.  +
                          Please notify operations.')
             CHGVAR     VAR(%SST(&BUERR 1 10)) VALUE(&BUFILE4)
             SNDPGMMSG  MSG(&BUERR) TOUSR(*SYSOPR) MSGTYPE(*INFO)
             RCVMSG
             GOTO ENDPGM
             ENDDO
             ENDDO
             IF         COND(&BUFILE5 *NE ' ') THEN(DO)
             CHKOBJ     OBJ(&BUFLIB5/&BUFILE5) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF0000) EXEC(DO)
             CHGVAR     VAR(&BUERR) VALUE('            not found.  +
                          Backup procedure will not take place.  +
                          Please notify operations.')
             CHGVAR     VAR(%SST(&BUERR 1 10)) VALUE(&BUFILE5)
             SNDPGMMSG  MSG(&BUERR) TOUSR(*SYSOPR) MSGTYPE(*INFO)
             RCVMSG
             GOTO ENDPGM
             ENDDO
             ENDDO
             IF         COND(&BULIB1 *NE ' ') THEN(DO)
             CHKOBJ     OBJ(&BULIB1) OBJTYPE(*LIB)
             MONMSG     MSGID(CPF0000) EXEC(DO)
             CHGVAR     VAR(&BUERR) VALUE('            not found.  +
                          Backup procedure will not take place.  +
                          Please notify operations.')
             CHGVAR     VAR(%SST(&BUERR 1 10)) VALUE(&BULIB1)
             SNDPGMMSG  MSG(&BUERR) TOUSR(*SYSOPR) MSGTYPE(*INFO)
             RCVMSG
             GOTO ENDPGM
             ENDDO
             ENDDO
      /*     ELSE       CMD(CHGVAR VAR(&BULIB1) VALUE('*N'))    */
             IF         COND(&BULIB2 *NE ' ') THEN(DO)
             CHKOBJ     OBJ(&BULIB2) OBJTYPE(*LIB)
             MONMSG     MSGID(CPF0000) EXEC(DO)
             CHGVAR     VAR(&BUERR) VALUE('            not found.  +
                          Backup procedure will not take place.  +
                          Please notify operations.')
             CHGVAR     VAR(%SST(&BUERR 1 10)) VALUE(&BULIB2)
             SNDPGMMSG  MSG(&BUERR) TOUSR(*SYSOPR) MSGTYPE(*INFO)
             RCVMSG
             GOTO ENDPGM
             ENDDO
             ENDDO
             IF         COND(&BULIB3 *NE ' ') THEN(DO)
             CHKOBJ     OBJ(&BULIB3) OBJTYPE(*LIB)
             MONMSG     MSGID(CPF0000) EXEC(DO)
             CHGVAR     VAR(&BUERR) VALUE('            not found.  +
                          Backup procedure will not take place.  +
                          Please notify operations.')
             CHGVAR     VAR(%SST(&BUERR 1 10)) VALUE(&BULIB3)
             SNDPGMMSG  MSG(&BUERR) TOUSR(*SYSOPR) MSGTYPE(*INFO)
             RCVMSG
             GOTO ENDPGM
             ENDDO
             ENDDO
             IF         COND(&BULIB4 *NE ' ') THEN(DO)
             CHKOBJ     OBJ(&BULIB4) OBJTYPE(*LIB)
             MONMSG     MSGID(CPF0000) EXEC(DO)
             CHGVAR     VAR(&BUERR) VALUE('            not found.  +
                          Backup procedure will not take place.  +
                          Please notify operations.')
             CHGVAR     VAR(%SST(&BUERR 1 10)) VALUE(&BULIB4)
             SNDPGMMSG  MSG(&BUERR) TOUSR(*SYSOPR) MSGTYPE(*INFO)
             RCVMSG
             GOTO ENDPGM
             ENDDO
             ENDDO
             IF         COND(&BULIB5 *NE ' ') THEN(DO)
             CHKOBJ     OBJ(&BULIB5) OBJTYPE(*LIB)
             MONMSG     MSGID(CPF0000) EXEC(DO)
             CHGVAR     VAR(&BUERR) VALUE('            not found.  +
                          Backup procedure will not take place.  +
                          Please notify operations.')
             CHGVAR     VAR(%SST(&BUERR 1 10)) VALUE(&BULIB5)
             SNDPGMMSG  MSG(&BUERR) TOUSR(*SYSOPR) MSGTYPE(*INFO)
             RCVMSG
             GOTO ENDPGM
             ENDDO
             ENDDO
     /****************************************************************/
     /*   CHECK FOR THE EXISTENCE OF THE USRPRF ENTERED              */
     /****************************************************************/
             IF         COND(&BUUSER *NE ' ') THEN(DO)
             CHKOBJ     OBJ(&BUUSER) OBJTYPE(*USRPRF)
             MONMSG     MSGID(CPF0000) EXEC(DO)
             CHGVAR     VAR(&BUERR) VALUE('            not found.  +
                          Backup procedure will not take place.  +
                          Please notify operations.')
             CHGVAR     VAR(%SST(&BUERR 1 10)) VALUE(&BUUSER)
             SNDPGMMSG  MSG(&BUERR) TOUSR(*SYSOPR) MSGTYPE(*INFO)
             RCVMSG
             GOTO ENDPGM
             ENDDO
             ENDDO
     /****************************************************************/
     /*   CHECK FOR THE EXISTENCE OF THE JOBQ'S ENTERED              */
     /****************************************************************/
             IF         COND(&BUJOBQ1 *NE ' ') THEN(DO)
             CHKOBJ     OBJ(&BUJOBQ1) OBJTYPE(*JOBQ)
             MONMSG     MSGID(CPF0000) EXEC(DO)
             CHGVAR     VAR(&BUERR) VALUE('            not found.  +
                          Backup procedure will not take place.  +
                          Please notify operations.')
             CHGVAR     VAR(%SST(&BUERR 1 10)) VALUE(&BUJOBQ1)
             SNDPGMMSG  MSG(&BUERR) TOUSR(*SYSOPR) MSGTYPE(*INFO)
             RCVMSG
             GOTO ENDPGM
             ENDDO
             ENDDO
             IF         COND(&BUJOBQ2 *NE ' ') THEN(DO)
             CHKOBJ     OBJ(&BUJOBQ2) OBJTYPE(*JOBQ)
             MONMSG     MSGID(CPF0000) EXEC(DO)
             CHGVAR     VAR(&BUERR) VALUE('            not found.  +
                          Backup procedure will not take place.  +
                          Please notify operations.')
             CHGVAR     VAR(%SST(&BUERR 1 10)) VALUE(&BUJOBQ2)
             SNDPGMMSG  MSG(&BUERR) TOUSR(*SYSOPR) MSGTYPE(*INFO)
             RCVMSG
             GOTO ENDPGM
             ENDDO
             ENDDO
     /****************************************************************/
     /*   CHECK FOR THE EXISTENCE OF THE SAVE FILE LIBRARY ENTERED   */
     /****************************************************************/
             IF         COND(&BUSAVE *EQ 'D') THEN(DO)
             CHKOBJ     OBJ(&BUSAVFLIB) OBJTYPE(*LIB)
             MONMSG     MSGID(CPF0000) EXEC(DO)
             CHGVAR     VAR(&BUERR) VALUE('            not found.  +
                          Backup procedure will not take place.  +
                          Please notify operations.')
             CHGVAR     VAR(%SST(&BUERR 1 10)) VALUE(&BUSAVFLIB)
             SNDPGMMSG  MSG(&BUERR) TOUSR(*SYSOPR) MSGTYPE(*INFO)
             GOTO ENDPGM
             ENDDO
             ENDDO
     /****************************************************************/
     /*   CHECK FOR THE EXISTENCE OF THE TAPE DRIVE ENTERED          */
     /****************************************************************/
             IF         COND(&BUSAVE *EQ 'T') THEN(DO)
             CHKOBJ     OBJ(&BUMEDIUM) OBJTYPE(*DEVD)
             MONMSG     MSGID(CPF0000) EXEC(DO)
             CHGVAR     VAR(&BUERR) VALUE('            not found.  +
                          Backup procedure will not take place.  +
                          Please notify operations.')
             CHGVAR     VAR(%SST(&BUERR 1 10)) VALUE(&BUMEDIUM)
             SNDPGMMSG  MSG(&BUERR) TOUSR(*SYSOPR) MSGTYPE(*INFO)
             RCVMSG
             GOTO ENDPGM
             ENDDO
             ENDDO
     /****************************************************************/
     /*  OVERRIDE THE MENU SYSTEM FILE TO ACCESS THE CORRECT LIBRARY */
     /****************************************************************/
             IF (&BUSYSLIB *NE ' ') THEN(DO)
             CHKOBJ     OBJ(&BUSYSLIB) OBJTYPE(*LIB)
             MONMSG     MSGID(CPF0000) EXEC(DO)
             CHGVAR     VAR(&BUERR) VALUE('            NOT FOUND.  +
                         BACKUP PROCEDURE WILL NOT TAKE PLACE.  +
                         PLEASE NOTIFY OPERATIONS.')
             CHGVAR     VAR(%SST(&BUERR 1 10)) VALUE(&BUSYS1)
             SNDPGMMSG  MSG(&BUERR) TOUSR(*SYSOPR) MSGTYPE(*INFO)
             GOTO ENDPGM
             ENDDO
             OVRDBF     FILE(UTFLMSI1) TOFILE(&BUSYSLIB/UTFLMSI1)
             ENDDO
     /****************************************************************/
     /*   CHECK FOR THE EXISTENCE OF THE SYSTEMS ENTERED             */
     /****************************************************************/
             CHGVAR     VAR(&ACTION) VALUE('0')
             IF (&BUSYS1 *NE ' ') THEN(DO)
             CALL       PGM(UTCSYSENAB) PARM(&BUSYS1 &ACTION &RC)
             IF         COND(&RC *NE '00')        THEN(DO)
             CHGVAR     VAR(&BUERR) VALUE('            not found.  +
                          Backup procedure will not take place.  +
                          Please notify operations.')
             CHGVAR     VAR(%SST(&BUERR 1 10)) VALUE(&BUSYS1)
             CHGVAR     VAR(%SST(&BUERR 90 2)) VALUE(&RC)
             SNDPGMMSG  MSG(&BUERR) TOUSR(*SYSOPR) MSGTYPE(*INFO)
             GOTO ENDPGM
             ENDDO
             ENDDO
             IF (&BUSYS2 *NE ' ') THEN(DO)
             CALL       PGM(UTCSYSENAB) PARM(&BUSYS2 &ACTION &RC)
             IF         COND(&RC *NE '00')        THEN(DO)
             CHGVAR     VAR(&BUERR) VALUE('            not found.  +
                          Backup procedure will not take place.  +
                          Please notify operations.')
             CHGVAR     VAR(%SST(&BUERR 1 10)) VALUE(&BUSYS2)
             CHGVAR     VAR(%SST(&BUERR 90 2)) VALUE(&RC)
             SNDPGMMSG  MSG(&BUERR) TOUSR(*SYSOPR) MSGTYPE(*INFO)
             GOTO ENDPGM
             ENDDO
             ENDDO
             IF (&BUSYS3 *NE ' ') THEN(DO)
             CALL       PGM(UTCSYSENAB) PARM(&BUSYS3 &ACTION &RC)
             IF         COND(&RC *NE '00')        THEN(DO)
             CHGVAR     VAR(&BUERR) VALUE('            not found.  +
                          Backup procedure will not take place.  +
                          Please notify operations.')
             CHGVAR     VAR(%SST(&BUERR 1 10)) VALUE(&BUSYS3)
             CHGVAR     VAR(%SST(&BUERR 90 2)) VALUE(&RC)
             SNDPGMMSG  MSG(&BUERR) TOUSR(*SYSOPR) MSGTYPE(*INFO)
             GOTO ENDPGM
             ENDDO
             ENDDO
     /****************************************************************/
     /****************************************************************/
     /********  BEGIN BACKUP PROCEDURE  ******************************/
     /****************************************************************/
     /****************************************************************/
             CRTPF      FILE(QTEMP/UTFPWRKF) RCDLEN(132)
             MONMSG     MSGID(CPF0000)
             OVRDBF     FILE(UTFPWRKF) TOFILE(QTEMP/UTFPWRKF)

     /****************************************************************/
     /*   IF BUWARN = 'N', DO NOT WARN USERS.                        */
     /****************************************************************/
             IF         COND(&BUWARN *EQ 'N') THEN(GOTO CMDLBL(DONOW))
     /****************************************************************/
     /*     WARN USERS 5 MINUTES IN ADVANCE OF LOGOFF PROCEDURE      */
     /****************************************************************/
     /*     '0' AS THE FIRST PARM IN UTXLOGOFF MEANS "SEND WARNING"  */
     /****************************************************************/
             CALL       PGM(UTXLOGOFF) PARM('0' &BUFILE1 &BUFILE2 +
                              &BUFILE3 &BUFILE4 &BUFILE5 &BUFLIB1 +
                              &BUFLIB2 &BUFLIB3 &BUFLIB4 &BUFLIB5)
             DLYJOB     DLY(300)
DONOW:
     /****************************************************************/
     /*                DISABLE SYSTEMS                               */
     /****************************************************************/
             CHGVAR     VAR(&ACTION) VALUE('1')
             IF (&BUSYS1 *NE ' ') THEN(DO)
             CALL       PGM(UTCSYSENAB) PARM(&BUSYS1 &ACTION &RC)
             IF         COND(&RC *NE '00')        THEN(DO)
             CHGVAR     VAR(&BUERR) VALUE('Invalid System name +
                          entered -- UNABLE TO DISABLE   RC =')
             CHGVAR     VAR(%SST(&BUERR 60 2)) VALUE(&RC)
             GOTO ENDPGM
             ENDDO
             ENDDO
             IF (&BUSYS2 *NE ' ') THEN(DO)
             CALL       PGM(UTCSYSENAB) PARM(&BUSYS2 &ACTION &RC)
             IF         COND(&RC *NE '00')        THEN(DO)
             CHGVAR     VAR(&BUERR) VALUE('Invalid System name +
                          entered -- UNABLE TO DISABLE   RC =')
             CHGVAR     VAR(%SST(&BUERR 60 2)) VALUE(&RC)
             GOTO ENDPGM
             ENDDO
             ENDDO
             IF (&BUSYS3 *NE ' ') THEN(DO)
             CALL       PGM(UTCSYSENAB) PARM(&BUSYS3 &ACTION &RC)
             IF         COND(&RC *NE '00')        THEN(DO)
             CHGVAR     VAR(&BUERR) VALUE('Invalid System name +
                          entered -- UNABLE TO DISABLE   RC =')
             CHGVAR     VAR(%SST(&BUERR 60 2)) VALUE(&RC)
             GOTO ENDPGM
             ENDDO
             ENDDO
     /****************************************************************/
     /*             HOLD JOB QUEUES                                  */
     /****************************************************************/
             IF         COND(&BUJOBQ1 *NE ' ') +
                    THEN(HLDJOBQ JOBQ(&BUJOBQ1))
             IF         COND(&BUJOBQ2 *NE ' ') +
                    THEN(HLDJOBQ JOBQ(&BUJOBQ2))

     /****************************************************************/
     /*   VERIFY THAT NO BATCH JOBS ARE RUNNING FROM THIS SYSTEM     */
     /****************************************************************/
             IF         COND(&BUUSER *NE ' ') THEN(DO)
             CALL       PGM(UTXCHKUSRJ) PARM(&BUUSER &RC)
             CLRPFM     FILE(QTEMP/UTFPWRKF)
             IF         COND(&RC *NE '00') THEN(DO)

             CHGVAR     VAR(&BUERR) VALUE('Batch jobs currently +
                          running.  REPLY (C:Cancel, R:Retry)')

                    /*********************************************/
                    /*  BATCH JOBS RUNNING --  RELEASE JOB QUEUES*/
                    /*********************************************/
             IF         COND(&BUJOBQ1 *NE ' ') +
                    THEN(RLSJOBQ JOBQ(&BUJOBQ1))
             IF         COND(&BUJOBQ2 *NE ' ') +
                    THEN(RLSJOBQ JOBQ(&BUJOBQ2))

                    /*************************************************/
                    /*    BATCH JOBS RUNNING -- REENABLE SYSTEMS     */
                    /*************************************************/
             CHGVAR     VAR(&ACTION) VALUE('2')
             IF         COND(&BUSYS1 *NE ' ') THEN(CALL +
                          PGM(UTCSYSENAB) PARM(&BUSYS1 &ACTION &RC))
             IF         COND(&BUSYS2 *NE ' ') THEN(CALL +
                          PGM(UTCSYSENAB) PARM(&BUSYS2 &ACTION &RC))
             IF         COND(&BUSYS3 *NE ' ') THEN(CALL +
                          PGM(UTCSYSENAB) PARM(&BUSYS3 &ACTION &RC))
             IF         COND(&RC *NE '00')        THEN(DO)
             CHGVAR     VAR(%SST(&BUERR 31 15)) VALUE('NOT ENABLED +
                          RC=')
             CHGVAR     VAR(%SST(&BUERR 65 2)) VALUE(&RC)
             SNDPGMMSG  MSG(&BUERR)
             GOTO ENDPGM
             ENDDO
             SNDUSRMSG  MSG(&BUERR) MSGTYPE(*INQ) MSGRPY(&BUREPLY)
             IF         COND((&BUREPLY *EQ 'R') *OR (&BUREPLY *EQ +
                          'r')) THEN(DO)
             CHGVAR     VAR(&BUREPLY) VALUE(' ')
             GOTO       CMDLBL(START)
             ENDDO
             IF         COND((&BUREPLY *EQ 'C') *OR (&BUREPLY *EQ +
                          'c')) THEN(DO)
             CHGVAR     VAR(&BUREPLY) VALUE(' ')
             GOTO ENDPGM
             ENDDO
             ENDDO
             ENDDO

     /****************************************************************/
     /*               ALLOCATE &BULIB1/&BUFLIB1 IN ORDER TO KEEP     */
     /*               "HOT KEY" USERS FROM GETTING IN DURING BACKUP  */
     /****************************************************************/
ALCOBJ:      ALCOBJ     OBJ((&BUFLIB1/&BUFILE1 *FILE *EXCL))
             MONMSG     MSGID(CPF1002) EXEC(DO)
             CALL       PGM(UTXLOGOFF) PARM('1' &BUFILE1 ' ' ' ' ' ' ' ' +
                                                &BUFLIB1 ' ' ' ' ' ' ' ')
             GOTO       CMDLBL(ALCOBJ)
             ENDDO
             MONMSG     MSGID(CPF0000) EXEC(DO)
             CHGVAR     VAR(&BUERR) VALUE('CANNOT ALLOCATE #####+
                        ##### IN ##########. BACKUP NOT DONE ')
             CHGVAR     VAR(%SST(&BUERR 17 10)) VALUE(&BUFILE1)
             CHGVAR     VAR(%SST(&BUERR 31 10)) VALUE(&BUFLIB1)

                    /*********************************************/
                    /*  CANNOT ALLOCATE FILE-- RELEASE JOB QUEUES*/
                    /*********************************************/
             IF         COND(&BUJOBQ1 *NE ' ') +
                    THEN(RLSJOBQ JOBQ(&BUJOBQ1))
             IF         COND(&BUJOBQ2 *NE ' ') +
                    THEN(RLSJOBQ JOBQ(&BUJOBQ2))

                    /*************************************************/
                    /*   CANNOT ALLOCATE FILE-- REENABLE SYSTEM      */
                    /*************************************************/
             CHGVAR     VAR(&ACTION) VALUE('2')
             IF         COND(&BUSYS1 *NE ' ') THEN(CALL +
                          PGM(UTCSYSENAB) PARM(&BUSYS1 &ACTION &RC))
             IF         COND(&BUSYS2 *NE ' ') THEN(CALL +
                          PGM(UTCSYSENAB) PARM(&BUSYS2 &ACTION &RC))
             IF         COND(&BUSYS3 *NE ' ') THEN(CALL +
                          PGM(UTCSYSENAB) PARM(&BUSYS3 &ACTION &RC))
             IF         COND(&RC *NE '00')        THEN(DO)
             CHGVAR     VAR(%SST(&BUERR 50 15)) VALUE('NOT ENABLED +
                          RC=')
             CHGVAR     VAR(%SST(&BUERR 65 2)) VALUE(&RC)
             ENDDO
             SNDUSRMSG  MSG(&BUERR)
             GOTO       CMDLBL(ENDPGM)
             ENDDO
     /****************************************************************/
     /*               KICK OFF ACTIVE SYSTEM USERS                   */
     /****************************************************************/
     /*     '1' AS THE FIRST PARM IN UTXLOGOFF MEANS "LOGOFF USERS"  */
     /****************************************************************/
 LOGOFF:     CALL       PGM(UTXLOGOFF) PARM('1' &BUFILE2 &BUFILE3 +
                          &BUFILE4 &BUFILE5 ' ' &BUFLIB2 &BUFLIB3 +
                          &BUFLIB4 &BUFLIB5 ' ')

     /****************************************************************/
     /*               REORG FILES?  IF YES, CALL UTXFREORG           */
     /****************************************************************/
             IF         COND(&BUREORG *EQ 'Y') THEN(CALL +
                          PGM(UTXFREORG) PARM(&BULIB1 &BULIB2 +
                          &BULIB3 &BULIB4 &BULIB5))
     /****************************************************************/
     /* IF SAVING TO DISK,  SAVE FILES (OR LIBRARIES) TO SAVEFILES   */
     /****************************************************************/
             IF         COND(&BUSAVE *EQ 'T') THEN(GOTO +
                          CMDLBL(SAVTAP))
             CHGVAR     VAR(&BUSAVFNN) VALUE(&BUSAVF *TCAT '01')
             CLRSAVF    FILE(&BUSAVFLIB/&BUSAVFNN)
             MONMSG     MSGID(CPF0000)
             IF (&BULIB1 *NE ' ') THEN(DO)
             CHGVAR     VAR(&BUERR) VALUE('save file for backup of +
                          library ##########')
             CHGVAR     VAR(%SST(&BUERR 33 10)) VALUE(&BULIB1)
             CRTSAVF    FILE(&BUSAVFLIB/&BUSAVFNN) TEXT(&BUERR)
             MONMSG     MSGID(CPF5813 CPF7302) EXEC(CHGSAVF +
                          FILE(&BUSAVFLIB/&BUSAVFNN) TEXT(&BUERR))
             IF         COND(&BULORF *EQ 'F') THEN(DO)
             SAVOBJ     OBJ(*ALL) LIB(&BULIB1) DEV(*SAVF) +
                          OBJTYPE(*FILE) SAVF(&BUSAVFLIB/&BUSAVFNN)
             MONMSG     MSGID(CPF0000)
             ENDDO
             ELSE       CMD(DO)
             SAVLIB     LIB(&BULIB1) DEV(*SAVF) +
                          SAVF(&BUSAVFLIB/&BUSAVFNN)
             MONMSG     MSGID(CPF0000)
             ENDDO
             ENDDO
             CHGVAR     VAR(&BUSAVFNN) VALUE(&BUSAVF *TCAT '02')
             CLRSAVF    FILE(&BUSAVFLIB/&BUSAVFNN)
             MONMSG     MSGID(CPF0000)
             IF (&BULIB2 *NE ' ') THEN(DO)
             CHGVAR     VAR(&BUERR) VALUE('save file for backup of +
                          library ##########')
             CHGVAR     VAR(%SST(&BUERR 33 10)) VALUE(&BULIB2)
             CRTSAVF    FILE(&BUSAVFLIB/&BUSAVFNN) TEXT(&BUERR)
             MONMSG     MSGID(CPF5813 CPF7302) EXEC(CHGSAVF +
                          FILE(&BUSAVFLIB/&BUSAVFNN) TEXT(&BUERR))
             IF         COND(&BULORF *EQ 'F') THEN(DO)
             SAVOBJ     OBJ(*ALL) LIB(&BULIB2) DEV(*SAVF) +
                          OBJTYPE(*FILE) SAVF(&BUSAVFLIB/&BUSAVFNN)
             MONMSG     MSGID(CPF0000)
             ENDDO
             ELSE       CMD(DO)
             SAVLIB     LIB(&BULIB2) DEV(*SAVF) +
                          SAVF(&BUSAVFLIB/&BUSAVFNN)
             MONMSG     MSGID(CPF0000)
             ENDDO
             ENDDO
             CHGVAR     VAR(&BUSAVFNN) VALUE(&BUSAVF *TCAT '03')
             CLRSAVF    FILE(&BUSAVFLIB/&BUSAVFNN)
             MONMSG     MSGID(CPF0000)
             IF (&BULIB3 *NE ' ') THEN(DO)
             CHGVAR     VAR(&BUERR) VALUE('save file for backup of +
                          library ##########')
             CHGVAR     VAR(%SST(&BUERR 33 10)) VALUE(&BULIB3)
             CRTSAVF    FILE(&BUSAVFLIB/&BUSAVFNN) TEXT(&BUERR)
             MONMSG     MSGID(CPF5813 CPF7302) EXEC(CHGSAVF +
                          FILE(&BUSAVFLIB/&BUSAVFNN) TEXT(&BUERR))
             IF         COND(&BULORF *EQ 'F') THEN(DO)
             SAVOBJ     OBJ(*ALL) LIB(&BULIB3) DEV(*SAVF) +
                          OBJTYPE(*FILE) SAVF(&BUSAVFLIB/&BUSAVFNN)
             MONMSG     MSGID(CPF0000)
             ENDDO
             ELSE       CMD(DO)
             SAVLIB     LIB(&BULIB3) DEV(*SAVF) +
                          SAVF(&BUSAVFLIB/&BUSAVFNN)
             MONMSG     MSGID(CPF0000)
             ENDDO
             ENDDO
             CHGVAR     VAR(&BUSAVFNN) VALUE(&BUSAVF *TCAT '03')
             CLRSAVF    FILE(&BUSAVFLIB/&BUSAVFNN)
             MONMSG     MSGID(CPF0000)
             IF (&BULIB4 *NE ' ') THEN(DO)
             CHGVAR     VAR(&BUERR) VALUE('save file for backup of +
                          library ##########')
             CHGVAR     VAR(%SST(&BUERR 33 10)) VALUE(&BULIB4)
             CRTSAVF    FILE(&BUSAVFLIB/&BUSAVFNN) TEXT(&BUERR)
             MONMSG     MSGID(CPF5813 CPF7302) EXEC(CHGSAVF +
                          FILE(&BUSAVFLIB/&BUSAVFNN) TEXT(&BUERR))
             IF         COND(&BULORF *EQ 'F') THEN(DO)
             SAVOBJ     OBJ(*ALL) LIB(&BULIB4) DEV(*SAVF) +
                          OBJTYPE(*FILE) SAVF(&BUSAVFLIB/&BUSAVFNN)
             MONMSG     MSGID(CPF0000)
             ENDDO
             ELSE       CMD(DO)
             SAVLIB     LIB(&BULIB4) DEV(*SAVF) +
                          SAVF(&BUSAVFLIB/&BUSAVFNN)
             MONMSG     MSGID(CPF0000)
             ENDDO
             ENDDO
             CHGVAR     VAR(&BUSAVFNN) VALUE(&BUSAVF *TCAT '03')
             CLRSAVF    FILE(&BUSAVFLIB/&BUSAVFNN)
             MONMSG     MSGID(CPF0000)
             IF (&BULIB5 *NE ' ') THEN(DO)
             CHGVAR     VAR(&BUERR) VALUE('save file for backup of +
                          library ##########')
             CHGVAR     VAR(%SST(&BUERR 33 10)) VALUE(&BULIB5)
             CRTSAVF    FILE(&BUSAVFLIB/&BUSAVFNN) TEXT(&BUERR)
             MONMSG     MSGID(CPF5813 CPF7302) EXEC(CHGSAVF +
                          FILE(&BUSAVFLIB/&BUSAVFNN) TEXT(&BUERR))
             IF         COND(&BULORF *EQ 'F') THEN(DO)
             SAVOBJ     OBJ(*ALL) LIB(&BULIB5) DEV(*SAVF) +
                          OBJTYPE(*FILE) SAVF(&BUSAVFLIB/&BUSAVFNN)
             MONMSG     MSGID(CPF0000)
             ENDDO
             ELSE       CMD(DO)
             SAVLIB     LIB(&BULIB5) DEV(*SAVF) +
                          SAVF(&BUSAVFLIB/&BUSAVFNN)
             MONMSG     MSGID(CPF0000)
             ENDDO
             ENDDO
             CHGVAR     VAR(&BUSAVFNN) VALUE(&BUSAVF *TCAT '03')
             CLRSAVF    FILE(&BUSAVFLIB/&BUSAVFNN)
             MONMSG     MSGID(CPF0000)
     /****************************************************************/
     /*               SAVE THE FILES TO TAPE                         */
     /****************************************************************/
 SAVTAP:     IF         COND(&BUSAVE *NE 'T') THEN(GOTO CMDLBL(NEXT))
             CHGVAR     VAR(&BUREPLY) VALUE('G')
             IF         COND(&BUWARNOP *EQ 'Y') THEN(DO)
             CHGVAR     VAR(&BUERR) VALUE('please place +
                          PREINITIALIZED tape upon tape drive for +
                          backup.  You may initialize the tape +
                          before responding to this message.  Reply +
                          G when ready, C to cancel  (G:go, C:cancel)')
             SNDUSRMSG  MSG(&BUERR) MSGTYPE(*INQ) MSGRPY(&BUREPLY)
             IF         COND((&BUREPLY *EQ 'C') *OR (&BUREPLY *EQ +
                          'c')) THEN(DO)
             CHGVAR     VAR(&BUREPLY) VALUE(' ')
             GOTO       CMDLBL(NEXT)
             ENDDO
             ENDDO
             IF         COND((&BUREPLY *EQ 'G') *OR (&BUREPLY *EQ +
                          'g')) THEN(DO)
             CHGVAR     VAR(&BUREPLY) VALUE(' ')
             IF         COND(&BULORF *EQ 'F') THEN(DO)
             IF         COND(&BULIB5 *NE ' ') THEN(DO)
             SAVOBJ     OBJ(*ALL) LIB(&BULIB1 &BULIB2 &BULIB3 +
                          &BULIB4 &BULIB5) DEV(&BUMEDIUM) +
                          OBJTYPE(*FILE) ENDOPT(*LEAVE) CLEAR(*ALL)
             MONMSG     MSGID(CPF0000)
             GOTO       CMDLBL(NEXT)
             ENDDO
             IF         COND(&BULIB4 *NE ' ') THEN(DO)
             SAVOBJ     OBJ(*ALL) LIB(&BULIB1 &BULIB2 &BULIB3 +
                          &BULIB4) DEV(&BUMEDIUM) OBJTYPE(*FILE) +
                          ENDOPT(*LEAVE) CLEAR(*ALL)
             MONMSG     MSGID(CPF0000)
             GOTO       CMDLBL(NEXT)
             ENDDO
             IF         COND(&BULIB3 *NE ' ') THEN(DO)
             SAVOBJ     OBJ(*ALL) LIB(&BULIB1 &BULIB2 &BULIB3) +
                          DEV(&BUMEDIUM) OBJTYPE(*FILE) +
                          ENDOPT(*LEAVE) CLEAR(*ALL)
             MONMSG     MSGID(CPF0000)
             GOTO       CMDLBL(NEXT)
             ENDDO
             IF         COND(&BULIB2 *NE ' ') THEN(DO)
             SAVOBJ     OBJ(*ALL) LIB(&BULIB1 &BULIB2) DEV(&BUMEDIUM) +
                          OBJTYPE(*FILE) ENDOPT(*LEAVE) CLEAR(*ALL)
             MONMSG     MSGID(CPF0000)
             GOTO       CMDLBL(NEXT)
             ENDDO
             IF         COND(&BULIB1 *NE ' ') THEN(DO)
             SAVOBJ     OBJ(*ALL) LIB(&BULIB1) DEV(&BUMEDIUM) +
                          OBJTYPE(*FILE) ENDOPT(*LEAVE) CLEAR(*ALL)
             MONMSG     MSGID(CPF0000)
             GOTO       CMDLBL(NEXT)
             ENDDO
             ENDDO
     /****************************************************************/
     /*               SAVE THE LIBRARIES TO TAPE                     */
     /****************************************************************/
             IF         COND(&BULORF *EQ 'L') THEN(DO)
             IF         COND(&BULIB5 *NE ' ') THEN(DO)
             SAVLIB     LIB(&BULIB1 &BULIB2 &BULIB3 &BULIB4 &BULIB5) +
                          DEV(&BUMEDIUM) ENDOPT(*LEAVE) CLEAR(*ALL)
             MONMSG     MSGID(CPF0000)
             GOTO       CMDLBL(NEXT)
             ENDDO
             IF         COND(&BULIB4 *NE ' ') THEN(DO)
             SAVLIB     LIB(&BULIB1 &BULIB2 &BULIB3 &BULIB4) +
                          DEV(&BUMEDIUM) ENDOPT(*LEAVE) CLEAR(*ALL)
             MONMSG     MSGID(CPF0000)
             GOTO       CMDLBL(NEXT)
             ENDDO
             IF         COND(&BULIB3 *NE ' ') THEN(DO)
             SAVLIB     LIB(&BULIB1 &BULIB2 &BULIB3) DEV(&BUMEDIUM) +
                          ENDOPT(*LEAVE) CLEAR(*ALL)
             MONMSG     MSGID(CPF0000)
             GOTO       CMDLBL(NEXT)
             ENDDO
             IF         COND(&BULIB2 *NE ' ') THEN(DO)
             SAVLIB     LIB(&BULIB1 &BULIB2) DEV(&BUMEDIUM) +
                          ENDOPT(*LEAVE) CLEAR(*ALL)
             MONMSG     MSGID(CPF0000)
             GOTO       CMDLBL(NEXT)
             ENDDO
             IF         COND(&BULIB1 *NE ' ') THEN(DO)
             SAVLIB     LIB(&BULIB1) DEV(&BUMEDIUM) ENDOPT(*LEAVE) +
                          CLEAR(*ALL)
             MONMSG     MSGID(CPF0000)
             GOTO       CMDLBL(NEXT)
             ENDDO
             ENDDO
             ENDDO
             GOTO       CMDLBL(SAVTAP)
NEXT: /***************************************************************/
      /*           DEALLOCATE &BUFILE1                               */
      /***************************************************************/
             DLCOBJ     OBJ((&BUFLIB1/&BUFILE1 *FILE *EXCL))

     /****************************************************************/
     /*               REENABLE SYSTEM                                */
     /****************************************************************/
             CHGVAR     VAR(&ACTION) VALUE('2')
             CHGVAR     VAR(&RC)     VALUE('00')
             IF         COND(&BUSYS1 *NE ' ') THEN(CALL +
                          PGM(UTCSYSENAB) PARM(&BUSYS1 &ACTION &RC))
             IF         COND(&BUSYS2 *NE ' ') THEN(CALL +
                          PGM(UTCSYSENAB) PARM(&BUSYS2 &ACTION &RC))
             IF         COND(&BUSYS3 *NE ' ') THEN(CALL +
                          PGM(UTCSYSENAB) PARM(&BUSYS3 &ACTION &RC))
             IF         COND(&RC *NE '00')        THEN(DO)
             CHGVAR     VAR(&BUERR) VALUE('            NOT +
                          RE-ENABLED.  Please notify operations.')
             CHGVAR     VAR(%SST(&BUERR 1 10)) VALUE(&BUSYS1)
             CHGVAR     VAR(%SST(&BUERR 90 2)) VALUE(&RC)
             SNDPGMMSG  MSG(&BUERR) TOUSR(*SYSOPR) MSGTYPE(*INQ)
             RCVMSG
             GOTO ENDPGM
             ENDDO
     /****************************************************************/
     /*          RELEASE JOB QUEUES                                  */
     /****************************************************************/
             IF         COND(&BUJOBQ1 *NE ' ') +
                    THEN(RLSJOBQ JOBQ(&BUJOBQ1))
             IF         COND(&BUJOBQ2 *NE ' ') +
                    THEN(RLSJOBQ JOBQ(&BUJOBQ2))

             CHGVAR     VAR(&BUERR) VALUE('Backup Completed!!  Have +
                          a nice day!!!')
             SNDPGMMSG  MSG(&BUERR) TOUSR(*SYSOPR) MSGTYPE(*INFO)

 ENDPGM:     DSPJOBLOG  OUTPUT(*PRINT)
             ENDPGM
