//BCHJOB  JOB(MCXCDERN) JOBD(*LIBL/MCMGR) JOBQ(*JOBD) LOG(*JOBD +
             *JOBD *MSG) LOGCLPGM(*YES)
             CALL       MCDLT PARM(DCDRNRPT)
             CALL       PGM(MCXCRTFIL) PARM('*CURLIB' 'DCDRNRPT' +
                          '133' '1000' '1000' '20')
             CALL       PGM(TCODERNM)
/* PRINT THE CODE RENAME REPORT                                   */
/* OVERRIDE TO THE DESIRED REPORT FILE                            */
                 OVRDBF     FILE(MCFPRPT) TOFILE(*LIBL/DCDRNRPT)
/* SPOOL TYPE: SHOULD ALWAYS BE 'N'                               */
/*               CHGDTAARA  DTAARA(*LDA (291 1)) VALUE('N')       */
/* PRINT NUM                                                      */
                 CHGDTAARA  DTAARA(*LDA (292 3)) VALUE('006')
/* PAPER WIDTH: 'Y' IS COMPRESSED                                 */
                 CHGDTAARA  DTAARA(*LDA (295 1)) VALUE('N')
/* NUMBER OF COPIES                                               */
                 CHGDTAARA  DTAARA(*LDA (296 2)) VALUE('01')
/* RANGE OF DATES. 'Y' = BRING UP SCRN , 'N' = NO SCRN            */
                 CHGDTAARA  DTAARA(*LDA (298 1)) VALUE('N')
                 CALL TPRTRPT
//ENDBCHJOB
