             PGM        /* Run Manufacturer/Part Number Query & send +
                          to Akron */

             DCL        VAR(&QRYSLT) TYPE(*CHAR) LEN(100)
             DCL        VAR(&NEWDATE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&SYSTEM) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRINTTEXT) TYPE(*CHAR) LEN(30)
 BEGIN:

 /*  CHANGE THE JOB TO PRINT THE SYSTEM NAME ON THE REPORT         */

             RTVNETA    SYSNAME(&SYSTEM)

             CHGVAR     VAR(&PRINTTEXT) VALUE('Mnf/Part # Rpt: ' +
                          *CAT &SYSTEM)

             CHGJOB     PRTTXT(&PRINTTEXT)

 /*  OVERRIDE THE PRINT FILE TO THE CORRECT PAPER SIZE             */

             OVRPRTF    FILE(QPQUPRFIL) PAGESIZE(66 195) LPI(6) +
                          CPI(15) OVRFLW(60) OUTQ(PD01) +
                          USRDTA(MANUFRPT)
             MONMSG     MSGID(CPF0000)

 /*  GENERATE THE REPORT                                           */
             RUNQRY     QRY(MCPRD/PARTWMANUF)
             MONMSG     MSGID(CPF0000)

             RUNQRY     QRY(MCPRD/PARTWOMNF)
             MONMSG     MSGID(CPF0000)

             RUNQRY     QRY(MCPRD/MANUFRPT)
             MONMSG     MSGID(CPF0000)

 /*  SEND THE GENERATED SPOOL FILE TO AKRON60                      */

             SNDNETSPLF FILE(QPQUPRFIL) TOUSRID((PRINTIT AKRON60)) +
                          SPLNBR(*LAST) DTAFMT(*ALLDATA)
             MONMSG     MSGID(CPF0000)

 FINI:

             ENDPGM
