   PGM
             DCL        VAR(&SYSTEM) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRINTTEXT) TYPE(*CHAR) LEN(36)

   /* ESTABLISH THE PROPER OVERRIDES TO DIRECT THE QUERY REPORTS AS  */
   /* DESIRED.                                                       */
   /*  CHANGE THE JOB TO PRINT THE SYSTEM NAME ON THE REPORT         */
             RTVNETA    SYSNAME(&SYSTEM)
             CHGVAR     VAR(&PRINTTEXT) VALUE('CSIS/CSAS: ' *CAT &SYSTEM)
             CHGJOB     PRTTXT(&PRINTTEXT)

   /* OVERRIDE THE PRINT FILE TO THE CORRECT PAPER SIZE AND OUTQ     */
   /*   LENGTH X WIDTH                                               */
   /*       11 X 14 PAPER  - PAGESIZE(66 132) LPI(6) CPI(10)         */
   /*      8.5 X 14 PAPER  - PAGESIZE(68 132) LPI(8) CPI(10)         */
   /*       11 X 8.5 PAPER - PAGESIZE(66 132) LPI(6) CPI(16.7)       */
             OVRPRTF    FILE(QPQUPRFIL) PAGESIZE(66 132) LPI(6) +
                          CPI(10) OVRFLW(60) OUTQ(*LIBL/T000122) +
                          HOLD(*NO) SAVE(*YES) USRDTA(ZERODOLS)
             MONMSG     MSGID(CPF0000)

   /* RUN THE QUERY REPORT PROGRAM, AND SEND THE OUTPUT TO AKRON60.  */
             RUNQRY     QRY(ZERODOLS)
             SNDNETSPLF FILE(QPQUPRFIL) TOUSRID((T000122 AKRON60)) +
                          SPLNBR(*LAST) DTAFMT(*ALLDATA)
             MONMSG     MSGID(CPF0000)

             ENDPGM
