000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    CMANINQ.
000400 AUTHOR.        C.I.HILLES/JIM COFFMAN (MAINTAINER).
000500*INSTALLATION.  GOODYEAR TIRE & RUBBER CO.
000600*DATE-WRITTEN.  SEPTEMPER, 1987.
000700*REMARKS.
000800*D          THIS SUBPROG IS CALLED FROM MMIS PROGRAMS TO
000900*D          INQUIRE ON REQUISITION DATA.
      *C
      *C   05/05/94  JE COFFMAN  WRITTEN REQUEST 94-001/SLS REQ 6487
      *C     ADDED THE ABILITY TO ALLOW 'SS' STATUS REQUISITIONS
      *C     THAT HAVE THE AUTHORIZATION FLAG SET VIA MP1 TO BE
      *C     RETRIEVED FOR CHANGING BY OTHER PROGRAMS.
      *C
      *C   08/14/96  JEFF BUNGO
      *C     EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C     INCLUDE CENTURY FOR EXPECT DATE, REQ DATE,
      *C     DATE WANTED, AND DATE RECEIVED.  CHANGE THE
      *C     PARMS TO CMANREQ TO PASS CENTURY ON THE DATES.
      *C
      *C   11/21/96   CA YODER   REQ #96-027
      *C     ADDED CURRENCY CODE TO PARAMETERS PASSED IN
      *C     "CMANREQ" COPYLIB MEMBER.
      *C
      *C   NOV 1997   JE COFFMAN
      *C     INCORPORATED LOGIC TO RETRIEVE INVOICE COSTS
      *C     BY ITEM.
      *C
      *C   SEP 2001   BE GEISER
      *C     ADD LOGIC TO PREVENT SUB1 FROM GOING OUT OF BOUNDS.
      *C
      *C   APR 2003   BE GEISER
      *C     ADD REQ SERVICE FLAG FIELD.
      *C
001000
001100 ENVIRONMENT DIVISION.
001200 CONFIGURATION SECTION.
001300 SOURCE-COMPUTER.    HP-3000.
001400 OBJECT-COMPUTER.    HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MSTORERM
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MREQ
                  ASSIGN TO DATABASE-MCFLCS2001
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DREQD
                  ASSIGN TO DATABASE-MCFLCS2101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DREQITM
                  ASSIGN TO DATABASE-MCFLCS2201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DREQDESC
                  ASSIGN TO DATABASE-MCFLCS2301
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPOITEM
                  ASSIGN TO DATABASE-MCFLCS1002
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPORECD
                  ASSIGN TO DATABASE-MCFLCS0901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DINVRCD
                  ASSIGN TO DATABASE-MCFLCS2506
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
001500
           SELECT DINVITM
                  ASSIGN TO DATABASE-MCFLCS2601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

001600 DATA DIVISION.
       FILE SECTION.
       FD  MSTORERM
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  MREQ
           LABEL RECORDS ARE STANDARD.
       01  MREQ-REC.
           COPY DDS-MCRPCS2000  OF MCFLCS2001.

       FD  DREQD
           LABEL RECORDS ARE STANDARD.
       01  DREQD-REC.
           COPY DDS-MCRPCS2100  OF MCFLCS2101.

       FD  DREQITM
           LABEL RECORDS ARE STANDARD.
       01  DREQITM-REC.
           COPY DDS-MCRPCS2200  OF MCFLCS2201.

       FD  DREQDESC
           LABEL RECORDS ARE STANDARD.
       01  DREQDESC-REC.
           COPY DDS-MCRPCS2300  OF MCFLCS2301.

       FD  DPOITEM
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-REC.
           COPY DDS-MCRPCS1000  OF MCFLCS1002.

       FD  DPORECD
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-REC.
           COPY DDS-MCRPCS0900  OF MCFLCS0901.

       FD  DINVRCD
           LABEL RECORDS ARE STANDARD.
       01  DINVRCD-REC.
           COPY DDS-MCRPCS2500  OF MCFLCS2506.

       FD  DINVITM
           LABEL RECORDS ARE STANDARD.
       01  DINVITM-REC.
           COPY DDS-MCRPCS2600  OF MCFLCS2601.
001700
001800 WORKING-STORAGE SECTION.
001900 77  SUB1                          PIC S9(4) COMP-4 VALUE 0.
002000 01  BU-DISPLAY-FLDS.
002100     05  BU-DISPLAY-LINE OCCURS 5  TIMES.
002200         10  DISPLAY-FLD    PIC X(14).
002300         10  DISPLAY-FLD9   PIC S9(8).
002400
002500
002600**************************************************************
002700**                                                          **
002800**          S U B P R O G R A M     A R E A S               **
002900**                                                          **
003000**************************************************************
003100
003200 COPY CDESC      IN COPYLIB.
003300 COPY TUMCF      IN COPYLIB.
003500 COPY SCURCONV   IN COPYLIB.
003600
003700**************************************************************
003800**                                                          **
003900**            D A T A B A S E   W O R K                     **
004000**                                                          **
004100**************************************************************
004200
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

004300 01  DSET-NAMES.
004400     05  DSET-NAME                 PIC X(16)  VALUE SPACES.
004500     05  DSET-MSTORERM             PIC X(16)  VALUE "MSTORERM;".
004600     05  DSET-MREQ                 PIC X(16)  VALUE "MREQ;".
004700     05  DSET-DREQD                PIC X(16)  VALUE "DREQD;".
004800     05  DSET-DREQITM              PIC X(16)  VALUE "DREQITM;".
004900     05  DSET-DREQDESC             PIC X(16)  VALUE "DREQDESC;".
005000     05  DSET-DPORECD              PIC X(16)  VALUE "DPORECD;".
005100     05  DSET-DPOITEM              PIC X(16)  VALUE "DPOITEM;".
005200
005300 01  MODE-AREA.
005400     05  MODE1                  PIC S9(4)   COMP       VALUE 1.
005500     05  MODE2                  PIC S9(4)   COMP       VALUE 2.
005600     05  MODE3                  PIC S9(4)   COMP       VALUE 3.
005700     05  MODE4                  PIC S9(4)   COMP       VALUE 4.
005800     05  MODE5                  PIC S9(4)   COMP       VALUE 5.
005900     05  MODE6                  PIC S9(4)   COMP       VALUE 6.
006000     05  MODE7                  PIC S9(4)   COMP       VALUE 7.
006100
006200 01 ITEM-LISTS.
006300     05  ALL-ITEMS              PIC XX    VALUE "@;".
006400     05  REQ-SEARCH             PIC X(12) VALUE "REQ-NUMBER;".
006500     05  PO-SEARCH              PIC X(10) VALUE "PO-RCV-NO;".
006600
006700 01 ARG-VALUES.
006800     05  CODE-ARG               PIC X(8)  VALUE SPACES.
006900     05  REQ-ARG                PIC X(12) VALUE SPACES.
007000     05  PO-ARG                 PIC X(14) VALUE SPACES.
007100
007200**************************************************************
007300**                                                          **
007400**           D A T A B A S E   B U F F E R S                **
007500**                                                          **
007600**************************************************************
007700
007800 COPY MSTORERM   IN COPYLIB.
007900 COPY MREQ       IN COPYLIB.
008000 COPY DREQD      IN COPYLIB.
008100 COPY DREQITM    IN COPYLIB.
008200 COPY DREQDESC   IN COPYLIB.
008300 COPY DPOITEM    IN COPYLIB.
008400 COPY DPORECD    IN COPYLIB.
       COPY DINVRCD    IN COPYLIB.
       COPY DINVITM    IN COPYLIB.
008500
008600*************************************
008700**                                 **
008800**  L I N K A G E   S E C T I O N  **
008900**                                 **
009000*************************************
009100
009200 LINKAGE SECTION.
009300 01  BASE                          PIC X(10).
009400 COPY CMANREQ    IN COPYLIB.
009500 COPY LANGSUB    IN COPYLIB.
009600 COPY ESCNAME   IN COPYLIB.
009700 COPY DBSTAT     IN COPYLIB.
009800 01  BU-DISPLAY-MSG.
009900     05  BU-DISPLAY-MSG-1          PIC X(1).
010000     05  FILLER                    PIC X(59).
010100
010200 PROCEDURE DIVISION USING          BASE,
010300                                   CMR-CALL-MODE,
010400                                   CMR-DATA,
010500                                   CMR-DESC,
010600                                   CMR-REMARKS,
010700                                   CMR-RETURNED-DATA,
010800                                   CMR-MISC-PARMS,
010900                                   LANGUAGE-PARMS,
011000                                   ESC-NAME,
011100                                   STATUS-AREA,
011200                                   BU-DISPLAY-MSG.
011300
011400 6000-MAIN.
           MOVE SPACES TO BU-DISPLAY-MSG-1.
           MOVE 0 TO SUB1.
           OPEN INPUT MSTORERM, MREQ, DREQD, DREQITM.
           OPEN INPUT
             DREQDESC, DPOITEM, DPORECD, DINVRCD, DINVITM.
011500     MOVE "OK"                     TO   CMR-RETURN-STATUS.
011600     IF CMR-REQ-NUMBER = SPACES
011700         MOVE "NE"                 TO   CMR-RETURN-STATUS
011800         GO TO 6990-MAIN-X.
011900
012000     MOVE CMR-REQ-NUMBER           TO   REQ-ARG.
012100*    CALL "DBGET" USING BASE, DSET-MREQ, MODE7, STATUS-AREA,
012200*                       ALL-ITEMS, BUF-MREQ, REQ-ARG.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF MREQ-REC.
           READ MREQ INTO BUF-MREQ
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
012300     IF COND-WORD = 0
012400         NEXT SENTENCE
012500     ELSE
012600     IF COND-WORD = 17
012700         MOVE "NE"                 TO   CMR-RETURN-STATUS
012800         GO TO 6990-MAIN-X
012900     ELSE
013000        MOVE "CMANINQ DBFIND MREQ 6-MAIN " TO BU-DISPLAY-MSG
013100        GO TO 6990-MAIN-X.
013200
013300 6010-MOVE-MREQ-FIELDS.
013400     MOVE REQ-STAGING-AREA         TO   CMR-STAGING-AREA.
013500     MOVE REQ-FOR-DEPT             TO   CMR-FOR-DEPT.
013600     MOVE REQ-CO                   TO   CMR-COMPANY.
013700     MOVE REQ-PRIME                TO   CMR-PRIME.
013800     MOVE REQ-ADDL-INFO            TO   CMR-ADDTL-INFO.
013900     MOVE REQ-DATE-WANTED-CN       TO   CMR-DATE-REQUIRED-CN.
014000     MOVE REQ-SUB                  TO   CMR-SUB.
           MOVE REQ-AUTH-CODE-FLAG       TO   CMR-AUTH-FLAG.
           MOVE REQ-BUDGET-NO            TO   CMR-BUDNUM-NODASH.
014800     MOVE REQ-ORIGINATOR           TO   CMR-REQ-ORIG.
           MOVE REQ-DOCK-NOTIFY          TO   CMR-DOCK-NOTIFY.
           MOVE REQ-MMIS-REQ-NO          TO   CMR-MMIS-REQ-NO.
014900     IF REQ-ADDTL-DATA = SPACES
015000         MOVE SPACES               TO   CMR-EXPENSE-CLASS
015100     ELSE
015200         MOVE REQ-ADDTL-DATA       TO   CMR-EXP-CLS-6DIG
015300         MOVE "00"                 TO   CMR-EXP-CLS-2DIG.
      *    IF REQ-STATUS = "SS"
      *        IF REQ-AUTH-CODE-FLAG = "X"
      *            MOVE ZEROES           TO   CMR-EXPENSE-CLASS.
015400     MOVE REQ-STATUS               TO   CMR-REQ-STATUS.
015400     MOVE REQ-SERVICE-FLAG         TO   CMR-SERVICE-FLAG.
015500     MOVE REQ-RELEASE-STAT         TO   CMR-REQ-RELEASE-STAT.
015600     MOVE REQ-HOLD-STATUS-CODE     TO   CMR-REQ-HOLD-STATUS-CODE.
015700     MOVE REQ-HOLD-STATUS          TO   CMR-REQ-HOLD-STATUS.
015800     MOVE REQ-DATE-CN              TO   CMR-REQ-DATE-CN.
015900     IF REQ-REPAIR-INDIC = "X"
016000         MOVE "R"                  TO   CMR-REQ-TYPE
016100     ELSE
016200         MOVE "P"                  TO   CMR-REQ-TYPE.
016300
016400 6100-INQ-DREQITM-DREQDESC.
016500*    CALL "DBFIND" USING BASE, DSET-DREQITM, MODE1,
016600*      STATUS-AREA, REQ-SEARCH, REQ-ARG.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DREQITM-REC.
           MOVE SPACES TO ITEMNO OF DREQITM-REC.
           START DREQITM KEY = REQNO OF DREQITM-REC
               INVALID KEY MOVE 0 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 0 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
016700     IF COND-WORD NOT = 0
016800         MOVE "CMANINQ DBFIND ERR 6100-D" TO BU-DISPLAY-MSG
016900         GO TO 6200-INQUIRE-DREQD.
017000
017100 6110-DREQITM-LOOP.
017200*    CALL "DBGET" USING BASE, DSET-DREQITM, MODE5, STATUS-AREA,
017300*      ALL-ITEMS, BUF-DREQITM, REQ-ARG.
           MOVE 0 TO COND-WORD.
           READ DREQITM NEXT INTO BUF-DREQITM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF REQNO OF DREQITM-REC NOT = REQ-ARG
               MOVE 15 TO COND-WORD.
017400     IF COND-WORD = 15
               MOVE "NON-STR" TO CMR-CORP-CODE
               MOVE ZERO      TO CMR-QTY, CMR-EST-UNIT-PRICE
               MOVE SPACES    TO CMR-SUGGESTED-VENDOR, CMR-UM
017500         GO TO 6120-INQUIRE-DESC
017600     ELSE
017700     IF COND-WORD NOT = 0
017800         MOVE "CMANINQ DBGET ERR 6130-DDL" TO BU-DISPLAY-MSG
017900         GO TO 6990-MAIN-X.
018000
018100     MOVE REQITM-CORP-CODE         TO   CMR-CORP-CODE.
018200     MOVE REQITM-QTY-TO-ORD        TO   CMR-QTY.
018300     MOVE REQITM-UNIT-PRICE        TO   CMR-EST-UNIT-PRICE.
018400     MOVE REQITM-NOTE              TO   CMR-SUGGESTED-VENDOR.
018500     MOVE REQITM-UM                TO   CMR-UM.
           MOVE REQITM-CURRENCY          TO   CMR-CURRENCY.
           MOVE REQITM-UNIT-PRICE-CURR   TO   CMR-EST-UNIT-PRICE-CURR.
018600*---------- NOW THAT WE HAVE THE CODE, GET THE MSTORERM DATA.
018700     IF REQITM-CORP-CODE NOT = "NON-STR"
018800         MOVE REQITM-CORP-CODE     TO   CODE-ARG
018900*        CALL "DBGET" USING BASE DSET-MSTORERM MODE7 STATUS-AREA
019000*          ALL-ITEMS BUF-MSTORERM CODE-ARG
               MOVE 0 TO COND-WORD
               MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC
               READ MSTORERM INTO BUF-MSTORERM
                   INVALID KEY MOVE 17 TO COND-WORD
               END-READ
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
               IF FILE-STATUS NOT = "00"
                   MOVE 99 TO COND-WORD
               END-IF
019100         IF COND-WORD = 0
019200             MOVE STR-UM               TO   CMR-UM
                   IF STR-MKT-COST > 0
019300                 MOVE STR-MKT-COST     TO   CMR-EST-UNIT-PRICE
                   ELSE
                   NEXT SENTENCE
019400         ELSE
019500         IF COND-WORD = 17
019600             NEXT SENTENCE
019700         ELSE
019800             MOVE "DBGET ERR MSTORE 9110-MDFI" TO BU-DISPLAY-MSG
019900             GO TO 6990-MAIN-X.
020000
020100 6120-INQUIRE-DESC.
020200*---------- SPACE OUT THE DESC FIRST TO RETURN CORRECT DESC
020300     MOVE SPACES                   TO   CMR-DESC
020400     MOVE SPACES                   TO   CMR-REMARKS.
020500
020600*---------- FOR INQUIRING MODE 2, THE CALLER IS JUST INTERESTED IN
020700*---------- PRICE INFORMATION, SO WE DON'T RETURN DESCRIPTION.
020800     IF CMR-CALL-MODE = "I2"
               MOVE ZERO TO CMR-PO-QTY-ORD
                            CMR-PO-TOTAL-PRICE
                            CMR-PO-UNIT-PRICE
                            CMR-PO-QTY-DLVR
                            CMR-PO-QTY-PAID
                            CMR-INV-UNIT-PRICE
020900         GO TO 6200-INQUIRE-DREQD.
021000
021100*    CALL "DBFIND" USING BASE, DSET-DREQDESC, MODE1,
021200*      STATUS-AREA, REQ-SEARCH, REQ-ARG.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DREQDESC-REC.
           START DREQDESC KEY = REQNO OF DREQDESC-REC
               INVALID KEY MOVE 0 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 0 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
021300     IF COND-WORD NOT = 0
021400         MOVE "CMANINQ DBFIND ERR 6100-D" TO BU-DISPLAY-MSG
021500         GO TO 6990-MAIN-X.
021600
021700     MOVE 0                        TO   SUB1.
021800 6130-DREQDESC-LOOP.
021900*    CALL "DBGET" USING BASE, DSET-DREQDESC, MODE5, STATUS-AREA,
022000*      ALL-ITEMS, BUF-DREQDESC, REQ-ARG.
           MOVE 0 TO COND-WORD.
           READ DREQDESC NEXT INTO BUF-DREQDESC
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF REQNO OF DREQDESC-REC NOT = REQ-ARG
               MOVE 15 TO COND-WORD.
022100     IF COND-WORD = 15
               MOVE ZERO TO CMR-PO-QTY-ORD
                            CMR-PO-TOTAL-PRICE
                            CMR-PO-UNIT-PRICE
                            CMR-PO-QTY-DLVR
                            CMR-PO-QTY-PAID
                            CMR-INV-UNIT-PRICE
022200         GO TO 6200-INQUIRE-DREQD
022300     ELSE
022400     IF COND-WORD NOT = 0
022500         MOVE "CMANINQ DBGET ERR 6130-DDL" TO BU-DISPLAY-MSG
022600         GO TO 6990-MAIN-X.
022700
023100     IF SUB1 > 4
023200         NEXT SENTENCE
023300     ELSE
023400     IF REQDESC-LINE-NO > "00" AND REQDESC-LINE-NO < "06"
023500         ADD 1                 TO   SUB1
023600         MOVE REQDESC-DATA     TO   CMR-DESC-LINE (SUB1).
023700
023800     IF REQDESC-LINE-NO = "95"
023900         MOVE REQDESC-DATA     TO   CMR-REMARK-1
024000     ELSE
024100     IF REQDESC-LINE-NO = "96"
024200         MOVE REQDESC-DATA     TO   CMR-REMARK-2.
024300
024400     GO TO 6130-DREQDESC-LOOP.
024500
024600 6200-INQUIRE-DREQD.
024700*    CALL "DBFIND" USING BASE, DSET-DREQD, MODE1, STATUS-AREA,
024800*      REQ-SEARCH, REQ-ARG.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DREQD-REC.
           START DREQD KEY = REQNO OF DREQD-REC
               INVALID KEY MOVE 0 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 0 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
024900     IF COND-WORD NOT = 0
025000         MOVE "CMANINQ DBFIND ERR DRQD 9500-DID" TO BU-DISPLAY-MSG
025100         GO TO 6990-MAIN-X.
025200
025300*    CALL "DBGET" USING BASE, DSET-DREQD, MODE5, STATUS-AREA,
025400*      ALL-ITEMS, BUF-DREQD, REQ-ARG.
           MOVE 0 TO COND-WORD.
           READ DREQD NEXT INTO BUF-DREQD
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF REQNO OF DREQD-REC NOT = REQ-ARG
               MOVE 15 TO COND-WORD.
025500     IF COND-WORD = 15
025600         MOVE SPACES               TO   BUF-DREQD
025700     ELSE
025800     IF COND-WORD NOT = 0
025900         MOVE "CMANINQ DBGET ERR DREQD 9500-DID"
026000                                   TO   BU-DISPLAY-MSG
026100         GO TO 6990-MAIN-X
026200     ELSE
026300         MOVE DREQD-WO-NUMBER      TO   CMR-WO-NUMBER
026400         MOVE DREQD-WO-ITM-NO      TO   CMR-WO-ITEM-NUMBER
026500         MOVE DREQD-PO-RCV-NO      TO   CMR-PO-RCV-NO
026600         MOVE DREQD-VEN-CODE       TO   CMR-VEN-CODE
026700         MOVE DREQD-PO-ITM-NO      TO   CMR-PO-ITM-NO.
026800
026900 6500-GET-PO-DATA.
027100     MOVE SPACES                   TO   CMR-PO-QTY-UM.
027500     MOVE SPACES                   TO   CMR-PO-DATE-RCVD-CN.
027600     MOVE SPACES                   TO   CMR-PO-EXPECT-DATE-CN.
027700     MOVE SPACES                   TO   CMR-PO-ITM-NO.
027800
027900     IF DREQD-PO-RCV-NO = SPACES
028000         GO TO 6600-GET-DESC.
028100
028200*    CALL "DBFIND" USING BASE, DSET-DPORECD, MODE1, STATUS-AREA,
028300*      PO-SEARCH, DREQD-PO-RCV-NO.
           MOVE 0 TO COND-WORD.
           MOVE DREQD-PO-RCV-NO TO PORCVNO OF DPORECD-REC.
           START DPORECD KEY = PORCVNO OF DPORECD-REC
               INVALID KEY MOVE 0 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 0 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
028400     IF COND-WORD NOT = 0
028500         MOVE "CMANINQ DBFIND ERR 6500-GPD" TO BU-DISPLAY-MSG
028600         GO TO 6600-GET-DESC.
028700
028800*    CALL "DBGET" USING BASE, DSET-DPORECD, MODE5, STATUS-AREA,
028900*      ALL-ITEMS, BUF-DPORECD, DREQD-PO-RCV-NO.
           MOVE 0 TO COND-WORD.
           READ DPORECD NEXT INTO BUF-DPORECD
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPORECD-REC NOT = DREQD-PO-RCV-NO
               MOVE 15 TO COND-WORD.
           IF COND-WORD = 15
               GO TO 6600-GET-DESC.
029000     IF COND-WORD NOT = 0
029100         MOVE "CMANINQ DBGET ERR DPORECD 6500-GPD"
029200                                   TO   BU-DISPLAY-MSG
029300         GO TO 6600-GET-DESC.
029400
029500     MOVE PO-EXPECT-DATE-CN        TO   CMR-PO-EXPECT-DATE-CN.
029600     MOVE PO-NON-RCV-INDIC         TO   CMR-NON-RCV-INDIC.
029700
      *------ WE DON'T NEED TO DO THE DBFIND SINCE WE CAN GO DIRECTLY
      *------ TO THE PO ITEM NUMBER NEEDED.
029800*    CALL "DBFIND" USING BASE, DSET-DPOITEM, MODE1, STATUS-AREA,
029900*      PO-SEARCH, DREQD-PO-RCV-NO.
030000*    IF COND-WORD NOT = 0
030100*        MOVE "CMANINQ DBFIND ERR DPOITEM 6500-GPD"
030200*                                  TO   BU-DISPLAY-MSG
030300*        GO TO 6600-GET-DESC.
030400
030500 6510-GET-DPOITEM-LOOP.
030600*    CALL "DBGET" USING BASE, DSET-DPOITEM, MODE5, STATUS-AREA,
030700*      ALL-ITEMS, BUF-DPOITEM, DREQD-PO-RCV-NO.
           MOVE 0 TO COND-WORD.
           MOVE DREQD-PO-RCV-NO TO PORCVNO OF DPOITEM-REC.
           MOVE DREQD-PO-ITM-NO TO ITEMNO OF DPOITEM-REC.
           READ DPOITEM INTO BUF-DPOITEM
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
030800     IF COND-WORD = 17
030900         GO TO 6600-GET-DESC
031000     ELSE
031100     IF COND-WORD NOT = 0
031200         MOVE "CMANINQ DBGET ERR 6510-GDL" TO BU-DISPLAY-MSG
031300         GO TO 6600-GET-DESC.
031400
      *------ IN IBM THE PORCVNO AND ITEMNO MAKE UP THE KEY FOR
      *------ DPOITEM, SO WE CAN DIRECTLY GET THE ITEM WITHOUT LOOPING.
031500*    IF ITM-NUMBER NOT = DREQD-PO-ITM-NO
031600*        GO TO 6510-GET-DPOITEM-LOOP.
031700
031800     IF ITM-CORP-CODE = "NON-STR"
031900         MOVE ITM-UM               TO   CMR-PO-QTY-UM
032000         MOVE ITM-QTY-ORD          TO   CMR-PO-QTY-ORD
032100         MOVE ITM-UNIT-PRICE       TO   CMR-PO-UNIT-PRICE
032200         MOVE ITM-QTY-DLVR         TO   CMR-PO-QTY-DLVR
               IF ITM-QTY-PAID-X = "            "
                   MOVE ZEROES           TO   CMR-PO-QTY-PAID
                   IF PO-NON-RCV-INDIC = "X"
                       PERFORM 6700-GET-INV-UNIT-PRICE
                           THRU 6700-GIUP-X
                   ELSE
                   NEXT SENTENCE
               ELSE
               MOVE ITM-QTY-PAID         TO   CMR-PO-QTY-PAID
               MOVE ITM-UNIT-PRICE       TO   CMR-INV-UNIT-PRICE
               IF ITM-PO-NO-1 = "T"
                   PERFORM 6700-GET-INV-UNIT-PRICE THRU 6700-GIUP-X
               ELSE
               NEXT SENTENCE
032300     ELSE
032400         MOVE STR-UM               TO   CMR-PO-QTY-UM
032500         MOVE ITM-UM               TO   UMCF-SOURCE-UM
032600         MOVE ITM-QTY-ORD          TO   UMCF-SOURCE-QTY
032700         CALL "TUMCF" USING UMCF-RET-CODE, STR-UM-AREA,
032800           UMCF-QUANTITY-AREA
032900         MOVE UMCF-QTY-STR-UM-DEC  TO   CMR-PO-QTY-ORD
033000         MOVE ITM-QTY-DLVR         TO   UMCF-SOURCE-QTY
033100         CALL "TUMCF" USING UMCF-RET-CODE, STR-UM-AREA,
033200           UMCF-QUANTITY-AREA
033300         MOVE UMCF-QTY-STR-UM-DEC  TO   CMR-PO-QTY-DLVR
033400         MOVE "PR"                 TO   UMCF-RET-CODE
033500         MOVE ITM-UNIT-PRICE       TO   UMCF-SOURCE-QTY
033600         MOVE ITM-PRICE-UM         TO   UMCF-SOURCE-UM
033700         CALL "TUMCF" USING UMCF-RET-CODE, STR-UM-AREA,
033800           UMCF-QUANTITY-AREA
033900         MOVE UMCF-QTY-STR-UM-DEC  TO   CMR-PO-UNIT-PRICE
               IF ITM-QTY-PAID-X = "            "
                   MOVE ZEROES           TO   CMR-PO-QTY-PAID
               ELSE
               MOVE ITM-QTY-PAID         TO   CMR-PO-QTY-PAID
               PERFORM 6700-GET-INV-UNIT-PRICE THRU 6700-GIUP-X.
034000
034100     IF PO-CURRENCY-CODE > SPACES
034200         MOVE PO-CURRENCY-CODE     TO   SCURCONV-CUR-CODE
034300         MOVE CMR-PO-UNIT-PRICE    TO   SCURCONV-PRICE-DEC
034400         MOVE ZERO                 TO   SCURCONV-PRICE-WHL
034500         MOVE "Y"                  TO   SCURCONV-OVERRIDE-CONV-SW
034600         CALL "SCURCONV" USING BASE, SCURCONV-PARMS, STATUS-AREA,
034700           BU-DISPLAY-MSG, BU-DISPLAY-FLDS
034800         IF BU-DISPLAY-MSG-1 = SPACES
034900             MOVE SCURCONV-PRICE-DEC TO CMR-PO-UNIT-PRICE
035000         ELSE
035100             GO TO 6990-MAIN-X.
035200
035300     MULTIPLY CMR-PO-UNIT-PRICE BY CMR-PO-QTY-ORD
035400         GIVING CMR-PO-TOTAL-PRICE.
035500     MOVE ITM-DATE-RCVD-CN         TO   CMR-PO-DATE-RCVD-CN.
035600     MOVE ITM-NUMBER               TO   CMR-PO-ITM-NO.
035700
035800 6600-GET-DESC.
035900*--------*DON'T GET THE DESCRIPTION IF MODE 2 INQUIRY (PRICE ONLY)
036000     IF REQ-MAT-TYPE = "S" AND (CMR-CALL-MODE NOT = "I2")
036100         MOVE 5                TO   CDESC-LINES-TO-GET
036200         CALL "CDESC" USING CDESC-RET-CODE, BASE,
036300           STATUS-AREA, BU-DISPLAY-MSG, CODE-ARG,
036400           CDESC-DATA
036500         IF BU-DISPLAY-MSG-1 = SPACES
036600             MOVE CDESC (1)    TO   CMR-DESC-LINE (1)
036700             MOVE CDESC (2)    TO   CMR-DESC-LINE (2)
036800             MOVE CDESC (3)    TO   CMR-DESC-LINE (3)
036900             MOVE CDESC (4)    TO   CMR-DESC-LINE (4)
037000             MOVE CDESC (5)    TO   CMR-DESC-LINE (5).
           GO TO 6990-MAIN-X.
037300
       6700-GET-INV-UNIT-PRICE.
           MOVE 0 TO CMR-INV-UNIT-PRICE.
           MOVE ITM-PO-RCV-NO TO PORCVNO OF DINVRCD-REC.
           START DINVRCD KEY = PORCVNO OF DINVRCD-REC
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00" GO TO 6700-GIUP-X.
           MOVE 0 TO CMR-INV-UNIT-PRICE.
       6700-GIUP-LOOP1.
           READ DINVRCD NEXT INTO BUF-DINVRCD
               AT END    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00" GO TO 6700-GIUP-X.
           IF INV-PO-RCV-NO NOT = ITM-PO-RCV-NO
               GO TO 6700-GIUP-X.
           MOVE INV-REG-NO-9 TO REGISTERNO OF DINVITM-REC.
           MOVE ITM-NUMBER   TO ITEMNO OF DINVITM-REC.
           START DINVITM KEY = REGISTERNO OF DINVITM-REC
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00" GO TO 6700-GIUP-X.
       6700-GIUP-LOOP2.
           READ DINVITM NEXT INTO BUF-DINVITM
               AT END    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00" GO TO 6700-GIUP-X.
           IF INVITM-REG-NO NOT = INV-REG-NO-9 GO TO 6700-GIUP-LOOP1.
           IF INVITM-ITEM-NO NOT = ITM-NUMBER GO TO 6700-GIUP-LOOP2.
           IF ITM-PO-NO-1 = "T"
               ADD INVITM-INV-UPRICE TO CMR-INV-UNIT-PRICE
           ELSE
           MOVE INVITM-INV-UPRICE TO CMR-INV-UNIT-PRICE.
           GO TO 6700-GIUP-LOOP2.
       6700-GIUP-X.    EXIT.

037400 6990-MAIN-X.
           CLOSE MSTORERM, MREQ, DREQD, DREQITM, DREQDESC,
             DPOITEM, DPORECD, DINVRCD, DINVITM.
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               MOVE "NE" TO CMR-RETURN-STATUS.
037500     GOBACK.

