     F****************************************************************
     FMCFPMM1040UF A E           K DISK
     D*
     C*
     C                   read      MCRPMM1040                             99
     C*
     C                   Z-ADD     15            M40GOAL1
     C                   Z-ADD     30            M40GOAL2
     C*
     C     *IN99         IFEQ      '0'
     C                   UPDATE    MCRPMM1040
     C                   ELSE
     C                   WRITE     MCRPMM1040
     C                   END
     C*
     C                   SETON                                        LR
