     F****************************************************************
     FMCFLMM100CIF   E           K DISK
     FMCFLMM110CIF   E           K DISK
     FMCFPMM1030UF A E           K DISK
     FMCFPMM1130UF A E           K DISK
     FMCFPMM1050IF   E           K DISK
     FMCFPMM1060IF   E           K DISK
     FMCFPMM1080IF   E           K DISK
     D*
     D  CHKKEY         S              8
     D  CHKZONE        S              4
     D  CHKHOUR        S              2
     D  SHIFTKEY       S              1
     D  CONTKEY        S              1
     D XPLANT          S              8    INZ('        ')
     D*
     D CHKTIMEN        S              4  0
     D XTIME           S             12  0
     D*
     D ATIME           DS            12
     D  AAAHH                  1      2
     D  AAAMIN                 3      4
     D  AAASS                  5      6
     D  AAAMM                  7      8
     D  AAADD                  9     10
     D  AAAYY                 11     12
     D*
     D  CHKDATE        DS             8
     D  CHKCC                  1      2
     D  CHKYY                  3      4
     D  CHKMM                  5      6
     D  CHKDD                  7      8
     D*
     D CHKTIME         DS             4
     D  CHKHH                  1      2  0
     D  CHKMIN                 3      4  0
     D*
     D SHIFTSTART      DS             4
     D  STSHH                  1      2  0
     D  STSMM                  3      4  0
     D*
     D*
     C                   TIME                    XTIME
     C                   MOVE      XTIME         ATIME
     C*
     C                   MOVE      '20'          CHKCC
     C                   MOVE      AAAHH         CHKHH
     C                   MOVE      AAAMIN        CHKMIN
     C                   MOVE      AAAMM         CHKMM
     C                   MOVE      AAADD         CHKDD
     C                   MOVE      AAAYY         CHKYY
     C*
     C*
     C     KEY1030       KLIST
     C                   KFLD                    CHKKEY
     C                   KFLD                    CHKZONE
     C*
     C                   CALL      'MMXGETSYS'
     C                   PARM                    XPLANT
     C*
     C     CHKDATE       CHAIN     MCRPMM1050
     C                   IF        NOT%found(MCFPMM1050)
     C
     C
     C
     C                   END
     C*
     C                   EXSR      LOADSFT
     C*
     C                   MOVE      'Y'           CONTKEY
     C*
     C     XPLANT        IFEQ      'TOPEKA'
     C                   MOVE      'N'           CONTKEY
     C                   END
     C*
     C**************************************************************************
     C                   READ      MCRPMM1000                             99
     C*
     C     *IN99         DOWEQ     '0'
     C*
     C*
     C                   MOVE      CTPRODDATE    CHKKEY
     C                   MOVEL     ZONEPRTY      CHKZONE
     C*
     C*
     C     KEY1030       CHAIN     MCRPMM1030                         66
     C                   IF        NOT%found(MCFPMM1030)
     C                   MOVE      CHKKEY        CNTDATE
     C                   MOVE      CHKZONE       CNTZONE
     C                   Z-ADD     0             CNTRECD
     C                   Z-ADD     0             CNTSRTR
     C                   Z-ADD     0             CNTCOMP
     C                   Z-ADD     0             CNTSRTRA
     C                   Z-ADD     0             CNTCOMPA
     C                   Z-ADD     0             SFTRECD1
     C                   Z-ADD     0             SFTSRTR1
     C                   Z-ADD     0             SFTCOMP1
     C                   Z-ADD     0             SFTSRTRA1
     C                   Z-ADD     0             SFTCOMPA1
     C                   MOVE      CTSHIFT1ST    SFTSHIFT1
     C                   MOVE      CTCREW1ST     SFTCREW1
     C                   Z-ADD     0             SFTRECD2
     C                   Z-ADD     0             SFTSRTR2
     C                   Z-ADD     0             SFTCOMP2
     C                   Z-ADD     0             SFTSRTRA2
     C                   Z-ADD     0             SFTCOMPA2
     C                   MOVE      CTSHIFT2ND    SFTSHIFT2
     C                   MOVE      CTCREW2ND     SFTCREW2
     C                   Z-ADD     0             SFTRECD3
     C                   Z-ADD     0             SFTSRTR3
     C                   Z-ADD     0             SFTCOMP3
     C                   Z-ADD     0             SFTSRTRA3
     C                   Z-ADD     0             SFTCOMPA3
     C                   MOVE      CTSHIFT3RD    SFTSHIFT3
     C                   MOVE      CTCREW3RD     SFTCREW3
     C                   Z-ADD     0             SFTRECD4
     C                   Z-ADD     0             SFTSRTR4
     C                   Z-ADD     0             SFTCOMP4
     C                   Z-ADD     0             SFTSRTRA4
     C                   Z-ADD     0             SFTCOMPA4
     C                   MOVE      CTSHIFT1ST    SFTSHIFT4
     C                   Z-ADD     0             SFTRECD5
     C                   Z-ADD     0             SFTSRTR5
     C                   Z-ADD     0             SFTCOMP5
     C                   Z-ADD     0             SFTSRTRA5
     C                   Z-ADD     0             SFTCOMPA5
     C                   MOVE      CTSHIFT2ND    SFTSHIFT5
     C                   Z-ADD     0             SFTRECD6
     C                   Z-ADD     0             SFTSRTR6
     C                   Z-ADD     0             SFTCOMP6
     C                   Z-ADD     0             SFTSRTRA6
     C                   Z-ADD     0             SFTCOMPA6
     C                   MOVE      CTSHIFT3RD    SFTSHIFT6
     C                   Z-ADD     0             SFTOPEN1
     C                   Z-ADD     0             SFTOPEN2
     C                   Z-ADD     0             SFTOPEN3
     C                   Z-ADD     0             SFTOPEN4
     C                   Z-ADD     0             SFTOPEN5
     C                   Z-ADD     0             SFTOPEN6
     C                   WRITE     MCRPMM1030
     C     KEY1030       CHAIN     MCRPMM1030                         66
     C                   END
     C*
     C     CONTKEY       IFEQ      'Y'
     C     SHIFTKEY      IFEQ      '1'
     C                   ADD       1             SFTOPEN1
     C                   END
     C     SHIFTKEY      IFEQ      '2'
     C                   ADD       1             SFTOPEN2
     C                   END
     C     SHIFTKEY      IFEQ      '3'
     C                   ADD       1             SFTOPEN3
     C                   END
     C                   ELSE
     C     EQPDEPT       CHAIN     MCRPMM1080
     C                   IF        %found(MCFPMM1080)
     C     SHIFTKEY      IFEQ      '1'
     C                   ADD       1             SFTOPEN4
     C                   END
     C     SHIFTKEY      IFEQ      '2'
     C                   ADD       1             SFTOPEN5
     C                   END
     C     SHIFTKEY      IFEQ      '3'
     C                   ADD       1             SFTOPEN6
     C                   END
     C                   ELSE
     C     SHIFTKEY      IFEQ      '1'
     C                   ADD       1             SFTOPEN1
     C                   END
     C     SHIFTKEY      IFEQ      '2'
     C                   ADD       1             SFTOPEN2
     C                   END
     C     SHIFTKEY      IFEQ      '3'
     C                   ADD       1             SFTOPEN3
     C                   END
     C                   END
     C                   END
     C*
     C*
     C                   UPDATE    MCRPMM1030
     C*
     C*               UPDATE ZONE *ALL
     C*
     C                   MOVE      '*ALL'        CHKZONE
     C*
     C     KEY1030       CHAIN     MCRPMM1030                         66
     C                   IF        NOT%found(MCFPMM1030)
     C                   MOVE      CHKKEY        CNTDATE
     C                   MOVE      '*ALL'        CNTZONE
     C                   Z-ADD     0             CNTRECD
     C                   Z-ADD     0             CNTSRTR
     C                   Z-ADD     0             CNTCOMP
     C                   Z-ADD     0             CNTSRTRA
     C                   Z-ADD     0             CNTCOMPA
     C                   Z-ADD     0             SFTRECD1
     C                   Z-ADD     0             SFTSRTR1
     C                   Z-ADD     0             SFTCOMP1
     C                   Z-ADD     0             SFTSRTRA1
     C                   Z-ADD     0             SFTCOMPA1
     C                   MOVE      CTSHIFT1ST    SFTSHIFT1
     C                   MOVE      CTCREW1ST     SFTCREW1
     C                   Z-ADD     0             SFTRECD2
     C                   Z-ADD     0             SFTSRTR2
     C                   Z-ADD     0             SFTCOMP2
     C                   Z-ADD     0             SFTSRTRA2
     C                   Z-ADD     0             SFTCOMPA2
     C                   MOVE      CTSHIFT2ND    SFTSHIFT2
     C                   MOVE      CTCREW2ND     SFTCREW2
     C                   Z-ADD     0             SFTRECD3
     C                   Z-ADD     0             SFTSRTR3
     C                   Z-ADD     0             SFTCOMP3
     C                   Z-ADD     0             SFTSRTRA3
     C                   Z-ADD     0             SFTCOMPA3
     C                   MOVE      CTSHIFT3RD    SFTSHIFT3
     C                   MOVE      CTCREW3RD     SFTCREW3
     C                   Z-ADD     0             SFTRECD4
     C                   Z-ADD     0             SFTSRTR4
     C                   Z-ADD     0             SFTCOMP4
     C                   Z-ADD     0             SFTSRTRA4
     C                   Z-ADD     0             SFTCOMPA4
     C                   MOVE      CTSHIFT1ST    SFTSHIFT4
     C                   Z-ADD     0             SFTRECD5
     C                   Z-ADD     0             SFTSRTR5
     C                   Z-ADD     0             SFTCOMP5
     C                   Z-ADD     0             SFTSRTRA5
     C                   Z-ADD     0             SFTCOMPA5
     C                   MOVE      CTSHIFT2ND    SFTSHIFT5
     C                   Z-ADD     0             SFTRECD6
     C                   Z-ADD     0             SFTSRTR6
     C                   Z-ADD     0             SFTCOMP6
     C                   Z-ADD     0             SFTSRTRA6
     C                   Z-ADD     0             SFTCOMPA6
     C                   MOVE      CTSHIFT3RD    SFTSHIFT6
     C                   Z-ADD     0             SFTOPEN1
     C                   Z-ADD     0             SFTOPEN2
     C                   Z-ADD     0             SFTOPEN3
     C                   Z-ADD     0             SFTOPEN4
     C                   Z-ADD     0             SFTOPEN5
     C                   Z-ADD     0             SFTOPEN6
     C                   WRITE     MCRPMM1030
     C     KEY1030       CHAIN     MCRPMM1030                         66
     C                   END
     C*
     C     CONTKEY       IFEQ      'Y'
     C     SHIFTKEY      IFEQ      '1'
     C                   ADD       1             SFTOPEN1
     C                   END
     C     SHIFTKEY      IFEQ      '2'
     C                   ADD       1             SFTOPEN2
     C                   END
     C     SHIFTKEY      IFEQ      '3'
     C                   ADD       1             SFTOPEN3
     C                   END
     C                   ELSE
     C     EQPDEPT       CHAIN     MCRPMM1080
     C                   IF        %found(MCFPMM1080)
     C     SHIFTKEY      IFEQ      '1'
     C                   ADD       1             SFTOPEN4
     C                   END
     C     SHIFTKEY      IFEQ      '2'
     C                   ADD       1             SFTOPEN5
     C                   END
     C     SHIFTKEY      IFEQ      '3'
     C                   ADD       1             SFTOPEN6
     C                   END
     C                   ELSE
     C     SHIFTKEY      IFEQ      '1'
     C                   ADD       1             SFTOPEN1
     C                   END
     C     SHIFTKEY      IFEQ      '2'
     C                   ADD       1             SFTOPEN2
     C                   END
     C     SHIFTKEY      IFEQ      '3'
     C                   ADD       1             SFTOPEN3
     C                   END
     C                   END
     C                   END
     C*
     C                   UPDATE    MCRPMM1030
     C*
     C                   READ      MCRPMM1000                             99
     C                   END
     C*
     C**************************************************************************
     C*
     C                   READ      MCRPMM1100                             99
     C*
     C     *IN99         DOWEQ     '0'
     C*
     C*
     C                   MOVE      CTPRODDATE    CHKKEY
     C                   MOVEL     ZONEPRTY      CHKZONE
     C*
     C*
     C     KEY1030       CHAIN     MCRPMM1130                         66
     C                   IF        NOT%found(MCFPMM1130)
     C                   MOVE      CHKKEY        CNTDATE
     C                   MOVE      CHKZONE       CNTZONE
     C                   Z-ADD     0             CNTRECD
     C                   Z-ADD     0             CNTSCHD
     C                   Z-ADD     0             CNTSRTR
     C                   Z-ADD     0             CNTCOMP
     C                   Z-ADD     0             CNTSRTRA
     C                   Z-ADD     0             CNTCOMPA
     C                   Z-ADD     0             SFTOPEN1
     C                   Z-ADD     0             SFTRECD1
     C                   Z-ADD     0             SFTSCHD1
     C                   Z-ADD     0             SFTSRTR1
     C                   Z-ADD     0             SFTCOMP1
     C                   Z-ADD     0             SFTSRTRA1
     C                   Z-ADD     0             SFTCOMPA1
     C                   MOVE      CTSHIFT1ST    SFTSHIFT1
     C                   MOVE      CTCREW1ST     SFTCREW1
     C                   Z-ADD     0             SFTOPEN2
     C                   Z-ADD     0             SFTRECD2
     C                   Z-ADD     0             SFTSCHD2
     C                   Z-ADD     0             SFTSRTR2
     C                   Z-ADD     0             SFTCOMP2
     C                   Z-ADD     0             SFTSRTRA2
     C                   Z-ADD     0             SFTCOMPA2
     C                   MOVE      CTSHIFT2ND    SFTSHIFT2
     C                   MOVE      CTCREW2ND     SFTCREW2
     C                   Z-ADD     0             SFTOPEN3
     C                   Z-ADD     0             SFTRECD3
     C                   Z-ADD     0             SFTSCHD3
     C                   Z-ADD     0             SFTSRTR3
     C                   Z-ADD     0             SFTCOMP3
     C                   Z-ADD     0             SFTSRTRA3
     C                   Z-ADD     0             SFTCOMPA3
     C                   MOVE      CTSHIFT3RD    SFTSHIFT3
     C                   MOVE      CTCREW3RD     SFTCREW3
     C                   Z-ADD     0             SFTOPEN4
     C                   Z-ADD     0             SFTRECD4
     C                   Z-ADD     0             SFTSCHD4
     C                   Z-ADD     0             SFTSRTR4
     C                   Z-ADD     0             SFTCOMP4
     C                   Z-ADD     0             SFTSRTRA4
     C                   Z-ADD     0             SFTCOMPA4
     C                   MOVE      CTSHIFT1ST    SFTSHIFT4
     C                   Z-ADD     0             SFTOPEN5
     C                   Z-ADD     0             SFTRECD5
     C                   Z-ADD     0             SFTSCHD5
     C                   Z-ADD     0             SFTSRTR5
     C                   Z-ADD     0             SFTCOMP5
     C                   Z-ADD     0             SFTSRTRA5
     C                   Z-ADD     0             SFTCOMPA5
     C                   MOVE      CTSHIFT2ND    SFTSHIFT5
     C                   Z-ADD     0             SFTOPEN6
     C                   Z-ADD     0             SFTRECD6
     C                   Z-ADD     0             SFTSCHD6
     C                   Z-ADD     0             SFTSRTR6
     C                   Z-ADD     0             SFTCOMP6
     C                   Z-ADD     0             SFTSRTRA6
     C                   Z-ADD     0             SFTCOMPA6
     C                   MOVE      CTSHIFT3RD    SFTSHIFT6
     C                   WRITE     MCRPMM1130
     C     KEY1030       CHAIN     MCRPMM1130                         66
     C                   END
     C*
     C     CONTKEY       IFEQ      'Y'
     C     SHIFTKEY      IFEQ      '1'
     C                   ADD       1             SFTOPEN1
     C                   END
     C     SHIFTKEY      IFEQ      '2'
     C                   ADD       1             SFTOPEN2
     C                   END
     C     SHIFTKEY      IFEQ      '3'
     C                   ADD       1             SFTOPEN3
     C                   END
     C                   ELSE
     C     EQPDEPT       CHAIN     MCRPMM1080
     C                   IF        %found(MCFPMM1080)
     C     SHIFTKEY      IFEQ      '1'
     C                   ADD       1             SFTOPEN4
     C                   END
     C     SHIFTKEY      IFEQ      '2'
     C                   ADD       1             SFTOPEN5
     C                   END
     C     SHIFTKEY      IFEQ      '3'
     C                   ADD       1             SFTOPEN6
     C                   END
     C                   ELSE
     C     SHIFTKEY      IFEQ      '1'
     C                   ADD       1             SFTOPEN1
     C                   END
     C     SHIFTKEY      IFEQ      '2'
     C                   ADD       1             SFTOPEN2
     C                   END
     C     SHIFTKEY      IFEQ      '3'
     C                   ADD       1             SFTOPEN3
     C                   END
     C                   END
     C                   END
     C*
     C*
     C                   UPDATE    MCRPMM1130
     C*
     C*               UPDATE ZONE *ALL
     C*
     C                   MOVE      '*ALL'        CHKZONE
     C*
     C     KEY1030       CHAIN     MCRPMM1130                         66
     C                   IF        NOT%found(MCFPMM1130)
     C                   MOVE      CHKKEY        CNTDATE
     C                   MOVE      '*ALL'        CNTZONE
     C                   Z-ADD     0             CNTRECD
     C                   Z-ADD     0             CNTSCHD
     C                   Z-ADD     0             CNTSRTR
     C                   Z-ADD     0             CNTCOMP
     C                   Z-ADD     0             CNTSRTRA
     C                   Z-ADD     0             CNTCOMPA
     C                   Z-ADD     0             SFTOPEN1
     C                   Z-ADD     0             SFTRECD1
     C                   Z-ADD     0             SFTSCHD1
     C                   Z-ADD     0             SFTSRTR1
     C                   Z-ADD     0             SFTCOMP1
     C                   Z-ADD     0             SFTSRTRA1
     C                   Z-ADD     0             SFTCOMPA1
     C                   MOVE      CTSHIFT1ST    SFTSHIFT1
     C                   MOVE      CTCREW1ST     SFTCREW1
     C                   Z-ADD     0             SFTOPEN2
     C                   Z-ADD     0             SFTRECD2
     C                   Z-ADD     0             SFTSCHD2
     C                   Z-ADD     0             SFTSRTR2
     C                   Z-ADD     0             SFTCOMP2
     C                   Z-ADD     0             SFTSRTRA2
     C                   Z-ADD     0             SFTCOMPA2
     C                   MOVE      CTSHIFT2ND    SFTSHIFT2
     C                   MOVE      CTCREW2ND     SFTCREW2
     C                   Z-ADD     0             SFTOPEN3
     C                   Z-ADD     0             SFTRECD3
     C                   Z-ADD     0             SFTSCHD3
     C                   Z-ADD     0             SFTSRTR3
     C                   Z-ADD     0             SFTCOMP3
     C                   Z-ADD     0             SFTSRTRA3
     C                   Z-ADD     0             SFTCOMPA3
     C                   MOVE      CTSHIFT3RD    SFTSHIFT3
     C                   MOVE      CTCREW3RD     SFTCREW3
     C                   Z-ADD     0             SFTOPEN4
     C                   Z-ADD     0             SFTRECD4
     C                   Z-ADD     0             SFTSCHD4
     C                   Z-ADD     0             SFTSRTR4
     C                   Z-ADD     0             SFTCOMP4
     C                   Z-ADD     0             SFTSRTRA4
     C                   Z-ADD     0             SFTCOMPA4
     C                   MOVE      CTSHIFT1ST    SFTSHIFT4
     C                   Z-ADD     0             SFTOPEN5
     C                   Z-ADD     0             SFTRECD5
     C                   Z-ADD     0             SFTSCHD5
     C                   Z-ADD     0             SFTSRTR5
     C                   Z-ADD     0             SFTCOMP5
     C                   Z-ADD     0             SFTSRTRA5
     C                   Z-ADD     0             SFTCOMPA5
     C                   MOVE      CTSHIFT2ND    SFTSHIFT5
     C                   Z-ADD     0             SFTOPEN6
     C                   Z-ADD     0             SFTRECD6
     C                   Z-ADD     0             SFTSCHD6
     C                   Z-ADD     0             SFTSRTR6
     C                   Z-ADD     0             SFTCOMP6
     C                   Z-ADD     0             SFTSRTRA6
     C                   Z-ADD     0             SFTCOMPA6
     C                   MOVE      CTSHIFT3RD    SFTSHIFT6
     C                   WRITE     MCRPMM1130
     C     KEY1030       CHAIN     MCRPMM1130                         66
     C                   END
     C*
     C     CONTKEY       IFEQ      'Y'
     C     SHIFTKEY      IFEQ      '1'
     C                   ADD       1             SFTOPEN1
     C                   END
     C     SHIFTKEY      IFEQ      '2'
     C                   ADD       1             SFTOPEN2
     C                   END
     C     SHIFTKEY      IFEQ      '3'
     C                   ADD       1             SFTOPEN3
     C                   END
     C                   ELSE
     C     EQPDEPT       CHAIN     MCRPMM1080
     C                   IF        %found(MCFPMM1080)
     C     SHIFTKEY      IFEQ      '1'
     C                   ADD       1             SFTOPEN4
     C                   END
     C     SHIFTKEY      IFEQ      '2'
     C                   ADD       1             SFTOPEN5
     C                   END
     C     SHIFTKEY      IFEQ      '3'
     C                   ADD       1             SFTOPEN6
     C                   END
     C                   ELSE
     C     SHIFTKEY      IFEQ      '1'
     C                   ADD       1             SFTOPEN1
     C                   END
     C     SHIFTKEY      IFEQ      '2'
     C                   ADD       1             SFTOPEN2
     C                   END
     C     SHIFTKEY      IFEQ      '3'
     C                   ADD       1             SFTOPEN3
     C                   END
     C                   END
     C                   END
     C*
     C                   UPDATE    MCRPMM1130
     C*
     C                   READ      MCRPMM1100                             99
     C                   END
     C*
     C**************************************************************************
     C*
     C                   SETON                                        LR
     C/EJECT
     C*
     C     LOADSFT       BEGSR
     C*
     C                   CLOSE     MCFPMM1060
     C                   OPEN      MCFPMM1060
     C                   READ      MCRPMM1060                             44
     C*
     C     XPLANT        IFEQ      'ASHEBORO'
     C                   EXSR      ASHE
     C                   GOTO      LOADEND
     C                   END
     C*
     C*
     C     *IN44         DOWEQ     '0'
     C*
     C                   MOVE      CHKTIME       CHKTIMEN
     C     CHKDATE       IFGE      CT60DATE
     C     CHKTIMEN      IFGE      CT60START
     C                   READ      MCRPMM1050
     C                   GOTO      GOON
     C                   ELSE
     C                   GOTO      GOON
     C                   END
     C                   END
     C*
     C*
     C                   READ      MCRPMM1060                             44
     C*
     C*
     C                   END
     C*
     C     GOON          TAG
     C*
     C     CTNUMSHIFT    IFEQ      2
     c*
     C     CHKTIMEN      IFGE      CTSTART1ST
     C     CHKTIMEN      ORLT      CTSTART2ND
     C                   MOVE      '1'           SHIFTKEY
     C                   ELSE
     C                   MOVE      '2'           SHIFTKEY
     C                   END
     C*
     C                   END
     C*
     C     CTNUMSHIFT    IFEQ      3
     C*
     C     CHKTIMEN      IFGE      CTSTART1ST
     C     CHKTIMEN      ORLT      CTSTART2ND
     C                   MOVE      '1'           SHIFTKEY
     C*
     C                   ELSE
     C*
     C*
     C     CHKTIMEN      IFGE      CTSTART2ND
     C     CHKTIMEN      ANDLT     CTSTART3RD
     C                   MOVE      '2'           SHIFTKEY
     C                   ELSE
     C                   MOVE      '3'           SHIFTKEY
     C                   END
     C                   END
     C                   END
     C*
     C
     C     LOADEND       TAG
     C
     C                   ENDSR
     C/EJECT
     C     ASHE          BEGSR
     C*
     C                   MOVE      CHKTIME       CHKTIMEN
     C     CHKDATE       IFGE      CT60DATE
     C     CHKTIMEN      IFLT      CT60START
     C                   READP     MCRPMM1050
     C                   GOTO      GOON1
     C                   ELSE
     C                   GOTO      GOON1
     C                   END
     C                   END
     C*
     C*
     C     GOON1         TAG
     C*
     c*
     C     CHKTIMEN      IFGE      CTSTART1ST
     C     CHKTIMEN      ANDLE     CTSTART2ND
     C                   MOVE      '1'           SHIFTKEY
     C                   ELSE
     C                   MOVE      '2'           SHIFTKEY
     C                   END
     C*
     C                   ENDSR
