     F****************************************************************
     FMCFLMM1011UF   E           K DISK
     FMCFLMM1020UF A E           K DISK
     FMCFLMM100JIF   E           K DISK
     D*
     D  XZONE          S              4
     D  XEQPNUM        S              6
     D  XFAILCODE      S              6
     D  XEQPTYPE       S              8
     D  XDAYS          S              5  0
     D  XYEARS         S              5  0
     D  XCHKFAIL       S              4
     D*
     D JUL1            DS             7
     D  YEAR1                  1      4  0
     D  DAY1                   5      7  0
     D*
     D JUL2            DS             7
     D  YEAR2                  1      4  0
     D  DAY2                   5      7  0
     D*
     C*
     C*
     C     KEY1020       KLIST
     C                   KFLD                    XZONE
     C                   KFLD                    XEQPNUM
     C                   KFLD                    XFAILCODE
     C*
     C                   read      MCRPMM1010                             99
     C     *IN99         DOWEQ     '0'
     C*
     C     MXTIMECOMP    IFEQ      *BLANK
     C                   GOTO      NEXT1010
     C                   END
     C*
     C     MM1030C       IFNE      'Y'
     C                   GOTO      NEXT1010
     C                   END
     C*
     C     MMWONUM       CHAIN     MCRPMM1000
     C                   IF        NOT%found(MCFLMM100J)
     C                   GOTO      NEXT1010
     C                   END
     C*
     C     MXPRTY        IFNE      '1 '
     C                   MOVE      'Y'           MM1020
     C                   UPDATE    MCRPMM1010
     C                   GOTO      NEXT1010
     C                   END
     C*
     C                   MOVE      FAILCODE      XCHKFAIL
     C*
     C     FAILCODE      IFEQ      '000000'
     C     FAILCODE      OREQ      '      '
     C                   MOVE      'Y'           MM1020
     C                   UPDATE    MCRPMM1010
     C                   GOTO      NEXT1010
     C                   END
     C*
     C     MMWRENCH      IFLT      2
     C                   MOVE      'Y'           MM1020
     C                   UPDATE    MCRPMM1010
     C                   GOTO      NEXT1010
     C                   END
     C*
     C*
     C                   MOVE      MXZONE        XZONE
     C                   MOVE      EQPNUM        XEQPNUM
     C                   MOVE      EQPTYPE       XEQPTYPE
     C                   MOVE      FAILCODE      XFAILCODE
     C*
     C*
     C     KEY1020       CHAIN     MCRPMM1020                         66
     C                   IF        NOT%found(MCFLMM1020)
     C                   MOVE      XZONE         MZONE
     C                   MOVE      XEQPNUM       MEQPNUM
     C                   MOVE      XEQPTYPE      MEQPTYPE
     C                   MOVE      XFAILCODE     MFAILCODE
     C                   Z-ADD     0             MMNUMFAILS
     C                   MOVE      *BLANK        MDATEFAIL1
     C                   MOVE      *BLANK        MWORKORDR1
     C                   Z-ADD     0             MMTTR1
     C                   Z-ADD     0             MMTTF1
     C                   MOVE      *BLANK        MDATEFAIL2
     C                   MOVE      *BLANK        MWORKORDR2
     C                   Z-ADD     0             MMTTR2
     C                   Z-ADD     0             MMTTF2
     C                   MOVE      *BLANK        MDATEFAIL3
     C                   MOVE      *BLANK        MWORKORDR3
     C                   Z-ADD     0             MMTTR3
     C                   Z-ADD     0             MMTTF3
     C                   MOVE      *BLANK        MDATEFAIL4
     C                   MOVE      *BLANK        MWORKORDR4
     C                   Z-ADD     0             MMTTR4
     C                   Z-ADD     0             MMTTF4
     C                   MOVE      *BLANK        MDATEFAIL5
     C                   MOVE      *BLANK        MWORKORDR5
     C                   Z-ADD     0             MMTTR5
     C                   Z-ADD     0             MMTTF5
     C                   WRITE     MCRPMM1020
     C     KEY1020       CHAIN     MCRPMM1020                         66
     C                   END
     C*
     C     MDATEFAIL1    IFEQ      MXDATERECD
     C                   MOVE      'Y'           MM1020
     C                   UPDATE    MCRPMM1010
     C                   GOTO      NEXT1010
     C                   END
     C*
     C                   MOVE      MDATEFAIL4    MDATEFAIL5
     C                   MOVE      MWORKORDR4    MWORKORDR5
     C                   Z-ADD     MMTTR4        MMTTR5
     C                   Z-ADD     MMTTF4        MMTTF5
     C*
     C                   MOVE      MDATEFAIL3    MDATEFAIL4
     C                   MOVE      MWORKORDR3    MWORKORDR4
     C                   Z-ADD     MMTTR3        MMTTR4
     C                   Z-ADD     MMTTF3        MMTTF4
     C*
     C                   MOVE      MDATEFAIL2    MDATEFAIL3
     C                   MOVE      MWORKORDR2    MWORKORDR3
     C                   Z-ADD     MMTTR2        MMTTR3
     C                   Z-ADD     MMTTF2        MMTTF3
     C*
     C                   MOVE      MDATEFAIL1    MDATEFAIL2
     C                   MOVE      MWORKORDR1    MWORKORDR2
     C                   Z-ADD     MMTTR1        MMTTR2
     C                   Z-ADD     MMTTF1        MMTTF2
     C*
     C                   MOVE      MXDATERECD    MDATEFAIL1
     C                   MOVE      MMWONUM       MWORKORDR1
     C                   Z-ADD     MMTOTAL       MMTTR1
     C*
     C                   ADD       1             MMNUMFAILS
     C*
     C     MMNUMFAILS    IFGT      1
     C                   EXSR      MTTF
     C                   END
     C*
     C                   MOVE      'Y'           MM1020
     C*
     C                   UPDATE    MCRPMM1020
     C                   UPDATE    MCRPMM1010
     C*
     C     NEXT1010      TAG
     C                   READ      MCRPMM1010                             99
     C                   END
     C*
     C                   SETON                                        LR
     C/EJECT
     C     MTTF          BEGSR
     C*
     C                   CALL      'MMXDATEJUL'
     C                   PARM                    MDATEFAIL1
     C                   PARM                    JUL1
     C*
     C                   CALL      'MMXDATEJUL'
     C                   PARM                    MDATEFAIL2
     C                   PARM                    JUL2
     C*
     C     DAY1          IFLT      DAY2
     C                   ADD       365           DAY1
     C                   SUB       1             YEAR1
     C                   END
     C*
     C     DAY1          SUB       DAY2          XDAYS
     C     YEAR1         SUB       YEAR2         XYEARS
     C*
     C                   EVAL      MMTTF1 = (365 * XYEARS) + XDAYS
     C*
     C                   ENDSR
