     F****************************************************************
     FMCFLMM1001IF   E           K DISK
     FMCFPMM1070IF   E           K DISK
     FMCFLMM1010UF A E           K DISK
     D*
     D HOLDWO          S             10
     C*
     C     *ENTRY        PLIST
     C                   PARM                    HOLDWO
     C*
     C     HOLDWO        CHAIN     MCRPMM1000
     C                   IF        %found(MCFLMM1001)
     C     DATERECD      IFLT      '20070101'
     C                   GOTO      ENDIT
     C                   ENDIF
     C     WONUM         CHAIN     MCRPMM1010
     C                   IF        NOT%found(MCFLMM1010)
     C                   MOVE      WONUM         MMWONUM
     C                   MOVE      DATERECD      MXDATERECD
     C                   MOVE      TIMERECD      MXTIMERECD
     C                   MOVE      DATESTRT      MXDATESTRT
     C                   MOVE      TIMESTRT      MXTIMESTRT
     C                   MOVE      DATECOMP      MXDATECOMP
     C                   MOVE      TIMECOMP      MXTIMECOMP
     C                   MOVEL     ZONEPRTY      MXZONE
     C                   MOVE      ZONEPRTY      MXPRTY
     C                   MOVE      *BLANK        MMPRODDTRC
     C                   Z-ADD     0             MMMODRECD
     C                   MOVE      *BLANK        MMSHFTRC
     C                   MOVE      *BLANK        MMCREWRC
     C                   MOVE      *BLANK        MMPRODSTRT
     C                   Z-ADD     0             MMMODSTRT
     C                   MOVE      *BLANK        MMSHFTSTRT
     C                   MOVE      *BLANK        MMCREWSTRT
     C                   MOVE      *BLANK        MMPRODCOMP
     C                   Z-ADD     0             MMMODCOMP
     C                   MOVE      *BLANK        MMSHFTCOMP
     C                   MOVE      *BLANK        MMCREWCOMP
     C                   Z-ADD     0             MMRESPONSE
     C                   Z-ADD     0             MMWRENCH
     C                   Z-ADD     0             MMTOTAL
     C                   MOVE      'N'           MM1020
     C                   MOVE      'N'           MM1030A
     C                   MOVE      'N'           MM1030B
     C                   MOVE      'N'           MM1030C
     C                   MOVE      'N'           MMEXCLUDE
     C     MXZONE        CHAIN     MCRPMM1070
     C                   IF        %found(MCFPMM1070)
     C                   MOVE      'Y'           MMEXCLUDE
     C                   END
     C     MXDATECOMP    IFNE      '        '
     C     MXDATESTRT    ANDEQ     '        '
     C                   MOVE      MXTIMECOMP    MXTIMESTRT
     C                   MOVE      MXDATECOMP    MXDATESTRT
     C                   END
     C                   WRITE     MCRPMM1010
     C**************     ELSE
     C**************     MOVE      DATERECD      MXDATERECD
     C**************     MOVE      TIMERECD      MXTIMERECD
     C**************     MOVE      DATESTRT      MXDATESTRT
     C**************     MOVE      TIMESTRT      MXTIMESTRT
     C**************     MOVE      DATECOMP      MXDATECOMP
     C**************     MOVE      TIMECOMP      MXTIMECOMP
     C**************     MOVEL     ZONEPRTY      MXZONE
     C**************     MOVE      ZONEPRTY      MXPRTY
     C**************     MOVE      'N'           MM1020
     C**************     MOVE      'N'           MM1030A
     C**************     MOVE      'N'           MM1030B
     C**************     MOVE      'N'           MM1030C
     C**** MXTIMECOMP    IFNE      '    '
     C**** MXTIMESTRT    ANDEQ     '    '
     C**************     MOVE      MXTIMECOMP    MXTIMESTRT
     C**************     MOVE      MXDATECOMP    MXDATESTRT
     C**************     END
     C**************     UPDATE    MCRPMM1010
     C                   END
     C
     C                   END
     C     ENDIT         TAG
     C                   SETON                                        LR
