     F****************************************************************
     FMCFLMM1101IF   E           K DISK
     FMCFLMM1111UF   E           K DISK
     FMCFLMM1112UF   E           K DISK
     FMCFLMM1113UF   E           K DISK
     FMCFLMM1114UF   E           K DISK
     FMCFPMM1130UF A E           K DISK
     FMCFPMM1050IF   E           K DISK
     FMCFPMM1060IF   E           K DISK
     FMCFPMM1080IF   E           K DISK
     FMCFLMM1301IF   E           K DISK
     D*
     D  CHKKEY         S              8
     D  CHKDATE        S              8
     D  CHKZONE        S              4
     D  CHKHOUR        S              2
     D  MOD            S              4
     D  TIMEFLAG       S              1
     D  SHIFTKEY       S              1
     D  CONTKEY        S              1
     D  HOLDIT         S              7  0
     D  CNT1           S              1  0
     D  CNT2           S              1  0
     D  CNT3           S              1  0
     D  CNT4           S              1  0
     D  NHOUR          S              2  0
     D  AHOUR          S              2
     D CALCMOD         S              5S 0
     D ALPHAMOD        S              5
     D XPLANT          S              8    INZ('        ')
     D*
     D OFFSET          S              4  0
     D ADDIN           S              4  0
     D PRODMOD         S              4
     D CHKTIMEN        S              4  0
     D*
     D CHKTIME         DS             4
     D  CHKHH                  1      2  0
     D  CHKMM                  3      4  0
     D*
     D SHIFTSTART      DS             4
     D  STSHH                  1      2  0
     D  STSMM                  3      4  0
     D*
     D XXRHOURS        DS             4
     D  LBHRS                  1      2  0
     D  LBMIN                  3      3  0
     D  DUNNY                  4      4
     D*
     D ZZRHOURS        DS             4
     D  Z1                     1      1
     D  Z2                     2      2
     D  Z3                     3      3
     D  Z4                     4      4
     D*
     C*
     C*
     C     KEY1130       KLIST
     C                   KFLD                    CHKKEY
     C                   KFLD                    CHKZONE
     C*
     C                   CALL      'MMXGETSYS'
     C                   PARM                    XPLANT
     C*
     C**************************************************************************
     C*
     C                   read      MCRLMM1112                             99
     C     *IN99         DOWEQ     '0'
     C*
     C     MMWONUM       CHAIN     MCRPMM1100
     C                   MOVE      DATESTRT      MXDATESTRT
     C                   MOVE      TIMESTRT      MXTIMESTRT
     C                   MOVE      DATECOMP      MXDATECOMP
     C                   MOVE      TIMECOMP      MXTIMECOMP
     C     DATESCHD      IFNE      '        '
     C     TIMESCHD      ANDEQ     '    '
     C                   MOVE      '0000'        TIMESCHD
     C                   END
     C                   MOVE      DATESCHD      MXDATESCHD
     C                   MOVE      TIMESCHD      MXTIMESCHD
     C     MXDATECOMP    IFNE      '        '
     C     MXDATESTRT    ANDEQ     '        '
     C                   MOVE      MXTIMECOMP    MXTIMESTRT
     C                   MOVE      MXDATECOMP    MXDATESTRT
     C                   END
     C     MXTIMECOMP    IFNE      '    '
     C     MXTIMESTRT    ANDEQ     '    '
     C                   MOVE      MXTIMECOMP    MXTIMESTRT
     C                   MOVE      MXDATECOMP    MXDATESTRT
     C                   END
     C*
     C     MXDATERECD    CHAIN     MCRPMM1050
     C                   IF        NOT%found(MCFPMM1050)
     C
     C
     C
     C                   END
     C*
     C                   MOVE      '1'           TIMEFLAG
     C                   EXSR      LOADSFT
     C                   MOVE      CTPRODDATE    MMPRODDTRC
     C                   MOVE      PRODMOD       MMMODRECD
     C*
     C                   MOVE      CTPRODDATE    CHKKEY
     C                   MOVE      MXZONE        CHKZONE
     C*
     C                   MOVE      MXDATERECD    CHKDATE
     C                   MOVEL     MXTIMERECD    CHKHOUR
     C     CALCMOD       DIV       60            NHOUR
     C                   MOVE      NHOUR         AHOUR
     C*
     C*
     C     KEY1130       CHAIN     MCRPMM1130                         66
     C                   IF        NOT%found(MCFPMM1130)
     C                   MOVE      CHKKEY        CNTDATE
     C                   MOVE      CHKZONE       CNTZONE
     C                   Z-ADD     0             CNTRECD
     C                   Z-ADD     0             CNTSCHD
     C                   Z-ADD     0             CNTSRTR
     C                   Z-ADD     0             CNTCOMP
     C                   Z-ADD     0             CNTSRTRA
     C                   Z-ADD     0             CNTCOMPA
     C                   Z-ADD     0             SFTOPEN1
     C                   Z-ADD     0             SFTRECD1
     C                   Z-ADD     0             SFTSCHD1
     C                   Z-ADD     0             SFTSRTR1
     C                   Z-ADD     0             SFTCOMP1
     C                   Z-ADD     0             SFTSRTRA1
     C                   Z-ADD     0             SFTCOMPA1
     C                   MOVE      CTSHIFT1ST    SFTSHIFT1
     C                   MOVE      CTCREW1ST     SFTCREW1
     C                   Z-ADD     0             SFTOPEN2
     C                   Z-ADD     0             SFTRECD2
     C                   Z-ADD     0             SFTSCHD2
     C                   Z-ADD     0             SFTSRTR2
     C                   Z-ADD     0             SFTCOMP2
     C                   Z-ADD     0             SFTSRTRA2
     C                   Z-ADD     0             SFTCOMPA2
     C                   MOVE      CTSHIFT2ND    SFTSHIFT2
     C                   MOVE      CTCREW2ND     SFTCREW2
     C                   Z-ADD     0             SFTOPEN3
     C                   Z-ADD     0             SFTRECD3
     C                   Z-ADD     0             SFTSCHD3
     C                   Z-ADD     0             SFTSRTR3
     C                   Z-ADD     0             SFTCOMP3
     C                   Z-ADD     0             SFTSRTRA3
     C                   Z-ADD     0             SFTCOMPA3
     C                   MOVE      CTSHIFT3RD    SFTSHIFT3
     C                   MOVE      CTCREW3RD     SFTCREW3
     C                   Z-ADD     0             SFTOPEN4
     C                   Z-ADD     0             SFTRECD4
     C                   Z-ADD     0             SFTSCHD4
     C                   Z-ADD     0             SFTSRTR4
     C                   Z-ADD     0             SFTCOMP4
     C                   Z-ADD     0             SFTSRTRA4
     C                   Z-ADD     0             SFTCOMPA4
     C                   MOVE      CTSHIFT1ST    SFTSHIFT4
     C                   Z-ADD     0             SFTOPEN5
     C                   Z-ADD     0             SFTRECD5
     C                   Z-ADD     0             SFTSCHD5
     C                   Z-ADD     0             SFTSRTR5
     C                   Z-ADD     0             SFTCOMP5
     C                   Z-ADD     0             SFTSRTRA5
     C                   Z-ADD     0             SFTCOMPA5
     C                   MOVE      CTSHIFT2ND    SFTSHIFT5
     C                   Z-ADD     0             SFTOPEN6
     C                   Z-ADD     0             SFTRECD6
     C                   Z-ADD     0             SFTSCHD6
     C                   Z-ADD     0             SFTSRTR6
     C                   Z-ADD     0             SFTCOMP6
     C                   Z-ADD     0             SFTSRTRA6
     C                   Z-ADD     0             SFTCOMPA6
     C                   MOVE      CTSHIFT3RD    SFTSHIFT6
     C                   WRITE     MCRPMM1130
     C     KEY1130       CHAIN     MCRPMM1130                         66
     C                   END
     C*
     C                   ADD       1             CNTRECD
     C*
     C     SHIFTKEY      IFEQ      '1'
     C     CONTKEY       IFEQ      'Y'
     C                   ADD       1             SFTRECD1
     C                   MOVE      CTSHIFT1ST    MMSHFTRC
     C                   MOVE      CTCREW1ST     MMCREWRC
     C                   ELSE
     C                   ADD       1             SFTRECD4
     C                   MOVE      CTSHIFT1ST    MMSHFTRC
     C                   MOVE      ' '           MMCREWRC
     C                   END
     C                   END
     C*
     C     SHIFTKEY      IFEQ      '2'
     C     CONTKEY       IFEQ      'Y'
     C                   ADD       1             SFTRECD2
     C                   MOVE      CTSHIFT2ND    MMSHFTRC
     C                   MOVE      CTCREW2ND     MMCREWRC
     C                   ELSE
     C                   ADD       1             SFTRECD5
     C                   MOVE      CTSHIFT2ND    MMSHFTRC
     C                   MOVE      ' '           MMCREWRC
     C                   END
     C                   END
     C*
     C     SHIFTKEY      IFEQ      '3'
     C     CONTKEY       IFEQ      'Y'
     C                   ADD       1             SFTRECD3
     C                   MOVE      CTSHIFT3RD    MMSHFTRC
     C                   MOVE      CTCREW3RD     MMCREWRC
     C                   ELSE
     C                   ADD       1             SFTRECD6
     C                   MOVE      CTSHIFT3RD    MMSHFTRC
     C                   MOVE      ' '           MMCREWRC
     C                   END
     C                   END
     C*
     C                   MOVE      'Y'           MM1130A
     C*
     C                   UPDATE    MCRPMM1130
     C*
     C*               UPDATE ZONE *ALL
     C*
     C                   MOVE      '*ALL'        CHKZONE
     C*
     C     KEY1130       CHAIN     MCRPMM1130                         66
     C                   IF        NOT%found(MCFPMM1130)
     C                   MOVE      CHKKEY        CNTDATE
     C                   MOVE      '*ALL'        CNTZONE
     C                   Z-ADD     0             CNTRECD
     C                   Z-ADD     0             CNTSCHD
     C                   Z-ADD     0             CNTSRTR
     C                   Z-ADD     0             CNTCOMP
     C                   Z-ADD     0             CNTSRTRA
     C                   Z-ADD     0             CNTCOMPA
     C                   Z-ADD     0             SFTOPEN1
     C                   Z-ADD     0             SFTRECD1
     C                   Z-ADD     0             SFTSCHD1
     C                   Z-ADD     0             SFTSRTR1
     C                   Z-ADD     0             SFTCOMP1
     C                   Z-ADD     0             SFTSRTRA1
     C                   Z-ADD     0             SFTCOMPA1
     C                   MOVE      CTSHIFT1ST    SFTSHIFT1
     C                   MOVE      CTCREW1ST     SFTCREW1
     C                   Z-ADD     0             SFTOPEN2
     C                   Z-ADD     0             SFTRECD2
     C                   Z-ADD     0             SFTSCHD2
     C                   Z-ADD     0             SFTSRTR2
     C                   Z-ADD     0             SFTCOMP2
     C                   Z-ADD     0             SFTSRTRA2
     C                   Z-ADD     0             SFTCOMPA2
     C                   MOVE      CTSHIFT2ND    SFTSHIFT2
     C                   MOVE      CTCREW2ND     SFTCREW2
     C                   Z-ADD     0             SFTOPEN3
     C                   Z-ADD     0             SFTRECD3
     C                   Z-ADD     0             SFTSCHD3
     C                   Z-ADD     0             SFTSRTR3
     C                   Z-ADD     0             SFTCOMP3
     C                   Z-ADD     0             SFTSRTRA3
     C                   Z-ADD     0             SFTCOMPA3
     C                   MOVE      CTSHIFT3RD    SFTSHIFT3
     C                   MOVE      CTCREW3RD     SFTCREW3
     C                   Z-ADD     0             SFTOPEN4
     C                   Z-ADD     0             SFTRECD4
     C                   Z-ADD     0             SFTSCHD4
     C                   Z-ADD     0             SFTSRTR4
     C                   Z-ADD     0             SFTCOMP4
     C                   Z-ADD     0             SFTSRTRA4
     C                   Z-ADD     0             SFTCOMPA4
     C                   MOVE      CTSHIFT1ST    SFTSHIFT4
     C                   Z-ADD     0             SFTOPEN5
     C                   Z-ADD     0             SFTRECD5
     C                   Z-ADD     0             SFTSCHD5
     C                   Z-ADD     0             SFTSRTR5
     C                   Z-ADD     0             SFTCOMP5
     C                   Z-ADD     0             SFTSRTRA5
     C                   Z-ADD     0             SFTCOMPA5
     C                   MOVE      CTSHIFT2ND    SFTSHIFT5
     C                   Z-ADD     0             SFTOPEN6
     C                   Z-ADD     0             SFTRECD6
     C                   Z-ADD     0             SFTSCHD6
     C                   Z-ADD     0             SFTSRTR6
     C                   Z-ADD     0             SFTCOMP6
     C                   Z-ADD     0             SFTSRTRA6
     C                   Z-ADD     0             SFTCOMPA6
     C                   MOVE      CTSHIFT3RD    SFTSHIFT6
     C                   WRITE     MCRPMM1130
     C     KEY1130       CHAIN     MCRPMM1130                         66
     C                   END
     C*
     C                   ADD       1             CNTRECD
     C*
     C     SHIFTKEY      IFEQ      '1'
     C     CONTKEY       IFEQ      'Y'
     C                   ADD       1             SFTRECD1
     C                   ELSE
     C                   ADD       1             SFTRECD4
     C                   END
     C                   END
     C*
     C     SHIFTKEY      IFEQ      '2'
     C     CONTKEY       IFEQ      'Y'
     C                   ADD       1             SFTRECD2
     C                   ELSE
     C                   ADD       1             SFTRECD5
     C                   END
     C                   END
     C*
     C     SHIFTKEY      IFEQ      '3'
     C     CONTKEY       IFEQ      'Y'
     C                   ADD       1             SFTRECD3
     C                   ELSE
     C                   ADD       1             SFTRECD6
     C                   END
     C                   END
     C*
     C                   UPDATE    MCRPMM1130
     C*****
     C****
     C                   UPDATE    MCRLMM1112
     C*
     C     NEXT12        TAG
     C                   read      MCRLMM1112                             99
     C                   END
     C*
     C**************************************************************************
     C*
     C*
     C                   read      MCRPMM1110                             99
     C     *IN99         DOWEQ     '0'
     C*
     C     MMWONUM       CHAIN     MCRPMM1100
     C                   MOVE      DATESTRT      MXDATESTRT
     C                   MOVE      TIMESTRT      MXTIMESTRT
     C                   MOVE      DATECOMP      MXDATECOMP
     C                   MOVE      TIMECOMP      MXTIMECOMP
     C     DATESCHD      IFNE      '        '
     C     TIMESCHD      ANDEQ     '    '
     C                   MOVE      '0000'        TIMESCHD
     C                   END
     C                   MOVE      DATESCHD      MXDATESCHD
     C                   MOVE      TIMESCHD      MXTIMESCHD
     C     MXDATECOMP    IFNE      '        '
     C     MXDATESTRT    ANDEQ     '        '
     C                   MOVE      MXTIMECOMP    MXTIMESTRT
     C                   MOVE      MXDATECOMP    MXDATESTRT
     C                   END
     C     MXTIMECOMP    IFNE      '    '
     C     MXTIMESTRT    ANDEQ     '    '
     C                   MOVE      MXTIMECOMP    MXTIMESTRT
     C                   MOVE      MXDATECOMP    MXDATESTRT
     C                   END
     C*
     C     MXDATESCHD    IFEQ      '        '
     C                   GOTO      NEXT11
     C                   END
     C*
     C     MXDATESCHD    CHAIN     MCRPMM1050
     C                   IF        NOT%found(MCFPMM1050)
     C
     C
     C
     C                   END
     C*
     C                   MOVE      '4'           TIMEFLAG
     C                   EXSR      LOADSFT
     C                   MOVE      CTPRODDATE    MMPRODDTSD
     C                   MOVE      PRODMOD       MMMODSCHD
     C*
     C                   MOVE      CTPRODDATE    CHKKEY
     C                   MOVE      MXZONE        CHKZONE
     C*
     C                   MOVE      MXDATESCHD    CHKDATE
     C                   MOVEL     MXTIMESCHD    CHKHOUR
     C     CALCMOD       DIV       60            NHOUR
     C                   MOVE      NHOUR         AHOUR
     C*
     C*
     C     KEY1130       CHAIN     MCRPMM1130                         66
     C                   IF        NOT%found(MCFPMM1130)
     C                   MOVE      CHKKEY        CNTDATE
     C                   MOVE      CHKZONE       CNTZONE
     C                   Z-ADD     0             CNTRECD
     C                   Z-ADD     0             CNTSCHD
     C                   Z-ADD     0             CNTSRTR
     C                   Z-ADD     0             CNTCOMP
     C                   Z-ADD     0             CNTSRTRA
     C                   Z-ADD     0             CNTCOMPA
     C                   Z-ADD     0             SFTOPEN1
     C                   Z-ADD     0             SFTRECD1
     C                   Z-ADD     0             SFTSCHD1
     C                   Z-ADD     0             SFTSRTR1
     C                   Z-ADD     0             SFTCOMP1
     C                   Z-ADD     0             SFTSRTRA1
     C                   Z-ADD     0             SFTCOMPA1
     C                   MOVE      CTSHIFT1ST    SFTSHIFT1
     C                   MOVE      CTCREW1ST     SFTCREW1
     C                   Z-ADD     0             SFTOPEN2
     C                   Z-ADD     0             SFTRECD2
     C                   Z-ADD     0             SFTSCHD2
     C                   Z-ADD     0             SFTSRTR2
     C                   Z-ADD     0             SFTCOMP2
     C                   Z-ADD     0             SFTSRTRA2
     C                   Z-ADD     0             SFTCOMPA2
     C                   MOVE      CTSHIFT2ND    SFTSHIFT2
     C                   MOVE      CTCREW2ND     SFTCREW2
     C                   Z-ADD     0             SFTOPEN3
     C                   Z-ADD     0             SFTRECD3
     C                   Z-ADD     0             SFTSCHD3
     C                   Z-ADD     0             SFTSRTR3
     C                   Z-ADD     0             SFTCOMP3
     C                   Z-ADD     0             SFTSRTRA3
     C                   Z-ADD     0             SFTCOMPA3
     C                   MOVE      CTSHIFT3RD    SFTSHIFT3
     C                   MOVE      CTCREW3RD     SFTCREW3
     C                   Z-ADD     0             SFTOPEN4
     C                   Z-ADD     0             SFTRECD4
     C                   Z-ADD     0             SFTSCHD4
     C                   Z-ADD     0             SFTSRTR4
     C                   Z-ADD     0             SFTCOMP4
     C                   Z-ADD     0             SFTSRTRA4
     C                   Z-ADD     0             SFTCOMPA4
     C                   MOVE      CTSHIFT1ST    SFTSHIFT4
     C                   Z-ADD     0             SFTOPEN5
     C                   Z-ADD     0             SFTRECD5
     C                   Z-ADD     0             SFTSCHD5
     C                   Z-ADD     0             SFTSRTR5
     C                   Z-ADD     0             SFTCOMP5
     C                   Z-ADD     0             SFTSRTRA5
     C                   Z-ADD     0             SFTCOMPA5
     C                   MOVE      CTSHIFT2ND    SFTSHIFT5
     C                   Z-ADD     0             SFTOPEN6
     C                   Z-ADD     0             SFTRECD6
     C                   Z-ADD     0             SFTSCHD6
     C                   Z-ADD     0             SFTSRTR6
     C                   Z-ADD     0             SFTCOMP6
     C                   Z-ADD     0             SFTSRTRA6
     C                   Z-ADD     0             SFTCOMPA6
     C                   MOVE      CTSHIFT3RD    SFTSHIFT6
     C                   WRITE     MCRPMM1130
     C     KEY1130       CHAIN     MCRPMM1130                         66
     C                   END
     C*
     C                   ADD       1             CNTSCHD
     C*
     C     SHIFTKEY      IFEQ      '1'
     C     CONTKEY       IFEQ      'Y'
     C                   ADD       1             SFTSCHD1
     C                   MOVE      CTSHIFT1ST    MMSHFTSD
     C                   MOVE      CTCREW1ST     MMCREWSD
     C                   ELSE
     C                   ADD       1             SFTSCHD4
     C                   MOVE      CTSHIFT1ST    MMSHFTSD
     C                   MOVE      ' '           MMCREWSD
     C                   END
     C                   END
     C*
     C     SHIFTKEY      IFEQ      '2'
     C     CONTKEY       IFEQ      'Y'
     C                   ADD       1             SFTSCHD2
     C                   MOVE      CTSHIFT2ND    MMSHFTSD
     C                   MOVE      CTCREW2ND     MMCREWSD
     C                   ELSE
     C                   ADD       1             SFTSCHD5
     C                   MOVE      CTSHIFT2ND    MMSHFTSD
     C                   MOVE      ' '           MMCREWSD
     C                   END
     C                   END
     C*
     C     SHIFTKEY      IFEQ      '3'
     C     CONTKEY       IFEQ      'Y'
     C                   ADD       1             SFTSCHD3
     C                   MOVE      CTSHIFT3RD    MMSHFTSD
     C                   MOVE      CTCREW3RD     MMCREWSD
     C                   ELSE
     C                   ADD       1             SFTSCHD6
     C                   MOVE      CTSHIFT3RD    MMSHFTSD
     C                   MOVE      ' '           MMCREWSD
     C                   END
     C                   END
     C*
     C                   MOVE      'Y'           MM1130
     C*
     C                   UPDATE    MCRPMM1130
     C*
     C*               UPDATE ZONE *ALL
     C*
     C                   MOVE      '*ALL'        CHKZONE
     C*
     C     KEY1130       CHAIN     MCRPMM1130                         66
     C                   IF        NOT%found(MCFPMM1130)
     C                   MOVE      CHKKEY        CNTDATE
     C                   MOVE      '*ALL'        CNTZONE
     C                   Z-ADD     0             CNTRECD
     C                   Z-ADD     0             CNTSCHD
     C                   Z-ADD     0             CNTSRTR
     C                   Z-ADD     0             CNTCOMP
     C                   Z-ADD     0             CNTSRTRA
     C                   Z-ADD     0             CNTCOMPA
     C                   Z-ADD     0             SFTOPEN1
     C                   Z-ADD     0             SFTRECD1
     C                   Z-ADD     0             SFTSCHD1
     C                   Z-ADD     0             SFTSRTR1
     C                   Z-ADD     0             SFTCOMP1
     C                   Z-ADD     0             SFTSRTRA1
     C                   Z-ADD     0             SFTCOMPA1
     C                   MOVE      CTSHIFT1ST    SFTSHIFT1
     C                   MOVE      CTCREW1ST     SFTCREW1
     C                   Z-ADD     0             SFTOPEN2
     C                   Z-ADD     0             SFTRECD2
     C                   Z-ADD     0             SFTSCHD2
     C                   Z-ADD     0             SFTSRTR2
     C                   Z-ADD     0             SFTCOMP2
     C                   Z-ADD     0             SFTSRTRA2
     C                   Z-ADD     0             SFTCOMPA2
     C                   MOVE      CTSHIFT2ND    SFTSHIFT2
     C                   MOVE      CTCREW2ND     SFTCREW2
     C                   Z-ADD     0             SFTOPEN3
     C                   Z-ADD     0             SFTRECD3
     C                   Z-ADD     0             SFTSCHD3
     C                   Z-ADD     0             SFTSRTR3
     C                   Z-ADD     0             SFTCOMP3
     C                   Z-ADD     0             SFTSRTRA3
     C                   Z-ADD     0             SFTCOMPA3
     C                   MOVE      CTSHIFT3RD    SFTSHIFT3
     C                   MOVE      CTCREW3RD     SFTCREW3
     C                   Z-ADD     0             SFTOPEN4
     C                   Z-ADD     0             SFTRECD4
     C                   Z-ADD     0             SFTSCHD4
     C                   Z-ADD     0             SFTSRTR4
     C                   Z-ADD     0             SFTCOMP4
     C                   Z-ADD     0             SFTSRTRA4
     C                   Z-ADD     0             SFTCOMPA4
     C                   MOVE      CTSHIFT1ST    SFTSHIFT4
     C                   Z-ADD     0             SFTOPEN5
     C                   Z-ADD     0             SFTRECD5
     C                   Z-ADD     0             SFTSCHD5
     C                   Z-ADD     0             SFTSRTR5
     C                   Z-ADD     0             SFTCOMP5
     C                   Z-ADD     0             SFTSRTRA5
     C                   Z-ADD     0             SFTCOMPA5
     C                   MOVE      CTSHIFT2ND    SFTSHIFT5
     C                   Z-ADD     0             SFTOPEN6
     C                   Z-ADD     0             SFTRECD6
     C                   Z-ADD     0             SFTSCHD6
     C                   Z-ADD     0             SFTSRTR6
     C                   Z-ADD     0             SFTCOMP6
     C                   Z-ADD     0             SFTSRTRA6
     C                   Z-ADD     0             SFTCOMPA6
     C                   MOVE      CTSHIFT3RD    SFTSHIFT6
     C                   WRITE     MCRPMM1130
     C     KEY1130       CHAIN     MCRPMM1130                         66
     C                   END
     C*
     C                   ADD       1             CNTSCHD
     C*
     C     SHIFTKEY      IFEQ      '1'
     C     CONTKEY       IFEQ      'Y'
     C                   ADD       1             SFTSCHD1
     C                   ELSE
     C                   ADD       1             SFTSCHD4
     C                   END
     C                   END
     C*
     C     SHIFTKEY      IFEQ      '2'
     C     CONTKEY       IFEQ      'Y'
     C                   ADD       1             SFTSCHD2
     C                   ELSE
     C                   ADD       1             SFTSCHD5
     C                   END
     C                   END
     C*
     C     SHIFTKEY      IFEQ      '3'
     C     CONTKEY       IFEQ      'Y'
     C                   ADD       1             SFTSCHD3
     C                   ELSE
     C                   ADD       1             SFTSCHD6
     C                   END
     C                   END
     C*
     C                   UPDATE    MCRPMM1130
     C*****
     C****
     C                   UPDATE    MCRPMM1110
     C*
     C     NEXT11        TAG
     C                   read      MCRPMM1110                             99
     C                   END
     C*
     C**************************************************************************
     C                   read      MCRLMM1113                             99
     C     *IN99         DOWEQ     '0'
     C*
     C     MMWONUM       CHAIN     MCRPMM1100
     C                   MOVE      DATESTRT      MXDATESTRT
     C                   MOVE      TIMESTRT      MXTIMESTRT
     C                   MOVE      DATECOMP      MXDATECOMP
     C                   MOVE      TIMECOMP      MXTIMECOMP
     C     DATESCHD      IFNE      '        '
     C     TIMESCHD      ANDEQ     '    '
     C                   MOVE      '0000'        TIMESCHD
     C                   END
     C                   MOVE      DATESCHD      MXDATESCHD
     C                   MOVE      TIMESCHD      MXTIMESCHD
     C     MXDATECOMP    IFNE      '        '
     C     MXDATESTRT    ANDEQ     '        '
     C                   MOVE      MXTIMECOMP    MXTIMESTRT
     C                   MOVE      MXDATECOMP    MXDATESTRT
     C                   END
     C     MXTIMECOMP    IFNE      '    '
     C     MXTIMESTRT    ANDEQ     '    '
     C                   MOVE      MXTIMECOMP    MXTIMESTRT
     C                   MOVE      MXDATECOMP    MXDATESTRT
     C                   END
     C*
     C*
     C     MXDATESTRT    IFEQ      '        '
     C     MXTIMESTRT    OREQ      '    '
     C                   GOTO      NEXT13
     C                   END
     C*
     C     MM1130B       IFEQ      ' '
     C                   MOVE      'N'           MM1130B
     C                   UPDATE    MCRLMM1113
     C                   GOTO      NEXT13
     C                   END
     C*
     C     MXDATESTRT    CHAIN     MCRPMM1050
     C                   IF        NOT%found(MCFPMM1050)
     C
     C
     C
     C                   END
     C*
     C                   MOVE      '2'           TIMEFLAG
     C                   EXSR      LOADSFT
     C                   MOVE      CTPRODDATE    MMPRODSTRT
     C                   MOVE      PRODMOD       MMMODSTRT
     C*
     C                   MOVE      CTPRODDATE    CHKKEY
     C                   MOVE      MXZONE        CHKZONE
     C*
     C                   MOVE      MXDATESTRT    CHKDATE
     C                   MOVEL     MXTIMESTRT    CHKHOUR
     C     CALCMOD       DIV       60            NHOUR
     C                   MOVE      NHOUR         AHOUR
     C*
     C     MMPRODSTRT    IFEQ      MMPRODDTRC
     C                   Z-ADD     1             CNT1
     C                   Z-ADD     1             CNT2
     C                   ELSE
     C                   Z-ADD     0             CNT1
     C                   Z-ADD     1             CNT2
     C                   END
     C*
     C     KEY1130       CHAIN     MCRPMM1130                         66
     C                   IF        NOT%found(MCFPMM1130)
     C                   MOVE      CHKKEY        CNTDATE
     C                   MOVE      CHKZONE       CNTZONE
     C                   Z-ADD     0             CNTRECD
     C                   Z-ADD     0             CNTSRTR
     C                   Z-ADD     0             CNTCOMP
     C                   Z-ADD     0             CNTSRTRA
     C                   Z-ADD     0             CNTCOMPA
     C                   Z-ADD     0             SFTRECD1
     C                   Z-ADD     0             SFTSRTR1
     C                   Z-ADD     0             SFTCOMP1
     C                   Z-ADD     0             SFTSRTRA1
     C                   Z-ADD     0             SFTCOMPA1
     C                   MOVE      CTSHIFT1ST    SFTSHIFT1
     C                   MOVE      CTCREW1ST     SFTCREW1
     C                   Z-ADD     0             SFTRECD2
     C                   Z-ADD     0             SFTSRTR2
     C                   Z-ADD     0             SFTCOMP2
     C                   Z-ADD     0             SFTSRTRA2
     C                   Z-ADD     0             SFTCOMPA2
     C                   MOVE      CTSHIFT2ND    SFTSHIFT2
     C                   MOVE      CTCREW2ND     SFTCREW2
     C                   Z-ADD     0             SFTRECD3
     C                   Z-ADD     0             SFTSRTR3
     C                   Z-ADD     0             SFTCOMP3
     C                   Z-ADD     0             SFTSRTRA3
     C                   Z-ADD     0             SFTCOMPA3
     C                   MOVE      CTSHIFT3RD    SFTSHIFT3
     C                   MOVE      CTCREW3RD     SFTCREW3
     C                   Z-ADD     0             SFTRECD4
     C                   Z-ADD     0             SFTSRTR4
     C                   Z-ADD     0             SFTCOMP4
     C                   Z-ADD     0             SFTSRTRA4
     C                   Z-ADD     0             SFTCOMPA4
     C                   MOVE      CTSHIFT1ST    SFTSHIFT4
     C                   Z-ADD     0             SFTRECD5
     C                   Z-ADD     0             SFTSRTR5
     C                   Z-ADD     0             SFTCOMP5
     C                   Z-ADD     0             SFTSRTRA5
     C                   Z-ADD     0             SFTCOMPA5
     C                   MOVE      CTSHIFT2ND    SFTSHIFT5
     C                   Z-ADD     0             SFTRECD6
     C                   Z-ADD     0             SFTSRTR6
     C                   Z-ADD     0             SFTCOMP6
     C                   Z-ADD     0             SFTSRTRA6
     C                   Z-ADD     0             SFTCOMPA6
     C                   MOVE      CTSHIFT3RD    SFTSHIFT6
     C                   Z-ADD     0             SFTOPEN1
     C                   Z-ADD     0             SFTOPEN2
     C                   Z-ADD     0             SFTOPEN3
     C                   Z-ADD     0             SFTOPEN4
     C                   Z-ADD     0             SFTOPEN5
     C                   Z-ADD     0             SFTOPEN6
     C                   WRITE     MCRPMM1130
     C     KEY1130       CHAIN     MCRPMM1130                         66
     C                   END
     C*
     C                   ADD       CNT1          CNTSRTR
     C                   ADD       CNT2          CNTSRTRA
     C*
     C                   Z-ADD     CNT1          CNT3
     C                   Z-ADD     CNT2          CNT4
     C*
     C     SHIFTKEY      IFEQ      '1'
     C     CONTKEY       IFEQ      'Y'
     C                   ADD       CNT3          SFTSRTR1
     C                   ADD       CNT4          SFTSRTRA1
     C                   MOVE      CTSHIFT1ST    MMSHFTSTRT
     C                   MOVE      CTCREW1ST     MMCREWSTRT
     C                   ELSE
     C                   ADD       CNT3          SFTSRTR4
     C                   ADD       CNT4          SFTSRTRA4
     C                   MOVE      CTSHIFT1ST    MMSHFTSTRT
     C                   MOVE      ' '           MMCREWSTRT
     C                   END
     C                   END
     C*
     C     SHIFTKEY      IFEQ      '2'
     C     CONTKEY       IFEQ      'Y'
     C                   ADD       CNT3          SFTSRTR2
     C                   ADD       CNT4          SFTSRTRA2
     C                   MOVE      CTSHIFT2ND    MMSHFTSTRT
     C                   MOVE      CTCREW2ND     MMCREWSTRT
     C                   ELSE
     C                   ADD       CNT3          SFTSRTR5
     C                   ADD       CNT4          SFTSRTRA5
     C                   MOVE      CTSHIFT2ND    MMSHFTSTRT
     C                   MOVE      ' '           MMCREWSTRT
     C                   END
     C                   END
     C*
     C     SHIFTKEY      IFEQ      '3'
     C     CONTKEY       IFEQ      'Y'
     C                   ADD       CNT3          SFTSRTR3
     C                   ADD       CNT4          SFTSRTRA3
     C                   MOVE      CTSHIFT3RD    MMSHFTSTRT
     C                   MOVE      CTCREW3RD     MMCREWSTRT
     C                   ELSE
     C                   ADD       CNT3          SFTSRTR6
     C                   ADD       CNT4          SFTSRTRA6
     C                   MOVE      CTSHIFT3RD    MMSHFTSTRT
     C                   MOVE      ' '           MMCREWSTRT
     C                   END
     C                   END
     C*
     C                   MOVE      'Y'           MM1130B
     C*
     C                   UPDATE    MCRPMM1130
     C*
     C                   MOVE      '*ALL'        CHKZONE
     C*
     C     KEY1130       CHAIN     MCRPMM1130                         66
     C                   IF        NOT%found(MCFPMM1130)
     C                   MOVE      CHKKEY        CNTDATE
     C                   MOVE      CHKZONE       CNTZONE
     C                   Z-ADD     0             CNTRECD
     C                   Z-ADD     0             CNTSRTR
     C                   Z-ADD     0             CNTCOMP
     C                   Z-ADD     0             CNTSRTRA
     C                   Z-ADD     0             CNTCOMPA
     C                   Z-ADD     0             SFTRECD1
     C                   Z-ADD     0             SFTSRTR1
     C                   Z-ADD     0             SFTCOMP1
     C                   Z-ADD     0             SFTSRTRA1
     C                   Z-ADD     0             SFTCOMPA1
     C                   MOVE      CTSHIFT1ST    SFTSHIFT1
     C                   MOVE      CTCREW1ST     SFTCREW1
     C                   Z-ADD     0             SFTRECD2
     C                   Z-ADD     0             SFTSRTR2
     C                   Z-ADD     0             SFTCOMP2
     C                   Z-ADD     0             SFTSRTRA2
     C                   Z-ADD     0             SFTCOMPA2
     C                   MOVE      CTSHIFT2ND    SFTSHIFT2
     C                   MOVE      CTCREW2ND     SFTCREW2
     C                   Z-ADD     0             SFTRECD3
     C                   Z-ADD     0             SFTSRTR3
     C                   Z-ADD     0             SFTCOMP3
     C                   Z-ADD     0             SFTSRTRA3
     C                   Z-ADD     0             SFTCOMPA3
     C                   MOVE      CTSHIFT3RD    SFTSHIFT3
     C                   MOVE      CTCREW3RD     SFTCREW3
     C                   Z-ADD     0             SFTRECD4
     C                   Z-ADD     0             SFTSRTR4
     C                   Z-ADD     0             SFTCOMP4
     C                   Z-ADD     0             SFTSRTRA4
     C                   Z-ADD     0             SFTCOMPA4
     C                   MOVE      CTSHIFT1ST    SFTSHIFT4
     C                   Z-ADD     0             SFTRECD5
     C                   Z-ADD     0             SFTSRTR5
     C                   Z-ADD     0             SFTCOMP5
     C                   Z-ADD     0             SFTSRTRA5
     C                   Z-ADD     0             SFTCOMPA5
     C                   MOVE      CTSHIFT2ND    SFTSHIFT5
     C                   Z-ADD     0             SFTRECD6
     C                   Z-ADD     0             SFTSRTR6
     C                   Z-ADD     0             SFTCOMP6
     C                   Z-ADD     0             SFTSRTRA6
     C                   Z-ADD     0             SFTCOMPA6
     C                   MOVE      CTSHIFT3RD    SFTSHIFT6
     C                   Z-ADD     0             SFTOPEN1
     C                   Z-ADD     0             SFTOPEN2
     C                   Z-ADD     0             SFTOPEN3
     C                   Z-ADD     0             SFTOPEN4
     C                   Z-ADD     0             SFTOPEN5
     C                   Z-ADD     0             SFTOPEN6
     C                   WRITE     MCRPMM1130
     C     KEY1130       CHAIN     MCRPMM1130                         66
     C                   END
     C*
     C                   ADD       CNT1          CNTSRTR
     C                   ADD       CNT2          CNTSRTRA
     C*
     C     SHIFTKEY      IFEQ      '1'
     C     CONTKEY       IFEQ      'Y'
     C                   ADD       CNT3          SFTSRTR1
     C                   ADD       CNT4          SFTSRTRA1
     C                   ELSE
     C                   ADD       CNT3          SFTSRTR4
     C                   ADD       CNT4          SFTSRTRA4
     C                   END
     C                   END
     C*
     C     SHIFTKEY      IFEQ      '2'
     C     CONTKEY       IFEQ      'Y'
     C                   ADD       CNT3          SFTSRTR2
     C                   ADD       CNT4          SFTSRTRA2
     C                   ELSE
     C                   ADD       CNT3          SFTSRTR5
     C                   ADD       CNT4          SFTSRTRA5
     C                   END
     C                   END
     C*
     C     SHIFTKEY      IFEQ      '3'
     C     CONTKEY       IFEQ      'Y'
     C                   ADD       CNT3          SFTSRTR3
     C                   ADD       CNT4          SFTSRTRA3
     C                   ELSE
     C                   ADD       CNT3          SFTSRTR6
     C                   ADD       CNT4          SFTSRTRA6
     C                   END
     C                   END
     C*
     C                   MOVE      'Y'           MM1130B
     C*
     C*
     C                   UPDATE    MCRPMM1130
     C*
     C     MMWONUM       SETLL     MCRPMM1300
     C                   READ      MCRPMM1300                             76
     C     MMWONUM       IFNE      WONUM
     C                   SETON                                        76
     C                   END
     C                   Z-ADD     0             MMWRENCH
     C     *IN76         DOWEQ     '0'
     C                   MOVE      LBRHOURS      ZZRHOURS
     C     Z1            IFEQ      ' '
     C                   MOVE      '0'           Z1
     C                   END
     C     Z2            IFEQ      ' '
     C                   MOVE      '0'           Z2
     C                   END
     C     Z3            IFEQ      ' '
     C                   MOVE      '0'           Z3
     C                   END
     C     Z4            IFEQ      ' '
     C                   MOVE      '0'           Z4
     C                   END
     C                   MOVE      ZZRHOURS      XXRHOURS
     C     LBHRS         MULT      60            HOLDIT
     C                   ADD       HOLDIT        MMWRENCH
     C     LBMIN         MULT      6             HOLDIT
     C                   ADD       HOLDIT        MMWRENCH
     C                   READ      MCRPMM1300                             76
     C     MMWONUM       IFNE      WONUM
     C                   SETON                                        76
     C                   END
     C                   END
     C*
     C                   UPDATE    MCRLMM1113
     C*
     C     NEXT13        TAG
     C                   READ      MCRLMM1113                             99
     C                   END
     C*
     C**************************************************************************
     C*
     C                   read      MCRFMM1114                             99
     C     *IN99         DOWEQ     '0'
     C*
     C     MMWONUM       CHAIN     MCRPMM1100
     C                   MOVE      DATESTRT      MXDATESTRT
     C                   MOVE      TIMESTRT      MXTIMESTRT
     C                   MOVE      DATECOMP      MXDATECOMP
     C                   MOVE      TIMECOMP      MXTIMECOMP
     C     DATESCHD      IFNE      '        '
     C     TIMESCHD      ANDEQ     '    '
     C                   MOVE      '0000'        TIMESCHD
     C                   END
     C                   MOVE      DATESCHD      MXDATESCHD
     C                   MOVE      TIMESCHD      MXTIMESCHD
     C     MXDATECOMP    IFNE      '        '
     C     MXDATESTRT    ANDEQ     '        '
     C                   MOVE      MXTIMECOMP    MXTIMESTRT
     C                   MOVE      MXDATECOMP    MXDATESTRT
     C                   END
     C     MXTIMECOMP    IFNE      '    '
     C     MXTIMESTRT    ANDEQ     '    '
     C                   MOVE      MXTIMECOMP    MXTIMESTRT
     C                   MOVE      MXDATECOMP    MXDATESTRT
     C                   END
     C*
     C     MXDATECOMP    IFEQ      *BLANK
     C                   GOTO      NEXT14
     C                   END
     C*
     C     MM1130C       IFEQ      ' '
     C                   MOVE      'N'           MM1130C
     C                   UPDATE    MCRFMM1114
     C                   GOTO      NEXT14
     C                   END
     C*
     C     MXDATECOMP    CHAIN     MCRPMM1050
     C                   IF        NOT%found(MCFPMM1050)
     C
     C
     C
     C                   END
     C*
     C                   MOVE      '3'           TIMEFLAG
     C                   EXSR      LOADSFT
     C                   MOVE      CTPRODDATE    MMPRODCOMP
     C                   MOVE      PRODMOD       MMMODCOMP
     C*
     C                   MOVE      CTPRODDATE    CHKKEY
     C                   MOVE      MXZONE        CHKZONE
     C*
     C                   MOVE      MXDATECOMP    CHKDATE
     C                   MOVEL     MXTIMECOMP    CHKHOUR
     C     CALCMOD       DIV       60            NHOUR
     C                   MOVE      NHOUR         AHOUR
     C*
     C     MMPRODCOMP    IFEQ      MMPRODDTRC
     C                   Z-ADD     1             CNT1
     C                   Z-ADD     1             CNT2
     C                   ELSE
     C                   Z-ADD     0             CNT1
     C                   Z-ADD     1             CNT2
     C                   END
     C*
     C     KEY1130       CHAIN     MCRPMM1130                         66
     C                   IF        NOT%found(MCFPMM1130)
     C                   MOVE      CHKKEY        CNTDATE
     C                   MOVE      CHKZONE       CNTZONE
     C                   Z-ADD     0             CNTRECD
     C                   Z-ADD     0             CNTSRTR
     C                   Z-ADD     0             CNTCOMP
     C                   Z-ADD     0             CNTSRTRA
     C                   Z-ADD     0             CNTCOMPA
     C                   Z-ADD     0             SFTRECD1
     C                   Z-ADD     0             SFTSRTR1
     C                   Z-ADD     0             SFTCOMP1
     C                   Z-ADD     0             SFTSRTRA1
     C                   Z-ADD     0             SFTCOMPA1
     C                   MOVE      CTSHIFT1ST    SFTSHIFT1
     C                   MOVE      CTCREW1ST     SFTCREW1
     C                   Z-ADD     0             SFTRECD2
     C                   Z-ADD     0             SFTSRTR2
     C                   Z-ADD     0             SFTCOMP2
     C                   Z-ADD     0             SFTSRTRA2
     C                   Z-ADD     0             SFTCOMPA2
     C                   MOVE      CTSHIFT2ND    SFTSHIFT2
     C                   MOVE      CTCREW2ND     SFTCREW2
     C                   Z-ADD     0             SFTRECD3
     C                   Z-ADD     0             SFTSRTR3
     C                   Z-ADD     0             SFTCOMP3
     C                   Z-ADD     0             SFTSRTRA3
     C                   Z-ADD     0             SFTCOMPA3
     C                   MOVE      CTSHIFT3RD    SFTSHIFT3
     C                   MOVE      CTCREW3RD     SFTCREW3
     C                   Z-ADD     0             SFTRECD4
     C                   Z-ADD     0             SFTSRTR4
     C                   Z-ADD     0             SFTCOMP4
     C                   Z-ADD     0             SFTSRTRA4
     C                   Z-ADD     0             SFTCOMPA4
     C                   MOVE      CTSHIFT1ST    SFTSHIFT4
     C                   Z-ADD     0             SFTRECD5
     C                   Z-ADD     0             SFTSRTR5
     C                   Z-ADD     0             SFTCOMP5
     C                   Z-ADD     0             SFTSRTRA5
     C                   Z-ADD     0             SFTCOMPA5
     C                   MOVE      CTSHIFT2ND    SFTSHIFT5
     C                   Z-ADD     0             SFTRECD6
     C                   Z-ADD     0             SFTSRTR6
     C                   Z-ADD     0             SFTCOMP6
     C                   Z-ADD     0             SFTSRTRA6
     C                   Z-ADD     0             SFTCOMPA6
     C                   MOVE      CTSHIFT3RD    SFTSHIFT6
     C                   Z-ADD     0             SFTOPEN1
     C                   Z-ADD     0             SFTOPEN2
     C                   Z-ADD     0             SFTOPEN3
     C                   Z-ADD     0             SFTOPEN4
     C                   Z-ADD     0             SFTOPEN5
     C                   Z-ADD     0             SFTOPEN6
     C                   WRITE     MCRPMM1130
     C     KEY1130       CHAIN     MCRPMM1130                         66
     C                   END
     C*
     C                   ADD       CNT1          CNTCOMP
     C                   ADD       CNT2          CNTCOMPA
     C*
     C                   Z-ADD     CNT1          CNT3
     C                   Z-ADD     CNT2          CNT4
     C*
     C     SHIFTKEY      IFEQ      '1'
     C     CONTKEY       IFEQ      'Y'
     C                   ADD       CNT3          SFTCOMP1
     C                   ADD       CNT4          SFTCOMPA1
     C                   MOVE      CTSHIFT1ST    MMSHFTCOMP
     C                   MOVE      CTCREW1ST     MMCREWCOMP
     C                   ELSE
     C                   ADD       CNT3          SFTCOMP4
     C                   ADD       CNT4          SFTCOMPA4
     C                   MOVE      CTSHIFT1ST    MMSHFTCOMP
     C                   MOVE      ' '           MMCREWCOMP
     C                   END
     C                   END
     C*
     C     SHIFTKEY      IFEQ      '2'
     C     CONTKEY       IFEQ      'Y'
     C                   ADD       CNT3          SFTCOMP2
     C                   ADD       CNT4          SFTCOMPA2
     C                   MOVE      CTSHIFT2ND    MMSHFTCOMP
     C                   MOVE      CTCREW2ND     MMCREWCOMP
     C                   ELSE
     C                   ADD       CNT3          SFTCOMP5
     C                   ADD       CNT4          SFTCOMPA5
     C                   MOVE      CTSHIFT2ND    MMSHFTCOMP
     C                   MOVE      ' '           MMCREWCOMP
     C                   END
     C                   END
     C*
     C     SHIFTKEY      IFEQ      '3'
     C     CONTKEY       IFEQ      'Y'
     C                   ADD       CNT3          SFTCOMP3
     C                   ADD       CNT4          SFTCOMPA3
     C                   MOVE      CTSHIFT3RD    MMSHFTCOMP
     C                   MOVE      CTCREW3RD     MMCREWCOMP
     C                   ELSE
     C                   ADD       CNT3          SFTCOMP6
     C                   ADD       CNT4          SFTCOMPA6
     C                   MOVE      CTSHIFT3RD    MMSHFTCOMP
     C                   MOVE      ' '           MMCREWCOMP
     C                   END
     C                   END
     C*
     C                   MOVE      'Y'           MM1130C
     C*
     C*    also at this point move y to mm1130
     C*
     C                   MOVE      'Y'           MM1130
     C*
     C                   UPDATE    MCRPMM1130
     C*
     C*
     C                   MOVE      '*ALL'        CHKZONE
     C*
     C*
     C     KEY1130       CHAIN     MCRPMM1130                         66
     C                   IF        NOT%found(MCFPMM1130)
     C                   MOVE      CHKKEY        CNTDATE
     C                   MOVE      CHKZONE       CNTZONE
     C                   Z-ADD     0             CNTRECD
     C                   Z-ADD     0             CNTSRTR
     C                   Z-ADD     0             CNTCOMP
     C                   Z-ADD     0             CNTSRTRA
     C                   Z-ADD     0             CNTCOMPA
     C                   Z-ADD     0             SFTRECD1
     C                   Z-ADD     0             SFTSRTR1
     C                   Z-ADD     0             SFTCOMP1
     C                   Z-ADD     0             SFTSRTRA1
     C                   Z-ADD     0             SFTCOMPA1
     C                   MOVE      CTSHIFT1ST    SFTSHIFT1
     C                   MOVE      CTCREW1ST     SFTCREW1
     C                   Z-ADD     0             SFTRECD2
     C                   Z-ADD     0             SFTSRTR2
     C                   Z-ADD     0             SFTCOMP2
     C                   Z-ADD     0             SFTSRTRA2
     C                   Z-ADD     0             SFTCOMPA2
     C                   MOVE      CTSHIFT2ND    SFTSHIFT2
     C                   MOVE      CTCREW2ND     SFTCREW2
     C                   Z-ADD     0             SFTRECD3
     C                   Z-ADD     0             SFTSRTR3
     C                   Z-ADD     0             SFTCOMP3
     C                   Z-ADD     0             SFTSRTRA3
     C                   Z-ADD     0             SFTCOMPA3
     C                   MOVE      CTSHIFT3RD    SFTSHIFT3
     C                   MOVE      CTCREW3RD     SFTCREW3
     C                   Z-ADD     0             SFTRECD4
     C                   Z-ADD     0             SFTSRTR4
     C                   Z-ADD     0             SFTCOMP4
     C                   Z-ADD     0             SFTSRTRA4
     C                   Z-ADD     0             SFTCOMPA4
     C                   MOVE      CTSHIFT1ST    SFTSHIFT4
     C                   Z-ADD     0             SFTRECD5
     C                   Z-ADD     0             SFTSRTR5
     C                   Z-ADD     0             SFTCOMP5
     C                   Z-ADD     0             SFTSRTRA5
     C                   Z-ADD     0             SFTCOMPA5
     C                   MOVE      CTSHIFT2ND    SFTSHIFT5
     C                   Z-ADD     0             SFTRECD6
     C                   Z-ADD     0             SFTSRTR6
     C                   Z-ADD     0             SFTCOMP6
     C                   Z-ADD     0             SFTSRTRA6
     C                   Z-ADD     0             SFTCOMPA6
     C                   MOVE      CTSHIFT3RD    SFTSHIFT6
     C                   Z-ADD     0             SFTOPEN1
     C                   Z-ADD     0             SFTOPEN2
     C                   Z-ADD     0             SFTOPEN3
     C                   Z-ADD     0             SFTOPEN4
     C                   Z-ADD     0             SFTOPEN5
     C                   Z-ADD     0             SFTOPEN6
     C                   WRITE     MCRPMM1130
     C     KEY1130       CHAIN     MCRPMM1130                         66
     C                   END
     C*
     C                   ADD       CNT1          CNTCOMP
     C                   ADD       CNT2          CNTCOMPA
     C*
     C     SHIFTKEY      IFEQ      '1'
     C     CONTKEY       IFEQ      'Y'
     C                   ADD       CNT3          SFTCOMP1
     C                   ADD       CNT4          SFTCOMPA1
     C                   ELSE
     C                   ADD       CNT3          SFTCOMP4
     C                   ADD       CNT4          SFTCOMPA4
     C                   END
     C                   END
     C*
     C     SHIFTKEY      IFEQ      '2'
     C     CONTKEY       IFEQ      'Y'
     C                   ADD       CNT3          SFTCOMP2
     C                   ADD       CNT4          SFTCOMPA2
     C                   ELSE
     C                   ADD       CNT3          SFTCOMP5
     C                   ADD       CNT4          SFTCOMPA5
     C                   END
     C                   END
     C*
     C     SHIFTKEY      IFEQ      '3'
     C     CONTKEY       IFEQ      'Y'
     C                   ADD       CNT3          SFTCOMP3
     C                   ADD       CNT4          SFTCOMPA3
     C                   ELSE
     C                   ADD       CNT3          SFTCOMP6
     C                   ADD       CNT4          SFTCOMPA6
     C                   END
     C                   END
     C*
     C                   MOVE      'Y'           MM1130C
     C*
     C                   UPDATE    MCRPMM1130
     C*
     C     MMWONUM       SETLL     MCRPMM1300
     C                   READ      MCRPMM1300                             76
     C     MMWONUM       IFNE      WONUM
     C                   SETON                                        76
     C                   END
     C                   Z-ADD     0             MMWRENCH
     C     *IN76         DOWEQ     '0'
     C                   MOVE      LBRHOURS      ZZRHOURS
     C     Z1            IFEQ      ' '
     C                   MOVE      '0'           Z1
     C                   END
     C     Z2            IFEQ      ' '
     C                   MOVE      '0'           Z2
     C                   END
     C     Z3            IFEQ      ' '
     C                   MOVE      '0'           Z3
     C                   END
     C     Z4            IFEQ      ' '
     C                   MOVE      '0'           Z4
     C                   END
     C                   MOVE      ZZRHOURS      XXRHOURS
     C     LBHRS         MULT      60            HOLDIT
     C                   ADD       HOLDIT        MMWRENCH
     C     LBMIN         MULT      6             HOLDIT
     C                   ADD       HOLDIT        MMWRENCH
     C                   READ      MCRPMM1300                             76
     C     MMWONUM       IFNE      WONUM
     C                   SETON                                        76
     C                   END
     C                   END
     C*
     C*
     C                   UPDATE    MCRFMM1114
     C*
     C     NEXT14        TAG
     C                   READ      MCRFMM1114                             99
     C                   END
     C*
     C                   SETON                                        LR
     C/EJECT
     C*
     C     LOADSFT       BEGSR
     C*
     C                   CLOSE     MCFPMM1060
     C                   OPEN      MCFPMM1060
     C                   READ      MCRPMM1060                             44
     C*
     C     XPLANT        IFEQ      'ASHEBORO'
     C                   EXSR      ASHE
     C                   MOVE      'Y'           CONTKEY
     C                   GOTO      LOADEND
     C                   END
     C*
     C                   MOVE      'Y'           CONTKEY
     C*
     C     XPLANT        IFEQ      'TOPEKA'
     C     EQPDEPT       CHAIN     MCRPMM1080
     C                   IF        %found(MCFPMM1080)
     C                   Z-ADD     2250          CT60START
     C                   MOVE      'N'           CONTKEY
     C                   END
     C                   END
     C*
     C     *IN44         DOWEQ     '0'
     C*
     C     TIMEFLAG      IFEQ      '1'
     C                   MOVE      MXTIMERECD    CHKTIME
     C                   MOVE      MXTIMERECD    CHKTIMEN
     C     MXDATERECD    IFGE      CT60DATE
     C     CHKTIMEN      IFGE      CT60START
     C                   READ      MCRPMM1050
     C                   GOTO      GOON
     C                   ELSE
     C                   GOTO      GOON
     C                   END
     C                   END
     C                   END
     C*
     C     TIMEFLAG      IFEQ      '2'
     C                   MOVE      MXTIMESTRT    CHKTIME
     C                   MOVE      MXTIMESTRT    CHKTIMEN
     C     MXDATESTRT    IFGE      CT60DATE
     C     CHKTIMEN      IFGE      CT60START
     C                   READ      MCRPMM1050
     C                   GOTO      GOON
     C                   ELSE
     C                   GOTO      GOON
     C                   END
     C                   END
     C                   END
     C*
     C     TIMEFLAG      IFEQ      '3'
     C                   MOVE      MXTIMECOMP    CHKTIME
     C                   MOVE      MXTIMECOMP    CHKTIMEN
     C     MXDATECOMP    IFGE      CT60DATE
     C     CHKTIMEN      IFGE      CT60START
     C                   READ      MCRPMM1050
     C                   GOTO      GOON
     C                   ELSE
     C                   GOTO      GOON
     C                   END
     C                   END
     C                   END
     C*
     C     TIMEFLAG      IFEQ      '4'
     C                   MOVE      MXTIMESCHD    CHKTIME
     C                   MOVE      MXTIMESCHD    CHKTIMEN
     C     MXDATESCHD    IFGE      CT60DATE
     C     CHKTIMEN      IFGE      CT60START
     C                   READ      MCRPMM1050
     C                   GOTO      GOON
     C                   ELSE
     C                   GOTO      GOON
     C                   END
     C                   END
     C                   END
     C*
     C                   READ      MCRPMM1060                             44
     C*
     C     XPLANT        IFEQ      'TOPEKA'
     C     EQPDEPT       CHAIN     MCRPMM1080
     C                   IF        %found(MCFPMM1080)
     C                   Z-ADD     2250          CT60START
     C                   END
     C                   END
     C*
     C                   END
     C*
     C     GOON          TAG
     C*
     C     CTNUMSHIFT    IFEQ      2
     c*
     C     CHKTIMEN      IFGE      CTSTART1ST
     C     CHKTIMEN      ORLT      CTSTART2ND
     C                   MOVE      CTSTART1ST    SHIFTSTART
     C                   MOVE      '1'           SHIFTKEY
     C                   ELSE
     C                   MOVE      '2'           SHIFTKEY
     C                   MOVE      CTSTART2ND    SHIFTSTART
     C                   END
     C*
     C                   END
     C*
     C     CTNUMSHIFT    IFEQ      3
     C*
     C     XPLANT        IFEQ      'TOPEKA'
     C     EQPDEPT       CHAIN     MCRPMM1080
     C                   IF        %found(MCFPMM1080)
     C                   Z-ADD     2250          CTSTART1ST
     C                   Z-ADD     0650          CTSTART2ND
     C                   Z-ADD     1450          CTSTART3RD
     C************       MOVE      ' '           CTCREW1ST
     C***************    MOVE      ' '           CTCREW2ND
     C*************      MOVE      ' '           CTCREW3RD
     C                   END
     C                   END
     C*
     C     CHKTIMEN      IFGE      CTSTART1ST
     C     CHKTIMEN      ORLT      CTSTART2ND
     C                   MOVE      CTSTART1ST    SHIFTSTART
     C                   MOVE      '1'           SHIFTKEY
     C*
     C                   ELSE
     C*
     C*
     C     CHKTIMEN      IFGE      CTSTART2ND
     C     CHKTIMEN      ANDLT     CTSTART3RD
     C                   MOVE      '2'           SHIFTKEY
     C                   MOVE      CTSTART2ND    SHIFTSTART
     C                   ELSE
     C                   MOVE      '3'           SHIFTKEY
     C                   MOVE      CTSTART3RD    SHIFTSTART
     C                   END
     C                   END
     C                   END
     C*
     C     60            MULT      CHKHH         CALCMOD
     C                   ADD       CHKMM         CALCMOD
     C*
     C     60            MULT      STSHH         OFFSET
     C                   ADD       STSMM         OFFSET
     C*
     C     1440          SUB       OFFSET        ADDIN
     C*
     C     CHKTIMEN      IFGE      CTSTART1ST
     C                   SUB       ADDIN         CALCMOD
     C                   MOVE      CALCMOD       ALPHAMOD
     C                   MOVE      ALPHAMOD      PRODMOD
     C                   ELSE
     C                   ADD       OFFSET        CALCMOD
     C                   MOVE      CALCMOD       ALPHAMOD
     C                   MOVE      ALPHAMOD      PRODMOD
     C                   END
     C*
     C                   MOVE      PRODMOD       MOD
     C
     C     LOADEND       TAG
     C
     C                   endsr
     C/EJECT
     C     ASHE          BEGSR
     C*
     C     TIMEFLAG      IFEQ      '1'
     C                   MOVE      MXTIMERECD    CHKTIME
     C                   MOVE      MXTIMERECD    CHKTIMEN
     C     MXDATERECD    IFGE      CT60DATE
     C     CHKTIMEN      IFlt      CT60START
     C                   READp     MCRPMM1050
     C                   GOTO      GOON1
     C                   ELSE
     C                   GOTO      GOON1
     C                   END
     C                   END
     C                   END
     C*
     C     TIMEFLAG      IFEQ      '2'
     C                   MOVE      MXTIMESTRT    CHKTIME
     C                   MOVE      MXTIMESTRT    CHKTIMEN
     C     MXDATESTRT    IFGE      CT60DATE
     C     CHKTIMEN      IFlt      CT60START
     C                   READP     MCRPMM1050
     C                   GOTO      GOON1
     C                   ELSE
     C                   GOTO      GOON1
     C                   END
     C                   END
     C                   END
     C*
     C     TIMEFLAG      IFEQ      '3'
     C                   MOVE      MXTIMECOMP    CHKTIME
     C                   MOVE      MXTIMECOMP    CHKTIMEN
     C     MXDATECOMP    IFGE      CT60DATE
     C     CHKTIMEN      IFlt      CT60START
     C                   READp     MCRPMM1050
     C                   GOTO      GOON1
     C                   ELSE
     C                   GOTO      GOON1
     C                   END
     C                   END
     C                   END
     C*
     C     TIMEFLAG      IFEQ      '4'
     C                   MOVE      MXTIMESCHD    CHKTIME
     C                   MOVE      MXTIMESCHD    CHKTIMEN
     C     MXDATESCHD    IFGE      CT60DATE
     C     CHKTIMEN      IFlt      CT60START
     C                   READp     MCRPMM1050
     C                   GOTO      GOON1
     C                   ELSE
     C                   GOTO      GOON1
     C                   END
     C                   END
     C                   END
     C*
     C*
     C     GOON1         TAG
     C*
     c*
     C     CHKTIMEN      IFGE      CTSTART1ST
     C     CHKTIMEN      andle     CTSTART2ND
     C                   MOVE      CTSTART1ST    SHIFTSTART
     C                   MOVE      '1'           SHIFTKEY
     C                   ELSE
     C                   MOVE      '2'           SHIFTKEY
     C                   MOVE      CTSTART2ND    SHIFTSTART
     C                   END
     C*
     C*
     C*
     C     60            MULT      CHKHH         CALCMOD
     C                   ADD       CHKMM         CALCMOD
     C*
     C     CALCMOD       IFLE      450
     C                   ADD       990           CALCMOD
     C                   ELSE
     C                   SUB       450           CALCMOD
     C                   END
     C*
     C                   MOVE      CALCMOD       ALPHAMOD
     C                   MOVE      ALPHAMOD      PRODMOD
     C*
     C                   MOVE      PRODMOD       MOD
     C
     C                   endsr
