     F****************************************************************
     FMCFLMM1101IF   E           K DISK
     FMCFPMM1070IF   E           K DISK
     FMCFLMM1110UF A E           K DISK
     D*
     D HOLDWO          S             10
     C*
     C     *ENTRY        PLIST
     C                   PARM                    HOLDWO
     C*
     C     HOLDWO        CHAIN     MCRPMM1100
     C                   IF        %found(MCFLMM1101)
     C     DATERECD      IFLT      '20070101'
     C                   GOTO      ENDIT
     C                   ENDIF
     C     WONUM         CHAIN     MCRPMM1110
     C                   IF        NOT%found(MCFLMM1110)
     C                   MOVE      WONUM         MMWONUM
     C                   MOVE      DATERECD      MXDATERECD
     C                   MOVE      TIMERECD      MXTIMERECD
     C                   MOVE      DATEREQD      MXDATEREQD
     C                   MOVE      TIMEREQD      MXTIMEREQD
     C                   MOVE      DATESCHD      MXDATESCHD
     C                   MOVE      TIMESCHD      MXTIMESCHD
     C                   MOVEL     DATESTRT      MXDATESTRT
     C                   MOVE      TIMESTRT      MXTIMESTRT
     C                   MOVE      DATECOMP      MXDATECOMP
     C                   MOVE      TIMECOMP      MXTIMECOMP
     C                   MOVEL     ZONEPRTY      MXZONE
     C                   MOVE      ZONEPRTY      MXPRTY
     C                   MOVE      *BLANK        MMPRODDTRC
     C                   Z-ADD     0             MMMODRECD
     C                   MOVE      *BLANK        MMSHFTRC
     C                   MOVE      *BLANK        MMCREWRC
     C                   MOVE      *BLANK        MMPRODDTRQ
     C                   Z-ADD     0             MMMODREQD
     C                   MOVE      *BLANK        MMSHFTRQ
     C                   MOVE      *BLANK        MMCREWRQ
     C                   MOVE      *BLANK        MMPRODDTSD
     C                   Z-ADD     0             MMMODSCHD
     C                   MOVE      *BLANK        MMSHFTSD
     C                   MOVE      *BLANK        MMCREWSD
     C                   MOVE      *BLANK        MMPRODSTRT
     C                   Z-ADD     0             MMMODSTRT
     C                   MOVE      *BLANK        MMSHFTSTRT
     C                   MOVE      *BLANK        MMCREWSTRT
     C                   MOVE      *BLANK        MMPRODCOMP
     C                   Z-ADD     0             MMMODCOMP
     C                   MOVE      *BLANK        MMSHFTCOMP
     C                   MOVE      *BLANK        MMCREWCOMP
     C                   Z-ADD     0             MMWRENCH
     C                   MOVE      'N'           MM1130
     C                   MOVE      'N'           MM1130A
     C                   MOVE      ' '           MM1130B
     C                   MOVE      ' '           MM1130C
     C                   MOVE      'N'           MMEXCLUDE
     C     MXZONE        CHAIN     MCRPMM1070
     C                   IF        %found(MCFPMM1070)
     C                   MOVE      'Y'           MMEXCLUDE
     C                   END
     C     MXDATECOMP    IFNE      '        '
     C     MXDATESTRT    ANDEQ     '        '
     C                   MOVE      MXTIMECOMP    MXTIMESTRT
     C                   MOVE      MXDATECOMP    MXDATESTRT
     C                   END
     C                   WRITE     MCRPMM1110
     C                   END
     C
     C                   END
     C     ENDIT         TAG
     C                   SETON                                        LR
