     F****************************************************************
     D*
      *====================================================*
      * Trigger Buffer passed by the system to this PGM *
      *====================================================*
      * FNAME = PHYSICAL FILE NAME *
      * LNAME = PHYSICAL FILE LIBRARY *
      * MNAME = MEMBER NAME *
      * TEVEN = TRIGGER EVENT *
      * TTIME = TRIGGER TIME *
      * CMTLCK= COMMIT LOCK LEVEL *
      * FILL1 = RESERVED *
      * CCSID = CCSID *
      * FILL2 = RESERVED *
      * OLDOFF= OFFSET TO THE ORIGINAL RECORD *
      * OLDLEN= LENGTH OF THE ORIGINAL RECORD *
      * ONOFF = OFFSET TO THE ORIGINAL RECORD NULL BYTE MAP*
      * ONLEN = LENGTH OF THE NULL BYTE MAP *
      * NOFF = OFFSET TO THE NEW RECORD *
      * ONLEN = LENGTH OF THE NULL BYTE MAP *
      * NOFF = OFFSET TO THE NEW RECORD *
      * NEWLEN= LENGTH OF THE NEW RECORD *
      * NNOF = OFFSET TO THE NEW RECORD NULL BYTE MAP *
      * NNLEN = LENGTH OF THE NULL BYTE MAP *
      * RESV3 = RESERVED *
      * OREC = OLD RECORD *
      * OOMAP = NULL BYTE MAP OF OLD RECORD *
      * RECORD= NEW RECORD *
      * NMAP = NULL BYTE MAP OF NEW RECORD *
      *====================================================*
     D PARM1           DS
     D FNAME                   1     10
     D LNAME                  11     20
     D MNAME                  21     30
     D TEVEN                  31     31
     D TTIME                  32     32
     D CMTLCK                 33     33
     D FILL1                  34     36
     D CCSID                  37     40B 0
     D FILL2                  41     48
     D OLDOFF                 49     52B 0
     D OLDLEN                 53     56B 0
     D ONLEN                  61     64B 0
     D NOFF                   65     68B 0
     D NEWLEN                 69     72B 0
     D NNOFF                  73     76B 0
     D NNLEN                  77     80B 0
     D RESV3                  81     96
     D OREC                   97    458
     D OOMAP                 459    489
     D RECORD                993   1002
     D NNMAP                 993   1882
      *====================================================*
      * Definition of the length buffer received by trigger*
      *====================================================*
     D PARM2           DS
     D LENG                    1      4B 0
     D*
     D WORKORDER       S             10
     C*
     C     *ENTRY        PLIST
     C     PARM1         PARM                    PARM1
     C     PARM2         PARM                    PARM2
     C*
     C                   CALL      'MMXADDLIB'
     C*
     C                   MOVEL     RECORD        WORKORDER
     C*
     C                   CALL      'MMR1110'
     C                   PARM                    WORKORDER
     C*
     C     ENDIT         TAG
     C                   SETON                                        LR
