     FMCFPMM1000IF   E             DISK
     F****************************************************************
     C     *ENTRY        PLIST
     C                   PARM                    STRDATE           8
     C                   PARM                    ENDDATE           9
     C*
     C                   READ      MCRPMM1000                             99
     C     *IN99         DOWEQ     '0'
     C     DATERECD      IFGE      STRDATE
     C     DATERECD      IFLE      ENDDATE
     C                   MOVE      WONUM         WORKORDER        10
     C                   CALL      'MMR1010'
     C                   PARM                    WORKORDER
     C                   END
     C                   END
     C                   READ      MCRPMM1000                             99
     C                   END
     C*
     C     ENDIT         TAG
     C                   SETON                                        LR
