000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TASPTREQ.
      *C
      *C  01/04/2010  CA YODER  2010-00142425-001
      *C     UPDATE LOGIC ASSIGNING WORKORDER LETTER SUFFIX.
      *C
000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000600 SOURCE-COMPUTER.   AS400.
000700 OBJECT-COMPUTER.   AS400.
       SPECIAL-NAMES.     LOCAL-DATA IS LOCAL-DATA-AREA
                          I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZMODIFY-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT MPLTINFO-FILE
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS MF-STATUS.
           SELECT WO-LAST-NUM-USED
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ARG-NO
               FILE STATUS IS WLNU-STATUS.
           SELECT WO-PARTS-FILE
               ASSIGN TO DATABASE-MCFLMM1201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS WPFD-STATUS.
           SELECT WO-PARTS-FILE-PHYSICAL
               ASSIGN TO DATABASE-MCFPMM1200
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS PFKEY
               FILE STATUS IS WPFDP-STATUS.
           SELECT WO-PLANNED-FILE
               ASSIGN TO DATABASE-MCFLMM1101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WPF-STATUS.
000800 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                         PIC X(2000).
       FD  MPLTINFO-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS MFREC.
       01  MFREC.
           COPY DDS-ALL-FORMATS OF MCFLCS0501.
       FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WLNUREC.
       01  WLNUREC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.
       FD  WO-PARTS-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFDREC.
       01  WPFDREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1201.
       FD  WO-PARTS-FILE-PHYSICAL
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFDPREC.
       01  WPFDPREC.
           COPY DDS-ALL-FORMATS OF MCFPMM1200.
       FD  WO-PLANNED-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFREC.
       01  WPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.
000900 WORKING-STORAGE SECTION.
001200 77  PRT-SEQ                           PIC 9(4).
001300 77  REQS-CUT-SW                       PIC 9.
001400 77  SAVE-YR-DIG                       PIC X.
001500 77  SUB1                              PIC 99.
      *---- 01/04/2010:  ADDED PARAMETER FOR CMMISYR.
       77  MMIS-LETTER                PIC X.
001600 01  ARG-NO                            PIC 9(9).
       01  BASE-BG                           PIC X(24).
001800 01  BASE-DUMMY                        PIC X(24).
       01  BASE-MMISA                        PIC X(24).
001900 01  BLOWUP-BASE                       PIC X(16).
       COPY CATREAD IN COPYLIB.
002000 COPY CMANREQ IN COPYLIB.
       COPY CPYIND  IN COPYLIB.
002100 01  CUR-DATE-WA.
002200     05  FILLER                        PIC X.
002300     05  C-D-YR                        PIC 9.
           05  FILLER                        PIC X(4).
002500 01  DBPARAMETERS-STORES.
002600     05  BASE2                         PIC X(24).
002700     05  DSET-NAME-S                   PIC X(16).
002800     05  PASSWORD-S                    PIC X(8).
002900     05  PASS-FILENUMBER               PIC S9(4) COMP-4.
004000 01  ERROR-BUFFER.
           05  FILLER                        PIC X(12).
           05  ERR-WO                        PIC X(10).
           05  FILLER                        PIC X(58).
004300 01  ERROR-SWITCH                      PIC S9(4) COMP-4.
004400 COPY ESCNAM2 IN COPYLIB.
       01  FILE-STATUSES.
           05  DSPLY-STATUS                  PIC XX.
           05  MF-STATUS                     PIC XX.
           05  WLNU-STATUS                   PIC XX.
           05  WPFD-STATUS                   PIC XX.
           05  WPFDP-STATUS                  PIC XX.
           05  WPF-STATUS                    PIC XX.
       COPY IOFEEDBACK OF COPYLIB.
       COPY JCWAREA OF COPYLIB.
       COPY LANGSUB OF COPYLIB.
004800 01  LAST-WO-BUFF.        COPY MLASTWO  OF COPYLIB.
005000 COPY MPLT0    IN COPYLIB.
005100 COPY MPLTRQGB IN COPYLIB.
005200 01  MPLTINFO-ARG                      PIC X(4).
005300 01  PASSED-BASE                       PIC X(10).
005400 01  PASSWORD-INFORMATION.
005500     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TASPTREQ".
005600     05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
005700     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
005800     05  PROGRAM-DESCRIPTION.
005900         10  PROG-DESC-A     PIC X(60) VALUE
006000        " ASSIGN AND PRINT REQUISITIONS - F4 OF MODIFY FUNCTIONS".
006100         10  PROG-DESC-B     PIC X(60) VALUE SPACES.
006300         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
006500     05  PASSWORD-FLAG       PIC X.
       01  PFKEY                             PIC 9(9).
007000 COPY REQGLOB IN COPYLIB.
007100 01  REQ-ISSUED-MSG.
011300     05  FILLER  PIC X(20) VALUE SPACES.
011400     05  REQ-ISS PIC X(12) VALUE SPACES.
011500     05  FILLER  PIC X(23) VALUE SPACES.
011600     05  REQU-WO PIC X(10) VALUE SPACES.
011700     05  FILLER  PIC X(14) VALUE SPACES.
007800 01  RETURN-CODE                       PIC X.
007900 01  SAVE-REC-NO                       PIC S9(9) COMP-4.
       01  START-KEY-PARTS                   PIC X(10).
008000 COPY DBSTAT   OF COPYLIB.
008900 01  STORES-DATA.
009000     05  CSIS-CODE                     PIC X(8).
009100     05  RET-CODE                      PIC XX.
009200     05  UNIT-COST                     PIC S9(11)V9(4).
009300     05  UNIT-OF-MEAS                  PIC XX.
009400     05  STORES-DESCRIP-DATA.
009500         10  DESCRIP-1.
009600             15  DESC-1 OCCURS 80      PIC X.
009700         10  DESCRIP-2.
009800             15  DESC-2 OCCURS 80      PIC X.
009900         10  DESCRIP-3.
010000             15  DESC-3 OCCURS 80      PIC X.
010100     05  EST-LT                        PIC 9(4).
010200 COPY TBLOWUP  OF COPYLIB.
       01  TRUE-VAL                          PIC 1 VALUE B"1".
010300 01  UPDATE-DATA.         COPY BUDGUPDR OF COPYLIB.
010400 01  WO-PARTS-DATA.       COPY DWOPARTS OF COPYLIB.
010500 01  WO-PLANNED-DATA.     COPY DWOPLAN  OF COPYLIB.
010600 01  WO-WORKAREA.
010700     05  WO-WORK OCCURS 10 TIMES.
010800         10  WO-1-6                    PIC X(6).
010900         10  WO-7                      PIC X.
011000         10  WO-8-10                   PIC XXX.
           05  WO-NUM-CMD-LINE               PIC X(79).
           05  WO-NUM-ERR-LINE               PIC X(79).
       01  WORK-ORDER-NUM                    PIC X(10).
       COPY WSCONTROL IN COPYLIB.
011100 LINKAGE SECTION.
011800 01  DBPARAMETERS.        COPY DBPARMS OF COPYLIB.
011900 COPY VCOMLINK OF COPYLIB.
012100 PROCEDURE DIVISION USING DBPARAMETERS VIEW-COMAREA.
012300 START-PGM.
012400     PERFORM 1-HSK.
012500     PERFORM 6-MAIN THRU 6-MAIN-EXIT
               UNTIL VIEW-LASTKEY = 1 OR 3.
012600 2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE MPLTINFO-FILE.
           CLOSE WO-LAST-NUM-USED.
           CLOSE WO-PARTS-FILE.
           CLOSE WO-PARTS-FILE-PHYSICAL.
           CLOSE WO-PLANNED-FILE.
012700     GOBACK.
012800 1-HSK.
           OPEN I-O   DISPLAY-FILE.
           OPEN INPUT MPLTINFO-FILE.
           OPEN INPUT WO-LAST-NUM-USED.
           OPEN I-O   WO-PARTS-FILE.
           OPEN I-O   WO-PARTS-FILE-PHYSICAL.
           OPEN I-O   WO-PLANNED-FILE.
012900     CALL "TPWORD" USING PASSWORD-INFORMATION.
013300     IF PASSWORD-FLAG = "N"
013400         MOVE "  PWORD" TO BLOWUP-BASE
013500         MOVE "FAILED PASSWORD CHECK - TASPTREQ"
013600             TO BU-DISPLAY-MSG
013700         PERFORM 998-BLOWUP.
           MOVE SPACES TO WO-WORKAREA.
014500     ACCEPT CUR-DATE-WA FROM DATE.
      *------- 01/04/2010:  UPDATED WORKORDER LETTER SUFFIX LOGIC.
014600*    IF C-D-YR = 0
014700*        MOVE "A" TO SAVE-YR-DIG
014800*    ELSE
014900*    IF C-D-YR = 1
015000*        MOVE "B" TO SAVE-YR-DIG
015100*    ELSE
015200*    IF C-D-YR = 2
015300*        MOVE "C" TO SAVE-YR-DIG
015400*    ELSE
015500*    IF C-D-YR = 3
015600*        MOVE "D" TO SAVE-YR-DIG
015700*    ELSE
015800*    IF C-D-YR = 4
015900*        MOVE "E" TO SAVE-YR-DIG
016000*    ELSE
016100*    IF C-D-YR = 5
016200*        MOVE "F" TO SAVE-YR-DIG
016300*    ELSE
016400*    IF C-D-YR = 6
016500*        MOVE "G" TO SAVE-YR-DIG
016600*    ELSE
016700*    IF C-D-YR = 7
016800*        MOVE "H" TO SAVE-YR-DIG
016900*    ELSE
017000*    IF C-D-YR = 8
017100*        MOVE "J" TO SAVE-YR-DIG
017200*    ELSE
017300*    MOVE "K" TO SAVE-YR-DIG.

           CALL "CMMISYR" USING MMIS-LETTER.
           MOVE MMIS-LETTER    TO SAVE-YR-DIG.
      *-------

017400     PERFORM 11-LOAD-WO-7 VARYING SUB1 FROM 1 BY 1
017500         UNTIL SUB1 > 10.
           MOVE 0 TO COND-WORD.
017900     MOVE 1 TO ARG-NO.
018000     READ WO-LAST-NUM-USED INTO LAST-WO-BUFF
018100         INVALID KEY    MOVE 17 TO COND-WORD.
018200     IF WLNU-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 MOVE 1 TO DATE-FLAG-SW.
           PERFORM 69-START-MPLTINFO-FILE.
047100     IF COND-WORD = 17
047200         MOVE "Y" TO MPLT-PRINT-WO-REQPK
047300         MOVE "N" TO MPLT-WOAP-TO-CUT-REQ
047400         MOVE "N" TO MPLT-WOAP-TO-APP-REQ
047500         MOVE MPLTINFO-RQGB TO REQ-GLOBALS
047600     ELSE
           PERFORM 69-READ-MPLTINFO-FILE
047100     IF COND-WORD = 15
047200         MOVE "Y" TO MPLT-PRINT-WO-REQPK
047300         MOVE "N" TO MPLT-WOAP-TO-CUT-REQ
047400         MOVE "N" TO MPLT-WOAP-TO-APP-REQ
047500         MOVE MPLTINFO-RQGB TO REQ-GLOBALS
047600     ELSE
047700     MOVE MPLTINFO-RQGB TO REQ-GLOBALS.
           ACCEPT MC-LOCAL-DATA-AREA FROM LOCAL-DATA-AREA.
021200     CALL "TESCSEQ" USING ESC-NAME.
021300 11-LOAD-WO-7.
021400     MOVE SAVE-YR-DIG TO WO-7 (SUB1).
021500 6-MAIN.
           MOVE 52011 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO WO-NUM-CMD-LINE.
           MOVE "FASPTREQ" TO VIEW-CFNAME.
           MOVE WO-WORKAREA TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE SPACES TO ERROR-BUFFER.
           MOVE DSPLY-REC TO WO-WORKAREA.
022800     IF VIEW-LASTKEY = 1 OR 3 GO TO 6-MAIN-EXIT.
           MOVE 0 TO SUB1.
023300     PERFORM 60-VALIDATE-WO-LOOP THRU 60-VWL-EXIT.

       6-MAIN-EXIT.    EXIT.

023400 60-VALIDATE-WO-LOOP.
023500     ADD 1 TO SUB1.
023600     IF SUB1 > 10
023700         MOVE SPACES TO ERROR-BUFFER
024200         MOVE SPACES TO WO-WORKAREA
024300         PERFORM 11-LOAD-WO-7 VARYING SUB1 FROM 1 BY 1
024400             UNTIL SUB1 > 10
024700         GO TO 60-VWL-EXIT.
024800     IF WO-1-6 (SUB1) = "      " GO TO 60-VALIDATE-WO-LOOP.
024900     MOVE WO-WORK (SUB1) TO WORK-ORDER-NUM.
025000     MOVE "0" TO RETURN-CODE.
025100     CALL "TALWONO" USING WORK-ORDER-NUM RETURN-CODE.
025200     MOVE WORK-ORDER-NUM TO WO-WORK (SUB1).
025900     PERFORM 69-START-WO-PLANNED-FILE.
026100     IF COND-WORD = 17
026400         MOVE 49030 TO CATREAD-MSG-NUMBER
026600         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
026800         MOVE TRUE-VAL TO INDS (98)
               MOVE ERROR-BUFFER TO WO-NUM-CMD-LINE
               MOVE WO-WORK (SUB1) TO ERR-WO
               MOVE WO-WORKAREA TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
027000         GO TO 60-VALIDATE-WO-LOOP.
           PERFORM 69-READ-WO-PLANNED-FILE.
027300     IF COND-WORD = 15
027600         MOVE 49029 TO CATREAD-MSG-NUMBER
027800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
028000         MOVE TRUE-VAL TO INDS (98)
               MOVE ERROR-BUFFER TO WO-NUM-CMD-LINE
               MOVE WO-WORK (SUB1) TO ERR-WO
               MOVE WO-WORKAREA TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
028200         GO TO 60-VALIDATE-WO-LOOP.
028300     IF PRINT-WO-REQPK = "Y"
028400         CALL "TPRINTWS" USING DBPARAMETERS
                                     WO-PLANNED-DATA
028600                               ERROR-SWITCH
                                     VIEW-COMAREA.
028700     MOVE 0 TO REQS-CUT-SW.
028800     PERFORM 602-KICK-REQS-LOOSE THRU 602-KRL-EXIT.
029100     IF REQS-CUT-SW = 0 GO TO 60-VALIDATE-WO-LOOP.
029200     PERFORM 69-START-WO-PLANNED-FILE.
029400     IF COND-WORD = 17 GO TO 60-VALIDATE-WO-LOOP.
029500     PERFORM 69-READ-WO-PLANNED-FILE.
029700     IF COND-WORD = 15 GO TO 60-VALIDATE-WO-LOOP.
029800     IF APPROVAL-CODE-P = "A"
029900         IF WO-STATUS-P = "OO" OR "HA"
030000             MOVE "HM" TO WO-STATUS-P
030100         ELSE
030200         NEXT SENTENCE
030300     ELSE
030400     MOVE "HA" TO WO-STATUS-P.
030600     PERFORM 69-DELETE-WO-PLANNED-RECORD.
030800     IF COND-WORD = 17
030900         MOVE "  MMISA" TO BLOWUP-BASE
031000         MOVE "DBDELETE FAILED ON STATUS UPDATE * TASPTREQ *"
031100             TO BU-DISPLAY-MSG
031200         MOVE "WO-PLANNED  " TO BU-DISPLAY-FLD (1)
031400         PERFORM 998-BLOWUP.
           PERFORM 69-WRITE-WO-PLANNED-FILE.
031700     IF COND-WORD = 17
031800         MOVE "  MMISA" TO BLOWUP-BASE
031900         MOVE "DBPUT ON STATUS CHANGE FAILED * TASPTREQ *"
032000             TO BU-DISPLAY-MSG
032100         MOVE "WO-PLANNED  " TO BU-DISPLAY-FLD (1)
032300         PERFORM 998-BLOWUP.
032500     GO TO 60-VALIDATE-WO-LOOP.
032600 60-VWL-EXIT.    EXIT.
033200 602-KICK-REQS-LOOSE.
033300     IF JCW-AREQJCW-259 = 1
033400         NEXT SENTENCE
033500     ELSE
033600     GO TO 602-KRL-EXIT.
           MOVE 0 TO COND-WORD.
033900     MOVE WO-WORK (SUB1) TO WONUM OF WPFDREC.
034000     MOVE 0 TO PRT-SEQ.
034100     START WO-PARTS-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
034200         INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPFD-STATUS NOT = "00" MOVE 17 TO COND-WORD,
034300     IF COND-WORD = 17 GO TO 602-KRL-EXIT.
034400 602-KRL-CONT.
034500     READ WO-PARTS-FILE NEXT INTO WO-PARTS-DATA
034600         AT END    MOVE 15 TO COND-WORD.
           IF WO-WORK (SUB1) NOT = PRT-WO-NU
               MOVE 15 TO COND-WORD.
           IF WPFD-STATUS NOT = "00" MOVE 15 TO COND-WORD.
034700     IF COND-WORD = 15 GO TO 602-KRL-EXIT.
034800     ADD 1 TO PRT-SEQ.
034900     IF PRT-STATUS-1 NOT = "M" GO TO 602-KRL-CONT.
035000     IF PRT-REQ-NO NOT = "      " GO TO 602-KRL-CONT.
035100     IF PRT-PO-NO NOT = "          " GO TO 602-KRL-CONT.
035200     IF APPROVAL-CODE-P = "A"
035300         NEXT SENTENCE
035400     ELSE
035500     IF PRT-NUM = "       "
035600         NEXT SENTENCE
035700     ELSE
035800     MOVE SPACES TO STORES-DATA
035900     MOVE PRT-NUM TO CSIS-CODE
036000     CALL "TCODINFO" USING STORES-DATA DBPARAMETERS-STORES
036100     IF RET-CODE = "NS"
036200         NEXT SENTENCE
036300     ELSE
036400     GO TO 602-KRL-CONT.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE IO-REL-NO TO SAVE-REC-NO.
           MOVE 0 TO COND-WORD.
           MOVE START-KEY-PARTS TO WONUM OF WPFDREC.
           START WO-PARTS-FILE KEY IS > EXTERNALLY-DESCRIBED-KEY
               INVALID KEY     MOVE 17 TO COND-WORD.
036600     MOVE SPACES TO CMR-DATA CMR-DESC CMR-REMARKS
036700         CMR-RETURNED-DATA CMR-MISC-PARMS.
036800     PERFORM 6020-PRINT-REQS THRU 6020-PR-EXIT.
036900     MOVE SAVE-REC-NO TO PFKEY.
           READ WO-PARTS-FILE-PHYSICAL INTO WO-PARTS-DATA
               INVALID KEY    MOVE 15 TO COND-WORD.
           IF WPFDP-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF COND-WORD = 15
               MOVE "  MMISA" TO BLOWUP-BASE
               MOVE "PHYS. READ/WO-PARTS FAILED * TAPPRVWO *"
                   TO BU-DISPLAY-MSG
               PERFORM 998-BLOWUP.
037200     MOVE CMR-REQ-NUMBER TO PRT-REQ-NO.
037300     MOVE CMR-QTY TO PRT-ACT-QTY-9.
037400     MOVE PRT-SEQ TO PRT-ITEM-NO.
037700     REWRITE WPFDPREC FROM WO-PARTS-DATA
037800         INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPFD-STATUS NOT = "00" MOVE 17 TO COND-WORD.
037900     IF COND-WORD = 17
038000         MOVE "  MMISA" TO BLOWUP-BASE
038100         MOVE "WO-PARTS UPDATE FAILED * TASPTREQ *"
038200             TO BU-DISPLAY-MSG
038300         MOVE "WO-PARTS FILE" TO BU-DISPLAY-FLD (1)
               MOVE PRT-REQ-NO      TO BU-DISPLAY-FLD (2)
038500         PERFORM 998-BLOWUP.
038800
038900     GO TO 602-KICK-REQS-LOOSE.
039000
039100 602-KRL-EXIT.    EXIT.
039200
039300 6020-PRINT-REQS.
039400     MOVE "CR" TO CMR-CALL-MODE.
039500     MOVE PRT-WO-NU TO CMR-WO-NUMBER.
039600     MOVE PRT-SEQ TO CMR-WO-ITEM-NUMBER.
039700     MOVE PRT-NUM-7 TO CMR-CORP-CODE.
039800     MOVE DEPT-P TO CMR-FOR-DEPT.
039900     MOVE PRT-DATE-USED-CN TO CMR-DATE-REQUIRED-CN.
           IF CMR-DATE-REQUIRED-CC = "19" OR "20"
               NEXT SENTENCE
           ELSE
           IF CMR-DATE-REQUIRED-YY > "70"
               MOVE "19" TO CMR-DATE-REQUIRED-CC
           ELSE
           MOVE "20" TO CMR-DATE-REQUIRED-CC.
040000     MOVE PRT-STAGE TO CMR-STAGING-AREA.
040100     MOVE PRT-EST-QTY-9 TO CMR-QTY PRT-ACT-QTY-9.
040200     MOVE PRT-UNIT-MEAS TO CMR-UM.
040300     MOVE BUDGET-NO TO CMR-BUDGET-NUMBER.
040400     MOVE SPACES TO CMR-DESC.
040500     MOVE SPACES TO CMR-MISC-PARMS.
040600     MOVE SPACES TO CMR-RETURNED-DATA.
040700     MOVE 0 TO CMR-SPOOL-PRT.
040900     MOVE P-UNIT-COST TO CMR-EST-UNIT-PRICE.
041000     MOVE PRT-DESC TO CMR-DESC-LINE (1).
041100     MOVE PRT-DESC-2 TO CMR-DESC-LINE (2).
041200     MOVE PRT-DESC-3 TO CMR-DESC-LINE (3).
041300     MOVE PRT-DESC-4 TO CMR-DESC-LINE (4).
041400     MOVE PRT-DESC-5 TO CMR-DESC-LINE (5).
041500     MOVE PRT-REMARKS   TO CMR-REMARK-1.
041600     MOVE PRT-REMARKS-2 TO CMR-REMARK-2.
041700     MOVE PRT-ADDL-INFO TO CMR-ADDTL-INFO.
041800     MOVE PRT-SUGG-VENDOR TO CMR-SUGGESTED-VENDOR.
041900     MOVE PRT-SEQ TO CMR-WO-ITEM-NUMBER.
042000     MOVE PRT-SUB-1-3 TO CMR-SUB.
042100     MOVE PRT-ORIGINATOR TO CMR-REQ-ORIG.
042200     MOVE EXP-CLASS-P TO CMR-EXPENSE-CLASS.
042300     CALL "CMANREQ" USING PASSED-BASE
042400                          BASE-MMISA
042500                          BASE-BG
042600                          BASE-DUMMY
042700                          ERROR-BUFFER
042800                          CMR-CALL-MODE
042900                          CMR-DATA
043000                          CMR-DESC
043100                          CMR-REMARKS
043200                          CMR-RETURNED-DATA
043300                          CMR-MISC-PARMS
043400                          REQ-GLOBALS
043500                          LANGUAGE-PARMS
043600                          ESC-NAME
043700                          VIEW-COMAREA.
043800     IF CMR-RETURN-STATUS = "OK"
043900         MOVE 1 TO REQS-CUT-SW
044000         MOVE 44110 TO CATREAD-MSG-NUMBER
044200         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
044300         MOVE ERROR-BUFFER TO REQ-ISSUED-MSG
044500         MOVE CMR-WO-NUMBER TO REQU-WO
044600         MOVE CMR-REQ-NUMBER TO REQ-ISS
               MOVE TRUE-VAL TO INDS (98)
               MOVE REQ-ISSUED-MSG TO WO-NUM-CMD-LINE
               MOVE WO-WORKAREA TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
045100     ELSE
045200     IF CMR-RETURN-STATUS = "RE"
045300         MOVE 44025 TO CATREAD-MSG-NUMBER
045500         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (98)
               MOVE ERROR-BUFFER TO WO-NUM-CMD-LINE
               MOVE WO-WORKAREA TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
046000     ELSE
046100     IF CMR-RETURN-STATUS = "DE"
046200         MOVE "  STORES" TO BLOWUP-BASE
046300         MOVE "STORES DB ERROR RETURNED BY CMANREQ *TASPTREQ*"
046400             TO BU-DISPLAY-MSG
046500         MOVE "CSIS ERROR = " TO BU-DISPLAY-FLD (1)
046600         MOVE CMR-RETURN-STATUS TO BU-DISPLAY-FLD9 (1)
046700         PERFORM 998-BLOWUP
046800     ELSE
046900     IF CMR-RETURN-STATUS = "BB"
047000         MOVE 28021 TO CATREAD-MSG-NUMBER
047200         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (98)
               MOVE ERROR-BUFFER TO WO-NUM-CMD-LINE
               MOVE WO-WORKAREA TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
048200     ELSE
048300     MOVE 45048 TO CATREAD-MSG-NUMBER
048500     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE TRUE-VAL TO INDS (98)
           MOVE ERROR-BUFFER TO WO-NUM-CMD-LINE
           MOVE WO-WORKAREA TO DSPLY-REC
           PERFORM 99-SCREEN-WRITE
           PERFORM 98A-SCREEN-READ
           CALL "CLPAUSE2".
049000 6020-PR-EXIT.    EXIT.
049100
       69-READ-MPLTINFO-FILE.
           MOVE 0 TO COND-WORD.
           READ MPLTINFO-FILE INTO BUF-MPLTINFO
               INVALID KEY MOVE 15 TO COND-WORD.
           IF MF-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-START-MPLTINFO-FILE.
           MOVE 0 TO COND-WORD.
046700     MOVE "RQGB" TO PLTINFOKEY OF MFREC.
           START MPLTINFO-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY     MOVE 17 TO COND-WORD.
           IF MF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-DELETE-WO-PLANNED-RECORD.
           MOVE 0 TO COND-WORD.
           DELETE WO-PLANNED-FILE RECORD
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-WO-PLANNED-FILE.
           MOVE 0 TO COND-WORD.
           READ WO-PLANNED-FILE NEXT INTO WO-PLANNED-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-START-WO-PLANNED-FILE.
           MOVE 0 TO COND-WORD.
           MOVE WORK-ORDER-NUM TO WONUM OF WPFREC.
           START WO-PLANNED-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-WRITE-WO-PLANNED-FILE.
           MOVE 0 TO COND-WORD.
           WRITE WPFREC FROM WO-PLANNED-DATA
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0" TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

049200 998-BLOWUP.
049300     MOVE "TASPTREQ" TO BU-PGM-NAME.
049400     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
049500                      VIEW-COMAREA DUMMY-KSAM-STAT
049600                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.
049700
049800 999-CATREAD.
049900     MOVE SPACES TO ERROR-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
051400 999-CATREAD-EXIT.
051500     EXIT.
