       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TCFTHELP.
       AUTHOR.                 W. ROXBURY.
      *INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
      *REMARKS.           ***  THIS IS THE CRAFTSMAN'S FUNCTIONS SUB-EXECUTIVE
      *                        RUN FROM TEXEHELP EXECUTIVE PROGRAM
      *                        SUBROUTINES CALLED:
      *                            TMESSAGE
      *                            TGETNEXT
      *                            TBBNEWS
      *                            TDISPMES
      *                            TQUPDATE
      *                            TALWONO
      *                            THELPSUB
      *                            ****.

      *C   03/11/1998   CA YODER   REQ #97-1125
      *C     CHANGED PASSWORD FROM 6 TO 8 FOR CALL TO "TPERPASS."
      *C
      *C   03/05/2002   GEISER
      *C     WIPED OUT ALL PERSONNEL DATA IF PASSWORD NOT CORRECT.
      *C
      *C   05/28/2002   GEISER
      *C     SKIPPED WO UPDATE PASSWORD CHECK FOR LAWTON ZONE Z1B.
      *C     PER BOB NESSELROADE.
      *C
      *C   01/01/2010   CA YODER
      *C     ADDED LOGIC TO UPDATE THE WORKORDER LETTER FOR THE YEAR
      *C     TO INCREASE THE CYCLE BEYOND 10 YEAR.  COPIED LOGIC FROM
      *C     TNEWWONU (COMMENTS INCLUDED BELOW).
      *C
      *C  IN ORDER TO HOLD DATA LONGER THAN 10 YEARS, CHANGE THE BASE METHOD FOR
      *C  CREATING A WORK ORDER NUMBER, BY STOPPING THE PROCESS OF WRAPPING THE
      *C  LETTER TO IDENTIFY THE YEAR FOR EACH DECADE. FOR W/O CREATED IN 2010,
      *C  INSTEAD OF USING LETTER A AGAIN, USE LETTER L AND SO ON. SKIP USING I,
      *C  O,  Q, AND  U TO AVOID CONFUSION.
      *C
      *C                    20 YEAR PATTERN
      *C
      *C   2000-2009    A-K
      *C   2010-2019    M-Y
      *C   2020-2029    A-K
      *C   2030-2039    M-Y
      *C   2040-2049    A-K
      *C   2050-2059    M-Y
      *C
      *C   06/25/2010   CA YODER    REQ# 2010-10920873
      *C     REMOVED HARD-CODED LOGIC FOR PASSWORD CHECK FOR LAWTON.
      *C

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       SPECIAL-NAMES.          REQUESTOR IS WORK-STATION
                               SYSTEM-CONSOLE IS CONSOLE
                               LOCAL-DATA IS LOCAL-DATA-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT WO-BASIC
                  ASSIGN       TO DATABASE-MCFLMM1001
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-PLANNED
                  ASSIGN       TO DATABASE-MCFLMM1101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT PER-PERSONNEL
                  ASSIGN       TO DATABASE-MCFLMM0301
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-OPEN-QUEUE
                  ASSIGN       TO DATABASE-MCFLMM1903
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT CURRENT-LABOR
                  ASSIGN       TO DATABASE-MCFLMM1601
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-CRAFTS-REQD
                  ASSIGN       TO DATABASE-MCFLMM0601
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT EQP-EQUIPMENT
                  ASSIGN       TO DATABASE-MCFLMM0201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZCFTHELP-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  WO-BASIC
           LABEL RECORDS ARE STANDARD.
       01  VWO-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1001.

       FD  WO-PLANNED
           LABEL RECORDS ARE STANDARD.
       01  PWO-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.

       FD  PER-PERSONNEL
           LABEL RECORDS ARE STANDARD.
       01  PERS-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0301.

       FD  WO-OPEN-QUEUE
           LABEL RECORDS ARE STANDARD.
       01  WOQ-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1903.

       FD  CURRENT-LABOR
           LABEL RECORDS ARE STANDARD.
       01  LC-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1601.

       FD  WO-CRAFTS-REQD
           LABEL RECORDS ARE STANDARD.
       01  CR-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0601.

       FD  EQP-EQUIPMENT
           LABEL RECORDS       ARE STANDARD.
       01  EQP-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0201.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  SAFETY-FLAG         PIC S9(4)  COMP-4 VALUE 0.
       77  RESERVE-SW          PIC S9(4)  COMP-4 VALUE 0.
       77  RESET-SW            PIC S9(4)  COMP-4 VALUE 0.
       77  DELAY-SW            PIC S9(4)  COMP-4 VALUE 0.
       77  HELP-SW             PIC S9(4)         VALUE 0.
       77  ARG-NO              PIC S9(9)  COMP-4.
       77  HOLD-NFNAME         PIC X(16).
       77  SUB                 PIC S9(4)  COMP-4 VALUE 0.
       77  SUB1                PIC S9(4)  COMP-4.
       77  FILE-SW             PIC X VALUE "B".
       77  WORK-SW             PIC X VALUE "U".
           88  UNASSIGNED            VALUE "U".
           88  ASSIGNED              VALUE "A".
       77  WO-YR-SAVE          PIC X.
       77  QUEUE-SW            PIC X VALUE SPACE.
       77  QUEUE-ERROR         PIC X(76).
       77  RETURN-NUM          PIC 9 VALUE 9.
       77  FUNCTION-CODE       PIC XX.
       77  RETURN-COD          PIC XX.
       77  CRAFT-KEY           PIC XX.
       77  TEMP-ZONE           PIC X(04).
       77  NEXT-WO-BUF         PIC X(10).
       77  PPS-SW              PIC S9(4)       VALUE 0  COMP-4.
       77  PPS-REPEATER        PIC S9(4)       VALUE 0  COMP-4.
       77  FIELD-NUMBER        PIC S9(4)       VALUE 1  COMP-4.
       77  TRUE-VAL            PIC 1           VALUE B"1".

       01  FILE-STAT.
           05  FILE-STAT-1     PIC X  VALUE "0".
           05  FILE-STAT-2     PIC X  VALUE "0".

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TCFTHELP".
           05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " J0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-AA    PIC X(30) VALUE
                   "CRAFTSMAN FUNCTIONS OF THE CRA".
               10  PROG-DESC-AB    PIC X(30) VALUE
                   "FTSMAN's EXECUTIVE PROGRAM.   ".
               10  PROG-DESC-BA    PIC X(30) VALUE
                   "PRIMARY MENU FOR WORKORDER UPD".
               10  PROG-DESC-BB    PIC X(30) VALUE
                   "ATE OPERATIONS FROM THE ZONES ".
               10  PROG-FUNCTION-1 PIC X(30) VALUE
                   "AND MAINTENANCE AREAS IN THE P".
               10  PROG-FUNCTION-2 PIC X(30) VALUE
                   "LANT.                         ".
           05  PASSWORD-FLAG       PIC X.

       01  QUEUE-WO-DATA.
           05  QUEUE-WO-SAVE   PIC X(10).
           05  QUEUE-RESET     PIC X.

       01  LV-BUF-DATA.
           05  LV-DATA.
               10  LV-SKILL    PIC XX.
               10  LV-NS-FLAG  PIC X.
               10  FILLER      PIC X(07).
           05  LV-SW           PIC 9.

       01  SAVE-NFNAME.
           05  NFNAME          PIC X(08).
           05  FILLER          PIC X(08).

       01  CUR-DATE-WA.
           02  CUR-DATE-YY.
               04  CD-YY-1     PIC X.
               04  CD-YY-2     PIC X.
           02  CUR-DATE-MM     PIC XX.
           02  CUR-DATE-DD     PIC XX.

       01  YEAR-DESIGNATOR.
           05  YEAR-TABLE.
               10  YD-0        PIC X  VALUE "A".
               10  YD-1        PIC X  VALUE "B".
               10  YD-2        PIC X  VALUE "C".
               10  YD-3        PIC X  VALUE "D".
               10  YD-4        PIC X  VALUE "E".
               10  YD-5        PIC X  VALUE "F".
               10  YD-6        PIC X  VALUE "G".
               10  YD-7        PIC X  VALUE "H".
               10  YD-8        PIC X  VALUE "J".
               10  YD-9        PIC X  VALUE "K".
           05  YEAR-COUNTER    REDEFINES YEAR-TABLE.
               10  YEARC       OCCURS 10 TIMES PIC X.

      *----- 1/01/2010:  TABLE ADDED BELOW.
      **********************************************************************
      *
      *    2010-2019    M-Y
      *    2030-2039    M-Y
      *    2050-2059    M-Y
      *
      **********************************************************************
      *
       01 YEAR-DESIGNATOR2.
          02  YEAR-TABLE2.
              03  FILLER       PIC X VALUE "M".
              03  FILLER       PIC X VALUE "N".
              03  FILLER       PIC X VALUE "P".
              03  FILLER       PIC X VALUE "R".
              03  FILLER       PIC X VALUE "S".
              03  FILLER       PIC X VALUE "T".
              03  FILLER       PIC X VALUE "V".
              03  FILLER       PIC X VALUE "W".
              03  FILLER       PIC X VALUE "X".
              03  FILLER       PIC X VALUE "Y".

       01  PERS-DATA.
           05  PER-CC          PIC XXXX.
           05  PER-ZONE        PIC XXXX.
           05  PER-SKILL       PIC XX.

       01  SCREEN-DATA.
           05  INPUT-BUFFER.
               10  CC-BUF                    PIC X(04).
               10  ZONE-BUF                  PIC X(04).
           05  OUTPUT-BUFFER.
               10  CC-NUM                    PIC X(04).
               10  NAME-BUF                  PIC X(16).
               10  CURWO-BUF                 PIC X(10).
           05  SELECT-FIELDS.
               10  NEXT-WO-BUFFER.
                   15  NWO-BUF               PIC X(10).
                   15  EQUIP-BUF             PIC X(06).
                   15  LOCA-BUF              PIC X(08).
                   15  DESC-BUF              PIC X(30).
               10  CW-BUFFER.
                   15  FC-BUF.
                       20  F-BUF             PIC X.
                       20  C-BUF             PIC X.
                   15  SUBS-BUF.
                       20  S-1               PIC X.
                       20  S-2               PIC X.
                       20  S-3               PIC X.
                       20  S-4               PIC X.
               10  IP-BUFFER.
                   15  NEWO-BUF.
                       20  NEWO-NUM          PIC X(06).
                       20  NEWO-YR           PIC X.
                       20  NEWO-SUF          PIC XXX.
               10  DWO-BUFFER.
                   15  DWO-BUF.
                       20  DWO-NUM           PIC X(06).
                       20  DWO-YR            PIC X.
                       20  DWO-SUF           PIC XXX.
               10  LV-BUFFER.
                   15  LV-BUF                PIC X.
                   15  NS-BUF                PIC XX.
                   15  HM-BUF                PIC X.
                   15  LVNW-BUF.
                       20  LVNW-NUM          PIC X(06).
                       20  LVNW-YR           PIC X.
                       20  LVNW-SUF          PIC XXX.
           05  CMDMSG                        PIC X(79).
           05  ERRMSG                        PIC X(79).

       01  RESERVE-LIST-DATA.
           05  FILLER          PIC XX.
           05  RL-QUEUE        PIC 99.
           05  FILLER          PIC XXXX.
           05  RL-WO-NUM       PIC X(10).
           05  FILLER          PIC XX.
           05  RL-EQUIP        PIC X(06).
           05  FILLER          PIC XX.
           05  RL-DOWN         PIC X.
           05  FILLER          PIC XXX.
           05  RL-DESC         PIC X(30).
           05  FILLER          PIC X(06).
           05  RL-OTHER        PIC XXX.

       01  RESERVE-SCREEN.
           05  DBUF1.
               10  DISBUF1     PIC X(38).
               10  DISBUF2     PIC X(38).
           05  DBUF2.
               10  DISBUF3     PIC X(38).
               10  DISBUF4     PIC X(38).
           05  RESERVE-LIST-TABLE.
               10  RL-TABLE    OCCURS 5 TIMES PIC X(71).
           05  CMDMSGR         PIC X(79).
           05  ERRMSGR         PIC X(79).

       01  CNUM-BUFFER.
           05  CNUM-BUF        PIC X(04).
           05  CNAM-BUF        PIC X(16).

       01  PWORD-BUFFER.
      *----------- EXPANDED PASSWORD FROM 6 TO 8 CHARACTERS.
      **** 05  PWORD-BUF       PIC X(06).
           05  PWORD-BUF       PIC X(08).
           05  PWD-X           PIC XX.
           05  DATE-BUFF       REDEFINES PWD-X  PIC 9(4) COMP-4.
       01  PWORD-SWITCH        PIC X.

       01  EQUIP-BUFFER.
           05  EQUIP-VALUES.
               10  EQP01       PIC X(06) VALUE "SAFE01".
               10  EQP02       PIC X(06) VALUE "SAFE02".
               10  EQP03       PIC X(06) VALUE "SAFE03".
               10  EQP04       PIC X(06) VALUE "SAFE04".
               10  EQP05       PIC X(06) VALUE "SAFE05".
               10  EQP06       PIC X(06) VALUE "SAFE06".
               10  EQP07       PIC X(06) VALUE "SAFE07".
               10  EQP08       PIC X(06) VALUE "SAFE08".
               10  EQP09       PIC X(06) VALUE "SAFE09".
               10  EQP10       PIC X(06) VALUE "SAFE10".
               10  EQP11       PIC X(06) VALUE "SAFE11".
               10  EQP12       PIC X(06) VALUE "SAFE12".
               10  EQP13       PIC X(06) VALUE "SAFE13".
               10  EQP14       PIC X(06) VALUE "SAFE14".
               10  EQP15       PIC X(06) VALUE "SAFE15".
               10  EQP16       PIC X(06) VALUE "SAFE16".
               10  EQP17       PIC X(06) VALUE "SAFE17".
               10  EQP18       PIC X(06) VALUE "SAFE18".
           05  EQP-VAL         REDEFINES EQUIP-VALUES.
               10  EQPVAL      OCCURS 18 TIMES  PIC X(06).

       01  MSG-AREA.
           05  CNUM-MSG        PIC X(04).
           05  WONUM-MSG       PIC X(10).
           05  MESSAGE-BUF     PIC X(76).

       01  MESSAGE-BUFFER.
           05  MSG-TEXT        PIC X(68)  VALUE SPACE.
           05  MSG-FLD         PIC X(08)  VALUE SPACE.

       01  DATA-BUFFER.
           05  WOCW-BUF        PIC X(10).
           05  FAILC-BUF       PIC X(06).
           05  EDOWN-BUF       PIC X.
           05  EDOWN-CW-BUF    PIC X.

       01  EXECUTIVE-DATA.
           05  X-WO-NUM        PIC X(10).
           05  X-CC-NUM        PIC X(04).
           05  X-EQUIP-NUM     PIC X(06).
           05  X-PARTS.
               10  PART-1      PIC X(07).
               10  PART-2      PIC X(07).
               10  PART-3      PIC X(07).
               10  PART-4      PIC X(07).
               10  PART-5      PIC X(07).
               10  PART-6      PIC X(07).
               10  PART-7      PIC X(07).
               10  PART-8      PIC X(07).

       01  DB-ERROR.
           05  DB-FUNC   PIC X(10) VALUE SPACES.
           05  DB-FILE   PIC X(18) VALUE SPACES.
           05  FILLER    PIC X(20) VALUE "ERROR - FILE-STAT = ".
           05  CON-WORD  PIC XX.

           COPY SCREENIO       IN COPYLIB.

           COPY CATREAD        IN COPYLIB.

           COPY JCWAREA        IN COPYLIB.

       01  EQUIPMENT-DATA.
           COPY MEQPFILE       IN COPYLIB.

       01  WO-BASIC-DATA.
           COPY DWOBASIC       IN COPYLIB.

       01  WO-PLANNED-DATA.
           COPY DWOPLAN        IN COPYLIB.

       01  WO-PERS-DATA.
           COPY MPERSONL       IN COPYLIB.

       01  WO-QUEUE-DATA.
           COPY DWOOPENQ       IN COPYLIB.

       01  CRAFT-DATA.
           COPY MWOCRAFT       IN COPYLIB.

       01  LABOR-CURR-DATA.
           COPY DCURRLBR       IN COPYLIB.

       LINKAGE SECTION.
       01  WO-TRACK-DATA.
           COPY DWOTRACK       IN COPYLIB.

       01  PLANT-ID            PIC X(04).

       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       PROCEDURE DIVISION      USING WO-TRACK-DATA
                               PLANT-ID
                               DBPARAMETERS.
       CHECK-PASSWORD.
           CALL "TPWORD"       USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG NOT = "N"
               GO TO BEGIN.
           GOBACK.

       BEGIN.
           ACCEPT MC-LOCAL-DATA-AREA FROM LOCAL-DATA-AREA.
           OPEN I-O            DISPLAY-FILE.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN FILE OPEN ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO 9-EOJ.

           OPEN INPUT          WO-BASIC.
           OPEN INPUT          WO-PLANNED.
           OPEN INPUT          PER-PERSONNEL.
           OPEN INPUT          WO-OPEN-QUEUE.
           OPEN INPUT          CURRENT-LABOR.
           OPEN INPUT          WO-CRAFTS-REQD.
           OPEN INPUT          EQP-EQUIPMENT.
           MOVE SPACES         TO EXECUTIVE-DATA WO-QUEUE-DATA
                                  SCREEN-DATA CNUM-BUFFER
                                  SAVE-NFNAME PERS-DATA
                                  QUEUE-RESET QUEUE-WO-SAVE.
           MOVE "CRFTEXEC"     TO NFNAME.
           MOVE 0              TO RESET-SW SAFETY-FLAG HELP-SW.

      *********************************************************
      **  IF JCW-WOLOCK-263 IS SET TO ANY NON-SPACE VALUE,   **
      **  THE SYSTEM WILL REQUIRE PERSONNEL PASSWORDS FOR    **
      **  ALL WORKORDER ACTIVITY (IP, LV, CW, ETC)           **
      *********************************************************
           MOVE 0              TO PPS-SW.
           IF JCW-WOLOCK-263 NOT = " "
               MOVE 1          TO PPS-SW.

      *********************************************************
      **  IF JCW-MULTIWO-264 IS SET TO ANY NON-SPACE VALUE,  **
      **  THE SYSTEM WILL ALLOW RESERVATION OF MULTIPLE WO's **
      *********************************************************
           MOVE 0              TO RESERVE-SW.
           IF JCW-MULTIWO-264 NOT = " "
               MOVE 1          TO RESERVE-SW.

           PERFORM READ-SAFE   VARYING SUB FROM 1 BY 1
                               UNTIL SUB > 18.

           MOVE "ZCFTHELP"     TO SCREEN-FILE.
           MOVE "Y"            TO SCREEN-SW.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

       MAIN.
           ACCEPT CUR-DATE-WA  FROM DATE.
           MOVE CD-YY-2        TO SUB1.
      *-----------------------------------------------*
      *--- 1/1/2010: ADD LOGIC TO USE SECOND TABLE, IF NECESSARY.
      *-----------------------------------------------*
           IF CD-YY-1 = 1 OR 3 OR 5 OR 7 OR 9
             MOVE YEAR-DESIGNATOR2 TO YEAR-DESIGNATOR.
      *-----------------------------------------------*
           ADD 1               TO SUB1.
           MOVE YEARC (SUB1)   TO WO-YR-SAVE.
           MOVE SAVE-NFNAME    TO SCREEN-NAME.
           MOVE SPACES         TO INPUT-BUFFER.

           IF NFNAME = "CRFTEXEC"
               MOVE SPACES     TO SELECT-FIELDS.

           IF CNUM-BUFFER = SPACES
               MOVE SPACES     TO SCREEN-DATA
               MOVE 0          TO PPS-REPEATER.

           IF CC-NUM = SPACES
      **********************************************************************
      **    MESSAGE 031/017:
      ** ENTER CLOCK CARD NUMBER AND PRESS 'ENTER'
      **********************************************************************
               MOVE  31        TO CATREAD-MSG-SET
               MOVE  17        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO CMDMSG
           ELSE
      **********************************************************************
      **    MESSAGE 042/017:
      ** PRESS APPROPRIATE FUNCTION KEY TO CONTINUE
      **********************************************************************
               MOVE  42        TO CATREAD-MSG-SET
               MOVE  17        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO CMDMSG.

           IF SCREEN-NAME = "CEXECASN"
               IF RESERVE-SW > 0
                   PERFORM RESERVE-FUNCTION.

       SHOWFORM.
           IF RESET-SW > 0
               MOVE RESET-SW   TO KEY-HIT
               MOVE 0          TO RESET-SW
               GO TO SEARCH-KEY.

           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO 9-EOJ.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.

           IF SCREEN-STATUS = "TO"
               MOVE "00"       TO SCREEN-STATUS .
      *        MOVE "CRFTEXEC" TO NFNAME
      *        MOVE SPACES     TO EXECUTIVE-DATA PERS-DATA
      *        MOVE SPACES     TO SCREEN-DATA CNUM-BUFFER
      *        MOVE 0          TO PPS-REPEATER
      *        PERFORM RE-QUEUE-FUNCTION THRU RQF-EXIT
      *        GO TO MAIN.

           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO 9-EOJ.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE SPACES         TO CMDMSG.

           IF KEY-HIT = 3
               MOVE 0          TO HELP-SW
               GO TO 9-EOJ.

           IF KEY-HIT = 6
               PERFORM RE-QUEUE-FUNCTION THRU RQF-EXIT
               CALL "THELPSUB" USING EXECUTIVE-DATA
                               PLANT-ID
                               WO-TRACK-DATA
                               DBPARAMETERS
                               CNUM-BUFFER
               IF CNUM-BUF = SPACES
                   MOVE 7      TO KEY-HIT
               ELSE
                   MOVE CNUM-BUF TO CC-BUF
                   GO TO GET-DATA.

           IF KEY-HIT = 7
               MOVE "CRFTEXEC" TO NFNAME
               MOVE SPACES     TO EXECUTIVE-DATA PERS-DATA
               MOVE SPACES     TO SCREEN-DATA CNUM-BUFFER
               MOVE 0          TO PPS-REPEATER
               PERFORM RE-QUEUE-FUNCTION THRU RQF-EXIT
               GO TO MAIN.

           IF KEY-HIT = 0
               IF NFNAME = "CRFTEXEC"
                   GO TO GET-DATA
               ELSE
      **********************************************************************
      **    MESSAGE 042/017:
      ** PRESS APPROPRIATE FUNCTION KEY TO CONTINUE
      **********************************************************************
                   MOVE  42    TO CATREAD-MSG-SET
                   MOVE  17    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO CMDMSG
                   GO TO SHOWFORM.

           MOVE 0              TO RESET-SW.

           IF CC-BUF NOT = SPACES
               MOVE KEY-HIT    TO RESET-SW
               GO TO GET-DATA.

           IF CNUM-BUF = SPACES
               GO TO GET-DATA.

       SEARCH-KEY.
      *****  f1  MOVES CC NUM `IP' ON AUTOMATICALLY SELECTED WO  *****
           IF KEY-HIT = 1
               IF UNASSIGNED THEN
                   GO TO 1-MAIN
               ELSE
               IF RESERVE-SW > 0
                   PERFORM RESERVATION-LIST THRU RL-EXIT
                   GO TO SHOWFORM
               ELSE
                   GO TO SHOWFORM
           ELSE
      *****  f2  CLOSES A WORKORDER  (CW)  *****
           IF KEY-HIT = 2
               IF ASSIGNED THEN
                   GO TO 2-MAIN
               ELSE
                   GO TO SHOWFORM
           ELSE
      *****  f8  LEAVE A WORKORDER  (LV) - FOUR WAYS TO LV  *****
           IF KEY-HIT = 8
               IF ASSIGNED THEN
                   GO TO 3-MAIN
               ELSE
                   GO TO SHOWFORM
           ELSE
      *****  f4  MOVES CC NUM `IP' ON NEW WORKORDER  ****
           IF KEY-HIT = 4
               IF UNASSIGNED THEN
                   GO TO 4-MAIN
               ELSE
                   GO TO SHOWFORM
           ELSE
      *****  f5  DISPLAY SELECTED WORKORDER  *****
           IF KEY-HIT = 5
                   GO TO 5-MAIN
           ELSE
               GO TO SHOWFORM.

       GET-DATA.
           MOVE SPACES         TO QUEUE-RESET QUEUE-WO-SAVE.
           IF CC-BUF = "NEWS"
               MOVE SPACES     TO CNUM-BUFFER
               CALL "TBBNEWS"  USING  DBPARAMETERS
                               PERS-DATA
               IF PER-CC NOT = SPACES
                   MOVE SAVE-NFNAME TO SCREEN-NAME
                   MOVE PER-CC TO CC-BUF
               ELSE
                   GO TO MAIN.

           IF CC-BUF = "    "
      **********************************************************************
      **    MESSAGE 035/047:
      ** INVALID CLOCK CARD NUMBER
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE  47        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE SPACES     TO SELECT-FIELDS
               PERFORM 8-ERROR
               GO TO SHOWFORM.

           IF CC-BUF = "9999"
      **********************************************************************
      **    MESSAGE 035/047:
      ** INVALID CLOCK CARD NUMBER
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE  47        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE SPACES     TO SELECT-FIELDS
               PERFORM 8-ERROR
               GO TO SHOWFORM.

           MOVE CC-BUF         TO PERCCNUM OF PER-PERSONNEL.
           READ PER-PERSONNEL  INTO WO-PERS-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE 0          TO RESET-SW
               MOVE "CRFTEXEC" TO SCREEN-NAME NFNAME
      **********************************************************************
      **    MESSAGE 035/047:
      ** INVALID CLOCK CARD NUMBER
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE  47        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE SPACES     TO SELECT-FIELDS
               MOVE FILE-STAT  TO MSG-FLD
               PERFORM 8-ERROR
               GO TO SHOWFORM.

      *------ REMOVED LAWTON-SPECIFIC LOGIC.   2010-10920873
      ***  IF PLANT-ID = "153" AND PER-MAINT-ZONE = "Z1B "
      ***      NEXT SENTENCE
      ***  ELSE
           IF PPS-SW = 1
               IF PPS-REPEATER = 0
                   MOVE CC-BUF       TO CNUM-BUF
                   MOVE PER-EMP-NAME TO CNAM-BUF
                   MOVE PER-PWORD    TO PWORD-BUFFER
                   CALL "TPERPASS" USING CNUM-BUF
                                   CNAM-BUF
                                   PWORD-BUFFER
                                   PWORD-SWITCH
                   IF PWORD-SWITCH = "N"
                       MOVE SPACES   TO PERS-DATA
                                        INPUT-BUFFER
                                        OUTPUT-BUFFER
                                        CNUM-BUFFER
                                        PWORD-BUFFER
                       GO TO MAIN
                   ELSE
                       MOVE 1  TO PPS-REPEATER.

           MOVE CC-BUF         TO CC-NUM CNUM-BUF X-CC-NUM.
           MOVE KEY-HIT        TO DELAY-SW.
           MOVE SPACES         TO MSG-AREA.
           MOVE CNUM-BUF       TO CNUM-MSG.
           MOVE SCREEN-NAME    TO HOLD-NFNAME.

           MOVE MESSAGE-BUFFER TO MESSAGE-BUF.
           CALL "TDISPMES"     USING DBPARAMETERS
                               MSG-AREA.

           MOVE SPACES         TO MESSAGE-BUFFER.
           MOVE DELAY-SW       TO KEY-HIT.
           MOVE HOLD-NFNAME    TO SCREEN-NAME.
           MOVE SPACES         TO CC-BUF SELECT-FIELDS WO-BASIC-DATA.
           MOVE PER-EMP-NAME   TO CNAM-BUF NAME-BUF.
           MOVE ZONE-BUF       TO TEMP-ZONE.
           MOVE 1              TO RETURN-NUM.
           MOVE "UNASSIGNED"   TO CURWO-BUF.
           MOVE "U"            TO WORK-SW.
           MOVE SPACES         TO EXECUTIVE-DATA.
           MOVE WO-YR-SAVE     TO NEWO-YR DWO-YR.
           MOVE "CEXECUNA"     TO SCREEN-NAME NFNAME.

      **********************************************************************
      **    MESSAGE 042/017:
      ** PRESS APPROPRIATE FUNCTION KEY TO CONTINUE
      **********************************************************************
           MOVE  42            TO CATREAD-MSG-SET.
           MOVE  17            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CMDMSG.
           MOVE SPACES         TO WO-QUEUE-DATA.

           MOVE CNUM-BUF       TO PERCCNUM OF CURRENT-LABOR.
           READ CURRENT-LABOR  INTO LABOR-CURR-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "23" OR "10" OR "14" OR "46"
               CALL "TGETNEXT" USING DBPARAMETERS
                               WO-QUEUE-DATA
                               WO-PERS-DATA
                               WO-BASIC-DATA
                               CNUM-BUFFER
                               TEMP-ZONE
                               MESSAGE-BUFFER
                               RETURN-NUM
               GO TO GET-DATA-CONT
           ELSE
           IF FILE-STAT NOT = ZEROS
               MOVE 0          TO RESET-SW
               MOVE FILE-STAT  TO CON-WORD
               MOVE "READ    " TO DB-FUNC
               MOVE "CURRENT-LABOR" TO DB-FILE
               MOVE DB-ERROR   TO MESSAGE-BUFFER
               MOVE 1          TO FIELD-NUMBER
               MOVE FILE-STAT  TO MSG-FLD
               PERFORM 8-ERROR
               GO TO SHOWFORM.

           MOVE SPACES         TO SELECT-FIELDS.
           MOVE LCS-WO-NUM     TO CURWO-BUF.
           MOVE "A"            TO WORK-SW.
           MOVE "CEXECASN"     TO SCREEN-NAME NFNAME.
           MOVE WO-YR-SAVE     TO LVNW-YR DWO-YR.

      **********************************************************************
      **    MESSAGE 042/017:
      ** PRESS APPROPRIATE FUNCTION KEY TO CONTINUE
      **********************************************************************
           MOVE  42            TO CATREAD-MSG-SET.
           MOVE  17            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CMDMSG.

           MOVE LCS-WO-NUM     TO WONUM OF WO-BASIC
                                  WONUM OF WO-PLANNED.
           START WO-BASIC      KEY = WONUM OF WO-BASIC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = ZEROS
               IF LCS-WO-NUM = WONUM OF WO-BASIC
                   GO TO READ-BASIC-FILE.

           START WO-PLANNED    KEY = WONUM OF WO-PLANNED
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = ZEROS
               IF LCS-WO-NUM = WONUM OF WO-PLANNED
                   GO TO READ-PLANNED-FILE.

           GO TO GET-DATA-CONT.

       READ-BASIC-FILE.
           READ WO-BASIC       INTO WO-BASIC-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = ZEROS
               MOVE SPACES     TO EXECUTIVE-DATA PERS-DATA
               MOVE CC-NUM     TO X-CC-NUM
               MOVE WO-NUM     TO X-WO-NUM
               MOVE EQUIP-NUM  TO X-EQUIP-NUM
               MOVE SPACES     TO WO-PLANNED-DATA
               GO TO GET-DATA-CONT.

       READ-PLANNED-FILE.
           READ WO-PLANNED     INTO WO-PLANNED-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = ZEROS
               MOVE SPACES         TO EXECUTIVE-DATA PERS-DATA
               MOVE CC-NUM         TO X-CC-NUM
               MOVE WO-NUM-PLANNED TO X-WO-NUM
               MOVE EQUIP-NUM-P    TO X-EQUIP-NUM
               MOVE SPACES         TO WO-BASIC-DATA.

       GET-DATA-CONT.
           IF RETURN-NUM = 0
               MOVE WO-NUM        TO NWO-BUF QUEUE-WO-SAVE
               MOVE EQUIP-NUM     TO EQUIP-BUF
               MOVE LOCATION      TO LOCA-BUF
               MOVE DESCRIPTION-1 TO DESC-BUF
               MOVE SPACES        TO ERRMSG.

           IF SCREEN-NAME = "CEXECASN"
               IF RESERVE-SW > 0
                   PERFORM RESERVE-FUNCTION.
           GO TO SHOWFORM.

       RE-QUEUE-FUNCTION.
           IF QUEUE-RESET NOT = " "
               GO TO RQF-EXIT
           ELSE
           IF WORK-SW = "U"
               IF WO-QUEUE-DATA NOT = SPACES
                   IF Q-CHKOUT = "XX"
                       MOVE "9999" TO Q-CC-NUM
                       MOVE "  "   TO Q-CHKOUT
                   ELSE
                       MOVE "  "   TO Q-CHKOUT
               ELSE
                   GO TO RQF-EXIT
           ELSE
               GO TO RQF-EXIT.

           MOVE "U"            TO QUEUE-SW.
           CALL "TQUPDATE"     USING DBPARAMETERS
                               WO-QUEUE-DATA
                               QUEUE-SW
                               QUEUE-ERROR.
           MOVE SPACES         TO WO-QUEUE-DATA.

       RQF-EXIT.               EXIT.

       DEL-QUEUE-FUNCTION.
           IF WO-QUEUE-DATA NOT = SPACES
               MOVE "D"    TO QUEUE-SW
               CALL "TQUPDATE" USING DBPARAMETERS
                               WO-QUEUE-DATA
                               QUEUE-SW
                               QUEUE-ERROR
               MOVE SPACES     TO WO-QUEUE-DATA.

       1-MAIN.
           MOVE "B"            TO FILE-SW.
           IF NWO-BUF = SPACES
      **********************************************************************
      **    MESSAGE 049/011:
      ** WORK ORDER NOT AVAILABLE FOR AUTOMATIC ASSIGNMENT
      **********************************************************************
               MOVE  49        TO CATREAD-MSG-SET
               MOVE  11        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               PERFORM 8-ERROR
               GO TO MAIN.

           MOVE NWO-BUF        TO NEXT-WO-BUF
                                  WONUM OF WO-BASIC.
           READ WO-BASIC       INTO WO-BASIC-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
      **********************************************************************
      **    MESSAGE 035/040:
      ** INVALID WORKORDER NUMBER
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE  40        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE FILE-STAT  TO MSG-FLD
               PERFORM 8-ERROR
               GO TO MAIN.

           MOVE SPACES         TO MESSAGE-BUFFER MSG-AREA.
           MOVE WO-NUM         TO WONUM-MSG.
           PERFORM DISPLAY-WO-MSGS.
           CALL "TIPNEWWO"     USING DBPARAMETERS
                               QUEUE-WO-DATA
                               WO-BASIC-DATA
                               WO-PLANNED-DATA
                               WO-TRACK-DATA
                               CNUM-BUFFER
                               MESSAGE-BUFFER
                               FILE-SW.
           MOVE CC-NUM         TO CC-BUF.
           PERFORM DEL-QUEUE-FUNCTION.
           GO TO GET-DATA.

       2-MAIN.
           MOVE SPACES         TO MESSAGE-BUFFER.
           MOVE CURWO-BUF      TO WOCW-BUF.
           MOVE CW-BUFFER      TO FAILC-BUF.
           MOVE SPACES         TO LV-BUF-DATA RETURN-BYTE.
           MOVE "CW"           TO FUNCTION-CODE.

           CALL "TAPPORTN"     USING CNUM-BUFFER
                               FUNCTION-CODE
                               DATA-BUFFER
                               LV-BUF-DATA
                               DBPARAMETERS
                               WO-TRACK-DATA
                               LABOR-CURR-DATA.
           IF KEY-HIT = 7
                   GO TO MAIN
           ELSE
           IF KEY-HIT = 3
               MOVE "CRFTEXEC" TO NFNAME
               MOVE SPACES     TO EXECUTIVE-DATA PERS-DATA
               MOVE SPACES     TO SCREEN-DATA CNUM-BUFFER
               MOVE 0          TO PPS-REPEATER
               PERFORM RE-QUEUE-FUNCTION THRU RQF-EXIT
               GO TO MAIN.

           IF MESSAGE-BUFFER = SPACES
               MOVE CC-NUM     TO CC-BUF
               GO TO GET-DATA.

           MOVE SAVE-NFNAME    TO SCREEN-NAME.
           MOVE 11             TO FIELD-NUMBER.
           PERFORM 8-ERROR.
           GO TO SHOWFORM.

       3-MAIN.
           MOVE "CF8LVWO"      TO SCREEN-NAME.

       3-READ.
           IF LVNW-YR = SPACE  MOVE WO-YR-SAVE TO LVNW-YR.

           IF SPACES = LV-BUF AND NS-BUF AND HM-BUF AND LVNW-NUM
      **********************************************************************
      **    MESSAGE 041/019:
      ** ONE REASON FOR LEAVING REQUIRED
      **********************************************************************
               MOVE  41        TO CATREAD-MSG-SET
               MOVE  19        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 18         TO FIELD-NUMBER
               MOVE MESSAGE-BUFFER TO CMDMSG
               MOVE TRUE-VAL       TO IND (18)
               GO TO 3-SHOWFORM.

           MOVE 0              TO LV-SW.
           IF LV-BUF   NOT = SPACES ADD 1 TO LV-SW.
           IF NS-BUF   NOT = SPACES ADD 1 TO LV-SW.
           IF HM-BUF   NOT = SPACES ADD 1 TO LV-SW.
           IF LVNW-NUM NOT = SPACES ADD 1 TO LV-SW.
           IF LV-SW > 1
      **********************************************************************
      **    MESSAGE 041/020:
      ** ONLY ONE REASON FOR LEAVING PERMITTED
      **********************************************************************
               MOVE  41        TO CATREAD-MSG-SET
               MOVE  20        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 18         TO FIELD-NUMBER
               MOVE MESSAGE-BUFFER TO CMDMSG
               MOVE TRUE-VAL   TO IND (18)
               GO TO 3-SHOWFORM.

           IF LV-BUF   NOT = SPACE  GO TO 3-LV-WO-NOT-CW.
           IF NS-BUF   NOT = SPACES GO TO 3-LV-NEW-SKILL.
           IF HM-BUF   NOT = SPACE  GO TO 3-LV-HOLD-FOR-MATERIALS.
           IF LVNW-NUM NOT = SPACES GO TO 3-LV-NEW-WORKORDER.
           GO TO 3-SHOWFORM.

       3-LV-WO-NOT-CW.
           MOVE SPACES         TO MESSAGE-BUFFER.
           MOVE 1              TO LV-SW.
           MOVE CURWO-BUF      TO WOCW-BUF.
           MOVE "LV"           TO FUNCTION-CODE.
           CALL "TAPPORTN"     USING CNUM-BUFFER
                               FUNCTION-CODE
                               DATA-BUFFER
                               LV-BUF-DATA
                               DBPARAMETERS
                               WO-TRACK-DATA
                               LABOR-CURR-DATA.

           MOVE CC-NUM         TO CC-BUF.
           GO TO GET-DATA.

       3-LV-NEW-SKILL.
           MOVE NS-BUF         TO CRAFT-KEY
                                  CRAFTREQD OF WO-CRAFTS-REQD.
           READ WO-CRAFTS-REQD INTO CRAFT-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
      **********************************************************************
      **    MESSAGE 035/035:
      ** INVALID SKILL
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE  35        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 13         TO FIELD-NUMBER
               MOVE FILE-STAT  TO MSG-FLD
               PERFORM 8-ERROR
               GO TO 3-SHOWFORM.

           MOVE SPACES         TO MESSAGE-BUFFER.
           MOVE NS-BUF         TO LV-SKILL.
           MOVE CRAFT-FLAG     TO LV-NS-FLAG.
           MOVE 2              TO LV-SW.
           MOVE CURWO-BUF      TO WOCW-BUF.
           MOVE "LV"           TO FUNCTION-CODE.
           CALL "TAPPORTN"     USING CNUM-BUFFER
                               FUNCTION-CODE
                               DATA-BUFFER
                               LV-BUF-DATA
                               DBPARAMETERS
                               WO-TRACK-DATA
                               LABOR-CURR-DATA.

           MOVE CC-NUM         TO CC-BUF.
           GO TO GET-DATA.

       3-LV-HOLD-FOR-MATERIALS.
           MOVE SPACES         TO MESSAGE-BUFFER.
           MOVE 3              TO LV-SW.
           MOVE CURWO-BUF      TO WOCW-BUF.
           MOVE "LV"           TO FUNCTION-CODE.

           CALL "TAPPORTN"     USING CNUM-BUFFER
                               FUNCTION-CODE
                               DATA-BUFFER
                               LV-BUF-DATA
                               DBPARAMETERS
                               WO-TRACK-DATA
                               LABOR-CURR-DATA.

           MOVE CC-NUM         TO CC-BUF.
           GO TO GET-DATA.

       3-LV-NEW-WORKORDER.
           MOVE "B"            TO FILE-SW.
           IF LVNW-NUM = SPACES
      **********************************************************************
      **    MESSAGE 031/021:
      ** ENTER WORKORDER NUMBER
      **********************************************************************
               MOVE  31        TO CATREAD-MSG-SET
               MOVE  21        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 15         TO FIELD-NUMBER
               PERFORM 8-ERROR
               GO TO 3-SHOWFORM.

           CALL "TALWONO"      USING LVNW-BUF
                               RETURN-COD.

           MOVE LVNW-BUF       TO WONUM OF WO-BASIC
                                  WONUM OF WO-PLANNED.
           START WO-BASIC      KEY = WONUM OF WO-BASIC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = ZEROS
               IF LVNW-BUF = WONUM OF WO-BASIC
                   GO TO 3-READ-BASIC.

           START WO-PLANNED    KEY = WONUM OF WO-PLANNED
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = ZEROS
               IF LVNW-BUF = WONUM OF WO-PLANNED
                   GO TO 3-READ-PLANNED.

      **********************************************************************
      **    MESSAGE 035/040:
      ** INVALID WORKORDER NUMBER
      **********************************************************************
           MOVE  35            TO CATREAD-MSG-SET.
           MOVE  40            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE 15             TO FIELD-NUMBER.
           PERFORM 8-ERROR.
           GO TO 3-SHOWFORM.

       3-READ-BASIC.
           READ WO-BASIC       INTO WO-BASIC-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               MOVE FILE-STAT  TO CON-WORD
               MOVE "READ    " TO DB-FUNC
               MOVE "WO-BASIC" TO DB-FILE
               MOVE DB-ERROR   TO MESSAGE-BUFFER
               MOVE 15         TO FIELD-NUMBER
               MOVE FILE-STAT  TO MSG-FLD
               PERFORM 8-ERROR
               GO TO 3-SHOWFORM.

           GO TO 3-CONT-PROC.

       3-READ-PLANNED.
           READ WO-PLANNED     INTO WO-PLANNED-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               MOVE FILE-STAT  TO CON-WORD
               MOVE "READ    " TO DB-FUNC
               MOVE "WO-PLANNED" TO DB-FILE
               MOVE DB-ERROR   TO MESSAGE-BUFFER
               MOVE 15         TO FIELD-NUMBER
               MOVE FILE-STAT  TO MSG-FLD
               PERFORM 8-ERROR
               GO TO 3-SHOWFORM.

           IF APPROVAL-CODE-P NOT = "A "
      **********************************************************************
      **    MESSAGE 049/012:
      ** WORK ORDER IS UNAPPROVED
      **********************************************************************
               MOVE  49 TO CATREAD-MSG-SET
               MOVE  12 TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               GO TO 3-LV-BREAK
           ELSE
               MOVE "P"        TO FILE-SW
               MOVE SPACES     TO WO-BASIC-DATA.

       3-CONT-PROC.
           MOVE SPACES         TO MESSAGE-BUFFER.
           MOVE LVNW-BUF       TO LV-DATA.
           MOVE 4              TO LV-SW.
           MOVE CURWO-BUF      TO WOCW-BUF.
           MOVE "LV"           TO FUNCTION-CODE.
           CALL "TAPPORTN"     USING CNUM-BUFFER
                               FUNCTION-CODE
                               DATA-BUFFER
                               LV-BUF-DATA
                               DBPARAMETERS
                               WO-TRACK-DATA
                               LABOR-CURR-DATA.

           IF KEY-HIT = 7 OR 3 GO TO 3-LV-BREAK.

           MOVE "UNASSIGNED"   TO CURWO-BUF.
           MOVE "U"            TO WORK-SW.
           MOVE "CEXECUNA"     TO NFNAME.
           MOVE SPACES         TO EXECUTIVE-DATA.
           MOVE SPACES         TO MESSAGE-BUFFER MSG-AREA.
           MOVE WO-NUM         TO WONUM-MSG NEWO-BUF.
           MOVE SPACES         TO LVNW-BUF.

           IF FILE-SW = "P"
               MOVE WO-NUM-PLANNED TO WONUM-MSG NEWO-BUF.
           PERFORM 4-MAIN.
           GO TO 4-CALL-SUB.

       3-LV-BREAK.
           IF MESSAGE-BUFFER = SPACES
               PERFORM DISPLAY-WO-MSGS
               MOVE CC-NUM     TO CC-BUF
               GO TO GET-DATA.
           MOVE "CF8LVWO"      TO SCREEN-NAME.
           MOVE 15             TO FIELD-NUMBER.
           PERFORM 8-ERROR.

       3-SHOWFORM.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO 9-EOJ.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO 9-EOJ.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 3
               MOVE 30         TO HELP-SW
               GO TO 9-EOJ.

           IF KEY-HIT = 7
               MOVE "CRFTEXEC" TO NFNAME
               MOVE SPACES     TO EXECUTIVE-DATA PERS-DATA
               MOVE SPACES     TO SCREEN-DATA CNUM-BUFFER
               MOVE 0          TO PPS-REPEATER
               PERFORM RE-QUEUE-FUNCTION THRU RQF-EXIT
               MOVE SPACES     TO SELECT-FIELDS
               MOVE WO-YR-SAVE TO LVNW-YR DWO-YR
               GO TO MAIN.

           MOVE SPACES         TO CMDMSG.
           GO TO 3-READ.

       4-MAIN.
           MOVE "CF4IPWO"      TO SCREEN-NAME.

       4-READ.
           MOVE "B"            TO FILE-SW.
           IF NEWO-NUM = SPACES
      **********************************************************************
      **    MESSAGE 031/021:
      ** ENTER WORKORDER NUMBER
      **********************************************************************
               MOVE  31        TO CATREAD-MSG-SET
               MOVE  21        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 19         TO FIELD-NUMBER
               PERFORM 8-ERROR
               GO TO 4-SHOWFORM.

           CALL "TALWONO"      USING IP-BUFFER
                               RETURN-COD.
           MOVE NEWO-BUF       TO WONUM OF WO-BASIC
                                  WONUM OF WO-PLANNED.
           START WO-BASIC      KEY = WONUM OF WO-BASIC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = ZEROS
               GO TO 4-READ-BASIC.

           START WO-PLANNED    KEY = WONUM OF WO-PLANNED
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = ZEROS
               GO TO 4-READ-PLANNED.

      **********************************************************************
      **    MESSAGE 035/040:
      ** INVALID WORKORDER NUMBER
      **********************************************************************
           MOVE  35            TO CATREAD-MSG-SET.
           MOVE  40            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE 19             TO FIELD-NUMBER.
           PERFORM 8-ERROR.
           GO TO 4-SHOWFORM.

       4-READ-BASIC.
           READ WO-BASIC       INTO WO-BASIC-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               MOVE FILE-STAT  TO CON-WORD
               MOVE "READ    " TO DB-FUNC
               MOVE "WO-BASIC" TO DB-FILE
               MOVE DB-ERROR   TO MESSAGE-BUFFER
               MOVE 19         TO FIELD-NUMBER
               MOVE FILE-STAT  TO MSG-FLD
               PERFORM 8-ERROR
               GO TO 4-SHOWFORM.

           GO TO 4-CONT-PROC.

       4-READ-PLANNED.
           READ WO-PLANNED     INTO WO-PLANNED-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               MOVE FILE-STAT  TO CON-WORD
               MOVE "READ    " TO DB-FUNC
               MOVE "WO-PLANNED" TO DB-FILE
               MOVE DB-ERROR   TO MESSAGE-BUFFER
               MOVE 19         TO FIELD-NUMBER
               MOVE FILE-STAT  TO MSG-FLD
               PERFORM 8-ERROR
               GO TO 4-SHOWFORM.

           IF APPROVAL-CODE-P NOT = "A "
      **********************************************************************
      **    MESSAGE 049/012:
      ** WORK ORDER IS UNAPPROVED
      **********************************************************************
               MOVE  49        TO CATREAD-MSG-SET
               MOVE  12        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               GO TO 4-CONTINUED
           ELSE
               MOVE "P"        TO FILE-SW
               MOVE SPACES     TO WO-BASIC-DATA.

       4-CONT-PROC.
           MOVE SPACES         TO MESSAGE-BUFFER MSG-AREA.
           MOVE WO-NUM         TO WONUM-MSG.
           IF FILE-SW = "P"
               MOVE WO-NUM-PLANNED TO WONUM-MSG.

       4-CALL-SUB.
           CALL "TIPNEWWO"     USING DBPARAMETERS
                               QUEUE-WO-DATA
                               WO-BASIC-DATA
                               WO-PLANNED-DATA
                               WO-TRACK-DATA
                               CNUM-BUFFER
                               MESSAGE-BUFFER
                               FILE-SW.

           IF MESSAGE-BUFFER = SPACES
               PERFORM DISPLAY-WO-MSGS
               PERFORM RE-QUEUE-FUNCTION THRU RQF-EXIT
               MOVE CC-NUM     TO CC-BUF
               GO TO GET-DATA.

       4-CONTINUED.
           IF NEWO-YR = SPACE  MOVE WO-YR-SAVE TO NEWO-YR.
           MOVE "CF4IPWO"      TO SCREEN-NAME.
           MOVE 19             TO FIELD-NUMBER.
           PERFORM 8-ERROR.

       4-SHOWFORM.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO 9-EOJ.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO 9-EOJ.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 3
               MOVE 40         TO HELP-SW
               GO TO 9-EOJ.

           IF KEY-HIT = 7
               MOVE "CRFTEXEC" TO NFNAME
               MOVE SPACES     TO EXECUTIVE-DATA PERS-DATA
               MOVE SPACES     TO SCREEN-DATA CNUM-BUFFER
               MOVE 0          TO PPS-REPEATER
               PERFORM RE-QUEUE-FUNCTION THRU RQF-EXIT
               MOVE SPACES     TO SELECT-FIELDS
               MOVE WO-YR-SAVE TO NEWO-YR DWO-YR
               GO TO MAIN.

           MOVE SPACES         TO CMDMSG.
           GO TO 4-READ.

       5-MAIN.
           MOVE "CF5DISP"      TO SCREEN-NAME.
           IF DWO-YR = SPACE   MOVE WO-YR-SAVE TO DWO-YR.

       5-READ.
           MOVE "B"            TO FILE-SW.
           IF DWO-NUM = SPACES
               IF WORK-SW = "A"
                   IF CURWO-BUF NOT = SPACES
                       MOVE CURWO-BUF TO DWO-BUF
                   ELSE
      **********************************************************************
      **    MESSAGE 031/021:
      ** ENTER WORKORDER NUMBER
      **********************************************************************
                       MOVE 31 TO CATREAD-MSG-SET
                       MOVE 21 TO CATREAD-MSG-NUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE 17 TO FIELD-NUMBER
                       PERFORM 8-ERROR
                       GO TO 5-SHOWFORM
               ELSE
                   IF NWO-BUF NOT = SPACES
                       MOVE NWO-BUF   TO DWO-BUF
                   ELSE
      **********************************************************************
      **    MESSAGE 031/021:
      ** ENTER WORKORDER NUMBER
      **********************************************************************
                       MOVE 31 TO CATREAD-MSG-SET
                       MOVE 21 TO CATREAD-MSG-NUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE 17 TO FIELD-NUMBER
                       PERFORM 8-ERROR
                       GO TO 5-SHOWFORM.

           CALL "TALWONO"      USING DWO-BUFFER
                               RETURN-COD.
           MOVE DWO-BUFFER     TO WONUM OF WO-BASIC
                                  WONUM OF WO-PLANNED.
           START WO-BASIC      KEY = WONUM OF WO-BASIC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = ZEROS
               IF DWO-BUFFER = WONUM OF WO-BASIC
                   GO TO 5-READ-BASIC.

           START WO-PLANNED    KEY = WONUM OF WO-PLANNED
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = ZEROS
               IF DWO-BUFFER = WONUM OF WO-PLANNED
                   GO TO 5-READ-PLANNED.

      **********************************************************************
      **    MESSAGE 035/040:
      ** INVALID WORKORDER NUMBER
      **********************************************************************
           MOVE  35            TO CATREAD-MSG-SET.
           MOVE  40            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE 17             TO FIELD-NUMBER.
           PERFORM 8-ERROR.
           GO TO 5-SHOWFORM.

       5-READ-BASIC.
           READ WO-BASIC       INTO WO-BASIC-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               MOVE FILE-STAT  TO CON-WORD
               MOVE "READ    " TO DB-FUNC
               MOVE "WO-BASIC" TO DB-FILE
               MOVE DB-ERROR   TO MESSAGE-BUFFER
               MOVE 17         TO FIELD-NUMBER
               PERFORM 8-ERROR
               GO TO 5-SHOWFORM.

           GO TO 5-CONT-PROC.

       5-READ-PLANNED.
           READ WO-PLANNED     INTO WO-PLANNED-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               MOVE FILE-STAT  TO CON-WORD
               MOVE "READ    " TO DB-FUNC
               MOVE "WO-PLANNED" TO DB-FILE
               MOVE DB-ERROR   TO MESSAGE-BUFFER
               MOVE 17         TO FIELD-NUMBER
               MOVE FILE-STAT  TO MSG-FLD
               PERFORM 8-ERROR
               GO TO 5-SHOWFORM.

           MOVE "P"            TO FILE-SW.
           MOVE SPACES         TO WO-BASIC-DATA.

       5-CONT-PROC.
           CALL "TDISPWO"      USING DBPARAMETERS
                               WO-BASIC-DATA
                               WO-PLANNED-DATA
                               FILE-SW.

           GO TO MAIN.

       5-SHOWFORM.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO 9-EOJ.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO 9-EOJ.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 3
               MOVE 50         TO HELP-SW
               GO TO 9-EOJ.

           IF KEY-HIT = 7
               MOVE "CRFTEXEC" TO NFNAME
               MOVE SPACES     TO EXECUTIVE-DATA PERS-DATA
               MOVE SPACES     TO SCREEN-DATA CNUM-BUFFER
               MOVE 0          TO PPS-REPEATER
               PERFORM RE-QUEUE-FUNCTION THRU RQF-EXIT
               MOVE SPACES     TO SELECT-FIELDS
               MOVE WO-YR-SAVE TO NEWO-YR DWO-YR
               GO TO MAIN.

           MOVE SPACES         TO CMDMSG.
           GO TO 5-READ.

       8-ERROR.
           MOVE MESSAGE-BUFFER TO ERRMSG.
           MOVE TRUE-VAL       TO IND (FIELD-NUMBER) IND (99).

       9-EOJ.
           PERFORM RE-QUEUE-FUNCTION THRU RQF-EXIT.
           IF HELP-SW > 0
               CALL "TCFHELP"  USING HELP-SW
               GO TO MAIN.

           MOVE 0              TO HELP-SW.
           MOVE "VEXIT"        TO SCREEN-NAME.
           IF SAFETY-FLAG > 0
               MOVE "VEXITSAF" TO SCREEN-NAME.

       9-SHOW-READ.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SPACES         TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO GOBACK-FUNCTION.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO GOBACK-FUNCTION.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 3
               PERFORM RE-QUEUE-FUNCTION THRU RQF-EXIT
               GO TO GOBACK-FUNCTION.

           IF KEY-HIT = 2
               CALL "TCFHELP"  USING HELP-SW
               GO TO MAIN.

           IF KEY-HIT = 1
               GO TO MAIN.

           IF SAFETY-FLAG > 0
               IF KEY-HIT = 4
                   CALL "TSCINIT"
                   GO TO MAIN.

           GO TO 9-SHOW-READ.

       GOBACK-FUNCTION.
           CLOSE               WO-BASIC.
           CLOSE               WO-PLANNED.
           CLOSE               PER-PERSONNEL.
           CLOSE               WO-OPEN-QUEUE.
           CLOSE               CURRENT-LABOR.
           CLOSE               WO-CRAFTS-REQD.
           CLOSE               EQP-EQUIPMENT.
           CLOSE               DISPLAY-FILE.
           GOBACK.

       DISPLAY-WO-MSGS.
           MOVE KEY-HIT        TO DELAY-SW.
           MOVE SCREEN-NAME    TO HOLD-NFNAME.

           MOVE MESSAGE-BUFFER TO MESSAGE-BUF.
           CALL "TDISPMES"     USING DBPARAMETERS
                               MSG-AREA.

           MOVE SPACES         TO MESSAGE-BUFFER.
           MOVE DELAY-SW       TO KEY-HIT.
           MOVE HOLD-NFNAME    TO SCREEN-NAME.

       RESERVE-FUNCTION.
      **********************************************************************
      **    MESSAGE 042/131:
      **  PRESS f1 TO LIST RESERVATIONS
      **********************************************************************
           MOVE  42            TO CATREAD-MSG-SET.
           MOVE 131            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO DESC-BUF.

       RESERVATION-LIST.
           MOVE SPACES         TO RESERVE-SCREEN.
           PERFORM READ-QUEUE  THRU RQ-EXIT.

      **********************************************************************
      **    MESSAGE 063/007:
      ** QUEUE                                  << MAX FIELD SIZE 38 >>
      **********************************************************************
           MOVE  63            TO CATREAD-MSG-SET.
           MOVE   7            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO DISBUF1.

      **********************************************************************
      **    MESSAGE 063/008:
      **                           IP BY OTHER  << MAX FIELD SIZE 38 >>
      **********************************************************************
           MOVE  63            TO CATREAD-MSG-SET.
           MOVE   8            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO DISBUF2.

      **********************************************************************
      **    MESSAGE 063/009:
      ** FACTOR  WO NUMBER   EQUIP   DN  DESCRI << MAX FIELD SIZE 38 >>
      **********************************************************************
           MOVE  63            TO CATREAD-MSG-SET.
           MOVE   9            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO DISBUF3.

      **********************************************************************
      **    MESSAGE 063/010:
      ** PTION                     CLOCK CARD  << MAX FIELD SIZE 38 >>
      **********************************************************************
           MOVE  63            TO CATREAD-MSG-SET.
           MOVE  10            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO DISBUF4.

           MOVE SCREEN-NAME    TO HOLD-NFNAME.
           MOVE "VRESLIST"     TO SCREEN-NAME.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE RESERVE-SCREEN TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO 9-EOJ.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO 9-EOJ.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE HOLD-NFNAME    TO SCREEN-NAME.

       RL-EXIT.    EXIT.

       READ-QUEUE.
           MOVE 0              TO SUB.
           MOVE CC-NUM         TO PERCCNUM OF WO-OPEN-QUEUE.
           START WO-OPEN-QUEUE KEY = PERCCNUM OF WO-OPEN-QUEUE
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT-1 = "2"
               GO TO RQ-EXIT
           ELSE
           IF FILE-STAT NOT = ZEROS
               MOVE FILE-STAT  TO CON-WORD
               MOVE "START   " TO DB-FUNC
               MOVE "WO-OPEN-QUEUE" TO DB-FILE
               MOVE DB-ERROR   TO MESSAGE-BUFFER
               GO TO RQ-EXIT.

       READ-QUEUE-LOOP.
           IF SUB > 4 GO TO RQ-EXIT.
           READ WO-OPEN-QUEUE  NEXT INTO WO-QUEUE-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO RQ-EXIT.

           IF Q-CC-NUM NOT = CC-NUM
               GO TO RQ-EXIT.

           IF Q-RESERVE NOT = "XX"
               GO TO READ-QUEUE-LOOP.

           ADD 1               TO SUB.
           MOVE SPACES         TO RESERVE-LIST-DATA.
           MOVE QUEUE-FACTOR   TO RL-QUEUE.
           MOVE Q-WO-NUM       TO RL-WO-NUM.
           MOVE Q-EQUIP-NUM    TO RL-EQUIP.
           MOVE Q-DESCRIPTION  TO RL-DESC.
           MOVE Q-EQP-DOWN     TO RL-DOWN.
           MOVE "NO "          TO RL-OTHER.
           IF Q-CW-LINK = "CW" OR "IP"
               MOVE "YES"      TO RL-OTHER.
           MOVE RESERVE-LIST-DATA TO RL-TABLE(SUB).

           GO TO READ-QUEUE-LOOP.

       RQ-EXIT.    EXIT.

       READ-SAFE.
           MOVE EQPVAL(SUB)    TO EQPNUM OF EQP-EQUIPMENT.
           READ  EQP-EQUIPMENT INTO EQUIPMENT-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               IF EQP-LOCATION = "SAFETY "
                   MOVE 1      TO SAFETY-FLAG.

       999-CATREAD.
           MOVE SPACES         TO MESSAGE-BUFFER.
           CALL "CCATREAD"     USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.    EXIT.

