000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TDISPEXS.
      *REMARKS.
      *C---------------------------------------------------------------
      *C 08/28/09  CAY REQ 2009-00131261-003
      *C IN ORDER TO HOLD DATA LONGER THAN 10 YEARS, CHANGE THE
      *C BASE METHOD FOR CREATING A WORKORDER.  FOR W/O CREATED IN
      *C 2010, INSTEAD OF USING LETTER "A" AGAIN, USE "L", ETC.
      *C SKIP USING I, O, Q AND U TO AVOID CONFUSION.
      *C---------------------------------------------------------------
000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000600 SOURCE-COMPUTER. AS400.
000700 OBJECT-COMPUTER. AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZDISPLAY-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT WO-BASIC-FILE
               ASSIGN TO DATABASE-MCFLMM1001
               ORGANIZATION IS INDEXED
               ACCESS IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WBF-STATUS.
           SELECT WO-PLANNED-FILE
               ASSIGN TO DATABASE-MCFLMM1101
               ORGANIZATION IS INDEXED
               ACCESS IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WPF-STATUS.
000800 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                         PIC X(2000).
       FD  WO-BASIC-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WBFREC.
       01  WBFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1001.
       FD  WO-PLANNED-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFREC.
       01  WPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.
000900 WORKING-STORAGE SECTION.
001200 77  WRITE-YEAR-BUF                    PIC X.
       77  SUB1                PIC S9(4) BINARY VALUE ZEROS.
001300 01  BLOWUP-BASE                       PIC X(16).
       COPY CATREAD IN COPYLIB.
001400 01  CHECK-YEAR.
001500**** 05  FILLER                        PIC X.
           05  CHECK-YEAR-NUM2               PIC 9.
001600     05  CHECK-YEAR-NUM                PIC 9.
           05  FILLER                        PIC X(4).
       COPY CPYIND  IN COPYLIB.
      *---------------------------------------------*
      *--- TASK 2009-00131261-003
      *---------------------------------------------*
      *---   20-YEAR PATTERN
      *--- YEAR        ALPHA
      *    2000-2009   A-K
      *    2010-2019   M-Y
      *    2020-2029   A-K
      *    2030-2039   M-Y
      *    2040-2049   A-K
      *    2050-2059   M-Y
      *---------------------------------------------*
      *--- YEARS THAT USE THE FOLLOWING ALPHA TABLE:
      *--- 2000-2009; 2020-2029; 2040-2049
      *---------------------------------------------*
       01  YEAR-DESIGNATOR.
           05  YEAR-TABLE.
               10  YD-0        PIC X  VALUE "A".
               10  YD-1        PIC X  VALUE "B".
               10  YD-2        PIC X  VALUE "C".
               10  YD-3        PIC X  VALUE "D".
               10  YD-4        PIC X  VALUE "E".
               10  YD-5        PIC X  VALUE "F".
               10  YD-6        PIC X  VALUE "G".
               10  YD-7        PIC X  VALUE "H".
               10  YD-8        PIC X  VALUE "J".
               10  YD-9        PIC X  VALUE "K".
           05  YEAR-COUNTER    REDEFINES YEAR-TABLE.
               10  YEARC       OCCURS 10 TIMES PIC X.
      *---------------------------------------------*
      *--- YEARS THAT USE THE FOLLOWING ALPHA TABLE:
      *--- 2010-2019; 2030-2039; 2050-2059
      *---------------------------------------------*
       01  YEAR-DESIGNATOR2.
           05  YEAR-TABLE2.
               10  YD-0        PIC X  VALUE "M".
               10  YD-1        PIC X  VALUE "N".
               10  YD-2        PIC X  VALUE "P".
               10  YD-3        PIC X  VALUE "R".
               10  YD-4        PIC X  VALUE "S".
               10  YD-5        PIC X  VALUE "T".
               10  YD-6        PIC X  VALUE "V".
               10  YD-7        PIC X  VALUE "W".
               10  YD-8        PIC X  VALUE "X".
               10  YD-9        PIC X  VALUE "Y".
001700 01  ERROR-BUFFER.
002400     05  FILLER                        PIC X(40) VALUE SPACES.
002500     05  WO-1-10                       PIC X(10) VALUE SPACES.
002600     05  FILLER                        PIC X(30) VALUE SPACES.
       01  FILE-STATUSES.
           05  DSPLY-STATUS                  PIC XX.
           05  WBF-STATUS                    PIC XX.
           05  WPF-STATUS                    PIC XX.
       01  INPUT-BUFFER.
001800     05  WO-NUMBER.
001900         10  WO-NUMBER6                PIC X(6).
002000         10  WO-NUMBER7                PIC X.
002100         10  WO-NUM-SUFF               PIC XXX.
           05  INPUT-CMD-LINE                PIC X(79).
002200     05  INPUT-ERR-LINE                PIC X(79).
       COPY IOFEEDBACK OF COPYLIB.
002700 01  PASSWORD-INFORMATION.
002800     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TDISPEXS".
002900     05  PROGRAM-TYPE        PIC X(02) VALUE "MA".
003000     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
003100     05  PROGRAM-DESCRIPTION.
003200         10  PROG-DESC-A.
                   15  FILLER      PIC X(17) VALUE "EXECUTIVE PROGRAM".
                   15  FILLER      PIC X(15) VALUE " TO DISPLAY W/O".
                   15  FILLER      PIC X(17) VALUE " DATA FOR PLANNER".
                   15  FILLER      PIC X(11) VALUE "/ENGINEER".
003400         10  PROG-DESC-B     PIC X(60) VALUE " FUNCTIONS".
003600         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
003800     05  PASSWORD-FLAG       PIC X.
003900 01  RETURN-CODE                       PIC X.
004000 01  RETURN-SW                         PIC X.
004100 COPY DBSTAT    IN COPYLIB.
       01  TRUE-VAL                          PIC 1 VALUE B"1".
004200 COPY TBLOWUP   IN COPYLIB.
004300 01  WO-BASIC-DATA.     COPY DWOBASIC OF COPYLIB.
004400 01  WO-NUMBER-BUF                     PIC X(10).
004500 01  WO-PLANNED-DATA.   COPY DWOPLAN  OF COPYLIB.
       COPY WSCONTROL IN COPYLIB.
004600 LINKAGE SECTION.
005300 01  DBPARAMETERS.      COPY DBPARMS  OF COPYLIB.
005400 01  LAST-WO-BUFF.      COPY MLASTWO  OF COPYLIB.
005600 01  ERROR-SWITCH.
005700     05  ERR-SW                        PIC S9(4) COMP-4.
       COPY VCOMLINK  IN COPYLIB.
005800 PROCEDURE DIVISION USING DBPARAMETERS LAST-WO-BUFF
005900                      ERROR-SWITCH VIEW-COMAREA.
006000 START-PROCESSING.
006100     PERFORM 1-HSK.
006200     PERFORM 6-MAIN.
006300 2-EOJ.
           CLOSE WO-BASIC-FILE WO-PLANNED-FILE DISPLAY-FILE.
006400     GOBACK.
006500 1-HSK.
           MOVE LOW-VALUES TO STATUS-AREA.
006600     CALL "TPWORD" USING PASSWORD-INFORMATION.
007000     IF PASSWORD-FLAG = "N"
007100         MOVE "  PWORD" TO BLOWUP-BASE
007200         MOVE "FAILED PASSWORD CHECK - TDISPEXS"
007300             TO BU-DISPLAY-MSG
007400         PERFORM 998-BLOWUP.
           OPEN I-O   DISPLAY-FILE.
           OPEN INPUT WO-BASIC-FILE WO-PLANNED-FILE.
008700     ACCEPT CHECK-YEAR FROM DATE.
      *-----------------------------------------------*
      *--- TASK 2009-00131261-003
      *-----------------------------------------------*
           IF CHECK-YEAR-NUM2 = 1 OR 3 OR 5 OR 7 OR 9
             MOVE YEAR-DESIGNATOR2 TO YEAR-DESIGNATOR.
      *-----------------------------------------------*
           MOVE CHECK-YEAR-NUM TO SUB1.
           ADD 1 TO SUB1.
           MOVE YEARC (SUB1)   TO WRITE-YEAR-BUF.
      *------ COMMENT OUT FOR TASK 2009-00131261-003
008800***  IF CHECK-YEAR-NUM = 0
008900***      MOVE "A" TO WRITE-YEAR-BUF
009000***  ELSE
009100***  IF CHECK-YEAR-NUM = 1
009200***      MOVE "B" TO WRITE-YEAR-BUF
009300***  ELSE
009400***  IF CHECK-YEAR-NUM = 2
009500***      MOVE "C" TO WRITE-YEAR-BUF
009600***  ELSE
009700***  IF CHECK-YEAR-NUM = 3
009800***      MOVE "D" TO WRITE-YEAR-BUF
009900***  ELSE
010000***  IF CHECK-YEAR-NUM = 4
010100***      MOVE "E" TO WRITE-YEAR-BUF
010200***  ELSE
010300***  IF CHECK-YEAR-NUM = 5
010400***      MOVE "F" TO WRITE-YEAR-BUF
010500***  ELSE
010600***  IF CHECK-YEAR-NUM = 6
010700***      MOVE "G" TO WRITE-YEAR-BUF
010800***  ELSE
010900***  IF CHECK-YEAR-NUM = 7
011000***      MOVE "H" TO WRITE-YEAR-BUF
011100***  ELSE
011200***  IF CHECK-YEAR-NUM = 8
011300***      MOVE "J" TO WRITE-YEAR-BUF
011400***  ELSE
011500***  IF CHECK-YEAR-NUM = 9
011600***      MOVE "K" TO WRITE-YEAR-BUF.
      *-----------------------------------------------*
011700 6-MAIN.
           MOVE SPACES TO INPUT-BUFFER ERROR-BUFFER.
011800     PERFORM 621-WRITE-SCREEN THRU 621-WS-EXIT.
012700     IF VIEW-LASTKEY = 2 GO TO 6-MAIN.
012800*
012900*    PUT UP SCREEN
013000*
013100 621-WRITE-SCREEN.
013200     MOVE "FDISPWON" TO VIEW-CFNAME.
           IF ERROR-BUFFER = SPACES
               MOVE SPACES TO INPUT-BUFFER
               MOVE 49059 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE WRITE-YEAR-BUF TO WO-NUMBER7
               MOVE ERROR-BUFFER TO INPUT-CMD-LINE
               MOVE SPACES TO ERROR-BUFFER
               MOVE INPUT-BUFFER TO DSPLY-REC
           ELSE
014500*    MOVE WRITE-YEAR-BUF TO WO-NUMBER7
           MOVE INPUT-BUFFER TO DSPLY-REC
           MOVE ERROR-BUFFER TO INPUT-ERR-LINE.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO INPUT-BUFFER.
           IF VIEW-LASTKEY = 3
016700         GO TO 2-EOJ
016800     ELSE
016900     IF VIEW-LASTKEY = 1 OR 2
017100         MOVE 35126 TO CATREAD-MSG-NUMBER
017300         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (99)
               GO TO 621-WRITE-SCREEN.
018400*
018500*    ALIGN WORK ORDER NUMBER
018600*
018700     CALL "TALWONO" USING WO-NUMBER RETURN-CODE.
018800     IF RETURN-CODE = "1"
018900         MOVE "0" TO RETURN-CODE
019100         MOVE 47004 TO CATREAD-MSG-NUMBER
019300         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
019500         MOVE WO-NUMBER TO WO-1-10
               MOVE TRUE-VAL TO INDS (1) INDS (99)
019900         GO TO 621-WRITE-SCREEN.
           MOVE 0 TO COND-WORD.
           MOVE WO-NUMBER TO WONUM OF WBFREC.
           START WO-BASIC-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 GO TO 621-WS-CONT.
           READ WO-BASIC-FILE INTO WO-BASIC-DATA
               INVALID KEY    MOVE 15 TO COND-WORD.
           IF WO-NUMBER NOT = WONUM OF WBFREC MOVE 15 TO COND-WORD.
           IF COND-WORD = 15
               MOVE 49002 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (1) INDS (99)
               GO TO 621-WRITE-SCREEN.
           CALL "CLDISPBA" USING DBPARAMETERS WO-BASIC-DATA
                             VIEW-COMAREA.
           GO TO 621-WS-EXIT.
       621-WS-CONT.
           MOVE 0 TO COND-WORD.
           MOVE WO-NUMBER TO WONUM OF WPFREC.
           START WO-PLANNED-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17
               MOVE 49002 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (98)
               MOVE ERROR-BUFFER TO INPUT-CMD-LINE
               MOVE INPUT-BUFFER TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
               GO TO 6-MAIN.
           READ WO-PLANNED-FILE INTO WO-PLANNED-DATA
               INVALID KEY    MOVE 15 TO COND-WORD.
           IF WO-NUMBER NOT = WONUM OF WPFREC MOVE 15 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF COND-WORD = 15
               MOVE 49002 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (1) INDS (99)
               GO TO 621-WRITE-SCREEN.
           CALL "CLDISPPL" USING DBPARAMETERS WO-PLANNED-DATA
                             VIEW-COMAREA.
       621-WS-EXIT.    EXIT.
027800
       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0" TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

027900 998-BLOWUP.
028000     MOVE "TDISPEXS" TO BU-PGM-NAME.
028100     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
028200                      VIEW-COMAREA DUMMY-KSAM-STAT
028300                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.
028400
028500 999-CATREAD.
028600     MOVE SPACES TO ERROR-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
030100 999-CATREAD-EXIT.    EXIT.
