000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.      TDUPLOPT.
      *C
      *C  01/04/2010  CA YODER  2010-00142425-001
      *C     UPDATE LOGIC ASSIGNING WORKORDER LETTER SUFFIX.
      *C
000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000600 SOURCE-COMPUTER.   AS400.
000700 OBJECT-COMPUTER.   AS400.
       COPY SPECIALN IN COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZMODIFY-SI
               ORGANIZATION IS TRANSACTION
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT DUP-FILE
               ASSIGN TO DATABASE-MCFLMMDUPF
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS DF-STATUS.
           SELECT EQUIPMENT-FILE
               ASSIGN TO DATABASE-MCFLMM0201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS EF-STATUS.
           SELECT WO-LAST-NUM-USED
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ARG-NO
               FILE STATUS IS WLNU-STATUS.
           SELECT WO-NUMBER-FILE
               ASSIGN TO DATABASE-MCFLMM0101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WNF-STATUS.
           SELECT WO-STATUS-MSTR-FILE
               ASSIGN TO DATABASE-MCFLMM0401
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WSMF-STATUS.
000800 DATA DIVISION.
000900 FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                 PIC X(2000).
       FD  DUP-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS DFREC.
002500 01  DFREC.
           COPY DDS-ALL-FORMATS OF MCFLMMDUPF.
       FD  EQUIPMENT-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS EFREC.
       01  EFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0201.
       FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WLNUREC.
       01  WLNUREC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.
       FD  WO-NUMBER-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WNFREC.
       01  WNFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0101.
       FD  WO-STATUS-MSTR-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WSMFREC.
       01  WSMFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0401.
001000 WORKING-STORAGE SECTION.
001300 77  SAVE-YR-DIG               PIC X.
001400 77  SUB1                      PIC S9(4) COMP-4.
      *---- 01/04/2010:  ADDED PARAMETER FOR CMMISYR.
       77  MMIS-LETTER                PIC X.
001500 01  ARG-NO                    PIC 9(9).
001600 01  BLOWUP-BASE               PIC X(16).
       COPY CATREAD  OF COPYLIB.
       COPY CPYIND OF COPYLIB.
001700 01  CUR-DATE-BUFF.
001800     05  FILLER                PIC X.
001900     05  CUR-DATE-8X           PIC 9.
           05  FILLER                PIC XXXX.
002300 01  DBPARAMETERS.                 COPY DBPARMS  OF COPYLIB.
004000 01  EQP-EQUIPMENT-DATA.           COPY MEQPFILE OF COPYLIB.
004100 01  ERROR-BUFFER              PIC X(80).
       01  FIELDNUM                  PIC S9(4) COMP-4.
       01  FILE-STATUSES.
           05  DSPLY-STATUS          PIC XX.
           05  DF-STATUS             PIC XX.
           05  EF-STATUS             PIC XX.
           05  WLNU-STATUS           PIC XX.
           05  WNF-STATUS            PIC XX.
           05  WSMF-STATUS           PIC XX.
       COPY IOFEEDBACK OF COPYLIB.
       COPY JCWAREA    OF COPYLIB.
005000 01  LAST-WO-BUFF.                 COPY MLASTWO  OF COPYLIB.
005100 01  PASSWORD-INFORMATION.
005200     05  NAME-OF-PROGRAM       PIC X(08) VALUE "TDUPLOPT".
005300     05  PROGRAM-TYPE          PIC X(02) VALUE "UP".
005400     05  PROGRAM-RELEASE       PIC X(12) VALUE " E0100010001".
005500     05  PROGRAM-DESCRIPTION.
005600         10  PROG-DESC-A.
                   15  FILLER        PIC X(14) VALUE " SELECT BATCH ".
                   15  FILLER        PIC X(12) VALUE "DUPLICATION ".
                   15  FILLER        PIC X(09) VALUE "CRITERIA ".
                   15  FILLER        PIC X(25) VALUE SPACES.
005800         10  PROG-DESC-B       PIC X(60) VALUE SPACES.
006000         10  PROG-FUNCTION     PIC X(60) VALUE SPACES.
006200     05  PASSWORD-FLAG         PIC X.
006300 01  READ-DUPL-DATA.
006400     05  RDD OCCURS 7 TIMES.
006500         10  RDD-WO.
006600             15  RDD-WO-1-6    PIC X(6).
006700             15  RDD-WO-7      PIC X.
006800             15  RDD-WO-8-10   PIC XXX.
006900         10  RDD-MATL-IND      PIC X.
007000         10  RDD-JOBP-IND      PIC X.
007100         10  RDD-EQUIP-NUM     PIC X(6).
007200         10  RDD-WO-STATUS     PIC XX.
007300         10  RDD-SCHED-DATE.
007400             15  RSD-MM        PIC 99.
007500             15  RSD-DD        PIC 99.
007600             15  RSD-YY        PIC 99.
007700         10  RDD-SCHED-TIME.
007800             15  RTS-HH        PIC 99.
007900             15  RTS-MM        PIC 99.
           05  READ-CMD-LINE         PIC X(79).
           05  READ-MSG-LINE         PIC X(79).
008000 01  RETURN-CODE               PIC XX.
008100 COPY DBSTAT   IN COPYLIB.
       01  TRUE-VAL                  PIC 1 VALUE B"1".
008500 COPY TBLOWUP  IN COPYLIB.
008700 COPY VCOMLINK IN COPYLIB.
008800 01  WHO-VARIABLES.
008900     05  USERNAME              PIC X(10).
009000     05  TERMNUM               PIC X(10).
009100     05  CURRLIB               PIC X(10).
           05  JOBLIBX               PIC X.
009800 01  WO-NUMBER-BUF             PIC X(10).
       COPY WSCONTROL OF COPYLIB.
009900 01  WO-STATUS-BUF             PIC XX.
010000 PROCEDURE DIVISION.
010100 START-PROCESSING.
010200     PERFORM 1-HSK.
010300     PERFORM 6-MAIN THRU 611-WRITE-DUPF-LOOP
010400         UNTIL VIEW-LASTKEY = 3.
010500 2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE DUP-FILE.
           CLOSE EQUIPMENT-FILE.
           CLOSE WO-LAST-NUM-USED.
           CLOSE WO-NUMBER-FILE.
           CLOSE WO-STATUS-MSTR-FILE.
           MOVE "061"       TO SETJCW-VALUE.
           MOVE 278         TO SETJCW-STARTING-POS.
           MOVE 3           TO SETJCW-LENGTH.
           CALL "SETJCW" USING SETJCW-VALUE,
                               SETJCW-STARTING-POS,
                               SETJCW-LENGTH,
                               SETJCW-STATUS.
           IF SETJCW-STATUS NOT = "00"
               MOVE "SETJCW ERROR" TO BU-DISPLAY-MSG
               PERFORM 998-BLOWUP.

           CALL "TRSCREN2".

011000     GOBACK.
011100 1-HSK.
           OPEN I-O   DISPLAY-FILE.
           OPEN I-O   DUP-FILE.
           OPEN INPUT EQUIPMENT-FILE.
           OPEN INPUT WO-LAST-NUM-USED.
           OPEN INPUT WO-NUMBER-FILE.
           OPEN INPUT WO-STATUS-MSTR-FILE.
011200     MOVE SPACES TO ERROR-BUFFER.
014600     ACCEPT CUR-DATE-BUFF FROM DATE.
      *------- 01/04/2010:  UPDATED WORKORDER LETTER SUFFIX LOGIC.
014700*    IF CUR-DATE-8X = 0
014800*        MOVE "A" TO SAVE-YR-DIG
014900*    ELSE
015000*    IF CUR-DATE-8X = 1
015100*        MOVE "B" TO SAVE-YR-DIG
015200*    ELSE
015300*    IF CUR-DATE-8X = 2
015400*        MOVE "C" TO SAVE-YR-DIG
015500*    ELSE
015600*    IF CUR-DATE-8X = 3
015700*        MOVE "D" TO SAVE-YR-DIG
015800*    ELSE
015900*    IF CUR-DATE-8X = 4
016000*        MOVE "E" TO SAVE-YR-DIG
016100*    ELSE
016200*    IF CUR-DATE-8X = 5
016300*        MOVE "F" TO SAVE-YR-DIG
016400*    ELSE
016500*    IF CUR-DATE-8X = 6
016600*        MOVE "G" TO SAVE-YR-DIG
016700*    ELSE
016800*    IF CUR-DATE-8X = 7
016900*        MOVE "H" TO SAVE-YR-DIG
017000*    ELSE
017100*    IF CUR-DATE-8X = 8
017200*        MOVE "J" TO SAVE-YR-DIG
017300*    ELSE
017400*    MOVE "K" TO SAVE-YR-DIG.

           CALL "CMMISYR" USING MMIS-LETTER.
           MOVE MMIS-LETTER    TO SAVE-YR-DIG.
      *-------

           MOVE 0 TO COND-WORD.
           MOVE 1 TO ARG-NO.
           READ WO-LAST-NUM-USED INTO LAST-WO-BUFF
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLNU-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 MOVE 1 TO DATE-FLAG-SW.
019100     MOVE DATE-FLAG-SW TO DATE-FLAG.
019500     CALL "TPWORD" USING PASSWORD-INFORMATION.
019900     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
           MOVE 0 TO VIEW-LASTKEY.
           MOVE SPACES TO DSPLY-REC.
020500 11-LOAD-YR.
020600     MOVE SAVE-YR-DIG TO RDD-WO-7 (SUB1).
020700 6-MAIN.
           MOVE SPACES TO DSPLY-REC.
014100     MOVE "FDUPLOPT" TO VIEW-CFNAME.
021200     MOVE SPACES TO READ-DUPL-DATA.
021300     PERFORM 11-LOAD-YR VARYING SUB1 FROM 1 BY 1
021400         UNTIL SUB1 > 7.
           MOVE READ-DUPL-DATA TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
022000 61-READ-LOOP.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO READ-DUPL-DATA.
023100     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
023500     MOVE 0 TO SUB1.
023600 61-RL-CONT.
023700     ADD 1 TO SUB1.
023800     IF SUB1 > 7 OR RDD-WO-1-6 (SUB1) = SPACES
023900         MOVE 0 TO SUB1
024000         GO TO 611-WRITE-DUPF-LOOP.
024100     CALL "TALWONO" USING RDD-WO (SUB1) RETURN-CODE.
           MOVE TRUE-VAL TO INDS (98).
           MOVE READ-DUPL-DATA TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98A-SCREEN-READ.
           MOVE 0 TO COND-WORD.
           MOVE RDD-WO (SUB1) TO WONUM OF WNFREC.
           START WO-NUMBER-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WNF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
024900     IF COND-WORD = 17
025000         MULTIPLY 12 BY SUB1 GIVING FIELDNUM
025100         SUBTRACT 11 FROM FIELDNUM
025200         MOVE 49002 TO CATREAD-MSG-NUMBER
025400         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO READ-CMD-LINE
               MOVE READ-DUPL-DATA TO DSPLY-REC
               MOVE TRUE-VAL TO INDS (FIELDNUM) INDS (99)
               PERFORM 99-SCREEN-WRITE
025900         SUBTRACT 1 FROM SUB1
026000         GO TO 61-READ-LOOP.
           MOVE 0 TO COND-WORD.
           MOVE RDD-EQUIP-NUM (SUB1) TO EQPNUM OF EFREC.
           START EQUIPMENT-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF EF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
026500     IF COND-WORD = 17
026600         MULTIPLY 12 BY SUB1 GIVING FIELDNUM
026700         SUBTRACT 6 FROM FIELDNUM
026800         MOVE 31010 TO CATREAD-MSG-NUMBER
027000         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (FIELDNUM) INDS (99)
               MOVE ERROR-BUFFER TO READ-CMD-LINE
               MOVE READ-DUPL-DATA TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
027500         SUBTRACT 1 FROM SUB1
027600         GO TO 61-READ-LOOP.
           MOVE 0 TO COND-WORD.
           MOVE RDD-WO-STATUS (SUB1) TO WOSTATUS OF WSMFREC.
           START WO-STATUS-MSTR-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WSMF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
028100     IF COND-WORD = 17
028200          MULTIPLY 12 BY SUB1 GIVING FIELDNUM
028300          SUBTRACT 5 FROM FIELDNUM
028400          MOVE 35001 TO CATREAD-MSG-NUMBER
028600          PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                MOVE TRUE-VAL TO INDS (FIELDNUM) INDS (99)
                MOVE ERROR-BUFFER TO READ-CMD-LINE
                MOVE READ-DUPL-DATA TO DSPLY-REC
                PERFORM 99-SCREEN-WRITE
029100          SUBTRACT 1 FROM SUB1
029200          GO TO 61-READ-LOOP.
029300     IF RDD-SCHED-DATE (SUB1) = "      "
029400         NEXT SENTENCE
029500     ELSE
029600     IF DATE-FLAG = 3
029700         IF RSD-MM (SUB1) > 0 AND < 32
029800             IF RSD-DD (SUB1) > 0 AND < 13
029900                 IF RSD-YY (SUB1) NUMERIC
030000                     NEXT SENTENCE
030100                 ELSE
030200                 MOVE 35032 TO CATREAD-MSG-NUMBER
030400                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
030600                 MULTIPLY 12 BY SUB1 GIVING FIELDNUM
030700                 SUBTRACT 2 FROM FIELDNUM
030800                 MOVE TRUE-VAL TO INDS (FIELDNUM) INDS (99)
                       MOVE ERROR-BUFFER TO READ-CMD-LINE
                       MOVE READ-DUPL-DATA TO DSPLY-REC
                       PERFORM 99-SCREEN-WRITE
031100                 SUBTRACT 1 FROM SUB1
031200                 GO TO 61-READ-LOOP
031300             ELSE
031400             MOVE 35031 TO CATREAD-MSG-NUMBER
031600             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
031800             MULTIPLY 12 BY SUB1 GIVING FIELDNUM
031900             SUBTRACT 3 FROM FIELDNUM
                   MOVE TRUE-VAL TO INDS (FIELDNUM) INDS (99)
                   MOVE ERROR-BUFFER TO READ-CMD-LINE
                   MOVE READ-DUPL-DATA TO DSPLY-REC
                   PERFORM 99-SCREEN-WRITE
032300             SUBTRACT 1 FROM SUB1
032400             GO TO 61-READ-LOOP
032500         ELSE
032600         MOVE 35030 TO CATREAD-MSG-NUMBER
032800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
033000         MULTIPLY 12 BY SUB1 GIVING FIELDNUM
033100         SUBTRACT 4 FROM FIELDNUM
               MOVE TRUE-VAL TO INDS (FIELDNUM) INDS (99)
               MOVE ERROR-BUFFER TO READ-CMD-LINE
               MOVE READ-DUPL-DATA TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
033500         SUBTRACT 1 FROM SUB1
033600         GO TO 61-READ-LOOP
033700     ELSE
033800     IF RSD-MM (SUB1) > 0 AND < 13
033900         IF RSD-DD (SUB1) > 0 AND < 32
034000             IF RSD-YY (SUB1) NUMERIC
034100                 NEXT SENTENCE
034200             ELSE
034300             MOVE 35032 TO CATREAD-MSG-NUMBER
034500             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
034700             MULTIPLY 12 BY SUB1 GIVING FIELDNUM
034800             SUBTRACT 2 FROM FIELDNUM
034900             MOVE TRUE-VAL TO INDS (FIELDNUM) INDS (99)
                   MOVE ERROR-BUFFER TO READ-CMD-LINE
                   MOVE READ-DUPL-DATA TO DSPLY-REC
                   PERFORM 99-SCREEN-WRITE
035200             SUBTRACT 1 FROM SUB1
035300             GO TO 61-READ-LOOP
035400         ELSE
035500         MOVE 35030 TO CATREAD-MSG-NUMBER
035700         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
035900         MULTIPLY 12 BY SUB1 GIVING FIELDNUM
036000         SUBTRACT 3 FROM FIELDNUM
036100         MOVE TRUE-VAL TO INDS (FIELDNUM) INDS (99)
               MOVE ERROR-BUFFER TO READ-CMD-LINE
               MOVE READ-DUPL-DATA TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
036400         SUBTRACT 1 FROM SUB1
036500         GO TO 61-READ-LOOP
036600     ELSE
036700     MOVE 35031 TO CATREAD-MSG-NUMBER
036900     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
037100     MULTIPLY 12 BY SUB1 GIVING FIELDNUM
037200     SUBTRACT 4 FROM FIELDNUM
           MOVE TRUE-VAL TO INDS (FIELDNUM) INDS (99)
           MOVE ERROR-BUFFER TO READ-CMD-LINE
           MOVE READ-DUPL-DATA TO DSPLY-REC
           PERFORM 99-SCREEN-WRITE
037600     SUBTRACT 1 FROM SUB1
037700     GO TO 61-READ-LOOP.
037800     IF RDD-SCHED-TIME (SUB1) = "    "
037900         NEXT SENTENCE
038000     ELSE
038100     IF RTS-HH (SUB1) < 24
038200         NEXT SENTENCE
038300     ELSE
038400     MOVE 35055 TO CATREAD-MSG-NUMBER
038600     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
038800     MULTIPLY 12 BY SUB1 GIVING FIELDNUM
038900     SUBTRACT 1 FROM FIELDNUM
039000     MOVE TRUE-VAL TO INDS (FIELDNUM) INDS (99)
           MOVE ERROR-BUFFER TO READ-CMD-LINE
           MOVE READ-DUPL-DATA TO DSPLY-REC
           PERFORM 99-SCREEN-WRITE
039300     SUBTRACT 1 FROM SUB1
039400     GO TO 61-READ-LOOP.
039500     IF RDD-SCHED-TIME (SUB1) = "    "
039600         GO TO 61-RL-CONT
039700     ELSE
039800     IF RTS-MM (SUB1) < 60
039900         GO TO 61-RL-CONT
040000     ELSE
040100     MOVE 35054 TO CATREAD-MSG-NUMBER
040300     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
040500     MULTIPLY 12 BY SUB1 GIVING FIELDNUM
040600     MOVE TRUE-VAL TO INDS (FIELDNUM) INDS (99)
           MOVE ERROR-BUFFER TO READ-CMD-LINE
           MOVE READ-DUPL-DATA TO DSPLY-REC
           PERFORM 99-SCREEN-WRITE
040900     SUBTRACT 1 FROM SUB1
041000     GO TO 61-READ-LOOP.
041100 611-WRITE-DUPF-LOOP.
041200     ADD 1 TO SUB1.
041300     IF SUB1 > 7 OR RDD-WO-1-6 (SUB1) = SPACES GO TO 6-MAIN.
042800     CALL "CLWHO" USING USERNAME TERMNUM CURRLIB JOBLIBX.
           MOVE 0 TO COND-WORD.
           MOVE USERNAME              TO DUPFUSER.
043200     MOVE RDD-WO (SUB1)         TO DUPFWORK.
043300     MOVE RDD-MATL-IND (SUB1)   TO DUPFMATI.
043400     MOVE RDD-JOBP-IND (SUB1)   TO DUPFJOBI.
043500     MOVE RDD-EQUIP-NUM (SUB1)  TO DUPFEQPN.
043600     MOVE RDD-WO-STATUS (SUB1)  TO DUPFSTAT.
043700     MOVE RDD-SCHED-DATE (SUB1) TO DUPFSCHD.
043800     MOVE RDD-SCHED-TIME (SUB1) TO DUPFSCHT.
044000     WRITE DFREC    INVALID KEY MOVE 17 TO COND-WORD.
           IF DF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
044200     IF COND-WORD = 17
044400         MOVE "WRITE ERROR TRYING TO DUPLICATE A W/O"
044500             TO BU-DISPLAY-MSG
044600         MOVE "DUPF FILE " TO BU-DISPLAY-FLD (1)
044800         MOVE "W/O IS " TO BU-DISPLAY-FLD (2)
044900         MOVE DUPFWORK TO BU-DISPLAY-FLD (3)
045000         PERFORM 998-BLOWUP.
045200     GO TO 611-WRITE-DUPF-LOOP.
045300
       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0" TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

045400 998-BLOWUP.
045500     MOVE "TDUPLOPT" TO BU-PGM-NAME.
045600     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
045700                      VIEW-COMAREA DUMMY-KSAM-STAT
045800                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.

050000 999-CATREAD.
050100     MOVE SPACES TO ERROR-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
051000 999-CATREAD-EXIT.    EXIT.
