       IDENTIFICATION DIVISION.
       PROGRAM-ID.     TEACHECK.
       AUTHOR.         C HILLES/JIM COFFMAN (MAINTAINER).
       DATE-WRITTEN.   11/30/87.
       DATE-COMPILED.
      *INSTALLATION.   GOODYEAR TIRE AND RUBBER - AKRON.
      *SECURITY.
      *REMARKS.
      *D   ELECTRONIC REQUISITION APPROVALS - DATA CHECK PROGRAM.  THIS
      *D   PROGRAM CHECKS FOR BAD DATA IN THE APPROVAL DATASETS.  IT
      *D   MAKES SURE 'REQ-APPROVALS-LEFT' IN MASTER MATCHES ACTUAL
      *D   NUMBER IN THE 'DREQQUE' DETAILS.  ALSO CHECKS FOR THE SAME
      *D   REQ BEING QUEUED MORE THAN ONCE FOR THE SAME EMPL.
      *C
      *C   08JUN2001  DAVE PLUM
      *C    RECOMPILED TO PICK UP TABLE SIZE CHANGE IN COPYLIB
      *C    MEMBER CEACHKPH.
      *C
      *C   08JUN2001  DAVE PLUM
      *C    REVERTED BACK TO A TABLE SIZE OF 12 - RECOMPILED AGAIN.
      *C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  HP-3000.
       OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MPLTINFO-PK-I
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MPATH-PN-O
               ASSIGN TO DATABASE-MCFLCS3901
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MLEVEL-LN-O
               ASSIGN TO DATABASE-MCFLCS4101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MEMPL-EM-O
               ASSIGN TO DATABASE-MCFLCS4201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MREQ-RQ-O
               ASSIGN TO DATABASE-MCFLCS2001
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MREQ-RQ-I
               ASSIGN TO DATABASE-MCFLCS2001
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DREQD-RQ-I
               ASSIGN TO DATABASE-MCFLCS2101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DREQQUE-RQ-O
               ASSIGN TO DATABASE-MCFLCS4401
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DPATHDEF-PN-O
               ASSIGN TO DATABASE-MCFLCS4001
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT WO-BASIC-WO-I
               ASSIGN TO DATABASE-MCFLMM1001
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT WO-PLANNED-WO-I
               ASSIGN TO DATABASE-MCFLMM1101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT WO-PARTS-WO-I
               ASSIGN TO DATABASE-MCFLMM1201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

002700     SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.

       DATA DIVISION.
       FILE SECTION.
      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       FD  MPLTINFO-PK-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-PK-REC-I.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  MPATH-PN-O
           LABEL RECORDS ARE STANDARD.
       01  MPATH-PN-REC-O.
           COPY DDS-MCRPCS3900  OF MCFLCS3901.

       FD  MLEVEL-LN-O
           LABEL RECORDS ARE STANDARD.
       01  MLEVEL-LN-REC-O.
           COPY DDS-MCRPCS4100  OF MCFLCS4101.

       FD  MEMPL-EM-O
           LABEL RECORDS ARE STANDARD.
       01  MEMPL-EM-REC-O.
           COPY DDS-MCRPCS4200  OF MCFLCS4201.

       FD  MREQ-RQ-O
           LABEL RECORDS ARE STANDARD.
       01  MREQ-RQ-REC-O.
           COPY DDS-MCRPCS2000  OF MCFLCS2001.

       FD  MREQ-RQ-I
           LABEL RECORDS ARE STANDARD.
       01  MREQ-RQ-REC-I.
           COPY DDS-MCRPCS2000  OF MCFLCS2001.

       FD  DREQD-RQ-I
           LABEL RECORDS ARE STANDARD.
       01  DREQD-RQ-REC-I.
           COPY DDS-MCRPCS2100  OF MCFLCS2101.

       FD  DREQQUE-RQ-O
           LABEL RECORDS ARE STANDARD.
       01  DREQQUE-RQ-REC-O.
           COPY DDS-MCRPCS4400  OF MCFLCS4401.

       FD  DPATHDEF-PN-O
           LABEL RECORDS ARE STANDARD.
       01  DPATHDEF-PN-REC-O.
           COPY DDS-MCRPCS4000  OF MCFLCS4001.

       FD  WO-BASIC-WO-I
           LABEL RECORDS ARE STANDARD.
       01  WO-BASIC-WO-REC-I.
           COPY DDS-MCRPMM1000  OF MCFLMM1001.

       FD  WO-PLANNED-WO-I
           LABEL RECORDS ARE STANDARD.
       01  WO-PLANNED-WO-REC-I.
           COPY DDS-MCRPMM1100  OF MCFLMM1101.

       FD  WO-PARTS-WO-I
           LABEL RECORDS ARE STANDARD.
       01  WO-PARTS-WO-REC-I.
           COPY DDS-MCRPMM1200  OF MCFLMM1201.

       FD  ONLINE-PRT
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 132 CHARACTERS
           DATA RECORD IS PRINT-RCD.
       01  PRINT-RCD.
           05  PRINT-LINE                PIC X(132).

      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       WORKING-STORAGE SECTION.
       01  SAVE-PARA-NUMBER              PIC X(2).
       01  HANDLE-BLOWUP-FLAG            PIC X(1).
       01  WORK-LINE                     PIC X(132) VALUE SPACES.
       01  UPDATE-FLAG                   PIC X(1)  VALUE "N".
       01  BAD-COMMENT-FLAG              PIC X(1).
       01  FOUND-LEVEL-FLAG              PIC X(1).
       01  SAVE-COMMENT-1                PIC X(36).
       01  SAVE-COMMENT-2                PIC X(36).
       01  SUB                           PIC 9(4)  VALUE 0.
       01  SUB2                          PIC 9(4)  VALUE 0.
       01  I                             PIC 9(4)  VALUE 0.
       01  J                             PIC 9(4)  VALUE 0.
       01  EMPL-LIMIT                    PIC 9(4)  VALUE 0.
       01  APPROVALS-LEFT-COUNT          PIC 9(4)  VALUE 0.
       01  SAVE-REQ-APPROVALS-LEFT       PIC 9(4)  VALUE 0.
       01  DELETE-ANSWER                 PIC X(1)  VALUE "N".
       01  TEST-STATUS                   PIC X(2).
       01  TEST-REQ-NO                   PIC X(14).
       01  REQ-DELETED-FLAG              PIC X(1).
       01  SAVE-HIGHEST-DATE-CN          PIC X(8).
       01  RELEASE-DATE-FLAG             PIC X(1).
       01  WORKORDER-CHECK-FLAG          PIC X(1).
       01  CHECK-PATH-RELEASED           PIC X(1).
       01  CHECK-PATH-UNAPPROVED         PIC X(1).
       01  PATH-CHECK-START-DATE-CN.
           05  PATH-CHECK-CC             PIC XX.
           05  PATH-CHECK-START-DATE.
               10  PATH-CHECK-YY         PIC XX.
               10  FILLER                PIC X(4).
       01  BAD-PATH-FLAG                 PIC X(1).
       01  SAVE-REC-NO                   PIC S9(9) BINARY.

      *------ THIS IS FOR TESTING TO MAKE SURE THE COMBINED KEY
      *------ IN DPATHDEF IS PUT TOGETHER CORRECTLY.
       01  BUILD-KEY.
           05  BUILD-KEY-PATH-TYPE       PIC X(1).
           05  BUILD-KEY-INC-EX          PIC X(1).
           05  BUILD-KEY-TYPE            PIC X(2).
           05  BUILD-KEY-LOW-VALUE       PIC X(14).

      ******************************************************************
      **                                                              **
      **          S U B P R O G R A M   A R E A S                     **
      **                                                              **
      ******************************************************************

       COPY OVRPFDAT   IN COPYLIB.
       COPY CCHKOBJ    IN COPYLIB.
       COPY TBLOWUP    IN COPYLIB.
       COPY CEARQPH    IN COPYLIB.
       COPY CEAQUE     IN COPYLIB.
       COPY CEACHKPH   IN COPYLIB.
       COPY CMANREQ    IN COPYLIB.
       COPY CEAQNEXT   IN COPYLIB.
       COPY TDATECHK   IN COPYLIB.
       COPY SREQPRNT   IN COPYLIB.
       01  CMANREQ-MESSAGE-BUFFER        PIC X(76) VALUE SPACES.

       COPY REQGLOB    IN COPYLIB.
       COPY LANGUAGE   IN COPYLIB.
       COPY ESCNAM2   IN COPYLIB.
       COPY VCOMAREA   IN COPYLIB.
       01  FORMFILE.
           05  FORM-FNAME                PIC X(8)  VALUE "DUMMY  ".
           05  FILLER                    PIC X     VALUE ".".
           05  FORM-GNAME.
               10  FORM-GNAME1           PIC X(5)  VALUE "FLANG".
               10  FORM-GNAME2           PIC X(3)  VALUE SPACES.
           05  FILLER                    PIC X(19) VALUE SPACES.


      *************************************************************
      **                                                         **
      **           D A T A B A S E   W O R K                     **
      **                                                         **
      *************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X  VALUE "0".
           05  FILE-STATUS-2             PIC X  VALUE "0".

       01  BASE                          PIC X(10) VALUE "  STORES;".
       01  BASE-MMISA                    PIC X(24) VALUE "  MMISA;".
       01  BASE-BUDGET                   PIC X(24) VALUE SPACES.
       01  BASE-DUMMY                    PIC X(24) VALUE SPACES.
       01  PASSWORD                      PIC X(5)  VALUE "JADE;".
       01  PASSWORD-MMISA                PIC X(7)  VALUE "DO-ALL;".
       01  DSET-NAMES.
           05  DSET-NAME                 PIC X(16) VALUE SPACES.
           05  DSET-MREQ                 PIC X(16) VALUE "MREQ;".
           05  DSET-DREQQUE              PIC X(16) VALUE "DREQQUE;".
           05  DSET-MEMPL                PIC X(16) VALUE "MEMPL;".
           05  DSET-WO-BASIC             PIC X(16) VALUE "WO-BASIC;".
           05  DSET-WO-PLANNED           PIC X(16) VALUE "WO-PLANNED;".
           05  DSET-WO-PARTS             PIC X(16) VALUE "WO-PARTS;".
           05  DSET-DREQD                PIC X(16) VALUE "DREQD;".
           05  DSET-MPATH                PIC X(16) VALUE "MPATH;".
           05  DSET-DPATHDEF             PIC X(16) VALUE "DPATHDEF;".
           05  DSET-MLEVEL               PIC X(16) VALUE "MLEVEL;".
           05  DSET-MPLTINFO             PIC X(16) VALUE "MPLTINFO;".

       01  DIRECTED-ADDR                 PIC S9(9) BINARY VALUE 0.
       COPY DBSTAT     IN COPYLIB.
       01  REQ-SEARCH                    PIC X(16) VALUE "REQ-NUMBER;".
       01  WO-SEARCH                     PIC X(7)  VALUE "WO-NUM;".
       01  REQ-ARG                       PIC X(12) VALUE SPACES.
       01  EMPL-ARG                      PIC X(4)  VALUE SPACES.
       01  WO-NUM-ARG                    PIC X(10) VALUE SPACES.
       01  PATH-ARG.
           05  PATH-ARG-PREFIX           PIC X(1)  VALUE SPACES.
           05  PATH-ARG-NUMBER           PIC 9(3)  VALUE 0.
       01  PLT-ARG                       PIC X(4)  VALUE SPACES.
       01  LEVEL-ARG                     PIC X(2)  VALUE SPACES.

       01  MODE-AREA.
           05  DB-MODE                   PIC S9(4)   COMP       VALUE 0.
           05  MODE1                     PIC S9(4)   COMP       VALUE 1.
           05  MODE2                     PIC S9(4)   COMP       VALUE 2.
           05  MODE3                     PIC S9(4)   COMP       VALUE 3.
           05  MODE4                     PIC S9(4)   COMP       VALUE 4.
           05  MODE5                     PIC S9(4)   COMP       VALUE 5.
           05  MODE7                     PIC S9(4)   COMP       VALUE 7.

       01  ALL-ITEMS                     PIC X(2)  VALUE "@;".

       01  MULTI-LOCK.
           05  NUMBER-OF-DSETS-LOCKED    PIC S9(4) BINARY VALUE 2.
           05  LOCK1.
               10  LENGTH-1              PIC S9(4) BINARY VALUE 24.
               10  DSET-NAME-1           PIC X(16)  VALUE "MREQ;".
               10  ITEM-LIST-1        PIC X(16)  VALUE "REQ-NUMBER;".
               10  REL-OP-1              PIC XX     VALUE "= ".
               10  LOCK-VALUE-1          PIC X(12)  VALUE SPACES.
           05  LOCK2.
               10  LENGTH-2              PIC S9(4) BINARY VALUE 24.
               10  DSET-NAME-2           PIC X(16)  VALUE "DREQQUE;".
               10  ITEM-LIST-2        PIC X(16)  VALUE "REQ-NUMBER;".
               10  REL-OP-2              PIC XX     VALUE "= ".
               10  LOCK-VALUE-2          PIC X(12)  VALUE SPACES.

       COPY MREQ       IN COPYLIB.
       COPY DREQD      IN COPYLIB.
       COPY DREQQUE    IN COPYLIB.
       COPY MEMPL      IN COPYLIB.
       COPY MLEVEL     IN COPYLIB.
       COPY MPATH      IN COPYLIB.
       COPY DPATHDEF   IN COPYLIB.
       COPY MPLT0      IN COPYLIB.
       COPY MPLTPOPT   IN COPYLIB.
       COPY MPLTP01   IN COPYLIB.
       01  BUF-WO-BASIC.                 COPY DWOBASIC IN COPYLIB.
       01  BUF-WO-PLANNED.               COPY DWOPLAN  IN COPYLIB.
       01  BUF-WO-PARTS.                 COPY DWOPARTS IN COPYLIB.

       PROCEDURE DIVISION.

       0000-START.
           MOVE "01"                     TO  SAVE-PARA-NUMBER.
           MOVE "N" TO UPDATE-FLAG, DELETE-ANSWER.
           MOVE ZERO TO SUB, SUB2, I, J, EMPL-LIMIT,
             APPROVALS-LEFT-COUNT.
      *------ OVERRIDE THE PRINT FILE AS SHARED SO SUBPROGRAM GOES
      *------ TO SAME PRINT FILE.
           PERFORM 9999-OVERRIDE-PRINT.
           PERFORM 9999-OPENS.
      *------ PRINT AT THE BLANK FORM PO PRINTER, IF THE KEY
      *------ DOES NOT EXIST IN DATABASE, PRINT TO LOCAL PRINTER
           MOVE "POPT"                   TO  PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-I.
           IF NO-ENTRY
               MOVE 99                   TO  REQ-APP-PRT-NUM
           ELSE
               MOVE MPLTINFO-REQ-PRT-NO  TO  REQ-APP-PRT-NUM.

           MOVE "P 01"                   TO  PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-I.

           PERFORM 6000-MAIN THRU 6990-MAIN-X.
           PERFORM 9999-CLOSES.
           GOBACK.

       2100-BLOWUP.
           MOVE "TEACHECK"               TO  BU-PGM-NAME.
           MOVE MREQ-NUMBER              TO  BU-DISPLAY-FLD (1).
           MOVE REQ-ARG                  TO  BU-DISPLAY-FLD (2).
           MOVE SAVE-PARA-NUMBER         TO  BU-DISPLAY-FLD (3).
           CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
             DUMMY-VIEW-AREA, FILE-STATUS BU-DISPLAY-MSG
             BU-DISPLAY-FLDS.

       6000-MAIN.
           MOVE "02"                     TO  SAVE-PARA-NUMBER.
           DISPLAY "CORRECT/UPDATE THE DATABASE (Y/N)?".
           ACCEPT UPDATE-FLAG.
           DISPLAY UPDATE-FLAG.
           IF UPDATE-FLAG = "y"
               MOVE "Y"                  TO  UPDATE-FLAG.
           DISPLAY "CHECK RELEASE DATES (Y/N)?".
           ACCEPT RELEASE-DATE-FLAG.
           DISPLAY RELEASE-DATE-FLAG.
           DISPLAY "CHECK WORKORDER EXISTENCE (Y/N)?".
           ACCEPT WORKORDER-CHECK-FLAG.
           DISPLAY WORKORDER-CHECK-FLAG.
           DISPLAY "CHECK PATHS FOR UNAPPROVED REQS (Y/N)?".
           ACCEPT CHECK-PATH-UNAPPROVED.
           DISPLAY CHECK-PATH-UNAPPROVED.
           DISPLAY "CHECK PATHS FOR RELEASED REQS (Y/N)?".
           ACCEPT CHECK-PATH-RELEASED.
           DISPLAY CHECK-PATH-RELEASED.
           DISPLAY "ENTER PATH CHECK START DATE".
           DISPLAY "YYMMDD".
           ACCEPT PATH-CHECK-START-DATE.
           IF PATH-CHECK-YY > "70"
               MOVE "19"                 TO  PATH-CHECK-CC
           ELSE
           MOVE "20"                     TO  PATH-CHECK-CC.
           DISPLAY PATH-CHECK-START-DATE-CN.

      *------ CHECK FOR EXISTENCE OF SOME BASIC REQUIRED KEYS.
           MOVE "R001"                   TO  PATH-ARG.
           PERFORM 9999-GETKEY-MPATH-PN-O.
           IF NOT GOOD-CALL
             MOVE "THE DEFAULT PATH DOES NOT EXIST|" TO PRINT-RCD
             WRITE PRINT-RCD AFTER ADVANCING 1
             IF UPDATE-FLAG = "Y"
               MOVE "R001"               TO  MPATH-PATH-NUMBER
               MOVE "DEFAULT PATH: MANUAL APPROVAL"
                                         TO  MPATH-PATH-DESC
               MOVE 0                    TO  MPATH-MIN-VAL
               MOVE 0                    TO  MPATH-MAX-VAL
               MOVE "N"                  TO  MPATH-WO-APPROVE
               MOVE SPACES               TO  MPATH-LEVELS
               MOVE "99"                 TO  MPATH-LEVEL (1)
               MOVE "9998"               TO  MPATH-EMPL (1)
               MOVE "S"                  TO  MPATH-LV-O-S (1)
               MOVE "Y"                  TO  MPATH-PRINT-OPTION
               MOVE "MPATH;"             TO  DSET-NAME
               PERFORM 9999-DSET-LOCK
               PERFORM 9999-PUT-MPATH-PN-O
               PERFORM 9999-UNLOCK
               MOVE "DPATHDEF;"          TO  DSET-NAME
               PERFORM 9999-DSET-LOCK
               MOVE "R001"               TO  DPATHD-PATH-NUMBER
               MOVE "E"                  TO  DPATHD-INCL-EXCL-FLAG
               MOVE "E"                  TO  DPATHD-TYPE
               MOVE "000000"             TO  DPATHD-LOW-VALUE
               MOVE "999999"             TO  DPATHD-HIGH-VALUE
               MOVE "R"                  TO  DPATHD-KEY-PATH-TYPE
               MOVE "E"                  TO  DPATHD-KEY-INC-EX
               MOVE "E"                  TO  DPATHD-KEY-TYPE
               MOVE "000000"             TO  DPATHD-KEY-LOW-VALUE
               PERFORM 9999-PUT-DPATHDEF-PN-O
               PERFORM 9999-UNLOCK.
           PERFORM 9999-RESET-MPATH-PN-O.

           MOVE "00"                     TO  LEVEL-ARG.
           PERFORM 9999-GETKEY-MLEVEL-LN-O.
           IF NO-ENTRY
             MOVE "NO LEVEL '00' EXISTS" TO  PRINT-RCD
             WRITE PRINT-RCD AFTER ADVANCING 1
             IF UPDATE-FLAG = "Y"
               MOVE SPACES               TO  BUF-MLEVEL
               MOVE 0                    TO  MLEVEL-LEVEL-NUM
               MOVE "REQUISITION ORIGINATOR"
                                         TO  MLEVEL-LEVEL-DESC
               MOVE "MLEVEL;"            TO  DSET-NAME
               PERFORM 9999-DSET-LOCK
               PERFORM 9999-PUT-MLEVEL-LN-O
               PERFORM 9999-UNLOCK.
           PERFORM 9999-RESET-MLEVEL-LN-O.

           MOVE "98"                     TO  LEVEL-ARG.
           PERFORM 9999-GETKEY-MLEVEL-LN-O.
           IF NO-ENTRY
             MOVE "NO LEVEL '98' EXISTS" TO  PRINT-RCD
             WRITE PRINT-RCD AFTER ADVANCING 1
             IF UPDATE-FLAG = "Y"
               MOVE SPACES               TO  BUF-MLEVEL
               MOVE 98                   TO  MLEVEL-LEVEL-NUM
               MOVE "WORKORDER APPROVAL"
                                         TO  MLEVEL-LEVEL-DESC
               MOVE "WOAP"               TO  MLEVEL-ACTIVE-EMPL
               MOVE "MLEVEL;"            TO  DSET-NAME
               PERFORM 9999-DSET-LOCK
               PERFORM 9999-PUT-MLEVEL-LN-O
               PERFORM 9999-UNLOCK.
           PERFORM 9999-RESET-MLEVEL-LN-O.

           MOVE "99"                     TO  LEVEL-ARG.
           PERFORM 9999-GETKEY-MLEVEL-LN-O.
           IF NO-ENTRY
             MOVE "NO LEVEL '99' EXISTS" TO  PRINT-RCD
             WRITE PRINT-RCD AFTER ADVANCING 1
             IF UPDATE-FLAG = "Y"
               MOVE SPACES               TO  BUF-MLEVEL
               MOVE 99                   TO  MLEVEL-LEVEL-NUM
               MOVE "REQUISITION RELEASE POINT - MANUAL APPROVAL"
                                         TO  MLEVEL-LEVEL-DESC
               MOVE "MLEVEL;"            TO  DSET-NAME
               PERFORM 9999-DSET-LOCK
               PERFORM 9999-PUT-MLEVEL-LN-O
               PERFORM 9999-UNLOCK.
           PERFORM 9999-RESET-MLEVEL-LN-O.

           MOVE "WOAP"                   TO  EMPL-ARG.
           PERFORM 9999-GETKEY-MEMPL-EM-O.
           IF NO-ENTRY
             MOVE "NO 'WOAP' EMPLOYEE FOUND" TO PRINT-RCD
             WRITE PRINT-RCD AFTER ADVANCING 1
             IF UPDATE-FLAG = "Y"
               MOVE SPACES               TO  BUF-MEMPL
               MOVE "WOAP"               TO  MEMPL-EMPL
               MOVE "98"                 TO  MEMPL-LEVEL
               MOVE "Y"                  TO  MEMPL-ACTIVE-FLAG
               MOVE "N"                  TO  MEMPL-INVOICE-FLAG
               MOVE "N"                  TO  MEMPL-CRT-RQ-FLAG
               MOVE "N"                  TO  MEMPL-APP-RQ-FLAG
               MOVE "N"                  TO  MEMPL-REQ-SETUP-FLAG
               MOVE "N"                  TO  MEMPL-FORWARD-CAP
               MOVE "N"                  TO  MEMPL-BYPASS-CAP
               MOVE "N"                  TO  MEMPL-MODIFY-CAP
               MOVE "N"                  TO  MEMPL-RETURN-CAP
               MOVE "MEMPL;"             TO  DSET-NAME
               PERFORM 9999-DSET-LOCK
               PERFORM 9999-PUT-MEMPL-EM-O
               PERFORM 9999-UNLOCK.
           PERFORM 9999-RESET-MEMPL-EM-O.

           MOVE "    "                   TO  EMPL-ARG.
           PERFORM 9999-GETKEY-MEMPL-EM-O.
           IF NO-ENTRY
             MOVE "NO BLANK EMPLOYEE FOUND" TO PRINT-RCD
             WRITE PRINT-RCD AFTER ADVANCING 1
             IF UPDATE-FLAG = "Y"
               MOVE SPACES               TO  BUF-MEMPL
               MOVE "    "               TO  MEMPL-EMPL
               MOVE "00"                 TO  MEMPL-LEVEL
               MOVE "N"                  TO  MEMPL-ACTIVE-FLAG
               MOVE "N"                  TO  MEMPL-INVOICE-FLAG
               MOVE "N"                  TO  MEMPL-CRT-RQ-FLAG
               MOVE "N"                  TO  MEMPL-APP-RQ-FLAG
               MOVE "N"                  TO  MEMPL-REQ-SETUP-FLAG
               MOVE "N"                  TO  MEMPL-FORWARD-CAP
               MOVE "N"                  TO  MEMPL-BYPASS-CAP
               MOVE "N"                  TO  MEMPL-MODIFY-CAP
               MOVE "N"                  TO  MEMPL-RETURN-CAP
               MOVE "MEMPL;"             TO  DSET-NAME
               PERFORM 9999-DSET-LOCK
               PERFORM 9999-PUT-MEMPL-EM-O
               PERFORM 9999-UNLOCK.
           PERFORM 9999-RESET-MEMPL-EM-O.

           MOVE "9998"                   TO  EMPL-ARG.
           PERFORM 9999-GETKEY-MEMPL-EM-O.
           IF NO-ENTRY
             MOVE "NO 9998 EMPLOYEE FOUND" TO PRINT-RCD
             WRITE PRINT-RCD AFTER ADVANCING 1
             IF UPDATE-FLAG = "Y"
               MOVE SPACES               TO  BUF-MEMPL
               MOVE "9998"               TO  MEMPL-EMPL
               MOVE "99"                 TO  MEMPL-LEVEL
               MOVE "N"                  TO  MEMPL-ACTIVE-FLAG
               MOVE "N"                  TO  MEMPL-INVOICE-FLAG
               MOVE "N"                  TO  MEMPL-CRT-RQ-FLAG
               MOVE "N"                  TO  MEMPL-APP-RQ-FLAG
               MOVE "N"                  TO  MEMPL-REQ-SETUP-FLAG
               MOVE "N"                  TO  MEMPL-FORWARD-CAP
               MOVE "N"                  TO  MEMPL-BYPASS-CAP
               MOVE "N"                  TO  MEMPL-MODIFY-CAP
               MOVE "N"                  TO  MEMPL-RETURN-CAP
               MOVE "MEMPL;"             TO  DSET-NAME
               PERFORM 9999-DSET-LOCK
               PERFORM 9999-PUT-MEMPL-EM-O
               PERFORM 9999-UNLOCK.
           PERFORM 9999-RESET-MEMPL-EM-O.

           PERFORM 7300-DBCLOSE-MODE3.

           MOVE "STARTING SERIAL LOOP 1" TO  PRINT-RCD.
           WRITE PRINT-RCD AFTER ADVANCING 1.
       6100-SERIAL-LOOP.
           MOVE "03"                     TO  SAVE-PARA-NUMBER.
           PERFORM 9999-GETSER-MREQ-RQ-I.
           IF END-OF-FILE
               MOVE "END OF SERIAL LOOP 1" TO PRINT-RCD
               WRITE PRINT-RCD AFTER ADVANCING 1
               GO TO 6500-SERIAL-LOOP-2.

           MOVE REC-NO                   TO  SAVE-REC-NO.

           MOVE MREQ-NUMBER              TO  REQ-ARG.
           PERFORM 9999-CHAINHD-DREQD-RQ-I.

           PERFORM 9999-GETNEXT-DREQD-RQ-I.
           IF END-OF-CHAIN
               MOVE SPACES               TO  BUF-DREQD.

      *------ IF REQ WAS ON WO, MAKE SURE THE WO STILL EXISTS AND THE
      *------ REQ EXISTS ON THAT WO.  IF NOT, DELETE THE REQ.
           IF DREQD-WO-NUMBER > SPACES AND WORKORDER-CHECK-FLAG = "Y"
               MOVE DREQD-WO-NUMBER      TO  WO-NUM-ARG
               PERFORM 8000-CHECK-WO THRU 8090-CW-X
               IF REQ-DELETED-FLAG = "Y"
                   GO TO 6100-SERIAL-LOOP.

      *------ MAKE SURE THE REQ RELEASE DATE IS UPDATED CORRECTLY.
           IF RELEASE-DATE-FLAG NOT = "Y"
               NEXT SENTENCE
           ELSE
           IF REQ-RELEASE-STAT = "X " OR "XX"
               IF REQ-REL-MC-DATE-CN NOT NUMERIC
                   MOVE SPACES           TO  WORK-LINE
                   STRING REQ-ARG, " DATE ", REQ-DATE-CN, " REL STAT ",
                     REQ-RELEASE-STAT, " STATUS", REQ-STATUS,
                     " HAD NO RELEASE DATE" DELIMITED BY SIZE
                       INTO WORK-LINE
                     MOVE WORK-LINE      TO  PRINT-RCD
                     WRITE PRINT-RCD AFTER ADVANCING 1
                   IF UPDATE-FLAG = "Y"
                       PERFORM 8200-UPDATE-REL-DATE THRU 8290-URD-X
                       IF REQ-REL-MC-DATE-CN NOT NUMERIC
                           MOVE REQ-DATE-CN TO  REQ-REL-MC-DATE-CN
                           PERFORM 7000-UPDATE-MREQ.

      *------ MAKE SURE THAT THE ORIGINATOR EXISTS IN 'MEMPL'.  IF NOT
      *------ CREATE IT.
           MOVE REQ-ORIGINATOR           TO  EMPL-ARG
           PERFORM 9999-GETKEY-MEMPL-EM-O
           IF GOOD-CALL
               PERFORM 9999-RESET-MEMPL-EM-O
           ELSE
               MOVE SPACES               TO  WORK-LINE
               STRING  "EMPLOYEE ", EMPL-ARG, " FOR REQ NUMBER ",
                 MREQ-NUMBER, " DID NOT EXIST" DELIMITED BY SIZE
                 INTO WORK-LINE
               MOVE WORK-LINE            TO  PRINT-RCD
               WRITE PRINT-RCD AFTER ADVANCING 1
               IF UPDATE-FLAG = "Y"
                   MOVE SPACES           TO  BUF-MEMPL
                   MOVE REQ-ORIGINATOR   TO  MEMPL-EMPL
                   MOVE 0                TO  MEMPL-LEVEL
                   MOVE "Y"              TO  MEMPL-ACTIVE-FLAG
                   MOVE "N"              TO  MEMPL-INVOICE-FLAG
                   MOVE "Y"              TO  MEMPL-CRT-RQ-FLAG
                   MOVE "N"              TO  MEMPL-APP-RQ-FLAG
                   MOVE "N"              TO  MEMPL-FORWARD-CAP
                   MOVE "N"              TO  MEMPL-BYPASS-CAP
                   MOVE "N"              TO  MEMPL-MODIFY-CAP
                   MOVE "MEMPL;"         TO  DSET-NAME
                   PERFORM 9999-DSET-LOCK
                   PERFORM 9999-PUT-MEMPL-EM-O
                   PERFORM 9999-UNLOCK
               ELSE
                   PERFORM 9999-RESET-MEMPL-EM-O.

           IF REQ-APPROVALS-LEFT NOT NUMERIC
               MOVE "99"                 TO  REQ-APPROVALS-LEFT.

           MOVE REQ-APPROVALS-LEFT-9     TO  SAVE-REQ-APPROVALS-LEFT.

           PERFORM 7500-CHECK-AGAINST-PATH THRU 7590-CAP-X.
           PERFORM 9999-RESET-DREQQUE-RQ-O.
           IF CHKPH-RET-CODE NOT = "OK"
               IF UPDATE-FLAG = "Y"
                   CALL "CEAFIXPH" USING BASE, STATUS-AREA,
                     CHKPH-RET-CODE, SAVE-DREQQUE-TABLE,
                     BUF-MREQ, BU-DISPLAY-MSG
                   IF BU-DISPLAY-MSG-1 NOT = SPACES
                       PERFORM 2100-BLOWUP
                   ELSE
                       MOVE ZERO         TO  SUB
                       PERFORM CHKPH-SUB TIMES
                           ADD 1         TO  SUB
                           MOVE CHKPH-LINE (SUB) TO PRINT-RCD
                           WRITE PRINT-RCD AFTER ADVANCING 1
                       END-PERFORM.

      *------ IN CASE ONE OF ABOVE SUBPROGRAMS LOST OUR POSITION
           PERFORM 9999-REGET-MREQ-RQ-O.

           GO TO 6100-SERIAL-LOOP.

       6500-SERIAL-LOOP-2.
           MOVE "06"                     TO  SAVE-PARA-NUMBER.
           MOVE "STARTING SERIAL-LOOP 2" TO  PRINT-RCD.
           WRITE PRINT-RCD AFTER ADVANCING 1.
           PERFORM 9999-BEGFIL-DREQQUE-RQ-O.

       6510-LOOP-2.
           MOVE "07"                     TO  SAVE-PARA-NUMBER.
           PERFORM 9999-GETSER-DREQQUE-RQ-O.
           IF END-OF-FILE
               MOVE "END OF SERIAL LOOP 2" TO PRINT-RCD
               WRITE PRINT-RCD AFTER ADVANCING 1
               GO TO 6600-SERIAL-LOOP-3.

           MOVE DRQQ-REQ-NUMBER          TO  REQ-ARG.
           PERFORM 9999-GETKEY-MREQ-RQ-O.
           PERFORM 9999-RESET-MREQ-RQ-O.

      *------ THE EMPLOYEE ORIGINATOR IN THE DREQQUE CHAIN MUST MATCH
      *------ THE ORIGINATOR IN THE REQ MASTER.
           IF DRQQ-EMPL-ORIG NOT = REQ-ORIGINATOR
               MOVE SPACES               TO  WORK-LINE
               STRING "ON REQ ", MREQ-NUMBER,
                 " DRQQ-EMPL-ORIG = ", DRQQ-EMPL-ORIG
                 " REQ-ORIGINATOR = ", REQ-ORIGINATOR
                 DELIMITED BY SIZE INTO WORK-LINE
               MOVE WORK-LINE            TO  PRINT-RCD
               WRITE PRINT-RCD AFTER ADVANCING 1
               IF UPDATE-FLAG = "Y"
                   PERFORM 7100-FIX-ORIG.

      *------ MAKE SURE THE DREQQUE CHAINS FOR THE COMBINATION OF EMPL
      *------ AND STATUS MATCH THE STATUS OF THE REQ (EMPL ORIG + STATUS
      *------ AND EMPL QUEUED + STATUS).
      *------ NOTE: WE DONT CHANGE THE DREQQUE ENTRIES TO THE 'XX'
      *------ STATUS: IT TAKES TOO LONG ON PO CREATE.  ON INQUIRY, IF
      *------ THEY WANT TO SEE 'ON PO' STATUS, THEY HAVE TO LOOK AT THE
      *------ LONG CHAIN
      *------ NOTE| THE LEV "00" (ORIGINATOR) EQ AND EO STAT ONLY CHANGE
      *------ WHEN THE REQ IS RELEASED.  THE OTHER LEVELS CHANGE WHEN
      *------ THAT LEVEL APPROVES IT. FOR THE OTHER LEVELS ONLY EQ IS
      *------ IMPORTANT
      *------ NOTE| AS OF 11/2/88 WHEN A REQ HAS DUPLICATE APPROVERS THE
      *------ EQ STATUS IS NOT UPDATED SO SOME OF THESE ERRORS MAY BE
      *------ NORMAL
           IF REQ-RELEASE-STAT = "U " OR "XX"
               NEXT SENTENCE
           ELSE
           IF DRQQ-LEVEL-NUM = "00"
               NEXT SENTENCE
           ELSE
           IF DRQQ-APPROVE-DATE-CN NUMERIC AND DRQQ-EQ-ST = "X "
               NEXT SENTENCE
           ELSE
           IF (DRQQ-APPROVE-DATE-CN NOT NUMERIC) AND DRQQ-EQ-ST = "  "
               NEXT SENTENCE
           ELSE
               MOVE SPACES               TO  WORK-LINE
               STRING  "REQ ", MREQ-NUMBER, " DATE ", REQ-DATE-CN,
                 " APPROVE DATE ", DRQQ-APPROVE-DATE-CN,
                 " EQ-STAT = ", DRQQ-EQ-ST,
                 " LEV ", DRQQ-LEVEL-NUM DELIMITED BY SIZE
                   INTO WORK-LINE
                 WRITE PRINT-RCD FROM WORK-LINE AFTER ADVANCING 1
               IF UPDATE-FLAG = "Y"
                   PERFORM 7200-FIX-QUEUED-2.

           IF DRQQ-EQ-EMPL NOT = DRQQ-EMPL-QUEUED
               MOVE SPACES               TO  WORK-LINE
               STRING  "FOR REQ ", MREQ-NUMBER, " DRQQ-EQ-EMPL = ",
                 DRQQ-EQ-EMPL, " DRQQ-EMPL-QUEUED = ",
                 DRQQ-EMPL-QUEUED DELIMITED BY SIZE
                 INTO WORK-LINE
               WRITE PRINT-RCD FROM WORK-LINE AFTER ADVANCING 1
               IF UPDATE-FLAG = "Y"
                   PERFORM 7200-FIX-QUEUED-2.

           IF DRQQ-EO-EMPL NOT = DRQQ-EMPL-ORIG
               MOVE SPACES               TO  WORK-LINE
               STRING  "FOR REQ ", MREQ-NUMBER, " DRQQ-EO-EMPL = ",
                 DRQQ-EO-EMPL, " DRQQ-EMPL-ORIG = ",
                 DRQQ-EMPL-ORIG DELIMITED BY SIZE INTO WORK-LINE
               WRITE PRINT-RCD FROM WORK-LINE AFTER ADVANCING 1
               IF UPDATE-FLAG = "Y"
                   PERFORM 7200-FIX-QUEUED-2.

           GO TO 6510-LOOP-2.


       6600-SERIAL-LOOP-3.
           MOVE "STARTING SERIAL LOOP 3" TO  PRINT-RCD.
           WRITE PRINT-RCD AFTER ADVANCING 1.

       6610-LOOP-3.
           MOVE "08"                     TO  SAVE-PARA-NUMBER.
           PERFORM 9999-GETSER-DPATHDEF-PN-O.
           IF END-OF-FILE
               MOVE "END OF SERIAL LOOP 3" TO PRINT-RCD
               WRITE PRINT-RCD AFTER ADVANCING 1
               GO TO 6990-MAIN-X.

           MOVE DPATHD-PATH-PREFIX       TO  BUILD-KEY-PATH-TYPE.
           MOVE DPATHD-INCL-EXCL-FLAG    TO  BUILD-KEY-INC-EX.
           MOVE DPATHD-TYPE              TO  BUILD-KEY-TYPE.
           MOVE DPATHD-LOW-VALUE         TO  BUILD-KEY-LOW-VALUE.

           IF DPATHD-KEY = BUILD-KEY
               GO TO 6610-LOOP-3.

           MOVE SPACES                   TO  WORK-LINE.
           STRING  "FOR PATH ", DPATHD-PATH-NUMBER,
             " DPATHD-KEY = ", DPATHD-KEY, " BUT SHOULD BE ",
             BUILD-KEY DELIMITED BY SIZE
             INTO WORK-LINE.
           WRITE PRINT-RCD FROM WORK-LINE AFTER ADVANCING 1.

           IF UPDATE-FLAG = "Y"
               NEXT SENTENCE
           ELSE
               GO TO 6610-LOOP-3.

           MOVE BUILD-KEY                TO  DPATHD-KEY.
           MOVE "DPATHDEF;"              TO  DSET-NAME.
           PERFORM 9999-DSET-LOCK.
           PERFORM 9999-DELETE-DPATHDEF-PN-O.
           PERFORM 9999-PUT-DPATHDEF-PN-O.
           PERFORM 9999-UNLOCK.

           GO TO 6610-LOOP-3.



       6990-MAIN-X.
           GOBACK.

       7000-UPDATE-MREQ.
           MOVE "MREQ;"                  TO  DSET-NAME.
           PERFORM 9999-DSET-LOCK.

           PERFORM 9999-GETKEY-MREQ-RQ-O.
           PERFORM 9999-UPDATE-MREQ-RQ-O.
           PERFORM 9999-UNLOCK.

       7010-UPDATE-DREQQUE.
           MOVE "DREQQUE;"               TO  DSET-NAME.
           PERFORM 9999-DSET-LOCK.
           PERFORM 9999-UPDATE-DREQQUE-RQ-O.
           PERFORM 9999-UNLOCK.

       7100-FIX-ORIG.
           IF REQ-ORIGINATOR = SPACES AND DRQQ-EMPL-ORIG > SPACES
               MOVE DRQQ-EMPL-ORIG       TO  REQ-ORIGINATOR
               PERFORM 7000-UPDATE-MREQ
           ELSE
               PERFORM 7120-FIX-ORIG-DREQQUE.

       7120-FIX-ORIG-DREQQUE.
           MOVE "DREQQUE;"               TO  DSET-NAME.
           PERFORM 9999-DSET-LOCK.

           PERFORM 9999-DELETE-DREQQUE-RQ-O.
           MOVE REQ-ORIGINATOR           TO  DRQQ-EMPL-ORIG.
           PERFORM 9999-PUT-DREQQUE-RQ-O.
           PERFORM 9999-UNLOCK.

       7200-FIX-QUEUED-2.
           MOVE "DREQQUE;"               TO  DSET-NAME.
           PERFORM 9999-DSET-LOCK.
           PERFORM 9999-DELETE-DREQQUE-RQ-O.

           MOVE DRQQ-EMPL-QUEUED         TO  DRQQ-EQ-EMPL.
           MOVE DRQQ-EMPL-ORIG           TO  DRQQ-EO-EMPL.

           IF DRQQ-LEVEL-NUM = "00"
               IF REQ-RELEASE-STAT = "XX" OR "X "
                   MOVE "X "             TO  DRQQ-EQ-ST,
                                              DRQQ-EO-ST
               ELSE
                   MOVE SPACES           TO  DRQQ-EQ-ST,
                                              DRQQ-EO-ST
           ELSE
           IF DRQQ-APPROVE-DATE-CN NUMERIC
               MOVE "X "                 TO  DRQQ-EQ-ST,
                                              DRQQ-EO-ST
           ELSE
               MOVE SPACES               TO  DRQQ-EQ-ST,
                                              DRQQ-EO-ST.

           PERFORM 9999-PUT-DREQQUE-RQ-O.
           PERFORM 9999-UNLOCK.

       7300-DBCLOSE-MODE3.
           PERFORM 9999-BEGFIL-MREQ-RQ-O.

       7400-PUT-ORIG-DREQQUE.
      *------ HERE WE ARE PUTTING AN ORIGINATOR ENTRY INTO 'DREQQUE' FOR
      *------ 'X ' OR 'XX' REQS (IN PURCH OR ON PO).  FOR THOSE, WE DONT
      *------ QUEUE UP (SINCE ALREADY APPROVED), BUT WE PUT THE LEVEL 00
      *------ ENTRY OUT SO INQUIRY BY ORIGINATOR WILL WORK.
      *------ DONT MESS WITH REQS WITH NO ORIGINATOR.
           IF REQ-ORIGINATOR = SPACES
               GO TO 7490-POD-X.

           MOVE SPACES                   TO  WORK-LINE.
           STRING  "NO DREQQUE FOR ORIG ", REQ-ORIGINATOR,
             " FOR REQ ", MREQ-NUMBER, " DATE ", REQ-DATE-CN
             DELIMITED BY SIZE INTO WORK-LINE.
           WRITE PRINT-RCD FROM WORK-LINE AFTER ADVANCING 1.

           IF UPDATE-FLAG = "Y"
               NEXT SENTENCE
           ELSE
               GO TO 7490-POD-X.

           MOVE MREQ-NUMBER              TO  DRQQ-REQ-NUMBER.
           MOVE REQ-ORIGINATOR           TO  DRQQ-EMPL-QUEUED.
           MOVE SPACES                   TO  DRQQ-TYPE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-YMD-OUT             TO  DRQQ-QUEUED-DATE.
           IF DRQQ-QUEUED-DATE-YY > "70"
               MOVE "19"                 TO  DRQQ-QUEUED-DATE-CC
           ELSE
           MOVE "20"                     TO  DRQQ-QUEUED-DATE-CC.
           MOVE DATE-YMD-OUT             TO  DRQQ-APPROVE-DATE.
           IF DRQQ-APPROVE-DATE-YY > "70"
               MOVE "19"                 TO  DRQQ-APPROVE-DATE-CC
           ELSE
           MOVE "20"                     TO  DRQQ-APPROVE-DATE-CC.
           MOVE SPACES                   TO  DRQQ-COMMENT-1.
           MOVE SPACES                   TO  DRQQ-COMMENT-2.
           MOVE SPACES                   TO  DRQQ-FLAGS.
           MOVE "X"                      TO  DRQQ-ORIG-FLAG.
           MOVE REQ-ORIGINATOR           TO  DRQQ-EMPL-ORIG.
           MOVE "00"                     TO  DRQQ-LEVEL-NUM.
           MOVE REQ-ORIGINATOR           TO  DRQQ-EQ-EMPL.
           IF REQ-RELEASE-STAT = "XX"
               MOVE "X "                 TO  DRQQ-EQ-ST,
                                              DRQQ-EO-ST
           ELSE
               MOVE REQ-RELEASE-STAT     TO  DRQQ-EQ-ST
                                              DRQQ-EO-ST.
           MOVE REQ-ORIGINATOR           TO  DRQQ-EO-EMPL.
           MOVE SPACES                   TO  DRQQ-PAD.

           MOVE "DREQQUE;"               TO  DSET-NAME.
           PERFORM 9999-DSET-LOCK.

           PERFORM 9999-PUT-DREQQUE-RQ-O.
           PERFORM 9999-UNLOCK.

       7490-POD-X.
           EXIT.

       7500-CHECK-AGAINST-PATH.
           MOVE "OK"                     TO  CHKPH-RET-CODE.
           IF MREQ-NUMBER-1 NOT = "M"
               GO TO 7590-CAP-X
           ELSE
           IF REQ-PATH NOT NUMERIC
               MOVE SPACES               TO  WORK-LINE
               STRING  "*** REQ ", MREQ-NUMBER, " HAD NON-NUMERIC PATH"
                 DELIMITED BY SIZE INTO WORK-LINE
               WRITE PRINT-RCD FROM WORK-LINE AFTER ADVANCING 1
               GO TO 7590-CAP-X
           ELSE
           IF REQ-PATH = "000"
               GO TO 7590-CAP-X
           ELSE
           IF REQ-DATE-CN < PATH-CHECK-START-DATE-CN
               GO TO 7590-CAP-X
           ELSE
           IF REQ-RELEASE-STAT = "XX"
               GO TO 7590-CAP-X
           ELSE
           IF REQ-HOLD-STATUS-CODE > SPACES
               GO TO 7590-CAP-X
           ELSE
           IF REQ-RELEASE-STAT = "X "
               IF CHECK-PATH-RELEASED = "Y"
                   NEXT SENTENCE
               ELSE
                   GO TO 7590-CAP-X
           ELSE
           IF REQ-RELEASE-STAT = "  "
               IF CHECK-PATH-UNAPPROVED = "Y"
                   NEXT SENTENCE
               ELSE
                   GO TO 7590-CAP-X.

           CALL "CEACHKPH" USING BASE, STATUS-AREA, CHKPH-RET-CODE,
             SAVE-DREQQUE-TABLE, BUF-MREQ, BU-DISPLAY-MSG.
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               PERFORM 2100-BLOWUP
           ELSE
               MOVE ZERO                 TO  SUB
               PERFORM CHKPH-SUB TIMES
                   ADD 1                 TO  SUB
                   MOVE CHKPH-LINE (SUB) TO  PRINT-RCD
                   WRITE PRINT-RCD AFTER ADVANCING 1
               END-PERFORM.

       7590-CAP-X.
           EXIT.


       8000-CHECK-WO.
           MOVE "N"                      TO  REQ-DELETED-FLAG.
           IF REQ-RELEASE-STAT = "XX" OR REQ-RELEASE-STAT = "X "
           OR REQ-STATUS = "SS"
               GO TO 8090-CW-X.

           MOVE DREQD-WO-NUMBER      TO  WO-NUM-ARG.
           PERFORM 9999-CHAINHD-WO-BASIC-WO-I.
           PERFORM 9999-GETNEXT-WO-BASIC-WO-I.
           IF NOT GOOD-CALL
               PERFORM 9999-CHAINHD-WO-PLANNED-WO-I
               PERFORM 9999-GETNEXT-WO-PLANNED-WO-I
               IF NOT GOOD-CALL
                  MOVE SPACES        TO  WORK-LINE
                  STRING  "FOR REQ ", REQ-ARG, REQ-DATE, " WO ",
                     WO-NUM-ARG,
                     ": WORKORDER DOES NOT EXIST IN MMISA"
                     DELIMITED BY SIZE INTO WORK-LINE
                   WRITE PRINT-RCD FROM WORK-LINE AFTER ADVANCING 1
                   PERFORM 8100-DELETE-REQ THRU 8190-DR-X
                   GO TO 8090-CW-X
               ELSE
                   MOVE WO-STATUS-P  TO  TEST-STATUS
           ELSE
               MOVE WO-STATUS        TO  TEST-STATUS.

           IF TEST-STATUS = "FF"
               MOVE SPACES               TO  WORK-LINE
               STRING  "FOR REQ ", REQ-ARG, REQ-DATE, " WO ",
                 WO-NUM-ARG, ": WORKORDER IS IN 'FF' STATUS"
                 DELIMITED BY SIZE INTO WORK-LINE
               WRITE PRINT-RCD FROM WORK-LINE AFTER ADVANCING 1
               PERFORM 8100-DELETE-REQ THRU 8190-DR-X
               GO TO 8090-CW-X.

           PERFORM 9999-CHAINHD-WO-PARTS-WO-I.

       8010-GET-WOPARTS-LOOP.
           PERFORM 9999-GETNEXT-WO-PARTS-WO-I.
           IF END-OF-CHAIN
               MOVE SPACES               TO  WORK-LINE
               STRING  "FOR REQ ", REQ-ARG, REQ-DATE, " WO ",
                 WO-NUM-ARG, ": WO HAS NO ITEM ENTRY FOR THIS REQ"
                 DELIMITED BY SIZE INTO WORK-LINE
               WRITE PRINT-RCD FROM WORK-LINE AFTER ADVANCING 1
               PERFORM 8100-DELETE-REQ THRU 8190-DR-X
               GO TO 8090-CW-X.

           MOVE PRT-REQ-NO               TO  TEST-REQ-NO.
           IF TEST-REQ-NO = REQ-ARG
               GO TO 8090-CW-X.

           GO TO 8010-GET-WOPARTS-LOOP.

       8090-CW-X.
           EXIT.

       8100-DELETE-REQ.
           MOVE "Y"                      TO  REQ-DELETED-FLAG.
           IF UPDATE-FLAG = "Y"
               NEXT SENTENCE
           ELSE
               GO TO 8190-DR-X.

           MOVE SPACES                   TO  CMANREQ-MESSAGE-BUFFER.
           MOVE "DT"                     TO  CMR-CALL-MODE.
           MOVE REQ-ARG                  TO  CMR-REQ-NUMBER.
           CALL "CMANREQ" USING          BASE,
                                         BASE-MMISA,
                                         BASE-BUDGET,
                                         BASE-DUMMY,
                                         CMANREQ-MESSAGE-BUFFER,
                                         CMR-CALL-MODE,
                                         CMR-DATA,
                                         CMR-DESC,
                                         CMR-REMARKS,
                                         CMR-RETURNED-DATA,
                                         CMR-MISC-PARMS,
                                         REQ-GLOBALS,
                                         LANGUAGE-PARMS,
                                         ESC-NAME,
                                         VIEW-COMAREA.

           IF CMR-RETURN-STATUS NOT = "OK"
               MOVE SPACES               TO  WORK-LINE
               STRING  "CMANREQ RETURN STATUS = ", CMR-RETURN-STATUS
                 DELIMITED BY SIZE INTO WORK-LINE
                 WRITE PRINT-RCD FROM WORK-LINE AFTER ADVANCING 1.

           IF CMANREQ-MESSAGE-BUFFER > SPACES
               MOVE CMANREQ-MESSAGE-BUFFER TO PRINT-RCD
               WRITE PRINT-RCD AFTER ADVANCING 1.

       8190-DR-X.
           EXIT.

       8200-UPDATE-REL-DATE.
           PERFORM 9999-CHAINHD-DREQQUE-RQ-O.
           MOVE SPACES                   TO  SAVE-HIGHEST-DATE-CN.

       8210-UPDATE-REL-LOOP.
           PERFORM 9999-GETNEXT-DREQQUE-RQ-O.
           IF END-OF-CHAIN
               GO TO 8250-UPDATE-MREQ.

           IF DRQQ-APPROVE-DATE = SPACES
               GO TO 8290-URD-X
           ELSE
           IF DRQQ-APPROVE-DATE-CN > SAVE-HIGHEST-DATE-CN
               MOVE DRQQ-APPROVE-DATE-CN TO  SAVE-HIGHEST-DATE-CN.

           GO TO 8210-UPDATE-REL-LOOP.

       8250-UPDATE-MREQ.
           MOVE SAVE-HIGHEST-DATE-CN     TO  REQ-REL-MC-DATE-CN.
           PERFORM 7000-UPDATE-MREQ.

       8290-URD-X.
           EXIT.

       COPY OVRPFCAL IN COPYLIB.
       9999-OVERRIDE-PRINT.
      *    MOVE "00"              TO OVRPRTF-TOFILE-NUM.
           MOVE "P "              TO OVRPRTF-TOFILE-NUM-X.
           MOVE "*YES"            TO OVRPRTF-SHARED.
           MOVE 1                 TO OVRPRTF-COPIES.
           MOVE "MCPRT"           TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.

       9999-REGET-MREQ-RQ-O.
      *------ DUMMY PARA FOR IBM SINCE IBM DOES NOT LOSE FILE POS.

       9999-OPENS.
           OPEN INPUT MPLTINFO-PK-I         DREQD-RQ-I,
                      WO-BASIC-WO-I         WO-PARTS-WO-I
                      WO-PLANNED-WO-I       MREQ-RQ-I.
           OPEN I-O   DPATHDEF-PN-O         MEMPL-EM-O
                      MREQ-RQ-O             MPATH-PN-O
                      MLEVEL-LN-O           DREQQUE-RQ-O.
           OPEN OUTPUT ONLINE-PRT.

       9999-CLOSES.
           CLOSE MPLTINFO-PK-I, DREQD-RQ-I, WO-BASIC-WO-I,
             WO-PARTS-WO-I, WO-PLANNED-WO-I, DPATHDEF-PN-O,
             MEMPL-EM-O, MREQ-RQ-O, MPATH-PN-O, MLEVEL-LN-O,
             DREQQUE-RQ-O, MREQ-RQ-I.
           CLOSE ONLINE-PRT.
       COPY DLOCKCAL IN COPYLIB.
       COPY MLOCKCAL IN COPYLIB.
       COPY UNLOCK   IN COPYLIB.

       9999-DELETE-DPATHDEF-PN-O.
           MOVE 0 TO COND-WORD.
           DELETE DPATHDEF-PN-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "DELETE ERR 9999-DELETE-DPATHDEF-PN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETSER-DPATHDEF-PN-O.
           MOVE 0 TO COND-WORD.
           READ DPATHDEF-PN-O NEXT INTO BUF-DPATHDEF
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETSER ERR 9999-GETSER-DPATHDEF-PN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-BEGFIL-DPATHDEF-PN-O.
           MOVE SPACES TO PATHNUM OF DPATHDEF-PN-REC-O.
           START DPATHDEF-PN-O KEY >= PATHNUM OF DPATHDEF-PN-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-PUT-DPATHDEF-PN-O.
           MOVE 0 TO COND-WORD.
           WRITE DPATHDEF-PN-REC-O FROM BUF-DPATHDEF
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-DPATHDEF-PN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CHAINHD-DREQQUE-RQ-O.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DREQQUE-RQ-REC-O.
           START DREQQUE-RQ-O KEY = REQNO OF DREQQUE-RQ-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DREQQUE-RQ-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-DELETE-DREQQUE-RQ-O.
           MOVE 0 TO COND-WORD.
           DELETE DREQQUE-RQ-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "DELETE ERR 9999-DELETE-DREQQUE-RQ-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DREQQUE-RQ-O.
           MOVE 0 TO COND-WORD.
           READ DREQQUE-RQ-O NEXT INTO BUF-DREQQUE
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DREQQUE-RQ-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DREQQUE-RQ-O"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF REQNO OF DREQQUE-RQ-REC-O NOT = REQ-ARG
               PERFORM 9999-RESET-DREQQUE-RQ-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DREQQUE-RQ-O.
           MOVE HIGH-VALUES TO REQNO OF DREQQUE-RQ-REC-O.
           START DREQQUE-RQ-O KEY > REQNO OF DREQQUE-RQ-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-GETSER-DREQQUE-RQ-O.
           MOVE 0 TO COND-WORD.
           READ DREQQUE-RQ-O NEXT INTO BUF-DREQQUE
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETSER ERR 9999-GETSER-DREQQUE-RQ-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-BEGFIL-DREQQUE-RQ-O.
           MOVE SPACES TO REQNO OF DREQQUE-RQ-REC-O.
           START DREQQUE-RQ-O KEY >= REQNO OF DREQQUE-RQ-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-PUT-DREQQUE-RQ-O.
           MOVE 0 TO COND-WORD.
           WRITE DREQQUE-RQ-REC-O FROM BUF-DREQQUE
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-DREQQUE-RQ-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-UPDATE-DREQQUE-RQ-O.
           MOVE 0 TO COND-WORD.
           REWRITE DREQQUE-RQ-REC-O FROM BUF-DREQQUE
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "UPDATE ERR 9999-UPDATE-DREQQUE-RQ-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CHAINHD-DREQD-RQ-I.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DREQD-RQ-REC-I.
           START DREQD-RQ-I KEY = REQNO OF DREQD-RQ-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DREQD-RQ-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DREQD-RQ-I.
           MOVE 0 TO COND-WORD.
           READ DREQD-RQ-I NEXT INTO BUF-DREQD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DREQD-RQ-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF REQNO OF DREQD-RQ-REC-I NOT = REQ-ARG
               MOVE 15 TO COND-WORD.

       9999-GETKEY-MEMPL-EM-O.
           MOVE 0 TO COND-WORD.
           MOVE EMPL-ARG TO EMPLOYID OF MEMPL-EM-REC-O.
           READ MEMPL-EM-O INTO BUF-MEMPL
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MEMPL-EM-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-RESET-MEMPL-EM-O.
           MOVE HIGH-VALUES TO EMPLOYID OF MEMPL-EM-REC-O.
           START MEMPL-EM-O KEY > EMPLOYID OF MEMPL-EM-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-PUT-MEMPL-EM-O.
           MOVE 0 TO COND-WORD.
           WRITE MEMPL-EM-REC-O FROM BUF-MEMPL
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-MEMPL-EM-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETKEY-MLEVEL-LN-O.
           MOVE 0 TO COND-WORD.
           MOVE LEVEL-ARG TO LEVELNUM OF MLEVEL-LN-REC-O.
           READ MLEVEL-LN-O INTO BUF-MLEVEL
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MLEVEL-LN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-RESET-MLEVEL-LN-O.
           MOVE HIGH-VALUES TO LEVELNUM OF MLEVEL-LN-REC-O.
           START MLEVEL-LN-O KEY > LEVELNUM OF MLEVEL-LN-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-PUT-MLEVEL-LN-O.
           MOVE 0 TO COND-WORD.
           WRITE MLEVEL-LN-REC-O FROM BUF-MLEVEL
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-MLEVEL-LN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETKEY-MPATH-PN-O.
           MOVE 0 TO COND-WORD.
           MOVE PATH-ARG TO PATHNUM OF MPATH-PN-REC-O.
           READ MPATH-PN-O INTO BUF-MPATH
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MPATH-PN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-RESET-MPATH-PN-O.
           MOVE HIGH-VALUES TO PATHNUM OF MPATH-PN-REC-O.
           START MPATH-PN-O KEY > PATHNUM OF MPATH-PN-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-PUT-MPATH-PN-O.
           MOVE 0 TO COND-WORD.
           WRITE MPATH-PN-REC-O FROM BUF-MPATH
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-MPATH-PN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETKEY-MPLTINFO-PK-I.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-I.
           READ MPLTINFO-PK-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MPLTINFO-PK-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETSER-MREQ-RQ-I.
           MOVE 0 TO COND-WORD.
           READ MREQ-RQ-I NEXT INTO BUF-MREQ
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETSER ERR 9999-GETSER-MREQ-RQ-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-BEGFIL-MREQ-RQ-I.
           MOVE SPACES TO REQNO OF MREQ-RQ-REC-I.
           START MREQ-RQ-I KEY >= REQNO OF MREQ-RQ-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-GETKEY-MREQ-RQ-O.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF MREQ-RQ-REC-O.
           READ MREQ-RQ-O INTO BUF-MREQ
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MREQ-RQ-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-RESET-MREQ-RQ-O.
           MOVE HIGH-VALUES TO REQNO OF MREQ-RQ-REC-O.
           START MREQ-RQ-O KEY > REQNO OF MREQ-RQ-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-GETSER-MREQ-RQ-O.
           MOVE 0 TO COND-WORD.
           READ MREQ-RQ-O NEXT INTO BUF-MREQ
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETSER ERR 9999-GETSER-MREQ-RQ-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-BEGFIL-MREQ-RQ-O.
           MOVE SPACES TO REQNO OF MREQ-RQ-REC-O.
           START MREQ-RQ-O KEY >= REQNO OF MREQ-RQ-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-UPDATE-MREQ-RQ-O.
           MOVE 0 TO COND-WORD.
           REWRITE MREQ-RQ-REC-O FROM BUF-MREQ
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "UPDATE ERR 9999-UPDATE-MREQ-RQ-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CHAINHD-WO-BASIC-WO-I.
           MOVE 0 TO COND-WORD.
           MOVE WO-NUM-ARG TO WONUM OF WO-BASIC-WO-REC-I.
           START WO-BASIC-WO-I KEY = WONUM OF WO-BASIC-WO-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-WO-BASIC-WO-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-WO-BASIC-WO-I.
           MOVE 0 TO COND-WORD.
           READ WO-BASIC-WO-I NEXT INTO BUF-WO-BASIC
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-WO-BASIC-WO-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF WONUM OF WO-BASIC-WO-REC-I NOT = WO-NUM-ARG
               MOVE 15 TO COND-WORD.

       9999-CHAINHD-WO-PLANNED-WO-I.
           MOVE 0 TO COND-WORD.
           MOVE WO-NUM-ARG TO WONUM OF WO-PLANNED-WO-REC-I.
           START WO-PLANNED-WO-I KEY = WONUM OF WO-PLANNED-WO-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-WO-PLANNED-WO-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-WO-PLANNED-WO-I.
           MOVE 0 TO COND-WORD.
           READ WO-PLANNED-WO-I NEXT INTO BUF-WO-PLANNED
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-WO-PLANNED-WO-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF WONUM OF WO-PLANNED-WO-REC-I NOT = WO-NUM-ARG
               MOVE 15 TO COND-WORD.

       9999-CHAINHD-WO-PARTS-WO-I.
           MOVE 0 TO COND-WORD.
           MOVE WO-NUM-ARG TO WONUM OF WO-PARTS-WO-REC-I.
           START WO-PARTS-WO-I KEY = WONUM OF WO-PARTS-WO-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-WO-PARTS-WO-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-WO-PARTS-WO-I.
           MOVE 0 TO COND-WORD.
           READ WO-PARTS-WO-I NEXT INTO BUF-WO-PARTS
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-WO-PARTS-WO-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF WONUM OF WO-PARTS-WO-REC-I NOT = WO-NUM-ARG
               MOVE 15 TO COND-WORD.

