       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TGENWORK.
       DATE-COMPILED.
      *C
      *C 09/10/96  JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   RECOMPILE TO PICK UP COPYLIB CHANGES.
      *C
      *C  01/04/2010  CA YODER  2010-00142425-001
      *C     UPDATE LOGIC ASSIGNING WORKORDER LETTER SUFFIX.
      *C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       SPECIAL-NAMES.          I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                               LOCAL-DATA IS LOCAL-DATA-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZSUFFIX-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DSPLY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

           SELECT WO-PLANNED
                  ASSIGN TO DATABASE-MCFLMM1101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT LABOR-CURR-STAT
                  ASSIGN TO DATABASE-MCFLMM1602
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT WO-PARTS
                  ASSIGN TO DATABASE-MCFLMM1201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC               PIC X(2000).

       FD  WO-PLANNED
           LABEL RECORDS ARE STANDARD.
       01  PWO-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.

       FD  LABOR-CURR-STAT
           LABEL RECORDS ARE STANDARD.
       01  LCS-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1602.

       FD  WO-PARTS
           LABEL RECORDS ARE STANDARD.
       01  PRT-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1201.

       WORKING-STORAGE SECTION.
      *---- 01/04/2010:  ADDED PARAMETER FOR CMMISYR.
       77  MMIS-LETTER                PIC X.
       01  CUR-LABOR-SW        PIC X.
       01  DSPLY-STATUS        PIC XX.
       01  ERROR-BUFFER        PIC X(80).
       01  FILE-STATUS         PIC XX.
       01  REREAD              PIC X.
       01  REQ-SW              PIC X.
       01  TRUE-VAL            PIC 1 VALUE B"1".

       01  PROGRAM-INFORMATION.
           05 PROGRAM-NAME     PIC X(8).
           05 PROGRAM-TYPE     PIC X(2).
           05 PROGRAM-RELEASE  PIC X(12).
           05 PROGRAM-DESCRIPTION.
              10 PROGRAM-DESC1 PIC X(60).
              10 PROGRAM-DESC2 PIC X(60).
              10 PROGRAM-DESC3 PIC X(60).
           05 PROGRAM-FLAG     PIC X.

       01  CDATE.
           05 YY.
              10 FILLER        PIC X.
              10 DATE-YEAR     PIC 9.
           05 MM               PIC 99.
           05 DD               PIC 99.

       01  SAVE-SUFFIX.
           05 SAVE-SUFFIX-NUM  PIC 999.
           05 FILLER           PIC X.

       01  SCREEN-BUFFER.
           05  SCREEN-WO-1.
               10  SCREEN-WO-NO-1             PIC X(6).
               10  SCREEN-WO-YR-1             PIC X.
               10  SCREEN-WO-SUFF-1           PIC XXX.
           05  SCREEN-WO-2.
               10  SCREEN-WO-NO-2             PIC X(6).
               10  SCREEN-WO-YR-2             PIC X.
           05  SCREEN-CMD-LINE                PIC X(79).
           05  SCREEN-ERR-LINE                PIC X(79).

       COPY CATREAD            IN COPYLIB.

       COPY CPYIND             IN COPYLIB.

       COPY IOFEEDBACK         IN COPYLIB.

       COPY WSCONTROL          IN COPYLIB.

       COPY VCOMLINK  OF COPYLIB.

       01  WO-PLANNED-DATA.
           COPY DWOPLAN        IN COPYLIB.

       01  WO-PARTS-DATA.
           COPY DWOPARTS       IN COPYLIB.

       PROCEDURE DIVISION.
       OPEN-PAR.
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          WO-PLANNED LABOR-CURR-STAT WO-PARTS.
           MOVE "TGENWORK"     TO PROGRAM-NAME.
           MOVE "UP"           TO PROGRAM-TYPE.
           MOVE " E0100010001" TO PROGRAM-RELEASE.
           MOVE SPACES         TO PROGRAM-DESCRIPTION.
           MOVE "INITIATE MASTERS & SUFFIXES" TO PROGRAM-DESC1.

           CALL "TPWORD" USING PROGRAM-INFORMATION.
           IF PROGRAM-FLAG = "N" GO TO 2-EOJ.
           MOVE 0              TO VIEW-LASTKEY.
           MOVE "FGENWORK"     TO VIEW-CFNAME.

           PERFORM 6-MAIN THRU 6-MAIN-EXIT UNTIL VIEW-LASTKEY = 3.

       2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE WO-PLANNED LABOR-CURR-STAT WO-PARTS.
           GOBACK.

       6-MAIN.
           MOVE SPACES         TO SCREEN-BUFFER.
           ACCEPT CDATE FROM DATE.

      *------- 01/04/2010:  UPDATED WORKORDER LETTER SUFFIX LOGIC.
      *    IF DATE-YEAR = 0
      *      MOVE "A"          TO SCREEN-WO-YR-1 SCREEN-WO-YR-2
      *    ELSE
      *    IF DATE-YEAR = 1
      *      MOVE "B"          TO SCREEN-WO-YR-1 SCREEN-WO-YR-2
      *    ELSE
      *    IF DATE-YEAR = 2
      *      MOVE "C"          TO SCREEN-WO-YR-1 SCREEN-WO-YR-2
      *    ELSE
      *    IF DATE-YEAR = 3
      *      MOVE "D"          TO SCREEN-WO-YR-1 SCREEN-WO-YR-2
      *    ELSE
      *    IF DATE-YEAR = 4
      *      MOVE "E"          TO SCREEN-WO-YR-1 SCREEN-WO-YR-2
      *    ELSE
      *    IF DATE-YEAR = 5
      *      MOVE "F"          TO SCREEN-WO-YR-1 SCREEN-WO-YR-2
      *    ELSE
      *    IF DATE-YEAR = 6
      *      MOVE "G"          TO SCREEN-WO-YR-1 SCREEN-WO-YR-2
      *    ELSE
      *    IF DATE-YEAR = 7
      *      MOVE "H"          TO SCREEN-WO-YR-1 SCREEN-WO-YR-2
      *    ELSE
      *    IF DATE-YEAR = 8
      *      MOVE "J"          TO SCREEN-WO-YR-1 SCREEN-WO-YR-2
      *    ELSE
      *    IF DATE-YEAR = 9
      *      MOVE "K"          TO SCREEN-WO-YR-1 SCREEN-WO-YR-2.

           CALL "CMMISYR" USING MMIS-LETTER.
           MOVE MMIS-LETTER    TO SCREEN-WO-YR-1 SCREEN-WO-YR-2.
      *-------

           MOVE "000"          TO SCREEN-WO-SUFF-1.
           MOVE 66354          TO CATREAD-MSG-NUMBER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO SCREEN-CMD-LINE.
           MOVE SCREEN-BUFFER  TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.

       6-MAIN-CONT.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC      TO SCREEN-BUFFER.

           IF VIEW-LASTKEY = 3 GO TO 6-MAIN-EXIT.
           MOVE "N"            TO REREAD.

           IF VIEW-LASTKEY = 1
             CALL "TGENMAST"
           ELSE
           IF VIEW-LASTKEY = 4
             PERFORM 60-INITIATE-SUFFIX THRU 60-IS-EXIT
           ELSE
           IF VIEW-LASTKEY = 5
             PERFORM 61-TRANSFORM-PLANNED THRU 61-TP-EXIT.

           IF REREAD = "Y" GO TO 6-MAIN-CONT.
           GO TO 6-MAIN.

       6-MAIN-EXIT.    EXIT.

       60-INITIATE-SUFFIX.
           MOVE SPACES         TO WONUM OF PWO-REC.
           STRING SCREEN-WO-NO-1
                  SCREEN-WO-YR-1
                  SCREEN-WO-SUFF-1
            DELIMITED BY SIZE INTO WONUM OF PWO-REC.

           READ WO-PLANNED     INTO WO-PLANNED-DATA
               INVALID KEY     MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
             MOVE "Y"          TO REREAD
             MOVE 35040        TO CATREAD-MSG-NUMBER
             CALL "CCATREAD" USING CATREAD-PARMS
             MOVE CATREAD-MSG-TEXT TO SCREEN-ERR-LINE
             MOVE TRUE-VAL     TO INDS (1) INDS (99)
             MOVE SCREEN-BUFFER TO DSPLY-REC
             PERFORM 99-SCREEN-WRITE
             GO TO 60-IS-EXIT.

           IF WO-STATUS-P NOT = "OO"
             MOVE "Y"          TO REREAD
             MOVE 39030        TO CATREAD-MSG-NUMBER
             CALL "CCATREAD" USING CATREAD-PARMS
             MOVE CATREAD-MSG-TEXT TO SCREEN-ERR-LINE
             MOVE TRUE-VAL     TO INDS (1) INDS (99)
             MOVE SCREEN-BUFFER TO DSPLY-REC
             PERFORM 99-SCREEN-WRITE
             GO TO 60-IS-EXIT.

           IF WO-START-STATUS = "AA"
             MOVE "Y"          TO REREAD
             MOVE 35040        TO CATREAD-MSG-NUMBER
             CALL "CCATREAD" USING CATREAD-PARMS
             MOVE CATREAD-MSG-TEXT TO SCREEN-ERR-LINE
             MOVE TRUE-VAL     TO INDS (1) INDS (99)
             MOVE SCREEN-BUFFER TO DSPLY-REC
             PERFORM 99-SCREEN-WRITE
             GO TO 60-IS-EXIT.

           MOVE LAST-SUFFIX-INIT TO SAVE-SUFFIX.
           IF SAVE-SUFFIX-NUM NUMERIC
             IF SAVE-SUFFIX-NUM > 998
               MOVE "Y"        TO REREAD
               MOVE 39029      TO CATREAD-MSG-NUMBER
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO SCREEN-ERR-LINE
               MOVE TRUE-VAL   TO INDS (1) INDS (99)
               MOVE SCREEN-BUFFER TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               GO TO 60-IS-EXIT.

           CALL "TGENSUFF" USING WO-NUM-PLANNED
                                 SAVE-SUFFIX-NUM.

       60-IS-EXIT.    EXIT.

       61-TRANSFORM-PLANNED.
           MOVE SPACES         TO WONUM OF PWO-REC.
           STRING SCREEN-WO-NO-2
                  SCREEN-WO-YR-2
            DELIMITED BY SIZE INTO WONUM OF PWO-REC.

           READ WO-PLANNED     INTO WO-PLANNED-DATA
               INVALID KEY     MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
             MOVE "Y"          TO REREAD
             MOVE 35040        TO CATREAD-MSG-NUMBER
             CALL "CCATREAD" USING CATREAD-PARMS
             MOVE CATREAD-MSG-TEXT TO SCREEN-ERR-LINE
             MOVE TRUE-VAL     TO INDS (4) INDS (99)
             MOVE SCREEN-BUFFER TO DSPLY-REC
             PERFORM 99-SCREEN-WRITE
             GO TO 61-TP-EXIT.

           IF WO-STATUS-P = "CW" OR "DW" OR "FF"
             MOVE "Y"          TO REREAD
             MOVE 35001        TO CATREAD-MSG-NUMBER
             CALL "CCATREAD" USING CATREAD-PARMS
             MOVE CATREAD-MSG-TEXT TO SCREEN-ERR-LINE
             MOVE TRUE-VAL     TO INDS (4) INDS (99)
             MOVE SCREEN-BUFFER TO DSPLY-REC
             PERFORM 99-SCREEN-WRITE
             GO TO 61-TP-EXIT.

           MOVE "N"            TO CUR-LABOR-SW.
           PERFORM 610-CHECK-CUR-LABOR.
           IF CUR-LABOR-SW = "Y"
             MOVE "Y"          TO REREAD
             MOVE 66126        TO CATREAD-MSG-NUMBER
             CALL "CCATREAD" USING CATREAD-PARMS
             MOVE SPACES       TO ERROR-BUFFER
             STRING PERCCNUM " " CATREAD-MSG-TEXT
              DELIMITED BY SIZE INTO SCREEN-ERR-LINE
             MOVE TRUE-VAL     TO INDS (4) INDS (99)
             MOVE SCREEN-BUFFER TO DSPLY-REC
             PERFORM 99-SCREEN-WRITE
             GO TO 61-TP-EXIT.

           MOVE "N"            TO REQ-SW.
           PERFORM 611-CHECK-REQS.
           IF REQ-SW = "Y"
             MOVE "Y"          TO REREAD
             MOVE 49052        TO CATREAD-MSG-NUMBER
             CALL "CCATREAD" USING CATREAD-PARMS
             MOVE CATREAD-MSG-TEXT TO SCREEN-ERR-LINE
             MOVE TRUE-VAL     TO INDS (4) INDS (99)
             MOVE SCREEN-BUFFER TO DSPLY-REC
             PERFORM 99-SCREEN-WRITE
             GO TO 61-TP-EXIT.

           CALL "TTRANSFM" USING WO-PLANNED-DATA.

           IF WO-STATUS-P = "OK"
             MOVE 39021        TO CATREAD-MSG-NUMBER
             CALL "CCATREAD" USING CATREAD-PARMS
             MOVE CATREAD-MSG-TEXT TO SCREEN-CMD-LINE
             MOVE TRUE-VAL     TO INDS (98)
             MOVE SCREEN-BUFFER TO DSPLY-REC
             PERFORM 99-SCREEN-WRITE
             PERFORM 98A-SCREEN-READ
             CALL "CLPAUSE2".

       61-TP-EXIT.    EXIT.

       610-CHECK-CUR-LABOR.
           MOVE WO-NUM-PLANNED TO WONUM OF LCS-REC.
           READ LABOR-CURR-STAT
               INVALID KEY     MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
             MOVE "Y"          TO CUR-LABOR-SW.

       611-CHECK-REQS.
           MOVE WO-NUM-PLANNED TO WONUM OF PRT-REC.
           START WO-PARTS      KEY IS = WONUM OF PRT-REC
               INVALID KEY     MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
             PERFORM 6110-CHECK-REQ-CONT.

       6110-CHECK-REQ-CONT.
           READ WO-PARTS       NEXT RECORD INTO WO-PARTS-DATA
               AT END          MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
             IF PRT-WO-NU = WO-NUM-PLANNED
               IF PRT-REQ-NO = SPACES OR "CANCEL"
                 GO TO 6110-CHECK-REQ-CONT
               ELSE
                 MOVE "Y"      TO REQ-SW.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0"       TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3          TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM   TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0"       TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0"       TO INDICS.

