       IDENTIFICATION DIVISION.
       PROGRAM-ID.           TMNFCLNUP.
       AUTHOR.               CA YODER.
       DATE-WRITTEN.         MAY 2013.
      *INSTALLATION.         GOODYEAR TIRE AND RUBBER CO.

      *D* REMARKS.
      *D*
      *D*   THIS PROGRAM WILL BE USED TO CLEAN UP THE MANUFACTURER/
      *D*   PART NUMBER UPDATE MEMBERS IN R3MNFUP.
      *D*
      *D*   CHANGE FIELD DAYS-TO-KEEP TO THE NUMBER OF DAYS OF
      *D*   FILES TO SAVE.
      *D*
      *C* CHANGES.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.    I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

      ******************************************************************
       INPUT-OUTPUT SECTION.
      ******************************************************************
       FILE-CONTROL.

      ******************************************************************
       DATA DIVISION.
      ******************************************************************

       FILE SECTION.

      ******************************************************************
       WORKING-STORAGE SECTION.
      ******************************************************************

      *-----------------------------------------------------------------
      *  M I S C E L L A N E O U S   F I E L D S
      *-----------------------------------------------------------------

       01  RMVM-SEQ                 PIC X(4).

      *-----------------------------------------------------------------
      *  A R G U M E N T   V A L U E S
      *-----------------------------------------------------------------

      *-----------------------------------------------------------------
      *  F L A G S   A N D   S W I T C H E S
      *-----------------------------------------------------------------

       01  RTN-CODE                 PIC X.

       01  CLEANUP-COMPLETE         PIC X.

      *-----------------------------------------------------------------
      *  I N D E X E S
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
      *  A C C U M U L A T O R S
      *-----------------------------------------------------------------

       01  FILE-COUNTER             PIC 9(3).

       01  MISSING-FILES            PIC 9.

      *-----------------------------------------------------------------
      *  S A V E   F I E L D S
      *-----------------------------------------------------------------

       01  DAYS-TO-KEEP             PIC 9(2) VALUE 14.

      *-----------------------------------------------------------------
      *  T A B L E S
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
      *  D A T A B A S E   A N D   F I L E   B U F F E R S
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
      *  D A T A B A S E   S T A T U S   A R E A
      *-----------------------------------------------------------------

       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X.
           05  FILE-STATUS-2             PIC X.

       COPY DBCSACCT OF COPYLIB.

       COPY DATAB    OF COPYLIB.

      *-----------------------------------------------------------------
      *  U T I L I T Y   A R E A
      *-----------------------------------------------------------------

       COPY TBLOWUP OF COPYLIB.

       COPY VCOMAREA OF COPYLIB.

       COPY TDATECHK   IN COPYLIB.

      *------- DATE CONVERSION FIELDS.
       01  GREGDATE.
           05  GREGDATE-CC      PIC X(2).
           05  GREGDATE-YMD.
               10  GREGDATE-YY  PIC X(2).
               10  FILLER       PIC X(4).
       01  GREGDATE-R   REDEFINES   GREGDATE.
           05  FILLER           PIC X(4).
           05  GREGDATE-MM-R    PIC 9(2).
           05  GREGDATE-DD-R    PIC 9(2).

       01  JULDATE.
           05  JULYEAR          PIC 9(4).
           05  JULDAY           PIC 9(3).

       01  DAYDIGIT             PIC X(1).
       01  LEAPYEAR             PIC X(1).

      ******************************************************************
       PROCEDURE DIVISION.
      ******************************************************************

       00-CONTROL.

           PERFORM 10-HSK.

           PERFORM 60-DELETE-MBRS.

           PERFORM 20-EOJ.

           GOBACK.

       10-HSK.

      *------ GET CURRENT DATE.
           MOVE 1                   TO  DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-YMD-OUT        TO  GREGDATE-YMD.
           IF GREGDATE-YY > "70"
               MOVE "19"            TO  GREGDATE-CC
           ELSE
               MOVE "20"            TO  GREGDATE-CC.
           MOVE SPACES              TO  JULDATE.
           CALL "JULGREG" USING GREGDATE JULDATE DAYDIGIT LEAPYEAR.

      *------ HOW MANY DAYS SHOULD BE KEPT?
           IF JULDAY > DAYS-TO-KEEP
               NEXT SENTENCE
           ELSE
               ADD  365             TO  JULDAY
               SUBTRACT 1         FROM  JULYEAR.
           SUBTRACT DAYS-TO-KEEP  FROM  JULDAY.
           MOVE SPACES              TO  GREGDATE.
           CALL "JULGREG" USING GREGDATE JULDATE DAYDIGIT LEAPYEAR.

           DISPLAY "REMOVE MEMBERS BEFORE " GREGDATE.
           MOVE "N"                 TO  CLEANUP-COMPLETE.

       20-EOJ.

       60-DELETE-MBRS.

           PERFORM UNTIL CLEANUP-COMPLETE = "Y"

              IF JULDAY > 1
                 NEXT SENTENCE
              ELSE
                 ADD  365           TO  JULDAY
                 SUBTRACT 1       FROM  JULYEAR
              END-IF
              SUBTRACT 1          FROM  JULDAY
              MOVE SPACES           TO  GREGDATE
              CALL "JULGREG" USING GREGDATE JULDATE DAYDIGIT LEAPYEAR

      *------- ASSUME THAT IF THERE ARE 3 MISSING DAYS IN A ROW,
      *------- THEN THERE ARE NO MORE FILES TO DELETE.
      *------- HOWEVER, IF THERE ARE 2 OR LESS FILES NOT FOUND BEFORE
      *------- ANOTHER FILE IS FOUND, THEN RESET THE
      *------- COUNTER AND CONTINUE DELETING LOOP.

              INITIALIZE RTN-CODE
              STRING GREGDATE-MM-R GREGDATE-DD-R
                                    DELIMITED BY SIZE
                                    INTO RMVM-SEQ
              CALL "R3MNFRMV" USING RMVM-SEQ  RTN-CODE
              IF RTN-CODE = "1"
                 ADD 1              TO  MISSING-FILES
                 IF MISSING-FILES = 3
                    MOVE "Y"        TO  CLEANUP-COMPLETE
                 END-IF
              ELSE
                 INITIALIZE MISSING-FILES
              END-IF
           END-PERFORM.

      *-----------------------------------------------------------------
      *9999 UTILITY SECTION.
      *-----------------------------------------------------------------

       9999-BLOWUP.
           MOVE "TMNFCLNUP" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
              VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
              BU-DISPLAY-FLDS.

