000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TMODMLST.
      *C   10/28/93.  M. L. MITCHELL    REQUEST PAR DANVILLE , #6437
      *C     CHANGED THE REQ NUMBER LENGTH FROM 6 TO 12 CHARACTERS.
      *C     ALSO MODIFIED DISPLAY BUFFERS TO ACCEPT THE NEW LENGTH.
      *C   08/08/94.  M. L. MITCHELL
      *C     CHANGED ALL REFERENCES TO COPYCSIS AND COPYMMIS TO COPYLIB.
      *C     CHANGED MEMBER NAMES TO NEW NAMES ESTABLISHED BY CAT.
      *C   04/14/1995   CA ZUBEK
      *C     ADDED LOGIC TO CHECK IF THE ITEM NUMBER ENTERED BY THE
      *C     USER IS NUMERIC.
      *C   SEPTEMBER 1996  JE COFFMAN  REQ# 6619
      *C     EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE
      *C
000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000600 SOURCE-COMPUTER.   AS400.
000700 OBJECT-COMPUTER.   AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZMODIFY-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT WO-BASIC-FILE
               ASSIGN TO DATABASE-MCFLMM1001
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WBF-STATUS.
           SELECT WO-LAST-NUM-USED
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ARG-NO
               FILE STATUS IS WLNU-STATUS.
           SELECT WO-PARTS-FILE
               ASSIGN TO DATABASE-MCFLMM1201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS WPFD-STATUS.
           SELECT WO-PLANNED-FILE
               ASSIGN TO DATABASE-MCFLMM1101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WPF-STATUS.
000800 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).
       FD  WO-BASIC-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WBFREC.
       01  WBFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1001.
       FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WLNUREC.
       01  WLNUREC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.
       FD  WO-PARTS-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFDREC.
       01  WPFDREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1201.
       FD  WO-PLANNED-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFREC.
       01  WPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.
000900 WORKING-STORAGE SECTION.
001000 77  CHAIN-CTR                         PIC 9(4).
001100 77  ERR-SW                            PIC 9.
001200 77  ITEM-RESET                        PIC 9(4).
001300 77  ITM-CTR                           PIC S9(4) COMP-4.
001500 77  SAVE-DEPT                         PIC X(4).
001600 77  SAVE-EXPCLASS                     PIC X(8).
001700 77  SUB                               PIC S9(4) COMP-4.
001800 77  SUB1                              PIC S9(4) COMP-4.
001900 77  SUB2                              PIC S9(4) COMP-4.
002000 01  ARG-NO                            PIC 9(9).
       01  BASE-BG                           PIC X(24).
       01  BASE-MMISA                        PIC X(24).
002100 01  BASE-STHIST                       PIC X(24).
       01  BASE-STORES                       PIC X(24).
002200 01  BLOWUP-BASE                       PIC X(16).
       COPY CATREAD IN COPYLIB.
002300 COPY CMANREQ IN COPYLIB.
       COPY CPYIND  IN COPYLIB.
002400 01  COST-WORKAREA.
002500     05  COST-WA                       PIC 9(14)V99.
002600     05  C-WA REDEFINES COST-WA.
002700         10  COST-DOLS                 PIC 9(14).
002800         10  COST-CENTS                PIC 99.
002900     05  UNIT-COST-WA REDEFINES COST-WA.
003000         10  UC-WA-DOLS                PIC 9(12).
003100         10  UC-WA-CENTS.
003200             15  UC-WA-CENTS-1-2       PIC 99.
003300             15  UC-WA-CENTS-3-4       PIC 99.
003400         10  UC-WA-C-94 REDEFINES UC-WA-CENTS    PIC 9(4).
003500 COPY CSWITCHF  IN COPYLIB.
       01  CUR-DATE-CHECK-CN.
           05  CUR-DATE-CHECK-CC             PIC 99.
003600     05  CUR-DATE-CHECK.
003700         10  CUR-DATE-CHECK-YY         PIC 99.
003800         10  CUR-DATE-CHECK-MD         PIC 99.
003900         10  CUR-DATE-CHECK-DM         PIC 99.
004000 01  CUR-DATE-WA.
004100     05  CUR-DATE-MD                   PIC 99.
004200     05  FILLER                        PIC X.
004300     05  CUR-DATE-DM                   PIC 99.
004400     05  FILLER                        PIC X.
004500     05  CUR-DATE-YY                   PIC 99.
004600 COPY TDATESUB OF COPYLIB.
       01  EDIT-ERROR                        PIC X(80).
004700 01  ERROR-BUFFER.
004800     05  ERROR-MSG-1.
004900         10  E-LIT                     PIC X(70).
005000         10  E-ERROR                   PIC 9(4).
005100         10  E-DELAY                   PIC X(6).
           05  ERROR-MSG-2 REDEFINES ERROR-MSG-1.
               10  FILLER                    PIC X(37).
               10  NO-PARTS-WO               PIC X(10).
               10  FILLER                    PIC X(33).
005200 01  ERROR-SWITCH                      PIC S9(4) COMP-4.
005300 COPY ESCNAM2 IN COPYLIB.
       01  FILE-STATUSES.
           05  DSPLY-STATUS                  PIC XX.
           05  WBF-STATUS                    PIC XX.
           05  WLNU-STATUS                   PIC XX.
           05  WPFD-STATUS                   PIC XX.
           05  WPF-STATUS                    PIC XX.
       COPY IOFEEDBACK IN COPYLIB.
005500 01  ITEM-REQ-BUFFER.
005600     05  ITEM-BUFF-9                   PIC 9(4).
005700     05  REQ-BUFF                      PIC X(12).
           05  ITEM-CMD-LINE                 PIC X(79).
           05  ITEM-ERR-LINE                 PIC X(79).
005800 01  ITEM-WA.
005900     05  IT-BYTES.
006000         10  ITB OCCURS 4              PIC X.
006100     05  IT-BYTES-9 REDEFINES IT-BYTES PIC 9(4).
       COPY LANGSUB OF COPYLIB.
006200 01  LAST-WO-BUFF.       COPY MLASTWO OF COPYLIB.
006300 01  MATL-WORKAREA.
006400     05  MATL-HEADER-INFO.
006500         10  WO-NUM-WA                 PIC X(10).
006600         10  DESCRIPTION-WA            PIC X(30).
006700         10  A-C-WA                    PIC X.
006800         10  WO-STATUS-WA              PIC XX.
006900         10  EQPNUM-WA                 PIC X(6).
007000         10  ZONE-WA                   PIC X(4).
007100         10  DATE-SCHD-WA              PIC X(8).
007200         10  TIME-SCHD-WA.
007300             15  TIME-SCHD-HH-WA       PIC XX.
007400             15  TIME-COLON-WA         PIC X.
007500             15  TIME-SCHD-MM-WA       PIC XX.
007600     05  ITEM-NO-WA                    PIC XXXX.
007700     05  MATL-DATA.
007800         10  PRT-STATUS-WA.
007900             15  PRT-STATUS-1-WA       PIC X.
008000             15  PRT-STATUS-2-WA       PIC X.
008100         10  PRT-QUANT-WA              PIC X(5).
008200         10  PRT-QUANT-WA-9 REDEFINES PRT-QUANT-WA  PIC 9(5).
008300         10  PRT-CODE-WA               PIC X(7).
008400         10  PRT-UNIT-MEAS-WA                 PIC XX.
008500         10  PRT-UP-WA.
008600             15  PRT-UP-DOLS-WA        PIC X(12).
008700             15  PRT-UP-DOLS-WA-9 REDEFINES PRT-UP-DOLS-WA
008800                                       PIC 9(12).
008900             15  PRT-UP-CENTS-WA       PIC XX.
009000         10  PRT-UP-WA-9 REDEFINES PRT-UP-WA  PIC 9(12)V99.
009100         10  PRIME-WA                  PIC XXX.
009200         10  SUB-WA                    PIC XXX.
009300         10  ADDL-DATA-WA              PIC X(8).
009400         10  STAGE-WA                  PIC X(4).
009500         10  ORIG-WA                   PIC X(4).
009600         10  DATE-REQD-WA.
009700             15  DATE-REQD-MD-WA       PIC XX.
009800             15  DATE-REQD-DM-WA       PIC XX.
009900             15  DATE-REQD-YY-WA       PIC XX.
010000         10  ADDL-INFO-WA              PIC X(14).
010100         10  SUGG-VENDOR-WA            PIC X(30).
010200         10  REQ-NO-WA                 PIC X(12).
010300         10  PRT-DESC-WA.
010400             15  P-D-WA OCCURS 395 TIMES  PIC X.
010500         10  PRT-DESC-WA-80 REDEFINES PRT-DESC-WA.
010600             15  P-D-WA-80 OCCURS 5    PIC X(79).
010700         10  REMARKS-WA.
010800             15  REMARKS-1-WA          PIC X(79).
010900             15  REMARKS-2-WA          PIC X(79).
011000         10  MESSAGE-WA                PIC X(48).
           05  MATL-CMD-LINE                 PIC X(79).
           05  MATL-ERR-LINE                 PIC X(79).
011100 01  MPLTINFO-COMP                     PIC X(4).
011200 COPY MSTORERM IN COPYLIB.
011900 01  PASS-SPOOL-PRT-NO            PIC S99 COMP-4.
012100 01  PASSWORD-INFORMATION.
012200     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TMODMLST".
012300     05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
012400     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
012500     05  PROGRAM-DESCRIPTION.
012600         10  PROG-DESC-A.
                   15  FILLER      PIC X(17) VALUE "MATERIALS PROGRAM".
                   15  FILLER      PIC X(13) VALUE " FOR LISTING ".
                   15  FILLER      PIC X(15) VALUE "PARTS THAT ARE ".
                   15  FILLER      PIC X(15) VALUE "ESTIMATED/USED ".
012800         10  PROG-DESC-B.
                   15  FILLER      PIC X(15) VALUE "AGAINST A WORK ".
                   15  FILLER      PIC X(6)  VALUE "ORDER ".
                   15  FILLER      PIC X(39) VALUE SPACES.
013000         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
013200     05  PASSWORD-FLAG       PIC X.
013300 01  PRT-LINE-DATA.
013400     05  P-HEADER-INFO.
013500         10  P-WO                      PIC X(10).
013600         10  P-WO-DESC                 PIC X(30).
013700         10  P-A-C                     PIC X.
013800         10  P-STAT                    PIC XX.
013900         10  P-EQUIP                   PIC X(6).
014000         10  P-ZONE                    PIC X(4).
014100         10  P-SCHED-M                 PIC X(8).
014200         10  P-SCHED-T                 PIC X(5).
014300     05  P-EXPCLASS                    PIC X(8).
014400     05  PLD OCCURS 3 TIMES.
014500         10  PLD-1.
014600             15  P-ITM                 PIC 9999.
014700             15  FILLER                PIC X.
014800             15  P-STATUS              PIC XX.
014900             15  FILLER                PIC X.
015000             15  P-QTY                 PIC Z(5).
015100             15  P-QTY-FLAG            PIC X.
015200             15  FILLER                PIC X.
015300             15  P-NUM                 PIC X(7).
015400             15  FILLER                PIC X.
015500             15  P-UM                  PIC XX.
015600             15  FILLER                PIC X.
015700             15  P-STAGE               PIC XXXX.
015800             15  FILLER                PIC X.
015900             15  P-ORIG                PIC X(4).
016000             15  FILLER                PIC X.
016100             15  P-DATEREQD.
016200                 20  P-MM              PIC XX.
016300                 20  P-SLASH1          PIC X.
016400                 20  P-DD              PIC XX.
016500                 20  P-SLASH2          PIC X.
016600                 20  P-YR              PIC XX.
016700             15  FILLER                PIC XX.
016800             15  P-UNIT-DOL            PIC Z(12).
016900             15  P-UNIT-DEC            PIC X.
017000             15  P-UNIT-CTS            PIC 99.
017100             15  FILLER                PIC XX.
017200             15  P-TOTAL-DOL           PIC Z(12).
017300             15  P-TOTAL-DEC           PIC X.
017400             15  P-TOTAL-CTS           PIC 99.
017500             15  FILLER                PIC X.
017600         10  PLD-2.
017700             15  P-DESC                PIC X(79).
017800         10  PLD-3.
017900             15  P-REQ-PO-LIT          PIC X(13).
018000             15  P-REQ-PO-NO-RSLP.
018100                 20  P-REQ             PIC X(12).
018200                 20  P-REQ-PLUS-PO     PIC X(4).
018300                 20  P-RCVR.
018400                     25  P-REQ-PO-DASH PIC X.
018500                     25  P-REQ-PO-RSLP PIC XXX.
018600             15  P-PM-DATA.
018700                 20  P-PM-LEVEL-LIT    PIC X(9).
018800                 20  P-PM-LEVEL        PIC XX.
018900                 20  FILLER            PIC XX.
019000                 20  P-PM-FLAG-LIT     PIC X(8).
019100                 20  P-PM-FLAG         PIC XX.
019200                 20  FILLER            PIC XX.
019300                 20  P-PM-SUBS-LIT     PIC X(10).
019400                 20  P-PM-SS           PIC XXXX.
019500             15  FILLER                PIC X(7).
019600     05  P-ITEM-INPUT                  PIC X(4).
019700     05  P-REQ-INPUT                   PIC X(12).
           05  P-CMD-LINE                    PIC X(79).
           05  P-MSG-LINE                    PIC X(79).
019800 COPY REQGLOB IN COPYLIB.
019900 COPY SMREQINQ OF COPYLIB.
020400 01  REQI-RET-CODE                     PIC S9(4) COMP-4.
       01  SAVE-VIEW-COMAREA                PIC X(120).
020900 COPY DBSTAT  IN COPYLIB.
021300 COPY TBLOWUP IN COPYLIB.
       01  TRUE-VAL                          PIC 1 VALUE B"1".
021400 01  WO-BASIC-DATA.      COPY DWOBASIC OF COPYLIB.
021500 01  WO-PLANNED-DATA.    COPY DWOPLAN OF COPYLIB.
021600 01  WO-PARTS-DATA.      COPY DWOPARTS OF COPYLIB.
       COPY WSCONTROL IN COPYLIB.
021700 LINKAGE SECTION.
022400 01  DBPARAMETERS.       COPY DBPARMS OF COPYLIB.
022700 01  WORK-ORDER-NO                     PIC X(10).
022500 COPY VCOMLINK OF COPYLIB.
023500 PROCEDURE DIVISION USING DBPARAMETERS WORK-ORDER-NO
023600                      VIEW-COMAREA.
023800 START-EXECUTING.
023900     PERFORM 1-HSK.
024000     PERFORM 6-MAIN THRU 6-MAIN-EXIT.
024100 2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE WO-BASIC-FILE.
           CLOSE WO-LAST-NUM-USED.
           CLOSE WO-PARTS-FILE.
           CLOSE WO-PLANNED-FILE.
024200     GOBACK.
024300 1-HSK.
           OPEN I-O   DISPLAY-FILE.
           OPEN INPUT WO-BASIC-FILE.
           OPEN INPUT WO-LAST-NUM-USED.
           OPEN INPUT WO-PARTS-FILE.
           OPEN INPUT WO-PLANNED-FILE.
024400     CALL "TPWORD" USING PASSWORD-INFORMATION.
024800     IF PASSWORD-FLAG = "N"
024900         MOVE "  PWORD" TO BLOWUP-BASE
025000         MOVE "FAILED PASSWORD CHECK - TMODMLST"
025100             TO BU-DISPLAY-MSG
025200         PERFORM 998-BLOWUP.
025300     MOVE SPACES TO WO-BASIC-DATA.
025400     MOVE SPACES TO WO-PLANNED-DATA.
025500     MOVE SPACES TO WO-PARTS-DATA.
           MOVE SPACES TO BASE-BG BASE-MMISA BASE-STORES.
025700     MOVE 1 TO ARG-NO
           READ WO-LAST-NUM-USED INTO LAST-WO-BUFF
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLNU-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 MOVE 1 TO DATE-FLAG-SW.
           MOVE DATE-FLAG-SW TO DATE-FLAG.
026000     MOVE 1 TO DATE-MODE.
026100     MOVE DATE-FLAG TO DATE-CODE.
026200     CALL "TDATECHK" USING DATE-CHECK-AREA.
026300     MOVE DATE-SLASH-OUT TO CUR-DATE-WA.
026400     IF DATE-FLAG = 3
026500         MOVE CUR-DATE-MD TO CUR-DATE-CHECK-DM
026600         MOVE CUR-DATE-DM TO CUR-DATE-CHECK-MD
026700     ELSE
026800     MOVE CUR-DATE-MD TO CUR-DATE-CHECK-MD
026900     MOVE CUR-DATE-DM TO CUR-DATE-CHECK-DM.
027000     MOVE CUR-DATE-YY TO CUR-DATE-CHECK-YY.
           IF CUR-DATE-CHECK-YY > "70"
               MOVE "19" TO CUR-DATE-CHECK-CC
           ELSE
           MOVE "20" TO CUR-DATE-CHECK-CC.
027100     CALL "TESCSEQ" USING ESC-NAME.
027200 6-MAIN.
027300     PERFORM 60-GET-WO-DATA THRU 60-GWD-EXIT.
027400     MOVE SPACES TO MATL-WORKAREA.
027500     IF WO-NUM = SPACES
027600         MOVE WO-NUM-PLANNED TO WO-NUM-WA
027700         MOVE DESCRIPTION-1-P TO DESCRIPTION-WA
027800         MOVE APPROVAL-CODE-P TO A-C-WA
027900         MOVE WO-STATUS-P TO WO-STATUS-WA
028000         MOVE EQUIP-NUM-P TO EQPNUM-WA
028100         MOVE ZONE-P TO ZONE-WA
028200         MOVE DEPT-P TO SAVE-DEPT
028300         MOVE EXP-CLASS-P TO ADDL-DATA-WA SAVE-EXPCLASS
028400         MOVE ENG-PL-SCHD-ID TO ORIG-WA
028500         IF DATE-SCHD = "      "
028600             NEXT SENTENCE
028700         ELSE
028800         MOVE 4 TO DATE-MODE
028900         MOVE DATE-SCHD TO DATE-VALIDATE-IN
029000         CALL "TDATECHK" USING DATE-CHECK-AREA
029100         MOVE DATE-SLASH-OUT TO DATE-SCHD-WA
029200         MOVE TIME-SCHD-P-HH TO TIME-SCHD-HH-WA
029300         MOVE ":" TO TIME-COLON-WA
029400         MOVE TIME-SCHD-P-MM TO TIME-SCHD-MM-WA
029500     ELSE
029600     MOVE WO-NUM TO WO-NUM-WA
029700     MOVE APPROVAL-CODE TO A-C-WA
029800     MOVE DESCRIPTION-1 TO DESCRIPTION-WA
029900     MOVE WO-STATUS TO WO-STATUS-WA
030000     MOVE EQUIP-NUM TO EQPNUM-WA
030100     MOVE DEPT TO SAVE-DEPT
030200     MOVE EXP-CLASS TO ADDL-DATA-WA SAVE-EXPCLASS
030300     MOVE ENG-PL-SCHD-ID TO ORIG-WA
030400     MOVE ZONE OF WO-BASIC-DATA TO ZONE-WA.
030500     MOVE 0 TO SUB ITM-CTR ITEM-RESET.
030600     PERFORM 61-LIST-ITEMS THRU 61-LI-EXIT.
030700 6-MAIN-EXIT.    EXIT.
030800
030900 60-GET-WO-DATA.
031000     MOVE 0 TO COND-WORD.
031100     MOVE WORK-ORDER-NO TO WONUM OF WBFREC.
031200     START WO-BASIC-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
031300         INVALID KEY    MOVE 17 TO COND-WORD.
031400     IF WBF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 GO TO 60-CHECK-WO-PLANNED.
031500     READ WO-BASIC-FILE NEXT INTO WO-BASIC-DATA
031600         AT END     MOVE 15 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
031700     IF COND-WORD = 15 GO TO 60-CHECK-WO-PLANNED.
031800     GO TO 60-GWD-EXIT.
031900 60-CHECK-WO-PLANNED.
032100     MOVE 0 TO COND-WORD.
           MOVE WORK-ORDER-NO TO WONUM OF WPFREC.
032200     START WO-PLANNED-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
032300         INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
032400     IF COND-WORD = 17 GO TO 60-GWD-EXIT.
032500     READ WO-PLANNED-FILE NEXT INTO WO-PLANNED-DATA
032600         AT END    MOVE 15 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
032700 60-GWD-EXIT.    EXIT.
032800
032900 61-LIST-ITEMS.
033000     MOVE 0 TO SUB ITM-CTR.
033100     MOVE SPACES TO PRT-LINE-DATA.
033200     MOVE 0 TO COND-WORD.
033300     MOVE WORK-ORDER-NO TO WONUM OF WPFDREC.
033500     START WO-PARTS-FILE KEY IS > EXTERNALLY-DESCRIBED-KEY
033600         INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPFD-STATUS NOT = "00"
               IF WPFD-STATUS = "23"
                   NEXT SENTENCE
               ELSE
               MOVE 17 TO COND-WORD.
033700     IF COND-WORD = 17
               MOVE 66080 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
033900         MOVE WORK-ORDER-NO TO NO-PARTS-WO
               MOVE 0 TO VIEW-LASTKEY
               MOVE ERROR-BUFFER TO DBPARM-PAD
034400         GO TO 61-LI-EXIT.
034500 61-LI-LOOP.
           MOVE 0 TO COND-WORD.
034600     READ WO-PARTS-FILE PRIOR INTO WO-PARTS-DATA
034700         AT END    MOVE 14 TO COND-WORD.
           IF WPFD-STATUS NOT = "00" MOVE 14 TO COND-WORD.
           IF WORK-ORDER-NO NOT = WONUM OF WPFDREC
               MOVE 14 TO COND-WORD.
033700     IF COND-WORD = 14
               IF ITM-CTR = 0
                   IF SUB = 0
                       MOVE 66080 TO CATREAD-MSG-NUMBER
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
033900                 MOVE WORK-ORDER-NO TO NO-PARTS-WO
                       MOVE 0 TO VIEW-LASTKEY
                       MOVE ERROR-BUFFER TO DBPARM-PAD
034400                 GO TO 61-LI-EXIT.
034800     IF COND-WORD = 0 GO TO 61-LI-LOOP-PRT.
034900     IF ITM-CTR > 0 GO TO 61-LI-LOOP-CONT.
035000     IF SUB = 0
               IF VIEW-LASTKEY = 6 OR 7
                   GO TO 61-LI-EXIT
               ELSE
               MOVE 66080 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE WORK-ORDER-NO TO NO-PARTS-WO
               MOVE ERROR-BUFFER TO PLD-2 (2)
               MOVE 66085 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO P-CMD-LINE
               PERFORM 61-PROCESS-SCREEN THRU 61-PS-EXIT
               IF VIEW-LASTKEY = 1 OR 3
                   GO TO 2-EOJ
               ELSE
035900         GO TO 61-LI-EXIT.
036600     MOVE 31062 TO CATREAD-MSG-NUMBER.
036800     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO PLD-2 (3).
           MOVE 66094 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO P-CMD-LINE.
           PERFORM 61-PROCESS-SCREEN THRU 61-PS-EXIT.
042600     IF VIEW-LASTKEY = 1 OR 3
043400         GO TO 2-EOJ.
           IF VIEW-LASTKEY = 6
               MOVE 35126 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO EDIT-ERROR
               MOVE TRUE-VAL TO INDS (99)
               PERFORM 61-PROCESS-SCREEN THRU 61-PS-EXIT
               GO TO 61-LI-LOOP.
043900     IF P-ITEM-INPUT = SPACES
044000         IF P-REQ-INPUT = SPACES
044500             MOVE 0 TO ITEM-RESET
044700             GO TO 61-LI-EXIT
044800         ELSE
044900         MOVE 0 TO ITM-CTR CHAIN-CTR
045000         MOVE 9999 TO ITEM-BUFF-9
045100         MOVE P-REQ-INPUT TO REQ-BUFF
045200         PERFORM 611-RETRIEVE-NEXT-ITEM THRU
045300             611-RNI-EXIT
045400         IF ERR-SW = 1
045500             PERFORM 617-REQI-3-ERROR
                   MOVE SPACES TO P-ITEM-INPUT P-REQ-INPUT
049000             MOVE 6 TO VIEW-LASTKEY
049100             MOVE ITM-CTR TO ITEM-RESET
049200             MOVE 0 TO CHAIN-CTR
045600         ELSE
045700         DIVIDE CHAIN-CTR BY 3 GIVING ITM-CTR
045800         MULTIPLY 3 BY ITM-CTR
045900         MOVE SPACES TO REQI-DATA
046000         PERFORM 612-SELECT-REQ-SEARCH-ITEM
046100         MOVE ZEROES TO REQI-RET-CODE
046200         MOVE 0 TO PASS-SPOOL-PRT-NO
046300         MOVE PLANT-IDENT TO MPLTINFO-COMP
               PERFORM 61-CALL-SMREQINQ
               MOVE SPACES TO P-ITEM-INPUT P-REQ-INPUT
049000         MOVE 6 TO VIEW-LASTKEY
049100         MOVE ITM-CTR TO ITEM-RESET
049200         MOVE 0 TO CHAIN-CTR
049300         IF REQI-RET-CODE = 1
049400             PERFORM 615-REQI-1-ERROR
049500             GO TO 61-LIST-ITEMS
049600         ELSE
049700         IF REQI-RET-CODE = 2
049800             PERFORM 616-REQI-2-ERROR
049900             GO TO 61-LIST-ITEMS
050000         ELSE
050100         IF REQI-RET-CODE = 3
050200             PERFORM 617-REQI-3-ERROR
050300             GO TO 61-LIST-ITEMS
050400         ELSE
051600         GO TO 61-LIST-ITEMS
051700     ELSE
051800     MOVE 0 TO ITM-CTR
051900*    MOVE P-ITEM-INPUT TO ITEM-WA
           PERFORM P-ITEM-INPUT-CHECK
052000     PERFORM 619-RIGHT-ADJUST-ITEMNO THRU 619-RAI-EXIT
      *--- CHECK TO SEE IF ITEM NUMBER IS NUMERIC.
           IF IT-BYTES-9 NOT NUMERIC
               PERFORM 620-ITEM-NUM-ERROR
               GO TO 61-LIST-ITEMS
           ELSE
052100         MOVE IT-BYTES-9 TO ITEM-BUFF-9
           END-IF
052200     MOVE 0 TO CHAIN-CTR
052300     PERFORM 611-RETRIEVE-NEXT-ITEM THRU 611-RNI-EXIT
           IF ERR-SW = 1
               PERFORM 617-REQI-3-ERROR
               MOVE SPACES TO P-ITEM-INPUT P-REQ-INPUT
049000         MOVE 6 TO VIEW-LASTKEY
049100         MOVE ITM-CTR TO ITEM-RESET
049200         MOVE 0 TO CHAIN-CTR
           ELSE
052400     IF PRT-STATUS-1 NOT = "M"
052500         PERFORM 614-REQNO-ERROR
               MOVE SPACES TO P-ITEM-INPUT P-REQ-INPUT
049000         MOVE 6 TO VIEW-LASTKEY
049100         MOVE ITM-CTR TO ITEM-RESET
049200         MOVE 0 TO CHAIN-CTR
052700     ELSE
052800     IF PRT-REQ-NO = "      "
052900         PERFORM 614-REQNO-ERROR
               MOVE SPACES TO P-ITEM-INPUT P-REQ-INPUT
049000         MOVE 6 TO VIEW-LASTKEY
049100         MOVE ITM-CTR TO ITEM-RESET
049200         MOVE 0 TO CHAIN-CTR
053100     ELSE
053200     DIVIDE CHAIN-CTR BY 3 GIVING ITM-CTR
053300     MULTIPLY 3 BY ITM-CTR
053400     MOVE SPACES TO REQI-DATA
053500     PERFORM 612-SELECT-REQ-SEARCH-ITEM
053600     MOVE ZEROES TO REQI-RET-CODE
053700     MOVE 0 TO PASS-SPOOL-PRT-NO
053800     MOVE PLANT-IDENT TO MPLTINFO-COMP
           PERFORM 61-CALL-SMREQINQ
           MOVE SPACES TO P-ITEM-INPUT P-REQ-INPUT
056300     MOVE 6 TO VIEW-LASTKEY
056400     MOVE ITM-CTR TO ITEM-RESET
056500     MOVE 0 TO CHAIN-CTR
056600     IF REQI-RET-CODE = 1
056700         PERFORM 615-REQI-1-ERROR
056800         GO TO 61-LIST-ITEMS
056900     ELSE
057000     IF REQI-RET-CODE = 2
057100         PERFORM 616-REQI-2-ERROR
057200         GO TO 61-LIST-ITEMS
057300     ELSE
057400     IF REQI-RET-CODE = 3
057500         PERFORM 617-REQI-3-ERROR
057600         GO TO 61-LIST-ITEMS
057700     ELSE
058900     GO TO 61-LIST-ITEMS.
       61-LI-LOOP-CONT.
059600     MOVE 31062 TO CATREAD-MSG-NUMBER.
059800     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO PLD-2 (3).
           MOVE 66094 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO P-CMD-LINE.
           PERFORM 61-PROCESS-SCREEN THRU 61-PS-EXIT.
065600     IF VIEW-LASTKEY = 1 OR 3
066400         GO TO 2-EOJ.
060300     IF VIEW-LASTKEY = 7
060400         MOVE SPACES TO PRT-LINE-DATA
               IF ITM-CTR < 3
                   MOVE 35126 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE ERROR-BUFFER TO EDIT-ERROR
                   MOVE 0 TO SUB
                   GO TO 61-LI-LOOP
               ELSE
060900         IF ITM-CTR > 6
061000             IF SUB = 1
061100                 PERFORM 618-READ-BACK 5 TIMES
061200                 SUBTRACT 3 FROM ITM-CTR
                       MOVE 0 TO SUB
061400                 GO TO 61-LI-LOOP
061500             ELSE
061600             IF SUB = 2
061700                 PERFORM 618-READ-BACK 6 TIMES
061800                 SUBTRACT 3 FROM ITM-CTR
                       MOVE 0 TO SUB
062000                 GO TO 61-LI-LOOP
062100             ELSE
062200             PERFORM 618-READ-BACK 7 TIMES
062300             SUBTRACT 6 FROM ITM-CTR
                   MOVE 0 TO SUB
062500             GO TO 61-LI-LOOP
062600         ELSE
062700         GO TO 61-LIST-ITEMS.
066900     IF P-ITEM-INPUT = SPACES
067000         IF P-REQ-INPUT = SPACES
067700             MOVE 0 TO SUB
067800             MOVE 0 TO ITEM-RESET
067900             GO TO 61-LI-EXIT
068000         ELSE
068200*        SUBTRACT 3 FROM ITM-CTR
068300         MOVE 9999 TO ITEM-BUFF-9
068400         MOVE P-REQ-INPUT TO REQ-BUFF
               MOVE 0 TO CHAIN-CTR
068500         PERFORM 611-RETRIEVE-NEXT-ITEM THRU
068600             611-RNI-EXIT
068700         IF ERR-SW = 1
068800             PERFORM 617-REQI-3-ERROR
                   MOVE SPACES TO P-ITEM-INPUT P-REQ-INPUT
049000             MOVE 6 TO VIEW-LASTKEY
049100             MOVE ITM-CTR TO ITEM-RESET
049200             MOVE 0 TO CHAIN-CTR
068900         ELSE
069000         MOVE SPACES TO REQI-DATA
069100         DIVIDE CHAIN-CTR BY 3 GIVING ITM-CTR
069200         MULTIPLY 3 BY ITM-CTR
069300         PERFORM 612-SELECT-REQ-SEARCH-ITEM
069400         MOVE ZEROES TO REQI-RET-CODE
069500         MOVE 0 TO PASS-SPOOL-PRT-NO
069600         MOVE PLANT-IDENT TO MPLTINFO-COMP
072100         MOVE 6 TO VIEW-LASTKEY
072200         MOVE ITM-CTR TO ITEM-RESET
072300         MOVE 0 TO CHAIN-CTR
072400         IF REQI-RET-CODE = 1
072500             PERFORM 615-REQI-1-ERROR
072600             GO TO 61-LIST-ITEMS
072700         ELSE
072800         IF REQI-RET-CODE = 2
072900             PERFORM 616-REQI-2-ERROR
073000             GO TO 61-LIST-ITEMS
073100         ELSE
073200         IF REQI-RET-CODE = 3
073300             PERFORM 617-REQI-3-ERROR
073400             GO TO 61-LIST-ITEMS
073500         ELSE
074300         MOVE 0 TO SUB
074700         GO TO 61-LIST-ITEMS
074800     ELSE
074900*    SUBTRACT 3 FROM ITM-CTR
075000*    MOVE P-ITEM-INPUT TO ITEM-WA
           PERFORM P-ITEM-INPUT-CHECK
075100     PERFORM 619-RIGHT-ADJUST-ITEMNO THRU 619-RAI-EXIT
      *--- CHECK TO SEE IF ITEM NUMBER IS NUMERIC.
           IF IT-BYTES-9 NOT NUMERIC
               PERFORM 620-ITEM-NUM-ERROR
               GO TO 61-LIST-ITEMS
           ELSE
075200         MOVE IT-BYTES-9 TO ITEM-BUFF-9
           END-IF
           MOVE 0 TO CHAIN-CTR
075400     PERFORM 611-RETRIEVE-NEXT-ITEM THRU 611-RNI-EXIT
           IF ERR-SW = 1
               PERFORM 617-REQI-3-ERROR
               MOVE SPACES TO P-ITEM-INPUT P-REQ-INPUT
049000         MOVE 6 TO VIEW-LASTKEY
049100         MOVE ITM-CTR TO ITEM-RESET
049200         MOVE 0 TO CHAIN-CTR
           ELSE
075500     IF PRT-STATUS-1 NOT = "M"
075600         PERFORM 614-REQNO-ERROR
               MOVE SPACES TO P-ITEM-INPUT P-REQ-INPUT
049000         MOVE 6 TO VIEW-LASTKEY
049100         MOVE ITM-CTR TO ITEM-RESET
049200         MOVE 0 TO CHAIN-CTR
075800     ELSE
075900     IF PRT-REQ-NO = "      "
076000         PERFORM 614-REQNO-ERROR
               MOVE SPACES TO P-ITEM-INPUT P-REQ-INPUT
049000         MOVE 6 TO VIEW-LASTKEY
049100         MOVE ITM-CTR TO ITEM-RESET
049200         MOVE 0 TO CHAIN-CTR
076200     ELSE
076300     MOVE SPACES TO REQI-DATA
076400     DIVIDE CHAIN-CTR BY 3 GIVING ITM-CTR
076500     MULTIPLY 3 BY ITM-CTR
076600     PERFORM 612-SELECT-REQ-SEARCH-ITEM
076700     MOVE ZEROES TO REQI-RET-CODE
076800     MOVE 0 TO PASS-SPOOL-PRT-NO
076900     MOVE PLANT-IDENT TO MPLTINFO-COMP
           PERFORM 61-CALL-SMREQINQ
           MOVE SPACES TO P-ITEM-INPUT P-REQ-INPUT
079400     MOVE 6 TO VIEW-LASTKEY
079500     MOVE ITM-CTR TO ITEM-RESET
079600     MOVE 0 TO CHAIN-CTR
079700     IF REQI-RET-CODE = 1
079800         PERFORM 615-REQI-1-ERROR
079900         GO TO 61-LIST-ITEMS
080000     ELSE
080100     IF REQI-RET-CODE = 2
080200         PERFORM 616-REQI-2-ERROR
080300         GO TO 61-LIST-ITEMS
080400     ELSE
080500     IF REQI-RET-CODE = 3
080600         PERFORM 617-REQI-3-ERROR
080700         GO TO 61-LIST-ITEMS
080800     ELSE
081600     MOVE 0 TO SUB
082000     GO TO 61-LIST-ITEMS.
       61-LI-LOOP-PRT.
083000*    IF PRT-DELETE-FLAG = "D" GO TO 61-LI-LOOP.
           IF PRT-DELETE-FLAG = "D"
               IF ITEM-RESET > 0
                   GO TO 61-LI-LOOP
               ELSE
               ADD 1 TO CHAIN-CTR
               GO TO 61-LI-LOOP.
083100     IF ITEM-RESET > 0
083200         ADD 1 TO CHAIN-CTR
083300         IF CHAIN-CTR > ITEM-RESET
083400             MOVE ITEM-RESET TO ITM-CTR
083500             MOVE 0 TO ITEM-RESET CHAIN-CTR
083600         ELSE
083700         GO TO 61-LI-LOOP.
083800     ADD 1 TO SUB.
084900     ADD SUB ITM-CTR GIVING P-ITM (SUB).
085000     MOVE PRT-STATUS TO P-STATUS (SUB).
085100     IF PRT-EST-QTY = SPACES
085200         IF PRT-ACT-QTY = SPACES
085300             MOVE 0 TO P-QTY (SUB)
085400         ELSE
085500         MOVE PRT-ACT-QTY-9 TO P-QTY (SUB)
085600     ELSE
085700     MOVE PRT-EST-QTY-9 TO P-QTY (SUB).
085800*    IF PRT-EST-QTY-FLAG = " "
085900*        NEXT SENTENCE
086000*    ELSE
086100     MOVE PRT-EST-QTY-FLAG TO P-QTY-FLAG (SUB).
086200     MOVE PRT-NUM-7 TO P-NUM (SUB).
086300     MOVE PRT-UNIT-MEAS TO P-UM (SUB).
086400     MOVE PRT-STAGE TO P-STAGE (SUB).
086500     MOVE PRT-ORIGINATOR TO P-ORIG (SUB).
086600     IF PRT-DATE-USED = "      "
086700         NEXT SENTENCE
086800     ELSE
086900     MOVE 4                TO DATE-MODE
087000     MOVE PRT-DATE-USED    TO  DATE-VALIDATE-IN
087100     CALL "TDATECHK" USING DATE-CHECK-AREA
087200     MOVE DATE-SLASH-OUT   TO  P-DATEREQD (SUB).
087300     MOVE SPACES TO P-REQ-PO-LIT (SUB).
087400     IF PRT-DELETE-FLAG = "D"
087500         MOVE SPACES TO PRT-DESC PRT-DESC-2 PRT-DESC-3
087600             PRT-DESC-4 PRT-DESC-5
087700         MOVE PRT-REMARKS-2 TO PRT-DESC
087800         MOVE SPACES TO PRT-REMARKS PRT-REMARKS-2
087900     ELSE
088000     IF PRT-REQ-NO = "      " OR "CANCEL"
088100         NEXT SENTENCE
088200     ELSE
088300     MOVE PRT-REQ-NO TO P-REQ (SUB)
088400     MOVE "CSIS REQ/PO: " TO P-REQ-PO-LIT (SUB)
088500     MOVE "IN" TO CMR-CALL-MODE
088600     MOVE SPACES TO CMR-DATA CMR-RETURNED-DATA CMR-DESC
088700         CMR-REMARKS CMR-MISC-PARMS BU-DISPLAY-MSG
088800     MOVE PRT-WO-NU TO CMR-WO-NUMBER
088900     MOVE PRT-REQ-NO TO CMR-REQ-NUMBER
089000     CALL "CMANINQ" USING BASE-STORES
089100                          CMR-CALL-MODE
089200                          CMR-DATA
089300                          CMR-DESC
089400                          CMR-REMARKS
089500                          CMR-RETURNED-DATA
089600                          CMR-MISC-PARMS
089700                          LANGUAGE-PARMS
089800                          ESC-NAME
089900                          STATUS-AREA
090000                          BU-DISPLAY-MSG
090100     IF CMR-RETURN-STATUS = "OK"
090200         MOVE CMR-CORP-CODE        TO  PRT-NUM
090300         MOVE CMR-DATE-REQUIRED-CN TO  PRT-DATE-USED-CN
090400         MOVE 4                    TO  DATE-MODE
090500         MOVE PRT-DATE-USED        TO  DATE-VALIDATE-IN
090600         CALL "TDATECHK" USING DATE-CHECK-AREA
090700         MOVE DATE-SLASH-OUT       TO  P-DATEREQD (SUB)
090800         MOVE CMR-QTY              TO  PRT-EST-QTY-9
090900                                       PRT-ACT-QTY-9
091000         MOVE CMR-UM               TO  PRT-UNIT-MEAS
      ********************************************************
      *    ASTERISKED OUT THE NEXT STATEMENT AT JIM THOMAS'  *
      *    REQUEST DUE TO A PROBLEM THAT DANVILLE REPORTED   *
      *    WITH DISCREPANCIES IN THE DISPLAY PROGRAM AND THE *
      *    LIST PROGRAM IN THE MODIFY OPTION.                *
      ********************************************************
091200         MOVE CMR-EST-UNIT-PRICE   TO  P-UNIT-COST
091300         MOVE CMR-DESC-LINE (1)    TO  PRT-DESC
091400         MOVE CMR-PO-NO-AND-REL    TO  PRT-PO-NO
      ********************************************************
      *    ADDED NEXT 4 LINES OF CODE ON 1/4/94 TO REMEDY    *
      *    A PROBLEM NAPANEE UNCOVERED ON DELETING REQS      *
      *    WITH A DIFFERENT ORIGINATOR THAN WAS IN WO-PARTS  *
      *    RECORD.                                           *
      ********************************************************
               IF CMR-REQ-ORIG = ENG-PL-SCHD-ID
                   MOVE CMR-REQ-ORIG     TO  PRT-ORIGINATOR
               ELSE
               NEXT SENTENCE
           ELSE
      *    ADDED THIS ELSE ON 2/25/93 TO HANDLE PO ALREADY
      *    MOVED TO HISTORY DATABASE AND DATA IS NOT RETRIEVABLE
           MOVE SPACES                   TO  PRT-PO-NO.
085100     IF PRT-EST-QTY = SPACES
085200         IF PRT-ACT-QTY = SPACES
085300             MOVE 0 TO PRT-EST-QTY-9 PRT-ACT-QTY-9 P-QTY (SUB)
085400         ELSE
               MOVE 0 TO PRT-EST-QTY-9
085500         MOVE PRT-ACT-QTY-9 TO P-QTY (SUB)
085600     ELSE
085700     MOVE PRT-EST-QTY-9 TO P-QTY (SUB).
091500     IF PRT-NUM-7 = "NON-STR" MOVE "       " TO PRT-NUM-7.
091600     IF PRT-PO-NO = "          "
091700         IF PRT-STATUS-1 = "U" OR "R"
      *----------- ADDED CHECK FOR NUMERIC QTY TO PREVENT DATA DECIMAL
      *----------- ERROR FROM OCCURRING.      04/21/1995
                   IF PRT-ACT-QTY-9 NOT NUMERIC
                       MOVE 0 TO PRT-ACT-QTY-9
                   END-IF
091800             MOVE PRT-ACT-QTY-9 TO P-QTY (SUB)
091900             MULTIPLY PRT-ACT-QTY-9 BY P-UNIT-COST
092000                 GIVING P-ACT-COST
092100             MOVE P-ACT-COST TO COST-WA
092200             MOVE COST-DOLS TO P-TOTAL-DOL (SUB)
092300             MOVE "." TO P-TOTAL-DEC (SUB)
092400             MOVE COST-CENTS TO P-TOTAL-CTS (SUB)
092500         ELSE
092600         MOVE SPACES TO P-RCVR (SUB)
      *------- ADDED CHECK FOR NUMERIC QTY.     04/21/1995
               IF PRT-EST-QTY-9 NOT NUMERIC
                   MOVE 0 TO PRT-EST-QTY-9
               END-IF
092700         MOVE PRT-EST-QTY-9 TO P-QTY (SUB)
092800         MULTIPLY PRT-EST-QTY-9 BY P-UNIT-COST
092900             GIVING P-EST-COST
093000         MOVE P-EST-COST TO COST-WA
093100         MOVE COST-DOLS TO P-TOTAL-DOL (SUB)
093200         MOVE "." TO P-TOTAL-DEC (SUB)
093300         MOVE COST-CENTS TO P-TOTAL-CTS (SUB)
093400     ELSE
093500     MOVE CMR-PO-NO-AND-REL TO P-REQ-PO-NO-RSLP (SUB)
      ********************************************************
      *    ASTERISKED OUT THE NEXT STATEMENT AT JIM THOMAS'  *
      *    REQUEST DUE TO A PROBLEM THAT DANVILLE REPORTED   *
      *    WITH DISCREPANCIES IN THE DISPLAY PROGRAM AND THE *
      *    LIST PROGRAM IN THE MODIFY OPTION.                *
      ********************************************************
093600*    MOVE CMR-PO-UNIT-PRICE TO P-UNIT-COST
093700     MOVE CMR-PO-QTY-ORD TO P-QTY (SUB) PRT-ACT-QTY-9
093800     MULTIPLY PRT-ACT-QTY-9 BY P-UNIT-COST
093900         GIVING P-ACT-COST
094000     MOVE P-ACT-COST TO COST-WA
094100     MOVE COST-DOLS TO P-TOTAL-DOL (SUB)
094200     MOVE "." TO P-TOTAL-DEC (SUB)
094300     MOVE COST-CENTS TO P-TOTAL-CTS (SUB)
094400     MOVE " " TO P-REQ-PO-DASH (SUB)
094500     MOVE "   " TO P-REQ-PO-RSLP (SUB).
094600*    IF PLANT-IDENT = "126 "
094700*       NEXT SENTENCE
094800*    ELSE
094900*    IF PRT-REQ-NO = "      " OR "CANCEL"
095000*        NEXT SENTENCE
095100*    ELSE
095200*    MOVE CMR-STAGING-AREA TO PRT-STAGE.
095300*******************************************************************
095400*    THE ABOVE 7 LINES WERE ADDED SO THAT DANVILLE COULD USE      *
095500*    THE STAGE FIELD TO KEEP TRACK OF THEIR REQUISITIONS          *
095600*******************************************************************
095700     MOVE PRT-UNIT-COST TO UNIT-COST-WA.
095800     MOVE UC-WA-DOLS TO P-UNIT-DOL (SUB).
095900     MOVE "." TO P-UNIT-DEC (SUB).
096000     MOVE UC-WA-CENTS-1-2 TO P-UNIT-CTS (SUB).
096100     MOVE PRT-NUM TO P-NUM (SUB).
096200     MOVE PRT-STAGE TO P-STAGE (SUB).
096300     MOVE PRT-UNIT-MEAS TO P-UM (SUB).
096400     MOVE PRT-ORIGINATOR TO P-ORIG (SUB).
096500     MOVE PRT-DESC TO P-DESC (SUB).
096600     IF WO-START-STATUS = "AA" OR "AR"
096700         MOVE "PM LEVEL " TO P-PM-LEVEL-LIT (SUB)
096800         MOVE PRT-LEVEL TO P-PM-LEVEL (SUB)
096900         MOVE "PM FLAG " TO P-PM-FLAG-LIT (SUB)
097000         MOVE PRT-FLAG TO P-PM-FLAG (SUB)
097100         MOVE "PM SUBSYS " TO P-PM-SUBS-LIT (SUB)
097200         MOVE PRT-SS TO P-PM-SS (SUB).
097300     IF SUB = 3
               NEXT SENTENCE
           ELSE
           GO TO 61-LI-LOOP.
           ADD SUB TO ITM-CTR.
           MOVE 66085 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO P-CMD-LINE.
           PERFORM 61-PROCESS-SCREEN THRU 61-PS-EXIT.
           IF VIEW-LASTKEY = 1 OR 3
               GO TO 2-EOJ.
09830      IF VIEW-LASTKEY = 6
               MOVE SPACES TO PRT-LINE-DATA
09840          MOVE 0 TO SUB
               GO TO 61-LI-LOOP.
099100     IF VIEW-LASTKEY = 7
               IF ITM-CTR < 4
                   MOVE 35126 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE ERROR-BUFFER TO EDIT-ERROR
                   MOVE TRUE-VAL TO INDS (99)
                   PERFORM 618-READ-BACK ITM-CTR TIMES
                   PERFORM 61-PROCESS-SCREEN THRU 61-PS-EXIT
                   IF VIEW-LASTKEY = 1 OR 3
                       GO TO 2-EOJ
                   ELSE
                   MOVE 0 TO SUB ITM-CTR
                   GO TO 61-LI-LOOP
               ELSE
               MOVE SPACES TO PRT-LINE-DATA
060900         IF ITM-CTR > 6
061000             IF SUB = 1
061100                 PERFORM 618-READ-BACK 4 TIMES
061200                 SUBTRACT 3 FROM ITM-CTR
                       MOVE 0 TO SUB
061400                 GO TO 61-LI-LOOP
061500             ELSE
061600             IF SUB = 2
061700                 PERFORM 618-READ-BACK 5 TIMES
061800                 SUBTRACT 3 FROM ITM-CTR
                       MOVE 0 TO SUB
062000                 GO TO 61-LI-LOOP
062100             ELSE
062200             PERFORM 618-READ-BACK 6 TIMES
062300             SUBTRACT 6 FROM ITM-CTR
                   MOVE 0 TO SUB
062500             GO TO 61-LI-LOOP
100200         ELSE
100300         GO TO 61-LIST-ITEMS.
103400     IF P-ITEM-INPUT = SPACES
103500         IF P-REQ-INPUT = SPACES
103700             MOVE SPACES TO PRT-LINE-DATA
103800             MOVE MATL-HEADER-INFO TO P-HEADER-INFO
104200             MOVE 0 TO SUB
104300             MOVE 0 TO ITEM-RESET
104400             GO TO 61-LI-EXIT
104500         ELSE
104700*        SUBTRACT 3 FROM ITM-CTR
104800         MOVE 9999 TO ITEM-BUFF-9
104900         MOVE P-REQ-INPUT TO REQ-BUFF
               MOVE 0 TO CHAIN-CTR
105000         PERFORM 611-RETRIEVE-NEXT-ITEM THRU
105100             611-RNI-EXIT
105200         IF ERR-SW = 1
105300             PERFORM 617-REQI-3-ERROR
                   MOVE SPACES TO P-ITEM-INPUT P-REQ-INPUT
049000             MOVE 6 TO VIEW-LASTKEY
049100             MOVE ITM-CTR TO ITEM-RESET
049200             MOVE 0 TO CHAIN-CTR
105400         ELSE
105500         MOVE SPACES TO REQI-DATA
105600         DIVIDE CHAIN-CTR BY 3 GIVING ITM-CTR
105700         MULTIPLY 3 BY ITM-CTR
105800         PERFORM 612-SELECT-REQ-SEARCH-ITEM
105900         MOVE ZEROES TO REQI-RET-CODE
106000         MOVE 0 TO PASS-SPOOL-PRT-NO
106100         MOVE PLANT-IDENT TO MPLTINFO-COMP
               PERFORM 61-CALL-SMREQINQ
               MOVE SPACES TO P-ITEM-INPUT P-REQ-INPUT
108600         MOVE 6 TO VIEW-LASTKEY
108700         MOVE ITM-CTR TO ITEM-RESET
108800         MOVE 0 TO CHAIN-CTR
108900         IF REQI-RET-CODE = 1
109000             PERFORM 615-REQI-1-ERROR
109100             GO TO 61-LIST-ITEMS
109200         ELSE
109300         IF REQI-RET-CODE = 2
109400             PERFORM 616-REQI-2-ERROR
109500             GO TO 61-LIST-ITEMS
109600         ELSE
109700         IF REQI-RET-CODE = 3
109800             PERFORM 617-REQI-3-ERROR
109900             GO TO 61-LIST-ITEMS
110000         ELSE
111200         GO TO 61-LIST-ITEMS.
111400*    SUBTRACT 3 FROM ITM-CTR.
       P-ITEM-INPUT-CHECK.
           IF P-ITEM-INPUT NOT NUMERIC
111500       MOVE P-ITEM-INPUT TO IT-BYTES
           ELSE
             MOVE P-ITEM-INPUT TO IT-BYTES-9.
       P-ITEM-INPUT-AFTER.
111600     PERFORM 619-RIGHT-ADJUST-ITEMNO THRU 619-RAI-EXIT.
      *--- CHECK TO SEE IF ITEM NUMBER IS NUMERIC.
           IF IT-BYTES-9 NOT NUMERIC
               PERFORM 620-ITEM-NUM-ERROR
               GO TO 61-LIST-ITEMS
           ELSE
111700         MOVE IT-BYTES-9 TO ITEM-BUFF-9
           END-IF.
           MOVE 0 TO CHAIN-CTR
111900     PERFORM 611-RETRIEVE-NEXT-ITEM THRU 611-RNI-EXIT.
           IF ERR-SW = 1
               PERFORM 617-REQI-3-ERROR
               MOVE SPACES TO P-ITEM-INPUT P-REQ-INPUT
115900         MOVE 6 TO VIEW-LASTKEY
116000         MOVE ITM-CTR TO ITEM-RESET
116100         MOVE 0 TO CHAIN-CTR
           ELSE
112000     IF PRT-STATUS-1 NOT = "M"
112100         PERFORM 614-REQNO-ERROR
               MOVE SPACES TO P-ITEM-INPUT P-REQ-INPUT
115900         MOVE 6 TO VIEW-LASTKEY
116000         MOVE ITM-CTR TO ITEM-RESET
116100         MOVE 0 TO CHAIN-CTR
112300     ELSE
112400     IF PRT-REQ-NO = "      "
112500         PERFORM 614-REQNO-ERROR
               MOVE SPACES TO P-ITEM-INPUT P-REQ-INPUT
115900         MOVE 6 TO VIEW-LASTKEY
116000         MOVE ITM-CTR TO ITEM-RESET
116100         MOVE 0 TO CHAIN-CTR
112700     ELSE
112800     MOVE SPACES TO REQI-DATA
112900     DIVIDE CHAIN-CTR BY 3 GIVING ITM-CTR
113000     MULTIPLY 3 BY ITM-CTR
113100     PERFORM 612-SELECT-REQ-SEARCH-ITEM
113200     MOVE ZEROES TO REQI-RET-CODE
113300     MOVE 0 TO PASS-SPOOL-PRT-NO
113400     MOVE PLANT-IDENT TO MPLTINFO-COMP
           PERFORM 61-CALL-SMREQINQ
           MOVE SPACES TO P-ITEM-INPUT P-REQ-INPUT
115900     MOVE 6 TO VIEW-LASTKEY
116000     MOVE ITM-CTR TO ITEM-RESET
116100     MOVE 0 TO CHAIN-CTR
116200     IF REQI-RET-CODE = 1
116300         PERFORM 615-REQI-1-ERROR
116400         GO TO 61-LIST-ITEMS
116500     ELSE
116600     IF REQI-RET-CODE = 2
116700         PERFORM 616-REQI-2-ERROR
116800         GO TO 61-LIST-ITEMS
116900     ELSE
117000     IF REQI-RET-CODE = 3
117100         PERFORM 617-REQI-3-ERROR
117200         GO TO 61-LIST-ITEMS
117300     ELSE
118500     GO TO 61-LIST-ITEMS.

118700 61-LI-EXIT.    EXIT.

       61-CALL-SMREQINQ.
           MOVE VIEW-COMAREA TO SAVE-VIEW-COMAREA.
077900     CALL "SMREQINQ" USING REQI-RET-CODE
078000                           BASE-STORES
078100                           BASE-STHIST
078200                           BASE-MMISA
078300                           BASE-BG
078400                           STATUS-AREA
078500                           VIEW-COMAREA
078600                           LANGUAGE-PARMS
078700                           REQI-DATA
078800                           REQ-GLOBALS
078900                           MPLTINFO-COMP
079000                           PASS-SPOOL-PRT-NO
079100                           ESC-NAME.
           MOVE SAVE-VIEW-COMAREA TO VIEW-COMAREA.

       61-PROCESS-SCREEN.
           MOVE "FMODMLST" TO VIEW-CFNAME.
           MOVE MATL-HEADER-INFO TO P-HEADER-INFO.
           MOVE SAVE-EXPCLASS TO P-EXPCLASS.
           MOVE EDIT-ERROR TO P-MSG-LINE.
           MOVE PRT-LINE-DATA TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE SPACES TO ERROR-BUFFER EDIT-ERROR
           MOVE DSPLY-REC TO PRT-LINE-DATA.
       61-PS-EXIT.    EXIT.

119700 611-RETRIEVE-NEXT-ITEM.
           MOVE 0 TO ERR-SW.
119800     MOVE 0 TO COND-WORD.
119900     MOVE WORK-ORDER-NO TO WONUM OF WPFDREC.
           START WO-PARTS-FILE KEY IS > EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPFD-STATUS NOT = "00"
               IF WPFD-STATUS = "23"
                   NEXT SENTENCE
               ELSE
               MOVE 17 TO COND-WORD.
120000     IF COND-WORD = 17
120200         MOVE 47004 TO CATREAD-MSG-NUMBER
120400         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO EDIT-ERROR
               MOVE TRUE-VAL TO INDS (99)
120800         MOVE 1 TO ERR-SW
120900         GO TO 611-RNI-EXIT.
121000 611-RNI-LOOP.
           MOVE 0 TO COND-WORD.
121100     READ WO-PARTS-FILE PRIOR INTO WO-PARTS-DATA
121200         AT END    MOVE 14 TO COND-WORD.
           IF WPFD-STATUS NOT = "00" MOVE 14 TO COND-WORD.
           IF WORK-ORDER-NO NOT = WONUM OF WPFDREC
               MOVE 14 TO COND-WORD.
121300     IF COND-WORD = 14
121400         MOVE 1 TO ERR-SW
121500         GO TO 611-RNI-EXIT.
           IF ITEM-BUFF-9 > 0
               IF PRT-DELETE-FLAG = "D"
                   GO TO 611-RNI-LOOP.
122300     ADD 1 TO CHAIN-CTR.
122400     IF CHAIN-CTR = ITEM-BUFF-9 GO TO 611-RNI-EXIT.
122500     IF ITEM-BUFF-9 = 9999
122600         IF PRT-REQ-NO = REQ-BUFF
122700             MOVE CHAIN-CTR TO ITEM-BUFF-9
122800             GO TO 611-RNI-EXIT.
122900     GO TO 611-RNI-LOOP.
123000 611-RNI-EXIT.    EXIT.
123100
123200 612-SELECT-REQ-SEARCH-ITEM.
123300     IF PRT-REQ-NO NOT = SPACES
123400         MOVE SPACES TO REQI-CORP-CODE
123500         MOVE SPACES TO REQI-WO-NO
123600         MOVE PRT-REQ-NO TO REQI-REQ-NO
123700     ELSE
123800     IF PRT-WO-NU NOT = SPACES
123900         MOVE SPACES TO REQI-CORP-CODE
124000         MOVE SPACES TO REQI-REQ-NO
124100         MOVE PRT-WO-NU TO REQI-WO-NO
124200     ELSE
124300     IF PRT-NUM NOT = SPACES
124400         MOVE SPACES TO REQI-REQ-NO
124500         MOVE SPACES TO REQI-WO-NO
124600         MOVE PRT-NUM TO REQI-CORP-CODE.
124700
126400 614-REQNO-ERROR.
126500     MOVE 66084 TO CATREAD-MSG-NUMBER.
126600     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO EDIT-ERROR.
           MOVE TRUE-VAL TO INDS (99).
127700     MOVE 0 TO SUB.
127800     MOVE 0 TO ITEM-RESET.
127900
128000 615-REQI-1-ERROR.
128100     MOVE 66083 TO CATREAD-MSG-NUMBER.
128200     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
128700     MOVE ERROR-BUFFER TO EDIT-ERROR.
129300     MOVE TRUE-VAL TO INDS (99).
129400     MOVE 0 TO SUB.
129800
129900 616-REQI-2-ERROR.
130000     MOVE 66081 TO CATREAD-MSG-NUMBER.
130100     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
130600     MOVE ERROR-BUFFER TO EDIT-ERROR.
131200     MOVE TRUE-VAL TO INDS (99).
131300     MOVE 0 TO SUB.
131700
131800 617-REQI-3-ERROR.
131900     MOVE 66082 TO CATREAD-MSG-NUMBER.
132000     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
132500     MOVE ERROR-BUFFER TO EDIT-ERROR.
133100     MOVE TRUE-VAL TO INDS (99).
133200     MOVE 0 TO SUB.
133600
133700 618-READ-BACK.
           MOVE 0 TO COND-WORD.
133800     READ WO-PARTS-FILE NEXT INTO WO-PARTS-DATA
133900         AT END    MOVE 15 TO COND-WORD.
           IF WPFD-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF WORK-ORDER-NO NOT = WONUM OF WPFDREC
               MOVE 15 TO COND-WORD.
134000
134100 619-RIGHT-ADJUST-ITEMNO.
134200     MOVE 4 TO SUB1, SUB2.
134300     IF ITB (SUB1) NOT = " " GO TO 619-ZEROFILL-FIELD.
134400 619-RAI-FIRST.
134500     IF ITB (SUB1) NOT = " " GO TO 619-MOVE-BYTE.
134600     IF SUB1 = 1 GO TO 619-ZEROFILL-FIELD.
134700     SUBTRACT 1 FROM SUB1.
134800     GO TO 619-RAI-FIRST.
134900 619-MOVE-BYTE.
135000     IF ITB (SUB1) = " " GO TO 619-ZEROFILL-FIELD.
135100     MOVE ITB (SUB1) TO ITB (SUB2).
135200     MOVE " " TO ITB (SUB1).
135300     IF SUB1 = 1 GO TO 619-ZEROFILL-FIELD.
135400     SUBTRACT 1 FROM SUB1, SUB2.
135500     GO TO 619-MOVE-BYTE.
135600 619-ZEROFILL-FIELD.
           IF ITB (1) = " " MOVE "0" TO ITB (1).
           IF ITB (2) = " " MOVE "0" TO ITB (2).
           IF ITB (3) = " " MOVE "0" TO ITB (3).
           IF ITB (4) = " " MOVE "0" TO ITB (4).
135800 619-RAI-EXIT.    EXIT.
135900
       620-ITEM-NUM-ERROR.
           MOVE 66104 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO EDIT-ERROR.
           MOVE TRUE-VAL TO INDS (99).
           MOVE 0 TO SUB.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

136000 998-BLOWUP.
136100     MOVE "TMODMLST" TO BU-PGM-NAME.
136200     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
136300                      VIEW-COMAREA DUMMY-KSAM-STAT
136400                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.
136500
136600 999-CATREAD.
136700     MOVE SPACES TO ERROR-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
138200 999-CATREAD-EXIT.
138300     EXIT.
