       IDENTIFICATION DIVISION.
       PROGRAM-ID. TMODMDEL.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.   AS400.
       OBJECT-COMPUTER.   AS400.
      ******************************************************************
      *C   04/14/1995    CA ZUBEK
      *C     ADDED LOGIC TO CHECK IF ITEM NUMBER ENTERED BY THE USER
      *C     IS NUMERIC.
      ******************************************************************
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZMODIFY-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT WO-BASIC-FILE
               ASSIGN TO DATABASE-MCFLMM1001
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS WBF-STATUS.
           SELECT WO-PARTS-FILE
               ASSIGN TO DATABASE-MCFLMM1201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS WPFD-STATUS.
           SELECT WO-PLANNED-FILE
               ASSIGN TO DATABASE-MCFLMM1101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS WPF-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).
       FD  WO-BASIC-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WBFREC.
       01  WBFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1001.
       FD  WO-PARTS-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFDREC.
       01  WPFDREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1201.
       FD  WO-PLANNED-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFREC.
       01  WPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.
       WORKING-STORAGE SECTION.
       77  CHAIN-CTR                         PIC 9(4).
       77  ERR-SW                            PIC 9.
       77  SUB1                              PIC S9(4) COMP.
       77  SUB2                              PIC S9(4) COMP.
       01  BASE-BG                           PIC X(24).
       01  BASE-DUMMY                        PIC X(24).
       01  BASE-MMISA                        PIC X(24).
       01  BASE-STORES                       PIC X(24).
       01  BLOWUP-BASE                       PIC X(16).
       COPY CATREAD IN COPYLIB.
       COPY CMANREQ IN COPYLIB.
       COPY CPYIND  IN COPYLIB.
       COPY TDATESUB OF COPYLIB.
       01  DEL-MSG.
           05  FILLER                        PIC X(24)
                VALUE "Item was deleted by CC# ".
           05  DEL-CC                        PIC X(4) VALUE SPACES.
           05  FILLER                        PIC X(4) VALUE " on ".
           05  DEL-DATE                      PIC X(8) VALUE SPACES.
           05  FILLER                        PIC X(28)
                VALUE " after W/O had been approved".
           05  FILLER                        PIC X(12) VALUE SPACES.
       01  EDIT-ERROR                        PIC X(80).
       01  ENTRY-POINT                       PIC X(10).
       01  ERROR-BUFFER.
           05  ERROR-76                      PIC X(76).
           05  E-DELAY                       PIC X(4).
       01  ERROR-SWITCH                      PIC S9(4) COMP.
       COPY ESCNAM2 IN COPYLIB.
       01  FILE-STATUSES.
           05  DSPLY-STATUS                  PIC XX.
           05  WBF-STATUS                    PIC XX.
           05  WPFD-STATUS                   PIC XX.
           05  WPF-STATUS                    PIC XX.
       COPY IOFEEDBACK IN COPYLIB.
       01  ITEM-REQ-BUFFER.
           05  ITEM-BUFF-9                   PIC 9(4).
           05  REQ-BUFF                      PIC X(12).
           05  ITEM-CMD-LINE                 PIC X(79).
           05  ITEM-ERR-LINE                 PIC X(79).
       01  ITEM-WA.
           05  IT-BYTES.
               10  ITB OCCURS 4              PIC X.
           05  IT-BYTES-9 REDEFINES IT-BYTES PIC 9(4).
       COPY LANGSUB OF COPYLIB.
       01  MATL-WORKAREA.
           05  MATL-HEADER-INFO.
               10  WO-NUM-WA                 PIC X(10).
               10  DESCRIPTION-WA            PIC X(30).
               10  A-C-WA                    PIC X.
               10  WO-STATUS-WA              PIC XX.
               10  EQPNUM-WA                 PIC X(6).
               10  ZONE-WA                   PIC X(4).
               10  DATE-SCHD-WA              PIC X(8).
               10  TIME-SCHD-WA.
                   15  TIME-SCHD-HH-WA       PIC XX.
                   15  TIME-COLON-WA         PIC X.
                   15  TIME-SCHD-MM-WA       PIC XX.
           05  ITEM-NO-WA                    PIC XXXX.
           05  MATL-DATA.
               10  PRT-STATUS-WA.
                   15  PRT-STATUS-1-WA       PIC X.
                   15  PRT-STATUS-2-WA       PIC X.
               10  PRT-QUANT-WA              PIC X(5).
               10  PRT-QUANT-WA-9 REDEFINES PRT-QUANT-WA  PIC 9(5).
               10  PRT-CODE-WA               PIC X(7).
               10  PRT-UNIT-MEAS-WA                 PIC XX.
               10  PRT-UP-WA.
                   15  PRT-UP-DOLS-WA        PIC X(12).
                   15  PRT-UP-DOLS-WA-9 REDEFINES PRT-UP-DOLS-WA
                                             PIC 9(12).
                   15  PRT-UP-CENTS-WA       PIC XX.
               10  PRT-UP-WA-9 REDEFINES PRT-UP-WA  PIC 9(12)V99.
               10  PRIME-WA                  PIC XXX.
               10  SUB-WA                    PIC XXX.
               10  ADDL-DATA-WA              PIC X(8).
               10  STAGE-WA                  PIC X(4).
               10  ORIG-WA                   PIC X(4).
               10  DATE-REQD-WA.
                   15  DATE-REQD-MD-WA       PIC XX.
                   15  DATE-REQD-DM-WA       PIC XX.
                   15  DATE-REQD-YY-WA       PIC XX.
               10  ADDL-INFO-WA              PIC X(14).
               10  SUGG-VENDOR-WA            PIC X(30).
               10  REQ-NO-WA                 PIC X(10).
               10  PM-LEVEL-WA               PIC XX.
               10  PM-FLAG-WA                PIC XX.
               10  PM-SUBS-WA                PIC XXXX.
               10  PRT-DESC-WA.
                   15  P-D-WA OCCURS 395 TIMES  PIC X.
               10  PRT-DESC-WA-80 REDEFINES PRT-DESC-WA.
                   15  P-D-WA-80 OCCURS 5    PIC X(79).
               10  REMARKS-WA.
                   15  REMARKS-1-WA          PIC X(79).
                   15  REMARKS-2-WA          PIC X(79).
           05  MATL-CMD-LINE                 PIC X(79).
           05  MATL-ERR-LINE                 PIC X(79).
       01  PASSED-SPOOL-PRT             PIC S9(2) VALUE ZERO  COMP.
       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TMODMDEL".
           05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A     PIC X(60) VALUE
                   " MATERIALS PROCESSING PROGRAM TO HANDLE DELETES "  .
               10  PROG-DESC-B     PIC X(60) VALUE SPACES.
               10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
           05  PASSWORD-FLAG       PIC X.
       COPY REQGLOB IN COPYLIB.
       01  SCREEN-PRINT-PARMS.
           05  PRINTCNTL                PIC S9(4) VALUE ZERO  COMP.
           05  PAGECNTL                 PIC S9(4) VALUE 49    COMP.
           05  SPOOLFIL-OPEN-SW         PIC X   VALUE "N".
       COPY DBSTAT OF COPYLIB.
       01  TRUE-VAL                     PIC 1 VALUE B"1".
       COPY TBLOWUP IN COPYLIB.
       01  WO-BASIC-DATA.      COPY DWOBASIC OF COPYLIB.
       01  WO-PLANNED-DATA.    COPY DWOPLAN OF COPYLIB.
       01  WO-PARTS-DATA.      COPY DWOPARTS OF COPYLIB.
       COPY WSCONTROL IN COPYLIB.
       LINKAGE SECTION.
       01  DBPARAMETERS.       COPY DBPARMS OF COPYLIB.
       01  WORK-ORDER-NO                     PIC X(10).
       COPY VCOMLINK OF COPYLIB.
       PROCEDURE DIVISION USING DBPARAMETERS WORK-ORDER-NO
                            VIEW-COMAREA.
       START-EXECUTING.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-EXIT.
       2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE WO-BASIC-FILE.
           CLOSE WO-PARTS-FILE.
           CLOSE WO-PLANNED-FILE.
           GOBACK.
       1-HSK.
           OPEN I-O   DISPLAY-FILE.
           OPEN INPUT WO-BASIC-FILE.
           OPEN I-O   WO-PARTS-FILE.
           OPEN INPUT WO-PLANNED-FILE.
           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "N"
               MOVE "  PWORD" TO BLOWUP-BASE
               MOVE "FAILED PASSWORD CHECK - TMODMDEL"
                   TO BU-DISPLAY-MSG
               PERFORM 998-BLOWUP.
           OPEN INPUT WO-BASIC-FILE.
           OPEN I-O   WO-PARTS-FILE.
           OPEN INPUT WO-PLANNED-FILE.
           MOVE SPACES TO BASE-BG BASE-DUMMY BASE-MMISA BASE-STORES.
      *    CALL "TESCSEQ" USING ESCNAM2.
       6-MAIN.
           MOVE 0 TO ERR-SW CHAIN-CTR ITEM-BUFF-9.
           MOVE SPACES TO MATL-WORKAREA WO-BASIC-DATA WO-PLANNED-DATA.
           PERFORM 60-GET-WO-DATA THRU 60-GWD-EXIT.
           IF WO-NUM = SPACES
               MOVE WO-NUM-PLANNED TO WO-NUM-WA
               MOVE DESCRIPTION-1-P TO DESCRIPTION-WA
               MOVE APPROVAL-CODE-P TO A-C-WA
               MOVE WO-STATUS-P TO WO-STATUS-WA
               MOVE EQUIP-NUM-P TO EQPNUM-WA
               MOVE ZONE-P TO ZONE-WA
               MOVE EXP-CLASS-P TO ADDL-DATA-WA
               MOVE ENG-PL-SCHD-ID TO ORIG-WA
               IF DATE-SCHD = "      "
                   NEXT SENTENCE
               ELSE
               MOVE 4 TO DATE-MODE
               MOVE DATE-SCHD TO DATE-VALIDATE-IN
               CALL "TDATECHK" USING DATE-CHECK-AREA
               MOVE DATE-SLASH-OUT TO DATE-SCHD-WA
               MOVE TIME-SCHD-P-HH TO TIME-SCHD-HH-WA
               MOVE ":" TO TIME-COLON-WA
               MOVE TIME-SCHD-P-MM TO TIME-SCHD-MM-WA
           ELSE
           MOVE WO-NUM TO WO-NUM-WA
           MOVE APPROVAL-CODE TO A-C-WA
           MOVE DESCRIPTION-1 TO DESCRIPTION-WA
           MOVE WO-STATUS TO WO-STATUS-WA
           MOVE EQUIP-NUM TO EQPNUM-WA
           MOVE EXP-CLASS TO ADDL-DATA-WA
           MOVE ENG-PL-SCHD-ID TO ORIG-WA
           MOVE ZONE OF WO-BASIC-DATA TO ZONE-WA.
           PERFORM 61-DELETE-ITEMS THRU 61-DI-EXIT.
       6-MAIN-EXIT.    EXIT.

       60-GET-WO-DATA.
           MOVE 0 TO COND-WORD.
           MOVE WORK-ORDER-NO TO WONUM OF WBFREC.
           START WO-BASIC-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 GO TO 60-CHECK-WO-PLANNED.
           READ WO-BASIC-FILE NEXT INTO WO-BASIC-DATA
               AT END    MOVE 17 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 GO TO 60-CHECK-WO-PLANNED.
           GO TO 60-GWD-EXIT.
       60-CHECK-WO-PLANNED.
           MOVE 0 TO COND-WORD.
           MOVE WORK-ORDER-NO TO WONUM OF WPFREC.
           START WO-PLANNED-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 GO TO 60-GWD-EXIT.
           READ WO-PLANNED-FILE NEXT INTO WO-PLANNED-DATA
               AT END    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
       60-GWD-EXIT.    EXIT.

       61-DELETE-ITEMS.
           MOVE "FMODMDEL" TO VIEW-CFNAME.
           IF EDIT-ERROR = SPACES
               MOVE SPACES TO ITEM-REQ-BUFFER.
           MOVE 66079 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO ITEM-CMD-LINE.
           MOVE EDIT-ERROR TO ITEM-ERR-LINE.
           MOVE ITEM-REQ-BUFFER TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE SPACES TO ERROR-BUFFER EDIT-ERROR.
           MOVE DSPLY-REC TO ITEM-REQ-BUFFER.
           IF VIEW-LASTKEY = 1 OR 3 GO TO 2-EOJ.
           IF VIEW-LASTKEY = 5 OR 8
               MOVE 32008 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO EDIT-ERROR
               MOVE TRUE-VAL TO INDS (99)
               GO TO 61-DELETE-ITEMS
           ELSE
           IF VIEW-LASTKEY = 7
               CALL "TMATHELP" USING DBPARAMETERS VIEW-COMAREA
               MOVE 0 TO VIEW-LASTKEY
               GO TO 61-DELETE-ITEMS.
           IF VIEW-LASTKEY NOT = 0 GO TO 61-DI-EXIT.
           IF REQ-BUFF NOT = SPACES
               MOVE 9999 TO ITEM-BUFF-9
               MOVE 0 TO CHAIN-CTR
           ELSE
           IF ITEM-BUFF-9 NUMERIC
               NEXT SENTENCE
           ELSE
           MOVE ITEM-REQ-BUFFER TO ITEM-WA
           PERFORM 610-RIGHT-ADJUST-ITEMNO THRU 610-RAI-EXIT
      *--- CHECK TO SEE IF ITEM NUMBER IS NUMERIC.
           IF IT-BYTES-9 NOT NUMERIC
               MOVE 66104 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO EDIT-ERROR
               MOVE TRUE-VAL TO INDS (1) INDS (99)
               MOVE 0 TO COND-WORD ERR-SW CHAIN-CTR
               GO TO 61-DELETE-ITEMS
           ELSE
               MOVE IT-BYTES-9 TO ITEM-BUFF-9.
           MOVE SPACES TO WO-PARTS-DATA.
           PERFORM 611-RETRIEVE-NEXT-ITEM THRU 611-RNI-EXIT.
           IF ERR-SW = 1
               MOVE 29042 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO EDIT-ERROR
               MOVE TRUE-VAL TO INDS (1) INDS (99)
               MOVE 0 TO COND-WORD ERR-SW CHAIN-CTR
               GO TO 61-DELETE-ITEMS.
      *    IF PRT-DELETE-FLAG = "D"
      *        MOVE 35109 TO CATREAD-MSG-NUMBER
      *        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
      *        MOVE ERROR-BUFFER TO EDIT-ERROR
      *        MOVE TRUE-VAL TO INDS (1) INDS (99)
      *        MOVE 0 TO COND-WORD ERR-SW CHAIN-CTR
      *        GO TO 61-DELETE-ITEMS.
           IF ENG-PL-SCHD-ID = SPACES
               NEXT SENTENCE
           ELSE
           IF PRT-ORIGINATOR = ENG-PL-SCHD-ID
               NEXT SENTENCE
           ELSE
           MOVE 51007 TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE ERROR-BUFFER TO EDIT-ERROR
           MOVE TRUE-VAL TO INDS (1) INDS (99)
           MOVE 0 TO COND-WORD ERR-SW CHAIN-CTR
           GO TO 61-DELETE-ITEMS.
           MOVE SPACES TO MATL-DATA MATL-CMD-LINE MATL-ERR-LINE.
           MOVE ITEM-BUFF-9         TO  ITEM-NO-WA.
           MOVE PRT-WO-NU           TO  WO-NUM-WA.
           MOVE PRT-STATUS          TO  PRT-STATUS-WA.
           IF PRT-EST-QTY = SPACES
               MOVE 0               TO PRT-EST-QTY
           ELSE
           MOVE PRT-EST-QTY-9       TO  PRT-QUANT-WA-9.
           MOVE PRT-NUM             TO  PRT-CODE-WA.
           MOVE PRT-UNIT-MEAS       TO  PRT-UNIT-MEAS-WA.
           MOVE PRT-UNIT-COST-DOLLR TO  PRT-UP-DOLS-WA-9.
           MOVE PRT-UNIT-COST-CENTS TO  PRT-UP-CENTS-WA.
           MOVE PRT-PRIME-1-3       TO  PRIME-WA.
           MOVE PRT-SUB-1-3         TO  SUB-WA.
           MOVE PRT-ORIGINATOR      TO  ORIG-WA.
           MOVE 4                   TO  DATE-MODE.
           MOVE PRT-DATE-USED       TO  DATE-VALIDATE-IN
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-OUT            TO  DATE-REQD-WA.
           MOVE PRT-ADDL-INFO       TO  ADDL-INFO-WA.
           MOVE PRT-SUGG-VENDOR     TO  SUGG-VENDOR-WA.
           MOVE PRT-REQ-NO          TO  REQ-NO-WA.
           MOVE PRT-LEVEL           TO  PM-LEVEL-WA.
           MOVE PRT-FLAG            TO  PM-FLAG-WA.
           MOVE PRT-SS              TO  PM-SUBS-WA.
           MOVE PRT-DESC            TO  P-D-WA-80 (1).
           MOVE PRT-DESC-2          TO  P-D-WA-80 (2).
           MOVE PRT-DESC-3          TO  P-D-WA-80 (3).
           MOVE PRT-DESC-4          TO  P-D-WA-80 (4).
           MOVE PRT-DESC-5          TO  P-D-WA-80 (5).
           MOVE PRT-REMARKS         TO  REMARKS-1-WA.
           MOVE PRT-REMARKS-2       TO  REMARKS-2-WA.
           IF EXP-CLASS = SPACES
               MOVE EXP-CLASS-P TO ADDL-DATA-WA
           ELSE
           MOVE EXP-CLASS TO ADDL-DATA-WA.
       61-DI-CONT.
           MOVE "FMODMDE2" TO VIEW-CFNAME.
           MOVE 66079 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO MATL-CMD-LINE.
           MOVE EDIT-ERROR TO MATL-ERR-LINE.
           MOVE MATL-WORKAREA TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE SPACES TO ERROR-BUFFER EDIT-ERROR.
           MOVE DSPLY-REC TO MATL-WORKAREA.
           IF VIEW-LASTKEY = 1 OR 3 GO TO 2-EOJ.
           IF VIEW-LASTKEY = 5 OR 7
               MOVE 35126 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO EDIT-ERROR
               MOVE TRUE-VAL TO INDS (99)
               MOVE 0 TO COND-WORD
               GO TO 61-DI-CONT
           ELSE
           IF VIEW-LASTKEY NOT = 0
               MOVE 0 TO COND-WORD
               GO TO 61-DI-EXIT.
      ***************************************************************
      *    THE FOLLOWING LOGIC WAS ADDED 1-13-88 TO PSEUDO-DELETE   *
      *    PARTS RECORDS SUCH THAT THE ESTIMATES MIGHT BE RETAINED  *
      *    AS REQUESTED BY CPE                                      *
      ***************************************************************
           IF APPROVAL-CODE-P = "A"
               NEXT SENTENCE
           ELSE
           GO TO 61-DI-CONT-2.
           IF PRT-REQ-NO = "      " OR "CANCEL"
               MOVE "D" TO PRT-DELETE-FLAG
               MOVE SPACES TO PRT-REMARKS PRT-REMARKS-2
               MOVE PRT-ORIGINATOR TO DEL-CC
               ACCEPT DEL-DATE     FROM DATE
               MOVE DEL-MSG        TO PRT-REMARKS-2
               PERFORM 69-DELETE-WO-PARTS-RECORD
               IF COND-WORD = 0
                   MOVE 35104 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE ERROR-BUFFER TO MATL-CMD-LINE
                   MOVE TRUE-VAL TO INDS (98)
                   MOVE MATL-WORKAREA TO DSPLY-REC
                   PERFORM 99-SCREEN-WRITE
                   PERFORM 98A-SCREEN-READ
                   CALL "CLPAUSE2"
                   MOVE SPACES TO EDIT-ERROR ERROR-BUFFER
                   GO TO 61-DELETE-ITEMS
               ELSE
               MOVE "DBUPDATE FAILED * TMODMDEL *"
                   TO BU-DISPLAY-MSG
               MOVE "  MMISA" TO BLOWUP-BASE
               MOVE "WO-PARTS" TO BU-DISPLAY-FLD (2)
               PERFORM 998-BLOWUP.
           MOVE "DT" TO CMR-CALL-MODE.
           MOVE SPACES TO CMR-DATA CMR-DESC CMR-REMARKS
               CMR-RETURNED-DATA.
           MOVE PRT-WO-NU TO CMR-WO-NUMBER.
           MOVE PRT-REQ-NO TO CMR-REQ-NUMBER.
           CALL "CMANREQ" USING BASE-STORES
                                BASE-MMISA
                                BASE-BG
                                BASE-DUMMY
                                ERROR-76
                                CMR-CALL-MODE
                                CMR-DATA
                                CMR-DESC
                                CMR-REMARKS
                                CMR-RETURNED-DATA
                                CMR-MISC-PARMS
                                REQ-GLOBALS
                                LANGUAGE-PARMS
                                ESC-NAME
                                VIEW-COMAREA.
           IF CMR-RETURN-STATUS = "OK"
               MOVE "D" TO PRT-DELETE-FLAG
               MOVE SPACES TO PRT-REMARKS PRT-REMARKS-2
               MOVE PRT-ORIGINATOR TO DEL-CC
               ACCEPT DEL-DATE     FROM DATE
               MOVE DEL-MSG        TO PRT-REMARKS-2
               PERFORM 69-REWRITE-WO-PARTS-FILE
               IF COND-WORD = 0
                   MOVE 35104 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE ERROR-BUFFER TO MATL-CMD-LINE
                   MOVE TRUE-VAL TO INDS (98)
                   MOVE MATL-WORKAREA TO DSPLY-REC
                   PERFORM 99-SCREEN-WRITE
                   PERFORM 98A-SCREEN-READ
                   CALL "CLPAUSE2"
                   MOVE SPACES TO EDIT-ERROR ERROR-BUFFER
                   GO TO 61-DI-EXIT
               ELSE
               MOVE "DBUPDATE FAILURE * TMODMDEL *"
                   TO BU-DISPLAY-MSG
               MOVE "  MMISA" TO BLOWUP-BASE
               MOVE "WO-PARTS" TO BU-DISPLAY-FLD (2)
               PERFORM 998-BLOWUP
           ELSE
           IF CMR-RETURN-STATUS = "C1"
               MOVE 35130 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO MATL-CMD-LINE
               MOVE TRUE-VAL TO INDS (98)
               MOVE MATL-WORKAREA TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
               MOVE SPACES TO ERROR-BUFFER EDIT-ERROR
               GO TO 61-DELETE-ITEMS
           ELSE
           IF CMR-RETURN-STATUS = "C2" OR "C3"
               MOVE 35131 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO MATL-CMD-LINE
               MOVE TRUE-VAL TO INDS (98)
               MOVE MATL-WORKAREA TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
               MOVE SPACES TO EDIT-ERROR ERROR-BUFFER
               GO TO 61-DELETE-ITEMS
           ELSE
           IF CMR-RETURN-STATUS = "BB"
               MOVE 28023 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO MATL-CMD-LINE
               MOVE TRUE-VAL TO INDS (98)
               MOVE MATL-WORKAREA TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
               MOVE SPACES TO EDIT-ERROR ERROR-BUFFER
               GO TO 61-DELETE-ITEMS.
           PERFORM 69-DELETE-WO-PARTS-RECORD.
           IF COND-WORD = 0
               MOVE 35103 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO MATL-CMD-LINE
               MOVE TRUE-VAL TO INDS (98)
               MOVE MATL-WORKAREA TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
               GO TO 61-DI-EXIT
           ELSE
           MOVE "DBDELETE FAILED * TMODMDEL *"
               TO BU-DISPLAY-MSG
           MOVE "  MMISA" TO BLOWUP-BASE
           MOVE "WO-PARTS" TO BU-DISPLAY-FLD (2)
           PERFORM 998-BLOWUP.
      ************************************************************
      *    END OF PSEUDO DELETE LOGIC ADDED 1-13-88              *
      ************************************************************
       61-DI-CONT-2.
           MOVE "DT" TO CMR-CALL-MODE.
           MOVE SPACES TO CMR-DATA CMR-DESC CMR-REMARKS
               CMR-RETURNED-DATA.
           MOVE PRT-WO-NU TO CMR-WO-NUMBER.
           MOVE PRT-REQ-NO TO CMR-REQ-NUMBER.
           CALL "CMANREQ" USING BASE-STORES
                                BASE-MMISA
                                BASE-BG
                                BASE-DUMMY
                                ERROR-76
                                CMR-CALL-MODE
                                CMR-DATA
                                CMR-DESC
                                CMR-REMARKS
                                CMR-RETURNED-DATA
                                CMR-MISC-PARMS
                                REQ-GLOBALS
                                LANGUAGE-PARMS
                                ESC-NAME
                                VIEW-COMAREA.
           IF CMR-RETURN-STATUS = "C1"
               MOVE 35130 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO MATL-CMD-LINE
               MOVE TRUE-VAL TO INDS (98)
               MOVE MATL-WORKAREA TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
               MOVE SPACES TO EDIT-ERROR ERROR-BUFFER
               GO TO 61-DELETE-ITEMS
           ELSE
           IF CMR-RETURN-STATUS = "C2" OR "C3"
               MOVE 35131 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO MATL-CMD-LINE
               MOVE TRUE-VAL TO INDS (98)
               MOVE MATL-WORKAREA TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
               MOVE SPACES TO EDIT-ERROR ERROR-BUFFER
               GO TO 61-DELETE-ITEMS
           ELSE
           IF CMR-RETURN-STATUS = "BB"
               MOVE 28023 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO MATL-CMD-LINE
               MOVE TRUE-VAL TO INDS (98)
               MOVE MATL-WORKAREA TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
               MOVE SPACES TO EDIT-ERROR ERROR-BUFFER
               GO TO 61-DELETE-ITEMS.
           PERFORM 69-DELETE-WO-PARTS-RECORD.
           IF COND-WORD = 0
               MOVE 35103 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO MATL-CMD-LINE
               MOVE TRUE-VAL TO INDS (98)
               MOVE MATL-WORKAREA TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
           ELSE
           MOVE "DBDELETE FAILED * TMODMDEL *"
               TO BU-DISPLAY-MSG
           MOVE "  MMISA" TO BLOWUP-BASE
           MOVE "WO-PARTS" TO BU-DISPLAY-FLD (2)
           PERFORM 998-BLOWUP.
       61-DI-EXIT.
           EXIT.

       610-RIGHT-ADJUST-ITEMNO.
           MOVE 4 TO SUB1, SUB2.
           IF ITB (SUB1) NOT = " " GO TO 610-ZEROFILL-FIELD.
       610-RAI-FIRST.
           IF ITB (SUB1) NOT = " " GO TO 610-MOVE-BYTE.
           IF SUB1 = 1 GO TO 610-ZEROFILL-FIELD.
           SUBTRACT 1 FROM SUB1.
           GO TO 610-RAI-FIRST.
       610-MOVE-BYTE.
           IF ITB (SUB1) = " " GO TO 610-ZEROFILL-FIELD.
           MOVE ITB (SUB1) TO ITB (SUB2).
           MOVE " " TO ITB (SUB1).
           IF SUB1 = 1 GO TO 610-ZEROFILL-FIELD.
           SUBTRACT 1 FROM SUB1, SUB2.
           GO TO 610-MOVE-BYTE.
       610-ZEROFILL-FIELD.
           IF ITB (1) = " "
               IF ITB (2) = " "
                   IF ITB (3) = " "
                       IF ITB (4) = " "
                           MOVE "0" TO ITB (1) ITB (2)
                                       ITB (3) ITB (4)
                       ELSE
                       MOVE "0" TO ITB (3) ITB (2) ITB (1)
                   ELSE
                   MOVE "0" TO ITB (2) ITB (1)
               ELSE
               MOVE "0" TO ITB (1).
       610-RAI-EXIT.    EXIT.

       611-RETRIEVE-NEXT-ITEM.
           MOVE 0 TO COND-WORD ERR-SW.
           MOVE WORK-ORDER-NO TO WONUM OF WPFDREC.
           START WO-PARTS-FILE KEY IS > EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPFD-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17
               MOVE 1 TO ERR-SW
               GO TO 611-RNI-EXIT.
       611-RNI-LOOP.
           READ WO-PARTS-FILE PRIOR INTO WO-PARTS-DATA
               AT END    MOVE 14 TO COND-WORD.
           IF WONUM OF WPFDREC NOT = WORK-ORDER-NO
               MOVE 14 TO COND-WORD.
           IF WPFD-STATUS NOT = "00" MOVE 14 TO COND-WORD.
           IF COND-WORD = 14
               MOVE 1 TO ERR-SW
               GO TO 611-RNI-EXIT.
           IF PRT-DELETE-FLAG = "D " GO TO 611-RNI-LOOP.
           ADD 1 TO CHAIN-CTR.
           IF CHAIN-CTR = ITEM-BUFF-9 GO TO 611-RNI-EXIT.
           IF ITEM-BUFF-9 = 9999
               IF PRT-REQ-NO = REQ-BUFF
                   MOVE CHAIN-CTR TO ITEM-BUFF-9
                   GO TO 611-RNI-EXIT.
           GO TO 611-RNI-LOOP.
       611-RNI-EXIT.    EXIT.

       612-CK-AND-RECORD-ERROR.
           IF COND-WORD NOT = 0
                MOVE "  MMISA" TO BLOWUP-BASE
                MOVE "WO-PARTS"     TO BU-DISPLAY-FLD (2)
                PERFORM 998-BLOWUP.

       69-DELETE-WO-PARTS-RECORD.
           MOVE 0 TO COND-WORD.
           DELETE WO-PARTS-FILE RECORD
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPFD-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-REWRITE-WO-PARTS-FILE.
           MOVE 0 TO COND-WORD.
           REWRITE WPFDREC FROM WO-PARTS-DATA
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPFD-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0" TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

       998-BLOWUP.
           MOVE "TMODMDEL" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
                            VIEW-COMAREA DUMMY-KSAM-STAT
                            BU-DISPLAY-MSG BU-DISPLAY-FLDS.

       999-CATREAD.
           MOVE SPACES TO ERROR-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.

       999-CATREAD-EXIT.
           EXIT.
