       IDENTIFICATION DIVISION.
       PROGRAM-ID.          TMTLSTAT.
       AUTHOR.              C HILLES.
       DATE-WRITTEN.        MARCH, 1982.
       DATE-COMPILED.
      *INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
      *SECURITY.
      *REMARKS. THIS IS THE MATERIAL STATUS INQUIRY PROGRAM.
      *
      *    IN SEPTEMBER OF 1981 THE FOLLOWING CHANGES WERE MADE:
      *      1.  CAPABILITY TO USE THE NEW REC-SEPARATOR WHICH CAN
      *          BE USED ON ALL CRT'S - ESPECIALLY THE 2626A.
      *          LOOK AT CTL-CAR IN WORKING-STORAGE.
      *          J.COFFMAN
      *    ON NOVEMBER 11, 1981 THE FOLLOWING CHANGES WERE MADE:
      *      2.  THE "CWHO" INTRINSIC WAS ADDED TO DETERMINE WHAT
      *          DATABASE THE PGM SHOULD BE POINTED AT.
      *          A.T.LEPERA.
      *    IN MARCH OF 1982, THIS PROGRAM WAS EXPANDED FROM A 1-
      *    SCREEN INQUIRY TO 5 SCREENS.  THIS IS FOR ADDED FIELDS
      *    AND SELF-DOCUMENTING FEATURES.  CIH.
      *
      *    ON JUNE 18, 1982, A TEST FOR A HOME GROUP OF "PLANT2"
      *    OR "PLANT3" WAS ADDED.  THIS WILL DIRECT THE INQUIRY
      *    TO THE CORRECT DATABASE AT THE AKRON MULTI-DATABASE
      *    FACILITY.
      *    CIH.
      *
      *         JUNE 1983
      *            1. CONVERTED PROGRAM TO VIEW.
      *            2. ADDED A BLANKET INQUIRY SUBROUTINE CALL
      *               FOR AKRON ONLY. THIS SCREEN BRING UP
      *               REQUIREMENT ORDERS IF 'f1' IS PRESSED
      *               ON THE FIRST INQUIRY SCREEN.
      *                 KURT MOVSESIAN.
      *
      *          AUGUST 1983
      *            1. ADDED LOGIC TO OPEN ALL DATA BASES IF THE
      *               PLANT IS AN AKRON PLT. THIS GIVES THEM
      *               COMPLETE INQUIRY INTO ANY DATA BASE IN
      *               AKRON (EXCEPT MIXCTR). PLANT 5 LOGIC WAS
      *               ALSO INCLUDED BUT COMMENTED OUT UNTIL STARTUP.
      *            2. ADDED AN INQUIRY SCREEN THAT SHOWS ALL PLTS.
      *               GIVING ONHANDS, UM, AND ONE REQUIREMENT ORDER
      *               IF THERE IS ONE. FROM THIS SCREEN THEY CAN GO
      *               INTO THE BASIC INQUIRY SCREEN.
      *            3. A PLANT INDICATOR WAS ADDED TO ALL SCREENS TO
      *               TELL THE USER WHICH PLANT THEIR IN.
      *                   KURT MOVSESIAN.
      *
      *    IN SEPT, 1983, CONVERTED THIS PROGRAM INTO A SUBPROGRAM,
      *    SO IT CAN BE CALLED FROM "TIRMAIN" - THE STORES PGM EXECUTIVE.
      *    WHEN RUNNING MTL STATUS AS STAND-ALONE, IT WILL BE CALLED
      *    BY A SHORT MAIN PGM CALLED "TMTSTEXC".  C HILLES.
      *
      *       OCT 18,1983
      *           1. TOOK OUT OPEN TO SPOOLFIL FOR SCREEN PRINTS THE
      *              PROGRAM NOW DOES NOT BLOW DOWN ON SPOOLKEY NOT
      *              FOUND. FOR SCREEN PRINTS ADDED CALLS TO THE
      *              SUBROUTINE 'TSCRPRNT' WHICH OPEN SPOOLFIL
      *              AND DOES ACTUAL SCREEN PRINTS.
      *                    KURT MOVSESIAN.
      *
      *       JAN 13, 1984
      *           OPEN UP LOGIC FOR PLANT5 IN THE OVERALL
      *           DATA BASE INQUIRY
      *               KURT MOVSESIAN.
      *
      *    ON JUNE 8, 1984, CHANGED THE VIEW FORM (NO PROGRAM CHANGES
      *    WERE MADE).  THE "AVG MONTHLY ISSUE" HEADING IS CHANGED
      *    (STR-MTH-FCST ITEM IN MSTORERM SEGMENT) TO "AVG MONTHY USAGE".
      *    THIS REFLECTS THE CHANGE MADE STARTING JULY 1 - FROM THIS
      *    TIME ON, THE STR-MTH-FCST FIELD WILL BE UPDATED FROM THE
      *    USAGE DATA ON THE HP, RATHER THAN TRANSMISSIONS FROM THE
      *    IBM MAINFRAME. CIH.
      *
      *    JUNE 1984.
      *      1. MADE NECESSARY CHANGES FOR REQUIREMENT ORDERS
      *         INQUIRY.
      *      2. ADDED PLANT9 INTO THE OVERALL DATA BASE INQUIRY
      *           KURT MOVSESIAN.
      *
      *    ON AUGUST 23, 1984, CHANGED THIS PROGRAM TO ALLOW AN INQUIRY
      *    BY AN "ALTERNATE KEY".  WHEN THE CORPORATE CODE IS ENTERED
      *    ON THE FIRST SCREEN, THIS PGM NOW CALLS THE SUBPROGRAM
      *    "TALTKEY", WHICH INQUIRES AGAINST A NEW DATASET "MALTKEY".
      *    "MALTKEY" HAS A 40-BYTE KEY ASSOCIATED WITH A CORP-CODE.
      *    "TALTKEY" CHECKS TO SEE IF AN ALTERNATE KEY WAS ENTERED
      *    (SUCH AS "ADAMAX" FOR 2610211), AND IF SO RETURNS THE
      *    ACTUAL CORPORATE CODE TO THIS PGM.  THE PROGRAM THEN CONTINUES
      *    ON AS NORMAL. FOR MULTIPLE DATABASE SITUATIONS AS IN AKRON,
      *    ONLY ALTERNATE KEYS IN THE "HOME" DATABASE WILL BE
      *    RECOGNIZED.   ALSO ADDED THE FORMS CACHE ABILITY TO THE
      *    PROGRAM BY CALLING THE SUBPROGRAM "TTERMTYP".  CIH.
      *
      *
      *    DEC. 10, 1984
      *     1. ADDED LOGIC TO SURPRESS MARKET COST IF THE USER IS NOT
      *        ONE OF THE FOLLOWING - 'PURCH', 'BUYER', 'MATCONT', OR
      *        'ACCTG'.
      *          KURT MOVSESIAN.
      *
      *    ON JANUARY 21, 1985, ADDED A CORPORATE CODE PARAMETER
      *    THE THE CALL OF THIS SUBPROGRAM.  THIS IS PRIMARILY SO THAT
      *    AN MMIS PROGRAM - WHICH INQUIRES ON ALL CORP-CODED PARTS
      *    IN A MACHINE SUBSYSTEM - MAY CALL THE INQUIRY, BUT PASS THE
      *    CORPORATE CODE THAT IS DESIRED TO BE INQUIRED ON.  THIS WAY
      *    THE USER CAN SELECT A CORPORATE CODE THAT ALREADY IS DISPLAYED
      *    ON THE MMIS INQUIRY, AND THEN SEE THE MATERIAL STATUS INQUIRY
      *    SCREEN, WITHOUT HAVING TO ENTER THE CORPORATE CODE AGAIN
      *    (ON THE CORP CODE ENTRY SCREEN OF THE MATERIAL STATUS
      *    INQUIRY).  IF THE PASSED CORPORATE CODE IS SPACES, THE
      *    CORPORATE CODE ENTRY SCREEN IS BROUGHT UP AS USUAL.
      *    THE FOLLOWING PROGRAMS CALL THIS INQUIRY, AND NOW HAVE AN
      *    ADDED "DUMMY" CORP CODE PARAMETER - TCORITM, TIRMAIN,
      *    TISSCRWS, TMTSTEXC, TRMCORR.  CIH.
      *
      *    ON APRIL 27, 1985, CHANGED THE PARAMETERS FOR THE CALL
      *    TO THE BLANKET CHECK PROGRAM "TCHKBLKT" AND THE BLANKET
      *    INQUIRY PROGRAM "TBLKTINQ".  THESE SUBPROGRAMS WERE
      *    CHANGED TO CALL THE "TBLOWUP" SUBROUTINE WITHIN THE
      *    SUBPROG, THEREFORE THE PARAMETERS FOR FATAL ERROR SWITCH
      *    AND BLOWUP MESSAGE WERE ELIMINATED.  CIH.
      *
      *    MAY 1, 1985;  ADDED TDATECHK ROUTINE AND COPYLIB. -B. WINTER.
      *
      *    MAY 7, 1985;  NO LONGER STRIPPING "A" OFF OF REQ NUMBER.
      *                     -B. WINTER.
      *
      *    ON JUNE 1, 1985, EXPANDED ALL USAGE FIELDS ON THE SCREEN
      *    FROM 8 DIGITS (WITH SIGN) TO 9 DIGITS, SO THAT USAGE WILL
      *    NOT BE TRUNCATED.  SOME STATIONERY CODES IN PLANT 1 AKRON
      *    WERE IN THE 10-MILLIONS USAGE, AND WERE BEING TRUNCATED.
      *    IN ORDER TO PUT ANY FORM FILE CHANGES FORM "VMTLSTAT"
      *    INTO ALL FORM FILES OF PROGRAMS THAT CALL THIS SUBPROGRAM,
      *    I CREATED THE JOB STREAM "FMTLSTAT.COMPILE".  CIH.
      *
      *    ON AUGUST 15, 1985,  ADDED HIGH-USAGE AREAS TO THE FMTLSTAT2
      *    SCREEN (MQ1-2).   DALE HOERLE.
      *
      *
      *   10/ 8/85  ADDED CALLS TO FINDJCW, NLAPPEND, CATOPEN, AND
      *             CATCLOSE IN ORDER TO ACCOMODATE THE NATIVE
      *             LANGUAGE SUPPORT FACILITY.  ADDED LINKAGES AND
      *             ALSO MADE THE CHANGE TO THE FORMFILE NAMES.
      *             CHANGED ALL REFERENCES OF TSCRPRNT TO TSCRPRT2,
      *             TDATECHK TO TDATECK2.
      *             THIS WAS TO INCORPORATE THE NATIVE LANGUAGE
      *             SUPPORT VERSIONS OF THESE SUBROUTINES.
      *                                         PD RAGLOW.
      *
      *  10/16/85   EXPANDED THE FULL DESCRIPTION FEATURE (SCREEN
      *             4) TO INCLUDE ANY 2ND LANGUAGE DESCRIPTION
      *             FROM DDESC2 AND MANUFACTURER INFORMATION FROM
      *             DMANPART AFTER THE DESCRIPTION FOUND IN DDESC.
      *             ALSO CONVERTED PROGRAM TO TBLOWUP.
      *                                         D.A. PLUM
      *
      *
      *    01/29/86.
      *      ADDED A CHECK FOR VIEW STATUS 160 AFTER EACH "VREADFIELDS"
      *      CALL.  THIS VIEW STATUS IS A TIMEOUT OF THE VIEW SCREEN,
      *      WHICH IS USED BY MMIS PROGRAMS CALLING THIS SUBPROGRAM.
      *      CIH.
      *
      *  04/01/86  REVISED THE FULL DESCRIPTION FUNCTION (SCREEN 4)
      *            TO DISPLAY THE MANUFACTURER INFORMATION FIRST,
      *            FOLLOWED BY THE PRIMARY DESCRIPTION (DDESC), AND
      *            FINALLY THE SECONDARY DESCRIPTION (DDESC2).  ALSO
      *            ADDED CALLS TO THE SUBPROGRAM CFINPTYP WHICH
      *            RETURNS MFR NUMBER TYPES SUCH AS P/N, CAT, DWG.
      *                                           D.A. PLUM
      *
      *    06/11/86.
      *       ADDED A CALL TO "CDESC" TO GET THE DESCRIPTION
      *       FOR SCREEN-2. (BASIC INQUIRY FIELDS).  THIS SUBPROGRAM
      *       WILL INCORPORATE THE NEW DMANPART ENTRIES.
      *       CIH.
      *
      *    06/26/86.
      *      FIXED BUG IN "REPAIRABLE ITEM" DISPLAY AND "REQUIREMENTS
      *      ORDER" DISPLAY.  THESE WERE NOT CLEARED OUT FOR EACH CODE,
      *      AND THEREFORE THE MESSAGE FROM THE PREVIOUS CODE WAS
      *      RETAINED.
      *      CIH.
      *
      *    08/5/86.
      *      ADDED PLANT4 AND MIXCTR INTO THE OVERALL DATA BASE
      *      INQUIRY.  REVAMPED SCREEN-1B IN ORDER TO ACCOMODATE THE
      *      INFORMATION ON PLANT4 AND THE MIXCTR.
      *                                  - ANNETTE KRAUSS.
      *
      *C   09/16/93  JEFF BUNGO   REQUEST 6425
      *C       ADDED "ONDOCK" FIELD TO BASIC INQUIRY SCREEN.
      *C       ON DOCK IS THOSE ITEMS RECEIVED BUT NOT YET STORED.
      *C
      *C   07APR1994  DAVE PLUM   REQUEST #6490
      *C       REMOVED ALL REFERENCES TO "C O P Y D B" TYPE COPYLIBS.
      *C
      *C   11AUG1994  DAVE PLUM   REQUEST #6524 (94-039)
      *C       ENHANCED THE "MORE DESCRIPTION SCREEN" TO INCLUDE
      *C       INDICATION OF WHICH MANUFACTURER(S) ARE "SELECTED".
      *C       THIS SELECTION VALUE IS COPYLIB FIELD MAN-PARTNO-SELECT.
      *C
      *C       ALSO REVISED ALL REFERENCES TO "C O P Y C S I S" TO
      *C       "COPYLIB".
      *C
      *C   12APR1996  CATHY YODER  REQUEST #96-014
      *C       ADDED "LAST BUYER" FIELD TO INQUIRY SCREEN.
      *C
      *C   06/10/96   JEFF BUNGO
      *C       EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C       RECOMPILE PROGRAM TO PICK UP NEW FILE FORMATS.
      *C
      *C   12/18/96   JEFF BUNGO   REQ #96-042
      *C       ALLOW THE INQUIRY OF LAST PO THROUGH FUNCTION KEY 5.
      *C
      *C   1/13/97    BILL ROXBURY REQ #95-012
      *C       ADDED TOTALS FOR RECEIPTS FROM NEW RECEIVING FILE.
      *C
      *C  11/25/97    JEFF BUNGO   REQ #97-017
      *C     ADD USAGE FIELDS FOR DIRECT DELIVERY.  DD USAGE
      *C     TO BE STORED IN ADDITIONAL FIELD AND TOTAL USAGE.
      *C     STORE ISSUE USAGE CALCULATED BY TOTAL USAGE - DD USAGE.
      *C
DP9802*C  05FEB1998   DAVE PLUM
DP9802*C     ADDED LOGIC TO ALLOW INQUIRY OF THE LAST PO THROUGH
DP9802*C     FUNCTION KEY 5 FROM:
DP9802*C        1) MORE INQUIRY FIELDS SCREEN
DP9802*C        2) MORE DESCRIPTION SCREEN
DP9802*C     THIS OPTION WAS PREVIOUSLY ADDED FOR USE FROM THE BASIC
DP9802*C     INQUIRY SCREEN.
DP9802*C
      *C  12/28/98    CA YODER
      *C     ADDED EMPLOYEE NAME TO MQ1-3 SCREEN.
      *C
      *C  11/11/99    CA YODER   (NAPANEE REQUEST)
      *C     ADDED LOGIC TO HIDE COST & USAGE FIELDS ON THE ITEM
      *C     STATUS SCREENS IF JCW 309 IS SET.  IF IT IS SET TO
      *C     YES, INDICATOR 90 IS SET, WHICH HIDES THE FIELDS
      *C     ON THE ZCSISINQ SCREENS.
      *C
      *C  04/12/00    CA YODER   (NAPANEE REQUEST)
      *C     ADDED LOGIC TO DISPLAY TECHNICAL BULLETIN INFORMATION
      *C     (DTECHBUL), IF ANY ENTRIES EXIST, AFTER THE CODE
      *C     DESCRIPTION.
      *C
      *C  02/27/02    CA YODER   (NAPANEE REQUEST)
      *C     ADDED LOGIC TO DISPLAY COMPLIANCE REQUIREMENT INFORMATION
      *C     (DCOMPL), IF ANY ENTRIES EXIST, AFTER THE CODE
      *C     DESCRIPTION.
      *C
      *C  05/09/02    CA YODER   (LAWTON REQUEST)
      *C     ADDED SARA REPORTABLE (SA), RESTRICTED (RW), AND OVERRIDE
      *C     CHARGE (OV) FLAGS TO MQ1-3 SCREEN.
      *C
      *C  03/18/03    CA YODER   (NAPANEE REQUEST)
      *C     ADDED LITERAL TO INDICATE IF STR-AUTH FLAG IS ON FOR
      *C     THE CODE.
      *C
DCR01 *C  11/13/03    D.RAUCH    DCR01    (PER DAVE PLUM)
DCR01 *C     ADD ARIBA BUYER FLAG(Y/N) TO THE SCREEN AND THE
DCR01 *C     CODE TO POPULATE IT.
      *C
      *C  08/12/2004  CA YODER            (SAP CLEANUP)
      *C     IF AN SAP PLANT, DON'T DISPLAY CERTAIN FIELDS NO
      *C     LONGER MAINTAINED IN CSIS.
      *C
DCR02 *C  01/13/2005  D.RAUCH    DCR02  REQUEST# 2005-11232
DCR02 *C     ADDED CODE TO CHECK FOR PLANT BEING ARIBA ENABLED PRIOR
DCR02 *C     TO OPENING ARIBA CATALOG FILE
      *C---------------------------------------------------------------
DCR03 *C MAR 10, 2005  D.RAUCH       DCR02    REQUEST# 2005-78515
DCR01 *C    DISPLAY FILE PROCESSING CHANGED FROM USING ZCSISINQ
DCR03 *C    NEW DISPLAY FILE ZTMTLSTAT CREATED - FORMATS COPIED
DCR03 *C    FROM ZCSISINQ.
DCR03 ****************************************************************
020807*C  07/05/08    MJ BALSAMO   TASK # 2007-10504019 - 0001       *
020807*C     IF THE STR-RESTRICTED-FLG IS SET THEN                   *
020807*C     DISPLAY A MESSAGE ON THE SCREEN.                        *
020807*C                                                             *
CY1772****************************************************************
CY1772*C  04/27/2012  CA YODER     RFC# 1772     CPPI# 2012-07653244 *
CY1772*C     ADD MARKET COST BACK TO THE DISPLAY SCREEN AS UNIT      *
CY1772*C     COST ON THE FMTLSTAT2 SCREEN.                           *
      ****************************************************************
      **                                                          **
      **   THIS MATERIAL STATUS INQUIRY INCLUDES 5 SCREENS:       **
      **                                                          **
      ** DE-FIELDS-1. CORP CODE ENTRY SCREEN.  HERE THE CORPORATE **
      **              CODE TO BE INQUIRED UPON IS ENTERED AND     **
      **              CHECKED FOR VALIDITY.                       **
      **                                                          **
      ** DE-FIELDS-2. BASIC INQUIRY SCREEN.  BASIC DATA A CRAFTS- **
      **              MAN WOULD NEED ABOUT A STOREROOM ITEM.      **
      **                                                          **
      ** DE-FIELDS-3. MORE INQUIRY FIELDS.  EXTRA INQUIRY INFO    **
      **              THAT MIGHT BE NEEDED BY PURCHASING OR MATL  **
      **              CONTROL.                                    **
      **                                                          **
      ** DE-FIELDS-4. MORE DESCRIPTION SCREEN.  LETS THE USER SEE **
      **              ALL LINES OF DESCRIPTION (FOR CODES WITH 4  **
      **              OR MORE LINES OF DESCRIPTION).  THIS SCREEN **
      **              INCLUDES A ROLL-UP FEATURE.  FOLLOWING      **
      **              ALL OF THE PRIMARY LANGUAGE DESCRIPTION     **
      **              FOUND IN DDESC, THE 2ND LANGUAGE DESCRIPTION**
      **              FROM DDESC2 IS DISPLAYED, WHICH IS THEN     **
      **              FOLLOWED BY THE MFR DATA FROM DMANPART.     **
      **                   SCREEN-4A  TOP PART OF DESC SCREEN.    **
      **                   SCREEN-4B  BOTTOM PART OF DESC SCREEN. **
      **                                                          **
      **   FBLKINQ.  THE REQUIREMENT ORDER INQUIRY SCREEN IS      **
      **             BROUGHT UP THROUGH A SUB ROUTINE 'TBLKINQ'   **
      **                                                          **
      **   RESERVATIONS.  THE RESERVATION INQUIRY SCREEN IS CALLED**
      **                  FROM THE SUBPROGRAM TRSRVINQ.SOURCE.    **
      **                                                          **
      **************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  HP-3000.
       OBJECT-COMPUTER.  HP-3000.
       COPY SPECIALN IN COPYLIB.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
      *COPY SLMSTCDI IN C O P Y D B C S.
           SELECT MSTORERM-CD-I
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

      *COPY SLDDSCDI IN C O P Y D B C S.
           SELECT DDESC-CD-I
               ASSIGN TO DATABASE-MCFLCS1401
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

      *COPY SLDD2CDI IN C O P Y D B C S.
           SELECT DDESC2-CD-I
               ASSIGN TO DATABASE-MCFLCS3101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

      *COPY SLUSECDI IN C O P Y D B C S.
           SELECT USAGEFIL-CD-I
               ASSIGN TO DATABASE-MCFLCSUSAG
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

      *COPY SLDMPCDI IN C O P Y D B C S.
           SELECT DMANPART-CD-I
               ASSIGN TO DATABASE-MCFLCS3603
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DPORECD-I
               ASSIGN TO DATABASE-MCFLCS0901
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DPORECD-I-H
               ASSIGN TO DATABASE-MCFLST0301
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT RECEIPTFIL-CD-I
               ASSIGN TO DATABASE-MCFLCSRCPT
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT PERSONNEL-I
               ASSIGN TO DATABASE-MCFLMM0301
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DTECHBUL-I
               ASSIGN         TO DATABASE-MCFLCS6901
               ORGANIZATION   IS INDEXED
               ACCESS MODE    IS DYNAMIC
               RECORD KEY     IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS    IS FILE-STATUS.

           SELECT DCOMPL-I
               ASSIGN         TO DATABASE-MCFLCS7001
               ORGANIZATION   IS INDEXED
               ACCESS MODE    IS DYNAMIC
               RECORD KEY     IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS    IS FILE-STATUS.

DCR01      SELECT ARIBA-CATALOG-FILE
DCR01             ASSIGN TO DATABASE-MCFLAB2004
DCR01             ORGANIZATION   IS INDEXED
DCR01             ACCESS MODE    IS DYNAMIC
DCR01             RECORD KEY     IS EXTERNALLY-DESCRIBED-KEY
DCR01             WITH DUPLICATES
DCR01             FILE STATUS    IS FILE-STATUS.

           SELECT MPLTINFO-I
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DISPLAY-FILE
DCR03          ASSIGN TO WORKSTATION-ZTMTLSTAT-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DISPLAY-STATUS
               CONTROL-AREA IS WS-CONTROL.

           SELECT PLANT-FILE ASSIGN TO DISK-MCPLTCODES.

       DATA DIVISION.
       FILE SECTION.
       COPY PLTCODES IN COPYLIB.
       FD  MSTORERM-CD-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-CD-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  USAGEFIL-CD-I
           LABEL RECORDS ARE STANDARD.
       01  USAGEFIL-CD-REC-I.
           COPY DDS-MCRPCSUSAG  OF MCFLCSUSAG.

       FD  DDESC-CD-I
           LABEL RECORDS ARE STANDARD.
       01  DDESC-CD-REC-I.
           COPY DDS-MCRPCS1400  OF MCFLCS1401.

       FD  DDESC2-CD-I
           LABEL RECORDS ARE STANDARD.
       01  DDESC2-CD-REC-I.
           COPY DDS-MCRPCS3100  OF MCFLCS3101.

       FD  DMANPART-CD-I
           LABEL RECORDS ARE STANDARD.
       01  DMANPART-CD-REC-I.
           COPY DDS-MCRPCS3600  OF MCFLCS3603.

       FD  DPORECD-I
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCS0901.

       FD  DPORECD-I-H
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-REC-I-H.
           COPY DDS-ALL-FORMATS OF MCFLST0301.

       FD  RECEIPTFIL-CD-I
           LABEL RECORDS ARE STANDARD.
       01  RECEIPTFIL-CD-REC-I.
           COPY DDS-MCRPCSRCPT  OF MCFLCSRCPT.

       FD  PERSONNEL-I
           LABEL RECORDS ARE STANDARD.
       01  PERSONNEL-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLMM0301.

DCR01  FD  ARIBA-CATALOG-FILE
DCR01      LABEL RECORDS ARE STANDARD.
DCR01  01  ARIBA-CATALOG-REC.
DCR01      COPY DDS-ALL-FORMATS  OF MCFLAB2004.
DCR01      COPY DARIBACAT  IN COPYLIB.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  DTECHBUL-I
           LABEL RECORDS ARE STANDARD.
       01  DTECHBUL-REC-I.
           COPY DDS-MCRPCS6900  OF MCFLCS6901.

       FD  DCOMPL-I
           LABEL RECORDS ARE STANDARD.
       01  DCOMPL-REC-I.
           COPY DDS-MCRPCS7000  OF MCFLCS7001.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                   PIC X(2000).

       WORKING-STORAGE SECTION.

       77  HANDLE-BLOWUP-FLAG            PIC X(1)  VALUE "Y".
       77  EOF-FLAG                      PIC X(1).
       77  PASSWORD                      PIC X(8)  VALUE "JADE;   ".
       77  INV-CYCLE-9                   PIC 9999.
       77  DLVTIME-9                     PIC 9999.
       77  SUB                           PIC 99.
       77  DESC-SUB                      PIC 99  VALUE ZEROS.
       77  DB-SUB                        PIC 99  VALUE ZEROS.
       77  PAGE-CTR                      PIC S99 VALUE ZEROS.
       77  CALC-ADDR                     PIC S9(9)  COMP-4 VALUE ZEROS.
       77  YTD-TOTAL                     PIC S9(9)  VALUE 0.
       77  FATAL-ERR-SW                  PIC X  VALUE SPACES.
       77  COMP-SCREEN-INDIC             PIC X(3)  VALUE SPACES.
       77  DB-KSAM-FILES-OPEN-SW         PIC X  VALUE SPACES.
       77  RET-CODE                      PIC X(2)  VALUE "00".
       77  ALT-KEY-ARG                   PIC X(40) VALUE SPACES.
       77  ALT-CORP-CODE                 PIC X(8)  VALUE SPACES.
       77  PO-PRICE-SW                   PIC X     VALUE SPACES.
       77  COST-USAGE-SW                 PIC X     VALUE SPACES.
       77  SAVE-PARA-NUMBER              PIC 9(2)  VALUE ZERO.
       77  FIRST-FORM-GOT-FLAG           PIC X(1)  VALUE "N".
       77  OVERRIDE-DB-FLAG              PIC X(1).
       77  DTECHBUL-SW                   PIC X.
       77  DCOMPL-SW                     PIC X.
       77  SHOW-LIT-SW                   PIC X     VALUE "N".
       77  SAP-PLANT-SW                  PIC X     VALUE "N".

       COPY FUNCTDEF IN COPYLIB.
       01  REQ-WORK.
           05  FILLER                    PIC X.
           05  STR-LAST-REQ-NO-2-7       PIC X(5).
           05  FILLER                    PIC X(6).

       01  COMPANY-SAVE.
           05  COMPANY-SAVE-1-2          PIC X(2).
               88  IS-AKRON-PLANT                  VALUE "11".
           05  FILLER                    PIC X(1).

       01  MULTIPLE-DB-PLANT             PIC X     VALUE "N".
           88  MORE-THAN-ONE-DB                    VALUE "Y".

       01  CODE-EXISTS-TABLE.
           05  CODE-EXISTS-AREA OCCURS 7 TIMES.
               10  CODE-EXISTS           PIC X.



DCR02  COPY ZMPLTWS     IN COPYLIB.
DCR01  01  WS-ARIBA-BUYER-FLDS.
DCR01      03  WS-ARIBA-ENABLED-KEY    PIC X(04)     VALUE "ARIB".
DCR01
DCR01      03  WS-ARIBA-CORPCODE       PIC X(08)     VALUE SPACE.
DCR01      03  WS-ARIBA-ITEM-SW        PIC X(01)     VALUE SPACE.
DCR01          88  ARIBA-BUYER-ITEM-NO               VALUE "N".
DCR01          88  ARIBA-BUYER-ITEM-YES              VALUE "Y".

DCR02      03  WS-ARIBA-ENABLED-SW     PIC X(01)     VALUE SPACE.
DCR02          88  ARIBA-ENABLED-YES                 VALUE "Y".
DCR02          88  ARIBA-ENABLED-NO                  VALUE "N".


       01  FULL-DESC-TBL.
           05  FULL-DESC-PAGE OCCURS 4 TIMES
                              INDEXED BY PAGE-INDEX, LAST-PAGE-INDEX.
               10  FULL-DESC-LINE OCCURS 12 TIMES
                                  INDEXED BY LINE-INDEX.
                 15 FULL-DESC-LINE-MANUF.
                   20 FILLER             PIC X(1).
                   20 FULL-DESC-LINE-P1  PIC X(1).
                   20 FULL-DESC-LINE-SEL PIC X(1).
                   20 FULL-DESC-LINE-P2  PIC X(1).
                   20 FILLER             PIC X(1).
                   20 FULL-DESC-LINE-MFR PIC X(26).
                   20 FILLER             PIC X(1).
                   20 FULL-DESC-LINE-TYPE PIC X(3).
                   20 FILLER             PIC X(1).
                   20 FULL-DESC-LINE-PARTNO       PIC X(20).
                   20 FILLER             PIC X(23).
                 15 FULL-DESC-LINE-KWM REDEFINES FULL-DESC-LINE-MANUF.
      *************20 FILLER             PIC X(1).
                   20 FULL-DESC-LINE-KW  PIC X(20).
                   20 FILLER             PIC X(1).
                   20 FULL-DESC-LINE-MOD PIC X(30).
                   20 FILLER             PIC X(28).
                 15 TECH-LINE          REDEFINES FULL-DESC-LINE-MANUF.
                   20 TL-LIT             PIC X(18).
                   20 FILLER             PIC X(4).
                   20 TL-DATE-LIT        PIC X(14).
                   20 FILLER             PIC X.
                   20 TL-DATE.
                      25  TL-1-6         PIC X(6).
                      25  TL-7-8         PIC X(2).
                      25  TL-9-10        PIC X(2).
                   20 FILLER             PIC X(4).
                   20 TL-USER-LIT        PIC X(7).
                   20 FILLER             PIC X.
                   20 TL-USER            PIC X(8).

       01  FULL-DESC-TBL-PARMS.
           05  NUM-LINES-FULL-DESC       PIC S9(2) VALUE +0.
           05  NUM-FULL-PAGES            PIC S9(2) VALUE +0.
           05  NUM-LINES-LAST-PAGE       PIC S9(2) VALUE +0.

       COPY CFINPTYP   IN COPYLIB.
       COPY TDATECHK   IN COPYLIB.
       COPY SONORDER   IN COPYLIB.
       COPY TBLOWUP    IN COPYLIB.
       COPY CDESC      IN COPYLIB.
       COPY TSHWRDFM   IN COPYLIB.
       COPY DISPDAT2   IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.
       COPY CATREAD    IN COPYLIB.
       COPY CFINDJCW   IN COPYLIB.
       COPY TCHKBLKT   IN COPYLIB.

       01  TOTAL-ONDOCK     PIC S9(8)    VALUE ZEROS.

      *------ ARGUMENT PARMS FOR PO INQUIRY
       01  PO-ARGUMENT-VALUES.
           05  ARG-PLT              PIC X(4)   VALUE SPACES.
           05  ARG-PO               PIC X(14)  VALUE SPACES.
           05  ARG-VEN              PIC X(10)  VALUE SPACES.
           05  ARG-REQ              PIC X(12)  VALUE SPACES.
           05  ARG-CODE             PIC X(7)   VALUE SPACES.
       01  SAVE-POINQ-AREA.
           05  SAVE-COMPANY         PIC X(3)   VALUE SPACE.
           05  SAVE-ITEM-NUMBER     PIC 9(4)   VALUE ZEROS.
           05  SAVE-CORPCODE        PIC X(7)   VALUE SPACE.
           05  SAVE-PO-COUNT        PIC 9(2)   VALUE ZEROS.
       01  BASE-STHIST              PIC X(10)  VALUE SPACES.
       01  ERR-SW                   PIC X(1)   VALUE SPACES.
       01  HISTORY-INDIC            PIC X(1)   VALUE SPACES.

       01  STR-USAGE                PIC S9(9) VALUE ZERO.
       01  USAGE-SWITCH             PIC X(1)   VALUE "S".
           88  STR-DISPLAY                     VALUE "S".
           88  TOT-DISPLAY                     VALUE "T".

      *------ PARMS FOR CALL TO 'QCMDEXC': EXECUTE A COMMAND
       01  COMMAND-WORK                  PIC X(70).
       01  COMMAND-LEN      PIC S9(10)V9(5) COMP-3 VALUE 70.

      *01  COMMAND-AREA.
      *    05  COMMAND-IMAGE.
      *        10  COMMAND          PIC X(81).
      *        10  FILLER           PIC X  VALUE %15.
      *    05  COMMAND-ERROR        PIC 9(4)   COMP-4 VALUE 0.
      *    05  COMMAND-PARM         PIC 9(4)   COMP-4 VALUE 0.
      *************************************************************
      **                                                         **
      **      V I E W   C O M M U N I C A T I O N   A R E A      **
      **                                                         **
      *************************************************************

      ***  FOR VIEW COMAREA, SEE LINKAGE SECTION

       01  TERMFILENAME                  PIC X(11)    VALUE SPACES.

       01  FORMFILE.
           05  FORM-FNAME                PIC X(8)  VALUE "FMTLSTAT".
           05  FILLER                    PIC X     VALUE ".".
           05  FORM-GNAME.
               10  FORM-GNAME1           PIC X(5)  VALUE "FLANG".
               10  FORM-GNAME2           PIC X(3)  VALUE SPACES.
           05  FILLER                    PIC X(19) VALUE SPACES.

       01  SAVE-VIEW-LASTKEY             PIC S9(4) COMP-4 VALUE ZEROS.

       COPY HMSGBUF IN COPYLIB.

       01  MESSAGE-BUFLEN                PIC S9(4)  VALUE 76   COMP-4.

       01  MESSAGE-ACTLEN                PIC S9(4)  VALUE ZERO COMP-4.

       01  FIELD-NUMBER                  PIC S9(4)  VALUE 1    COMP-4.

       01  SCREEN-PRINT-PARMS.
           05  PRINTCNTL                 PIC S9(4)  VALUE ZERO COMP-4.
           05  PAGECNTL                  PIC S9(4)  VALUE 49   COMP-4.
           05  SPOOLFIL-OPEN-SW          PIC X        VALUE "N".

       01  HOLD-KM-LINE.
           05  HOLD-KW-MOD               PIC X(50).
           05  FILLER                    PIC X.
           05  HOLD-AUTH-LIT             PIC X(28).

      *************************************************
      *                                               *
      *   SCREEN BUFFER AREAS                         *
      *                                               *
      *************************************************

       01  DE-FIELDS-1.
           05  DE-COMP-1                 PIC X(4).
           05  DISP-CODE-1               PIC X(12).
           05  MSG-LINE1-1               PIC X(65).
           05  MSG-LINE2-1               PIC X(65).
           05  MSG-LINE3-1               PIC X(65).
           05  MSG-LINE4-1               PIC X(65).
           05  DE-COMMAND-LINE-1         PIC X(79).
           05  DE-MESSAGE-LINE-1         PIC X(79).

       01  DE-FIELDS-2.
           05  DE-COMP-2                 PIC X(3).
           05  DISP-INFO-2               PIC X(34).
           05  DISP-CODE-2               PIC X(7).
           05  DISP-LOC-CODE             PIC X(12).
           05  DISP-CLASS                PIC X(4).
           05  DISP-DEFAULT-DEPT         PIC X(6).
           05  DISP-DESC-3 OCCURS 4 TIMES.
               10  DISP-DESC-LINE-3      PIC X(79).
           05  DISP-UM                   PIC X(2).
           05  HEAD-CF                   PIC X(9).
           05  DISP-ONHAND               PIC --------9.
           05  DISP-LOC1                 PIC X(12).
           05  DISP-LOC1-ONHAND          PIC --------9.
           05  HEAD-UM1                  PIC X(3).
           05  DISP-UM1                  PIC XX.
           05  DISP-UM1-CF               PIC Z(5)9.9(4).
           05  DISP-RESERVED             PIC --------9.
           05  DISP-LOC2                 PIC X(12).
           05  DISP-LOC2-ONHAND          PIC --------9.
           05  HEAD-UM2                  PIC X(3).
           05  DISP-UM2                  PIC XX.
           05  DISP-UM2-CF               PIC Z(5)9.9(4).
           05  DISP-AVAIL                PIC --------9.
           05  DISP-LOC3                 PIC X(12).
           05  DISP-LOC3-ONHAND          PIC --------9.
           05  DISP-STR-ONORDER          PIC --------9.
           05  DISP-LOC4                 PIC X(12).
           05  DISP-LOC4-ONHAND          PIC --------9.
CY1772*------- INCLUDE UNIT COST ON FMTLSTAT2 SCREEN.
CY1772     05  DISP-UNIT-COST            PIC Z(10)9.9(4).
CY1772     05  DISP-UNIT-COST-X  REDEFINES  DISP-UNIT-COST
CY1772                                   PIC X(16).
           05  DISP-DIR-ONORDER          PIC --------9.
           05  DISP-LOC5                 PIC X(12).
           05  DISP-LOC5-ONHAND          PIC --------9.
****************
DCR01      05  DISP-ARIBA-FLAG           PIC X.
****************
           05  DISP-TOT-ONORDER          PIC --------9.
           05  DISP-TOT-RED REDEFINES DISP-TOT-ONORDER
                                         PIC X(9).
           05  DISP-LOC6                 PIC X(12).
           05  DISP-LOC6-ONHAND          PIC --------9.
           05  DISP-ONDOCK               PIC --------9.
           05  DISP-ONDOCK-ERROR  REDEFINES DISP-ONDOCK  PIC X(9).
           05  DISP-AVG-COST             PIC Z(10)9.9(4).
           05  DISP-PO-NUM               PIC X(7).
           05  DISP-RLSE                 PIC X(3).
           05  DISP-PO-BUYER             PIC X(15).
           05  DISP-REQ-NUM              PIC X(12).
           05  DISP-REQ-DATE             PIC X(8).
           05  DISP-DISP-INSTRUCT        PIC X(30) VALUE SPACES.
           05  DISP-REPAIR               PIC X(18) VALUE SPACES.
           05  DISP-STOCK-OUT            PIC X(16) VALUE SPACES.
           05  DISP-HIGH-USAGE           PIC X(12) VALUE SPACES.
           05  DISP-BLKT-MSG             PIC X(58) VALUE SPACES.
           05  DE-COMMAND-LINE-2         PIC X(79).
           05  DE-MESSAGE-LINE-2         PIC X(79).

       01  DE-FIELDS-3.
           05  DE-COMP-3                 PIC X(3).
           05  DISP-INFO-3               PIC X(34).
           05  DISP-CODE-3               PIC X(7).
           05  DISP-UM-3                 PIC X(2).
           05  DISP-WD                   PIC X.
           05  DISP-OE                   PIC X.
           05  DISP-MR                   PIC X.
           05  DISP-OR                   PIC X.
           05  DISP-INS                  PIC X.
           05  DISP-IMPORT-IND           PIC X.
           05  DISP-SO                   PIC X.
           05  DISP-CONS                 PIC X.
           05  DISP-SA                   PIC X.
           05  DISP-RW                   PIC X.
           05  DISP-OV                   PIC X.
           05  DISP-ONHAND-3             PIC --------9.
           05  DISP-ADD-DATE             PIC X(8).
           05  DISP-ORIGINATOR           PIC X(10).
           05  DISP-MAX                  PIC --------9.
           05  DISP-ISS-DATE             PIC X(8).
           05  DISP-LAST-EMPL            PIC X(4).
           05  DISP-CHARGE-DEPT          PIC X(10).
           05  DISP-REORDER              PIC --------9.
           05  DISP-ACT-DATE             PIC X(8).
           05  DISP-LAST-EMPL-NAME       PIC X(16).
           05  DISP-EXPEDITE             PIC --------9.
           05  DISP-PHY-DATE             PIC X(8).
           05  DISP-PHY-CYCLE            PIC ----9.
           05  DISP-SOQ                  PIC --------9.
           05  DISP-STD-COST             PIC Z(10)9.9(4).
           05  DISP-EST-LT               PIC ----9.
           05  DISP-EOQ                  PIC --------9.
           05  DISP-MKT-COST             PIC Z(10)9.9(4).
           05  DISP-MKT-COST-X  REDEFINES  DISP-MKT-COST
                                         PIC X(16).
           05  DISP-OUT-REP-COST         PIC Z(10)9.9(4).
           05  DISP-ACT-LT-1             PIC ----9.
           05  DISP-ACT-LT-2             PIC ----9.
           05  DISP-ACT-LT-3             PIC ----9.
           05  DISP-USAGE-LIT            PIC X(60).
           05  DISP-JAN-USAGE            PIC --------9.
           05  DISP-FEB-USAGE            PIC --------9.
           05  DISP-MAR-USAGE            PIC --------9.
           05  DISP-APR-USAGE            PIC --------9.
           05  DISP-MAY-USAGE            PIC --------9.
           05  DISP-JUN-USAGE            PIC --------9.
           05  DISP-JUL-USAGE            PIC --------9.
           05  DISP-AUG-USAGE            PIC --------9.
           05  DISP-SEP-USAGE            PIC --------9.
           05  DISP-OCT-USAGE            PIC --------9.
           05  DISP-NOV-USAGE            PIC --------9.
           05  DISP-DEC-USAGE            PIC --------9.
           05  DISP-AVG-MTH-USAGE        PIC --------9.
           05  DISP-MTD-USAGE            PIC --------9.
           05  DISP-LT-12-MTH-USAGE      PIC --------9.
           05  DISP-USED-YTDY            PIC --------9.
           05  DISP-MTD-RECEIPTS         PIC --------9.
           05  DISP-LT-12-MTH-RECEIPTS   PIC --------9.
           05  DISP-RECD-YTDY            PIC --------9.
           05  DE-COMMAND-LINE-3         PIC X(79).
           05  DE-MESSAGE-LINE-3         PIC X(79).

       01  DE-FIELDS-4.
           05  DE-COMP-4                 PIC X(3).
           05  DISP-CODE-4               PIC X(7).
           05  DISP-DESC-TBL.
               10  DISP-DESC-LINE OCCURS 12 TIMES
                                    INDEXED BY SUB-4
                                         PIC X(79).
           05  DESC-MSG                  PIC X(58).
           05  DE-COMMAND-LINE-4         PIC X(79).
           05  DE-MESSAGE-LINE-4         PIC X(79).


      *********************************************
      **          SCREEN ADDITIONS               **
      *********************************************

       01  MORE-AVAIL-MSG                PIC X(79) VALUE SPACES.
       01  REPAIR-MSG                    PIC X(18) VALUE SPACES.
       01  TRM-RLSE-MSG                  PIC X(58) VALUE SPACES.
       01  BKWD-REVIEW-MSG               PIC X(58) VALUE SPACES.
       01  BKWD-FRWD-REVIEW-MSG          PIC X(58) VALUE SPACES.
       01  FRWD-REVIEW-MSG               PIC X(58) VALUE SPACES.

      *01  FLIP-FLOP-SCREEN.
      *    05  FILLER                    PIC X     VALUE %33.
      *    05  FILLER                    PIC X(5)  VALUE "&w11F".
      *
       01  AKRON-INSTRUCT-LINE1          PIC X(65) VALUE SPACES.
       01  AKRON-INSTRUCT-LINE2          PIC X(65) VALUE SPACES.
       01  AKRON-INSTRUCT-LINE3          PIC X(65) VALUE SPACES.
       01  AKRON-INSTRUCT-LINE4          PIC X(65) VALUE SPACES.

       01  SUB-PLT-INSTRUCT-LINE1        PIC X(65) VALUE SPACES.
       01  SUB-PLT-INSTRUCT-LINE2        PIC X(65) VALUE SPACES.
       01  SUB-PLT-INSTRUCT-LINE3        PIC X(65) VALUE SPACES.

       01  AKRON-INST-SCREEN-1B-LINE1    PIC X(65) VALUE SPACES.
       01  AKRON-INST-SCREEN-1B-LINE2    PIC X(65) VALUE SPACES.

      **************************************************************
      **                                                          **
      **            D A T A B A S E   W O R K                     **
      **                                                          **
      **************************************************************

       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X  VALUE "0".
           05  FILE-STATUS-2             PIC X  VALUE "0".

       01  BASE-AREA.
           05  BASE-DEF OCCURS 9 TIMES.
               10  BASES.
                   15  BASE-NAME         PIC X(9).
                   15  BASE-GROUP        PIC X(9).
               10  BASE-PLT              PIC X(3).
               10  BASE-PLT-DESC         PIC X(4).
               10  FILLER                PIC X.

       01  RETURN-BASE                   PIC X(9).

       01  HOME-BASE                     PIC X(20) VALUE SPACES.

       01  DSET-NAMES.
           05  DSET-MSTORERM             PIC X(16)  VALUE "MSTORERM;".
           05  DSET-DDESC                PIC X(16)  VALUE "DDESC;".
           05  DSET-DDESC2               PIC X(16)  VALUE "DDESC2;".
           05  DSET-DMANPART             PIC X(16)  VALUE "DMANPART;".

       01  ITEM-LISTS.
           05  ALL-ITEM-LIST             PIC XX   VALUE "@;".
           05  CODE-SEARCH               PIC X(10) VALUE "CORP-CODE;".
           05  PO-SEARCH                 PIC X(10) VALUE "PO-RCV-NO;".

       01  ARG-VALUES.
           05  CODE-ARG                  PIC X(8)  VALUE SPACES.
           05  PLT-ARG                   PIC X(4)  VALUE SPACES.
           05  PO-ARG.
               10  FILLER                PIC X     VALUE "P".
               10  ARG-PO-NUM            PIC X(7).
               10  ARG-RLSE              PIC X(3).
               10  FILLER                PIC X(3)  VALUE "000".

           05  HIST-PO-ARG.
               10  HIST-PO-NUM           PIC X(7).
               10  HIST-RLSE             PIC X(3).
               10  FILLER                PIC X(3)  VALUE "000".
               10  FILLER                PIC X     VALUE SPACES.
           05  EMPL-ARG                  PIC X(6)  VALUE SPACES.

       01  MODE-AREA.
           05  MODE1                  PIC S9(4)   COMP       VALUE 1.
           05  MODE4                  PIC S9(4)   COMP       VALUE 4.
           05  MODE5                  PIC S9(4)   COMP       VALUE 5.
           05  MODE7                  PIC S9(4)   COMP       VALUE 7.

      **************************************************************
      **                                                          **
      **             D A T A B A S E   B U F F E R S              **
      **                                                          **
      **************************************************************
       COPY MSTORERM IN COPYLIB.
       COPY DDESC    IN COPYLIB.
       COPY DDESC2   IN COPYLIB.
       COPY DMANPART IN COPYLIB.
       COPY DPORECD  IN COPYLIB.
       COPY DPORECDH IN COPYLIB.
       01 BUF-PER-PERSONNEL.  COPY MPERSONL IN COPYLIB.
       COPY DTECHBUL IN COPYLIB.

       COPY DCOMPL   IN COPYLIB.

       COPY MPLT0    IN COPYLIB.
       COPY MPLTSAP  IN COPYLIB.

       COPY DBSTAT IN COPYLIB.

       01  BLKT-FOUND-MSG                PIC X(58).

      **************************************************************
      **                                                          **
      **               K S A M   W O R K                          **
      **                                                          **
      **************************************************************

       01  KEY-VALUE                     PIC X(8)  VALUE SPACES.
       01  KEY-LOC                       PIC S9(4) COMP-4 VALUE 3.
       01  RECSIZE                       PIC S9(4) COMP-4 VALUE ZEROS.
       01  RESULT                        PIC 9(4)  VALUE ZEROS.

       01  BUF-USAGEFIL.
           05  FILLER                    PIC XX.
           05  K-CORP-CODE               PIC X(8).
           05  K-MONTHS                  OCCURS 14 TIMES.
               10  K-MTH-USAGE           PIC S9(9) COMP-4.
           05  K-MONTHS-DD               OCCURS 14 TIMES.
               10  K-MTH-USAGE-DD        PIC S9(9) COMP-4.

       01  BUF-RECEIPTFIL.
           05  R-CORP-CODE               PIC X(8).
           05  R-MONTHS                  OCCURS 14 TIMES.
               10  R-MTH-RECEIPTS        PIC S9(9) COMP-4.

       01  FILE-TABLE.
           05  FILENUMBER                PIC S9(4) COMP-4 VALUE 0.
           05  FILENAME                  PIC X(8)  VALUE SPACES.
           05  I-O-TYPE                  PIC S9(4) COMP-4 VALUE 0.
           05  A-MODE                    PIC S9(4) COMP-4 VALUE 1.
           05  PREV-OP                   PIC S9(4) COMP-4 VALUE 0.

       01  KSAM-STATUS.
           05  K-STAT-1                  PIC X.
           05  FILLER                    PIC X.

       01  KSAM-FILE-EQUATE.
           05  FILLER                    PIC X(5)  VALUE "FILE ".
           05  KSAM-FILE                 PIC X(8)  VALUE SPACES.
           05  FILLER                    PIC X(10) VALUE "=USAGEFIL.".
           05  KSAM-EQUATE-GRP           PIC X(8)  VALUE SPACES.

       01  KSAM-FILE-TABLE.
           05  KSAM-FILETABLE-AREA OCCURS 9 TIMES.
               10  FILENUMBERS           PIC S9(4)  COMP-4.
               10  FILENAMES             PIC X(8).
               10  KSAM-GROUP            PIC X(8).

       01  SAVE-FILENUMBER               PIC S9(4)  COMP-4 VALUE ZEROS.

      **************************************************************
      **                                                          **
      **            L I N K A G E   S E C T I O N                 **
      **                                                          **
      **************************************************************

       LINKAGE SECTION.
       01  BASE                          PIC X(20).

       COPY VCOMLINK IN COPYLIB.
       01  MPLTINFO-COMP                 PIC X(4).

       01  PASSED-SPOOL-PRT              PIC S9(2) COMP-4.
       01  PASSED-CODE                   PIC X(7).

      ********************************
      * NATIVE LANGUAGE SUPPORT AREA *
      ********************************

       COPY LANGSUB IN COPYLIB.

       PROCEDURE DIVISION USING BASE, VIEW-COMAREA,
           MPLTINFO-COMP, PASSED-SPOOL-PRT, PASSED-CODE,
           LANGUAGE-PARMS.

       PROC-DIV SECTION.
       BEGIN-HERE.
           MOVE 1                        TO  SAVE-PARA-NUMBER.
           PERFORM 1-HSK  THRU  1-H-X.
           PERFORM 6-INQ-MATL  THRU  6-IM-X.
           PERFORM 2-EOJ  THRU  2-EOJ-X.
           GOBACK.

       1-HSK.
           MOVE 66                       TO  RECSIZE.
           MOVE "USAGEFIL"               TO  FILENAME.
           MOVE 2                        TO  SAVE-PARA-NUMBER.

           MOVE 0 TO DESC-SUB, DB-SUB, PAGE-CTR.
           MOVE "N"                      TO  FIRST-FORM-GOT-FLAG.
           MOVE "N"                      TO  OVERRIDE-DB-FLAG.
           MOVE 0 TO NUM-LINES-FULL-DESC, NUM-FULL-PAGES,
             NUM-LINES-LAST-PAGE.

DCR02**------------------------------------------------------------
DCR02**-- CHECK MPLTINFO TO SEE IF THIS PLAN IS ARIBA ENABLED
DCR02**-- KEY = "ARIB" (USED TO SET CODE FILTER LENGTH)
DCR02**------------------------------------------------------------
DCR02      SET ARIBA-ENABLED-NO        TO TRUE.
DCR02      MOVE WS-ARIBA-ENABLED-KEY   TO  WS-ZMPLT-KEY.

DCR02      PERFORM ZMPLT-GET-MPLTINFO  THRU ZMPLT-EXIT.
DCR02      MOVE WS-ZMPLT-FILE-STATUS  TO  FILE-STATUS.
DCR02      IF  FILE-STATUS = "00"
DCR02          SET ARIBA-ENABLED-YES   TO TRUE
DCR02      END-IF.

           PERFORM 9999-OPEN-STUFF.

           MOVE MPLTINFO-COMP            TO  DE-COMP-1,
                                              DISP-CODE-2,
                                              DE-COMP-2,
                                              DE-COMP-3,
                                              DE-COMP-4.

           MOVE "TMTLSTAT"               TO  BU-PGM-NAME.
           MOVE BASE                     TO  HOME-BASE.
           MOVE MPLTINFO-COMP            TO  SRF-MPLTINFO-COMPANY,
                                              COMPANY-SAVE.
           MOVE 13009                    TO  CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER           TO  MORE-AVAIL-MSG.

           MOVE 09013                    TO  CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER           TO  REPAIR-MSG.

           MOVE 16090                    TO  CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER           TO  BKWD-REVIEW-MSG.

           MOVE 16091                    TO  CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER           TO  BKWD-FRWD-REVIEW-MSG.

           MOVE 16092                    TO  CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER           TO  FRWD-REVIEW-MSG.

           MOVE 20054                    TO  CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER           TO  AKRON-INSTRUCT-LINE1.

           MOVE 16093                    TO  CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER           TO  AKRON-INSTRUCT-LINE2.

           MOVE 16094                    TO  CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER           TO  AKRON-INSTRUCT-LINE3.

           MOVE 16095                    TO  CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER           TO  AKRON-INSTRUCT-LINE4.

           MOVE 20055                    TO  CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER           TO  SUB-PLT-INSTRUCT-LINE1.

           MOVE 20056                    TO  CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER           TO  SUB-PLT-INSTRUCT-LINE2.

           MOVE 16095                    TO  CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER           TO  SUB-PLT-INSTRUCT-LINE3.

           MOVE 16113                    TO  CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO AKRON-INST-SCREEN-1B-LINE1.

           MOVE 06018                    TO  CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO AKRON-INST-SCREEN-1B-LINE2.

           MOVE 03154                    TO  CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER           TO  BLKT-FOUND-MSG.

      *------ CHECK JCW THAT TELLS IF THEY ARE ALLOWED TO SEE MARKET
      *------ COST OF ITEMS
           MOVE "PRICE;"                 TO  JCW-NAME.
           MOVE 258                      TO  JCW-STARTING-POS.
           CALL "CFINDJCW" USING JCW-PARMS.

      ******** 19JUN91 REPLACED THE FOLLOWING STMT. PRICE
      ******** WILL BE SHOWN UNLESS THE JCW IS SPECIFICALLY
      ******** SET TO "N".  DAP.
      *****MOVE JCW-YES-NO               TO  PO-PRICE-SW.

           IF JCW-VALUE(1) IS EQUAL TO "0"
               MOVE "N" TO PO-PRICE-SW
           ELSE
               MOVE "Y" TO PO-PRICE-SW.

      *------ CHECK JCW THAT TELLS IF THEY ARE ALLOWED TO SEE COST/
      *------ USAGE INFORMATION.
           MOVE "COST;"                  TO  JCW-NAME.
           MOVE 309                      TO  JCW-STARTING-POS.
           CALL "CFINDJCW" USING JCW-PARMS.

           IF JCW-VALUE(1) IS EQUAL TO "0"
               MOVE "N" TO COST-USAGE-SW
           ELSE
               MOVE "Y" TO COST-USAGE-SW.

           MOVE SPACES                   TO  BASE-AREA.
           MOVE 1                        TO  DB-SUB.
           OPEN INPUT PLANT-FILE.
           MOVE "N"                      TO  EOF-FLAG
           PERFORM UNTIL EOF-FLAG = "Y"
               READ PLANT-FILE AT END
                   MOVE "Y"              TO  EOF-FLAG
               END-READ
               IF EOF-FLAG = "N"
                   MOVE PLANT-ID         TO  BASE-PLT    (DB-SUB)
                   MOVE PLANT-HOMEGRP2   TO  BASE-GROUP  (DB-SUB)
                   MOVE PLANT-USAGEFIL   TO  FILENAMES   (DB-SUB)
                   MOVE 0                TO  FILENUMBERS (DB-SUB)
                   MOVE "  STORES."      TO  BASE-NAME   (DB-SUB)
                   MOVE PLANT-DESC       TO  BASE-PLT-DESC (DB-SUB)
                   ADD 1                 TO  DB-SUB
               END-IF
           END-PERFORM.
           CLOSE PLANT-FILE.

           IF DB-SUB  - 1 > 1
              MOVE "Y"                   TO  MULTIPLE-DB-PLANT.

           MOVE ZERO TO SUB.
           PERFORM 14 TIMES
               ADD 1 TO SUB
               MOVE ZERO TO K-MTH-USAGE (SUB)
           END-PERFORM.

           MOVE "SAP " TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               IF MPLTINFO-SAP-HIDE-Q1-SW = "Y"
                   MOVE "Y"              TO  SAP-PLANT-SW.

       1-H-X.
           EXIT.

       2-EOJ.
           MOVE 3                        TO  SAVE-PARA-NUMBER.

           IF OVERRIDE-DB-FLAG = "Y"
               PERFORM 9100-RESET-DB THRU 9190-RD-X.

           PERFORM 9999-CLOSE-STUFF.

       2-EOJ-X.
           EXIT.

       2100-BLOWUP.
           MOVE SAVE-PARA-NUMBER         TO  BU-DISPLAY-PARA.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, KSAM-STATUS, BU-DISPLAY-MSG,
               BU-DISPLAY-AREA.


       6-INQ-MATL.

      **************************************************************
      **                                                          **
      **        C O R P   C O D E   E N T R Y   S C R E E N       **
      **                                                          **
      **************************************************************

       61-WRITE-SCREEN-1.
           MOVE 5                        TO  SAVE-PARA-NUMBER.

           IF OVERRIDE-DB-FLAG = "Y"
               PERFORM 9100-RESET-DB THRU 9190-RD-X.

           IF PASSED-CODE > SPACES
               MOVE PASSED-CODE          TO  DISP-CODE-1, CODE-ARG
               MOVE SPACES               TO  PASSED-CODE
               MOVE COMPANY-SAVE         TO  DE-COMP-1,
                                      COMP-SCREEN-INDIC
               GO TO 61-GET-CORP-CODE-DESC.

       61-GETNEXTFORM.
           MOVE "FMTLSTAT1"              TO  VIEW-NFNAME.
           PERFORM 9999-GETNEXTFORM.
           MOVE "Y"                      TO  FIRST-FORM-GOT-FLAG.

           MOVE SPACES                   TO  DE-FIELDS-1.

           IF MORE-THAN-ONE-DB
               MOVE AKRON-INSTRUCT-LINE1 TO  MSG-LINE1-1
               MOVE AKRON-INSTRUCT-LINE2 TO  MSG-LINE2-1
               MOVE AKRON-INSTRUCT-LINE3 TO  MSG-LINE3-1
               MOVE SPACES               TO  MSG-LINE4-1
           ELSE
               MOVE SUB-PLT-INSTRUCT-LINE1  TO  MSG-LINE1-1
               MOVE SUB-PLT-INSTRUCT-LINE2  TO  MSG-LINE2-1
               MOVE SPACES               TO  MSG-LINE3-1.

           MOVE COMPANY-SAVE             TO  DE-COMP-1,
                                        COMP-SCREEN-INDIC.

           PERFORM 9999-PUTBUFFER-1.
           PERFORM 9999-PUTWINDOW.
      **************************************************************
      **   FROM THE CORP CODE ENTRY SCREEN, THE USER HAS THE      **
      **   FOLLOWING OPTIONS -                                    **
      **     1.  END PROGRAM                                      **
      **     2.  ENTER CODE, THUS AUTOMATICALLY BRINGING UP BASIC **
      **         INQUIRY SCREEN                                   **
      **************************************************************

       61-READ-SCREEN-1.
           MOVE 6                        TO  SAVE-PARA-NUMBER.
      *----- f1 f2, APPLICATION, f3 f6 f7 INVALID, f4 REFRESH, f5 PRT,
      *----- 'ENTER' IS VALID
           MOVE "I"                      TO  SRF-FKEY (7).
           MOVE 5                        TO  SRF-KEYSET.
           PERFORM 9999-DO-SCREEN-1.

           IF VIEW-LASTKEY = EXIT-PROGRAM
               GO TO 6-IM-X.

           MOVE VIEW-LASTKEY             TO  SAVE-VIEW-LASTKEY.
      *----- FOR AKRON PLANT, THE DEFAULT IS f1
           IF MORE-THAN-ONE-DB
               IF SAVE-VIEW-LASTKEY = 0
                   MOVE 1                TO  SAVE-VIEW-LASTKEY.

      *---------- IF CORP CODE IS NOT NUMERIC (NOT 7 DIGITS), THERE
      *           IS A CHANCE THE USER COULD BE ENTERING AN "ALTERNATE
      *           KEY".  THEREFORE, CHECK ALT KEY DATASET BEFORE
      *           CONTINUING.

           MOVE DISP-CODE-1              TO  ALT-KEY-ARG.
           CALL "TALTKEY" USING RET-CODE, BASE, STATUS-AREA,
             ALT-KEY-ARG ALT-CORP-CODE.
           MOVE ALT-CORP-CODE            TO  DISP-CODE-1.
           IF RET-CODE NOT = "00"
               MOVE "TALTKEY ERROR 61-GB1" TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

      *****************************************************
      *                                                   *
      *   IF THE COMPANY IS AN AKRON PLANT AND THE 'f1'   *
      *   KEY IS PRESSED THEN BRING UP THE BASIC INQURIY  *
      *   SCREEN FOR THE CODE IN ITS HOME DATA BASE       *
      *   IF THE 'f2' IS PRESSED THEN BRING UP THE OVERALL*
      *   INQUIRY SCREEN FOR ALL DATA BASES IN THE AKRON  *
      *   COMPLEX PLT 1,2,3,5                             *
      *   IF ALL THE DATA BASES HAVE NOT BEEN OPEN YET    *
      *   THEN OPEN THE DATA BASES                        *
      *                                                   *
      *****************************************************

           IF MORE-THAN-ONE-DB AND SAVE-VIEW-LASTKEY = 2
               GO TO 67-WRITE-OVERALL-DB-SCREEN.

      *    "NOW GETTING DATA"
           MOVE 14063                    TO  CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE 76                       TO  MESSAGE-ACTLEN.
           PERFORM 9999-PUTWINDOW.
           PERFORM 9999-SHOWFORM.

       61-GET-CORP-CODE-DESC.
           MOVE 81                       TO  SAVE-PARA-NUMBER.
           MOVE DISP-CODE-1              TO  CODE-ARG.
           PERFORM 9999-GETKEY-MSTORERM-CD-I.
           IF NO-ENTRY
             IF FIRST-FORM-GOT-FLAG = "Y"
               MOVE 19009                TO  CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 1                    TO  SRF-ERROR-FLD
               GO TO 61-READ-SCREEN-1
             ELSE
               GO TO 61-GETNEXTFORM.

           IF STR-STATE = "F"
                   MOVE 03161            TO  CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER   TO  DISP-INFO-2 DISP-INFO-3
           ELSE
               MOVE SPACES               TO  DISP-INFO-2 DISP-INFO-3.

           MOVE 5                        TO  CDESC-LINES-TO-GET.
           MOVE "N"                      TO  CDESC-LOCAL-DESC-OPTION.
           CALL "CDESC" USING CDESC-RET-CODE, BASE, STATUS-AREA,
             BU-DISPLAY-MSG, CODE-ARG, CDESC-DATA.
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               PERFORM 2100-BLOWUP.

      *------- IF AUTHORIZATION FLAG IS SET, DISPLAY LITERAL ON SCREEN.
           IF STR-AUTH-FLAG = "X"
               MOVE SPACES               TO  HOLD-KM-LINE
               MOVE CDESC (1)            TO  HOLD-KW-MOD
               MOVE 16182                TO  CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER       TO  HOLD-AUTH-LIT
               MOVE HOLD-KM-LINE         TO  DISP-DESC-LINE-3 (1)
           ELSE
           MOVE CDESC (1)                TO  DISP-DESC-LINE-3 (1).
           MOVE CDESC (2)                TO  DISP-DESC-LINE-3 (2).
           MOVE CDESC (3)                TO  DISP-DESC-LINE-3 (3).
           IF CDESC-LINES-GOT > 4
               MOVE MORE-AVAIL-MSG       TO  DISP-DESC-LINE-3 (4)
           ELSE
               MOVE CDESC (4)            TO  DISP-DESC-LINE-3 (4).

       62-GET-CODE.
           MOVE 9                        TO  SAVE-PARA-NUMBER.
      **************************************************************
      **   EACH TIME A NEW CORP CODE HAS BEEN ENTERED AND         **
      **   VALIDATED, WE MOVE ALL THE DATA INTO EACH SCREEN.      **
      **   NOTE THAT SCREEN-4 DATA (MORE DESC) IS "FOUND" AND     **
      **   "GOT" EACH TIME THE USER GOES TO THAT SCREEN.          **
      **************************************************************

           PERFORM 70-MOVE-DE-FIELDS-2.
           PERFORM 71-MOVE-DE-FIELDS-3 THRU 71-M-DE-F-X.

      ********************************************
      *                                          *
      *  CHECK IF THIS CODE IS ON A BLANKET BY   *
      *  CALLING SUBROUTINE 'TCHKBLKT'. IT WILL  *
      *  RETURN A MSG IN 'TRM-RLSE-MSG' IF IT IS *
      *  ON A BLANKET OTHERWISE 'TRM-RLSE-MSG'   *
      *  WILL BE SPACES. THIS MSG IS PRINTED ON  *
      *  THE FIRST CODE INQUIRY SCREEN           *
      *                                          *
      ********************************************

           MOVE ZEROS                    TO  TOTAL-BLANKET-COUNT.
           MOVE SPACES                   TO  R11-SMALL-PO
                                             R11-LARGE-PO.
           CALL "TCHKBLKT" USING BASE,
                                 CODE-ARG,
                                 CHKBLKT-PARMS.

           IF TOTAL-BLANKET-COUNT > ZEROS
               MOVE BLKT-FOUND-MSG       TO  DISP-BLKT-MSG.

      *--------- SHOULD TECH. BULLETIN LITERAL BE DISPLAYED ON SCREEN?
           IF DTECHBUL-SW = "Y"
               PERFORM 9999-CHAINHD-DTECHBUL-I
               IF FILE-STATUS = "00"
                   MOVE "Y" TO SHOW-LIT-SW
               ELSE
                   MOVE "N" TO SHOW-LIT-SW.

           IF SHOW-LIT-SW = "N" AND DCOMPL-SW = "Y"
               PERFORM 9999-CHAINHD-DCOMPL-I
               IF FILE-STATUS = "00"
                   MOVE "Y" TO SHOW-LIT-SW
               ELSE
                   MOVE "N" TO SHOW-LIT-SW.

      **************************************************************
      **                                                          **
      **        B A S I C   I N Q U I R Y   S C R E E N           **
      **                                                          **
      **************************************************************

       62-WRITE-SCREEN-2.
           IF COST-USAGE-SW = "N"
               MOVE 90                   TO  SRF-ERROR-FLD.

           MOVE 10                       TO  SAVE-PARA-NUMBER.
           MOVE "FMTLSTAT2"              TO  VIEW-NFNAME.
           PERFORM 9999-GETNEXTFORM.

           MOVE COMP-SCREEN-INDIC        TO  DE-COMP-2.
           PERFORM 9999-PUTWINDOW.

      **************************************************************
      **   FROM THE BASIC INQUIRY SCREEN, THE USER HAS THE        **
      **   FOLLOWING OPTIONS -                                    **
      **     1.  END THE PROGRAM.                                 **
      **     2.  ENTER A NEW CORP CODE (GO TO SCREEN-1)           **
      **     3.  BRING UP THE RESERVATION INQUIRY SCREEN          **
      **     4.  BRING UP SCREEN TO SEE MORE LINES OF DESC        **
      **     5.  BRING UP MORE INQUIRY FIELDS SCREEN              **
      **     6.  INQUIRY THE LAST PO   (12/18/96 96-042)          **
      **************************************************************

      *----- f1,f2,f4,f6,f7,f8 APPLICATION, f3 INVALID, f5 PRT, 'ENTER' INVALID
           MOVE 0                        TO  SRF-KEYSET.
           MOVE "I"                      TO  SRF-FKEY (HP-F3-KEY).
           MOVE "I"                      TO  SRF-ENTER-FLAG.
           PERFORM 9999-DO-SCREEN-2.
           MOVE SPACES                   TO  MESSAGE-BUFFER.
           IF VIEW-LASTKEY = EXIT-PROGRAM
               GO TO 6-IM-X
           ELSE
           IF VIEW-LASTKEY = EXIT-AREA
               GO TO 61-WRITE-SCREEN-1
           ELSE
           IF VIEW-LASTKEY = 6
               GO TO 68-WRITE-RESERVATION-SCREEN
           ELSE
           IF VIEW-LASTKEY = 5
               PERFORM 69-LAST-PO-INQUIRY THRU 69-EXIT
               MOVE SPACES TO HISTORY-INDIC
               IF MESSAGE-BUFFER NOT = SPACES
                   MOVE 1 TO SRF-ERROR-FLD
               END-IF
               GO TO 62-WRITE-SCREEN-2
           ELSE
           IF VIEW-LASTKEY = 4
               GO TO 64-WRITE-SCREEN-4
           ELSE
           IF VIEW-LASTKEY = 2
               GO TO 63-WRITE-SCREEN-3
           ELSE
           IF VIEW-LASTKEY = 1
               GO TO 66-WRITE-BLANKET-SCREEN.

      **************************************************************
      **                                                          **
      **    M O R E   I N Q U I R Y   F I E L D S   S C R E E N   **
      **                                                          **
      **************************************************************

       63-WRITE-SCREEN-3.
           IF COST-USAGE-SW = "N"
               MOVE 90                   TO  SRF-ERROR-FLD.

           MOVE 12                       TO  SAVE-PARA-NUMBER.
           IF SAP-PLANT-SW = "Y"
               MOVE "FMTLSTAT3S"         TO  VIEW-NFNAME
           ELSE
               MOVE "FMTLSTAT3"          TO  VIEW-NFNAME.
           PERFORM 9999-GETNEXTFORM.
           MOVE COMP-SCREEN-INDIC        TO  DE-COMP-3.
           PERFORM 9999-PUTWINDOW.
      **************************************************************
      **   FROM THE MORE INQUIRY FIELDS SCREEN, THE USER HAS THE  **
      **   OPTION TO END THE PROGRAM OR GO TO ANY OF THE OTHER    **
      **   4 SCREENS.                                             **
      **************************************************************
      *----- f1,f4,f6,f7,f8 APPLICATION, f2,f3 INVALID, f5 PRT, 'ENTER' INVALID
DP9802*    MOVE 4                        TO  SRF-KEYSET.
DP9802     MOVE 0                        TO  SRF-KEYSET.
           MOVE "I"                      TO  SRF-FKEY (HP-F3-KEY).
           MOVE "I"                      TO  SRF-ENTER-FLAG.
           PERFORM 9999-DO-SCREEN-3.
           MOVE SPACES                   TO  MESSAGE-BUFFER.
           IF VIEW-LASTKEY = EXIT-PROGRAM
               GO TO 6-IM-X
           ELSE
           IF VIEW-LASTKEY = EXIT-AREA
               GO TO 61-WRITE-SCREEN-1
           ELSE
           IF VIEW-LASTKEY = 6
               GO TO 68-WRITE-RESERVATION-SCREEN
           ELSE
DP9802     IF VIEW-LASTKEY = 5
DP9802         PERFORM 69-LAST-PO-INQUIRY THRU 69-EXIT
DP9802         MOVE SPACES TO HISTORY-INDIC
DP9802         IF MESSAGE-BUFFER NOT = SPACES
DP9802             MOVE 1 TO SRF-ERROR-FLD
DP9802         END-IF
DP9802         GO TO 63-WRITE-SCREEN-3
DP9802     ELSE
           IF VIEW-LASTKEY = 4
               GO TO 64-WRITE-SCREEN-4
           ELSE
           IF VIEW-LASTKEY = 2
               IF STR-DISPLAY
                   PERFORM 73-MOVE-TOT-USAGE THRU 73-EXIT
               ELSE
                   PERFORM 72-MOVE-STR-USAGE THRU 72-EXIT
               END-IF
               GO TO 63-WRITE-SCREEN-3.
           IF VIEW-LASTKEY = 1
               GO TO 62-WRITE-SCREEN-2.

      **************************************************************
      **                                                          **
      **         M O R E   D E S C R I P T I O N   S C R E E N    **
      **                                                          **
      **************************************************************

       64-WRITE-SCREEN-4.
           IF COST-USAGE-SW = "N"
               MOVE 90                   TO  SRF-ERROR-FLD.

           MOVE 14                       TO  SAVE-PARA-NUMBER.
           MOVE "FMTLSTAT4"              TO  VIEW-NFNAME.
           PERFORM 9999-GETNEXTFORM.
           MOVE SPACES                   TO  DE-FIELDS-4.
           MOVE CORP-CODE                TO  DISP-CODE-4.
           MOVE COMP-SCREEN-INDIC        TO  DE-COMP-4.

       64-FIND-DDESC.
           MOVE 15                       TO  SAVE-PARA-NUMBER.
           MOVE SPACES                   TO  FULL-DESC-TBL.
           MOVE  +0                      TO  NUM-LINES-FULL-DESC.
           SET PAGE-INDEX                TO  1.
           SET LINE-INDEX                TO  1.

           PERFORM 9999-CHAINHD-DMANPART-CD-I.
             PERFORM 83-GET-DMANPART THRU 83-GD-X
                UNTIL (NOT GOOD-CALL) OR NUM-LINES-FULL-DESC = 48.

           PERFORM 9999-CHAINHD-DDESC-CD-I.
           PERFORM 81-GET-DDESC THRU 81-GD-X
              UNTIL (NOT GOOD-CALL) OR NUM-LINES-FULL-DESC = 48.

           PERFORM 9999-CHAINHD-DDESC2-CD-I.
           MOVE SPACES                   TO  BUF-DDESC2
           PERFORM 82-GET-DDESC2 THRU 82-GD-X
              UNTIL (NOT GOOD-CALL) OR NUM-LINES-FULL-DESC = 48.

           IF DTECHBUL-SW = "Y"
               PERFORM 9999-CHAINHD-DTECHBUL-I
               PERFORM 84-GET-DTECHBUL THRU 84-GD-X
                  UNTIL (NOT GOOD-CALL) OR NUM-LINES-FULL-DESC = 48.

           IF DCOMPL-SW = "Y"
               PERFORM 9999-CHAINHD-DCOMPL-I
               PERFORM 85-GET-DCOMPL THRU 85-GD-X
                  UNTIL (NOT GOOD-CALL) OR NUM-LINES-FULL-DESC = 48.

           DIVIDE NUM-LINES-FULL-DESC BY 12
              GIVING NUM-FULL-PAGES
              REMAINDER NUM-LINES-LAST-PAGE.

           IF NUM-LINES-LAST-PAGE = 0
               IF NUM-FULL-PAGES = 0
      ***          NO DESCRIPTION ON FILE         ***
                   MOVE 14003            TO  CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER   TO  FULL-DESC-LINE (1, 1)
                   SET LAST-PAGE-INDEX   TO  1
               ELSE
                   SET LAST-PAGE-INDEX   TO  NUM-FULL-PAGES
           ELSE
               IF NUM-FULL-PAGES = 0
                   SET LAST-PAGE-INDEX   TO  1
               ELSE
                   SET LAST-PAGE-INDEX   TO  NUM-FULL-PAGES
                   SET LAST-PAGE-INDEX UP BY 1.

           SET PAGE-INDEX                TO  1.

       64-WRITE-MSG-LINE.
           MOVE 16                       TO  SAVE-PARA-NUMBER.
           IF PAGE-INDEX = 1
             IF PAGE-INDEX IS LESS THAN LAST-PAGE-INDEX
                 MOVE FRWD-REVIEW-MSG    TO  DESC-MSG
             ELSE
                 MOVE SPACES             TO  DESC-MSG
           ELSE
             IF PAGE-INDEX IS LESS THAN LAST-PAGE-INDEX
                 MOVE BKWD-FRWD-REVIEW-MSG        TO DESC-MSG
             ELSE
                 MOVE BKWD-REVIEW-MSG    TO  DESC-MSG.

       64-PUT-BUFFER.
           MOVE 17                       TO  SAVE-PARA-NUMBER.
           MOVE FULL-DESC-PAGE (PAGE-INDEX) TO DISP-DESC-TBL.

           PERFORM 9999-PUTWINDOW.
      *----- f1,f2,f3,f4,f6,f7,f8 APPLICATION, f5 PRT, 'ENTER' INVALID
DP9802*    MOVE 4                        TO  SRF-KEYSET.
DP9802     MOVE 0                        TO  SRF-KEYSET.
      *----- CANT GO BACKWARD IF AT BEGINNING, CANT GO FORWARD IF AT END.
           IF PAGE-INDEX = 1
               MOVE "I"                  TO  SRF-FKEY (HP-F3-KEY).
           IF PAGE-INDEX = LAST-PAGE-INDEX
               MOVE "I"                  TO  SRF-FKEY (4).
           MOVE "I"                      TO  SRF-ENTER-FLAG.
           PERFORM 9999-DO-SCREEN-4.
           MOVE SPACES                   TO  MESSAGE-BUFFER.
           IF VIEW-LASTKEY = EXIT-PROGRAM
               GO TO 6-IM-X
           ELSE
           IF VIEW-LASTKEY = EXIT-AREA
               GO TO 61-WRITE-SCREEN-1
           ELSE
           IF VIEW-LASTKEY = 6
               GO TO 68-WRITE-RESERVATION-SCREEN
           ELSE
DP9802     IF VIEW-LASTKEY = 5
DP9802         PERFORM 69-LAST-PO-INQUIRY THRU 69-EXIT
DP9802         MOVE SPACES TO HISTORY-INDIC
DP9802         IF MESSAGE-BUFFER NOT = SPACES
DP9802             MOVE 1 TO SRF-ERROR-FLD
DP9802         END-IF
DP9802         GO TO 64-WRITE-SCREEN-4
DP9802     ELSE
           IF VIEW-LASTKEY = 2
               GO TO 63-WRITE-SCREEN-3
           ELSE
           IF VIEW-LASTKEY = 1
               GO TO 62-WRITE-SCREEN-2
           ELSE
           IF VIEW-LASTKEY = HP-F3-KEY
               SET PAGE-INDEX DOWN BY 1
               GO TO 64-WRITE-MSG-LINE
           ELSE
           IF VIEW-LASTKEY = 4
               SET PAGE-INDEX UP BY 1
               GO TO 64-WRITE-MSG-LINE.

      ***********************************************
      *                                             *
      *   WRITE BLANKET INQUIRY SCREEN BY CALLING   *
      *   'TBLKTINQ' SUBROUTINE. IT WILL RETURN     *
      *   A VIEW-LASTKEY FROM A READ OF THE BLANKET *
      *   SCREEN. THIS VIEW-LASTKEY WILL DIRECT     *
      *   PROCESSING TO ANOTHER INQUIRY SCREEN      *
      *                                             *
      ***********************************************

       66-WRITE-BLANKET-SCREEN.
           MOVE 21                       TO  SAVE-PARA-NUMBER.
           CALL "TBLKINQ2" USING BASE,
                                 CODE-ARG,
                                 COMP-SCREEN-INDIC,
                                 VIEW-COMAREA,
                                 SCREEN-PRINT-PARMS,
                                 PASSED-SPOOL-PRT,
                                 LANGUAGE-PARMS
           IF VIEW-LASTKEY = 1
               GO TO 62-WRITE-SCREEN-2
           ELSE
           IF VIEW-LASTKEY = 2
               GO TO 63-WRITE-SCREEN-3
           ELSE
           IF VIEW-LASTKEY = 6
               GO TO 68-WRITE-RESERVATION-SCREEN
           ELSE
           IF VIEW-LASTKEY = EXIT-AREA
               GO TO 61-WRITE-SCREEN-1
           ELSE
           IF VIEW-LASTKEY = EXIT-PROGRAM
               GO TO 6-IM-X.

      *****************************************************************
      **                                                             **
      **    O V E R A L L   D A T A B A S E   I N Q U I R Y          **
      **                                                             **
      *****************************************************************
       67-WRITE-OVERALL-DB-SCREEN.
           MOVE 27                       TO  SAVE-PARA-NUMBER.
           MOVE DISP-CODE-1              TO  CODE-ARG.
           CALL "SMTALLDB" USING BASE, VIEW-COMAREA, MPLTINFO-COMP,
             PASSED-SPOOL-PRT, CODE-ARG, LANGUAGE-PARMS,
             BASE-AREA, RETURN-BASE.
           IF RETURN-BASE = "NOTFOUND"
      *------  STORES CODE DOES NOT EXIST IN ANY PLANT
               MOVE 19019                TO  CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 1                    TO  SRF-ERROR-FLD
               MOVE "FMTLSTAT1"          TO  VIEW-NFNAME
               GO TO 61-READ-SCREEN-1.

           IF VIEW-LASTKEY = EXIT-PROGRAM
               GO TO 6-IM-X
           ELSE
           IF VIEW-LASTKEY = EXIT-AREA
               GO TO 61-WRITE-SCREEN-1
           ELSE
           IF RETURN-BASE = SPACES
               GO TO 61-GET-CORP-CODE-DESC
           ELSE
               PERFORM 9000-POINT-DIFFERENT-DB THRU 9090-PDD-X
               GO TO 61-GET-CORP-CODE-DESC.

      ***********************************************
      *                                             *
      *   WRITE RESERVATION INQUIRY SCREEN BY CALL- *
      *   ING 'TRSRVINQ' SUBROUTINE.  IT WILL RETURN*
      *   A VIEW-LASTKEY FROM A READ OF THIS SCREEN.*
      *   THIS VIEW-LASTKEY WILL DIRECT THE PRO-    *
      *   CESSING TO ANOTHER INQUIRY SCREEN.        *
      *                                             *
      ***********************************************

       68-WRITE-RESERVATION-SCREEN.
           MOVE 32                       TO  SAVE-PARA-NUMBER.
           CALL "TRSRVINQ" USING BASE,
                                 CODE-ARG,
                                 COMP-SCREEN-INDIC,
                                 VIEW-COMAREA,
                                 SCREEN-PRINT-PARMS,
                                 PASSED-SPOOL-PRT,
                                 FATAL-ERR-SW,
                                 BU-DISPLAY-MSG,
                                 LANGUAGE-PARMS.

           IF FATAL-ERR-SW  =  "Y"
               MOVE "TRSRVINQ ERROR IN 68-W-R-SCREEN"
                                         TO  BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.
           IF VIEW-LASTKEY = 1
               GO TO 62-WRITE-SCREEN-2
           ELSE
           IF VIEW-LASTKEY = 2
               GO TO 63-WRITE-SCREEN-3
           ELSE
           IF VIEW-LASTKEY = 4
               GO TO 64-WRITE-SCREEN-4
           ELSE
           IF VIEW-LASTKEY = EXIT-AREA
               GO TO 61-WRITE-SCREEN-1
           ELSE
           IF VIEW-LASTKEY = EXIT-PROGRAM
               GO TO 6-IM-X.

DP9802*----- BLOCK THE PROGRAM FROM FALLING THROUGH INTO THE NEXT
DP9802*----- PARAGRAPH.
           GO TO 6-IM-X.

       69-LAST-PO-INQUIRY.
      *----VERIFY-PO-EXISTENCE.
           MOVE "N"  TO  ERR-SW.
           PERFORM 691-CHECK-STORES-DB  THRU  691-EXIT.
           IF ERR-SW = "Y"
               GO TO 69-EXIT.

       69-PO-HEADER-SUBPGM.
           IF HISTORY-INDIC = "X"
               GO TO 69-PO-HEADER-HISTORY-SUBPGM.

           MOVE PLT-ARG TO ARG-PLT.
           MOVE PO-ARG  TO ARG-PO.
           CALL "TPOINQH" USING  BASE,
                                 SCREEN-PRINT-PARMS,
                                 PASSED-SPOOL-PRT,
                                 VIEW-COMAREA,
                                 PO-ARGUMENT-VALUES,
                                 SAVE-POINQ-AREA,
                                 LANGUAGE-PARMS.
           IF VIEW-LASTKEY EQUAL 2
               CALL "TPOINQI" USING  BASE,
                                     SCREEN-PRINT-PARMS,
                                     PASSED-SPOOL-PRT,
                                     VIEW-COMAREA,
                                     PO-ARGUMENT-VALUES,
                                     SAVE-POINQ-AREA,
                                     LANGUAGE-PARMS
               IF VIEW-LASTKEY EQUAL 1
                   GO TO  69-PO-HEADER-SUBPGM
               ELSE
                   GO TO  69-EXIT
           ELSE
               GO TO  69-EXIT.

       69-PO-HEADER-HISTORY-SUBPGM.
           MOVE PLT-ARG TO ARG-PLT.
           MOVE HIST-PO-ARG  TO ARG-PO.
           CALL "SPOINQHH" USING BASE,
                                 BASE-STHIST,
                                 SCREEN-PRINT-PARMS,
                                 PASSED-SPOOL-PRT,
                                 VIEW-COMAREA,
                                 PO-ARGUMENT-VALUES,
                                 SAVE-POINQ-AREA,
                                 LANGUAGE-PARMS.
           IF VIEW-LASTKEY EQUAL 2
               CALL "SPOINQIH" USING BASE,
                                     BASE-STHIST,
                                     SCREEN-PRINT-PARMS,
                                     PASSED-SPOOL-PRT,
                                     VIEW-COMAREA,
                                     PO-ARGUMENT-VALUES,
                                     SAVE-POINQ-AREA,
                                     LANGUAGE-PARMS
               IF VIEW-LASTKEY EQUAL 1
                   GO TO 69-PO-HEADER-HISTORY-SUBPGM.
       69-EXIT.
           EXIT.

       691-CHECK-HISTORY-DB.
           MOVE STR-LAST-PO          TO  HIST-PO-NUM.
           MOVE STR-LAST-RLSE        TO  HIST-RLSE.
           MOVE HIST-PO-ARG TO PORCVNO OF DPORECD-REC-I-H.
           START DPORECD-I-H KEY = PORCVNO OF DPORECD-REC-I-H
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
      *            ***  PO DOES NOT EXIST  ***
                   MOVE  16045 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE "Y"  TO  ERR-SW
               ELSE
                   MOVE "FIND DPORECD 691-CHD" TO BU-DISPLAY-MSG
                   GO TO 2100-BLOWUP
           ELSE
               MOVE "X"             TO  HISTORY-INDIC.

       691H-EXIT.
           EXIT.

       691-CHECK-STORES-DB.
           MOVE STR-LAST-PO              TO  ARG-PO-NUM.
           MOVE STR-LAST-RLSE            TO  ARG-RLSE.
           MOVE PO-ARG TO PORCVNO OF DPORECD-REC-I.
           START DPORECD-I KEY = PORCVNO OF DPORECD-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   PERFORM 691-CHECK-HISTORY-DB  THRU  691H-EXIT
                   IF ERR-SW = "Y"
      *                ***  PO DOES NOT EXIST  ***
                       MOVE  16045 TO CATREAD-MSG-NUMBER
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       GO TO 691-EXIT
                   ELSE
                       GO TO 691-EXIT
               ELSE
                   MOVE "START DPORECD*691-CSD"  TO  BU-DISPLAY-MSG
                   GO TO 2100-BLOWUP.

       691-EXIT.
           EXIT.


       70-MOVE-DE-FIELDS-2.
           MOVE 33                       TO  SAVE-PARA-NUMBER.
           MOVE SPACES                   TO  DISP-DISP-INSTRUCT
                                          DISP-REPAIR
                                          DISP-STOCK-OUT
                                          DISP-HIGH-USAGE
                                          DISP-BLKT-MSG.
           MOVE CORP-CODE                TO  DISP-CODE-2.
***************
DCR01      MOVE CORP-CODE                TO  WS-ARIBA-CORPCODE.
DCR01      PERFORM  9999-READK-ARIBA-CATALOG  THRU 9999-READK-EXIT.
DCR01      MOVE WS-ARIBA-ITEM-SW         TO  DISP-ARIBA-FLAG.
***************
           MOVE STR-PREV-CODE            TO  DISP-LOC-CODE.
           MOVE STR-CLASS                TO  DISP-CLASS.
           MOVE STR-DFLT-DEPT            TO  DISP-DEFAULT-DEPT.
           MOVE "ALT UM CF"              TO  HEAD-CF.
           MOVE "UM1"                    TO  HEAD-UM1.
           MOVE "UM2"                    TO  HEAD-UM2.
           MOVE STR-UM                   TO  DISP-UM.
           MOVE STR-UM1                  TO  DISP-UM1.
           MOVE STR-UM2                  TO  DISP-UM2.
           MOVE STR-UM1-CF               TO  DISP-UM1-CF.
           MOVE STR-UM2-CF               TO  DISP-UM2-CF.
           MOVE STR-ONHAND               TO  DISP-ONHAND.
           MOVE STR-LOC (1)              TO  DISP-LOC1.
           MOVE STR-LOC-ONHAND (1)       TO  DISP-LOC1-ONHAND.
           MOVE STR-LOC (2)              TO  DISP-LOC2.
           MOVE STR-LOC-ONHAND (2)       TO  DISP-LOC2-ONHAND.
           MOVE STR-LOC (3)              TO  DISP-LOC3.
           MOVE STR-LOC-ONHAND (3)       TO  DISP-LOC3-ONHAND.
           MOVE STR-LOC (4)              TO  DISP-LOC4.
           MOVE STR-LOC-ONHAND (4)       TO  DISP-LOC4-ONHAND.
           MOVE STR-LOC (5)              TO  DISP-LOC5.
           MOVE STR-LOC-ONHAND (5)       TO  DISP-LOC5-ONHAND.
           MOVE STR-LOC (6)              TO  DISP-LOC6.
           MOVE STR-LOC-ONHAND (6)       TO  DISP-LOC6-ONHAND.
           MOVE STR-RESERVED             TO  DISP-RESERVED.
           SUBTRACT STR-RESERVED FROM STR-ONHAND GIVING DISP-AVAIL.
      ***********************************
      **  CALL 'SONORDER' TO GET TOTAL
      **  ONORDER IN STOREROOM UM
      ***********************************
           MOVE "Y"                      TO  SONORDER-CALC-DIR-ORD-SW.
           CALL "SONORDER" USING BASE,
                                 CODE-ARG,
                                 SONORDER-PARMS,
                                 COMPANY-SAVE,
                                 STATUS-AREA,
                                 BU-DISPLAY-MSG,
                                 BU-DISPLAY-FLDS.
           IF BU-DISPLAY-MSG NOT = SPACES
                MOVE "    ERROR"         TO  DISP-TOT-RED
                MOVE ZEROES              TO  DISP-STR-ONORDER
                                                DISP-DIR-ONORDER
                MOVE SPACES              TO  BU-DISPLAY-MSG
                MOVE ALL "0"             TO  BU-DISPLAY-AREA
           ELSE
           IF COMPANY-SAVE-1-2 = "11"
               MOVE SONORDER-TOTAL-ONORDER  TO  DISP-STR-ONORDER
               MOVE ZEROS                TO  DISP-DIR-ONORDER
               MOVE SONORDER-TOTAL-ONORDER  TO  DISP-TOT-ONORDER
           ELSE
               MOVE SONORDER-STR-ONORDER TO  DISP-STR-ONORDER
               MOVE SONORDER-DIR-ONORDER TO  DISP-DIR-ONORDER
               MOVE SONORDER-TOTAL-ONORDER  TO  DISP-TOT-ONORDER.
      ***********************************
      **  CALL 'SONDOCK' TO GET TOTAL
      **  ONDOCK IN STOREROOM UM
      ***********************************
           CALL "SONDOCK"  USING BASE,
                                 CODE-ARG,
                                 TOTAL-ONDOCK
                                 STATUS-AREA,
                                 BU-DISPLAY-MSG,
                                 BU-DISPLAY-FLDS.
           IF BU-DISPLAY-MSG NOT = SPACES
                MOVE "    ERROR"         TO  DISP-ONDOCK-ERROR
                MOVE SPACES              TO  BU-DISPLAY-MSG
                MOVE ALL "0"             TO  BU-DISPLAY-AREA
           ELSE
                MOVE TOTAL-ONDOCK        TO  DISP-ONDOCK.
           MOVE STR-LAST-PO              TO  DISP-PO-NUM
                                             ARG-PO-NUM.
           MOVE STR-LAST-RLSE            TO  DISP-RLSE
                                             ARG-RLSE.
           MOVE PO-ARG TO PORCVNO OF DPORECD-REC-I.
           READ DPORECD-I INTO BUF-DPORECD
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
      *----------- IF NOT IN THE LIVE DATABASE, SEARCH HISTORY.
               MOVE SPACES               TO  DISP-PO-BUYER
               MOVE ARG-PO-NUM           TO  HIST-PO-NUM
               MOVE ARG-RLSE             TO  HIST-RLSE
               MOVE HIST-PO-ARG TO PORCVNO OF DPORECD-REC-I-H
               READ DPORECD-I-H INTO BUF-DPORECD-H
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS = "00"
                   MOVE POH-BUYER        TO  DISP-PO-BUYER
               END-IF
           ELSE
               MOVE PO-BUYER             TO  DISP-PO-BUYER.
           MOVE STR-AVG-COST             TO  DISP-AVG-COST.
           MOVE STR-DISB-INSTR           TO  DISP-DISP-INSTRUCT.
           MOVE STR-HIGH-USAGE           TO  DISP-HIGH-USAGE.
           MOVE STR-LAST-REQ-NO          TO  DISP-REQ-NUM.
           MOVE STR-LAST-REQ-DATE        TO  DATE-VALIDATE-IN.
           MOVE 4                        TO  DATE-MODE.
           CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
           MOVE DATE-SLASH-OUT           TO  DISP-REQ-DATE.

      *************************************************
020807**   IF ITEM IS RESTRICTED                     **
020807**   PUT "RESTRICTED ITEM   " MESSAGE ON THE   **
020807**   SCREEN.                                   **
      **   IF ITEM IS MAINT REPAIR OR OUTSIDE REPAIR **
      **   PUT "ITEM IS REPAIRABLE" MESSAGE ON THE   **
      **   SCREEN.                                   **
      *************************************************

020807     IF STR-RESTRICTED-FLG = 'X'
020807        MOVE '** RESTRICTED ITEM' TO  DISP-REPAIR.

           IF STR-OUT-REP = "X" OR STR-MAINT = "X"
               MOVE REPAIR-MSG           TO  DISP-REPAIR.

      *************************************************
      **   IF ITEM IS STOCKOUT, PUT STOCKOUT MSG ON  **
      **   SCREEN.                                   **
      *************************************************

           IF STR-STOCK-OT = "X"
               MOVE 19001                TO  CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER       TO  DISP-STOCK-OUT.

       71-MOVE-DE-FIELDS-3.
           MOVE 34                       TO  SAVE-PARA-NUMBER.
           MOVE CORP-CODE                TO  DISP-CODE-3.
           MOVE STR-UM                   TO  DISP-UM-3.
           MOVE STR-WR-DOWN              TO  DISP-WD.
           MOVE STR-ORD-ENG              TO  DISP-OE.
           MOVE STR-MAINT                TO  DISP-MR.
           MOVE STR-OUT-REP              TO  DISP-OR.
           MOVE STR-INS-ITM              TO  DISP-INS.
           MOVE STR-IMPORT-IND           TO  DISP-IMPORT-IND.
           MOVE STR-STOCK-OT             TO  DISP-SO.
           MOVE STR-CONS-IND             TO  DISP-CONS.
           MOVE STR-SARA-REPORTABLE      TO  DISP-SA.
           MOVE STR-RESTRICTED-FLG       TO  DISP-RW.
           MOVE STR-REQ-CHG-OVERRD       TO  DISP-OV.
           MOVE STR-ONHAND               TO  DISP-ONHAND-3.
           MOVE STR-INIT-DATE            TO  DATE-VALIDATE-IN.
           MOVE 4                        TO  DATE-MODE.
           CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
           MOVE DATE-SLASH-OUT           TO  DISP-ADD-DATE.
           MOVE STR-AUTHOR               TO  DISP-ORIGINATOR.
           MOVE STR-MAX                  TO  DISP-MAX.
           MOVE STR-LAST-IDATE           TO  DATE-VALIDATE-IN.
           CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
           MOVE DATE-SLASH-OUT           TO  DISP-ISS-DATE.
           MOVE STR-LAST-CHARGE          TO  DISP-CHARGE-DEPT.
           MOVE STR-LAST-EMPL            TO  DISP-LAST-EMPL.
           MOVE STR-REORDER              TO  DISP-REORDER.
           MOVE STR-ACT-DATE             TO  DATE-VALIDATE-IN.
           CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
           MOVE DATE-SLASH-OUT           TO  DISP-ACT-DATE.
           PERFORM 9999-GET-MPERSONEL-I.
           MOVE STR-INV-DATE             TO  DATE-VALIDATE-IN.
           CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
           MOVE DATE-SLASH-OUT           TO  DISP-PHY-DATE.
           IF STR-PHY-INV-CYL NOT NUMERIC
               MOVE "0000"               TO  STR-PHY-INV-CYL.
           MOVE STR-PHY-INV-CYL          TO  INV-CYCLE-9.
           MOVE INV-CYCLE-9              TO  DISP-PHY-CYCLE.
           MOVE STR-EXPEDITE             TO  DISP-EXPEDITE.
           MOVE STR-STD-COST             TO  DISP-STD-COST.
           MOVE STR-EST-LT               TO  DISP-EST-LT.
           MOVE STR-SOQ                  TO  DISP-SOQ.
CY1772     MOVE STR-MKT-COST             TO  DISP-UNIT-COST.
           IF PO-PRICE-SW = "Y"
               MOVE STR-MKT-COST         TO  DISP-MKT-COST
           ELSE
               MOVE SPACES               TO  DISP-MKT-COST-X.
           MOVE STR-OUT-REPAIR-COST      TO  DISP-OUT-REP-COST.
           MOVE STR-LAST-DLVTIMES (1)    TO  DISP-ACT-LT-1.
           MOVE STR-LAST-DLVTIMES (2)    TO  DISP-ACT-LT-2.
           MOVE STR-LAST-DLVTIMES (3)    TO  DISP-ACT-LT-3.
           MOVE STR-MTH-FCST             TO  DISP-AVG-MTH-USAGE.
           MOVE STR-EOQ                  TO  DISP-EOQ.

           PERFORM 9999-GETKEY-USAGEFIL-CD-I.

           PERFORM 72-MOVE-STR-USAGE THRU 72-EXIT.
           MOVE K-MTH-USAGE (14)         TO  DISP-USED-YTDY.


           MOVE 0                        TO  DISP-MTD-RECEIPTS
                                             DISP-RECD-YTDY
                                             DISP-LT-12-MTH-RECEIPTS.

           PERFORM 9999-GETKEY-RECEIPTFIL-CD-I.
           IF COND-WORD NOT = 0
               GO TO 71-M-DE-F-X.

           MOVE R-MTH-RECEIPTS (13)      TO  DISP-MTD-RECEIPTS.
           MOVE R-MTH-RECEIPTS (14)      TO  DISP-RECD-YTDY.

           MOVE 0                        TO  YTD-TOTAL.
           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 12
               ADD R-MTH-RECEIPTS (SUB)  TO  YTD-TOTAL
           END-PERFORM.
           MOVE YTD-TOTAL                TO  DISP-LT-12-MTH-RECEIPTS.

       71-M-DE-F-X.                      EXIT.

       72-MOVE-STR-USAGE.
      *------STR USAGE IS TOTAL - DIRECT DELIVERY
           COMPUTE STR-USAGE = K-MTH-USAGE(1) - K-MTH-USAGE-DD(1).
           MOVE STR-USAGE                 TO DISP-JAN-USAGE.
           COMPUTE STR-USAGE = K-MTH-USAGE(2) - K-MTH-USAGE-DD(2).
           MOVE STR-USAGE                TO  DISP-FEB-USAGE.
           COMPUTE STR-USAGE = K-MTH-USAGE(3) - K-MTH-USAGE-DD(3).
           MOVE STR-USAGE                TO  DISP-MAR-USAGE.
           COMPUTE STR-USAGE = K-MTH-USAGE(4) - K-MTH-USAGE-DD(4).
           MOVE STR-USAGE                TO  DISP-APR-USAGE.
           COMPUTE STR-USAGE = K-MTH-USAGE(5) - K-MTH-USAGE-DD(5).
           MOVE STR-USAGE                TO  DISP-MAY-USAGE.
           COMPUTE STR-USAGE = K-MTH-USAGE(6) - K-MTH-USAGE-DD(6).
           MOVE STR-USAGE                TO  DISP-JUN-USAGE.
           COMPUTE STR-USAGE = K-MTH-USAGE(7) - K-MTH-USAGE-DD(7).
           MOVE STR-USAGE                TO  DISP-JUL-USAGE.
           COMPUTE STR-USAGE = K-MTH-USAGE(8) - K-MTH-USAGE-DD(8).
           MOVE STR-USAGE                TO  DISP-AUG-USAGE.
           COMPUTE STR-USAGE = K-MTH-USAGE(9) - K-MTH-USAGE-DD(9).
           MOVE STR-USAGE                TO  DISP-SEP-USAGE.
           COMPUTE STR-USAGE = K-MTH-USAGE(10) - K-MTH-USAGE-DD(10).
           MOVE STR-USAGE                TO  DISP-OCT-USAGE.
           COMPUTE STR-USAGE = K-MTH-USAGE(11) - K-MTH-USAGE-DD(11).
           MOVE STR-USAGE                TO  DISP-NOV-USAGE.
           COMPUTE STR-USAGE = K-MTH-USAGE(12) - K-MTH-USAGE-DD(12).
           MOVE STR-USAGE                TO  DISP-DEC-USAGE.
           COMPUTE STR-USAGE = K-MTH-USAGE(13) - K-MTH-USAGE-DD(13).
           MOVE STR-USAGE                TO  DISP-MTD-USAGE.

           MOVE 0                        TO  YTD-TOTAL.
           MOVE 0                        TO  SUB.
           PERFORM 12 TIMES
               ADD 1                     TO  SUB
               COMPUTE YTD-TOTAL = YTD-TOTAL +
                               (K-MTH-USAGE(SUB) - K-MTH-USAGE-DD(SUB))
           END-PERFORM.
           MOVE YTD-TOTAL                TO  DISP-LT-12-MTH-USAGE.
           MOVE
             "USAGE FOR ISSUES ONLY, F2 FOR ISSUES AND DIRECT DELIVERY."
             TO DISP-USAGE-LIT.
           MOVE "S" TO USAGE-SWITCH.
       72-EXIT.
           EXIT.

       73-MOVE-TOT-USAGE.
      *-----TOTAL USAGE INCLUDES STOREROOM AND DIRECT DELIVERY
           MOVE K-MTH-USAGE (1)          TO  DISP-JAN-USAGE.
           MOVE K-MTH-USAGE (2)          TO  DISP-FEB-USAGE.
           MOVE K-MTH-USAGE (3)          TO  DISP-MAR-USAGE.
           MOVE K-MTH-USAGE (4)          TO  DISP-APR-USAGE.
           MOVE K-MTH-USAGE (5)          TO  DISP-MAY-USAGE.
           MOVE K-MTH-USAGE (6)          TO  DISP-JUN-USAGE.
           MOVE K-MTH-USAGE (7)          TO  DISP-JUL-USAGE.
           MOVE K-MTH-USAGE (8)          TO  DISP-AUG-USAGE.
           MOVE K-MTH-USAGE (9)          TO  DISP-SEP-USAGE.
           MOVE K-MTH-USAGE (10)         TO  DISP-OCT-USAGE.
           MOVE K-MTH-USAGE (11)         TO  DISP-NOV-USAGE.
           MOVE K-MTH-USAGE (12)         TO  DISP-DEC-USAGE.
           MOVE K-MTH-USAGE (13)         TO  DISP-MTD-USAGE.

           MOVE 0                        TO  YTD-TOTAL.
           MOVE 0                        TO  SUB.
           PERFORM 12 TIMES
               ADD 1                     TO  SUB
               ADD K-MTH-USAGE (SUB)     TO  YTD-TOTAL
           END-PERFORM.
           MOVE YTD-TOTAL                TO  DISP-LT-12-MTH-USAGE.
           MOVE
             "USAGE FOR ISSUES AND DIRECT DELIVERY, F2 FOR ISSUES ONLY."
             TO DISP-USAGE-LIT.
           MOVE "T" TO USAGE-SWITCH.
       73-EXIT.
           EXIT.

       6-IM-X.
           EXIT.

       81-GET-DDESC.
           PERFORM 9999-GETNEXT-DDESC-CD-I.
           IF END-OF-CHAIN
               GO TO 81-GD-X.

           IF DESC-ID-NUM = "00"
               MOVE DESC-KW
                   TO FULL-DESC-LINE-KW (PAGE-INDEX, LINE-INDEX)
               MOVE DESC-MOD
                   TO FULL-DESC-LINE-MOD (PAGE-INDEX, LINE-INDEX)
           ELSE
               MOVE DESC-DATA
                   TO FULL-DESC-LINE (PAGE-INDEX, LINE-INDEX).

           ADD 1                         TO  NUM-LINES-FULL-DESC.

           IF LINE-INDEX IS LESS THAN 12
               SET LINE-INDEX UP BY 1
           ELSE
              IF PAGE-INDEX IS LESS THAN 4
                  SET PAGE-INDEX UP BY 1
                  SET LINE-INDEX         TO  1.

       81-GD-X.
           EXIT.

       82-GET-DDESC2.
           PERFORM 9999-GETNEXT-DDESC2-CD-I.
           IF END-OF-CHAIN
               GO TO 82-GD-X.

           IF DESC2-ID-NUM = "00"
               MOVE DESC2-KW
                   TO FULL-DESC-LINE-KW (PAGE-INDEX, LINE-INDEX)
               MOVE DESC2-MOD
                   TO FULL-DESC-LINE-MOD (PAGE-INDEX, LINE-INDEX)
           ELSE
               MOVE DESC2-DATA
                   TO FULL-DESC-LINE (PAGE-INDEX, LINE-INDEX).

           ADD 1                         TO  NUM-LINES-FULL-DESC.

           IF LINE-INDEX IS LESS THAN 12
               SET LINE-INDEX UP BY 1
           ELSE
               IF PAGE-INDEX IS LESS THAN 4
                   SET PAGE-INDEX UP BY 1
                   SET LINE-INDEX        TO  1.

       82-GD-X.
           EXIT.

       83-GET-DMANPART.
           PERFORM 9999-GETNEXT-DMANPART-CD-I.
           IF END-OF-CHAIN
               GO TO 83-GD-X.

           MOVE MAN-PARTNO-TYPE          TO  CFINPTYP-TYPE-DB.

           CALL "CFINPTYP" USING CFINPTYP-PARMS.
           MOVE "N"                      TO  CFINPTYP-1ST-CALL.

      *----- 11AUG1994 ADDED LOGIC FOR MAN-PARTNO-SELECT.
           IF MAN-PARTNO-SELECT NOT = SPACES
               MOVE "("
                   TO FULL-DESC-LINE-P1 (PAGE-INDEX, LINE-INDEX)
               MOVE MAN-PARTNO-SELECT
                   TO FULL-DESC-LINE-SEL (PAGE-INDEX, LINE-INDEX)
               MOVE ")"
                   TO FULL-DESC-LINE-P2 (PAGE-INDEX, LINE-INDEX).

           MOVE MAN-NAME
               TO FULL-DESC-LINE-MFR (PAGE-INDEX, LINE-INDEX).
           MOVE CFINPTYP-TYPE-SHORT
               TO FULL-DESC-LINE-TYPE (PAGE-INDEX, LINE-INDEX).
           MOVE MAN-PARTNO
               TO FULL-DESC-LINE-PARTNO (PAGE-INDEX, LINE-INDEX).

           ADD 1                         TO  NUM-LINES-FULL-DESC.

           IF LINE-INDEX IS LESS THAN 12
               SET LINE-INDEX UP BY 1
           ELSE
               IF PAGE-INDEX IS LESS THAN 4
                   SET PAGE-INDEX UP BY 1
                   SET LINE-INDEX        TO  1.

       83-GD-X.
           EXIT.

       84-GET-DTECHBUL.
           PERFORM 9999-GETNEXT-DTECHBUL-I.
           IF END-OF-CHAIN
               GO TO 84-GD-X.

           IF TECH-ID-NUM = "00"
      *--------- ADD A BLANK LINE BEFORE TECH. BULLETIN INFORMATION
               MOVE ALL "-"
                        TO  FULL-DESC-LINE (PAGE-INDEX, LINE-INDEX)
               ADD 1    TO  NUM-LINES-FULL-DESC
               IF LINE-INDEX IS LESS THAN 12
                   SET LINE-INDEX UP BY 1
               ELSE
                  IF PAGE-INDEX IS LESS THAN 4
                      SET PAGE-INDEX UP BY 1
                      SET LINE-INDEX         TO  1
                  END-IF
               END-IF
               MOVE "TECHNICAL BULLETIN"
                               TO  TL-LIT (PAGE-INDEX, LINE-INDEX)
               MOVE "LAST ACTIVITY:"
                               TO  TL-DATE-LIT (PAGE-INDEX, LINE-INDEX)
               MOVE "AUTHOR:"
                               TO  TL-USER-LIT (PAGE-INDEX, LINE-INDEX)
               MOVE TECH-LAST-ACT-YMD      TO  DATE-VALIDATE-IN
               MOVE 4                      TO  DATE-MODE
               CALL "TDATECHK" USING DATE-CHECK-AREA
               MOVE DATE-SLASH-OUT (1:6)
                                    TO  TL-1-6 (PAGE-INDEX, LINE-INDEX)
               MOVE TECH-LAST-ACT-CC
                                    TO  TL-7-8 (PAGE-INDEX, LINE-INDEX)
               MOVE DATE-SLASH-OUT (7:2)
                                    TO  TL-9-10 (PAGE-INDEX, LINE-INDEX)
               MOVE TECH-USERID
                               TO  TL-USER (PAGE-INDEX, LINE-INDEX)
           ELSE
               MOVE TECH-DATA
                   TO FULL-DESC-LINE (PAGE-INDEX, LINE-INDEX).

           ADD 1                         TO  NUM-LINES-FULL-DESC.

           IF LINE-INDEX IS LESS THAN 12
               SET LINE-INDEX UP BY 1
           ELSE
              IF PAGE-INDEX IS LESS THAN 4
                  SET PAGE-INDEX UP BY 1
                  SET LINE-INDEX         TO  1.

       84-GD-X.
           EXIT.

       85-GET-DCOMPL.
           PERFORM 9999-GETNEXT-DCOMPL-I.
           IF END-OF-CHAIN
               GO TO 85-GD-X.

           IF CMPL-ID-NUM = "00"
      *--------- ADD A BLANK LINE BEFORE COMPLIANCE REQMT INFORMATION
               MOVE ALL "-"
                        TO  FULL-DESC-LINE (PAGE-INDEX, LINE-INDEX)
               ADD 1    TO  NUM-LINES-FULL-DESC
               IF LINE-INDEX IS LESS THAN 12
                   SET LINE-INDEX UP BY 1
               ELSE
                  IF PAGE-INDEX IS LESS THAN 4
                      SET PAGE-INDEX UP BY 1
                      SET LINE-INDEX         TO  1
                  END-IF
               END-IF
               MOVE "COMPLIANCE REQMTS "
                               TO  TL-LIT (PAGE-INDEX, LINE-INDEX)
               MOVE "LAST ACTIVITY:"
                               TO  TL-DATE-LIT (PAGE-INDEX, LINE-INDEX)
               MOVE "AUTHOR:"
                               TO  TL-USER-LIT (PAGE-INDEX, LINE-INDEX)
               MOVE CMPL-LAST-ACT-YMD      TO  DATE-VALIDATE-IN
               MOVE 4                      TO  DATE-MODE
               CALL "TDATECHK" USING DATE-CHECK-AREA
               MOVE DATE-SLASH-OUT (1:6)
                                    TO  TL-1-6 (PAGE-INDEX, LINE-INDEX)
               MOVE CMPL-LAST-ACT-CC
                                    TO  TL-7-8 (PAGE-INDEX, LINE-INDEX)
               MOVE DATE-SLASH-OUT (7:2)
                                    TO  TL-9-10 (PAGE-INDEX, LINE-INDEX)
               MOVE CMPL-USERID
                               TO  TL-USER (PAGE-INDEX, LINE-INDEX)
           ELSE
               STRING CMPL-REG-BODY  "  "  CMPL-STANDARD
                        DELIMITED BY SIZE
                   INTO FULL-DESC-LINE (PAGE-INDEX, LINE-INDEX).

           ADD 1                         TO  NUM-LINES-FULL-DESC.

           IF LINE-INDEX IS LESS THAN 12
               SET LINE-INDEX UP BY 1
           ELSE
              IF PAGE-INDEX IS LESS THAN 4
                  SET PAGE-INDEX UP BY 1
                  SET LINE-INDEX         TO  1.

       85-GD-X.
           EXIT.

       9000-POINT-DIFFERENT-DB.
           MOVE "Y"                      TO  OVERRIDE-DB-FLAG.

           PERFORM 9999-CLOSE-STUFF.
      *------ OVERRIDE MSTORERM TO NEW DB LIBRARY
           STRING "OVRDBF FILE(MCFLCS0201) TOFILE(" DELIMITED BY SIZE,
             RETURN-BASE DELIMITED BY SPACES,
             "/MCFLCS0201) SHARE(*NO)" DELIMITED BY SIZE,
               INTO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

      *------ OVERRIDE DDESC TO NEW DB LIBRARY
           STRING "OVRDBF FILE(MCFLCS1401) TOFILE(" DELIMITED BY SIZE,
             RETURN-BASE DELIMITED BY SPACES,
             "/MCFLCS1401) SHARE(*NO)" DELIMITED BY SIZE,
               INTO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

      *------ OVERRIDE DDESC2 TO NEW DB LIBRARY
           STRING "OVRDBF FILE(MCFLCS3101) TOFILE(" DELIMITED BY SIZE,
             RETURN-BASE DELIMITED BY SPACES,
             "/MCFLCS3101) SHARE(*NO)" DELIMITED BY SIZE,
               INTO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

      *------ OVERRIDE DMANPART TO NEW DB LIBRARY
           STRING "OVRDBF FILE(MCFLCS3603) TOFILE(" DELIMITED BY SIZE,
             RETURN-BASE DELIMITED BY SPACES,
             "/MCFLCS3603) SHARE(*NO)" DELIMITED BY SIZE,
               INTO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

      *------ OVERRIDE DPOITEM TO NEW DB LIBRARY
           STRING "OVRDBF FILE(MCFLCS1001) TOFILE(" DELIMITED BY SIZE,
             RETURN-BASE DELIMITED BY SPACES,
             "/MCFLCS1001) SHARE(*NO)" DELIMITED BY SIZE,
               INTO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

      *------ OVERRIDE DPORECD TO NEW DB LIBRARY
           STRING "OVRDBF FILE(MCFLCS0901) TOFILE(" DELIMITED BY SIZE,
             RETURN-BASE DELIMITED BY SPACES,
             "/MCFLCS0901) SHARE(*NO)" DELIMITED BY SIZE,
               INTO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

      *------ OVERRIDE USAGEFIL TO NEW DB LIBRARY
           STRING "OVRDBF FILE(MCFLCSUSAG) TOFILE(" DELIMITED BY SIZE,
             RETURN-BASE DELIMITED BY SPACES,
             "/MCFLCSUSAG) SHARE(*NO)" DELIMITED BY SIZE,
               INTO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

      *------ OVERRIDE MPLTINFO TO NEW DB LIBRARY
           STRING "OVRDBF FILE(MCFLCS0501) TOFILE(" DELIMITED BY SIZE,
             RETURN-BASE DELIMITED BY SPACES,
             "/MCFLCS0501) SHARE(*NO)" DELIMITED BY SIZE,
               INTO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

      *------ OVERRIDE DRESERVE TO NEW DB LIBRARY
           STRING "OVRDBF FILE(MCFLCS1301) TOFILE(" DELIMITED BY SIZE,
             RETURN-BASE DELIMITED BY SPACES,
             "/MCFLCS1301) SHARE(*NO)" DELIMITED BY SIZE,
               INTO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

           PERFORM 9999-OPEN-STUFF.

       9090-PDD-X.
           EXIT.

       9100-RESET-DB.
           MOVE "N"                      TO  OVERRIDE-DB-FLAG.

           PERFORM 9999-CLOSE-STUFF.

           MOVE "DLTOVR FILE(MCFLCS0201)" TO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

           MOVE "DLTOVR FILE(MCFLCS1401)" TO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

           MOVE "DLTOVR FILE(MCFLCS3101)" TO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

           MOVE "DLTOVR FILE(MCFLCS3603)" TO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

           MOVE "DLTOVR FILE(MCFLCS1001)" TO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

           MOVE "DLTOVR FILE(MCFLCS0901)" TO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

           MOVE "DLTOVR FILE(MCFLCSUSAG)" TO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

           MOVE "DLTOVR FILE(MCFLCS0501)" TO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

           MOVE "DLTOVR FILE(MCFLCS1301)" TO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.
           PERFORM 9999-OPEN-STUFF.

       9190-RD-X.
           EXIT.

      *------ THIS VERSION OF CATREAD ASSUMES THE SET/MSG NUMBER
      *------ WILL BE IN CATREAD-MSG-NUMBER.
       999-CATREAD.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
           IF MESSAGE-BUFFER-1  = SPACES
               MOVE "* ERROR ON THIS FIELD *" TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.

      *----- COMMENTED OUT COPYLIB MEMBER BECAUSE ALL INDICATORS
      *----- ARE SET TO 0 AFTER THE SCREEN WRITE.  HOWEVER, IF THE
      *----- USER IS NOT AUTHORIZED TO COST & USAGE INFO., INDICATOR
      *----- 90 NEEDS TO BE ON FOR ALL SCREEN WRITES.
      *COPY SCRNCALL IN COPYLIB.

       9999-GETNEXTFORM.
       9999-PUTWINDOW.
       9999-INITFORM.
       9999-SHOWFORM.
       9999-SETKEYLABEL.
       998-WRITE-SCREEN.
           IF SRF-CURSOR-FLD > ZERO
               MOVE B"1" TO IND (SRF-CURSOR-FLD)
               MOVE ZERO TO SRF-CURSOR-FLD.
           IF COST-USAGE-SW = "N"
               MOVE B"1"                 TO  IND (90).
           IF SHOW-LIT-SW = "Y"
               MOVE B"1"                 TO  IND (91).
           IF SAP-PLANT-SW = "Y"
               MOVE B"1"                 TO  IND (80)
               IF VIEW-NFNAME = "FMTLSTAT2" OR VIEW-NFNAME = "FMTLSTAT4"
                   MOVE B"1"             TO  IND (90).
           WRITE DISPLAY-REC  FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

       998-READ-SCREEN.
           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO SRF-INDICATORS.

      *------ A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *------ IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.
           IF DISPLAY-STATUS NOT = "00"
               MOVE EXIT-PROGRAM TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.
           IF SRF-KEYSET = 1 OR 3 OR 5 OR 7
               MOVE "I" TO SRF-FKEY (7).
           IF SRF-KEYSET > 0
               MOVE "I" TO SRF-FKEY (5).
           IF SRF-KEYSET = 1 OR 2 OR 5 OR 6 OR 7 OR 8
               MOVE "I" TO SRF-FKEY (4).
           IF SRF-KEYSET = 5 OR 6
               MOVE "I" TO SRF-FKEY (8), SRF-FKEY (6)
           ELSE
           IF SRF-KEYSET = 7 OR 8
               MOVE "I" TO SRF-FKEY (1), SRF-FKEY (2), SRF-FKEY (8).
           MOVE SPACES TO MESSAGE-BUFFER-1.
           IF VIEW-LASTKEY = ENTER-KEY
               IF SRF-ENTER-FLAG = "I"
      *            "E28: 'ENTER' NOT VALID HERE"
                   MOVE 5 TO LANG-SETNUM
                   MOVE 28 TO LANG-MSGNUM
                   MOVE 05028 TO CATREAD-MSG-NUMBER
                   MOVE 1 TO SRF-ERROR-FLD
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               ELSE
                   NEXT SENTENCE
           ELSE
           IF SRF-FKEY (VIEW-LASTKEY) = "I"
      *        "I10: INVALID FUNCTION KEY"
               MOVE 9 TO LANG-SETNUM
               MOVE 10 TO LANG-MSGNUM
               MOVE 09010 TO CATREAD-MSG-NUMBER
               MOVE 1 TO SRF-ERROR-FLD
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           IF MESSAGE-BUFFER-1 = SPACES
               MOVE SPACES TO SRF-FKEY-AREA, SRF-ENTER-FLAG.
       9989-WS-X.
           EXIT.

       9999-RESET-SCREEN.
           MOVE B"1" TO IND(97).
           MOVE B"1" TO IND(96).

       COPY SCRNCL1  IN COPYLIB.
       COPY SCRNCL2  IN COPYLIB.
       COPY SCRNCL3  IN COPYLIB.
       COPY SCRNCL4  IN COPYLIB.

      *COPY GKMSTCDI IN C O P Y D B C S.
       9999-GETKEY-MSTORERM-CD-I.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-CD-REC-I.
           READ MSTORERM-CD-I INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MSTORERM-CD-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

      *COPY CHDMPCDI IN C O P Y D B C S.
       9999-CHAINHD-DMANPART-CD-I.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DMANPART-CD-REC-I.
           START DMANPART-CD-I KEY = CORPCDE OF DMANPART-CD-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DMANPART-CD-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

      *COPY CHDDSCDI IN C O P Y D B C S.
       9999-CHAINHD-DDESC-CD-I.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DDESC-CD-REC-I.
           START DDESC-CD-I KEY = CORPCDE OF DDESC-CD-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DDESC-CD-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

      *COPY CHDD2CDI IN C O P Y D B C S.
       9999-CHAINHD-DDESC2-CD-I.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DDESC2-CD-REC-I.
           START DDESC2-CD-I KEY = CORPCDE OF DDESC2-CD-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DDESC2-CD-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CHAINHD-DTECHBUL-I.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DTECHBUL-REC-I.
           START DTECHBUL-I KEY = CORPCDE OF DTECHBUL-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DTECHBUL-CD-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CHAINHD-DCOMPL-I.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DCOMPL-REC-I.
           START DCOMPL-I KEY = CORPCDE OF DCOMPL-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DCOMPL-CD-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

      *COPY GKUSECDI IN C O P Y D B C S.
       9999-GETKEY-USAGEFIL-CD-I.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF USAGEFIL-CD-REC-I.
           READ USAGEFIL-CD-I INTO BUF-USAGEFIL
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-GETKEY-RECEIPTFIL-CD-I.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF RECEIPTFIL-CD-REC-I.
           READ RECEIPTFIL-CD-I INTO BUF-RECEIPTFIL
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

      *COPY GNDDSCDI IN C O P Y D B C S.
       9999-GETNEXT-DDESC-CD-I.
           MOVE 0 TO COND-WORD.
           READ DDESC-CD-I NEXT INTO BUF-DDESC
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DDESC-CD-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF CORPCDE OF DDESC-CD-REC-I NOT = CODE-ARG
               MOVE 15 TO COND-WORD.

      *COPY GNDD2CDI IN C O P Y D B C S.
       9999-GETNEXT-DDESC2-CD-I.
           MOVE 0 TO COND-WORD.
           READ DDESC2-CD-I NEXT INTO BUF-DDESC2
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DDESC2-CD-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF CORPCDE OF DDESC2-CD-REC-I NOT = CODE-ARG
               MOVE 15 TO COND-WORD.

      *COPY GNDMPCDI IN C O P Y D B C S.
       9999-GETNEXT-DMANPART-CD-I.
           MOVE 0 TO COND-WORD.
           READ DMANPART-CD-I NEXT INTO BUF-DMANPART
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DMANPART-CD-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF CORPCDE OF DMANPART-CD-REC-I NOT = CODE-ARG
               MOVE 15 TO COND-WORD.

       9999-GETNEXT-DTECHBUL-I.
           MOVE 0 TO COND-WORD.
           READ DTECHBUL-I NEXT INTO BUF-DTECHBUL
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DTECHBUL-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF CORPCDE OF DTECHBUL-REC-I NOT = CODE-ARG
               MOVE 15 TO COND-WORD.

       9999-GETNEXT-DCOMPL-I.
           MOVE 0 TO COND-WORD.
           READ DCOMPL-I NEXT INTO BUF-DCOMPL
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DCOMPL-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF CORPCDE OF DCOMPL-REC-I NOT = CODE-ARG
               MOVE 15 TO COND-WORD.

       9999-GET-MPERSONEL-I.
           MOVE STR-LAST-EMPL        TO  EMPL-ARG.
           MOVE EMPL-ARG TO PERCCNUM OF PERSONNEL-REC-I.
           READ PERSONNEL-I INTO BUF-PER-PERSONNEL
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               MOVE PER-EMP-NAME     TO  DISP-LAST-EMPL-NAME
           ELSE
               MOVE SPACES           TO  DISP-LAST-EMPL-NAME.


DCR01 *****************************************************************
DCR01 ** READ BY KEY ARIBA CATALOG FILE
DCR01 *****************************************************************
DCR01  9999-READK-ARIBA-CATALOG.

DCR01      SET ARIBA-BUYER-ITEM-NO   TO TRUE.
DCR02      IF  ARIBA-ENABLED-NO
DCR02          GO TO 9999-READK-EXIT
DCR02      END-IF.


DCR01      INITIALIZE  ARIBA-CATALOG-REC.
DCR01      MOVE  WS-ARIBA-CORPCODE  TO ARIBACAT-CORP-CODE.

DCR01      READ  ARIBA-CATALOG-FILE
DCR01      END-READ.

DCR01      IF  FILE-STATUS = "00"
DCR01          SET   ARIBA-BUYER-ITEM-YES  TO TRUE
DCR01      END-IF.

DCR01  9999-READK-EXIT.
DCR01      EXIT.
DCR01 *****************************************************************

       9999-OPEN-STUFF.
      *COPY OPMSTCDI IN  C O P Y D B C S.
           OPEN INPUT MSTORERM-CD-I.
      *COPY OPDDSCDI IN  C O P Y D B C S.
           OPEN INPUT DDESC-CD-I.
      *COPY OPDD2CDI IN  C O P Y D B C S.
           OPEN INPUT DDESC2-CD-I.
      *COPY OPUSECDI IN  C O P Y D B C S.
           OPEN INPUT USAGEFIL-CD-I.
      *COPY OPDMPCDI IN  C O P Y D B C S.

DCR02      IF  ARIBA-ENABLED-YES
DCR02          OPEN INPUT ARIBA-CATALOG-FILE
DCR02      END-IF.

           OPEN INPUT DMANPART-CD-I.
           OPEN INPUT DPORECD-I.
           OPEN INPUT DPORECD-I-H.
           OPEN INPUT RECEIPTFIL-CD-I.
           OPEN INPUT PERSONNEL-I.
           OPEN INPUT DTECHBUL-I.
           IF FILE-STATUS NOT = "00"
               MOVE "N" TO DTECHBUL-SW
           ELSE
               MOVE "Y" TO DTECHBUL-SW.
           OPEN INPUT DCOMPL-I.
           IF FILE-STATUS NOT = "00"
               MOVE "N" TO DCOMPL-SW
           ELSE
               MOVE "Y" TO DCOMPL-SW.
           OPEN INPUT MPLTINFO-I.
      *COPY OPDISPL  IN  C O P Y C S I S.
           OPEN I-O DISPLAY-FILE.
      *COPY OPSTORES IN  C O P Y D B C S.
      *------ DUMMY ENTRY FOR STORES DATABASE OPEN

       9999-CLOSE-STUFF.
      *COPY CLMSTCDI IN  C O P Y D B C S.
           CLOSE MSTORERM-CD-I.
      *COPY CLDDSCDI IN  C O P Y D B C S.
           CLOSE DDESC-CD-I.
      *COPY CLDD2CDI IN  C O P Y D B C S.
           CLOSE DDESC2-CD-I.
      *COPY CLUSECDI IN  C O P Y D B C S.
           CLOSE USAGEFIL-CD-I.
      *COPY CLDMPCDI IN  C O P Y D B C S.
           CLOSE DMANPART-CD-I.
           CLOSE DPORECD-I.
           CLOSE DPORECD-I-H.
           CLOSE RECEIPTFIL-CD-I.
           CLOSE PERSONNEL-I.

DCR02      IF  ARIBA-ENABLED-YES
DCR02          CLOSE ARIBA-CATALOG-FILE
DCR02      END-IF.

           CLOSE DISPLAY-FILE.
           IF DTECHBUL-SW = "Y"
               CLOSE DTECHBUL-I.
           IF DCOMPL-SW = "Y"
               CLOSE DCOMPL-I.
           CLOSE MPLTINFO-I.
      *COPY CLSTORES IN  C O P Y D B C S.
      *------ DUMMY ENTRY FOR STORES DATABASE CLOSE

DCR02  COPY ZMPLTSUBR  IN COPYLIB.
