000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TPRNTWOS.
      *C
      *C  09/11/96  JEFF BUNGO
      *C     EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C     RECOMPILE TO PICK UP COPYLIB CHANGES.
      *C
      *C  01/04/2010  CA YODER  2010-00142425-001
      *C     UPDATE LOGIC ASSIGNING WORKORDER LETTER SUFFIX.
      *C
000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000600 SOURCE-COMPUTER.   AS400.
000700 OBJECT-COMPUTER.   AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZPLANNER-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT WO-BASIC-FILE
               ASSIGN TO DATABASE-MCFLMM1001
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WBF-STATUS.
           SELECT WO-LAST-NUM-USED
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ARG-NO
               FILE STATUS IS WLNU-STATUS.
           SELECT WO-PLANNED-FILE
               ASSIGN TO DATABASE-MCFLMM1101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WPF-STATUS.
000800 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).
       FD  WO-BASIC-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WBFREC.
       01  WBFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1001.
       FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WLNUREC.
       01  WLNUREC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.
       FD  WO-PLANNED-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFREC.
       01  WPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.
000900 WORKING-STORAGE SECTION.
001200 77  YEAR-D                     PIC X.
       77  SAVE-SUB1                  PIC S9(4) COMP-4.
001300 77  SUB1                       PIC S9(4) COMP-4.
001300 77  SUB2                       PIC S9(4) COMP-4.
      *---- 01/04/2010:  ADDED PARAMETER FOR CMMISYR.
       77  MMIS-LETTER                PIC X.
001400 01  ARG-NO                     PIC 9(9).
       COPY CATREAD IN COPYLIB.
       COPY CPYIND  IN COPYLIB.
001500 01  CONDIT-CODE                PIC X.
001600 01  CUR-DATE-WA.
002100     05  CUR-DATE-YR.
002200         10  FILLER             PIC X.
002300         10  CDY                PIC 9.
001700     05  CUR-DATE-MO            PIC 99.
001900     05  CUR-DATE-DA            PIC 99.
003000 01  DBPARAMETERS.       COPY DBPARMS OF COPYLIB.
003200 01  ERROR-BUFFER.
003300     05  ERR-1.
003400         10  ERR-LIT1           PIC X(19).
003500         10  ERR-WO             PIC X(10).
003600         10  FILLER             PIC X(51).
003700     05  ERR-2 REDEFINES ERR-1.
003800             10  ERR-LIT2       PIC X(29).
003900             10  ERR-WO2        PIC X(10).
004000             10  FILLER         PIC X(41).
004100 01  ERROR-SWITCH.
004200     05  ERROR-SW               PIC S9(4).
       01  FILE-STATUSES.
           05  DSPLY-STATUS           PIC XX.
           05  WBF-STATUS             PIC XX.
           05  WLNU-STATUS            PIC XX.
           05  WPF-STATUS             PIC XX.
       COPY IOFEEDBACK IN COPYLIB.
       COPY JCWAREA OF COPYLIB.
005300 01  LAST-WO-BUFF.       COPY MLASTWO OF COPYLIB.
005400 01  PASSWORD-INFORMATION.
005500     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TPRNTWOS".
005600     05  PROGRAM-TYPE        PIC X(02) VALUE "RE".
005700     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
005800     05  PROGRAM-DESCRIPTION.
005900         10  PROG-DESC-A.
                   15  FILLER      PIC X(13) VALUE " STAND-ALONE ".
                   15  FILLER      PIC X(17) VALUE "('WP') PRINT WORK".
                   15  FILLER      PIC X(17) VALUE " ORDERS EXECUTIVE".
                   15  FILLER      PIC X(13) VALUE " PROGRAM ".
006100         10  PROG-DESC-B     PIC X(60) VALUE SPACES.
006300         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
006500     05  PASSWORD-FLAG       PIC X.
006600 01  PLANT-ID                   PIC X(10).
006700 01  READ-AREA.
006800     05  READ-WOS OCCURS 20 TIMES.
006900         10  READ-WO-1-6        PIC X(6).
007000         10  READ-WO-7          PIC X.
007100         10  READ-WO-8-10       PIC XXX.
007200     05  READ-X                 PIC X.
           05  READ-CMD-LINE          PIC X(79).
           05  READ-ERR-LINE          PIC X(79).
007300 01  RET-MSG.
007400     05  FILLER  PIC X(22) VALUE SPACES.
007500     05  RET-WO  PIC X(10) VALUE SPACES.
007600     05  FILLER  PIC X(11) VALUE SPACES.
007700     05  FILLER  PIC X(35) VALUE SPACES.
       COPY DBSTAT OF COPYLIB.
       01  TRUE-VAL                   PIC 1 VALUE B"1".
       COPY VCOMLINK OF COPYLIB.
008400 01  WHO-VARIABLES.
009400     05  TERMNUM                PIC X(10).
008800     05  USERNAME.
008900         10  USERNAME-1-7       PIC X(7).
009000         10  FILLER             PIC XXX.
           05  USERLIB                PIC X(10).
           05  JOBLIBX                PIC X.
009600 01  WO-BASIC-DATA.      COPY DWOBASIC OF COPYLIB.
009700 01  WO-PLANNED-DATA.    COPY DWOPLAN OF COPYLIB.
       COPY WSCONTROL IN COPYLIB.
009900 PROCEDURE DIVISION.
010000 START-PGM.
010100     PERFORM 1-HSK.
010200     PERFORM 6-MAIN THRU 6-MAIN-LOOP.
010300 2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE WO-BASIC-FILE.
           CLOSE WO-LAST-NUM-USED.
           CLOSE WO-PLANNED-FILE.
011000     GOBACK.

011100 1-HSK.
           OPEN I-O    DISPLAY-FILE.
           OPEN INPUT  WO-BASIC-FILE.
           OPEN INPUT  WO-LAST-NUM-USED.
           OPEN INPUT  WO-PLANNED-FILE.
011200     MOVE LOW-VALUES TO STATUS-AREA.
016800     MOVE 1 TO ARG-NO.
           MOVE 0 TO COND-WORD.
           READ WO-LAST-NUM-USED INTO LAST-WO-BUFF
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLNU-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 MOVE 1 TO DATE-FLAG-SW.
017200     MOVE PLANT-IDENT TO PLANT-ID.
017300     MOVE DATE-FLAG-SW TO DATE-FLAG.
017400     ACCEPT CUR-DATE-WA FROM DATE.
017700     CALL "TPWORD" USING PASSWORD-INFORMATION.
018100     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
      *------- 01/04/2010:  UPDATED WORKORDER LETTER SUFFIX LOGIC.
018200*    IF CDY = 0 MOVE "A" TO YEAR-D
018300*    ELSE
018400*    IF CDY = 1 MOVE "B" TO YEAR-D
018500*    ELSE
018600*    IF CDY = 2 MOVE "C" TO YEAR-D
018700*    ELSE
018800*    IF CDY = 3 MOVE "D" TO YEAR-D
018900*    ELSE
019000*    IF CDY = 4 MOVE "E" TO YEAR-D
019100*    ELSE
019200*    IF CDY = 5 MOVE "F" TO YEAR-D
019300*    ELSE
019400*    IF CDY = 6 MOVE "G" TO YEAR-D
019500*    ELSE
019600*    IF CDY = 7 MOVE "H" TO YEAR-D
019700*    ELSE
019800*    IF CDY = 8 MOVE "J" TO YEAR-D
019900*    ELSE
020000*    MOVE "K" TO YEAR-D.

           CALL "CMMISYR" USING MMIS-LETTER.
           MOVE MMIS-LETTER    TO YEAR-D.
      *-------

020100     CALL "CLWHO" USING USERNAME TERMNUM USERLIB JOBLIBX.
           ACCEPT MC-LOCAL-DATA-AREA FROM LOCAL-DATA-AREA.
           MOVE 0 TO SUB1 SAVE-SUB1.
           MOVE SPACES TO READ-AREA.

021800 6-MAIN.
           IF SUB1 = 0
               IF JCW-PJCW-261 = 2
                   MOVE "FPRNTWO2" TO VIEW-CFNAME
021000             PERFORM 610-SET-YR VARYING SUB2 FROM 1 BY 1
021100                 UNTIL SUB2 > 20
                   MOVE 52011 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE ERROR-BUFFER TO READ-CMD-LINE
                   MOVE READ-AREA TO DSPLY-REC
                   PERFORM 99-SCREEN-WRITE
                   PERFORM 98-SCREEN-READ
                   MOVE SPACES TO ERROR-BUFFER READ-ERR-LINE
                   MOVE DSPLY-REC TO READ-AREA
               ELSE
               MOVE "FPRNTWO1" TO VIEW-CFNAME
025500         PERFORM 610-SET-YR VARYING SUB2 FROM 1 BY 1
025600             UNTIL SUB2 > 20
               MOVE 52011 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO READ-CMD-LINE READ-ERR-LINE
               MOVE READ-AREA TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98-SCREEN-READ
               MOVE SPACES TO ERROR-BUFFER
               MOVE DSPLY-REC TO READ-AREA.
           IF VIEW-LASTKEY = 1 OR 3 GO TO 2-EOJ.
           MOVE SAVE-SUB1 TO SUB1.
015200 6-MAIN-LOOP.
015300     ADD 1 TO SUB1.
015400     IF SUB1 > 20 OR READ-WO-1-6 (SUB1) = SPACES
               MOVE 0 TO SAVE-SUB1 SUB1
               MOVE SPACES TO READ-AREA
015800         GO TO 6-MAIN.
016300     MOVE "0" TO CONDIT-CODE.
016400     CALL "TALWONO" USING READ-WOS (SUB1) CONDIT-CODE.
           MOVE TRUE-VAL TO INDS (98).
           MOVE 44001 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO RET-MSG.
           MOVE READ-WOS (SUB1) TO RET-WO.
           MOVE RET-MSG TO READ-CMD-LINE.
           MOVE READ-AREA TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98A-SCREEN-READ.
017700     IF READ-X = " "
017800         MOVE "NP" TO ERROR-SWITCH
017900         MOVE "L" TO CONDIT-CODE
018000     ELSE
018100     MOVE "PZ" TO ERROR-SWITCH.
           PERFORM 69-START-WO-BASIC-FILE.
           IF COND-WORD = 0
               PERFORM 69-READ-WO-BASIC-FILE
               IF COND-WORD = 0
034000             CALL "TPRTWO" USING DBPARAMETERS WO-BASIC-DATA
034100                     READ-WOS (SUB1) CONDIT-CODE VIEW-COMAREA
                   GO TO 6-MAIN-LOOP.
030700     PERFORM 69-START-WO-PLANNED-FILE.
           IF COND-WORD = 0
032100         PERFORM 69-READ-WO-PLANNED-FILE
032400         IF COND-WORD = 0
033600             CALL "TPRINTWS" USING DBPARAMETERS
                                         WO-PLANNED-DATA
                                         ERROR-SWITCH
                                         VIEW-COMAREA
                   GO TO 6-MAIN-LOOP.
           MOVE 47004 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE READ-WOS (SUB1) TO ERR-WO2.
           MOVE ERROR-BUFFER    TO READ-ERR-LINE.
           MOVE TRUE-VAL TO INDS (SUB1) INDS (99).
           MOVE SUB1 TO SAVE-SUB1.
018300     GO TO 6-MAIN.
018400***************************************************************
018500*    ERROR-SWITCH = PZ INDICATES PLANNED WORK ORDERS ARE TO   *
018600*         PRINT IN THE ZONE LOCATION ON THE WORK ORDER        *
018700*    CONDIT-CODE = SPACE INDICATES THAT VERBAL WORK ORDERS    *
018800*         ARE TO PRINT IN THE ZONE LOCATION OF THE WORK ORDER *
018900*                                                             *
019000*    ERROR-SWITCH = SPACE INDICATES THAT PLANNED WORK ORDERS  *
019100*         ARE TO PRINT AT DESIGNATED PRINTERS                 *
019200*    CONDIT-CODE = L INDICATES THAT VERBAL WORK ORDERS ARE    *
019300*         TO PRINT AT DESIGNATED PRINTERS                     *
019400*                                                             *
019500*    ERROR-SWITCH = NP INDICATES TO TPRINTWS THAT ONLY        *
019600*         THE PLANNED WORK ORDER BODY IS TO BE PRINTED        *
019700*                                                             *
019800***************************************************************
028900 610-SET-YR.
029000     MOVE YEAR-D TO READ-WO-7 (SUB2).

       69-READ-WO-BASIC-FILE.
           MOVE 0 TO COND-WORD.
           READ WO-BASIC-FILE NEXT INTO WO-BASIC-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-START-WO-BASIC-FILE.
           MOVE 0 TO COND-WORD.
           MOVE READ-WOS (SUB1) TO WONUM OF WBFREC.
           START WO-BASIC-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-WO-PLANNED-FILE.
           MOVE 0 TO COND-WORD.
           READ WO-PLANNED-FILE NEXT INTO WO-PLANNED-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-START-WO-PLANNED-FILE.
           MOVE 0 TO COND-WORD.
           MOVE READ-WOS (SUB1) TO WONUM OF WPFREC.
           START WO-PLANNED-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0" TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

035400 999-CATREAD.
035500     MOVE SPACES TO ERROR-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
036400 999-CATREAD-EXIT.
036500     EXIT.
