       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TPURGE.
      *REMARKS.
      ************************************************
      ***                                          ***
      *** PURGES A WORK ORDER FROM THE MMIS SYSTEM ***
      ***                                          ***
      ************************************************
      *C
      *C  01/04/2010  CA YODER  2010-00142425-001
      *C     UPDATE LOGIC ASSIGNING WORKORDER LETTER SUFFIX.
      *C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. AS400.
       OBJECT-COMPUTER. AS400.
       SPECIAL-NAMES.   I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                        LOCAL-DATA IS LOCAL-DATA-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZOFFLINE-SI
               ORGANIZATION IS TRANSACTION
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT WO-NUMBER
               ASSIGN TO DATABASE-MCFLMM0101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WN-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                     PIC X(1700).
       FD  WO-NUMBER
           LABEL RECORD IS STANDARD
           DATA RECORD IS WNREC.
       01  WNREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0101.
       WORKING-STORAGE SECTION.
       77  YEAR-DSP                      PIC X.
      *---- 01/04/2010:  ADDED PARAMETER FOR CMMISYR.
       77  MMIS-LETTER                PIC X.
       COPY CATREAD OF COPYLIB.
       COPY CPYIND  OF COPYLIB.
       01  DATE-WORK-AREA.
           02  FILLER                    PIC X.
           02  DWY-2                     PIC X.
           02  FILLER                    PIC X(4).
       01  DBPARAMETERS.                 COPY DBPARMS OF COPYLIB.
       01  ERROR-BUFFER.
           05  ERR-MSG-1                 PIC X(12).
           05  ERR-WO                    PIC X(10).
           05  ERR-MSG-2                 PIC X(58).
       01  FILE-STATUSES.
           05  DSPLY-STATUS              PIC XX.
           05  WN-STATUS                 PIC XX.
       COPY IOFEEDBACK IN COPYLIB.
       COPY JCWAREA    IN COPYLIB.
       01  RETURN-CODE.
           05  RET-CODE                  PIC X.
           05  FILLER                    PIC X.
       COPY DBSTAT OF COPYLIB.
       01  TRUE-VAL                      PIC 1 VALUE B"1".
       COPY VCOMLINK OF COPYLIB.
       01  WO-NUMBER-SCREEN.
           05  WO-NUMBER-S.
               10  WO-NUMBER-S-1-6       PIC X(6).
               10  WO-NUMBER-S-7         PIC X.
               10  WO-NUMBER-S-8-10      PIC XXX.
           05  WO-CMD-LINE               PIC X(79).
           05  WO-ERR-LINE               PIC X(79).
       COPY WSCONTROL OF COPYLIB.
       PROCEDURE DIVISION.
       BEGIN-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN UNTIL VIEW-LASTKEY = 3.
       2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE WO-NUMBER.
           GOBACK.
       1-HSK.
           OPEN I-O   DISPLAY-FILE.
           OPEN INPUT WO-NUMBER.
           ACCEPT MC-LOCAL-DATA-AREA FROM LOCAL-DATA-AREA.
           IF JCW-PURGE-301 NOT = 1 GO TO 2-EOJ.
           MOVE SPACES TO WO-NUMBER-SCREEN.
           MOVE 0 TO VIEW-LASTKEY.
           MOVE "FPURGE" TO VIEW-CFNAME.
           ACCEPT DATE-WORK-AREA FROM DATE.
      *------- 01/04/2010:  UPDATED WORKORDER LETTER SUFFIX LOGIC.
      *    IF DWY-2 = "0" MOVE "A" TO YEAR-DSP
      *    ELSE
      *    IF DWY-2 = "1" MOVE "B" TO YEAR-DSP
      *    ELSE
      *    IF DWY-2 = "2" MOVE "C" TO YEAR-DSP
      *    ELSE
      *    IF DWY-2 = "3" MOVE "D" TO YEAR-DSP
      *    ELSE
      *    IF DWY-2 = "4" MOVE "E" TO YEAR-DSP
      *    ELSE
      *    IF DWY-2 = "5" MOVE "F" TO YEAR-DSP
      *    ELSE
      *    IF DWY-2 = "6" MOVE "G" TO YEAR-DSP
      *    ELSE
      *    IF DWY-2 = "7" MOVE "H" TO YEAR-DSP
      *    ELSE
      *    IF DWY-2 = "8" MOVE "J" TO YEAR-DSP
      *    ELSE
      *    MOVE "K" TO YEAR-DSP.

           CALL "CMMISYR" USING MMIS-LETTER.
           MOVE MMIS-LETTER    TO YEAR-DSP.
      *-------

       6-MAIN.
           MOVE YEAR-DSP TO WO-NUMBER-S-7.
           MOVE WO-NUMBER-SCREEN TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
           MOVE DSPLY-REC TO WO-NUMBER-SCREEN.
           MOVE "0" TO RET-CODE.
           CALL "TALWONO" USING WO-NUMBER-S RET-CODE.
           MOVE 0 TO COND-WORD.
           MOVE WO-NUMBER-S TO WONUM OF WNREC.
           START WO-NUMBER KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WN-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 0
               MOVE SPACES TO WO-CMD-LINE WO-ERR-LINE
               CALL "TMMDELSUB" USING WO-NUMBER-SCREEN
               IF WO-ERR-LINE = SPACES
                   MOVE 66358 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE WO-NUMBER-S TO ERR-WO
                   MOVE ERROR-BUFFER TO WO-CMD-LINE
                   MOVE WO-NUMBER-SCREEN TO DSPLY-REC
                   MOVE TRUE-VAL TO INDS (98)
                   PERFORM 99-SCREEN-WRITE
                   PERFORM 98A-SCREEN-READ
                   CALL "CLPAUSE2"
                   MOVE SPACES TO WO-NUMBER-SCREEN
               ELSE
               MOVE TRUE-VAL TO INDS (1) INDS (99)
               GO TO 6-MAIN
           ELSE
           MOVE 35040 TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE ERROR-BUFFER TO WO-ERR-LINE
           MOVE TRUE-VAL TO INDS (1) INDS (99)
           GO TO 6-MAIN.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0" TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

       999-CATREAD.
           MOVE SPACES TO ERROR-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
       999-CATREAD-EXIT.    EXIT.
