       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TPWOSTAT.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
      *REMARKS. ****THIS PROGRAM IS FOR MASS-CHANGING PLANNED
      *               WO STATUS.
      *                   ****.
      *C-------------------------------------------------------------
      *C 02/25/93  JSB  REQ #6306
      *C      ADDED "PR" AS A NEW WO STATUS FOR PRE-RELEASE.
      *C-------------------------------------------------------------
      *C
      *C 09/12/96  JEFF BUNGO
      *C      EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C      INCLUDE CENTURY ON DATE STAMP OF TRACKING.
      *C
      *C  01/04/2010  CA YODER  2010-00142425-001
      *C     UPDATE LOGIC ASSIGNING WORKORDER LETTER SUFFIX.
      *C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT WO-LAST-NUM-USED
                  ASSIGN       TO DATABASE-MCFPMM0800
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE  IS RANDOM
                  RELATIVE KEY IS ARG-NO
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-PLANNED
                  ASSIGN       TO DATABASE-MCFLMM1101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-STATUS
                  ASSIGN       TO DATABASE-MCFLMM0401
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZPWOSTAT-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD.
       01  WO-REC.
           COPY DD-ALL-FORMATS OF MCFPMM0800.

       FD  WO-PLANNED
           LABEL RECORDS ARE STANDARD.
       01  PWO-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.

       FD  WO-STATUS
           LABEL RECORDS ARE STANDARD.
       01  WOST-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0401.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  ARG-NO              PIC 9999  VALUE 1.
       77  YR-CODE             PIC X.
       77  ERROR-SW            PIC 9     VALUE 0.
       77  TRUE-VAL            PIC 1     VALUE B"1".
      *---- 01/04/2010:  ADDED PARAMETER FOR CMMISYR.
       77  MMIS-LETTER                PIC X.

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TPWOSTAT".
           05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A1    PIC X(30) VALUE
                   "PROGRAM TO MAKE MASS CHANGES O".
               10  PROG-DESC-A2    PIC X(30) VALUE
                   "F STATUS TO PLANNED WORKORDERS".
               10  PROG-DESC-B1    PIC X(30) VALUE
                   "ONLY CHANGES HA, HL, HM, HS, O".
               10  PROG-DESC-B2    PIC X(30) VALUE
                   "R SD STATUSES TO HA, HL, HM,  ".
               10  PROG-FUNCTION1  PIC X(30) VALUE
                   "HS, SD, OR OO STATUSES.  (DANV".
               10  PROG-FUNCTION2  PIC X(30) VALUE
                   "ILLE PROGRAM)                 ".
           05  PASSWORD-FLAG       PIC X.

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       01  SCRN-BUF.
           05  WO-STAT-1       PIC XX.
           05  WO-STAT-2       PIC XX.
           05  SCR-MSGB.
               10  CMDMSGB     PIC X(79).
               10  ERRMSGB     PIC X(79).

       01  SCREEN-DATA.
           05  WO-1.
               10  WO-1-6      PIC X(06).
               10  WO-1-Y      PIC X(01).
               10  WO-1-3      PIC X(03).
           05  WO-2.
               10  WO-2-6      PIC X(06).
               10  WO-2-Y      PIC X(01).
               10  WO-2-3      PIC X(03).
           05  WO-3.
               10  WO-3-6      PIC X(06).
               10  WO-3-Y      PIC X(01).
               10  WO-3-3      PIC X(03).
           05  WO-4.
               10  WO-4-6      PIC X(06).
               10  WO-4-Y      PIC X(01).
               10  WO-4-3      PIC X(03).
           05  WO-5.
               10  WO-5-6      PIC X(06).
               10  WO-5-Y      PIC X(01).
               10  WO-5-3      PIC X(03).
           05  WO-6.
               10  WO-6-6      PIC X(06).
               10  WO-6-Y      PIC X(01).
               10  WO-6-3      PIC X(03).
           05  WO-7.
               10  WO-7-6      PIC X(06).
               10  WO-7-Y      PIC X(01).
               10  WO-7-3      PIC X(03).
           05  WO-8.
               10  WO-8-6      PIC X(06).
               10  WO-8-Y      PIC X(01).
               10  WO-8-3      PIC X(03).
           05  WO-9.
               10  WO-9-6      PIC X(06).
               10  WO-9-Y      PIC X(01).
               10  WO-9-3      PIC X(03).
           05  WO-10.
               10  WO-10-6     PIC X(06).
               10  WO-10-Y     PIC X(01).
               10  WO-10-3     PIC X(03).
           05  WO-11.
               10  WO-11-6     PIC X(06).
               10  WO-11-Y     PIC X(01).
               10  WO-11-3     PIC X(03).
           05  WO-12.
               10  WO-12-6     PIC X(06).
               10  WO-12-Y     PIC X(01).
               10  WO-12-3     PIC X(03).
           05  WO-13.
               10  WO-13-6     PIC X(06).
               10  WO-13-Y     PIC X(01).
               10  WO-13-3     PIC X(03).
           05  WO-14.
               10  WO-14-6     PIC X(06).
               10  WO-14-Y     PIC X(01).
               10  WO-14-3     PIC X(03).
           05  WO-15.
               10  WO-15-6     PIC X(06).
               10  WO-15-Y     PIC X(01).
               10  WO-15-3     PIC X(03).
           05  WO-16.
               10  WO-16-6     PIC X(06).
               10  WO-16-Y     PIC X(01).
               10  WO-16-3     PIC X(03).
           05  WO-17.
               10  WO-17-6     PIC X(06).
               10  WO-17-Y     PIC X(01).
               10  WO-17-3     PIC X(03).
           05  WO-18.
               10  WO-18-6     PIC X(06).
               10  WO-18-Y     PIC X(01).
               10  WO-18-3     PIC X(03).
           05  WO-19.
               10  WO-19-6     PIC X(06).
               10  WO-19-Y     PIC X(01).
               10  WO-19-3     PIC X(03).
           05  WO-20.
               10  WO-20-6     PIC X(06).
               10  WO-20-Y     PIC X(01).
               10  WO-20-3     PIC X(03).
           05  WO-21.
               10  WO-21-6     PIC X(06).
               10  WO-21-Y     PIC X(01).
               10  WO-21-3     PIC X(03).
           05  WO-22.
               10  WO-22-6     PIC X(06).
               10  WO-22-Y     PIC X(01).
               10  WO-22-3     PIC X(03).
           05  WO-23.
               10  WO-23-6     PIC X(06).
               10  WO-23-Y     PIC X(01).
               10  WO-23-3     PIC X(03).
           05  WO-24.
               10  WO-24-6     PIC X(06).
               10  WO-24-Y     PIC X(01).
               10  WO-24-3     PIC X(03).
           05  WO-25.
               10  WO-25-6     PIC X(06).
               10  WO-25-Y     PIC X(01).
               10  WO-25-3     PIC X(03).
           05  WO-26.
               10  WO-26-6     PIC X(06).
               10  WO-26-Y     PIC X(01).
               10  WO-26-3     PIC X(03).
           05  WO-27.
               10  WO-27-6     PIC X(06).
               10  WO-27-Y     PIC X(01).
               10  WO-27-3     PIC X(03).
           05  WO-28.
               10  WO-28-6     PIC X(06).
               10  WO-28-Y     PIC X(01).
               10  WO-28-3     PIC X(03).
           05  WO-29.
               10  WO-29-6     PIC X(06).
               10  WO-29-Y     PIC X(01).
               10  WO-29-3     PIC X(03).
           05  WO-30.
               10  WO-30-6     PIC X(06).
               10  WO-30-Y     PIC X(01).
               10  WO-30-3     PIC X(03).
           05  WO-31.
               10  WO-31-6     PIC X(06).
               10  WO-31-Y     PIC X(01).
               10  WO-31-3     PIC X(03).
           05  WO-32.
               10  WO-32-6     PIC X(06).
               10  WO-32-Y     PIC X(01).
               10  WO-32-3     PIC X(03).
           05  WO-33.
               10  WO-33-6     PIC X(06).
               10  WO-33-Y     PIC X(01).
               10  WO-33-3     PIC X(03).
           05  WO-34.
               10  WO-34-6     PIC X(06).
               10  WO-34-Y     PIC X(01).
               10  WO-34-3     PIC X(03).
           05  WO-35.
               10  WO-35-6     PIC X(06).
               10  WO-35-Y     PIC X(01).
               10  WO-35-3     PIC X(03).
           05  WO-36.
               10  WO-36-6     PIC X(06).
               10  WO-36-Y     PIC X(01).
               10  WO-36-3     PIC X(03).
           05  WO-37.
               10  WO-37-6     PIC X(06).
               10  WO-37-Y     PIC X(01).
               10  WO-37-3     PIC X(03).
           05  WO-38.
               10  WO-38-6     PIC X(06).
               10  WO-38-Y     PIC X(01).
               10  WO-38-3     PIC X(03).
           05  WO-39.
               10  WO-39-6     PIC X(06).
               10  WO-39-Y     PIC X(01).
               10  WO-39-3     PIC X(03).
           05  WO-40.
               10  WO-40-6     PIC X(06).
               10  WO-40-Y     PIC X(01).
               10  WO-40-3     PIC X(03).
           05  WO-STAT-BUF1    PIC XX.
           05  WO-STAT-BUF2    PIC XX.
           05  SCR-MSG.
               10  CMDMSG      PIC X(79).
               10  ERRMSG      PIC X(79).

       01  WO-BUFFER.
           05  WO-BUF.
               10  WO-BUF1     PIC X.
               10  WO-BUF2     PIC X.
               10  WO-BUF3     PIC X.
               10  WO-BUF4     PIC X.
               10  WO-BUF5     PIC X.
               10  WO-BUF6     PIC X.
           05  YEAR-BUF        PIC X.
           05  SEQ-BUF.
               10  SEQ-1       PIC X.
               10  SEQ-2       PIC X.
               10  SEQ-3       PIC X.

       01  RETURN-COD.
           05  RET-CODE        PIC X.
           05  FILLER          PIC X.

       01  CURDATE-BUFFER.
           05  YY-BUFFER.
               10  FILLER      PIC X.
               10  DATE-YEAR   PIC X.
           05  MM-BUFFER       PIC XX.
           05  DD-BUFFER       PIC XX.

       01  TIME-BUFFER.
           05  TIME-HM.
               10  TIME-HRS    PIC 99 VALUE ZEROS.
               10  TIME-MINS   PIC 99 VALUE ZEROS.
           05  FILLER          PIC XXXX.

       01  CAT-TEXT-BUFFER.
           05  CAT-TEXT1       PIC X(25) VALUE SPACES.
           05  CAT-TEXT2       PIC XX    VALUE SPACES.

       01  DB-ERROR.
           05  DB-FUNC   PIC X(10) VALUE SPACES.
           05  DB-FILE   PIC X(18) VALUE SPACES.
           05  FILLER    PIC X(20) VALUE "ERROR - FILE-STAT = ".
           05  CON-WORD  PIC XX.

           COPY SCREENIO       IN COPYLIB.

           COPY CATREAD        IN COPYLIB.

       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  WO-PLANNED-DATA.
           COPY DWOPLAN        IN COPYLIB.

       01  WO-STATUS-DATA.
           COPY MWOSTAT        IN COPYLIB.

       01  LAST-WO-USED-DATA.
           COPY MLASTWO        IN COPYLIB.

       01  WO-TRACK-DATA.
           COPY DWOTRACK       IN COPYLIB.

       01  MESSAGE-BUFFER-DATA.
           COPY ERRORLIN       IN COPYLIB.

       01  WHO-VARIABLES.
           COPY WHOPARMS       IN COPYLIB.

       PROCEDURE DIVISION.
       BEGIN.
           PERFORM 1-HSK.
           GO TO 4-PRIMARY-SCREEN.

       END-OF-JOB.
           CLOSE               WO-PLANNED.
           CLOSE               WO-STATUS.
           CLOSE               DISPLAY-FILE.
           GOBACK.

       1-HSK.
           ACCEPT CURDATE-BUFFER FROM DATE.
      *------- 01/04/2010:  UPDATED WORKORDER LETTER SUFFIX LOGIC.
      *    IF DATE-YEAR = "0"  MOVE "A" TO YR-CODE
      *    ELSE
      *    IF DATE-YEAR = "1"  MOVE "B" TO YR-CODE
      *    ELSE
      *    IF DATE-YEAR = "2"  MOVE "C" TO YR-CODE
      *    ELSE
      *    IF DATE-YEAR = "3"  MOVE "D" TO YR-CODE
      *    ELSE
      *    IF DATE-YEAR = "4"  MOVE "E" TO YR-CODE
      *    ELSE
      *    IF DATE-YEAR = "5"  MOVE "F" TO YR-CODE
      *    ELSE
      *    IF DATE-YEAR = "6"  MOVE "G" TO YR-CODE
      *    ELSE
      *    IF DATE-YEAR = "7"  MOVE "H" TO YR-CODE
      *    ELSE
      *    IF DATE-YEAR = "8"  MOVE "J" TO YR-CODE
      *    ELSE
      *    MOVE "K"                    TO YR-CODE.

           CALL "CMMISYR" USING MMIS-LETTER.
           MOVE MMIS-LETTER    TO YR-CODE.
      *-------

           OPEN I-O            WO-PLANNED.
           OPEN INPUT          WO-STATUS.
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          WO-LAST-NUM-USED.

           READ WO-LAST-NUM-USED INTO LAST-WO-USED-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               DISPLAY "UNABLE TO GET LAST-WO-USED DATA."
                       "    FILE-STAT = " FILE-STAT
               CLOSE           WO-LAST-NUM-USED
               GO TO END-OF-JOB.

           CLOSE               WO-LAST-NUM-USED.
           MOVE DATE-FLAG-SW   TO DATE-FLAG.

           CALL "TPWORD"       USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "N"
               GO TO END-OF-JOB.

           MOVE SPACES         TO WO-TRACK-DATA.
           CALL "WHO"          USING MOD CAP LATTR USERNAME GRPNAME
                               ACCTNAME HOMEGRP TERMNUM.
           MOVE USERNAME       TO USER-NAME.
           MOVE TERMNUM        TO TNUM.
           MOVE TNUM           TO USER-TERM.
           MOVE "TPWOSTAT"     TO PROGRAM-NAME.

       4-PRIMARY-SCREEN.
           MOVE "VPWOSTAT"     TO SCREEN-NAME.
           MOVE SPACES         TO SCRN-BUF.

       4-SHOWFORM.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCRN-BUF       TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCRN-BUF.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 3
               GO TO END-OF-JOB
           ELSE
           IF KEY-HIT NOT = 0
               GO TO 4-PRIMARY-SCREEN.

           IF WO-STAT-1 = WO-STAT-2
      **********************************************************************
      **    MESSAGE 035/061:
      **  INVALID STATUS - CANNOT BE THE SAME
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE  61        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               PERFORM 610-ERROR
               GO TO 4-SHOWFORM.

           MOVE WO-STAT-1      TO WOSTATUS OF WO-STATUS.
           START WO-STATUS     KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      **********************************************************************
      **    MESSAGE 035/062:
      **  INVALID CURRENT STATUS
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE  62        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 1          TO FIELD-NUMBER
               PERFORM 610-ERROR
               GO TO 4-SHOWFORM.

           MOVE WO-STAT-2      TO WOSTATUS OF WO-STATUS.
           START WO-STATUS     KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      **********************************************************************
      **    MESSAGE 035/062:
      **  INVALID CURRENT STATUS
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE  63        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 2          TO FIELD-NUMBER
               PERFORM 610-ERROR
               GO TO 4-SHOWFORM.

           IF WO-STAT-1 = "HA" OR "HL" OR "HM" OR
                          "HS" OR "SD" OR "OO" OR "SD"
               NEXT SENTENCE
           ELSE
      **********************************************************************
      **    MESSAGE 029/044:
      **  CANNOT CHANGE WORKORDERS WITH THIS CURRENT STATUS
      **********************************************************************
               MOVE  29        TO CATREAD-MSG-SET
               MOVE  44        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 1          TO FIELD-NUMBER
               PERFORM 610-ERROR
               GO TO 4-SHOWFORM.

           IF WO-STAT-2 = "HA" OR "HL" OR "HM" OR "HS" OR "SD"
               NEXT SENTENCE
           ELSE
      **********************************************************************
      **    MESSAGE 029/045:
      **  CANNOT CHANGE WORKORDERS TO THIS NEW STATUS
      **********************************************************************
               MOVE  29        TO CATREAD-MSG-SET
               MOVE  45        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 2          TO FIELD-NUMBER
               PERFORM 610-ERROR
               GO TO 4-SHOWFORM.

       6-MAIN.
           MOVE SPACES         TO SCREEN-DATA.
           MOVE YR-CODE        TO WO-1-Y WO-2-Y WO-3-Y WO-4-Y  WO-5-Y
                               WO-6-Y  WO-7-Y  WO-8-Y  WO-9-Y  WO-10-Y
                               WO-11-Y WO-12-Y WO-13-Y WO-14-Y WO-15-Y
                               WO-16-Y WO-17-Y WO-18-Y WO-19-Y WO-20-Y
                               WO-21-Y WO-22-Y WO-23-Y WO-24-Y WO-25-Y
                               WO-26-Y WO-27-Y WO-28-Y WO-29-Y WO-30-Y
                               WO-31-Y WO-32-Y WO-33-Y WO-34-Y WO-35-Y
                               WO-36-Y WO-37-Y WO-38-Y WO-39-Y WO-40-Y.

           MOVE WO-STAT-1      TO WO-STAT-BUF1.
           MOVE WO-STAT-2      TO WO-STAT-BUF2.
           MOVE "VPWOMAIN"     TO SCREEN-NAME.

       61-SHOWFORM.
           MOVE 0              TO ERROR-SW.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 1
               GO TO 4-PRIMARY-SCREEN.

           IF KEY-HIT = 3
               GO TO END-OF-JOB
           ELSE
           IF KEY-HIT NOT = 0
               GO TO 6-MAIN.

       61-ALIGN-SCREEN.
           IF WO-1-6 NOT = SPACES
               MOVE WO-1       TO WO-BUFFER
               MOVE 1          TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-1
           ELSE
               GO TO 6-MAIN.

           IF WO-2-6 NOT = SPACES
               MOVE WO-2       TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-2
           ELSE
               GO TO 6-MAIN.

           IF WO-3-6 NOT = SPACES
               MOVE WO-3       TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-3
           ELSE
               GO TO 6-MAIN.

           IF WO-4-6 NOT = SPACES
               MOVE WO-4       TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-4
           ELSE
               GO TO 6-MAIN.

           IF WO-5-6 NOT = SPACES
               MOVE WO-5       TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-5
           ELSE
               GO TO 6-MAIN.

           IF WO-6-6 NOT = SPACES
               MOVE WO-6       TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-6
           ELSE
               GO TO 6-MAIN.

           IF WO-7-6 NOT = SPACES
               MOVE WO-7       TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-7
           ELSE
               GO TO 6-MAIN.

           IF WO-8-6 NOT = SPACES
               MOVE WO-8       TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-8
           ELSE
               GO TO 6-MAIN.

           IF WO-9-6 NOT = SPACES
               MOVE WO-9       TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-9
           ELSE
               GO TO 6-MAIN.

           IF WO-10-6 NOT = SPACES
               MOVE WO-10      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-10
           ELSE
               GO TO 6-MAIN.

           IF WO-11-6 NOT = SPACES
               MOVE WO-11      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-11
           ELSE
               GO TO 6-MAIN.

           IF WO-12-6 NOT = SPACES
               MOVE WO-12      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-12
           ELSE
               GO TO 6-MAIN.

           IF WO-13-6 NOT = SPACES
               MOVE WO-13      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-13
           ELSE
               GO TO 6-MAIN.

           IF WO-14-6 NOT = SPACES
               MOVE WO-14      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-14
           ELSE
               GO TO 6-MAIN.

           IF WO-15-6 NOT = SPACES
               MOVE WO-15      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-15
           ELSE
               GO TO 6-MAIN.

           IF WO-16-6 NOT = SPACES
               MOVE WO-16      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-16
           ELSE
               GO TO 6-MAIN.

           IF WO-17-6 NOT = SPACES
               MOVE WO-17      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-17
           ELSE
               GO TO 6-MAIN.

           IF WO-18-6 NOT = SPACES
               MOVE WO-18      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-18
           ELSE
               GO TO 6-MAIN.

           IF WO-19-6 NOT = SPACES
               MOVE WO-19      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-19
           ELSE
               GO TO 6-MAIN.

           IF WO-20-6 NOT = SPACES
               MOVE WO-20      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-20
           ELSE
               GO TO 6-MAIN.

           IF WO-21-6 NOT = SPACES
               MOVE WO-21      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-21
           ELSE
               GO TO 6-MAIN.

           IF WO-22-6 NOT = SPACES
               MOVE WO-22      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-22
           ELSE
               GO TO 6-MAIN.

           IF WO-23-6 NOT = SPACES
               MOVE WO-23      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-23
           ELSE
               GO TO 6-MAIN.

           IF WO-24-6 NOT = SPACES
               MOVE WO-24      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-24
           ELSE
               GO TO 6-MAIN.

           IF WO-25-6 NOT = SPACES
               MOVE WO-25      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-25
           ELSE
               GO TO 6-MAIN.

           IF WO-26-6 NOT = SPACES
               MOVE WO-26      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-26
           ELSE
               GO TO 6-MAIN.

           IF WO-27-6 NOT = SPACES
               MOVE WO-27      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-27
           ELSE
               GO TO 6-MAIN.

           IF WO-28-6 NOT = SPACES
               MOVE WO-28      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-28
           ELSE
               GO TO 6-MAIN.

           IF WO-29-6 NOT = SPACES
               MOVE WO-29      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-29
           ELSE
               GO TO 6-MAIN.

           IF WO-30-6 NOT = SPACES
               MOVE WO-30      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-30
           ELSE
               GO TO 6-MAIN.

           IF WO-31-6 NOT = SPACES
               MOVE WO-31      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-31
           ELSE
               GO TO 6-MAIN.

           IF WO-32-6 NOT = SPACES
               MOVE WO-32      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-32
           ELSE
               GO TO 6-MAIN.

           IF WO-33-6 NOT = SPACES
               MOVE WO-33      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-33
           ELSE
               GO TO 6-MAIN.

           IF WO-34-6 NOT = SPACES
               MOVE WO-34      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-34
           ELSE
               GO TO 6-MAIN.

           IF WO-35-6 NOT = SPACES
               MOVE WO-35      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-35
           ELSE
               GO TO 6-MAIN.

           IF WO-36-6 NOT = SPACES
               MOVE WO-36      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-36
           ELSE
               GO TO 6-MAIN.

           IF WO-37-6 NOT = SPACES
               MOVE WO-37      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-37
           ELSE
               GO TO 6-MAIN.

           IF WO-38-6 NOT = SPACES
               MOVE WO-38      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-38
           ELSE
               GO TO 6-MAIN.

           IF WO-39-6 NOT = SPACES
               MOVE WO-39      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-39
           ELSE
               GO TO 6-MAIN.

           IF WO-40-6 NOT = SPACES
               MOVE WO-40      TO WO-BUFFER
               ADD 1           TO FIELD-NUMBER
               PERFORM 611-UPDATE-FILE THRU 611-UF-EXIT
               IF ERROR-SW = 1
                   GO TO 61-SHOWFORM
               ELSE
                   MOVE WO-BUFFER TO WO-40
           ELSE
               GO TO 6-MAIN.

           GO TO 6-MAIN.

       611-UPDATE-FILE.
           CALL "TALWONO"      USING WO-BUFFER RETURN-COD.
           MOVE WO-BUFFER      TO WONUM OF WO-PLANNED.
           START WO-PLANNED    KEY = WONUM OF WO-PLANNED
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      **********************************************************************
      **    MESSAGE 049/002:
      **  WORKORDER NOT FOUND
      **********************************************************************
               MOVE  49        TO CATREAD-MSG-SET
               MOVE   2        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               PERFORM 611-ERROR
               GO TO 611-UF-EXIT.

           READ WO-PLANNED     NEXT INTO WO-PLANNED-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      **********************************************************************
      **    MESSAGE 049/002:
      **  WORKORDER NOT FOUND
      **********************************************************************
               MOVE  49        TO CATREAD-MSG-SET
               MOVE   2        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               PERFORM 611-ERROR
               GO TO 611-UF-EXIT.

           IF WO-BUFFER NOT = WO-NUM-PLANNED
      **********************************************************************
      **    MESSAGE 049/002:
      **  WORKORDER NOT FOUND
      **********************************************************************
               MOVE  49        TO CATREAD-MSG-SET
               MOVE   2        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               PERFORM 611-ERROR
               GO TO 611-UF-EXIT.

           IF WO-STATUS-P = WO-STAT-2
               GO TO 611-UF-EXIT.

           IF WO-STATUS-P NOT = WO-STAT-1
               MOVE WO-STAT-1  TO CAT-TEXT2
      **********************************************************************
      **    MESSAGE 049/021:
      **  W/O STATUS NOT CURRENTLY
      **********************************************************************
               MOVE  49        TO CATREAD-MSG-SET
               MOVE  21        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER  TO CAT-TEXT1
               MOVE CAT-TEXT-BUFFER TO MESSAGE-BUFFER
               PERFORM 611-ERROR
               GO TO 611-UF-EXIT.

           MOVE WO-STAT-2      TO WO-STATUS-P.
           REWRITE PWO-REC     FROM WO-PLANNED-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "REWRITE " TO DB-FUNC
               MOVE "WO-PLANNED" TO DB-FILE
               MOVE FILE-STAT  TO CON-WORD
               MOVE DB-ERROR   TO MESSAGE-BUFFER
               PERFORM 611-ERROR
               GO TO 611-UF-EXIT.

           MOVE SPACES         TO T-WO-DATA T-STATUS-DATA.
           MOVE WO-NUM-PLANNED TO WO-NUM-TRACK.
           MOVE CURDATE-BUFFER TO DATE-STAMP.
           IF DATE-STAMP-YY > 70
               MOVE 19 TO DATE-STAMP-CC
           ELSE
               MOVE 20 TO DATE-STAMP-CC.
           ACCEPT TIME-BUFFER  FROM TIME.
           MOVE TIME-HM        TO TIME-STAMP.
           MOVE WO-START-STATUS TO WO-TYPE-STATUS.
           MOVE "PLAN"         TO USER-ID CLOCK-CARD.
           MOVE WO-STATUS-P    TO WO-STATUS-TRACK TRANS-STATUS.
           CALL "TWOTRACK" USING WO-TRACK-DATA.

       611-UF-EXIT.            EXIT.

       610-ERROR.
           MOVE MESSAGE-BUFFER TO ERRMSGB.
           MOVE TRUE-VAL       TO IND(FIELD-NUMBER) IND(99).

       611-ERROR.
           MOVE 1              TO ERROR-SW.
           MOVE MESSAGE-BUFFER TO ERRMSG.
           MOVE TRUE-VAL       TO IND(FIELD-NUMBER) IND(99).

       999-CATREAD.
           MOVE SPACES         TO MESSAGE-BUFFER.
           CALL "CCATREAD"     USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.       EXIT.

