       IDENTIFICATION DIVISION.
       PROGRAM-ID.  TRPTBVAL.
       DATE-COMPILED.
      ************************************************************
      ** THIS PROGRAM IS THE REPORT PROGRAM FOR BVA USERS.      **
      ** IT IS MENU OPTION R205 IN THE GLOBAL MENU SYSTEM.      **
      ** IT ONLY LOOKS AT LAST MONTH'S DATA.                    **
      ************************************************************
      * 14JUN2001  DAVE PLUM
      *  INCREASED THE SIZE OF THE CC-TABLE FROM 250 TO 350.
      *
      * 06AUG2001  DAVE PLUM
      *  INCREASED THE SIZE OF THE CC-TABLE FROM 350 TO 500.
      *
      * 30APR2002  CA YODER
      *  INCREASED THE SIZE OF THE CC-TABLE FROM 500 TO 700.
      *
      *C 01/04/2010  CA YODER  2010-00142425-001
      *C UPDATED LOGIC TO RECOGNIZE THE NEW WORKORDER LETTER
      *C SUFFIXES.
      *C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       COPY SPECIALN OF COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DREQD
               ASSIGN TO DATABASE-MCFLCS2102
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DREQITM
               ASSIGN TO DATABASE-MCFLCS2201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DREQQUE
               ASSIGN TO DATABASE-MCFLCS4401
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DTRANS
               ASSIGN TO DATABASE-MCFLCA07LM
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT FPREQSLM
               ASSIGN TO DATABASE-FPREQSLM
               ORGANIZATION IS SEQUENTIAL
               ACCESS IS SEQUENTIAL
               FILE STATUS IS FILE-STATUS.

           SELECT FPSTRALM
               ASSIGN TO DATABASE-FPSTRALM
               ORGANIZATION IS SEQUENTIAL
               ACCESS IS SEQUENTIAL
               FILE STATUS IS FILE-STATUS.

           SELECT MACCOUNT-INFO
               ASSIGN TO DATABASE-MCFLCA0101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MATL-ACCUM
               ASSIGN TO DATABASE-MCFLCA06LM
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MCHT-ACCTS
               ASSIGN TO DATABASE-MCFLCA0302
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MPERSON
               ASSIGN TO DATABASE-MCFLMM0301
               ORGANIZATION IS INDEXED
               ACCESS MODE IS RANDOM
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
               ACCESS MODE IS RANDOM
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.

           SELECT SORT-FILE ASSIGN TO DISK-SORTFILE.

      *    SELECT TEAM-FILE
      *        ASSIGN TO DATABASE-TEAMFILF
      *        ORGANIZATION IS INDEXED
      *        ACCESS MODE IS DYNAMIC
      *        RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
      *        FILE STATUS IS FILE-STATUS.
      *
       DATA DIVISION.
       FILE SECTION.
       FD  DREQD
           LABEL RECORDS ARE STANDARD.
       01  DREQD-REC.
           COPY DDS-ALL-FORMATS  OF MCFLCS2102.

       FD  DREQITM
           LABEL RECORDS ARE STANDARD.
       01  DREQITM-REC.
           COPY DDS-ALL-FORMATS  OF MCFLCS2201.

       FD  DREQQUE
           LABEL RECORDS ARE STANDARD.
       01  DREQQUE-REC.
           COPY DDS-ALL-FORMATS  OF MCFLCS4401.

       FD  DTRANS
           LABEL RECORDS ARE STANDARD.
       01  DTRANS-REC.
           COPY DDS-ALL-FORMATS  OF MCFLCA07LM.

       FD  FPREQSLM
           LABEL RECORDS ARE STANDARD.
       01  FPREQSFI-REC.
           05  REQNUM                    PIC X(12).
           05  REQDATE.
               10  REQDATE-CCYY          PIC X(4).
               10  REQDATE-MM            PIC X(2).
               10  REQDATE-DD            PIC X(2).
           05  REQCLS                    PIC X(3).
           05  REQDEPT                   PIC X(4).
           05  REQEXP                    PIC X(6).
           05  REQBNW                    PIC X(10).
           05  REQTYPE                   PIC XX.
           05  REQORIG                   PIC X(4).
           05  REQCOST                   PIC 9(8)V9(4).
           05  FILLER                    PIC X(19).

       FD  FPSTRALM
           LABEL RECORDS ARE STANDARD.
       01  FPSTRACT-REC.
           05  SRDATE                    PIC X(8).
           05  SRACLS                    PIC X(3).
           05  SRDEPT                    PIC X(4).
           05  SREXP                     PIC X(6).
           05  SRCCDE                    PIC X(7).
           05  SRTRANS                   PIC X(4).
           05  SREMP                     PIC X(4).
           05  SRQTY                     PIC 9(10).
           05  SRVAL                     PIC S9(8)V99.
           05  SRFIL                     PIC X(24).

       FD  MACCOUNT-INFO
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS MACCOUNT-INFO-REC.
       01  MACCOUNT-INFO-REC.
           COPY DDS-MCRPCA0100  OF MCFLCA0101.

       FD  MATL-ACCUM
           LABEL RECORDS ARE STANDARD.
       01  MATL-ACCUM-REC.
           COPY DDS-ALL-FORMATS  OF MCFLCA06LM.

       FD  MCHT-ACCTS
           LABEL RECORDS ARE STANDARD.
       01  MCHT-ACCTS-REC.
           COPY DDS-ALL-FORMATS  OF MCFLCA0302.

       FD  MPERSON
           LABEL RECORDS ARE STANDARD.
       01  MPERSON-REC.
           COPY DDS-ALL-FORMATS  OF MCFLMM0301.

       FD  MPLTINFO
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC.
           COPY DDS-ALL-FORMATS  OF MCFLCS0501.

       FD  PRINT-FILE
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 132 CHARACTERS
           DATA RECORD IS PRINT-REC.
       01  PRINT-REC                     PIC X(132).

       SD  SORT-FILE
           RECORD CONTAINS 160 CHARACTERS
           DATA RECORD IS SORT-REC.
       01  SORT-REC.
           05  SORT-DEPT                 PIC X(4).
           05  SORT-EXP                  PIC X(6).
           05  SORT-REQNO                PIC X(12).
           05  SORT-CORPCODE             PIC X(8).
           05  SORT-TRANS                PIC X(4).
           05  SORT-DATE.
               10  SORT-DATE-CCYY        PIC X(4).
               10  SORT-DATE-MM          PIC X(2).
               10  SORT-DATE-DD          PIC X(2).
           05  SORT-DESC                 PIC X(40).
           05  SORT-ORIG                 PIC X(4).
           05  SORT-QTY-X.
               10  SORT-QTY              PIC S9(6).
           05  SORT-UM                   PIC X(2).
           05  SORT-DOLS                 PIC S9(6)V9(2).
           05  SORT-APPRDATE.
               10  SORT-APP-CCYY         PIC X(4).
               10  SORT-APP-MM           PIC X(2).
               10  SORT-APP-DD           PIC X(2).
           05  SORT-WO                   PIC X(10).
           05  SORT-PO.
               10  SORT-PONO             PIC X(07).
               10  SORT-POREL            PIC X(03).
           05  SORT-MANIFEST-NO          PIC X(03).
           05  SORT-REGISTER-NO          PIC X(07).
           05  FILLER                    PIC X(20).

      *FD  TEAM-FILE
      *    LABEL RECORDS ARE STANDARD.
      *01  TEAM-FILE-REC.
      *    COPY DDS-TEAMFILE    OF TEAMFILF.
      *
       WORKING-STORAGE SECTION.
       77  DUP-SW                        PIC X.
       77  EXPWRT-SW                     PIC 9.
       77  HOLD-CC-TAB                   PIC X(20).
       77  HOLD-DEPT                     PIC X(4).
       77  HOLD-EXPNW-TAB                PIC X(28).
       77  INVC-RCDS-CTR                 PIC 9(4).
       77  LINE-CTR                      PIC 99.
       77  REQS-RCDS-CTR                 PIC 9(4).
       77  SAVE-DEPT                     PIC X(4).
       77  SAVE-EXP                      PIC X(6).
       77  SAVE-LAST-BC                  PIC X(4) VALUE SPACES.
       77  SAVE-ORIG                     PIC X(4).
       77  SAVE-SCREEN-TEAM              PIC X(4).
       77  SAVE-SDPT                     PIC X(6).
       77  SUB                           PIC S9(4) COMP-4.
       77  SUB1                          PIC S9(4) COMP-4.
       77  SUB2                          PIC S9(4) COMP-4.
       77  SUB3                          PIC S9(4) COMP-4.
       77  SUB4                          PIC S9(4) COMP-4.
       77  TOTAL-QTY-GT                  PIC S9(12).
       77  TOTAL-DOL-GT                  PIC S9(14)V99.
       77  TOTAL-QTYR-GT                 PIC S9(12).
       77  TOTAL-DOLR-GT                 PIC S9(14)V99.
       77  TOTAL-QTYW-GT                 PIC S9(12).
       77  TOTAL-DOLW-GT                 PIC S9(14)V99.
       77  TOTAL-QTYI-GT                 PIC S9(12).
       77  TOTAL-DOLI-GT                 PIC S9(14)V99.
       77  VALID-SW                      PIC X.
       77  WITH-RCDS-CTR                 PIC 9(4).

       01  BC-TABLE.
           05  BC-TAB OCCURS 40.
               10  BCT                   PIC X(4).

       01  BUILD-PO-NUM.
           05  FILLER                    PIC X     VALUE "P".
           05  BUILD-PO-NO               PIC X(07).
           05  BUILD-PO-REL              PIC X(03).
           05  FILLER                    PIC X(03) VALUE "000".

       01  CC-TABLE.
           05  CC-TAB OCCURS 700.
               10  CC-NO                 PIC X(4).
               10  CC-NAME               PIC X(16).

       01  CHECK-DATES.
           05  C-DATE-LOW.
               10  C-DATE-LOW-CC         PIC XX.
               10  C-DATE-LOW-YMD.
                   15  C-DATE-LOW-YY     PIC XX.
                   15  C-DATE-LOW-MM     PIC XX.
                   15  C-DATE-LOW-DD     PIC XX.
           05  C-DATE-HIGH.
               10  C-DATE-HIGH-CC        PIC XX.
               10  C-DATE-HIGH-YMD.
                   15  C-DATE-HIGH-YY    PIC XX.
                   15  C-DATE-HIGH-MM    PIC XX.
                   15  C-DATE-HIGH-DD    PIC XX.

       COPY CDESC   OF COPYLIB.

       COPY CNDESC  OF COPYLIB.

       01  CODE-ARG                      PIC X(8).

       01  COMPRESS-PRINT                PIC X(8).

       01  CUR-DATE.
           05  CUR-DATE-YY               PIC 99.
           05  CUR-DATE-MM               PIC 99.
           05  CUR-DATE-DD               PIC 99.

       01  DETAIL-1.
           05  D-REQNO                   PIC X(12).
           05  FILLER                    PIC X(01).
           05  D-APPDAT.
               10  D-APP-MM              PIC X(02).
               10  D-SLASH-1             PIC X(01).
               10  D-APP-DD              PIC X(02).
               10  D-SLASH-2             PIC X(01).
               10  D-APP-CCYY            PIC X(04).
           05  FILLER                    PIC X(02).
           05  D-CORPCODE                PIC X(08).
           05  FILLLER                   PIC X(02).
           05  D-DESC                    PIC X(40).
           05  FILLER                    PIC X(01).
           05  D-DEPT                    PIC X(04).
           05  FILLER                    PIC X(02).
           05  D-EXPNW                   PIC X(06).
           05  FILLER                    PIC X(03).
           05  D-ORIG                    PIC X(04).
           05  FILLER                    PIC X(02).
           05  D-QTY                     PIC ZZZ,ZZ9-.
           05  FILLER                    PIC X(01).
           05  D-UM                      PIC X(02).
           05  FILLER                    PIC X(02).
           05  D-DOLS                    PIC ZZZ,ZZ9.99-.
           05  FILLER                    PIC X(01).
           05  D-WO                      PIC X(10).

       01  DETAIL-1A.
           05  FILLER                    PIC X(76).
           05  D-1A-VAR                  PIC X(19).
           05  FILLER                    PIC X(02).
           05  D-TOTQTY-1A               PIC ZZZ,ZZ9-.
           05  FILLER                    PIC X(05).
           05  D-TOTDOL-1A               PIC ZZZ,ZZ9.99-.
           05  FILLER                    PIC X(11).

       01  DETAIL-1B.
           05  FILLER                    PIC X(62).
           05  D-1B-VAR                  PIC X(14).
           05  FILLER                    PIC X(19).
           05  D-TOTQTY-1B               PIC Z,ZZZ,ZZ9-.
           05  FILLER                    PIC X(03).
           05  D-TOTDOL-1B               PIC Z,ZZZ,ZZ9.99-.
           05  FILLER                    PIC X(11).

       01  DETAIL-1C.
           05  FILLER                    PIC X(46).
           05  D-1C-VAR                  PIC X(16).
           05  FILLER                    PIC X(33).
           05  D-TOTQTY-1C               PIC Z,ZZZ,ZZ9-.
           05  FILLER                    PIC X(03).
           05  D-TOTDOL-1C               PIC Z,ZZZ,ZZ9.99-.
           05  FILLER                    PIC X(11).

       01  DETAIL-1S.
           05  FILLER                    PIC X(45).
           05  D-EXP-S                   PIC X(06).
           05  FILLER                    PIC X(04).
           05  D-QTY-S                   PIC Z,ZZZ,ZZZ,ZZ9-.
           05  FILLER                    PIC X(04).
           05  D-DOL-S                   PIC Z,ZZZ,ZZZ,ZZ9.99-.
           05  FILLER                    PIC X(48).

       01  DETAIL-1U.
           05  FILLER                    PIC X(53).
           05  D-UND1-U                  PIC X(16).
           05  FILLER                    PIC X.
           05  D-UND2-U                  PIC X(20).
           05  FILLER                    PIC X(42).

       01  DETAIL-2.
           05  D-REQNO-2                 PIC X(08).
           05  FILLER                    PIC X(01).
           05  D-PAYDAT-2.
               10  D-PAY-MM-2            PIC X(02).
               10  D-SLASH-3             PIC X(01).
               10  D-PAY-DD-2            PIC X(02).
               10  D-SLASH-4             PIC X(01).
               10  D-PAY-CCYY-2          PIC X(04).
           05  FILLER                    PIC X(01).
           05  D-CORPCODE-2              PIC X(07).
           05  FILLER                    PIC X(01).
           05  D-DESC-2                  PIC X(39).
           05  FILLER                    PIC X(01).
           05  D-DEPT-2                  PIC X(04).
           05  FILLER                    PIC X(01).
           05  D-EXP-2                   PIC X(06).
           05  FILLER                    PIC X(01).
           05  D-PONO-2                  PIC X(07).
           05  FILLER                    PIC X(01).
           05  D-QTY-2                   PIC ZZZ,ZZ9-.
           05  D-UM-2                    PIC X(02).
           05  FILLER                    PIC X(01).
           05  D-DOLS-2                  PIC ZZZ,ZZ9.99-.
           05  D-MANNO-REGNO-2.
               10  D-MANNO-2             PIC X(03).
               10  D-SLASH-5             PIC X(01).
               10  D-REGNO-2             PIC X(07).
           05  D-FRTBILL-2 REDEFINES D-MANNO-REGNO-2.
               10  D-FBA-2               PIC X(03).
               10  D-FBB-2               PIC X(07).
               10  FILLER                PIC X(01).
           05  FILLER                    PIC X(01).
           05  D-APPDAT-2.
               10  D-APP-MM-2            PIC X(02).
               10  D-SLASH-6             PIC X(01).
               10  D-APP-DD-2            PIC X(02).
               10  D-SLASH-7             PIC X(01).
               10  D-APP-CCYY-2          PIC X(04).
           05  FILLER                    PIC X(01).

       01  DETAIL-2A.
           05  FILLER                    PIC X(68).
           05  D-2A-VAR                  PIC X(19).
           05  FILLER                    PIC X(01).
           05  D-TOTQTY-2A               PIC ZZZ,ZZ9-.
           05  FILLER                    PIC X(03).
           05  D-TOTDOL-2A               PIC ZZZ,ZZ9.99-.
           05  FILLER                    PIC X(22).

       01  DETAIL-2B.
           05  FILLER                    PIC X(54).
           05  D-2B-VAR                  PIC X(14).
           05  FILLER                    PIC X(18).
           05  D-TOTQTY-2B               PIC Z,ZZZ,ZZ9-.
           05  FILLER                    PIC X(01).
           05  D-TOTDOL-2B               PIC Z,ZZZ,ZZ9.99-.
           05  FILLER                    PIC X(22).

       01  DETAIL-2C.
           05  FILLER                    PIC X(38).
           05  D-2C-VAR                  PIC X(16).
           05  FILLER                    PIC X(32).
           05  D-TOTQTY-2C               PIC Z,ZZZ,ZZ9-.
           05  FILLER                    PIC X(01).
           05  D-TOTDOL-2C               PIC Z,ZZZ,ZZ9.99-.
           05  FILLER                    PIC X(22).

       01  EXPNW-TABLE.
           05  EXPNW-TAB OCCURS 400 TIMES.
      *        10  ORIG-T                PIC X(4).
      *        10  DEPT-T                PIC X(4).
               10  EXPNW-T               PIC X(6).
               10  QTY-T                 PIC S9(10).
               10  DOL-T                 PIC S9(10)V99.

       COPY ESCNAM2 IN COPYLIB.

       COPY FILESTAT   IN COPYLIB.

       01  FNUM                          PIC S9(4) COMP-4 VALUE 0.

       01  GRAND-TOTALS-TABLE.
           05  GRAND-TOTALS-TAB OCCURS 400 TIMES.
      *        10  ORIG-T                PIC X(4).
      *        10  DEPT-T                PIC X(4).
               10  EXPNW-GT              PIC X(6).
               10  QTY-GT                PIC S9(10).
               10  DOL-GT                PIC S9(10)V99.

       01  HANDLE-BLOWUP-FLAG            PIC X(1)  VALUE "Y".

       01  HD-FILE-NAME PIC X(17) VALUE "HBVAR105.PUB".
       01  HD-RET-CODE                   PIC S9(4) COMP-4 VALUE 0.

       01  HEADER-0.
           05  FILLER  PIC X(07) VALUE "TEAM : ".
           05  H0-TEAM PIC X(04) VALUE SPACES.
           05  FILLER  PIC X(02) VALUE SPACES.
           05  H0-VAR.
               10  H0-LIT  PIC X(14) VALUE SPACES.
               10  H0-DFR  PIC X(08) VALUE SPACES.
               10  H0-LIT2 PIC X(01) VALUE SPACE.
               10  H0-DTO  PIC X(08) VALUE SPACES.
           05  FILLER  PIC X(11) VALUE SPACES.
           05  H0-PLT  PIC X(13) VALUE SPACES.
           05  FILLER  PIC X(06) VALUE " PLANT".
           05  FILLER  PIC X(38) VALUE SPACES.
           05  H0-DATE PIC X(08) VALUE SPACES.
           05  FILLER  PIC X(02) VALUE SPACES.
           05  H0-TIME PIC X(08) VALUE SPACES.
           05  FILLER  PIC X(02) VALUE SPACES.

       01  HEADER-1.
           05  FILLER  PIC X(07) VALUE "DEPTS: ".
           05  H1-DEPTS.
               10  H1-DEP OCCURS 6 TIMES.
                   15  H1-D      PIC X(04).
                   15  FILLER    PIC X(01).
           05  FILLER  PIC X(18) VALUE SPACES.
           05  FILLER  PIC X(21)
               VALUE "CHECKBOOK DETAIL DATA".
           05  FILLER  PIC X(56) VALUE SPACES.

       01  HEADER-2.
           05  FILLER  PIC X(07) VALUE SPACES.
           05  H2-DEPTS.
               10  H2-DEP OCCURS 6 TIMES.
                   15  H2-D      PIC X(04).
                   15  FILLER    PIC X(01).
           05  FILLER  PIC X(18) VALUE SPACES.
           05  H2-VAR  PIC X(21) VALUE SPACES.
           05  FILLER  PIC X(56) VALUE SPACES.

       01  HEADER-3.
           05  FILLER  PIC X(12) VALUE "Requisition".
           05  FILLER  PIC X(01) VALUE SPACE.
           05  FILLER  PIC X(10) VALUE "1st Appr  ".
           05  FILLER  PIC X(02) VALUE SPACES.
           05  FILLER  PIC X(07) VALUE "Corp   ".
           05  FILLER  PIC X(02) VALUE SPACES.
           05  FILLER  PIC X(40) VALUE SPACES.
           05  FILLER  PIC X(02) VALUE SPACES.
           05  FILLER  PIC X(04) VALUE SPACES.
           05  FILLER  PIC X(02) VALUE SPACES.
           05  FILLER  PIC X(07) VALUE "Expense".
           05  FILLER  PIC X(43) VALUE SPACES.

       01  HEADER-4.
           05  FILLER  PIC X(12) VALUE "Number      ".
           05  FILLER  PIC X(01) VALUE SPACE.
           05  FILLER  PIC X(10) VALUE "Date      ".
           05  FILLER  PIC X(02) VALUE SPACES.
           05  FILLER  PIC X(07) VALUE "Code   ".
           05  FILLER  PIC X(02) VALUE SPACES.
           05  FILLER  PIC X(40) VALUE "Description       ".
           05  FILLER  PIC X(02) VALUE SPACES.
           05  FILLER  PIC X(04) VALUE "Dept".
           05  FILLER  PIC X(02) VALUE SPACES.
           05  FILLER  PIC X(07) VALUE "Code".
           05  FILLER  PIC X(02) VALUE SPACES.
           05  FILLER  PIC X(04) VALUE "Orig".
           05  FILLER  PIC X(02) VALUE SPACES.
           05  FILLER  PIC X(07) VALUE "    Qty".
           05  FILLER  PIC X(02) VALUE SPACES.
           05  FILLER  PIC X(02) VALUE "UM".
           05  FILLER  PIC X(05) VALUE SPACES.
           05  FILLER  PIC X(07) VALUE "Dollars".
           05  FILLER  PIC X(12) VALUE SPACE.

       01  HEADER-5.
           05  FILLER  PIC X(12) VALUE "Transaction".
           05  FILLER  PIC X(01) VALUE SPACE.
           05  FILLER  PIC X(10) VALUE SPACES.
           05  FILLER  PIC X(02) VALUE SPACES.
           05  FILLER  PIC X(07) VALUE "Corp   ".
           05  FILLER  PIC X(02) VALUE SPACES.
           05  FILLER  PIC X(40) VALUE SPACES.
           05  FILLER  PIC X(02) VALUE SPACES.
           05  FILLER  PIC X(04) VALUE SPACES.
           05  FILLER  PIC X(02) VALUE SPACES.
           05  FILLER  PIC X(07) VALUE "Expense".
           05  FILLER  PIC X(33) VALUE SPACES.
           05  FILLER  PIC X(10) VALUE "Work Order".

       01  HEADER-6.
           05  FILLER  PIC X(04) VALUE SPACES.
           05  FILLER  PIC X(09) VALUE SPACES.
           05  FILLER  PIC X(04) VALUE "Date".
           05  FILLER  PIC X(08) VALUE SPACES.
           05  FILLER  PIC X(04) VALUE "Code".
           05  FILLER  PIC X(06) VALUE SPACES.
           05  FILLER  PIC X(40) VALUE "Description ".
           05  FILLER  PIC X(01) VALUE SPACES.
           05  FILLER  PIC X(04) VALUE "Dept".
           05  FILLER  PIC X(02) VALUE SPACES.
           05  FILLER  PIC X(04) VALUE "Code".
           05  FILLER  PIC X(05) VALUE SPACES.
           05  FILLER  PIC X(04) VALUE "Orig".
           05  FILLER  PIC X(06) VALUE SPACES.
           05  FILLER  PIC X(03) VALUE "Qty".
           05  FILLER  PIC X(02) VALUE SPACES.
           05  FILLER  PIC X(02) VALUE "UM".
           05  FILLER  PIC X(05) VALUE SPACES.
           05  FILLER  PIC X(07) VALUE "Dollars".
           05  FILLER  PIC X(02) VALUE SPACES.
           05  FILLER  PIC X(10) VALUE "Number".

       01  HEADER-7.
           05  FILLER  PIC X(08) VALUE "Inv Att.".
           05  FILLER  PIC X(01) VALUE SPACE.
           05  FILLER  PIC X(04) VALUE "Paid".
           05  FILLER  PIC X(07) VALUE SPACES.
           05  FILLER  PIC X(04) VALUE "Corp".
           05  FILLER  PIC X(04) VALUE SPACES.
           05  FILLER  PIC X(39) VALUE SPACES.
           05  FILLER  PIC X(01) VALUE SPACE.
           05  FILLER  PIC X(04) VALUE SPACES.
           05  FILLER  PIC X(01) VALUE SPACES.
           05  FILLER  PIC X(06) VALUE "Expnse".
           05  FILLER  PIC X(01) VALUE SPACES.
           05  FILLER  PIC X(07) VALUE " P.O.  ".
           05  FILLER  PIC X(01) VALUE SPACE.
           05  FILLER  PIC X(06) VALUE SPACES.
           05  FILLER  PIC X(01) VALUE SPACE.
           05  FILLER  PIC X(02) VALUE SPACES.
           05  FILLER  PIC X(01) VALUE SPACES.
           05  FILLER  PIC X(10) VALUE SPACES.
           05  FILLER  PIC X(02) VALUE SPACE.
           05  FILLER  PIC X(11) VALUE "Manf/Regstr".
           05  FILLER  PIC X(01) VALUE SPACES.
           05  FILLER  PIC X(10) VALUE "1st Appr  ".

       01  HEADER-8.
           05  FILLER  PIC X(08) VALUE "To Req# ".
           05  FILLER  PIC X(01) VALUE SPACE.
           05  FILLER  PIC X(04) VALUE "Date".
           05  FILLER  PIC X(07) VALUE SPACES.
           05  FILLER  PIC X(04) VALUE "Code".
           05  FILLER  PIC X(04) VALUE SPACES.
           05  FILLER  PIC X(39) VALUE "Description ".
           05  FILLER  PIC X(01) VALUE SPACE.
           05  FILLER  PIC X(04) VALUE "Dept".
           05  FILLER  PIC X(01) VALUE SPACE.
           05  FILLER  PIC X(04) VALUE "Code".
           05  FILLER  PIC X(03) VALUE SPACE.
           05  FILLER  PIC X(07) VALUE "Number".
           05  FILLER  PIC X(05) VALUE SPACE.
           05  FILLER  PIC X(03) VALUE "QTY".
           05  FILLER  PIC X(01) VALUE SPACE.
           05  FILLER  PIC X(02) VALUE "UM".
           05  FILLER  PIC X(01) VALUE SPACE.
           05  FILLER  PIC X(10) VALUE "   Dollars".
           05  FILLER  PIC X(12) VALUE "   Numbers  ".
           05  FILLER  PIC X(01) VALUE SPACE.
           05  FILLER  PIC X(10) VALUE "Date      ".

       01  HEADER-S0.
           05  FILLER  PIC X(56) VALUE SPACES.
           05  FILLER  PIC X(10) VALUE "CHECKBOOK ".
           05  HS0-VAR PIC X(07) VALUE SPACES.
           05  FILLER  PIC X(05) VALUE " PAGE".
           05  FILLER  PIC X(34) VALUE SPACES.
           05  S0-DATE PIC X(08) VALUE SPACES.
           05  FILLER  PIC X(02) VALUE SPACES.
           05  S0-TIME PIC X(08) VALUE SPACES.
           05  FILLER  PIC X(02) VALUE SPACES.

       01  HEADER-S1.
           05  FILLER  PIC X(61) VALUE SPACES.
           05  VHDR-S1 PIC X(12) VALUE SPACES.
           05  FILLER  PIC X(59) VALUE SPACES.

       01  HEADER-S2.
           05  FILLER  PIC X(45) VALUE SPACES.
           05  FILLER  PIC X(06) VALUE "EXP/NW".
           05  FILLER  PIC X(08) VALUE SPACES.
           05  FILLER  PIC X(10) VALUE "TOTAL QTY".
           05  FILLER  PIC X(07) VALUE SPACES.
           05  FILLER  PIC X(13) VALUE "TOTAL DOLLARS".
           05  FILLER  PIC X(43) VALUE SPACES.

       01  HEADER-S2A.
           05  FILLER  PIC X(47) VALUE SPACES.
           05  HS2A-VAR PIC X(37) VALUE SPACES.
           05  FILLER  PIC X(48) VALUE SPACES.

       01  HEADER-S2A-LIT1.
           05  FILLER  PIC X(15) VALUE "REQUISITIONS + ".
           05  FILLER  PIC X(14) VALUE "WITHDRAWALS + ".
           05  FILLER  PIC X(08) VALUE "INVOICES".

       01  HEADER-S2A-LIT2.
           05  FILLER  PIC X(06) VALUE SPACES.
           05  FILLER  PIC X(15) VALUE "REQUISITIONS + ".
           05  FILLER  PIC X(11) VALUE "WITHDRAWALS".
           05  FILLER  PIC X(05) VALUE SPACES.

       01  HEADER-S2A-LIT3.
           05  FILLER  PIC X(07) VALUE SPACES.
           05  FILLER  PIC X(15) VALUE "REQUISITIONS + ".
           05  FILLER  PIC X(08) VALUE "INVOICES".
           05  FILLER  PIC X(07) VALUE SPACES.

       01  HEADER-S2A-LIT4.
           05  FILLER  PIC X(08) VALUE SPACES.
           05  FILLER  PIC X(14) VALUE "WITHDRAWALS + ".
           05  FILLER  PIC X(08) VALUE "INVOICES".
           05  FILLER  PIC X(07) VALUE SPACES.

       01  HEADER-S3.
           05  FILLER  PIC X(132) VALUE ALL "_".

       01  HEADER-S4.
           05  FILLER  PIC X(48) VALUE SPACES.
           05  FILLER  PIC X(18) VALUE "CLOCK CARDS/NAMES ".
           05  FILLER  PIC X(18) VALUE "ON PREVIOUS REPORT".
           05  FILLER  PIC X(48) VALUE SPACES.

       COPY IOFEEDBACK IN COPYLIB.

       01  MACCT-ARG                     PIC X(4).

       01  NORMAL-PRINT                  PIC X(8).

       01  OVRDBF-PARM1  PIC X(80) VALUE SPACES.
       01  OVRDBF-PARM2  PIC S9(10)V9(5) COMP-3 VALUE 80.

       COPY OVRPFDATA  IN COPYLIB.

       01  PLANTS-TABLE.
           05  PLANT-TAB.
               10  FILLER  PIC X(16) VALUE "120SPARTANBURG  ".
               10  FILLER  PIC X(16) VALUE "126DANVILLE     ".
               10  FILLER  PIC X(16) VALUE "129UNION CITY   ".
               10  FILLER  PIC X(16) VALUE "130SOCIAL CIRCLE".
               10  FILLER  PIC X(16) VALUE "131GADSDEN      ".
               10  FILLER  PIC X(16) VALUE "133TOPEKA       ".
               10  FILLER  PIC X(16) VALUE "153LAWTON       ".
               10  FILLER  PIC X(16) VALUE "155ASHEBORO     ".
               10  FILLER  PIC X(16) VALUE "173CARTERSVILLE ".
               10  FILLER  PIC X(16) VALUE "174DECATUR      ".
               10  FILLER  PIC X(16) VALUE "178CARTERSVILLE ".
               10  FILLER  PIC X(16) VALUE "631NAPANEE      ".
           05  P-TAB REDEFINES PLANT-TAB.
               10  P-T OCCURS 12.
                   15  PLANT-NO   PIC X(3).
                   15  PLANT-NAME PIC X(13).

       01  PLT-ARG                       PIC X(4).

       01  REPORT-DATE-WA.
           05  RD-CCYYMMDD.
               10  RD-CC                 PIC XX.
               10  RD-YMD.
                   15  RD-YY             PIC XX.
                   15  RD-MM             PIC XX.
                   15  RD-DD             PIC XX.

       01  REQ-ARG                       PIC X(12).

       01  SCREEN-INPUT.
           05  SCREEN-TEAM               PIC X(4).
           05  SCREEN-DEPTS.
               10  S-D OCCURS 12         PIC X(4).
           05  SCREEN-EXP                PIC X(6).
           05  SCREEN-DATES.
               10  S-DATE-LOW.
                   15  S-DATE-LOW-CC     PIC XX.
                   15  S-DATE-LOW-YMD.
                       20  S-DATE-LOW-YY PIC XX.
                       20  S-DATE-LOW-MM PIC XX.
                       20  S-DATE-LOW-DD PIC XX.
               10  S-DATE-HIGH.
                   15  S-DATE-HIGH-CC    PIC XX.
                   15  S-DATE-HIGH-YMD.
                       20  S-DATE-HIGH-YY  PIC XX.
                       20  S-DATE-HIGH-MM  PIC XX.
                       20  S-DATE-HIGH-DD  PIC XX.
           05  SCREEN-RPTS-SORT.
               10  S-RPT-REQS            PIC X.
               10  S-RPT-SREQ            PIC XX.
               10  S-RPT-WITH            PIC X.
               10  S-RPT-SWIT            PIC XX.
               10  S-RPT-INVC            PIC X.
               10  S-RPT-SINV            PIC XX.

       01  SCREEN-RPTS-SAVE.
           05  S-RPT-REQS-SAVE           PIC X.
           05  S-RPT-SREQ-SAVE           PIC XX.
           05  S-RPT-WITH-SAVE           PIC X.
           05  S-RPT-SWIT-SAVE           PIC XX.
           05  S-RPT-INVC-SAVE           PIC X.
           05  S-RPT-SINV-SAVE           PIC XX.

       01  SUMMARIES-GENERATED.
           05  REQS-SUMMARY              PIC X.
           05  WITH-SUMMARY              PIC X.
           05  INVC-SUMMARY              PIC X.

       COPY TBLOWUP  IN COPYLIB.

       COPY TDATESUB IN COPYLIB.

       01  TEAM-DEPTS.
           05  TEAM-DEPS OCCURS 25 TIMES.
               10  T-D                   PIC X(4).

       COPY TNRQDESC IN COPYLIB.

       01  TOTALS-WORKAREA.
           05  TOTALS-BY-EXP.
               10  TOTAL-QTYE            PIC S9(6).
               10  TOTAL-DOLE            PIC S9(6)V9(2).
           05  TOTALS-BY-DEPT.
               10  TOTAL-QTYD            PIC S9(7).
               10  TOTAL-DOLD            PIC S9(7)V99.
           05  TOTALS-BY-ORIG.
               10  TOTAL-QTYO            PIC S9(7).
               10  TOTAL-DOLO            PIC S9(7)V99.
           05  TOTALS-BY-TEAM.
               10  TOTAL-QTYT            PIC S9(7).
               10  TOTAL-DOLT            PIC S9(7)V99.
       COPY VCOMAREA IN COPYLIB.

       01  WHO-PARMS.
           05  USERNAME                  PIC X(10).
           05  TERMNUM                   PIC X(10).
           05  CURRLIB                   PIC X(10).
           05  JOBLIBX                   PIC X.

       01  WORK-DEPTS.
           05  WORK-DEP OCCURS 12 TIMES.
               10  W-D                   PIC X(4).

       COPY WSCONTROL OF COPYLIB.
      *****************************************************************
      **                                                             **
      **  D A T A B A S E   W O R K                                  **
      **                                                             **
      *****************************************************************
       01  BASE                          PIC X(10)  VALUE "  STORES;".
       COPY DREQD      IN COPYLIB.
       COPY DREQITM    IN COPYLIB.
       COPY DREQQUE    IN COPYLIB.
       COPY DTRANS     IN COPYLIB.
       COPY DBSTAT     IN COPYLIB.
       COPY MACTINFO   IN COPYLIB.
       COPY MATLACUM   IN COPYLIB.
       COPY MCHTACCT   IN COPYLIB.
       01   BUF-PERSONNEL.       COPY MPERSONL IN COPYLIB.
       COPY MPLT0      IN COPYLIB.
       COPY MPLTP01    IN COPYLIB.

      *****************************************************************
      **                                                             **
      **  D A T A B A S E   B U F F E R S                            **
      **                                                             **
      *****************************************************************

       COPY THDPRTB IN COPYLIB.
       01  OPTION-REC-1          PIC X(80).
       01  OPTION-REC-2.
           05  OPTION2-INV-RPT   PIC X.
           05  OPTION2-INV-SRT   PIC XX.
           05  FILLER            PIC X(77).

       PROCEDURE DIVISION.
       START-PGM SECTION.
       STARTP.
           ACCEPT HD-ROUTE-DATA.
           DISPLAY "HD-ROUTE DATE = " HD-ROUTE-DATA.
           ACCEPT OPTION-REC-1.
           DISPLAY "OPTION-REC-1  = " OPTION-REC-1.
           ACCEPT OPTION-REC-2.
           DISPLAY "OPTION-REC-2  = " OPTION-REC-2.
           MOVE OPTION-REC-1  TO SCREEN-INPUT.
           MOVE OPTION2-INV-RPT TO S-RPT-INVC.
           MOVE OPTION2-INV-SRT TO S-RPT-SINV.
           OPEN INPUT  DREQD.
           OPEN INPUT  DREQITM.
           OPEN INPUT  DREQQUE.
           OPEN INPUT  DTRANS.
      *    OPEN INPUT  FPREQSLM.
      *    OPEN INPUT  FPSTRALM.
           OPEN INPUT  MACCOUNT-INFO.
           OPEN INPUT  MCHT-ACCTS.
           OPEN INPUT  MPERSON.
           OPEN INPUT  MPLTINFO.
           OPEN INPUT  MATL-ACCUM.
      *    OPEN INPUT  TEAM-FILE.
           PERFORM 1000-HSK  THRU 1000-HSK-X.
           MOVE 0             TO TOTAL-QTYR-GT
                                 TOTAL-DOLR-GT
                                 TOTAL-QTYW-GT
                                 TOTAL-DOLW-GT
                                 TOTAL-QTYI-GT
                                 TOTAL-DOLI-GT.
           PERFORM 6000-MAIN THRU 6990-MAIN-X.
           GO TO 2-EOJ.

       2-BLOWUP.
           MOVE "TRPTBVAL"    TO BU-PGM-NAME.
           MOVE REQ-ARG       TO BU-DISPLAY-FLD (1).
           MOVE FILE-STATUS   TO BU-DISPLAY-FLD9 (2).
           CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
                            VIEW-COMAREA DUMMY-KSAM-STAT
                            BU-DISPLAY-MSG BU-DISPLAY-FLDS.

       2-EOJ.
           IF PAPER-IS-132-COLS
               NEXT SENTENCE
           ELSE
           MOVE SPACES TO PRINT-REC
           WRITE PRINT-REC FROM NORMAL-PRINT AFTER ADVANCING 0 LINES.
           CLOSE DREQD.
           CLOSE DREQITM.
           CLOSE DREQQUE.
           CLOSE DTRANS.
      *    CLOSE FPREQSLM.
      *    CLOSE FPSTRALM.
           CLOSE MACCOUNT-INFO.
           CLOSE MCHT-ACCTS.
           CLOSE MPERSON.
           CLOSE MPLTINFO.
           CLOSE MATL-ACCUM.
      *    CLOSE TEAM-FILE.
           CLOSE PRINT-FILE.
           GOBACK.

       1000-HSK.
           CALL "TESCSEQ" USING ESC-NAME.
           MOVE CHAR-1636PI       TO COMPRESS-PRINT.
           MOVE CHAR-10PI         TO NORMAL-PRINT.
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"            TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES   TO OVRPRTF-COPIES.
           MOVE "MCPRT"        TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT PRINT-FILE.
           CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM,
               HD-ROUTE-DATA, ESC-NAME.
           IF HD-RET-CODE NOT = 0
               MOVE "THDPRT2 ERROR * TRPTBVAL" TO BU-DISPLAY-MSG
               MOVE "HD-RET-CODE = "           TO BU-DISPLAY-FLD (1)
               MOVE HD-RET-CODE                TO BU-DISPLAY-FLD9 (1)
               PERFORM 2-BLOWUP.
           IF PAPER-IS-132-COLS
               NEXT SENTENCE
           ELSE
           WRITE PRINT-REC FROM COMPRESS-PRINT AFTER ADVANCING 0 LINES.
           MOVE 61             TO LINE-CTR.
           CALL "CLWHO" USING USERNAME TERMNUM CURRLIB JOBLIBX.
           MOVE "P 01"         TO PLT-ARG.
           MOVE PLT-ARG        TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           PERFORM 1001-SET-PLANT-LIT
               VARYING SUB FROM 1 BY 1 UNTIL SUB > 12.
           MOVE SPACES         TO SAVE-DEPT.
           MOVE SPACES         TO SAVE-EXP.
           MOVE "9999"         TO SAVE-ORIG.
           MOVE "SDPT"         TO MACCT-ARG.
           MOVE MACCT-ARG TO INFOKEY OF MACCOUNT-INFO-REC.
           READ MACCOUNT-INFO INTO BUF-MACCT-INFO
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "SDPT RECORD DOES NOT EXIST" TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.
           ACCEPT CUR-DATE FROM DATE.
           MOVE MACCT-STR-DEPT TO SAVE-SDPT.
           MOVE "MTED"         TO MACCT-ARG.
           MOVE MACCT-ARG TO INFOKEY OF MACCOUNT-INFO-REC.
           READ MACCOUNT-INFO INTO BUF-MACCT-INFO
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE CUR-DATE   TO C-DATE-LOW
                                  C-DATE-HIGH
               MOVE "01"       TO C-DATE-LOW-DD
               IF C-DATE-HIGH-YY > "70"
                   MOVE "19"   TO C-DATE-LOW-CC
                                  C-DATE-HIGH-CC
                   GO TO 1000-HSK-X
               ELSE
               MOVE "20"       TO C-DATE-LOW-CC
                                  C-DATE-HIGH-CC
               GO TO 1000-HSK-X.
           MOVE MACCT-PREV-MTH-END-DATE TO C-DATE-LOW-YMD.
           IF C-DATE-LOW-YY > "70"
               MOVE "19"       TO C-DATE-LOW-CC
           ELSE
           MOVE "20"           TO C-DATE-LOW-CC.
           MOVE "01"           TO C-DATE-LOW-DD.
           MOVE MACCT-PREV-MTH-END-DATE TO C-DATE-HIGH-YMD.
           IF C-DATE-HIGH-YY > "70"
               MOVE "19"       TO C-DATE-HIGH-CC
           ELSE
           MOVE "20"           TO C-DATE-HIGH-CC.
           DISPLAY "C-DATE-LOW  = " C-DATE-LOW.
           DISPLAY "C-DATE-HIGH = " C-DATE-HIGH.
           MOVE 1 TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT TO H0-DATE,
                                  S0-DATE.
           MOVE DATE-FORMATTED-TIME-OUT TO H0-TIME,
                                           S0-TIME.
           MOVE SPACES         TO BC-TABLE.
           MOVE SPACES         TO SAVE-SCREEN-TEAM.
           MOVE SPACES         TO SUMMARIES-GENERATED.
           IF SCREEN-TEAM = "ALL " OR " ALL"
               MOVE SCREEN-TEAM TO SAVE-SCREEN-TEAM
               MOVE 0           TO SUB2
               PERFORM 1002-LOAD-BC-TABLE THRU 1002-LBT-X
               MOVE 0           TO SUB2
               PERFORM 1003-INIT-EXPNW-TABLE
                   VARYING SUB FROM 1 BY 1
                       UNTIL SUB = 400.
       1000-HSK-X.    EXIT.

       1001-SET-PLANT-LIT.
           IF MPLTINFO-COMPANY = PLANT-NO (SUB)
               MOVE PLANT-NAME (SUB) TO H0-PLT
               MOVE 13 TO SUB.

       1002-LOAD-BC-TABLE.
           READ  MCHT-ACCTS NEXT INTO BUF-MCHTACCTS
               AT END    GO TO 1002-LBT-X.
           IF MCHT-BC = "    " GO TO 1002-LOAD-BC-TABLE.
           IF MCHT-BC = SAVE-LAST-BC
               GO TO 1002-LOAD-BC-TABLE
           ELSE
           ADD 1               TO SUB2
           IF SUB2 > 40
               GO TO 1002-LBT-X
           ELSE
           MOVE MCHT-BC        TO SAVE-LAST-BC
                                  BCT (SUB2)
           GO TO 1002-LOAD-BC-TABLE.
       1002-LBT-X.    EXIT.

       1003-INIT-EXPNW-TABLE.
           MOVE SPACES     TO EXPNW-T (SUB),
                              EXPNW-GT (SUB).
           MOVE ZEROES     TO QTY-T (SUB)
                              QTY-GT (SUB)
                              DOL-T (SUB)
                              DOL-GT (SUB).

       COPY OVRPFCALL IN COPYLIB.

       6000-MAIN SECTION.
       6000M.
           PERFORM 6001-SCREEN-EDITS THRU 6001-SE-X.
      *    IF SCREEN-TEAM NOT = "    "
      *        MOVE SCREEN-TEAM TO TEAMDEF OF TEAM-FILE-REC
      *        READ TEAM-FILE
      *        MOVE TEAMDEPS TO WORK-DEPTS
      *        PERFORM 6002-MOVE-DEPTS
      *            VARYING SUB FROM 1 BY 1 UNTIL SUB > 10.
           IF SCREEN-TEAM = "    "
               MOVE SPACES       TO TEAM-DEPTS
               MOVE SCREEN-DEPTS TO TEAM-DEPTS
               GO TO 6000-RETRIEVE-RAW-DATA.
           IF SAVE-SCREEN-TEAM = "ALL " OR " ALL"
               ADD 1             TO SUB2
               IF (SUB2 > 40) OR (BCT (SUB2) = "    ")
                   IF SCREEN-RPTS-SAVE = "         "
                       MOVE 0 TO TOTAL-QTY-GT TOTAL-DOL-GT
                       PERFORM 6008-WRITE-GRAND-TOTALS THRU 6008-WGT-X
                       GO TO 6990-MAIN-X
                   ELSE
                   IF S-RPT-REQS-SAVE = "X"
                       PERFORM 6006-SORT-CC-TABLE THRU 6006-SCT-X
                       PERFORM 6006-WRITE-CC-TABLE
                           VARYING SUB3 FROM 1 BY 1
                               UNTIL (SUB3 > 700) OR
                                   (CC-NO (SUB3) = SPACES)
                       MOVE 0    TO SUB3
                       PERFORM 6007-WRITE-SUMMARY THRU 6007-WS-X
                       MOVE "Y"  TO REQS-SUMMARY
                       MOVE 61   TO LINE-CTR
                       MOVE " "  TO S-RPT-REQS-SAVE
                       MOVE "  " TO S-RPT-SREQ-SAVE
                       PERFORM 6005-RESET-EXPNW-TABLE
                           VARYING SUB FROM 1 BY 1
                               UNTIL SUB = 400
                       MOVE SCREEN-RPTS-SAVE TO SCREEN-RPTS-SORT
                       MOVE 1    TO SUB2
                       MOVE BCT (SUB2) TO SCREEN-TEAM
                   ELSE
                   IF S-RPT-WITH-SAVE = "X"
                       PERFORM 6006-SORT-CC-TABLE THRU 6006-SCT-X
                       PERFORM 6006-WRITE-CC-TABLE
                           VARYING SUB3 FROM 1 BY 1
                               UNTIL (SUB3 > 700) OR
                                   (CC-NO (SUB3) = SPACES)
                       MOVE 0    TO SUB3
                       PERFORM 6007-WRITE-SUMMARY THRU 6007-WS-X
                       MOVE "Y"  TO WITH-SUMMARY
                       MOVE 61   TO LINE-CTR
                       MOVE " "  TO S-RPT-WITH-SAVE
                       MOVE "  " TO S-RPT-SWIT-SAVE
                       PERFORM 6005-RESET-EXPNW-TABLE
                           VARYING SUB FROM 1 BY 1
                               UNTIL SUB = 400
                       MOVE SCREEN-RPTS-SAVE TO SCREEN-RPTS-SORT
                       MOVE 1    TO SUB2
                       MOVE BCT (SUB2) TO SCREEN-TEAM
                   ELSE
                   IF S-RPT-INVC-SAVE = "X"
                       PERFORM 6007-WRITE-SUMMARY THRU 6007-WS-X
                       MOVE "Y"  TO INVC-SUMMARY
                       MOVE 61   TO LINE-CTR
                       MOVE " "  TO S-RPT-INVC-SAVE
                       MOVE "  " TO S-RPT-SINV-SAVE
                       PERFORM 6005-RESET-EXPNW-TABLE
                           VARYING SUB FROM 1 BY 1
                               UNTIL SUB = 400
                       MOVE SCREEN-RPTS-SAVE TO SCREEN-RPTS-SORT
                       MOVE 1    TO SUB2
                       MOVE BCT (SUB2) TO SCREEN-TEAM
                   ELSE
                   MOVE SPACES TO SCREEN-RPTS-SAVE
                   GO TO 6000M
               ELSE
               MOVE BCT (SUB2)   TO SCREEN-TEAM.
           MOVE SCREEN-TEAM TO BUSCTR OF MCHT-ACCTS-REC.
           START MCHT-ACCTS KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "TEAM ENTERED NOT IN DATABASE"
                   TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING NEW-PAGE
               GO TO 2-EOJ
           ELSE
           MOVE 0 TO SUB1
           MOVE SPACES TO TEAM-DEPTS
           PERFORM 6003-MOVE-CSAS-DEPT THRU 6003-MCD-X
           MOVE 0 TO SUB.
           MOVE 1 TO SUB1.
           PERFORM 6004-SORT-DEPTS THRU 6004-SD-X.
           MOVE SCREEN-TEAM TO H0-TEAM.
           MOVE SCREEN-RPTS-SORT TO SCREEN-RPTS-SAVE.

       6000-RETRIEVE-RAW-DATA.
           IF S-RPT-REQS = " "
               NEXT SENTENCE
           ELSE
           OPEN INPUT FPREQSLM
           MOVE ZEROES TO TOTAL-QTYE
                          TOTAL-DOLE
                          TOTAL-QTYD
                          TOTAL-DOLD
                          TOTAL-QTYO
                          TOTAL-DOLO
                          TOTAL-QTYT
                          TOTAL-DOLT
           IF S-RPT-SREQ = "01"
               SORT SORT-FILE ON ASCENDING KEY SORT-DEPT
                                               SORT-EXP
                   INPUT PROCEDURE  7-SORT-RECORDS
                   OUTPUT PROCEDURE 8-WRITE-REPORT
           ELSE
           IF S-RPT-SREQ = "02"
               SORT SORT-FILE ON ASCENDING KEY SORT-EXP
                   INPUT PROCEDURE  7-SORT-RECORDS
                   OUTPUT PROCEDURE 8-WRITE-REPORT
           ELSE
           IF S-RPT-SREQ = "03"
               SORT SORT-FILE ON ASCENDING KEY SORT-DEPT
                                               SORT-CORPCODE
                   INPUT PROCEDURE  7-SORT-RECORDS
                   OUTPUT PROCEDURE 8-WRITE-REPORT
           ELSE
           IF S-RPT-SREQ = "04"
               SORT SORT-FILE ON ASCENDING KEY SORT-CORPCODE
                   INPUT PROCEDURE  7-SORT-RECORDS
                   OUTPUT PROCEDURE 8-WRITE-REPORT
           ELSE
           IF S-RPT-SREQ = "11"
               SORT SORT-FILE ON ASCENDING KEY SORT-DEPT
                                               SORT-REQNO
                   INPUT PROCEDURE  7-SORT-RECORDS
                   OUTPUT PROCEDURE 8-WRITE-REPORT
           ELSE
           IF S-RPT-SREQ = "12"
               SORT SORT-FILE ON ASCENDING KEY SORT-REQNO
                   INPUT PROCEDURE  7-SORT-RECORDS
                   OUTPUT PROCEDURE 8-WRITE-REPORT
           ELSE
           IF S-RPT-SREQ = "13"
               SORT SORT-FILE ON ASCENDING KEY SORT-ORIG
                   INPUT PROCEDURE  7-SORT-RECORDS
                   OUTPUT PROCEDURE 8-WRITE-REPORT
           ELSE
           IF S-RPT-SREQ = "14"
               SORT SORT-FILE ON ASCENDING KEY SORT-APPRDATE
                   INPUT PROCEDURE  7-SORT-RECORDS
                   OUTPUT PROCEDURE 8-WRITE-REPORT.

           IF SAVE-SCREEN-TEAM = "ALL " OR " ALL"
               IF S-RPT-REQS-SAVE = " "
                   NEXT SENTENCE
               ELSE
               MOVE SCREEN-RPTS-SAVE TO SCREEN-RPTS-SORT
               GO TO 6000M.

           IF S-RPT-WITH = " "
               NEXT SENTENCE
           ELSE
           OPEN INPUT FPSTRALM
           MOVE ZEROES TO TOTAL-QTYE
                          TOTAL-DOLE
                          TOTAL-QTYD
                          TOTAL-DOLD
                          TOTAL-QTYO
                          TOTAL-DOLO
                          TOTAL-QTYT
                          TOTAL-DOLT
           IF S-RPT-SWIT = "01"
               SORT SORT-FILE ON ASCENDING KEY SORT-DEPT
                                               SORT-EXP
                   INPUT PROCEDURE  7-SORT-RECORDS
                   OUTPUT PROCEDURE 8-WRITE-REPORT
           ELSE
           IF S-RPT-SWIT = "02"
               SORT SORT-FILE ON ASCENDING KEY SORT-EXP
                   INPUT PROCEDURE  7-SORT-RECORDS
                   OUTPUT PROCEDURE 8-WRITE-REPORT
           ELSE
           IF S-RPT-SWIT = "03"
               SORT SORT-FILE ON ASCENDING KEY SORT-DEPT
                                               SORT-CORPCODE
                   INPUT PROCEDURE  7-SORT-RECORDS
                   OUTPUT PROCEDURE 8-WRITE-REPORT
           ELSE
           IF S-RPT-SWIT = "04"
               SORT SORT-FILE ON ASCENDING KEY SORT-CORPCODE
                   INPUT PROCEDURE  7-SORT-RECORDS
                   OUTPUT PROCEDURE 8-WRITE-REPORT
           ELSE
           IF S-RPT-SWIT = "21"
               SORT SORT-FILE ON ASCENDING KEY SORT-DEPT
                                               SORT-TRANS
                   INPUT PROCEDURE  7-SORT-RECORDS
                   OUTPUT PROCEDURE 8-WRITE-REPORT
           ELSE
           IF S-RPT-SWIT = "22"
               SORT SORT-FILE ON ASCENDING KEY SORT-TRANS
                   INPUT PROCEDURE  7-SORT-RECORDS
                   OUTPUT PROCEDURE 8-WRITE-REPORT
           ELSE
           IF S-RPT-SWIT = "23"
               SORT SORT-FILE ON ASCENDING KEY SORT-ORIG
                   INPUT PROCEDURE  7-SORT-RECORDS
                   OUTPUT PROCEDURE 8-WRITE-REPORT
           ELSE
           IF S-RPT-SWIT = "24"
               SORT SORT-FILE ON ASCENDING KEY SORT-DATE
                   INPUT PROCEDURE  7-SORT-RECORDS
                   OUTPUT PROCEDURE 8-WRITE-REPORT.

           IF SAVE-SCREEN-TEAM = "ALL " OR " ALL"
               IF S-RPT-WITH-SAVE = " "
                   NEXT SENTENCE
               ELSE
               MOVE SCREEN-RPTS-SAVE TO SCREEN-RPTS-SORT
               GO TO 6000M.

           IF S-RPT-INVC = " "
               NEXT SENTENCE
           ELSE
           MOVE ZEROES TO TOTAL-QTYE
                          TOTAL-DOLE
                          TOTAL-QTYD
                          TOTAL-DOLD
                          TOTAL-QTYO
                          TOTAL-DOLO
                          TOTAL-QTYT
                          TOTAL-DOLT
           IF S-RPT-SINV = "01"
               SORT SORT-FILE ON ASCENDING KEY SORT-DEPT
                                               SORT-EXP
                   INPUT PROCEDURE  7-SORT-RECORDS
                   OUTPUT PROCEDURE 8-WRITE-REPORT
           ELSE
           IF S-RPT-SINV = "02"
               SORT SORT-FILE ON ASCENDING KEY SORT-EXP
                   INPUT PROCEDURE  7-SORT-RECORDS
                   OUTPUT PROCEDURE 8-WRITE-REPORT
           ELSE
           IF S-RPT-SINV = "03"
               SORT SORT-FILE ON ASCENDING KEY SORT-DEPT
                                               SORT-CORPCODE
                   INPUT PROCEDURE  7-SORT-RECORDS
                   OUTPUT PROCEDURE 8-WRITE-REPORT
           ELSE
           IF S-RPT-SINV = "04"
               SORT SORT-FILE ON ASCENDING KEY SORT-CORPCODE
                   INPUT PROCEDURE  7-SORT-RECORDS
                   OUTPUT PROCEDURE 8-WRITE-REPORT
           ELSE
           IF S-RPT-SINV = "31"
               SORT SORT-FILE ON ASCENDING KEY SORT-DEPT
                                               SORT-REQNO
                   INPUT PROCEDURE  7-SORT-RECORDS
                   OUTPUT PROCEDURE 8-WRITE-REPORT
           ELSE
           IF S-RPT-SINV = "32"
               SORT SORT-FILE ON ASCENDING KEY SORT-REQNO
                   INPUT PROCEDURE  7-SORT-RECORDS
                   OUTPUT PROCEDURE 8-WRITE-REPORT
           ELSE
           IF S-RPT-SINV = "33"
               SORT SORT-FILE ON ASCENDING KEY SORT-DEPT
                                               SORT-APPRDATE
                   INPUT PROCEDURE  7-SORT-RECORDS
                   OUTPUT PROCEDURE 8-WRITE-REPORT
           ELSE
           IF S-RPT-SINV = "34"
               SORT SORT-FILE ON ASCENDING KEY SORT-APPRDATE
                   INPUT PROCEDURE  7-SORT-RECORDS
                   OUTPUT PROCEDURE 8-WRITE-REPORT.

           IF SAVE-SCREEN-TEAM = "ALL " OR " ALL"
               MOVE SCREEN-RPTS-SAVE TO SCREEN-RPTS-SORT
               GO TO 6000M.

           IF SAVE-SCREEN-TEAM = "ALL " OR " ALL"
               MOVE SCREEN-RPTS-SAVE TO SCREEN-RPTS-SORT
               GO TO 6000M.

       6990-MAIN-X.
           EXIT.

       6001-SCREEN-EDITS.
           IF SCREEN-TEAM = "    " AND SCREEN-DEPTS = SPACES
               MOVE "NEITHER TEAM OR DEPARTMENTS WAS INPUT"
                   TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING NEW-PAGE
               GO TO 2-EOJ.
           IF S-DATE-LOW = "        " AND S-DATE-HIGH = "        "
               NEXT SENTENCE
           ELSE
           IF S-DATE-LOW > "        " AND S-DATE-HIGH = "        "
               MOVE S-DATE-LOW TO S-DATE-HIGH
           ELSE
           IF S-DATE-HIGH > "        " AND S-DATE-LOW = "        "
               MOVE S-DATE-HIGH TO S-DATE-LOW
           ELSE
           IF S-DATE-LOW > S-DATE-HIGH
               MOVE S-DATE-LOW TO S-DATE-HIGH.
           IF S-DATE-LOW = "        "
               NEXT SENTENCE
           ELSE
           IF S-DATE-LOW-CC = "  "
               IF S-DATE-LOW-YY > "70"
                   MOVE "19" TO S-DATE-LOW-CC
               ELSE
               MOVE "20"     TO S-DATE-LOW-CC.
           IF S-DATE-HIGH = "        "
               NEXT SENTENCE
           ELSE
           IF S-DATE-HIGH-CC = "  "
               IF S-DATE-HIGH-YY > "70"
                   MOVE "19" TO S-DATE-HIGH-CC
               ELSE
               MOVE "20"     TO S-DATE-HIGH-CC.
           DISPLAY "S-DATE-LOW  = " S-DATE-LOW.
           DISPLAY "S-DATE-HIGH = " S-DATE-HIGH.
           IF S-RPT-REQS = "X"
             IF S-RPT-SREQ = "  " OR "01" OR "02" OR "03" OR "04" OR
               "11" OR "12" OR "13" OR "14"
               NEXT SENTENCE
           ELSE
           MOVE "REQUISITION REPORT REQUESTED IS INVALID"
               TO PRINT-REC
           WRITE PRINT-REC AFTER ADVANCING NEW-PAGE
           GO TO 2-EOJ.
           IF S-RPT-WITH = "X"
             IF S-RPT-SWIT = "  " OR "01" OR "02" OR "03" OR "04" OR
               "21" OR "22" OR "23" OR "24"
               NEXT SENTENCE
           ELSE
           MOVE "WITHDRAWAL REPORT REQUESTED IS INVALID"
               TO PRINT-REC
           WRITE PRINT-REC AFTER ADVANCING NEW-PAGE
           GO TO 2-EOJ.
           IF S-RPT-SINV = "  " OR "01" OR "02" OR "03" OR "04" OR
               "31" OR "32" OR "33" OR "34"
               NEXT SENTENCE
           ELSE
           MOVE "INVOICE REPORT REQUESTED IS INVALID"
               TO PRINT-REC
           WRITE PRINT-REC AFTER ADVANCING NEW-PAGE
           GO TO 2-EOJ.
       6001-SE-X.    EXIT.

      *6002-MOVE-DEPTS.
      *    MOVE W-D (SUB1) TO S-D (SUB1).
      *
       6003-MOVE-CSAS-DEPT.
           READ MCHT-ACCTS NEXT INTO BUF-MCHTACCTS
               AT END GO TO 6003-MCD-X.
           IF MCHT-BC NOT = SCREEN-TEAM GO TO 6003-MCD-X.
           ADD 1 TO SUB1.
           IF SUB1 > 25 GO TO 6003-MCD-X.
           MOVE MCHT-DEPT-1-4 TO T-D (SUB1).
           GO TO 6003-MOVE-CSAS-DEPT.
       6003-MCD-X.    EXIT.

       6004-SORT-DEPTS.
           ADD 1           TO SUB.
           ADD 1           TO SUB1.
           IF SUB1 > 25 GO TO 6004-SD-X.
           IF T-D (SUB1) = "    " GO TO 6004-SD-X.
           IF T-D (SUB) < T-D (SUB1) GO TO 6004-SORT-DEPTS.
           MOVE T-D (SUB)  TO HOLD-DEPT.
           MOVE T-D (SUB1) TO T-D (SUB).
           MOVE HOLD-DEPT  TO T-D (SUB1).
           MOVE 0          TO SUB.
           MOVE 1          TO SUB1.
           GO TO 6004-SORT-DEPTS.
       6004-SD-X.    EXIT.

       6005-RESET-EXPNW-TABLE.
           MOVE SPACES     TO EXPNW-T (SUB).
           MOVE ZEROES     TO QTY-T (SUB)
                              DOL-T (SUB).

       6006-WRITE-CC-TABLE.
           ADD 1               TO LINE-CTR.
           IF LINE-CTR > 61
               MOVE SPACES     TO PRINT-REC
               MOVE HEADER-S4  TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING NEW-PAGE
               MOVE HEADER-S3  TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1 LINES
               MOVE 2          TO LINE-CTR.
           MOVE SPACES         TO PRINT-REC.
           STRING CC-NO (SUB3), "  ", CC-NAME (SUB3)
               DELIMITED BY SIZE INTO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1 LINES.

       6006-SORT-CC-TABLE.
           MOVE 0          TO SUB3.
           MOVE 1          TO SUB4.
       6006-SCT-LOOP.
           ADD 1           TO SUB3.
           ADD 1           TO SUB4.
           IF SUB4 > 700 OR CC-TAB (SUB4) = SPACES
               MOVE 0      TO SUB3
               GO TO 6006-SCT-CONT.
           IF CC-TAB (SUB3) < CC-TAB (SUB4) GO TO 6006-SCT-LOOP.
           MOVE CC-TAB (SUB3) TO HOLD-CC-TAB.
           MOVE CC-TAB (SUB4) TO CC-TAB (SUB3).
           MOVE HOLD-CC-TAB   TO CC-TAB (SUB4).
           MOVE 0          TO SUB3.
           MOVE 1          TO SUB4.
           GO TO 6006-SCT-LOOP.
       6006-SCT-CONT.
           ADD 1           TO SUB3.
           IF SUB3 > 700 OR CC-TAB (SUB3) = SPACES
               GO TO 6006-SCT-X.
           MOVE CC-NO (SUB3) TO PERCCNUM OF MPERSON-REC.
           READ MPERSON INTO BUF-PERSONNEL.
           MOVE PER-EMP-NAME TO CC-NAME (SUB3).
           GO TO 6006-SCT-CONT.
       6006-SCT-X.    EXIT.

       6007-WRITE-SUMMARY.
           MOVE 0  TO SUB.
           MOVE 1  TO SUB1.
       6007-SORT-EXPNW.
           ADD 1   TO SUB.
           ADD 1   TO SUB1.
           IF SUB1 > 400 GO TO 6007-WS-CONT.
           IF EXPNW-T (SUB1) = "      " GO TO 6007-WS-CONT.
           IF EXPNW-T (SUB) < EXPNW-T (SUB1) GO TO 6007-SORT-EXPNW.
           MOVE EXPNW-TAB (SUB)  TO HOLD-EXPNW-TAB.
           MOVE EXPNW-TAB (SUB1) TO EXPNW-TAB (SUB).
           MOVE HOLD-EXPNW-TAB   TO EXPNW-TAB (SUB1).
           MOVE 0                TO SUB.
           MOVE 1                TO SUB1.
           GO TO 6007-SORT-EXPNW.
       6007-WS-CONT.
           MOVE 61 TO LINE-CTR.
           MOVE  0 TO SUB.
       6007-WRITE-ENTRIES-LOOP.
           ADD 1 TO SUB.
           IF (SUB > 400) OR (EXPNW-T (SUB) = SPACES)
               MOVE SPACES TO DETAIL-1U
               MOVE ALL "_"   TO D-UND1-U
                                 D-UND2-U
               ADD 3          TO LINE-CTR
               IF LINE-CTR > 61
                   MOVE SPACES     TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING NEW-PAGE
                   MOVE 0          TO LINE-CTR
                   MOVE "SUMMARY"  TO HS0-VAR
                   MOVE HEADER-S0  TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1 LINES
                   PERFORM 60070-SET-VHDR
                   MOVE HEADER-S1 TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1 LINES
                   MOVE SPACES    TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1 LINES
                   MOVE HEADER-S2 TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1 LINES
                   MOVE HEADER-S3 TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1 LINES
                   ADD 5          TO LINE-CTR
               END-IF
               MOVE DETAIL-1U     TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 2 LINES
               MOVE SPACES TO DETAIL-1S
               IF S-RPT-REQS-SAVE = "X"
                   MOVE TOTAL-QTYR-GT TO D-QTY-S
                   MOVE TOTAL-DOLR-GT TO D-DOL-S
                   MOVE DETAIL-1S     TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1 LINES
                   GO TO 6007-WS-X
               ELSE
               IF S-RPT-WITH-SAVE = "X"
                   MOVE TOTAL-QTYW-GT TO D-QTY-S
                   MOVE TOTAL-DOLW-GT TO D-DOL-S
                   MOVE DETAIL-1S     TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1 LINES
                   GO TO 6007-WS-X
               ELSE
               IF S-RPT-INVC-SAVE = "X"
                   MOVE TOTAL-QTYI-GT TO D-QTY-S
                   MOVE TOTAL-DOLI-GT TO D-DOL-S
                   MOVE DETAIL-1S     TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1 LINES
                   GO TO 6007-WS-X.
           MOVE SPACES    TO DETAIL-1S.
           MOVE EXPNW-T (SUB) TO D-EXP-S.
           MOVE QTY-T (SUB)   TO D-QTY-S.
           MOVE DOL-T (SUB)   TO D-DOL-S.
           IF S-RPT-REQS-SAVE = "X"
               ADD QTY-T (SUB)   TO TOTAL-QTYR-GT
               ADD DOL-T (SUB)   TO TOTAL-DOLR-GT
           ELSE
           IF S-RPT-WITH-SAVE = "X"
               ADD QTY-T (SUB)   TO TOTAL-QTYW-GT
               ADD DOL-T (SUB)   TO TOTAL-DOLW-GT
           ELSE
           IF S-RPT-INVC-SAVE = "X"
               ADD QTY-T (SUB)   TO TOTAL-QTYI-GT
               ADD DOL-T (SUB)   TO TOTAL-DOLI-GT.
           PERFORM 60071-UPDATE-GTS
               VARYING SUB1 FROM 1 BY 1
                   UNTIL SUB1 = 400.
           ADD 1 TO LINE-CTR.
           IF LINE-CTR > 61
               MOVE SPACES     TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING NEW-PAGE
               MOVE 0          TO LINE-CTR
               MOVE "SUMMARY"  TO HS0-VAR
               MOVE HEADER-S0  TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1 LINES
               PERFORM 60070-SET-VHDR
               MOVE HEADER-S1 TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1 LINES
               MOVE SPACES    TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1 LINES
               MOVE HEADER-S2 TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1 LINES
               MOVE HEADER-S3 TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1 LINES
               ADD 5          TO LINE-CTR.
           MOVE DETAIL-1S TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1 LINES.
           GO TO 6007-WRITE-ENTRIES-LOOP.
       6007-WS-X.    EXIT.

       60070-SET-VHDR.
           MOVE SPACES             TO VHDR-S1.
           IF S-RPT-REQS = "X"
               MOVE "REQUISITIONS" TO VHDR-S1
           ELSE
           IF S-RPT-WITH = "X"
               MOVE "WITHDRAWALS " TO VHDR-S1
           ELSE
           IF S-RPT-INVC = "X"
               MOVE "INVOICES    " TO VHDR-S1.

       60071-UPDATE-GTS.
           IF EXPNW-T (SUB) = EXPNW-GT (SUB1)
               ADD QTY-T (SUB)    TO QTY-GT (SUB1)
               ADD DOL-T (SUB)    TO DOL-GT (SUB1)
               MOVE 399           TO SUB1
           ELSE
           IF EXPNW-GT (SUB1) = "      "
               MOVE EXPNW-T (SUB) TO EXPNW-GT (SUB1)
               ADD QTY-T (SUB)    TO QTY-GT (SUB1)
               ADD DOL-T (SUB)    TO DOL-GT (SUB1)
               MOVE 399           TO SUB1.

       6008-WRITE-GRAND-TOTALS.
           IF REQS-SUMMARY = "Y"
               IF WITH-SUMMARY = "Y"
                   IF INVC-SUMMARY = "Y"
                       MOVE HEADER-S2A-LIT1 TO HS2A-VAR
                   ELSE
                   MOVE HEADER-S2A-LIT2 TO HS2A-VAR
               ELSE
               IF INVC-SUMMARY = "Y"
                   MOVE HEADER-S2A-LIT3 TO HS2A-VAR
               ELSE
               GO TO 6008-WGT-X
           ELSE
           IF WITH-SUMMARY = "Y"
               IF INVC-SUMMARY = "Y"
                   MOVE HEADER-S2A-LIT4 TO HS2A-VAR
               ELSE
               GO TO 6008-WGT-X
           ELSE
           GO TO 6008-WGT-X.
           MOVE 0                       TO SUB.
           MOVE 1                       TO SUB1.
       6008-SORT-EXPNW.
           ADD 1                        TO SUB.
           ADD 1                        TO SUB1.
           IF SUB1 > 400 GO TO 6008-WS-CONT.
           IF EXPNW-GT (SUB1) = "      " GO TO 6008-WS-CONT.
           IF EXPNW-GT (SUB) < EXPNW-GT (SUB1) GO TO 6008-SORT-EXPNW.
           MOVE GRAND-TOTALS-TAB (SUB)  TO HOLD-EXPNW-TAB.
           MOVE GRAND-TOTALS-TAB (SUB1) TO GRAND-TOTALS-TAB (SUB).
           MOVE HOLD-EXPNW-TAB          TO GRAND-TOTALS-TAB (SUB1).
           MOVE 0                       TO SUB.
           MOVE 1                       TO SUB1.
           GO TO 6008-SORT-EXPNW.
       6008-WS-CONT.
           MOVE 61 TO LINE-CTR.
           MOVE  0 TO SUB.
       6008-WRITE-ENTRIES-LOOP.
           ADD 1 TO SUB.
           IF (SUB > 400) OR (EXPNW-GT (SUB) = SPACES)
               MOVE SPACES     TO DETAIL-1U
               MOVE ALL "_"    TO D-UND1-U
                                  D-UND2-U
               ADD 3           TO LINE-CTR
               IF LINE-CTR > 61
                   MOVE SPACES     TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING NEW-PAGE
                   MOVE 0          TO LINE-CTR
                   MOVE "TOTALS "  TO HS0-VAR
                   MOVE HEADER-S0  TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1 LINES
                   PERFORM 60070-SET-VHDR
                   MOVE HEADER-S1 TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1 LINES
                   MOVE SPACES    TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1 LINES
                   MOVE HEADER-S2A TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1 LINES
                   MOVE HEADER-S3 TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1 LINES
                   ADD 5          TO LINE-CTR
               END-IF
               MOVE DETAIL-1U     TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 2 LINES
               MOVE SPACES        TO DETAIL-1S
               MOVE TOTAL-QTY-GT  TO D-QTY-S
               MOVE TOTAL-DOL-GT  TO D-DOL-S
               MOVE DETAIL-1S     TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1 LINES
               GO TO 6008-WGT-X.
           MOVE SPACES         TO DETAIL-1S.
           MOVE EXPNW-GT (SUB) TO D-EXP-S.
           MOVE QTY-GT (SUB)   TO D-QTY-S.
           ADD QTY-GT (SUB)    TO TOTAL-QTY-GT.
           MOVE DOL-GT (SUB)   TO D-DOL-S.
           ADD DOL-GT (SUB)    TO TOTAL-DOL-GT.
           ADD 1               TO LINE-CTR.
           IF LINE-CTR > 61
               MOVE SPACES     TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING NEW-PAGE
               MOVE 0          TO LINE-CTR
               MOVE "TOTALS "  TO HS0-VAR
               MOVE HEADER-S0  TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1 LINES
               PERFORM 60070-SET-VHDR
               MOVE HEADER-S1 TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1 LINES
               MOVE SPACES    TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1 LINES
               MOVE HEADER-S2A TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1 LINES
               MOVE HEADER-S3 TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1 LINES
               ADD 5          TO LINE-CTR.
           MOVE DETAIL-1S TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1 LINES.
           GO TO 6008-WRITE-ENTRIES-LOOP.
       6008-WGT-X.    EXIT.

       7-SORT-RECORDS SECTION.
       7-SR.
           IF S-RPT-REQS = "X"
               MOVE 0 TO REQS-RCDS-CTR
               MOVE 0 TO SUB3
               MOVE SPACES TO CC-TABLE
               PERFORM 7-REQS-RPT THRU 7-RR-X
               CLOSE FPREQSLM
               GO TO 7-SR-X
           ELSE
           IF S-RPT-WITH = "X"
               MOVE 0 TO WITH-RCDS-CTR
               MOVE 0 TO SUB3
               MOVE SPACES TO CC-TABLE
               PERFORM 7-WITH-RPT THRU 7-WR-X
               CLOSE FPSTRALM
               GO TO 7-SR-X
           ELSE
           IF S-RPT-INVC = "X"
               MOVE 0 TO INVC-RCDS-CTR
               PERFORM 7-INVC-RPT THRU 7-IR-X
               GO TO 7-SR-X.
           GO TO 7-SR.

       7-REQS-RPT.
           READ FPREQSLM AT END GO TO 7-RR-X.
           IF SCREEN-DATES = SPACES
               NEXT SENTENCE
           ELSE
           IF REQDATE NOT LESS THAN S-DATE-LOW
              AND REQDATE NOT GREATER THAN S-DATE-HIGH
                  NEXT SENTENCE
           ELSE
           GO TO 7-REQS-RPT.
           MOVE "N"        TO VALID-SW.
           PERFORM 7-CHECK4-VAL-REQ-DEPT
               VARYING SUB FROM 1 BY 1
                   UNTIL SUB > 25.
           IF VALID-SW = "Y"
               NEXT SENTENCE
           ELSE
           GO TO 7-REQS-RPT.
           MOVE SPACES     TO SORT-REC.
           MOVE REQNUM     TO SORT-REQNO,
                              REQ-ARG.
           MOVE REQDATE    TO SORT-DATE.
           MOVE REQDEPT    TO SORT-DEPT.
           IF REQEXP = "      " GO TO 7-REQS-RPT.
           IF REQEXP = "000001" OR "000002" OR "000003" OR "000010"
               OR "000020" OR "000021" OR "000026" OR "000031"
               OR "000035" OR "000036" OR "000037" OR "000039"
               OR "000040" OR "000041" OR "000042" OR "000043"
               OR "000044" OR "000050" OR "000051" OR "000053"
               OR "000054" OR "000055" OR "000056" OR "000057"
               OR "000060" OR "000061" OR "000066" OR "000076"
               OR "000090" OR "000091" OR "000092" OR "000093"
               OR "000094"
                   MOVE "000250" TO SORT-EXP
           ELSE
           MOVE REQEXP     TO SORT-EXP.
           IF REQEXP NOT LESS THAN "000200" AND
               REQEXP NOT GREATER THAN "000500"
                   NEXT SENTENCE
           ELSE
           IF REQEXP = "000891" OR "000892" OR "000893"
               NEXT SENTENCE
           ELSE
           GO TO 7-REQS-RPT.
           IF SCREEN-EXP = SPACES
               NEXT SENTENCE
           ELSE
           IF SORT-EXP NOT = SCREEN-EXP GO TO 7-REQS-RPT.
           MOVE REQORIG    TO SORT-ORIG.
           MOVE "N"        TO DUP-SW.
           PERFORM 7-CKREQ-FOR-DUP-CC
               VARYING SUB4 FROM 1 BY 1
                   UNTIL SUB4 > 700.
           IF DUP-SW = "Y"
               NEXT SENTENCE
           ELSE
           ADD 1           TO SUB3
           MOVE REQORIG    TO CC-NO (SUB3).
           MOVE REQCOST    TO SORT-DOLS.
           MOVE REQ-ARG    TO REQNO OF DREQQUE-REC.
           START DREQQUE KEY = REQNO OF DREQQUE-REC
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF REQTYPE = "NM"
                   GO TO 7-REQS-RPT
               ELSE
               GO TO 7-RR-LOOP-CONT.
       7-RR-LOOP.
           READ DREQQUE NEXT INTO BUF-DREQQUE
               AT END    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               PERFORM 2-BLOWUP.
           IF DRQQ-REQ-NUMBER NOT = REQ-ARG
               GO TO 7-RR-LOOP-CONT.
           IF DRQQ-LEVEL-NUM = "00" GO TO 7-RR-LOOP.
           MOVE DRQQ-APPROVE-DATE-CN TO SORT-APPRDATE.
      *    IF SORT-APPRDATE NOT LESS THAN C-DATE-LOW
      *         AND SORT-APPRDATE NOT GREATER THAN C-DATE-HIGH
      *             NEXT SENTENCE
      *    ELSE
      *    GO TO 7-REQS-RPT.
       7-RR-LOOP-CONT.
           MOVE REQ-ARG TO REQNO OF DREQITM-REC.
           START DREQITM KEY >= REQNO OF DREQITM-REC
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               PERFORM 2-BLOWUP.
       7-ITM-LOOP.
           READ DREQITM NEXT INTO BUF-DREQITM
               AT END    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               PERFORM 2-BLOWUP.
           IF REQITM-REQ-NUMBER NOT = REQ-ARG
               GO TO 7-RELEASE-REQS-REC.
           MOVE REQITM-UM         TO SORT-UM.
           MOVE REQITM-CORP-CODE  TO SORT-CORPCODE,
                                     CODE-ARG.
           MOVE REQITM-QTY-TO-ORD TO SORT-QTY.
           IF REQTYPE = "SS" OR "SN"
               MOVE "F"               TO CDESC-DESC-OPTION
               MOVE 1                 TO CDESC-LINES-TO-GET
               MOVE "N"               TO CDESC-LOCAL-DESC-OPTION
               CALL "CDESC" USING CDESC-RET-CODE, BASE, STATUS-AREA,
                 BU-DISPLAY-MSG, CODE-ARG, CDESC-DATA
               IF BU-DISPLAY-MSG-1 NOT = SPACES
                   PERFORM 2-BLOWUP
               ELSE
               MOVE CDESC (1)         TO SORT-DESC
           ELSE
           MOVE 1                     TO   RQD-NUM-LINES
           CALL "TNRQDESC" USING RQD-NUM-LINES, BASE, STATUS-AREA,
             REQ-ARG, REQ-DESC-AREA, BU-DISPLAY-MSG
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               PERFORM 2-BLOWUP
           ELSE
           MOVE RQD-DESC (1)          TO SORT-DESC.
       7-RELEASE-REQS-REC.
           ADD 1 TO REQS-RCDS-CTR.
           RELEASE SORT-REC.
           GO TO 7-REQS-RPT.

       7-CHECK4-VAL-REQ-DEPT.
           IF REQDEPT = T-D (SUB)
               MOVE "Y" TO VALID-SW
               MOVE 26 TO SUB.

       7-CKREQ-FOR-DUP-CC.
           IF REQORIG = CC-NO (SUB4)
               MOVE "Y"               TO DUP-SW
               MOVE 701               TO SUB4
           ELSE
           IF CC-NO (SUB4) = SPACES
               SUBTRACT 1 FROM SUB4 GIVING SUB3
               MOVE 701               TO SUB4.

       7-RR-X.    EXIT.

       7-WITH-RPT.
           READ FPSTRALM AT END GO TO 7-WR-X.
           IF SCREEN-DATES = SPACES
               NEXT SENTENCE
           ELSE
           IF SRDATE NOT LESS THAN S-DATE-LOW
              AND SRDATE NOT GREATER THAN S-DATE-HIGH
                  NEXT SENTENCE
           ELSE
           GO TO 7-WITH-RPT.
           MOVE "N"        TO VALID-SW.
           PERFORM 7-CHECK4-VAL-SR-DEPT
               VARYING SUB FROM 1 BY 1
                   UNTIL SUB > 25.
           IF VALID-SW = "Y"
               NEXT SENTENCE
           ELSE
           GO TO 7-WITH-RPT.
           MOVE SPACES            TO SORT-REC.
           MOVE SRTRANS           TO SORT-TRANS.
           MOVE SRDATE            TO SORT-DATE.
           IF SREXP = "      " GO TO 7-WITH-RPT.
           IF SREXP = "000001" OR "000001" OR "000003" OR "000010"
               OR "000020" OR "000021" OR "000026" OR "000031"
               OR "000035" OR "000036" OR "000037" OR "000039"
               OR "000040" OR "000041" OR "000042" OR "000043"
               OR "000044" OR "000050" OR "000051" OR "000053"
               OR "000054" OR "000055" OR "000056" OR "000057"
               OR "000060" OR "000061" OR "000066" OR "000076"
               OR "000090" OR "000091" OR "000092" OR "000093"
               OR "000094"
                   MOVE "000250" TO SORT-EXP
           ELSE
           MOVE SREXP             TO SORT-EXP.
           IF SREXP NOT LESS THAN "000200"
              AND SREXP LESS THAN "000500"
                  NEXT SENTENCE
           ELSE
           IF SREXP = "000891" OR "000892" OR "000893"
               NEXT SENTENCE
           ELSE
           GO TO 7-WITH-RPT.
           IF SCREEN-EXP = SPACES
               NEXT SENTENCE
           ELSE
           IF SORT-EXP NOT = SCREEN-EXP GO TO 7-WITH-RPT.
           MOVE SRDEPT            TO SORT-DEPT.
           MOVE SRCCDE            TO SORT-CORPCODE,
                                     CODE-ARG.
           MOVE SREMP             TO SORT-ORIG.
           MOVE "N"               TO DUP-SW.
           PERFORM 7-CKISS-FOR-DUP-CC
               VARYING SUB4 FROM 1 BY 1
                   UNTIL SUB4 > 700.
           IF DUP-SW = "Y"
               NEXT SENTENCE
           ELSE
           ADD 1                  TO SUB3
           MOVE SREMP             TO CC-NO (SUB3).
           MOVE SRQTY             TO SORT-QTY.
           MOVE SRVAL             TO SORT-DOLS.
           MOVE "F"               TO CDESC-DESC-OPTION.
           MOVE 1                 TO CDESC-LINES-TO-GET.
           MOVE "N"               TO CDESC-LOCAL-DESC-OPTION.
           CALL "CDESC" USING CDESC-RET-CODE, BASE, STATUS-AREA,
             BU-DISPLAY-MSG, CODE-ARG, CDESC-DATA.
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               PERFORM 2-BLOWUP
           ELSE
           MOVE CDESC (1)         TO SORT-DESC.
           MOVE CODE-ARG TO MATLCODE OF MATL-ACCUM-REC.
           READ MATL-ACCUM INTO BUF-MATLACUM
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "23"
                   GO TO 7-WITH-RPT
               ELSE
               GO TO 2-BLOWUP.
           MOVE MATL-UNIT-MEASURE TO SORT-UM.
           MOVE CODE-ARG          TO MATLCODE OF DTRANS-REC.
           START DTRANS KEY = MATLCODE OF DTRANS-REC
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00" GO TO 7-RELEASE-WITH-REC.
       7-LOOP-DTRANS.
           READ DTRANS NEXT INTO BUF-DTRANS
               AT END    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "46"
                   GO TO 7-RELEASE-WITH-REC
               ELSE
               GO TO 2-BLOWUP.
           IF TRANS-STORES-CODE NOT = CODE-ARG
               GO TO 7-RELEASE-WITH-REC.
           IF TRANS-DATE-CN = SORT-DATE
               IF TRANS-WONO-7 = "A" OR "B" OR "C" OR "D" OR "E"
                   OR "F" OR "G" OR "H" OR "J" OR "K"
      *-------------- 1/04/2010: ADDED NEW WORKORDER LETTER SUFFIXES.
                   OR "M" OR "N" OR "P" OR "R" OR "S" OR "T"
                   OR "V" OR "W" OR "X" OR "Y"
                       MOVE TRANS-WONO TO SORT-WO
               ELSE
               GO TO 7-LOOP-DTRANS.
       7-RELEASE-WITH-REC.
           ADD 1 TO WITH-RCDS-CTR.
           RELEASE SORT-REC.
           GO TO 7-WITH-RPT.

       7-CHECK4-VAL-SR-DEPT.
           IF SRDEPT = T-D (SUB)
               MOVE "Y" TO VALID-SW
               MOVE 26 TO SUB.

       7-CKISS-FOR-DUP-CC.
           IF SREMP = CC-NO (SUB4)
               MOVE "Y" TO DUP-SW
               MOVE 701 TO SUB4
           ELSE
           IF CC-NO (SUB4) = SPACES
               SUBTRACT 1 FROM SUB4 GIVING SUB3
               MOVE 701 TO SUB4.

       7-WR-X.    EXIT.

       7-INVC-RPT.
           CLOSE DTRANS.
           OPEN INPUT DTRANS.
       7-IR-CONT.
           READ DTRANS NEXT INTO BUF-DTRANS
               AT END    GO TO 7-IR-X.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "46"
                   GO TO 7-IR-X
               ELSE
               PERFORM 2-BLOWUP.
           IF TRANS-CODE-TRANS = "INV" OR "FRT"
               NEXT SENTENCE
           ELSE
           GO TO 7-IR-CONT.
           IF TRANS-DEPT = SAVE-SDPT
               IF TRANS-STORES-CODE = "NON-STR"
                   NEXT SENTENCE
               ELSE
               GO TO 7-IR-CONT.
           IF SCREEN-DATES NOT = SPACES
               MOVE S-DATE-LOW    TO C-DATE-LOW
               MOVE S-DATE-HIGH   TO C-DATE-HIGH.
           IF TRANS-DATE-CN NOT LESS THAN C-DATE-LOW
               AND TRANS-DATE-CN NOT GREATER THAN C-DATE-HIGH
                   NEXT SENTENCE
           ELSE
           GO TO 7-IR-CONT.
           MOVE "N" TO VALID-SW.
           PERFORM 7-CHECK4-VAL-INV-DEPT
               VARYING SUB FROM 1 BY 1
                   UNTIL SUB > 25.
           IF VALID-SW = "Y"
               NEXT SENTENCE
           ELSE
           GO TO 7-IR-CONT.
           MOVE SPACES            TO SORT-REC.
           MOVE TRANS-CODE-TRANS  TO SORT-TRANS.
           MOVE TRANS-DATE-CN     TO SORT-DATE.
           MOVE TRANS-STORES-CODE TO SORT-CORPCODE,
                                     CODE-ARG.
           IF TRANS-STORES-CODE = "NON-STR"
               NEXT SENTENCE
           ELSE
           MOVE "F"               TO CDESC-DESC-OPTION
           MOVE 1                 TO CDESC-LINES-TO-GET
           MOVE "N"               TO CDESC-LOCAL-DESC-OPTION
           CALL "CDESC" USING CDESC-RET-CODE, BASE, STATUS-AREA,
             BU-DISPLAY-MSG, CODE-ARG, CDESC-DATA
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               PERFORM 2-BLOWUP
           ELSE
           MOVE CDESC (1)         TO SORT-DESC.
           MOVE TRANS-DEPT        TO SORT-DEPT.
           IF TRANS-ACCT-SPLIT = "000"
               MOVE "000200"      TO SORT-EXP
           ELSE
           IF TRANS-ACCT < "000100"
               MOVE "000250"      TO SORT-EXP
           ELSE
           IF TRANS-ACCT-1 = "2" OR "9"
               MOVE "000250"      TO SORT-EXP
           ELSE
           MOVE TRANS-ACCT        TO SORT-EXP.
           IF SCREEN-EXP = SPACES
               NEXT SENTENCE
           ELSE
           IF SORT-EXP = SCREEN-EXP
               NEXT SENTENCE
           ELSE
           GO TO 7-IR-CONT.
           MOVE TRANS-PO-NUM      TO SORT-PO.
           MOVE TRANS-QTY         TO SORT-QTY.
           MOVE TRANS-UNIT-MEASURE TO SORT-UM.
           MOVE TRANS-VALUE       TO SORT-DOLS.
           MOVE TRANS-ORDER-NUM   TO BUILD-PO-NO.
           MOVE TRANS-RELEASE     TO BUILD-PO-REL.
           MOVE TRANS-MANIFEST-NO TO SORT-MANIFEST-NO.
           MOVE TRANS-REGISTER-NO TO SORT-REGISTER-NO.
           MOVE BUILD-PO-NUM      TO PORCVNO OF DREQD-REC.
           START DREQD KEY = PORCVNO OF DREQD-REC
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00" GO TO 7-RELEASE-INVC-REC.
       7-IR-CONT-2.
           READ DREQD NEXT INTO BUF-DREQD
               AT END    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "23" OR "46"
                   NEXT SENTENCE
               ELSE
               PERFORM 2-BLOWUP
           ELSE
           IF DREQD-PO-RCV-NO NOT = BUILD-PO-NUM
               GO TO 7-IR-CONT-2
           ELSE
           IF DREQD-PO-ITM-NO = TRANS-ITEM-NUM
               MOVE DREQD-REQ-NUMBER TO SORT-REQNO,
                                        REQ-ARG
               IF SORT-DESC = SPACES
                   MOVE 1            TO   RQD-NUM-LINES
                   CALL "TNRQDESC" USING RQD-NUM-LINES, BASE,
                                     STATUS-AREA, REQ-ARG,
                                     REQ-DESC-AREA, BU-DISPLAY-MSG
                   IF BU-DISPLAY-MSG-1 NOT = SPACES
                       PERFORM 2-BLOWUP
                   ELSE
                   MOVE RQD-DESC (1) TO SORT-DESC
               ELSE
               NEXT SENTENCE
           ELSE
           GO TO 7-IR-CONT-2.

           IF SORT-REQNO = SPACES
               GO TO 7-RELEASE-INVC-REC.
           MOVE REQ-ARG    TO REQNO OF DREQQUE-REC.
           START DREQQUE KEY = REQNO OF DREQQUE-REC
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               GO TO 7-RELEASE-INVC-REC.
       7-IR-LOOP.
           READ DREQQUE NEXT INTO BUF-DREQQUE
               AT END    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               PERFORM 2-BLOWUP.
           IF DRQQ-REQ-NUMBER NOT = REQ-ARG
               GO TO 7-RELEASE-INVC-REC.
           IF DRQQ-LEVEL-NUM = "00" GO TO 7-IR-LOOP.
           MOVE DRQQ-APPROVE-DATE-CN TO SORT-APPRDATE.
       7-RELEASE-INVC-REC.
           IF SORT-DESC = SPACES
               MOVE 1                   TO  CNDESC-LINES-TO-GET
               MOVE 0                   TO  CNDESC-LINES-GOT
               MOVE SPACES              TO  CNDESC-LINE
               CALL "CNDESC" USING BASE, BUILD-PO-NUM,
                               TRANS-ITEM-NUM, CNDESC-DATA
               MOVE CNDESC (1)          TO  SORT-DESC.
           ADD 1                        TO  INVC-RCDS-CTR.
           RELEASE SORT-REC.
           GO TO 7-IR-CONT.

       7-CHECK4-VAL-INV-DEPT.
           IF TRANS-DEPT = T-D (SUB)
               MOVE "Y" TO VALID-SW
               MOVE 26 TO SUB.

       7-IR-X.    EXIT.

       7-SR-X.    EXIT.

       8-WRITE-REPORT SECTION.
       8-WR.
           IF S-RPT-REQS = "X"
               IF REQS-RCDS-CTR = 0
                   PERFORM 8-WRITE-HEADERS
                   MOVE SPACES TO PRINT-REC
                   MOVE "NO REQUISITIONS FOUND FOR SELECTION CRITERIA"
                       TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1
                   MOVE 61 TO LINE-CTR
                   MOVE " " TO S-RPT-REQS
                   GO TO 8-WR
               ELSE
               PERFORM 8-WRITE-REQS-RPT THRU 8-WRR-X
               GO TO 8-WR-X
           ELSE
           IF S-RPT-WITH = "X"
               IF WITH-RCDS-CTR = 0
                   PERFORM 8-WRITE-HEADERS
                   MOVE SPACES TO PRINT-REC
                   MOVE "NO ISSUES FOUND FOR SELECTION CRITERIA"
                       TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1
                   MOVE 61 TO LINE-CTR
                   MOVE " " TO S-RPT-WITH
                   GO TO 8-WR
               ELSE
               PERFORM 8-WRITE-WITH-RPT THRU 8-WWR-X
               GO TO 8-WR-X
           ELSE
           IF S-RPT-INVC = "X"
               IF INVC-RCDS-CTR = 0
                   PERFORM 8-WRITE-HEADERS
                   MOVE SPACES TO PRINT-REC
                   MOVE "NO INV RECORDS MATCHING INPUT CRITERIA"
                       TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1
                   MOVE 61 TO LINE-CTR
                   MOVE " " TO S-RPT-INVC
                   GO TO 8-WR
               ELSE
               PERFORM 8-WRITE-INVC-RPT THRU 8-WIR-X
               GO TO 8-WR-X
           ELSE
           GO TO 8-WR-X.

           GO TO 8-WR.

       8-WRITE-REQS-RPT.
           RETURN SORT-FILE
               AT END    GO TO 8-WRR-ENDING.
           IF SAVE-EXP = "      " MOVE SORT-EXP TO SAVE-EXP.
           IF SAVE-DEPT = "    " MOVE SORT-DEPT TO SAVE-DEPT.
           IF SAVE-ORIG = "9999" MOVE SORT-ORIG TO SAVE-ORIG.
           MOVE SPACES             TO DETAIL-1.
           MOVE SORT-REQNO         TO D-REQNO.
           IF SORT-APPRDATE = SPACES
               NEXT SENTENCE
           ELSE
           MOVE SORT-APP-CCYY      TO D-APP-CCYY
           MOVE SORT-APP-MM        TO D-APP-MM
           MOVE SORT-APP-DD        TO D-APP-DD
           MOVE "/"                TO D-SLASH-1
                                      D-SLASH-2.
           MOVE SORT-CORPCODE      TO D-CORPCODE.
           MOVE SORT-DESC          TO D-DESC.
           MOVE SORT-DEPT          TO D-DEPT.
           MOVE SORT-EXP           TO D-EXPNW.
           MOVE SORT-ORIG          TO D-ORIG.
           IF SORT-QTY-X = "      "
               MOVE 0              TO SORT-QTY.
           MOVE SORT-QTY           TO D-QTY.
           MOVE SORT-UM            TO D-UM.
           MOVE SORT-DOLS          TO D-DOLS.
           MOVE 0                  TO EXPWRT-SW.
           IF S-RPT-SREQ = "13"
               IF SORT-ORIG NOT = SAVE-ORIG
                   ADD 2 TO LINE-CTR
                   IF LINE-CTR > 61
                       PERFORM 8-WRITE-HEADERS
                   END-IF
                   MOVE SPACES     TO DETAIL-1A
                   MOVE "SUB TOTAL ORIG    " TO D-1A-VAR
                   MOVE TOTAL-QTYO TO D-TOTQTY-1A
                   MOVE TOTAL-DOLO TO D-TOTDOL-1A
                   MOVE DETAIL-1A  TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1
                   MOVE SPACES    TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1
                   MOVE ZEROES    TO TOTAL-QTYO
                                     TOTAL-DOLO
                   MOVE SORT-ORIG TO SAVE-ORIG
                   GO TO 8-WRR-CONT
               ELSE
               GO TO 8-WRR-CONT.
           IF SORT-EXP NOT = SAVE-EXP
               IF S-RPT-SREQ = "01" OR "02"
                   ADD 2           TO LINE-CTR
                   IF LINE-CTR > 61
                       PERFORM 8-WRITE-HEADERS
                   END-IF
                   MOVE SPACES     TO DETAIL-1A
                   MOVE "SUB TOTAL EXP CODE" TO D-1A-VAR
                   MOVE TOTAL-QTYE TO D-TOTQTY-1A
                   MOVE TOTAL-DOLE TO D-TOTDOL-1A
                   MOVE DETAIL-1A  TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1
                   MOVE SPACES    TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1
                   IF SAVE-SCREEN-TEAM = "ALL " OR " ALL"
                       PERFORM 8-WRR-SUMMARY-E
                           VARYING SUB FROM 1 BY 1
                               UNTIL SUB = 400
                   END-IF
                   MOVE ZEROES    TO TOTAL-QTYE
                                     TOTAL-DOLE
                   MOVE SORT-EXP  TO SAVE-EXP
                   MOVE 1         TO EXPWRT-SW.
           IF SORT-DEPT NOT = SAVE-DEPT
               IF S-RPT-SREQ = "01" OR "03" OR "11"
                   IF EXPWRT-SW = 0
                       ADD 2           TO LINE-CTR
                       IF LINE-CTR > 61
                           PERFORM 8-WRITE-HEADERS
                       END-IF
                       MOVE SPACES     TO DETAIL-1A
                       MOVE "SUB TOTAL EXP CODE" TO D-1A-VAR
                       MOVE TOTAL-QTYE TO D-TOTQTY-1A
                       MOVE TOTAL-DOLE TO D-TOTDOL-1A
                       MOVE DETAIL-1A  TO PRINT-REC
                       WRITE PRINT-REC AFTER ADVANCING 1
                       MOVE SPACES     TO PRINT-REC
                       WRITE PRINT-REC AFTER ADVANCING 1
                       IF SAVE-SCREEN-TEAM = "ALL " OR " ALL"
                           PERFORM 8-WRR-SUMMARY-E
                               VARYING SUB FROM 1 BY 1
                                   UNTIL SUB = 400
                       END-IF
                       MOVE ZEROES     TO TOTAL-QTYE
                                          TOTAL-DOLE
                       MOVE SORT-EXP   TO SAVE-EXP
                       MOVE 1          TO EXPWRT-SW
                   END-IF
                   ADD 2 TO LINE-CTR
                   IF LINE-CTR > 61
                       PERFORM 8-WRITE-HEADERS
                   END-IF
                   MOVE SPACES TO DETAIL-1B
                   MOVE "SUB TOTAL DEPT" TO D-1B-VAR
                   MOVE TOTAL-QTYD TO D-TOTQTY-1B
                   MOVE TOTAL-DOLD TO D-TOTDOL-1B
                   MOVE DETAIL-1B  TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1
                   MOVE SPACES     TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1
                   MOVE ZEROES     TO TOTAL-QTYD
                                      TOTAL-DOLD
                                      TOTAL-QTYE
                                      TOTAL-DOLE
                   MOVE SORT-DEPT  TO SAVE-DEPT.
       8-WRR-CONT.
           ADD 1 TO LINE-CTR.
           IF LINE-CTR > 61
               PERFORM 8-WRITE-HEADERS.
           ADD SORT-QTY       TO TOTAL-QTYE.
           ADD SORT-QTY       TO TOTAL-QTYD.
           ADD SORT-QTY       TO TOTAL-QTYO.
           ADD SORT-QTY       TO TOTAL-QTYT.
           ADD SORT-DOLS      TO TOTAL-DOLE.
           ADD SORT-DOLS      TO TOTAL-DOLD.
           ADD SORT-DOLS      TO TOTAL-DOLO.
           ADD SORT-DOLS      TO TOTAL-DOLT.
           MOVE DETAIL-1      TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1.
           GO TO 8-WRITE-REQS-RPT.

      *8-WRR-SUMMARY-O.
      *    IF ORIG-T (SUB) = SAVE-ORIG
      *        ADD TOTAL-QTYO TO QTY-T (SUB)
      *        ADD TOTAL-DOLO TO DOL-T (SUB)
      *        MOVE 399       TO SUB
      *    ELSE
      *    IF ORIG-T (SUB) = "    "
      *        MOVE SAVE-ORIG TO ORIG-T (SUB)
      *        ADD TOTAL-QTYO TO QTY-T (SUB)
      *        ADD TOTAL-DOLO TO DOL-T (SUB)
      *        MOVE 399       TO SUB.
      *
      *8-WRR-SUMMARY-D.
      *    IF DEPT-T (SUB) = SAVE-DEPT
      *        ADD TOTAL-QTYD TO QTY-T (SUB)
      *        ADD TOTAL-DOLD TO DOL-T (SUB)
      *        MOVE 399       TO SUB
      *    ELSE
      *    IF DEPT-T (SUB) = "    "
      *        MOVE SAVE-DEPT TO DEPT-T (SUB)
      *        ADD TOTAL-QTYD TO QTY-T (SUB)
      *        ADD TOTAL-DOLD TO DOL-T (SUB)
      *        MOVE 399       TO SUB.

       8-WRR-SUMMARY-E.
           IF EXPNW-T (SUB) = SAVE-EXP
               ADD TOTAL-QTYE TO QTY-T (SUB)
               ADD TOTAL-DOLE TO DOL-T (SUB)
               MOVE 399       TO SUB
           ELSE
           IF EXPNW-T (SUB) = "      "
               MOVE SAVE-EXP  TO EXPNW-T (SUB)
               ADD TOTAL-QTYE TO QTY-T (SUB)
               ADD TOTAL-DOLE TO DOL-T (SUB)
               MOVE 399       TO SUB.

       8-WRR-ENDING.
           ADD 6 TO LINE-CTR.
           IF LINE-CTR > 61
               PERFORM 8-WRITE-HEADERS.
           IF S-RPT-SREQ = "13"
               MOVE SPACES     TO DETAIL-1A
               MOVE "SUB TOTAL ORIG    " TO D-1A-VAR
               MOVE TOTAL-QTYO TO D-TOTQTY-1A
               MOVE TOTAL-DOLO TO D-TOTDOL-1A
               MOVE DETAIL-1A  TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1
               MOVE SPACES    TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1
               MOVE ZEROES    TO TOTAL-QTYO
                                 TOTAL-DOLO
               MOVE "9999"    TO SAVE-ORIG
               MOVE SPACES TO DETAIL-1C
               MOVE "GRAND TOTAL     " TO D-1C-VAR
               MOVE TOTAL-QTYT TO D-TOTQTY-1C
               MOVE TOTAL-DOLT TO D-TOTDOL-1C
               MOVE DETAIL-1C  TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 2
               MOVE " "        TO S-RPT-REQS
               MOVE "      "   TO SAVE-EXP
               MOVE "    "     TO SAVE-DEPT
               MOVE 61         TO LINE-CTR
               GO TO 8-WRR-X.
           MOVE SPACES     TO DETAIL-1A.
           MOVE "SUB TOTAL EXP CODE" TO D-1A-VAR.
           MOVE TOTAL-QTYE TO D-TOTQTY-1A.
           MOVE TOTAL-DOLE TO D-TOTDOL-1A.
           MOVE DETAIL-1A  TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1.
           MOVE SPACES    TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1.
           IF SAVE-SCREEN-TEAM = "ALL " OR " ALL"
               PERFORM 8-WRR-SUMMARY-E
                   VARYING SUB FROM 1 BY 1
                       UNTIL SUB = 400.
           MOVE SPACES TO DETAIL-1B.
           MOVE "SUB TOTAL DEPT" TO D-1B-VAR.
           MOVE TOTAL-QTYD TO D-TOTQTY-1B.
           MOVE TOTAL-DOLD TO D-TOTDOL-1B.
           MOVE DETAIL-1B  TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1.
           MOVE SPACES     TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1.
           MOVE SPACES TO DETAIL-1C.
           MOVE "GRAND TOTAL TEAM" TO D-1C-VAR.
           MOVE TOTAL-QTYT TO D-TOTQTY-1C.
           MOVE TOTAL-DOLT TO D-TOTDOL-1C.
           MOVE DETAIL-1C  TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 2.
           MOVE " "        TO S-RPT-REQS.
           MOVE "      "   TO SAVE-EXP.
           MOVE "    "     TO SAVE-DEPT.
           MOVE 61         TO LINE-CTR.
       8-WRR-X.    EXIT.

       8-WRITE-WITH-RPT.
           RETURN SORT-FILE
               AT END    GO TO 8-WWR-ENDING.
           IF SAVE-EXP = "      " MOVE SORT-EXP TO SAVE-EXP.
           IF SAVE-DEPT = "    " MOVE SORT-DEPT TO SAVE-DEPT.
           IF SAVE-ORIG = "9999" MOVE SORT-ORIG TO SAVE-ORIG.
           MOVE SPACES             TO DETAIL-1.
           MOVE SORT-TRANS         TO D-REQNO.
           MOVE SORT-DATE-CCYY     TO D-APP-CCYY.
           MOVE SORT-DATE-MM       TO D-APP-MM.
           MOVE SORT-DATE-DD       TO D-APP-DD.
           MOVE "/"                TO D-SLASH-1
                                      D-SLASH-2.
           MOVE SORT-CORPCODE      TO D-CORPCODE.
           MOVE SORT-DESC          TO D-DESC.
           MOVE SORT-DEPT          TO D-DEPT.
           MOVE SORT-EXP           TO D-EXPNW.
           MOVE SORT-ORIG          TO D-ORIG.
           IF SORT-QTY-X = "      "
               MOVE 0              TO SORT-QTY.
           MOVE SORT-QTY           TO D-QTY.
           MOVE SORT-UM            TO D-UM.
           MOVE SORT-DOLS          TO D-DOLS.
           MOVE SORT-WO            TO D-WO.
           MOVE 0                  TO EXPWRT-SW.
           IF S-RPT-SWIT = "23"
               IF SORT-ORIG NOT = SAVE-ORIG
                   ADD 2 TO LINE-CTR
                   IF LINE-CTR > 61
                       PERFORM 8-WRITE-HEADERS
                   END-IF
                   MOVE SPACES     TO DETAIL-1A
                   MOVE "SUB TOTAL ORIG    " TO D-1A-VAR
                   MOVE TOTAL-QTYO TO D-TOTQTY-1A
                   MOVE TOTAL-DOLO TO D-TOTDOL-1A
                   MOVE DETAIL-1A  TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1
                   MOVE SPACES    TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1
                   MOVE ZEROES    TO TOTAL-QTYO
                                     TOTAL-DOLO
                   MOVE SORT-ORIG TO SAVE-ORIG
                   GO TO 8-WWR-CONT
               ELSE
               GO TO 8-WWR-CONT.
           IF SORT-EXP NOT = SAVE-EXP
               IF S-RPT-SWIT = "01" OR "02"
                   ADD 2           TO LINE-CTR
                   IF LINE-CTR > 61
                       PERFORM 8-WRITE-HEADERS
                   END-IF
                   MOVE SPACES     TO DETAIL-1A
                   MOVE "SUB TOTAL EXP CODE" TO D-1A-VAR
                   MOVE TOTAL-QTYE TO D-TOTQTY-1A
                   MOVE TOTAL-DOLE TO D-TOTDOL-1A
                   MOVE DETAIL-1A  TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1
                   MOVE SPACES    TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1
                   IF SAVE-SCREEN-TEAM = "ALL " OR " ALL"
                       PERFORM 8-WRR-SUMMARY-E
                           VARYING SUB FROM 1 BY 1
                               UNTIL SUB = 400
                   END-IF
                   MOVE ZEROES    TO TOTAL-QTYE
                                     TOTAL-DOLE
                   MOVE SORT-EXP  TO SAVE-EXP
                   MOVE 1         TO EXPWRT-SW.
           IF SORT-DEPT NOT = SAVE-DEPT
               IF S-RPT-SWIT = "01" OR "03" OR "21"
                   IF EXPWRT-SW = 0
                       ADD 2           TO LINE-CTR
                       IF LINE-CTR > 61
                           PERFORM 8-WRITE-HEADERS
                       END-IF
                       MOVE SPACES     TO DETAIL-1A
                       MOVE "SUB TOTAL EXP CODE" TO D-1A-VAR
                       MOVE TOTAL-QTYE TO D-TOTQTY-1A
                       MOVE TOTAL-DOLE TO D-TOTDOL-1A
                       MOVE DETAIL-1A  TO PRINT-REC
                       WRITE PRINT-REC AFTER ADVANCING 1
                       MOVE SPACES     TO PRINT-REC
                       WRITE PRINT-REC AFTER ADVANCING 1
                       IF SAVE-SCREEN-TEAM = "ALL " OR " ALL"
                           PERFORM 8-WRR-SUMMARY-E
                               VARYING SUB FROM 1 BY 1
                                   UNTIL SUB = 400
                       END-IF
                       MOVE ZEROES     TO TOTAL-QTYE
                                          TOTAL-DOLE
                       MOVE SORT-EXP   TO SAVE-EXP
                       MOVE 1          TO EXPWRT-SW
                   END-IF
                   ADD 2 TO LINE-CTR
                   IF LINE-CTR > 61
                       PERFORM 8-WRITE-HEADERS
                   END-IF
                   MOVE SPACES TO DETAIL-1B
                   MOVE "SUB TOTAL DEPT" TO D-1B-VAR
                   MOVE TOTAL-QTYD TO D-TOTQTY-1B
                   MOVE TOTAL-DOLD TO D-TOTDOL-1B
                   MOVE DETAIL-1B  TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1
                   MOVE SPACES     TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1
                   MOVE ZEROES     TO TOTAL-QTYD
                                      TOTAL-DOLD
                                      TOTAL-QTYE
                                      TOTAL-DOLE
                   MOVE SORT-DEPT  TO SAVE-DEPT.
       8-WWR-CONT.
           ADD 1 TO LINE-CTR.
           IF LINE-CTR > 61
               PERFORM 8-WRITE-HEADERS.
           ADD SORT-QTY       TO TOTAL-QTYE.
           ADD SORT-QTY       TO TOTAL-QTYD.
           ADD SORT-QTY       TO TOTAL-QTYO.
           ADD SORT-QTY       TO TOTAL-QTYT.
           ADD SORT-DOLS      TO TOTAL-DOLE.
           ADD SORT-DOLS      TO TOTAL-DOLD.
           ADD SORT-DOLS      TO TOTAL-DOLO.
           ADD SORT-DOLS      TO TOTAL-DOLT.
           MOVE DETAIL-1      TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1.
           GO TO 8-WRITE-WITH-RPT.

       8-WWR-ENDING.
           ADD 6 TO LINE-CTR.
           IF LINE-CTR > 61
               PERFORM 8-WRITE-HEADERS.
           IF S-RPT-SWIT = "23"
               MOVE SPACES     TO DETAIL-1A
               MOVE "SUB TOTAL ORIG    " TO D-1A-VAR
               MOVE TOTAL-QTYO TO D-TOTQTY-1A
               MOVE TOTAL-DOLO TO D-TOTDOL-1A
               MOVE DETAIL-1A  TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1
               MOVE SPACES    TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1
               MOVE ZEROES    TO TOTAL-QTYO
                                 TOTAL-DOLO
               MOVE "9999"     TO SAVE-ORIG
               MOVE SPACES TO DETAIL-1C
               MOVE "GRAND TOTAL     " TO D-1C-VAR
               MOVE TOTAL-QTYT TO D-TOTQTY-1C
               MOVE TOTAL-DOLT TO D-TOTDOL-1C
               MOVE DETAIL-1C  TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 2
               MOVE " "        TO S-RPT-WITH
               MOVE "      "   TO SAVE-EXP
               MOVE "    "     TO SAVE-DEPT
               MOVE 61         TO LINE-CTR
               GO TO 8-WWR-X.
           IF S-RPT-SWIT = "01" OR "02"
               MOVE SPACES     TO DETAIL-1A
               MOVE "SUB TOTAL EXP CODE" TO D-1A-VAR
               MOVE TOTAL-QTYE TO D-TOTQTY-1A
               MOVE TOTAL-DOLE TO D-TOTDOL-1A
               MOVE DETAIL-1A  TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1
               IF SAVE-SCREEN-TEAM = "ALL " OR " ALL"
                   PERFORM 8-WRR-SUMMARY-E
                       VARYING SUB FROM 1 BY 1
                           UNTIL SUB = 400.
           MOVE SPACES         TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1.
           MOVE SPACES TO DETAIL-1B.
           MOVE "SUB TOTAL DEPT" TO D-1B-VAR.
           MOVE TOTAL-QTYD TO D-TOTQTY-1B.
           MOVE TOTAL-DOLD TO D-TOTDOL-1B.
           MOVE DETAIL-1B  TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1.
           MOVE SPACES     TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1.
           MOVE SPACES TO DETAIL-1C.
           MOVE "GRAND TOTAL TEAM" TO D-1C-VAR.
           MOVE TOTAL-QTYT TO D-TOTQTY-1C.
           MOVE TOTAL-DOLT TO D-TOTDOL-1C.
           MOVE DETAIL-1C  TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 2.
           MOVE " "        TO S-RPT-WITH.
           MOVE "      "   TO SAVE-EXP.
           MOVE "    "     TO SAVE-DEPT.
           MOVE 61         TO LINE-CTR.
       8-WWR-X.    EXIT.

       8-WRITE-INVC-RPT.
           RETURN SORT-FILE
               AT END
                   ADD 6 TO LINE-CTR
                   IF LINE-CTR > 61
                       PERFORM 8-WRITE-HEADERS
                   END-IF
                   IF S-RPT-SINV = "01" OR "02"
                       MOVE SPACES     TO DETAIL-2A
                       MOVE "SUB TOTAL EXP CODE" TO D-2A-VAR
                       MOVE TOTAL-QTYE TO D-TOTQTY-2A
                       MOVE TOTAL-DOLE TO D-TOTDOL-2A
                       MOVE DETAIL-2A  TO PRINT-REC
                       WRITE PRINT-REC AFTER ADVANCING 1
                       IF SAVE-SCREEN-TEAM = "ALL " OR " ALL"
                           PERFORM 8-WRR-SUMMARY-E
                               VARYING SUB FROM 1 BY 1
                                   UNTIL SUB = 400
                       END-IF
                   END-IF
                   MOVE SPACES    TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1
                   MOVE SPACES TO DETAIL-2B
                   MOVE "SUB TOTAL DEPT" TO D-2B-VAR
                   MOVE TOTAL-QTYD TO D-TOTQTY-2B
                   MOVE TOTAL-DOLD TO D-TOTDOL-2B
                   MOVE DETAIL-2B  TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1
                   MOVE SPACES     TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1
                   MOVE SPACES TO DETAIL-2C
                   MOVE "GRAND TOTAL TEAM" TO D-2C-VAR
                   MOVE TOTAL-QTYT TO D-TOTQTY-2C
                   MOVE TOTAL-DOLT TO D-TOTDOL-2C
                   MOVE DETAIL-2C  TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 2
                   MOVE " "        TO S-RPT-INVC
                   MOVE "      "   TO SAVE-EXP
                   MOVE "    "     TO SAVE-DEPT
                   MOVE 61         TO LINE-CTR
                   GO TO 8-WIR-X.
           IF SAVE-EXP = "      " MOVE SORT-EXP TO SAVE-EXP.
           IF SAVE-DEPT = "    " MOVE SORT-DEPT TO SAVE-DEPT.
           MOVE SPACES             TO DETAIL-2.
           MOVE SORT-REQNO         TO D-REQNO-2
           IF SORT-DATE = SPACES
               NEXT SENTENCE
           ELSE
           MOVE SORT-DATE-MM       TO D-PAY-MM-2
           MOVE SORT-DATE-DD       TO D-PAY-DD-2
           MOVE SORT-DATE-CCYY     TO D-PAY-CCYY-2
           MOVE "/"                TO D-SLASH-3,
                                      D-SLASH-4.
           MOVE SORT-CORPCODE      TO D-CORPCODE-2.
           MOVE SORT-DESC          TO D-DESC-2.
           MOVE SORT-DEPT          TO D-DEPT-2.
           MOVE SORT-EXP           TO D-EXP-2.
           MOVE SORT-PONO          TO D-PONO-2.
           IF SORT-QTY-X = "      "
               MOVE 0              TO SORT-QTY.
           MOVE SORT-QTY           TO D-QTY-2.
           MOVE SORT-UM            TO D-UM-2.
           MOVE SORT-DOLS          TO D-DOLS-2.
           IF SORT-MANIFEST-NO = "   "
               NEXT SENTENCE
           ELSE
           IF SORT-TRANS = "FRT "
               MOVE SORT-MANIFEST-NO TO D-FBA-2
               MOVE SORT-REGISTER-NO TO D-FBB-2
           ELSE
           MOVE SORT-MANIFEST-NO   TO D-MANNO-2
           MOVE "/"                TO D-SLASH-5
           MOVE SORT-REGISTER-NO   TO D-REGNO-2.
           IF SORT-APPRDATE = SPACES
               NEXT SENTENCE
           ELSE
           MOVE SORT-APP-CCYY      TO D-APP-CCYY-2
           MOVE SORT-APP-MM        TO D-APP-MM-2
           MOVE SORT-APP-DD        TO D-APP-DD-2
           MOVE "/"                TO D-SLASH-6
                                      D-SLASH-7.
           MOVE 0                  TO EXPWRT-SW.
           IF SORT-EXP NOT = SAVE-EXP
               IF S-RPT-SINV = "01" OR "02"
                   ADD 2           TO LINE-CTR
                   IF LINE-CTR > 61
                       PERFORM 8-WRITE-HEADERS
                   END-IF
                   MOVE SPACES     TO DETAIL-2A
                   MOVE "SUB TOTAL EXP CODE" TO D-2A-VAR
                   MOVE TOTAL-QTYE TO D-TOTQTY-2A
                   MOVE TOTAL-DOLE TO D-TOTDOL-2A
                   MOVE DETAIL-2A  TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1
                   MOVE SPACES    TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1
                   IF SAVE-SCREEN-TEAM = "ALL " OR " ALL"
                       PERFORM 8-WRR-SUMMARY-E
                           VARYING SUB FROM 1 BY 1
                               UNTIL SUB = 400
                   END-IF
                   MOVE ZEROES    TO TOTAL-QTYE
                                     TOTAL-DOLE
                   MOVE SORT-EXP  TO SAVE-EXP
                   MOVE 1         TO EXPWRT-SW.
           IF SORT-DEPT NOT = SAVE-DEPT
               IF S-RPT-SINV = "01" OR "03" OR "31" OR "33"
                   IF EXPWRT-SW = 0
                       ADD 2           TO LINE-CTR
                       IF LINE-CTR > 61
                           PERFORM 8-WRITE-HEADERS
                       END-IF
                       MOVE SPACES     TO DETAIL-2A
                       MOVE "SUB TOTAL EXP CODE" TO D-2A-VAR
                       MOVE TOTAL-QTYE TO D-TOTQTY-2A
                       MOVE TOTAL-DOLE TO D-TOTDOL-2A
                       MOVE DETAIL-2A  TO PRINT-REC
                       WRITE PRINT-REC AFTER ADVANCING 1
                       MOVE SPACES     TO PRINT-REC
                       WRITE PRINT-REC AFTER ADVANCING 1
                       IF SAVE-SCREEN-TEAM = "ALL " OR " ALL"
                           PERFORM 8-WRR-SUMMARY-E
                               VARYING SUB FROM 1 BY 1
                                   UNTIL SUB = 400
                       END-IF
                       MOVE ZEROES     TO TOTAL-QTYE
                                          TOTAL-DOLE
                       MOVE SORT-EXP   TO SAVE-EXP
                       MOVE 1          TO EXPWRT-SW
                   END-IF
                   ADD 2 TO LINE-CTR
                   IF LINE-CTR > 61
                       PERFORM 8-WRITE-HEADERS
                   END-IF
                   MOVE SPACES TO DETAIL-2B
                   MOVE "SUB TOTAL DEPT" TO D-2B-VAR
                   MOVE TOTAL-QTYD TO D-TOTQTY-2B
                   MOVE TOTAL-DOLD TO D-TOTDOL-2B
                   MOVE DETAIL-2B  TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1
                   MOVE SPACES     TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1
                   MOVE ZEROES     TO TOTAL-QTYD
                                      TOTAL-DOLD
                                      TOTAL-QTYE
                                      TOTAL-DOLE
                   MOVE SORT-DEPT  TO SAVE-DEPT.
           ADD 1 TO LINE-CTR.
           IF LINE-CTR > 61
               PERFORM 8-WRITE-HEADERS.
           ADD SORT-QTY       TO TOTAL-QTYE.
           ADD SORT-QTY       TO TOTAL-QTYD.
           ADD SORT-QTY       TO TOTAL-QTYO.
           ADD SORT-QTY       TO TOTAL-QTYT.
           ADD SORT-DOLS      TO TOTAL-DOLE.
           ADD SORT-DOLS      TO TOTAL-DOLD.
           ADD SORT-DOLS      TO TOTAL-DOLO.
           ADD SORT-DOLS      TO TOTAL-DOLT.
           MOVE DETAIL-2      TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1.
           GO TO 8-WRITE-INVC-RPT.
       8-WIR-X.    EXIT.

       8-WRITE-HEADERS.
           MOVE 0          TO LINE-CTR.
           MOVE SPACES     TO PRINT-REC.
           IF SCREEN-DATES NOT = SPACES
               MOVE "FROM/TO DATES " TO H0-LIT
               MOVE S-DATE-LOW       TO H0-DFR
               MOVE "-"              TO H0-LIT2
               MOVE S-DATE-HIGH      TO H0-DTO
           ELSE
           MOVE "FROM/TO DATE "      TO H0-LIT
           MOVE C-DATE-LOW           TO H0-DFR
           MOVE "-"                  TO H0-LIT2
           MOVE C-DATE-HIGH          TO H0-DTO.
           MOVE HEADER-0   TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING NEW-PAGE.
           MOVE SPACES TO H1-DEPTS H2-DEPTS.
           PERFORM 80-MOVE-H1-DEPTS
               VARYING SUB1 FROM 1 BY 1 UNTIL SUB1 > 6.
           MOVE 0          TO SUB.
           PERFORM 80-MOVE-H2-DEPTS
               VARYING SUB1 FROM 7 BY 1 UNTIL SUB1 > 12.
           MOVE HEADER-1   TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1.
           IF S-RPT-REQS = "X"
               MOVE "     REQUISITIONS   " TO H2-VAR
               MOVE HEADER-2   TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1
               MOVE HEADER-3   TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 2
               MOVE HEADER-4   TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1
           ELSE
           IF S-RPT-WITH = "X"
               MOVE "  STORES WITHDRAWALS" TO H2-VAR
               MOVE HEADER-2   TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1
               MOVE HEADER-5   TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 2
               MOVE HEADER-6   TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1
           ELSE
           IF S-RPT-INVC = "X"
               MOVE "      INVOICES      " TO H2-VAR
               MOVE HEADER-2   TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1
               MOVE HEADER-7   TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 2
               MOVE HEADER-8   TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1.
           MOVE 6 TO LINE-CTR.

       80-MOVE-H1-DEPTS.
           MOVE T-D (SUB1) TO H1-D (SUB1).

       80-MOVE-H2-DEPTS.
           ADD 1           TO SUB.
           MOVE T-D (SUB1) TO H2-D (SUB).

       8-WR-X.    EXIT.
