000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TSUFFSUM.
000500*****************************************************************
000600*
000700*REMARKS.       THIS PROGRAM WRITES A REPORT LISTING ALL SUFFIXED
000800*               WORK ORDERS UNDER A CERTAIN MASTER. THE ESTIMATED
000900*               AND ACTUAL COSTS ARE CALCULATED FOR EACH SUFFIX.
001000*
001100*****************************************************************
      *C
      *C  09/11/1996    CA YODER
      *C    RE-COMPILED PROGRAM TO PICK UP CENTURY DATABASE CHANGES.
      *C
001300 ENVIRONMENT DIVISION.
001400 CONFIGURATION SECTION.
001500 SOURCE-COMPUTER. AS400.
001600 OBJECT-COMPUTER. AS400.
       COPY SPECIALN OF COPYLIB.
002100 INPUT-OUTPUT SECTION.
002200 FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZPLANNER-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT JOBPLAN-FILE
               ASSIGN TO DATABASE-MCFLMM1801
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS JF-STATUS.
002400     SELECT PRNT-FILE ASSIGN TO PRINTER-MCPRT.
002300     SELECT SORT-FILE ASSIGN TO DISK-SORTFILE.
           SELECT WO-LABOR-FILE
               ASSIGN TO DATABASE-MCFLMM1301
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS WLF-STATUS.
           SELECT WO-LAST-NUM-USED
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ARG-NO
               FILE STATUS IS WLNU-STATUS.
           SELECT WO-PARTS-FILE
               ASSIGN TO DATABASE-MCFLMM1201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS WPFD-STATUS.
           SELECT WO-PLANNED-FILE
               ASSIGN TO DATABASE-MCFLMM1101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WPF-STATUS.
002600 DATA DIVISION.
002700 FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).
       FD  JOBPLAN-FILE
           LABEL RECORD IS STANDARD
           DATA RECORD IS JOBPF.
       01  JOBPF.
           COPY DD-MCRPMM1800 OF MCFLMM1801.
005000 FD  PRNT-FILE
005100     RECORD CONTAINS 132 CHARACTERS
005200     LABEL RECORD IS OMITTED
005300     DATA RECORD IS PRNTF.
005400 01  PRNTF.
           05  PRNTF-TYPE     PIC X(8).
           05  PRNTF-LINE     PIC X(124).
002900 SD  SORT-FILE
003000     RECORD CONTAINS 168 CHARACTERS
003100     DATA RECORD IS SORTF.
003200 01  SORTF.
003300     05 S-ZONE          PIC X(4).
003400     05 S-DEPT          PIC X(4).
003500     05 S-WONUM         PIC X(10).
003600     05 S-ASTERISK      PIC X.
003700     05 S-STATUS        PIC X(2).
003800     05 S-AC            PIC X.
003900     05 S-EQPNUM        PIC X(6).
004000     05 S-DESCRIPTION   PIC X(30).
004100     05 S-CLASS         PIC X(8).
004200     05 S-BUDGET        PIC X(16).
004300     05 S-REQUEST       PIC X(12).
004400     05 S-LABOR-CST     PIC 9(12).
004500     05 S-MATER-CST     PIC 9(15).
004600     05 S-PURCH-CST     PIC 9(15).
004700     05 S-TOTAL-CST     PIC 9(16).
004800     05 S-ESTIMATE      PIC 9(16).
       FD  WO-LABOR-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WOLABF.
       01  WOLABF.
           COPY DD-MCRPMM1300 OF MCFLMM1301.
       FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD.
       01  LAST-NUM-USED-REC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.
       FD  WO-PARTS-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WOPARF.
       01  WOPARF.
           COPY DD-MCRPMM1200 OF MCFLMM1201.
       FD  WO-PLANNED-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFREC.
       01  WPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.
005700 WORKING-STORAGE SECTION.
005900 01  ARG-NO             PIC 9(9).
006000
006100 01  A-CODE             PIC X.
006200
006300 01  BASE1              PIC X(24).
006400
006500 01  BUDGET-INPUT.
           05  BI-1           PIC X(3).
           05  BI-DASH-1      PIC X.
           05  BI-2           PIC XX.
           05  BI-DASH-2      PIC X.
           05  BI-3           PIC XX.
           05  BI-DASH-3      PIC X.
           05  BI-4           PIC XXX.
           05  BI-REVNO       PIC X.
           05  BI-5           PIC XX.
006600
006700 01  C-L-R.
006800     05 CRAFT-LABOR-RATE
006900                       PIC 999999V99.
007000
007700 01  CLASS-INPUT        PIC X(8).
007800
007100 01  CODE-INPUT         PIC X.
007200
       01  COMPRESS-PRINT.
           05  COMPRESS-CHARS PIC 9(12) COMP-4.

       COPY CPYIND  OF COPYLIB.

007900 01  CRAFT-TABLE.
008000     05 C-R-ENTRY OCCURS 200 TIMES INDEXED BY CRAFT-INDEX.
008100        10 CRAFT        PIC XX.
008200        10 RATE         PIC 999999V99.
008300
008400 COPY CMANREQ IN COPYLIB.
008500
008600 COPY TDATESUB OF COPYLIB.
008700
008800 01  DBPARAMETERS.      COPY DBPARMS OF COPYLIB.
008900
009000 01  DBPARAMETERS-STORES.
009100     05  BASE2          PIC X(24).
009200     05  DSET-NAME-S    PIC X(16).
009300     05  PASSWORD-S     PIC X(8).
009400     05  PASS-FILENUM   PIC S9(4) COMP.
009500
009600 01  DEPT-INPUT         PIC X(4).
009700
009800 COPY ESCNAME IN COPYLIB.
009900
010000 01  END-OF-FILE-SW     PIC X VALUE "N".
010100     88 END-OF-SORT-FILE      VALUE "Y".
010200
010300 01  EQPNUM-INPUT       PIC X(6).
010400
       01  FILE-STATUSES.
           05  DSPLY-STATUS   PIC XX.
           05  JF-STATUS      PIC XX.
           05  WLF-STATUS     PIC XX.
           05  WLNU-STATUS    PIC XX.
           05  WPFD-STATUS    PIC XX.
           05  WPF-STATUS     PIC XX.

010500 01  H-FIELD.
010600     05 H-FIELD-1          PIC X(15).
010700     05 H-FIELD-2          PIC X(16).
010800
010900 01  HEADER-LINE1.
011000     05 WONUM-H            PIC X(12) VALUE "Wonum".
011100     05 STATUS-H           PIC X(4)  VALUE "ST".
011200     05 EQPNUM-H           PIC X(8)  VALUE "Eqpnum".
011300     05 DESCRIPTION-H      PIC X(32) VALUE "Description".
011400     05 CLASS-H            PIC X(11) VALUE "Exp_class".
011500     05 BUDGET-H           PIC X(18) VALUE "Budget_Num".
011600     05 REQUEST-H          PIC X(15) VALUE "Request_Num".
011700     05 ZONE-H             PIC X(6)  VALUE "Zone".
011800     05 DEPT-H             PIC X(6)  VALUE "Dept".
011900     05 APPRCODE-H         PIC X(3)  VALUE "A_C".
012000
012100 01  HEADER-LINE2.
012200     05 FILLR-H            PIC X(12) VALUE SPACES.
012300     05 LABOR-H            PIC X(18) VALUE "Labor_Cost".
012400     05 MATER-H            PIC X(18) VALUE "Mater_Cost".
012500     05 PURCH-H            PIC X(19) VALUE "Purch_Cost".
012600     05 TOTAL-H            PIC X(18) VALUE "Total_Act_Cost".
012700     05 ESTIMATE-H         PIC X(14) VALUE "Total_Est_Cost".
012800
012900 01  HEADER-LINE3.
013000     05 FILLER             PIC X(11) VALUE SPACES.
013100     05 FILLER             PIC X(5)  VALUE "LABOR".
013200     05 FILLER             PIC X(12) VALUE SPACES.
013300     05 FILLER             PIC X(8)  VALUE "MATERIAL".
013400     05 FILLER             PIC X(12) VALUE SPACES.
013500     05 FILLER             PIC X(8)  VALUE "PURCHASE".
013600     05 FILLER             PIC X(17) VALUE SPACES.
013700     05 FILLER             PIC X(6)  VALUE "ACTUAL".
013800     05 FILLER             PIC X(15) VALUE SPACES.
013900     05 FILLER             PIC X(8)  VALUE "ESTIMATE".
014000
014100 01  HEADER-LINE4.
014200     05 FILLER             PIC X(11) VALUE SPACES.
014300     05 FILLER             PIC X(5)  VALUE "TOTAL".
014400     05 FILLER             PIC X(15) VALUE SPACES.
014500     05 FILLER             PIC X(5)  VALUE "TOTAL".
014600     05 FILLER             PIC X(15) VALUE SPACES.
014700     05 FILLER             PIC X(5)  VALUE "TOTAL".
014800     05 FILLER             PIC X(18) VALUE SPACES.
014900     05 FILLER             PIC X(5)  VALUE "TOTAL".
015000     05 FILLER             PIC X(18) VALUE SPACES.
015100     05 FILLER             PIC X(5)  VALUE "TOTAL".
015200
       COPY IOFEEDBACK OF COPYLIB.

015300 01  JOBPLAN-DATA.      COPY DJOBPLAN OF COPYLIB.
015400
015500 01  JOBPLAN-KEY.
015600     05 JOBWONUM        PIC X(10).
015700     05 JOBSEQUENCE.
015800        10 SEQNUM       PIC X(3).
015900        10 FILLER       PIC X.
016000
016100 01  LINE-KOUNTER       PIC 99 VALUE 99.
016200
016300 01  LABOR-EST          PIC 9(12).
016400
016500 01  LAST-WO-BUFF.      COPY MLASTWO OF COPYLIB.
016600
016700 COPY LANGSUB OF COPYLIB.
016800
016900 01  MESSAGE-BUFFER.
017000     05 M1              PIC X(80).
017100     05 M2.
017200        10 M3           PIC X(13) VALUE "COND WORD IS ".
017300        10 M4           PIC +9999.
017400
       01  NORMAL-PRINT.
           05  NORMAL-CHARS   PIC 9(12) COMP-4.

017900 01  NUM-COPIES         PIC S99 COMP VALUE 1.
018000
018100 01  N-STATUS           PIC S9 COMP VALUE 0.
018200
       COPY OVRPFDATA IN COPYLIB.

018300 01  PRTY               PIC S9 COMP VALUE 0.
018400
018500 01  P-LABOR-TOTAL      PIC 9(16) COMP-3.
018600
018700 01  P-MATER-TOTAL      PIC 9(16) COMP-3.
018800
018900 01  P-PURCH-TOTAL      PIC 9(16) COMP-3.
019000
019100 01  P-TOTAL-TOTAL      PIC 9(18) COMP-3.
019200
019300 01  P-ESTIM-TOTAL      PIC 9(18) COMP-3.
019400
019500 01  PLNNED-TOTALS.
019600     05 LABOR-TOTAL     PIC 9(12).
019700     05 MATER-TOTAL     PIC 9(15).
019800     05 PURCH-TOTAL     PIC 9(15).
019900     05 WONUM-TOTAL     PIC 9(16).
020000     05 ESTIMATE-TOTAL  PIC 9(16).
020100
020200 01  PAGE-RECS          PIC 99.
020300
020400 01  PER-PERSONNEL.     COPY MPERSONL OF COPYLIB.
020500
020600 01  PASSWORD1          PIC X(8).
020700
020800 01  PASSED-BASE        PIC X(10).
020900
021000 01  ROUTE-INPUT.
021100     05 SPOOLER-NUMBER  PIC 9(3).
021200     05 PAPER-COLS      PIC X.
021300     05 LINES-PER-INCH  PIC X.
021400
021500 01  RESTRICTION-LINE.
021600     05 FILLER          PIC X(15) VALUE "RESTRICTIONS : ".
021700     05 FILLER          PIC X(04) VALUE "A_C".
021800     05 CODE-R          PIC X(01) VALUE SPACE.
021900     05 FILLER          PIC X(04) VALUE " ST ".
022000     05 ST-R            PIC X(02) VALUE SPACES.
022100     05 FILLER          PIC X(08) VALUE " EQPNUM ".
022200     05 EQPNUM-R        PIC X(06) VALUE SPACES.
022300     05 FILLER          PIC X(06) VALUE " DEPT ".
022400     05 DEPT-R          PIC X(04) VALUE SPACES.
022500     05 FILLER          PIC X(06) VALUE " ZONE ".
022600     05 ZONE-R          PIC X(04) VALUE SPACES.
022700     05 FILLER          PIC X(11) VALUE " EXP_CLASS ".
022800     05 CLASS-R         PIC X(08) VALUE SPACES.
022900     05 FILLER          PIC X(12) VALUE " BUDGET_NUM ".
023000     05 BUDGET-R        PIC X(16) VALUE SPACES.
023100     05 FILLER          PIC X(13) VALUE " REQUEST_NUM ".
023200     05 REQUEST-R       PIC X(12) VALUE SPACES.
023300
023400 01  REQUEST-INPUT      PIC X(12).
023500
023600 01  STORES-DATA.
023700     05 CSIS-CODE       PIC X(8).
023800     05 RET-CODE-INFO   PIC XX.
023900     05 UNIT-COST       PIC S9(11)V9(4).
024000     05 UNIT-OF-MEAS    PIC XX.
024100     05 STORES-DESCRIP-DATA.
024200        10 DESCRIP-1.
024300           15 DESC-1 OCCURS 80 TIMES
024400                        PIC X.
024500        10 DESCRIP-2.
024600           15 DESC-2 OCCURS 80 TIMES
024700                        PIC X.
024800        10 DESCRIP-3.
024900           15 DESC-3 OCCURS 80 TIMES
025000                        PIC X.
025100     05 EST-LT          PIC 9(4).
025200
025300 01  SUFFIX-INPUT       PIC X(7).
025400
025500 01  STATUS-INPUT       PIC X(2).
025600
025700 01  SUFFIX-INDEX       PIC 9999.
025800
025900 01  SUFFIX-NUMBER      PIC 999.
026000
026100 01  SUFFIX-TOTAL-DATA.
           05  S-WO-NUM       PIC X(10).
           05  S-LABOR-EST    PIC 9(14).
           05  S-STORE-EST    PIC 9(14).
           05  S-PURCH-EST    PIC 9(14).
           05  S-LABOR-ACT    PIC 9(14).
           05  S-STORE-ACT    PIC 9(14).
           05  S-PURCH-ACT    PIC 9(14).
026200
026300 01  SORT-INPUT         PIC X.
026400
026500 01  SPOOLER-INPUT      PIC 99.
026600
026700 01  SPOOLER-NUM        PIC S99   COMP.
026800
026900 01  SAVE-16            PIC 9(16).
027000
027100 01  S-ERR-MSG          PIC X(75) VALUE SPACES.
027200
027300 01  SEQ-NO             PIC 9999.
027400
027500 01  SEQ-NO-TEMP        PIC 999.
027600
027700 COPY DBSTAT OF COPYLIB.
027800
028700 01  STATUS-CHECK       PIC X VALUE "O".
028800
028900 01  SAVE-FIELD-1       PIC X(16).
029000
029100 01  SAVE-FIELD-2       PIC X(16).
029200
029300 01  SORT-SWITCH        PIC X.
029400
029500 COPY TBLOWUP IN COPYLIB.
029600
029700 01  TITLE-LINE.
029800     05 FILLER             PIC X(41) VALUE SPACES.
029900     05 FILLER             PIC X(49) VALUE
030000        "S U F F I X   W O R K   O R D E R   S U M M A R Y".
030100     05 FILLER             PIC X(26) VALUE SPACES.
030200     05 T-DATE             PIC X(8).
030300     05 FILLER             PIC X(4) VALUE SPACES.
030400     05 T-N                PIC 9999 VALUE 0.
030500
030600 01  VALUE-LINE1.
030700     05 WONUM-V            PIC X(12).
030800     05 STATUS-V           PIC X(4).
030900     05 EQPNUM-V           PIC X(8).
031000     05 DESCRIPTION-V      PIC X(32).
031100     05 CLASS-V            PIC X(11).
031200     05 BUDGET-V           PIC X(18).
031300     05 REQUEST-V          PIC X(15).
031400     05 ZONE-V             PIC X(6).
031500     05 DEPT-V             PIC X(6).
031600     05 CODE-V             PIC X.
031700
031800 01  VALUE-LINE2.
031900     05 FILLER             PIC X(10) VALUE SPACES.
032000     05 LABOR-V            PIC Z(12).
032100     05 FILLER             PIC X(3) VALUE SPACES.
032200     05 MATER-V            PIC Z(15).
032300     05 FILLER             PIC X(3) VALUE SPACES.
032400     05 PURCH-V            PIC Z(15).
032500     05 FILLER             PIC X(7) VALUE SPACES.
032600     05 TOTAL-V            PIC Z(16).
032700     05 FILLER             PIC X(2) VALUE SPACES.
032800     05 TOTAL-EST-V        PIC Z(16).
032900
033000 01  VALUE-LINE3.
033100     05  LABOR-DOLLAR      PIC Z(16).
033200     05  FILLER            PIC X(4) VALUE SPACES.
033300     05  MATER-DOLLAR      PIC Z(16).
033400     05  FILLER            PIC X(4) VALUE SPACES.
033500     05  PURCH-DOLLAR      PIC Z(16).
033600     05  FILLER            PIC X(5) VALUE SPACES.
033700     05  TOTAL-DOLLAR      PIC Z(18).
033800     05  FILLER            PIC X(5) VALUE SPACES.
033900     05  ESTIM-DOLLAR      PIC Z(18).
034000
034100 01  WO-PLNND-DATA.        COPY DWOPLAN OF COPYLIB.
034200
034300 01  WO-MATER-DATA.        COPY DWOPARTS OF COPYLIB.
034400
034500 01  WO-LABOR-DATA.        COPY DWOLABOR OF COPYLIB.
034600
       01  WO-NUMBER-WA          PIC X(10).
       COPY WSCONTROL OF COPYLIB.

034700 01  ZONE-INPUT            PIC X(4).
       LINKAGE SECTION.
010000 01  SCREEN-DATA.
010100     05 MASTER-WONUM         PIC X(7).
010200     05 WO-STATUS            PIC X(2).
010300     05 A-C                  PIC X.
010400     05 EQUIPNUM             PIC X(6).
010500     05 DEPT                 PIC X(4).
010600     05 ZONE                 PIC X(4).
010700     05 CLSS                 PIC X(8).
010800     05 BUDGET.
010900        10 B1                PIC X(3).
011000        10 B2                PIC X(2).
011100        10 B3                PIC X(2).
011200        10 B4                PIC X(3).
011300        10 B5                PIC X(2).
011400     05 REQUEST              PIC X(12).
011500     05 SORT-BY              PIC X.
011600     05 PRNT-DEV             PIC X(3).
011700     05 PAPER-SZ             PIC X.
011800     05 LINE-PER             PIC X.
           05 CMD-LINE             PIC X(79).
           05 ERR-LINE             PIC X(79).

035000 PROCEDURE DIVISION USING SCREEN-DATA.
035100 BEGIN-PROG.
           PERFORM 1-HSK.
           PERFORM 6-MAIN.
       2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE JOBPLAN-FILE.
           CLOSE WO-LABOR-FILE.
           CLOSE WO-LAST-NUM-USED.
           CLOSE WO-PARTS-FILE.
           CLOSE WO-PLANNED-FILE.
           MOVE SPACES TO PRNTF.
           MOVE NORMAL-PRINT TO PRNTF-TYPE.
036700     WRITE PRNTF AFTER ADVANCING NEW-PAGE.
036900*    CALL "SPOOL2631'STOP" USING PRNT-FILE
037000*                                SPOOLER-NUM
037100*                                NUM-COPIES
037200*                                PRTY
037300*                                N-STATUS
037400*                                S-ERR-MSG.
           CLOSE PRNT-FILE.
           GOBACK.
       1-HSK.
           OPEN I-O    DISPLAY-FILE.
           OPEN INPUT  JOBPLAN-FILE.
           OPEN INPUT  WO-LABOR-FILE.
           OPEN INPUT  WO-LAST-NUM-USED.
           OPEN INPUT  WO-PARTS-FILE.
           OPEN INPUT  WO-PLANNED-FILE.
           MOVE 196879 TO COMPRESS-CHARS.
           MOVE 196882 TO NORMAL-CHARS.
      *    MOVE 0 TO OVRPRTF-TOFILE-NUM.
           MOVE "L " TO OVRPRTF-TOFILE-NUM-X.
      *****************************************************************
      * OVERRIDE THE PRINT FILE TO PASSED PRINT FILE NUM. IF THAT
      * DOESNT EXIST, USE DEFAULT OUTQ FROM LOCAL DATA AREA. IF THE
      * OUTQ DOESN'T EXIST, DEFAULT TO 'MCPRT' PRINT FILE (OUTQ=*JOBD
      *****************************************************************
           CALL "COVRPRT" USING OVRPRTF-PARMS.
           CALL "QCMDEXC" USING OVRPRTF-PARM1, OVRPRTF-PARM2.
041000     OPEN OUTPUT PRNT-FILE.
           MOVE MASTER-WONUM TO SUFFIX-INPUT.
           MOVE WO-STATUS    TO STATUS-INPUT.
           MOVE A-C          TO CODE-INPUT.
           MOVE EQUIPNUM     TO EQPNUM-INPUT.
           MOVE DEPT         TO DEPT-INPUT.
           MOVE ZONE         TO ZONE-INPUT.
           MOVE CLSS         TO CLASS-INPUT.
           MOVE B1           TO BI-1.
           MOVE B2           TO BI-2.
           MOVE B3           TO BI-3.
           MOVE B4           TO BI-4.
           MOVE B5           TO BI-5.
           MOVE "-"          TO BI-DASH-1 BI-DASH-2 BI-DASH-3.
           MOVE "R"          TO BI-REVNO.
           MOVE REQUEST      TO REQUEST-INPUT.
           MOVE SORT-BY      TO SORT-INPUT.
           MOVE PRNT-DEV     TO SPOOLER-NUMBER.
           MOVE SPACES       TO PRNTF.
           MOVE NORMAL-PRINT TO PRNTF-TYPE.
           IF PAPER-SZ = "N"
               MOVE COMPRESS-PRINT TO PRNTF-TYPE.
           MOVE PAPER-SZ     TO PAPER-COLS.
           MOVE LINE-PER     TO LINES-PER-INCH.
040700     MOVE SPOOLER-NUMBER TO SPOOLER-INPUT.
040800     MOVE SPOOLER-INPUT  TO SPOOLER-NUM.
040900*    CALL "SPOOL2631'START" USING N-STATUS S-ERR-MSG.
           MOVE 0 TO COND-WORD.
045000     MOVE 1 TO ARG-NO.
           READ WO-LAST-NUM-USED INTO LAST-WO-BUFF
               INVALID KEY    MOVE 17 TO COND-WORD.
045400     IF COND-WORD NOT = 0
045600         WRITE PRNTF AFTER ADVANCING NEW-PAGE
045700         MOVE "ERROR IN PROGRAM TSUFFSUM" TO PRNTF-LINE
045800         WRITE PRNTF AFTER ADVANCING 1 LINES
045900         MOVE "DBGET ERROR IN PAR HOUSE" TO PRNTF-LINE
046000         WRITE PRNTF AFTER ADVANCING 1 LINES
046100         MOVE COND-WORD TO PRNTF-LINE
046200         WRITE PRNTF AFTER ADVANCING 1 LINES
046300         GO TO 2-EOJ.
046400     MOVE DATE-FLAG-SW TO DATE-CODE.
046600     MOVE 1 TO DATE-MODE.
046700     CALL "TDATECK2" USING DATE-CHECK-AREA LANGUAGE-PARMS.
046800     MOVE DATE-SLASH-OUT TO T-DATE.
047100     CALL "TSETCRFT" USING DBPARAMETERS
047200                           CRAFT-TABLE.
048100     MOVE STATUS-INPUT TO ST-R.
048200     MOVE CODE-INPUT TO CODE-R.
048300     MOVE EQPNUM-INPUT TO EQPNUM-R.
048400     MOVE DEPT-INPUT TO DEPT-R.
048500     MOVE ZONE-INPUT TO ZONE-R.
048600     MOVE CLASS-INPUT TO CLASS-R.
048800     IF BUDGET-INPUT = "   -  -  -   R  "
048900         MOVE SPACES TO BUDGET-R
049000     ELSE
049100     MOVE BUDGET-INPUT TO BUDGET-R.
049200
049300     MOVE REQUEST-INPUT TO REQUEST-R.
049400
049500     IF LINES-PER-INCH = "8"
049600         MOVE 70 TO PAGE-RECS
049700     ELSE
049800     MOVE 50 TO PAGE-RECS.
049900 6-MAIN.
035600     PERFORM 6-SORT-PAR THRU 6-SORT-PAR-EXIT.
037800
050100 6-SORT-PAR.
050200     IF SORT-INPUT = "C"
050300         MOVE "C" TO SORT-SWITCH
050400         SORT SORT-FILE ON ASCENDING KEY S-CLASS S-WONUM
050500             INPUT  PROCEDURE 7-INPUT-RECORDS
050600             OUTPUT PROCEDURE 8-OUTPUT-RECORDS
050700             GO TO 6-SORT-PAR-EXIT.
050800
050900     IF SORT-INPUT = "B"
051000         MOVE "B" TO SORT-SWITCH
051100         SORT SORT-FILE ON ASCENDING KEY S-BUDGET S-WONUM
051200             INPUT  PROCEDURE 7-INPUT-RECORDS
051300             OUTPUT PROCEDURE 8-OUTPUT-RECORDS
051400             GO TO 6-SORT-PAR-EXIT.
051500
051600     IF SORT-INPUT = "R"
051700         MOVE "R" TO SORT-SWITCH
051800         SORT SORT-FILE ON ASCENDING KEY S-REQUEST S-WONUM
051900             INPUT  PROCEDURE 7-INPUT-RECORDS
052000             OUTPUT PROCEDURE 8-OUTPUT-RECORDS
052100             GO TO 6-SORT-PAR-EXIT.
052200
052300     IF SORT-INPUT = "Z"
052400         MOVE "Z" TO SORT-SWITCH
052500         SORT SORT-FILE ON ASCENDING KEY S-ZONE S-WONUM
052600             INPUT  PROCEDURE 7-INPUT-RECORDS
052700             OUTPUT PROCEDURE 8-OUTPUT-RECORDS.
052800
052900     IF SORT-INPUT = "S"
053000         MOVE "S" TO SORT-SWITCH
053100         SORT SORT-FILE ON ASCENDING KEY S-STATUS S-WONUM
053200             INPUT  PROCEDURE 7-INPUT-RECORDS
053300             OUTPUT PROCEDURE 8-OUTPUT-RECORDS.
053400
053500     IF SORT-INPUT = "W"
053600         MOVE "W" TO SORT-SWITCH
053700         SORT SORT-FILE ON ASCENDING KEY S-WONUM
053800             INPUT  PROCEDURE 7-INPUT-RECORDS
053900             OUTPUT PROCEDURE 8-OUTPUT-RECORDS.
054000
054100 6-SORT-PAR-EXIT.   EXIT.
054300
054500 7-INPUT-RECORDS.
054600     PERFORM 7-INPUT-RECS THRU 7-IRE VARYING SUFFIX-INDEX
054700         FROM 1 BY 1 UNTIL SUFFIX-INDEX > 999.
055200 7-INPUT-RECS.
055500     MOVE SUFFIX-INDEX  TO SUFFIX-NUMBER.
055600     STRING SUFFIX-INPUT SUFFIX-NUMBER DELIMITED BY SIZE
055700         INTO WO-NUMBER-WA.
055800     PERFORM 7-START-WO-PLANNED-FILE.
056100     IF COND-WORD = 17 GO TO 7-IRE.
057300     PERFORM 7-READ-WO-PLANNED-FILE.
057600     IF COND-WORD = 15 GO TO 7-IRE.
058900     PERFORM 70-READ-SUFFIX THRU 70-RSE.
059000
059100 7-IRE.    EXIT.
059300
059500 70-READ-SUFFIX.
059600     IF WO-CURRENT-TYPE = "D"
059700         GO TO 70-RSE.
059800
059900     MOVE APPROVAL-CODE-P TO A-CODE.
060000     IF CODE-INPUT = SPACES
060100         NEXT SENTENCE
060200     ELSE
060300     IF A-CODE = CODE-INPUT
060400         NEXT SENTENCE
060500     ELSE
060600     GO TO 70-RSE.
060700
060800     IF STATUS-INPUT = SPACES
060900         NEXT SENTENCE
061000     ELSE
061100     IF WO-STATUS-P = STATUS-INPUT
061200         NEXT SENTENCE
061300     ELSE
061400     GO TO 70-RSE.
061500
061600     IF EQPNUM-INPUT = SPACES
061700         NEXT SENTENCE
061800     ELSE
061900     IF EQUIP-NUM-P = EQPNUM-INPUT
062000         NEXT SENTENCE
062100     ELSE
062200     GO TO 70-RSE.
062300
062400     IF DEPT-INPUT = SPACES
062500         NEXT SENTENCE
062600     ELSE
062700     IF DEPT-P = DEPT-INPUT
062800         NEXT SENTENCE
062900     ELSE
063000     GO TO 70-RSE.
063100
063200     IF ZONE-INPUT = SPACES
063300         NEXT SENTENCE
063400     ELSE
063500     IF ZONE-P = ZONE-INPUT
063600         NEXT SENTENCE
063700     ELSE
063800     GO TO 70-RSE.
063900
064000     IF CLASS-INPUT = SPACES
064100         NEXT SENTENCE
064200     ELSE
064300     IF EXP-CLASS-P = CLASS-INPUT
064400         NEXT SENTENCE
064500     ELSE
064600     GO TO 70-RSE.
064700
064800     IF BUDGET-INPUT = "   -  -  -   R  "
064900         NEXT SENTENCE
065000     ELSE
065100     IF BUDGET-NO = BUDGET-INPUT
065200         NEXT SENTENCE
065300     ELSE
065400     GO TO 70-RSE.
065500
065600     IF REQUEST-INPUT = SPACES
065700         NEXT SENTENCE
065800     ELSE
065900     IF REQUEST-NO = REQUEST-INPUT
066000         NEXT SENTENCE
066100     ELSE
066200     GO TO 70-RSE.
066300
066400     MOVE ZONE-P TO S-ZONE.
066500     MOVE DEPT-P TO S-DEPT.
066600     MOVE WO-NUM-PLANNED TO S-WONUM.
066700     IF WO-REOPEN-DELAY = "**"
066800         MOVE "*" TO S-ASTERISK
066900     ELSE
067000     MOVE " " TO S-ASTERISK.
067100     MOVE WO-STATUS-P TO S-STATUS.
067200     MOVE APPROVAL-CODE-P TO S-AC.
067300     MOVE EQUIP-NUM-P TO S-EQPNUM.
067400     MOVE DESCRIPTION-1-P TO S-DESCRIPTION.
067500     MOVE EXP-CLASS-P TO S-CLASS.
067600     MOVE BUDGET-NO TO S-BUDGET.
067700     MOVE REQUEST-NO TO S-REQUEST.
067800
067900     MOVE 0 TO ESTIMATE-TOTAL.
068000
068400
068600 70-RSGL.
068700     MOVE 0 TO LABOR-TOTAL.
069100     PERFORM 7-START-WO-LABOR-FILE.
069400     IF COND-WORD = 17 GO TO 70-RSGM.
070600     PERFORM 7-READ-WO-LABOR-FILE.
070900     IF COND-WORD = 15 GO TO 70-RSGM.
072200     PERFORM 701-READ-LABOR-CHAIN THRU 701-RLCE
072300         UNTIL COND-WORD = 15.
072500 70-RSGM.
072600     MOVE 0 TO MATER-TOTAL PURCH-TOTAL.
073000     PERFORM 7-START-WO-PARTS-FILE.
073300     IF COND-WORD = 17 GO TO 70-RSJP.
074500     PERFORM 7-READ-WO-PARTS-FILE.
074800     IF COND-WORD = 15 GO TO 70-RSJP.
076100     PERFORM 702-READ-MATER-CHAIN THRU 702-RMCE
076200         UNTIL COND-WORD = 15.
076400 70-RSJP.
076800     MOVE SPACES TO JOBSEQUENCE.
076900     IF LAST-JOBPLAN-SEQ = SPACES GO TO 70-RSCC.
077200     PERFORM 703-READ-JOBPLAN-CHAINS THRU 703-RJCE
077300         VARYING SEQ-NO FROM 1 BY 1 UNTIL SEQ-NO > 999.
077400
077600 70-RSCC.
077700     MOVE LABOR-TOTAL TO S-LABOR-CST.
077800     MOVE MATER-TOTAL TO S-MATER-CST.
077900     MOVE PURCH-TOTAL TO S-PURCH-CST.
078100     COMPUTE WONUM-TOTAL = LABOR-TOTAL +
078200                           MATER-TOTAL +
078300                           PURCH-TOTAL.
078500     MOVE WONUM-TOTAL    TO S-TOTAL-CST.
078700     MOVE ESTIMATE-TOTAL TO S-ESTIMATE.
078900     RELEASE SORTF.
079000
079100 70-RSE.    EXIT.

079500*READ-SUFFIX-TOTALS.
079600*    MOVE "SUFFIX-TOTALS;" TO DSET-NAME.
079700*    MOVE "SUFFIX-WO-NUM;" TO ITEM-NAME.
079800*    CALL "DBFIND" USING BASE DSET-NAME MODE1 STATUS-AREA
079900*                        ITEM-NAME ITEM-VALUE.
080000*    IF COND-WORD = 0
080100*      NEXT SENTENCE
080200*    ELSE
080300*      GO TO R-S-T-E.
080400*    CALL "DBGET" USING BASE DSET-NAME MODE5 STATUS-AREA
080500*                       ALL-ITEMS SUFFIX-TOTAL-DATA ARG-NO.
080600*    IF COND-WORD = 0
080700*      NEXT SENTENCE
080800*    ELSE
080900*      GO TO R-S-T-E.
081000*
081100*    MOVE S-LABOR-ACT TO S-LABOR-CST.
081200*    MOVE S-STORE-ACT TO S-MATER-CST.
081300*    MOVE S-PURCH-ACT TO S-PURCH-CST.
081400*
081500*    COMPUTE
081600*    S-TOTAL-CST = S-LABOR-ACT + S-STORE-ACT + S-PURCH-ACT.
081700*
081800*    COMPUTE
081900*    S-ESTIMATE  = S-LABOR-EST + S-STORE-EST + S-PURCH-EST.
082000*
082100*    RELEASE SORTF.
082200*
082300*R-S-T-E.
082400*    EXIT.
082500
082700 701-READ-LABOR-CHAIN.
082800     IF LABOR-COST NUMERIC
082900         ADD LABOR-COST TO LABOR-TOTAL.
083100     PERFORM 7-READ-WO-LABOR-FILE.
083300     IF COND-WORD = 15 GO TO 701-RLCE.
084500
084600 701-RLCE.    EXIT.
084800
085000 702-READ-MATER-CHAIN.
085100*    IF PRT-EST-QTY-FLAG = "*"
085200*        NEXT SENTENCE
085300*    ELSE
085400     IF P-EST-COST NUMERIC
085500         ADD P-EST-COST TO ESTIMATE-TOTAL.
085600
085700     IF PRT-REQ-NO = SPACES OR "CANCEL"
085800         NEXT SENTENCE
085900     ELSE
086000     PERFORM 7020-READ-REQ THRU 7020-READ-REQ-EXIT.
086100
086200     IF P-ACT-COST NOT NUMERIC
086300         NEXT SENTENCE
086400     ELSE
086500     IF PRT-DELETE-FLAG = "D"
086600         NEXT SENTENCE
086700     ELSE
086800     IF PRT-STATUS-1 = "M"
086900         ADD P-ACT-COST TO PURCH-TOTAL
087000     ELSE
087100     IF PRT-STATUS-1 = "X" AND PRT-NUM-7 = SPACES
087200         ADD P-ACT-COST TO PURCH-TOTAL
087300     ELSE
087400     IF PRT-STATUS-1 = "X"
087500         MOVE SPACES TO STORES-DATA
087600         MOVE PRT-NUM TO CSIS-CODE
087700         MOVE BASE1 TO BASE2
087800         CALL "TCODINFO" USING STORES-DATA DBPARAMETERS-STORES
087900         IF RET-CODE-INFO = "NS"
088000             ADD P-ACT-COST TO PURCH-TOTAL
088100         ELSE
088200         ADD P-ACT-COST TO MATER-TOTAL
088300     ELSE
088400     IF PRT-STATUS-1 = "S"
088500         ADD P-ACT-COST TO MATER-TOTAL.
088600     PERFORM 7-READ-WO-PARTS-FILE.
088900     IF COND-WORD = 15 GO TO 702-RMCE.
090100
090200 702-RMCE.    EXIT.
090400
090600 7020-READ-REQ.
090700     MOVE SPACES TO CMR-DATA CMR-DESC CMR-REMARKS
090800                    CMR-RETURNED-DATA CMR-MISC-PARMS
090900                    BU-DISPLAY-MSG.
091000     MOVE "IN" TO CMR-CALL-MODE.
091100     MOVE PRT-REQ-NO TO CMR-REQ-NUMBER.
091200     MOVE PRT-WO-NU TO CMR-WO-NUMBER.
091300     MOVE BASE1 TO PASSED-BASE.
091400     CALL "CMANINQ" USING PASSED-BASE
091500                          CMR-CALL-MODE
091600                          CMR-DATA
091700                          CMR-DESC
091800                          CMR-REMARKS
091900                          CMR-RETURNED-DATA
092000                          CMR-MISC-PARMS
092100                          LANGUAGE-PARMS
092200                          ESC-NAME
092300                          STATUS-AREA
092400                          BU-DISPLAY-MSG.
092500     IF CMR-RETURN-STATUS NOT = "OK"
092600         GO TO 7020-READ-REQ-EXIT.
092700
092800     IF CMR-PO-NO-AND-REL = SPACES
092900         NEXT SENTENCE
093000     ELSE
093100     COMPUTE P-ACT-COST = CMR-PO-UNIT-PRICE * CMR-QTY.
093200
093300 7020-READ-REQ-EXIT.    EXIT.
093500
093700 703-READ-JOBPLAN-CHAINS.
093800     MOVE SEQ-NO TO SEQ-NO-TEMP.
093900     MOVE SEQ-NO-TEMP TO SEQNUM.
094000     PERFORM 7-START-JOBPLAN-FILE.
094300     IF COND-WORD = 17 GO TO 703-RJCE.
095600     PERFORM 7-READ-JOBPLAN-FILE.
095800     IF COND-WORD = 15 GO TO 703-RJCE.
097100     PERFORM 7030-COMPUTE-LABOR-EST THRU 7030-CLEE
097200         UNTIL COND-WORD = 15.
097300 703-RJCE.    EXIT.
097500
097700 7030-COMPUTE-LABOR-EST.
097800     MOVE SPACES TO C-L-R.
097900     IF JOBPLAN-MEN NUMERIC AND JOBPLAN-EST-TIME NUMERIC
098000         PERFORM 70300-F-C-L-R THRU 70300-F-C-L-R-E
098100         IF CRAFT-LABOR-RATE NUMERIC
098200             COMPUTE LABOR-EST = CRAFT-LABOR-RATE *
098300                                 JOBPLAN-MEN      *
098400                                 JOBPLAN-EST-TIME
098500
098600         ADD LABOR-EST TO ESTIMATE-TOTAL.
098800     PERFORM 7-READ-JOBPLAN-FILE.
099000     IF COND-WORD = 15 GO TO 7030-CLEE.
100200
100300 7030-CLEE.    EXIT.
100500
       7-READ-JOBPLAN-FILE.
           MOVE 0 TO COND-WORD.
           READ JOBPLAN-FILE NEXT INTO JOBPLAN-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF JOBPWOSEQ-MM OF JOBPF NOT = JOBPLAN-KEY
               MOVE 15 TO COND-WORD.
           IF JF-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       7-START-JOBPLAN-FILE.
           MOVE 0 TO COND-WORD.
           MOVE JOBPLAN-KEY TO JOBPWOSEQ-MM OF JOBPF.
           START JOBPLAN-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF JF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       7-READ-WO-LABOR-FILE.
           MOVE 0 TO COND-WORD.
           READ WO-LABOR-FILE NEXT INTO WO-LABOR-DATA
               AT END MOVE 15 TO COND-WORD.
           IF WONUM-MM OF WOLABF NOT = WO-NUMBER-WA
               MOVE 15 TO COND-WORD.
           IF WLF-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       7-START-WO-LABOR-FILE.
           MOVE 0 TO COND-WORD.
           MOVE WO-NUM-PLANNED TO WONUM-MM OF WOLABF.
           START WO-LABOR-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       7-READ-WO-PARTS-FILE.
           MOVE 0 TO COND-WORD.
           READ WO-PARTS-FILE NEXT INTO WO-MATER-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WONUM-MM OF WOPARF NOT = WO-NUMBER-WA
               MOVE 15 TO COND-WORD.
           IF WPFD-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       7-START-WO-PARTS-FILE.
           MOVE 0 TO COND-WORD.
           MOVE WO-NUM-PLANNED TO WONUM-MM OF WOPARF.
           START WO-PARTS-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       7-READ-WO-PLANNED-FILE.
           MOVE 0 TO COND-WORD.
           READ WO-PLANNED-FILE NEXT INTO WO-PLNND-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WONUM OF WPFREC NOT = WO-NUMBER-WA
               MOVE 15 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       7-START-WO-PLANNED-FILE.
           MOVE 0 TO COND-WORD.
           MOVE WO-NUMBER-WA TO WONUM OF WPFREC.
           START WO-PLANNED-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

100600 70300-F-C-L-R.
100700     SET CRAFT-INDEX TO 1.
100900     SEARCH C-R-ENTRY
101000      AT END
101100        GO TO 70300-F-C-L-R-E
101200      WHEN JOBPLAN-CRAFT = CRAFT (CRAFT-INDEX)
101300        MOVE RATE (CRAFT-INDEX) TO CRAFT-LABOR-RATE
101400        GO TO 70300-F-C-L-R-E.
101500
101600 70300-F-C-L-R-E.    EXIT.
101800
102000 8-OUTPUT-RECORDS.
           PERFORM 8-WSF THRU 8-WSF-EXIT.
       8-WSF.
102100     RETURN SORT-FILE AT END PERFORM 8-NO-RECORDS.
102300     IF SORT-SWITCH = "C"
102400         MOVE S-CLASS   TO SAVE-FIELD-1 SAVE-FIELD-2
102500         MOVE "EXP_CLASS    : "   TO H-FIELD-1
102600     ELSE
102800     IF SORT-SWITCH = "B"
102900         MOVE S-BUDGET  TO SAVE-FIELD-1 SAVE-FIELD-2
103000         MOVE "BUDGET_NUM   : "   TO H-FIELD-1
103100     ELSE
103300     IF SORT-SWITCH = "R"
103400         MOVE S-REQUEST TO SAVE-FIELD-1 SAVE-FIELD-2
103500         MOVE "REQUEST_NUM  : "   TO H-FIELD-1
103600     ELSE
103800     IF SORT-SWITCH = "Z"
103900         MOVE S-ZONE    TO SAVE-FIELD-1 SAVE-FIELD-2
104000         MOVE "ZONE         : "   TO H-FIELD-1
104100     ELSE
104300     IF SORT-SWITCH = "S"
104400         MOVE S-STATUS  TO SAVE-FIELD-1 SAVE-FIELD-2
104500         MOVE "STATUS       : "   TO H-FIELD-1
104600     ELSE
104800     IF SORT-SWITCH = "W"
104900         MOVE SPACES    TO SAVE-FIELD-1 SAVE-FIELD-2
105000         MOVE SPACES              TO H-FIELD-1.
105100
105200     MOVE 0 TO P-LABOR-TOTAL P-MATER-TOTAL P-PURCH-TOTAL
105300               P-TOTAL-TOTAL P-ESTIM-TOTAL.
105700
105800     PERFORM 8-WRITE-PRINT-FILE UNTIL END-OF-SORT-FILE.
105900
106000 8-WSF-EXIT.    EXIT.
106100
106300 8-WRITE-PRINT-FILE.
106400     IF LINE-KOUNTER > PAGE-RECS
106500       ADD 1 TO T-N
             MOVE TITLE-LINE TO PRNTF-LINE
106600       WRITE PRNTF AFTER ADVANCING NEW-PAGE
106700       MOVE SPACES TO PRNTF-LINE
106800       WRITE PRNTF AFTER ADVANCING 1 LINES
106900       MOVE RESTRICTION-LINE TO PRNTF-LINE
107000       WRITE PRNTF AFTER ADVANCING 1 LINES
107100       MOVE SPACES TO PRNTF-LINE
107200       WRITE PRNTF AFTER ADVANCING 1 LINES
107300       MOVE SAVE-FIELD-1 TO H-FIELD-2
             MOVE H-FIELD TO PRNTF-LINE
107400       WRITE PRNTF AFTER ADVANCING 1 LINES
107500       MOVE ALL "_" TO PRNTF-LINE
107600       WRITE PRNTF AFTER ADVANCING 1 LINES
107700       MOVE 0 TO LINE-KOUNTER.
107800
107900     MOVE SPACES TO WONUM-V.
108000     STRING S-WONUM S-ASTERISK DELIMITED BY SIZE INTO WONUM-V.
108100     MOVE S-STATUS TO STATUS-V.
108200     MOVE S-EQPNUM TO EQPNUM-V.
108300     MOVE S-DESCRIPTION TO DESCRIPTION-V.
108400     MOVE S-CLASS TO CLASS-V.
108500
108600     IF S-BUDGET = "   -  -  -   R  "
108700          MOVE SPACES TO S-BUDGET.
108800
108900     MOVE S-BUDGET TO BUDGET-V.
109000     MOVE S-REQUEST TO REQUEST-V.
109100     MOVE S-ZONE TO ZONE-V.
109200     MOVE S-DEPT TO DEPT-V.
109300     MOVE S-AC TO CODE-V.
109400
109500     MOVE S-LABOR-CST TO LABOR-V.
109600     MOVE S-MATER-CST TO MATER-V.
109700     MOVE S-PURCH-CST TO PURCH-V.
109800     MOVE S-TOTAL-CST TO TOTAL-V.
109900     MOVE S-ESTIMATE TO TOTAL-EST-V.
110000
110100     ADD S-LABOR-CST TO P-LABOR-TOTAL.
110200     ADD S-MATER-CST TO P-MATER-TOTAL.
110300     ADD S-PURCH-CST TO P-PURCH-TOTAL.
110400     MOVE S-TOTAL-CST TO SAVE-16.
110500     ADD SAVE-16 TO P-TOTAL-TOTAL.
110600     MOVE S-ESTIMATE TO SAVE-16.
110700     ADD SAVE-16 TO P-ESTIM-TOTAL.
110800
110900     IF SAVE-FIELD-1 = SAVE-FIELD-2
111000         MOVE SAVE-FIELD-1 TO SAVE-FIELD-2
111100     ELSE
111200     MOVE SAVE-FIELD-1 TO SAVE-FIELD-2
111300     IF LINE-KOUNTER = 0
111400         NEXT SENTENCE
111500     ELSE
111600     ADD 1 TO T-N
           MOVE TITLE-LINE TO PRNTF-LINE
111700     WRITE PRNTF AFTER ADVANCING NEW-PAGE
111800     MOVE SPACES TO PRNTF-LINE
111900     WRITE PRNTF AFTER ADVANCING 1 LINES
112000     MOVE RESTRICTION-LINE TO PRNTF-LINE
112100     WRITE PRNTF AFTER ADVANCING 1 LINES
112200     MOVE SPACES TO PRNTF-LINE
112300     WRITE PRNTF AFTER ADVANCING 1 LINES
112400     MOVE SAVE-FIELD-1 TO H-FIELD-2
           MOVE H-FIELD TO PRNTF-LINE
112500     WRITE PRNTF AFTER ADVANCING 1 LINES
112600     MOVE ALL "_" TO PRNTF-LINE
112700     WRITE PRNTF AFTER ADVANCING 1 LINES
112800     MOVE 0 TO LINE-KOUNTER.
112900
           MOVE HEADER-LINE1 TO PRNTF-LINE.
113000     WRITE PRNTF AFTER ADVANCING 1 LINES.
           MOVE VALUE-LINE1 TO PRNTF-LINE.
113100     WRITE PRNTF AFTER ADVANCING 1 LINES.
113200     MOVE SPACES TO PRNTF-LINE.
113300     WRITE PRNTF AFTER ADVANCING 1 LINES.
           MOVE HEADER-LINE2 TO PRNTF-LINE.
113400     WRITE PRNTF AFTER ADVANCING 1 LINES.
           MOVE VALUE-LINE2 TO PRNTF-LINE.
113500     WRITE PRNTF AFTER ADVANCING 1 LINES.
113600     MOVE SPACES TO PRNTF-LINE.
113700     WRITE PRNTF AFTER ADVANCING 1 LINES.
113800     ADD 6 TO LINE-KOUNTER.
113900
114000     RETURN SORT-FILE AT END MOVE "Y" TO END-OF-FILE-SW.
114100
114200     IF SORT-SWITCH = "C"
114300         MOVE S-CLASS   TO SAVE-FIELD-1
114400     ELSE
114500     IF SORT-SWITCH = "B"
114600         MOVE S-BUDGET  TO SAVE-FIELD-1
114700     ELSE
114800     IF SORT-SWITCH = "R"
114900         MOVE S-REQUEST TO SAVE-FIELD-1
115000     ELSE
115100     IF SORT-SWITCH = "Z"
115200         MOVE S-ZONE    TO SAVE-FIELD-1
115300     ELSE
115400     IF SORT-SWITCH = "S"
115500         MOVE S-STATUS  TO SAVE-FIELD-1
115600     ELSE
115700     IF SORT-SWITCH = "W"
115800         MOVE SPACES    TO SAVE-FIELD-1.
115900
116000     IF SAVE-FIELD-1 NOT EQUAL SAVE-FIELD-2 OR END-OF-SORT-FILE
116100         MOVE ALL "*" TO PRNTF-LINE
116200         WRITE PRNTF AFTER ADVANCING NEW-PAGE
116300         MOVE SPACES TO PRNTF-LINE
116400         WRITE PRNTF AFTER ADVANCING 1 LINES
116500         MOVE "SUMMARY PAGE" TO PRNTF-LINE
116600         WRITE PRNTF AFTER ADVANCING 1 LINES
116700         MOVE SPACES TO PRNTF-LINE
116800         WRITE PRNTF AFTER ADVANCING 1 LINES
               MOVE H-FIELD TO PRNTF-LINE
116900         WRITE PRNTF AFTER ADVANCING 1 LINES
117000         MOVE SPACES TO PRNTF-LINE
117100         WRITE PRNTF AFTER ADVANCING 1 LINES
               MOVE HEADER-LINE3 TO PRNTF-LINE
117200         WRITE PRNTF AFTER ADVANCING 1 LINES
               MOVE HEADER-LINE4 TO PRNTF-LINE
117300         WRITE PRNTF AFTER ADVANCING 1 LINES
117400         MOVE P-LABOR-TOTAL TO LABOR-DOLLAR
117500         MOVE P-MATER-TOTAL TO MATER-DOLLAR
117600         MOVE P-PURCH-TOTAL TO PURCH-DOLLAR
117700         MOVE P-TOTAL-TOTAL TO TOTAL-DOLLAR
117800         MOVE P-ESTIM-TOTAL TO ESTIM-DOLLAR
               MOVE VALUE-LINE3 TO PRNTF-LINE
117900         WRITE PRNTF AFTER ADVANCING 1 LINES
118000         MOVE SPACES TO PRNTF-LINE
118100         WRITE PRNTF AFTER ADVANCING 1 LINES
118200         MOVE ALL "*" TO PRNTF-LINE
118300         WRITE PRNTF AFTER ADVANCING 1 LINES
118400         MOVE 0 TO P-LABOR-TOTAL P-MATER-TOTAL P-PURCH-TOTAL
118500             P-TOTAL-TOTAL P-ESTIM-TOTAL
118600         IF END-OF-SORT-FILE
118700             MOVE SPACES TO PRNTF-LINE
118800             WRITE PRNTF AFTER ADVANCING 1 LINES
118900            STRING "NOTE -  A '*' BESIDE A WORK ORDER INDICATES "
119000                "THAT THE WORK ORDER WAS CREATED AFTER THE "
119100                "MASTER WAS APPROVED"
119200             DELIMITED BY SIZE INTO PRNTF-LINE
119300             WRITE PRNTF AFTER ADVANCING 1 LINES.
119400
119600 8-NO-RECORDS.
119700     MOVE SPACES TO PRNTF-LINE.
119800     WRITE PRNTF AFTER ADVANCING NEW-PAGE
119900     MOVE "NO RECORDS WERE FOUND THAT MATCHED THE RESTRICTIONS"
120000         TO PRNTF-LINE.
120100     WRITE PRNTF AFTER ADVANCING 1 LINES.
120200     MOVE "PROGRAM TSUFFSUM" TO PRNTF-LINE.
120300     WRITE PRNTF AFTER ADVANCING 1 LINES.
120400     GO TO 2-EOJ.
