PGM PARM(&DBPARMS &FSW &CC &QRECS &RSW)
             DCL        VAR(&DBPARMS) TYPE(*CHAR) LEN(600)
             DCL        VAR(&FSW)     TYPE(*DEC)  LEN(4)
             DCL        VAR(&CC)      TYPE(*CHAR) LEN(20)
             DCL        VAR(&QRECS)   TYPE(*CHAR) LEN(280)
             DCL        VAR(&RSW)     TYPE(*DEC)  LEN(4)
             CHKOBJ     OBJ(QTEMP/AUTOQZ) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF9800) EXEC(DO)
             CRTPF      FILE(QTEMP/AUTOQZ) RCDLEN(60) SIZE(1000 0 0) +
                          ALLOCATE(*YES)
             ENDDO
             CLRPFM     FILE(QTEMP/AUTOQZ)
             OVRDBF     FILE(AUTOQZ) TOFILE(QTEMP/AUTOQZ)
             CALL       PGM(*LIBL/TAUTOQZ) PARM(&DBPARMS &FSW &CC &QRECS &RSW)
             DLTOVR     FILE(AUTOQZ)
             ENDPGM
