PGM PARM(&DBPARMS &LINKS)
             DCL        VAR(&DBPARMS) TYPE(*CHAR) LEN(600)
             DCL        VAR(&LINKS)   TYPE(*CHAR) LEN(31)
             CHKOBJ     OBJ(QTEMP/HISTFILE) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF9800) EXEC(DO)
             CRTPF      FILE(QTEMP/HISTFILE) RCDLEN(70) SIZE(13000 +
                          13000 10)
             ENDDO
             CLRPFM     FILE(QTEMP/HISTFILE)
             OVRDBF     FILE(HISTFILE) TOFILE(QTEMP/HISTFILE)
             CALL       PGM(*LIBL/TDISHIST) PARM(&DBPARMS &LINKS)
             DLTOVR     FILE(HISTFILE)
             ENDPGM
