PGM PARM(&DBPARMS)
             DCL        VAR(&DBPARMS) TYPE(*CHAR) LEN(100)
             CHKOBJ     OBJ(QTEMP/OOIPFILE) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF9800) EXEC(DO)
             CRTPF      FILE(QTEMP/OOIPFILE) RCDLEN(104) SIZE(13000 +
                          13000 10)
             ENDDO
             CLRPFM     FILE(QTEMP/OOIPFILE)
             OVRDBF     FILE(OOIPFILE) TOFILE(QTEMP/OOIPFILE)
             CALL       PGM(*LIBL/TOOIPINQ) PARM(&DBPARMS)
             DLTOVR     FILE(OOIPFILE)
             ENDPGM
