PGM PARM(&VPE &STATUS &EQPNUM &RC)
             DCL        VAR(&VPE)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&STATUS)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&EQPNUM)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&RC)      TYPE(*CHAR) LEN(2)
             CHKOBJ     OBJ(QTEMP/OUTFILQ1) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF9800) EXEC(DO)
             CRTPF      FILE(QTEMP/OUTFILQ1) RCDLEN(120) SIZE(13000 +
                          13000 10)
             ENDDO
             CLRPFM     FILE(QTEMP/OUTFILQ1)
             OVRDBF     FILE(OUTFILQ1) TOFILE(QTEMP/OUTFILQ1)
             CALL       PGM(*LIBL/TQ1INTF) +
                        PARM(&VPE &STATUS &EQPNUM &RC)
             DLTOVR     FILE(OUTFILQ1)
             ENDPGM
