PGM PARM(&DBPARMS &VPARMS &CPARMS)
             DCL        VAR(&DBPARMS) TYPE(*CHAR) LEN(600)
             DCL        VAR(&VPARMS)  TYPE(*CHAR) LEN(120)
             DCL        VAR(&CPARMS)  TYPE(*CHAR) LEN(120)
             CHKOBJ     OBJ(QTEMP/OUTFIQ11) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF9800) EXEC(DO)
             CRTPF      FILE(QTEMP/OUTFIQ11) RCDLEN(240) SIZE(13000 +
                          13000 10)
             ENDDO
             CLRPFM     FILE(QTEMP/OUTFIQ11)
             OVRDBF     FILE(OUTFIQ11) TOFILE(QTEMP/OUTFIQ11)
             CHKOBJ     OBJ(QTEMP/WRKFIQ11) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF9800) EXEC(DO)
             CRTPF      FILE(QTEMP/WRKFIQ11) RCDLEN(240) SIZE(13000 +
                          13000 10)
             ENDDO
             CLRPFM     FILE(QTEMP/WRKFIQ11)
             OVRDBF     FILE(WRKFIQ11) TOFILE(QTEMP/WRKFIQ11)
             CALL       PGM(*LIBL/TQ11SUB) +
                        PARM(&DBPARMS &VPARMS &CPARMS)
             DLTOVR     FILE(OUTFIQ11)
             DLTOVR     FILE(WRKFIQ11)
             ENDPGM
