
/***---                                                         ---***/
/***---     Change personnel records to restrict or unrestrict  ---***/
/***---     the users ability to perform storeroom withdrawals  ---***/
/***---     using MMIS.                                         ---***/
/***---     If they are restricted, there is a Y in the perpad  ---***/
/***---     field. If there is an N or a blank, they are not    ---***/
/***---     restricted.                                         ---***/
/***---     Input -  PZFPMMCC0 (data loaded from webpage)       ---***/
/***---     Update - MCFPMM0300 Personnel file.                 ---***/
/***---                                                         ---***/
/***---     09/14/2021  Donna Baraona                           ---***/
/***---     RFC 1122593  CD 5106272  CPPI 2020-01196736         ---***/

             PGM

/* PSMS LIBRARY NAME          */
             DCL        VAR(&PSMSLIB) TYPE(*CHAR) LEN(10) VALUE(' ')

/* GET PSMS DATA LIBRARY NAME */
             RTVDTAARA  DTAARA(PSMSSYS/PZDATLIBS (1 10)) +
                          RTNVAR(&PSMSLIB)
             MONMSG     MSGID(CPF0000)

             ADDLIBLE   LIB(&PSMSLIB) /* PSMS Data Library */
             MONMSG     MSGID(CPF0000)

             OVRDBF     FILE(PZFPMMCC0) TOFILE(&PSMSLIB/PZFPMMCC0)
             MONMSG     MSGID(CPF0000)

             CALL       PGM(TSWCCRST)

             DLTOVR     FILE(PZFPMMCC0)
             MONMSG     MSGID(CPF0000)

             RMVLIBLE   LIB(&PSMSLIB)
             MONMSG     MSGID(CPF0000)

             ENDPGM
