PGM PARM(&PARM1 &PARM2)
DCL        &PARM1     *CHAR LEN(882)
DCL        &PARM2     *CHAR LEN(2)
DCL        &SYSNAME     *CHAR LEN(8)
DCL        &WORDER      *CHAR LEN(10)
RTVNETA    SYSNAME(&SYSNAME)
CHGVAR     VAR(&WORDER) VALUE(%SST(&PARM1 497 10))
MONMSG CPF0000
IF         COND(&SYSNAME *EQ 'AKRON4') THEN(DO)
           ADDLIBLE MCPRD2
           MONMSG CPF0000
           ENDDO
ELSE       CMD(DO)
           ADDLIBLE MCPRD1
           MONMSG CPF0000
           ENDDO
ADDLIBLE MCPRD
MONMSG CPF0000
             CALL       PGM(MMRADDREC) PARM(&PARM1 &PARM2)
   MONMSG CPF0000

IF         COND(&SYSNAME *EQ 'UNCITY1') THEN(DO)
           ADDLIBLE PLTLIB
           MONMSG CPF0000
           CALL       PGM(UCXEQDN1) PARM(&WORDER)
           MONMSG CPF0000
           RMVLIBLE PLTLIB
           MONMSG CPF0000
           ENDDO
ENDPGM
