PGM PARM(&PARM1 &PARM2)
DCL        &PARM1     *CHAR LEN(1882)
DCL        &PARM2     *CHAR LEN(2)
DCL        &SYSNAME     *CHAR LEN(8)
RTVNETA    SYSNAME(&SYSNAME)
MONMSG CPF0000
IF         COND(&SYSNAME *EQ 'AKRON4') THEN(DO)
           ADDLIBLE MCPRD2
           MONMSG CPF0000
           ENDDO
ELSE       CMD(DO)
           ADDLIBLE MCPRD1
           MONMSG CPF0000
           ENDDO
ADDLIBLE MCPRD
MONMSG CPF0000
             CALL       PGM(MMRADDREC1) PARM(&PARM1 &PARM2)
   MONMSG CPF0000
ENDPGM
