             PGM  PARM(&XJL &XDT)

             DCL        VAR(&XDT) TYPE(*CHAR) LEN(8)
             DCL        VAR(&XJL) TYPE(*CHAR) LEN(7)

             CVTDAT     DATE(&XJL) TOVAR(&XDT) FROMFMT(*LONGJUL) +
                          TOFMT(*YYMD) TOSEP(*NONE)
             MONMSG     MSGID(CPF0550 CPF0551 CPF0552 CPF0553 CPF0554 +
                          CPF0555 CPF0556 CPF0557) EXEC(GOTO ERROR)
             RETURN

 ERROR:      CHGVAR     VAR(&XDT) VALUE('99999999')
             RETURN

             ENDPGM
