PGM PARM(&PARM1 &PARM2)
DCL        &PARM1     *CHAR LEN(882)
DCL        &PARM2     *CHAR LEN(2)
DCL        &JOB       *CHAR LEN(10)
DCL        &SYSNAME     *CHAR LEN(8)
RTVJOBA    JOB(&JOB)
  IF         COND(&JOB *EQ 'STMOSTAT')  THEN(DO)
  GOTO ENDIT
  ENDDO
RTVNETA    SYSNAME(&SYSNAME)
MONMSG CPF0000
IF         COND(&SYSNAME *EQ 'AKRON4') THEN(DO)
           ADDLIBLE MCPRD2
           MONMSG CPF0000
           ENDDO
ELSE       CMD(DO)
           ADDLIBLE MCPRD1
           MONMSG CPF0000
           ENDDO
ADDLIBLE MCPRD
MONMSG CPF0000
   CALL MMR1030
   MONMSG CPF0000
             OVRPRTF    FILE(WRENCHTIME) OUTQ(MCMGR) HOLD(*YES)
   MONMSG CPF0000
             OVRPRTF    FILE(QSYSPRT) OUTQ(MCMGR) HOLD(*YES)
   MONMSG CPF0000
             RUNSQLSTM  SRCFILE(MCPRD/QSQLSRC) SRCMBR(WRENCHTIME) +
                          COMMIT(*NONE)
   MONMSG CPF0000
             DLTOVR     FILE(WRENCHTIME QSYSPRT)
   MONMSG CPF0000
   DLTSPLF    FILE(WRENCHTIME) SPLNBR(*LAST)
   MONMSG CPF0000
   CALL MMR1020
   MONMSG CPF0000
ENDIT:
ENDPGM
