             PGM        PARM(&SEQ &CODE)
             DCL        VAR(&SEQ)  TYPE(*CHAR) LEN(4)
             DCL        VAR(&CODE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&MBR)  TYPE(*CHAR) LEN(7)

             CHGVAR     VAR(&MBR)  VALUE('R' *CAT &SEQ *CAT '*')

             RMVM       FILE(*LIBL/R3MNFUP) MBR(&MBR)

             MONMSG     MSGID(CPF0000) EXEC(CHGVAR VAR(&CODE) VALUE('1'))


 ENDPGM:     ENDPGM
