     A*  90/12/13  09:52:00    A038370     REL-R02M00  5728-PW1
     A                                      DSPSIZ(24 80 *DS3)
     A          R MCRDCLRPFM
     A*  90/12/13  09:52:00    A038370     REL-R02M00  5728-PW1
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                      DSPATR(HI)
     A                                  2 64TIME
     A                                      DSPATR(HI)
     A                                  1  3'MCXCLRPFM'
     A                                      DSPATR(HI)
     A                                  4  5'W         W  A     R R R  N      N-
     A                                       I I I N      N  G G G G    !!! '
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A                                  5  5' W       W  A A    R    R N N    N-
     A                                         I   N N    N G           !!! '
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A                                  6  5'  W  W  W  A   A   R    R N  N   N-
     A                                         I   N  N   N G  G G G    !!! '
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A                                  7  5'   W W W  A A A A  R R R  N   N  N-
     A                                         I   N   N  N G  G   G    !!! '
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A                                  8  5'    W W  A       A R   R  N    N N-
     A                                         I   N    N N G      G        '
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A                                  9  5'    W W  A       A R    R N      N-
     A                                       I I I N      N  G G G G    !!! '
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A                                 12  4'by responding '
     A                                 12 19'YES'
     A                                 12 23' below, you will be clearing all o-
     A                                      f your production'
     A                                 14  4'data files.  If you do not wish to-
     A                                       clear your files hit '
     A                                 14 61'ENTER'
     A                                 14 67' now and'
     A                                 16  4'exit without executing the procedu-
     A                                      re.  If you wish to clear your file-
     A                                      s,'
     A                                 18  4'type '
     A                                 18 10'YES'
     A                                 18 14' into the field below and then pre-
     A                                      ss enter.  The decision is '
     A                                 20  4'in your hands.'
     A                                 22  5'Enter'
     A                                 22 11'YES'
     A                                      DSPATR(HI)
     A                                 22 15'to clear files, then hit enter ===-
     A                                      >'
     A            REPLY          3   B 22 51DSPATR(RI)
