     A*****************************************************************
     A** FILE NAME  :  TARIBA110D
     A**
     A** DESCRIPTION:  DISPLAY FILE TO UPDATE DATAQ PARMS
     A**               (MCFPAB1900)
     A**
     A** AUTHOR     :  DAN RAUCH - EXLTECH, INC
     A** CREATED    :  12-23-02
     A**
     A*****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT(HI UL)
     A                                      INDARA
     A                                      CF03
     A**===============================================================
     A**=== HEADING LINE
     A**===============================================================
     A          R H01
     A            HDDATE        13A  O  1  2
     A                                  1 29'Update DataQ Parameters'
     A                                  1 65'Time:'
     A            HDTIME         8A  O  1 71
     A**===============================================================
     A**=== PROCESSES SUBFILE
     A**===============================================================
     A          R SFL01                     SFL
     A  86                                  SFLNXTCHG
     A            SEL            1A  B  7 33ALIAS(SELECT_FLD)
     A            DQNAME        10A  O  7 38ALIAS(DATAQ_NAME)
     A**===============================================================
     A**=== PROCESSES CONTROL RECORD
     A**===============================================================
     A          R CTL01                     SFLCTL(SFL01)
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(0014)
     A                                      CF06
     A                                      OVERLAY
     A  85                                  SFLDSP
     A  84                                  SFLCLR
     A                                      SFLDSPCTL
     A  83                                  SFLEND(*MORE)
     A            CRRN           4S 0H      SFLRCDNBR(CURSOR *TOP)
     A            CREC          10A  H
     A            CFLD          10A  H
     A                                  3 17'List of DataQ Records  -  Select(X-
     A                                      ) to Update'
     A                                  4 49'(D) to Delete'
     A                                  6 32'Sel'
     A                                      DSPATR(UL)
     A                                  6 38'DataQ Name'
     A                                      DSPATR(UL)
     A**===============================================================
     A**=== maint screen
     A**===============================================================
     A          R S02
     A*%%TS  SD  20030203  080137  Z010830     REL-V5R1M0  5722-WDS
     A                                      CF12
     A                                      OVERLAY
     A                                  6  4'DataQ Name:'
     A            DQNAME        10A  B  6 16ALIAS(DATAQ_NAME)
     A  50                                  DSPATR(RI)
     A  50                                  COLOR(RED)
     A                                  6 34'DataQ Library:'
     A            DQLIBR        10A  B  6 49ALIAS(DATAQ_LIBRARY)
     A  51                                  DSPATR(PC)
     A  51                                  DSPATR(RI)
     A  51                                  COLOR(RED)
     A                                  8  4'Process Name:'
     A            DQPRNAME      10A  B  8 18ALIAS(DATAQ_PROCESS_NAME)
     A  52                                  DSPATR(PC)
     A  52                                  DSPATR(RI)
     A  52                                  COLOR(RED)
     A                                  8 29'Processing Program:'
     A            DQPROGRAM     10A  B  8 49ALIAS(DATAQ_PROCESS_PROGRAM)
     A  53                                  DSPATR(PC)
     A  53                                  DSPATR(RI)
     A  53                                  COLOR(RED)
     A                                 10  4'DataQ SndLen:'
     A            DQSNDLEN       5S 0B 10 18ALIAS(DATAQ_SND_LEN)
     A  54                                  DSPATR(PC)
     A  54                                  DSPATR(RI)
     A  54                                  COLOR(RED)
     A                                 10 26'DataQ RcvLen:'
     A            DQRCVLEN       5S 0B 10 40ALIAS(DATAQ_RCV_LEN)
     A  55                                  DSPATR(PC)
     A  55                                  DSPATR(RI)
     A  55                                  COLOR(RED)
     A                                 10 48'DataQ Wait:'
     A            DQWAIT         5S 0B 10 60ALIAS(DATAQ_WAIT)
     A  56                                  DSPATR(PC)
     A  56                                  DSPATR(RI)
     A  56                                  COLOR(RED)
     A                                 10 67'(Seconds)'
     A                                 12  4'DataQ SndKeyLen:'
     A            DQSNDKLEN      5S 0B 12 21ALIAS(DATAQ_SND_KEYLEN)
     A  57                                  DSPATR(PC)
     A  57                                  DSPATR(RI)
     A  57                                  COLOR(RED)
     A                                 12 29'DataQ RcvKeyLen:'
     A            DQRCVKLEN      5S 0B 12 46ALIAS(DATAQ_RCV_KEYLEN)
     A  58                                  DSPATR(PC)
     A  58                                  DSPATR(RI)
     A  58                                  COLOR(RED)
     A                                 12 54'DataQ SndrDtaLen:'
     A            DQSNDRDTA      3S 0B 12 72ALIAS(DATAQ_SNDR_DATA)
     A  59                                  DSPATR(PC)
     A  59                                  DSPATR(RI)
     A  59                                  COLOR(RED)
     A                                 14  4'DataQ KeyOrder:'
     A            DQKEYORD       2A  B 14 20ALIAS(DATAQ_KEY_ORDER)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A  60                                  COLOR(RED)
     A                                 14 25'DataQ RmvMsg:'
     A            DQRMVMSG      10A  B 14 39ALIAS(DATAQ_RMV_MSG)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A  61                                  COLOR(RED)
     A                                 14 52'DataQ AsyncRqst:'
     A            DQASYNCRQ     10A  B 14 69ALIAS(DATAQ_ASYNC_RQST)
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A  62                                  COLOR(RED)
     A                                 16  4'DataQ RcvrSize:'
     A            DQRCVRSIZ      5S 0B 16 20ALIAS(DATAQ_RCVR_SIZE)
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A  63                                  COLOR(RED)
     A**===============================================================
     A**=== PROCESSES MESSAGE LINE - SFL
     A**===============================================================
     A          R B01
     A                                            OVERLAY
     A                                 23  2'F3-Exit'
     A                                      COLOR(BLU)
     A            MSSG          78   O 22  2
     A  99                                  DSPATR(RI)
     A  99                                  COLOR(RED)
     A**===============================================================
     A**=== PROCESSES MESSAGE LINE - S02
     A**===============================================================
     A          R B02
     A                                            OVERLAY
     A                                 23  2'F3-Exit   F12-Cancel'
     A                                      COLOR(BLU)
     A            MSSG          78   O 22  2
     A  99                                  DSPATR(RI)
     A  99                                  COLOR(RED)
