     A                                      UNIQUE
     A          R UTRPHPDI
     A            DINAME         6A
     A            DIITEM        16A
     A            DITYPE         1A
     A            DICNT          3P 0
     A            DILEN          3P 0
     A            DISITM        10A
     A          K DINAME
     A          K DIITEM
