     A          R UTRPCTDB
     A            CTSET         16A
     A            CTFIL1         1A
     A            CTRECL         5S 0
     A            CTFIL2         1A
     A            CTBLKL         5S 0
     A            CTFIL3         1A
     A            CTFNAM         8A
     A            CTFIL4         1A
     A            CTNAME         6A
     A            CTFIL5         1A
     A            CTREC          6S 0
     A            CTFILX        29A
