     A                                      UNIQUE
     A          R UTRPHPDS
     A            DSNAME         6A
     A            DSSET         16A
     A            DSTYPE         1A
     A            DSCAP          7P 0
     A            DSSSET        10A
     A          K DSNAME
     A          K DSSET
