      ***************************************************************
      * FILE NAME : XARBEXCP1
      * FILE TYPE : PRINTER FILE
      *
      *@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
      *@@ COMPILE W/LINE WIDTH = 150 CHARACTERS
      *@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
      *
      * PROGRAM   : TARBEXCP1
      *
      * PURPOSE   : CATALOG PREFERRED ITEM EXCEPTION REPORT
      *
      * CREATED   : 11/11/2003
      * AUTHOR    : DAN RAUCH - EXLTECH, LLC
      ***************************************************************
      * SPECIAL NOTES:
      ***************************************************************
     A                                      INDARA
     A          R HEAD01
     A                                      SKIPB(1)
     A            HDPROG        10A        1
     A                                    20'Plant:'
     A            HDPLNT        20A       27
     A                                    65'THE GOODYEAR TIRE & RUBBER COMPANY'
     A                                   115'   Page:'
     A            HDPAGE         5  0    124EDTCDE(Z)
      ************************
     A          R HEAD02
     A                                      SKIPB(2)
     A                                     1'RunDate:'
     A            HDRDAT        10A       10
     A                                    63'Catalog Preferred Item Exception '
     A                                    96'Report'
     A                                   115'RunTime:'
     A            HDRTIM         8A      124
      ************************
     A          R HEAD03
     A                                      SKIPB(6)
     A                                    16'CorpCode'
     A                                      UNDERLINE
     A                                    26'Manufacturer Name             '
     A                                      UNDERLINE
     A                                    58'Manufacturer Part Number      '
     A                                      UNDERLINE
     A                                    90'Vendor ID '
     A                                      UNDERLINE
     A                                   102'Pref/Ovrd '
     A                                      UNDERLINE
     A                                   114'ReasonCd'
     A                                      UNDERLINE
     A                                   123'  Pref Price'
     A                                      UNDERLINE
     A                                   137'  Ovrd Price'
     A                                      UNDERLINE
      ***************************************************************
      * Detail Line Format for ARIBABUYER CATALOG DATA
      ***************************************************************
     A          R DETAIL1
     A                                      SPACEB(1)
     A                                     1'ARIBA CATALOG: '
     A            DLCC           8A       16
     A            DLNAME1       30A       26
     A            DLPART1       30A       58
     A            DLVENDR       10A       90
     A            DLTYPE        10A      102
     A            DLREASN        4A      116
     A            DLPPRIC       11S 4    123EDTCDE(3)
     A            DLOPRIC       11S 4    137EDTCDE(4)
      ***************************************************************
      * Detail Line Format for DMANPART DATA
      ***************************************************************
     A          R DETAIL2
     A                                      SPACEB(1)
     A                                     1'         CSIS: '
     A            DLCC           8A       16
     A            DLNAME2       30A       26
     A            DLPART2       30A       58
      ***************************************************************
      * TOTAL LINE FORMAT
      ***************************************************************
     A          R TOTAL1
     A                                      SPACEB(1)
     A                                     1'Catalog Records READ .......'
     A            TLREAD         7S 0     30EDTCDE(1)
     A                                      SPACEA(1)
     A                                     1'Catalog Records PRINTED ....'
     A            TLPRNT         7S 0     30EDTCDE(1)
      ***************************************************************
      * WRITE A BLANK LINE
      ***************************************************************
     A          R BLANK1
     A                                      SPACEB(1)
     A                                     1' '
      ***************************************************************
      * End of Report Banner - Format EOR
      ***************************************************************
     A          R EOR
     A                                      SPACEB(2)
     A                                     2'*** End  of  Report ***'
      ***************************************************************
      *                       END  OF  SOURCE
      ***************************************************************
