      ***************************************************************
      * FILE NAME : XARIBAPRF
      * FILE TYPE : PRINTER FILE
      *
      * PROGRAM   : TARBEXCP2
      *
      * PURPOSE   : CATALOG REFRESH ERROR LIST
      *
      * CREATED   :  4/07/2004
      * AUTHOR    : DAN RAUCH - EXLTECH, LLC
      ***************************************************************
      * SPECIAL NOTES:
      ***************************************************************
     A                                      INDARA
     A          R HEAD01
     A                                      SKIPB(1)
     A            HDPROG        10A        1
     A                                    20'Plant:'
     A            HDPLNT        20A       27
     A                                    65'THE GOODYEAR TIRE & RUBBER COMPANY'
     A                                   115'   Page:'
     A            HDPAGE         5  0    124EDTCDE(Z)
      ************************
     A          R HEAD02
     A                                      SKIPB(2)
     A                                     1'RunDate:'
     A            HDRDAT        10A       10
     A                                    65'Catalog Refresh Error Report'
     A                                   115'RunTime:'
     A            HDRTIM         8A      124
      ************************
     A          R HEAD03
     A                                      SKIPB(6)
     A                                     1'CorpCode'
     A                                      UNDERLINE
     A                                    12'Manufacturer Name             '
     A                                      UNDERLINE
     A                                    45'Manufacturer Part Nbr'
     A                                      UNDERLINE
     A                                    68'Message                        '
     A                                      UNDERLINE
      ***************************************************************
      * Detail Line Format for ARIBABUYER CATALOG DATA
      ***************************************************************
     A          R DETAIL1
     A                                      SPACEB(1)
     A            DLCC           8A        1
     A            DLNAME        30A       12
     A            DLPART        20A       45
     A            DLMSG         50A       68
     A****
      ***************************************************************
      * WRITE A BLANK LINE
      ***************************************************************
     A          R BLANK1
     A                                      SPACEB(1)
     A                                     1' '
      ***************************************************************
      * No Errors Found - Format NOERRS
      ***************************************************************
     A          R NOERRS
     A                                      SPACEB(1)
     A                                     2'*** No Catalog Errors  '
      ***************************************************************
      * End of Report Banner - Format EOR
      ***************************************************************
     A          R EOR
     A                                      SPACEB(2)
     A                                     2'*** End  of  Report ***'
      ***************************************************************
      *                       END  OF  SOURCE
      ***************************************************************
