     A*%%TS  SD  19950811  131537  A229282     REL-V3R1M0  5763-PW1
     A*            15:44:56    T881S28     VALTMAIN.HPTO38.CME
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A          R FALTADD
     A*%%TS  SD  19950421  131920  A229282     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 22'ADD AN ALTERNATE KEY'
     A                                  5  1'Type the alternate key and the ven-
     A                                      dor code for that alternate key.  T-
     A                                      he'
     A                                  6  1'vendor code must exist in the vend-
     A                                      or database.  The alternate key mus-
     A                                      t'
     A                                  7  1'not already exist.'
     A                                 10 18'ALTERNATE KEY    VENDOR CODE'
     A            ALTKEY        10A  B 11 18DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            CODE          10A  B 11 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f7-EXIT f3-END PROGRAM     -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FALTDEL
     A*%%TS  SD  19950421  131920  A229282     REL-V3R1M0  5763-PW1
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      PUTOVR
     A                                  1 18'DELETE AN ALTERNATE KEY'
     A                                  4  9'Type the alternate key to delete a-
     A                                      nd press "enter":'
     A            ALTKEY        10A  B  6 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            DUMMYCD       10A  B  9 10DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f7-EXIT f3-END PROGRAM     -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FALTMENU
     A*%%TS  SD  19950811  131537  A229282     REL-V3R1M0  5763-PW1
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      PUTOVR
     A                                  1 20'VENDOR CODE ALTERNATE KEY MENU'
     A                                  3  1'This program allows you to add or'
     A                                  3 35'delete alternate keys for vendor c-
     A                                      odes.'
     A                                  4  1'For example, you may wish the name'
     A                                  4 36'BARCO1 to stand for vendor code'
     A                                  5  1'0801056000.'
     A                                  7  1'The ability to see a cross-referen-
     A                                      ce listing between alternate keys a-
     A                                      nd'
     A                                  8  1'vendor codes has been provided.'
     A                                 10  1'The alternate key can be used in t-
     A                                      he Vendor Inquiry (Q6A) to bring up-
     A                                       the'
     A                                 11  1'actual vendor code data.'
     A                                 13  1'Choose one of the following functi-
     A                                      ons:'
     A                                 15 18'f1   TO ADD ALTERNATE KEY'
     A                                 17 18'f2   TO DELETE ALTERNATE KEY'
     A                                 19 18'f7   FOR VENDOR/ALTERNATE CROSS-RE-
     A                                      FERENCE LIST'
     A                                 21 18'f8   FOR VENDOR INQUIRY'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-ADD ALT f2-DELETE ALT f7-
     A                                      -CROSS REF f8-VENDOR INQUIRY f3-END-
     A                                       PROGRAM')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FALTLST
     A*%%TS  SD  19950810  093322  A229282     REL-V3R1M0  5763-PW1
     A  20                                  CF01
     A  19                                  CF02
     A                                      CF03
     A                                      CF06
     A                                      PUTOVR
     A                                  1 20'VENDOR CODE/ALTERNATE KEY CROSS-RE-
     A                                      FERENCE'
     A                                  3 33'NAME'
     A                                      DSPATR(HI)
     A                                  4  2'----------'
     A                                  4 17'----------'
     A                                  4 33'-----------------------------------
     A                                      ----------'
     A                                 21  2'F1-PREV PAGE'
     A N20                                  DSPATR(ND)
     A                                      OVRATR
     A                                 21 17'F2-NEXT PAGE'
     A N19                                  DSPATR(ND)
     A                                      OVRATR
     A                                 21 33'F3-EXIT'
     A                                 21 44'F6-LIST BY'
     A                                  1 74'FALTLST'
     A            FLD001        10A  B  3  2DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            FLD002        10A  B  3 17DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            FLD003        10A  B  5  2OVRDTA
     A                                      DSPATR(PR)
     A            FLD004        10A  B  5 17OVRDTA
     A                                      DSPATR(PR)
     A            FLD005        44A  B  5 33OVRDTA
     A                                      DSPATR(PR)
     A            FLD006        10A  B  6  2OVRDTA
     A                                      DSPATR(PR)
     A            FLD007        10A  B  6 17OVRDTA
     A                                      DSPATR(PR)
     A            FLD008        44A  B  6 33OVRDTA
     A                                      DSPATR(PR)
     A            FLD009        10A  B  7  2OVRDTA
     A                                      DSPATR(PR)
     A            FLD010        10A  B  7 17OVRDTA
     A                                      DSPATR(PR)
     A            FLD011        44A  B  7 33OVRDTA
     A                                      DSPATR(PR)
     A            FLD012        10A  B  8  2OVRDTA
     A                                      DSPATR(PR)
     A            FLD013        10A  B  8 17OVRDTA
     A                                      DSPATR(PR)
     A            FLD014        44A  B  8 33OVRDTA
     A                                      DSPATR(PR)
     A            FLD015        10A  B  9  2OVRDTA
     A                                      DSPATR(PR)
     A            FLD016        10A  B  9 17OVRDTA
     A                                      DSPATR(PR)
     A            FLD017        44A  B  9 33OVRDTA
     A                                      DSPATR(PR)
     A            FLD018        10A  B 10  2OVRDTA
     A                                      DSPATR(PR)
     A            FLD019        10A  B 10 17OVRDTA
     A                                      DSPATR(PR)
     A            FLD020        44A  B 10 33OVRDTA
     A                                      DSPATR(PR)
     A            FLD021        10A  B 11  2OVRDTA
     A                                      DSPATR(PR)
     A            FLD022        10A  B 11 17OVRDTA
     A                                      DSPATR(PR)
     A            FLD023        44A  B 11 33OVRDTA
     A                                      DSPATR(PR)
     A            FLD024        10A  B 12  2OVRDTA
     A                                      DSPATR(PR)
     A            FLD025        10A  B 12 17OVRDTA
     A                                      DSPATR(PR)
     A            FLD026        44A  B 12 33OVRDTA
     A                                      DSPATR(PR)
     A            FLD027        10A  B 13  2OVRDTA
     A                                      DSPATR(PR)
     A            FLD028        10A  B 13 17OVRDTA
     A                                      DSPATR(PR)
     A            FLD029        44A  B 13 33OVRDTA
     A                                      DSPATR(PR)
     A            FLD030        10A  B 14  2OVRDTA
     A                                      DSPATR(PR)
     A            FLD031        10A  B 14 17OVRDTA
     A                                      DSPATR(PR)
     A            FLD032        44A  B 14 33OVRDTA
     A                                      DSPATR(PR)
     A            FLD033        10A  B 15  2OVRDTA
     A                                      DSPATR(PR)
     A            FLD034        10A  B 15 17OVRDTA
     A                                      DSPATR(PR)
     A            FLD035        44A  B 15 33OVRDTA
     A                                      DSPATR(PR)
     A            FLD036        10A  B 16  2OVRDTA
     A                                      DSPATR(PR)
     A            FLD037        10A  B 16 17OVRDTA
     A                                      DSPATR(PR)
     A            FLD038        44A  B 16 33OVRDTA
     A                                      DSPATR(PR)
     A            FLD039        10A  B 17  2OVRDTA
     A                                      DSPATR(PR)
     A            FLD040        10A  B 17 17OVRDTA
     A                                      DSPATR(PR)
     A            FLD041        44A  B 17 33OVRDTA
     A                                      DSPATR(PR)
     A            FLD042        10A  B 18  2OVRDTA
     A                                      DSPATR(PR)
     A            FLD043        10A  B 18 17OVRDTA
     A                                      DSPATR(PR)
     A            FLD044        44A  B 18 33OVRDTA
     A                                      DSPATR(PR)
     A            FLD045        10A  B 19  2OVRDTA
     A                                      DSPATR(PR)
     A            FLD046        10A  B 19 17OVRDTA
     A                                      DSPATR(PR)
     A            FLD047        44A  B 19 33OVRDTA
     A                                      DSPATR(PR)
     A            FLD048         9A  B 21 56DSPATR(RI)
     A                                      OVRDTA
     A                                      DSPATR(PR)
     A            COMMANDLN1    79A  B 24  1DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
