     A*            15:44:56    T881S28     VALTMAIN.HPTO38.CME
     A                                      DSPSIZ(24 80 *DS3)
     A                                      INDARA
     A                                      PRINT
     A                                      CHGINPDFT
     A          R FALTADD
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 22'ADD AN ALTERNATE KEY'
     A                                  5  1'Type the alternate key and the cor-
     A                                      porate code for that alternate key.-
     A                                        The'
     A                                  6  1'corporate code must exist in the s-
     A                                      tores database.  The alternate key'
     A                                  6 70'must'
     A                                  7  1'not already exist.'
     A                                 10 17'ALTERNATE KEY    CORP CODE'
     A            ALTKEY        12A  B 11 18DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            CODE           7A  B 11 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f7-EXIT f3-END PROGRAM     -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FALTDEL
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 18'DELETE AN ALTERNATE KEY'
     A                                  4  9'Type the alternate key to delete a-
     A                                      nd press "enter":'
     A            ALTKEY        12A  B  6 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            DUMMYCD        7A  B  9  9DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f7-EXIT f3-END PROGRAM     -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FALTMENU
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 17'CORPORATE CODE ALTERNATE KEY MENU'
     A                                  3  1'This program allows you to add or'
     A                                  3 35'delete alternate keys for corporat-
     A                                      e codes.'
     A                                  4  1'For example, you may wish the name'
     A                                  4 36'ADAMAX to stand for corporate code'
     A                                  5  1'2601011.'
     A                                  7  1'The alternate key can be used in t-
     A                                      he Material Status Inquiry (Q1) to'
     A                                  7 70'bring up'
     A                                  8  1'the actual corporate code data.'
     A                                 10  1'Note: for raw materials, the alter-
     A                                      nate keys are maintained automatica-
     A                                      lly by'
     A                                 11  1'the Akron Update program.'
     A                                 13  1'Choose one of the following functi-
     A                                      ons:'
     A                                 15 17'f1   TO ADD ALTERNATE KEY'
     A                                 17 17'f2   TO DELETE ALTERNATE KEY'
     A                                 19 17'f8   FOR MATERIAL STATUS INQUIRY'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-ADD ALT KEY f2-DELETE AL-
     A                                      T KEY f8-MATERIAL STATUS f3-END PRO-
     A                                      GRAM             ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
