     A*            15:46:57    T881S28     VAPUPDAT.HPTO38.CME
     A                                      DSPSIZ(24 80 *DS3)
     A                                      INDARA
     A                                      PRINT
     A                                      CHGINPDFT
     A          R ACCGMATL
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 23'CORPORATE STORES ACCOUNTING SYSTEM'
     A                                  1 75'SAP2-3'
     A                                  2 31'TRANSACTION UPDATE'
     A                                  5  1'ENTER ALL FIELDS FOR TRANSACTION T-
     A                                      O BE CHANGED'
     A                                  8  1'MATERIAL CODE'
     A                                 10  1'VALUE'
     A                                 10 42'.'
     A                                 20  1'PRESS "F7" TO RETURN TO MAIN MENU'
     A                                 21  1'PRESS "F3" TO END PROGRAM'
     A            MATLCDE        7A  B  8 29DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            VALUE1        14Y 2B 10 29DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            S              1A  B 10 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                      VALUES('+' '-')
     A            COMMANDLN1    79A  B 24  1DFTVAL('f7-PREVIOUS SCREEN f3-END P-
     A                                      ROGRAM                             -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R ACCGPONO
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 23'CORPORATE STORES ACCOUNTING SYSTEM'
     A                                  1 75'SAP2-2'
     A                                  2 31'TRANSACTION UPDATE'
     A                                  5  1'ENTER ALL FIELDS FOR TRANSACTION T-
     A                                      O BE CHANGED'
     A                                  8  1'PURCHASE ORDER NUMBER      '
     A                                 10  1'ITEM NUMBER'
     A                                 12  1'VALUE'
     A                                 12 42'.'
     A                                 14  1'RCVR'
     A                                 21  1'PRESS "F7" TO RETURN TO MAIN MENU'
     A                                 22  1'PRESS "F3" TO END PROGRAM'
     A            ORDERNO        7A  B  8 29DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            REL            3Y 0B  8 40DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            ITEM           4Y 0B 10 29DSPATR(UL)
     A                                      CHECK(RZ)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            VALUE1        14Y 2B 12 29DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            S              1A  B 12 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                      VALUES('+' '-')
     A            RCV            3Y 0B 14 29DSPATR(UL)
     A                                      CHECK(RZ)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f7-PREVIOUS SCREEN f3-END P-
     A                                      ROGRAM                             -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R ACCGSEL
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 23'CORPORATE STORES ACCOUNTING SYSTEM'
     A                                  1 75'SAP2-1'
     A                                  2 31'TRANSACTION UPDATE'
     A                                  7  1'DO YOU WANT TO PROCESS TRANSACTION-
     A                                      S BY:'
     A                                  9 29'1.  PURCHASE ORDER NUMBER'
     A                                 10 29'2.  MATERIAL CODE'
     A                                 13  1'ENTER NUMBER OF SELECTION  '
     A                                 20  1'PRESS "F3" TO END PROGRAM'
     A            X              1A  B 13 29DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                      VALUES('1' '2')
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-END PROGRAM             -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R ACCGTRAN
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 23'CORPORATE STORES ACCOUNTING SYSTEM'
     A                                  1 75'SAP2-4'
     A                                  2 31'TRANSACTION UPDATE'
     A                                  5  1'MATERIAL CODE .......'
     A                                  6  1'PO NUMBER ...........'
     A                                  7  1'RCVR NUMBER .........'
     A                                  8  1'ITEM NUMBER .........'
     A                                  9  1'TRANSACTION CODE ....'
     A                                 10  1'TRANSACTION DATE ....'
     A                                 11  1'QUANTITY ............'
     A                                 12  1'VALUE ...............'
     A                                 13  1'DOCUMENT NUMBER .....'
     A                                 14  1'UNIT OF MEASURE .....'
     A                                 18  1'CLASS CODE ..........'
     A                                 18 41'PRESS "F6" TO ENTER NEW TRANSACTIO-
     A                                      N'
     A                                 19  1'DEPARTMENT ..........'
     A                                 19 41'PRESS "F7" TO RETURN TO MAIN MENU'
     A                                 20  1'ACCOUNT .............'
     A                                 20 41'PRESS "F3" TO END PROGRAM'
     A            MATLCDE        7A  B  5 23DSPATR(PR)
     A                                      OVRDTA
     A            ORDERNO        7A  B  6 23DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  6 33DSPATR(PR)
     A                                      OVRDTA
     A            RCV            3A  B  7 23DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4A  B  8 23DSPATR(PR)
     A                                      OVRDTA
     A            TRAN           4A  B  9 23DSPATR(PR)
     A                                      OVRDTA
     A            TRANDATE       8A  B 10 23DSPATR(PR)
     A                                      OVRDTA
     A            QUANTITY      10A  B 11 23DSPATR(PR)
     A                                      OVRDTA
     A            N              1A  B 11 34DSPATR(PR)
     A                                      OVRDTA
     A            VALUE         15A  B 12 23DSPATR(PR)
     A                                      OVRDTA
     A            V              1A  B 12 39DSPATR(PR)
     A                                      OVRDTA
     A            DOCUMENTNO    12A  B 13 23DSPATR(PR)
     A                                      OVRDTA
     A            UM             2A  B 14 23DSPATR(PR)
     A                                      OVRDTA
     A            CLS            3A  B 18 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            DEPT           4A  B 19 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            ACCOUN         6Y 0B 20 23DSPATR(UL)
     A                                      CHECK(RZ)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f6-PREVIOUS SCREEN f7-MAIN -
     A                                      SCREEN f3-END PROGRAM              -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
