     A*            13:46:23    T881S28     VBALHRS.HPTO38.CME
     A                                      DSPSIZ(24 80 *DS3)
     A                                      INDARA
     A                                      PRINT
     A                                      CHGINPDFT
     A  98                                  INVITE
     A          R AH_PARENT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'Divisio'
     A                                  1 15'Dept'
     A                                  1 27'Class'
     A                                  1 38'Shift'
     A                                  3 10'FI LAST NAME'
     A                                  3 30'MON  TUES WED  THUR FRI  SAT  SUN'
     A            X              2A  B  1 10DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  1 20DSPATR(PR)
     A                                      OVRDTA
     A            CL             2A  B  1 33DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B  1 44DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  4 10DSPATR(PR)
     A                                      OVRDTA
     A            ANAME         15A  B  4 13DSPATR(PR)
     A                                      OVRDTA
     A            A1             2A  B  4 31DSPATR(PR)
     A                                      OVRDTA
     A            A2             2A  B  4 36DSPATR(PR)
     A                                      OVRDTA
     A            A3             2A  B  4 41DSPATR(PR)
     A                                      OVRDTA
     A            A4             2A  B  4 46DSPATR(PR)
     A                                      OVRDTA
     A            A5             2A  B  4 51DSPATR(PR)
     A                                      OVRDTA
     A            A6             2A  B  4 56DSPATR(PR)
     A                                      OVRDTA
     A            A7             2A  B  4 61DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B  6 10DSPATR(PR)
     A                                      OVRDTA
     A            BNAME         15A  B  6 13DSPATR(PR)
     A                                      OVRDTA
     A            B1             2A  B  6 31DSPATR(PR)
     A                                      OVRDTA
     A            B2             2A  B  6 36DSPATR(PR)
     A                                      OVRDTA
     A            B3             2A  B  6 41DSPATR(PR)
     A                                      OVRDTA
     A            B4             2A  B  6 46DSPATR(PR)
     A                                      OVRDTA
     A            B5             2A  B  6 51DSPATR(PR)
     A                                      OVRDTA
     A            B6             2A  B  6 56DSPATR(PR)
     A                                      OVRDTA
     A            B7             2A  B  6 61DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  8 10DSPATR(PR)
     A                                      OVRDTA
     A            CNAME         15A  B  8 13DSPATR(PR)
     A                                      OVRDTA
     A            C1             2A  B  8 31DSPATR(PR)
     A                                      OVRDTA
     A            C2             2A  B  8 36DSPATR(PR)
     A                                      OVRDTA
     A            C3             2A  B  8 41DSPATR(PR)
     A                                      OVRDTA
     A            C4             2A  B  8 46DSPATR(PR)
     A                                      OVRDTA
     A            C5             2A  B  8 51DSPATR(PR)
     A                                      OVRDTA
     A            C6             2A  B  8 56DSPATR(PR)
     A                                      OVRDTA
     A            C7             2A  B  8 61DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 10 10DSPATR(PR)
     A                                      OVRDTA
     A            DNAME         15A  B 10 13DSPATR(PR)
     A                                      OVRDTA
     A            D1             2A  B 10 31DSPATR(PR)
     A                                      OVRDTA
     A            D2             2A  B 10 36DSPATR(PR)
     A                                      OVRDTA
     A            D3             2A  B 10 41DSPATR(PR)
     A                                      OVRDTA
     A            D4             2A  B 10 46DSPATR(PR)
     A                                      OVRDTA
     A            D5             2A  B 10 51DSPATR(PR)
     A                                      OVRDTA
     A            D6             2A  B 10 56DSPATR(PR)
     A                                      OVRDTA
     A            D7             2A  B 10 61DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 12 10DSPATR(PR)
     A                                      OVRDTA
     A            ENAME         15A  B 12 13DSPATR(PR)
     A                                      OVRDTA
     A            E1             2A  B 12 31DSPATR(PR)
     A                                      OVRDTA
     A            E2             2A  B 12 36DSPATR(PR)
     A                                      OVRDTA
     A            E3             2A  B 12 41DSPATR(PR)
     A                                      OVRDTA
     A            E4             2A  B 12 46DSPATR(PR)
     A                                      OVRDTA
     A            E5             2A  B 12 51DSPATR(PR)
     A                                      OVRDTA
     A            E6             2A  B 12 56DSPATR(PR)
     A                                      OVRDTA
     A            E7             2A  B 12 61DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 14 10DSPATR(PR)
     A                                      OVRDTA
     A            FNAME         15A  B 14 13DSPATR(PR)
     A                                      OVRDTA
     A            F1             2A  B 14 31DSPATR(PR)
     A                                      OVRDTA
     A            F2             2A  B 14 36DSPATR(PR)
     A                                      OVRDTA
     A            F3             2A  B 14 41DSPATR(PR)
     A                                      OVRDTA
     A            F4             2A  B 14 46DSPATR(PR)
     A                                      OVRDTA
     A            F5             2A  B 14 51DSPATR(PR)
     A                                      OVRDTA
     A            F6             2A  B 14 56DSPATR(PR)
     A                                      OVRDTA
     A            F7             2A  B 14 61DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 16 10DSPATR(PR)
     A                                      OVRDTA
     A            GNAME         15A  B 16 13DSPATR(PR)
     A                                      OVRDTA
     A            G1             2A  B 16 31DSPATR(PR)
     A                                      OVRDTA
     A            G2             2A  B 16 36DSPATR(PR)
     A                                      OVRDTA
     A            G3             2A  B 16 41DSPATR(PR)
     A                                      OVRDTA
     A            G4             2A  B 16 46DSPATR(PR)
     A                                      OVRDTA
     A            G5             2A  B 16 51DSPATR(PR)
     A                                      OVRDTA
     A            G6             2A  B 16 56DSPATR(PR)
     A                                      OVRDTA
     A            G7             2A  B 16 61DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 18 10DSPATR(PR)
     A                                      OVRDTA
     A            HNAME         15A  B 18 13DSPATR(PR)
     A                                      OVRDTA
     A            H1             2A  B 18 31DSPATR(PR)
     A                                      OVRDTA
     A            H2             2A  B 18 36DSPATR(PR)
     A                                      OVRDTA
     A            H3             2A  B 18 41DSPATR(PR)
     A                                      OVRDTA
     A            H4             2A  B 18 46DSPATR(PR)
     A                                      OVRDTA
     A            H5             2A  B 18 51DSPATR(PR)
     A                                      OVRDTA
     A            H6             2A  B 18 56DSPATR(PR)
     A                                      OVRDTA
     A            H7             2A  B 18 61DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 20 10DSPATR(PR)
     A                                      OVRDTA
     A            INAME         15A  B 20 13DSPATR(PR)
     A                                      OVRDTA
     A            I1             2A  B 20 31DSPATR(PR)
     A                                      OVRDTA
     A            I2             2A  B 20 36DSPATR(PR)
     A                                      OVRDTA
     A            I3             2A  B 20 41DSPATR(PR)
     A                                      OVRDTA
     A            I4             2A  B 20 46DSPATR(PR)
     A                                      OVRDTA
     A            I5             2A  B 20 51DSPATR(PR)
     A                                      OVRDTA
     A            I6             2A  B 20 56DSPATR(PR)
     A                                      OVRDTA
     A            I7             2A  B 20 61DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R ATT_RPT_ME
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 25'PRINT BLANK ATTENDANCE REPORTS'
     A                                  4  1'To print attendance sheets for all'
     A                                  4 36'shifts and departments in your div-
     A                                      ision,'
     A                                  5  1'just press f1.'
     A                                  7  1'You may enter a department number'
     A                                  7 35'and shift then press f4 to print a-
     A                                      n'
     A                                  8  1'attendance sheet for just one crew-
     A                                      .'
     A                                 10  1'You may also select the number of'
     A                                 10 35'copies of attendances sheets that'
     A                                 10 69'you want.'
     A                                 11  1'The default value is one copy but'
     A                                 11 35'you may request up to ten copies.'
     A                                 15 31'Number of Copies'
     A                                 17 32'Dept'
     A                                 17 43'Shift'
     A            CO             2Y 0B 15 48DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            DEPT           4Y 0B 17 37DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            S              1A  B 17 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-ENTIRE DIVISION f4-SELEC-
     A                                      TED DEPT f6-PRINT MENU f7-MGMT MENU-
     A                                       f3-MAIN MENU    ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R COL_CLASS_
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 27'COLLATE CLASSIFICATIONS'
     A                                  2 32'FOR DEPT'
     A                                  4 18'Make changes as desired, then pres-
     A                                      s ENTER.'
     A                                  7 22'COL'
     A                                  7 37'COL'
     A                                  7 52'COL'
     A                                  8 22'NUM CLASS      NUM CLASS      NUM'
     A                                  8 56'CLASS'
     A            DEPT           4A  B  2 41DSPATR(PR)
     A                                      OVRDTA
     A            BA             3Y 0B 10 22DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  53                                  DSPATR(RI)
     A  53
     AO 97 96                               DSPATR(PC)
     A            E1             2A  B 10 27DSPATR(PR)
     A                                      OVRDTA
     A            AA             3Y 0B 10 37DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            D1             2A  B 10 42DSPATR(PR)
     A                                      OVRDTA
     A            CA             3Y 0B 10 52DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  67                                  DSPATR(RI)
     A  67                                  DSPATR(PC)
     A            F1             2A  B 10 57DSPATR(PR)
     A                                      OVRDTA
     A            BB             3Y 0B 11 22DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  55                                  DSPATR(RI)
     A  55                                  DSPATR(PC)
     A            E2             2A  B 11 27DSPATR(PR)
     A                                      OVRDTA
     A            AB             3Y 0B 11 37DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            D2             2A  B 11 42DSPATR(PR)
     A                                      OVRDTA
     A            CB             3Y 0B 11 52DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  70                                  DSPATR(RI)
     A  70                                  DSPATR(PC)
     A            F2             2A  B 11 57DSPATR(PR)
     A                                      OVRDTA
     A            BC             3Y 0B 12 22DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  57                                  DSPATR(RI)
     A  57                                  DSPATR(PC)
     A            E3             2A  B 12 27DSPATR(PR)
     A                                      OVRDTA
     A            AC             3Y 0B 12 37DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            D3             2A  B 12 42DSPATR(PR)
     A                                      OVRDTA
     A            CC             3Y 0B 12 52DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  73                                  DSPATR(RI)
     A  73                                  DSPATR(PC)
     A            F3             2A  B 12 57DSPATR(PR)
     A                                      OVRDTA
     A            BD             3Y 0B 13 22DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  59                                  DSPATR(RI)
     A  59                                  DSPATR(PC)
     A            E4             2A  B 13 27DSPATR(PR)
     A                                      OVRDTA
     A            AD             3Y 0B 13 37DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            D4             2A  B 13 42DSPATR(PR)
     A                                      OVRDTA
     A            CD             3Y 0B 13 52DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  76                                  DSPATR(RI)
     A  76                                  DSPATR(PC)
     A            F4             2A  B 13 57DSPATR(PR)
     A                                      OVRDTA
     A            BE             3Y 0B 14 22DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            E5             2A  B 14 27DSPATR(PR)
     A                                      OVRDTA
     A            AE             3Y 0B 14 37DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            D5             2A  B 14 42DSPATR(PR)
     A                                      OVRDTA
     A            CE             3Y 0B 14 52DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  79                                  DSPATR(RI)
     A  79                                  DSPATR(PC)
     A            F5             2A  B 14 57DSPATR(PR)
     A                                      OVRDTA
     A            BF             3Y 0B 15 22DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            E6             2A  B 15 27DSPATR(PR)
     A                                      OVRDTA
     A            AF             3Y 0B 15 37DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            D6             2A  B 15 42DSPATR(PR)
     A                                      OVRDTA
     A            CF             3Y 0B 15 52DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  82                                  DSPATR(RI)
     A  82                                  DSPATR(PC)
     A            F6             2A  B 15 57DSPATR(PR)
     A                                      OVRDTA
     A            BG             3Y 0B 16 22DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  84                                  DSPATR(RI)
     A  84                                  DSPATR(PC)
     A            E7             2A  B 16 27DSPATR(PR)
     A                                      OVRDTA
     A            AG             3Y 0B 16 37DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            D7            13A  B 16 42DSPATR(PR)
     A                                      OVRDTA
     A            F7             2A  B 16 57DSPATR(PR)
     A                                      OVRDTA
     A            BH             3Y 0B 17 22DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  88                                  DSPATR(RI)
     A  88                                  DSPATR(PC)
     A            E8             2A  B 17 27DSPATR(PR)
     A                                      OVRDTA
     A            AH             3Y 0B 17 37DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            D8             2A  B 17 42DSPATR(PR)
     A                                      OVRDTA
     A            CH             3Y 0B 17 52DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  90                                  DSPATR(RI)
     A  90                                  DSPATR(PC)
     A            F8             2A  B 17 57DSPATR(PR)
     A                                      OVRDTA
     A            BI             3Y 0B 18 22DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  92                                  DSPATR(RI)
     A  92                                  DSPATR(PC)
     A            E9             2A  B 18 27DSPATR(PR)
     A                                      OVRDTA
     A            AI             3Y 0B 18 37DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            D9             2A  B 18 42DSPATR(PR)
     A                                      OVRDTA
     A            CI             3Y 0B 18 52DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  94                                  DSPATR(RI)
     A  94                                  DSPATR(PC)
     A            F9             2A  B 18 57DSPATR(PR)
     A                                      OVRDTA
     A            BJ             3Y 0B 19 22DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  96                                  DSPATR(RI)
     A  96                                  DSPATR(PC)
     A            E0             2A  B 19 27DSPATR(PR)
     A                                      OVRDTA
     A            AJ             3Y 0B 19 37DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            D0             2A  B 19 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  98                                  DSPATR(RI)
     A  98                                  DSPATR(PC)
     A            CJ             3Y 0B 19 52DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(PC)
     A            F0             2A  B 19 57DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f7-COLLATE MENU f3-MAIN MEN-
     A                                      U                                  -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R COL_DEPT_1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 30'COLLATE DEPARTMENTS'
     A                                  3 19'Make changes as desired then press'
     A                                  3 54'ENTER.'
     A                                  6  6'COL'
     A                                  6 25'COL'
     A                                  6 43'COL'
     A                                  6 61'COL'
     A                                  7  6'NUM DEPT'
     A                                  7 25'NUM DEPT'
     A                                  7 43'NUM DEPT'
     A                                  7 61'NUM DEPT'
     A            AA             3Y 0B  9  6DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            D1             4A  B  9 11DSPATR(PR)
     A                                      OVRDTA
     A            AB             3Y 0B  9 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            D2             4A  B  9 30DSPATR(PR)
     A                                      OVRDTA
     A            AC             3Y 0B  9 43DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            D3             4A  B  9 48DSPATR(PR)
     A                                      OVRDTA
     A            AD             3Y 0B  9 61DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            D4             4A  B  9 66DSPATR(PR)
     A                                      OVRDTA
     A            AE             3Y 0B 10  6DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            D5             4A  B 10 11DSPATR(PR)
     A                                      OVRDTA
     A            AF             3Y 0B 10 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            D6             4A  B 10 30DSPATR(PR)
     A                                      OVRDTA
     A            AG             3Y 0B 10 43DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            D7             4A  B 10 48DSPATR(PR)
     A                                      OVRDTA
     A            AH             3Y 0B 10 61DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            D8             4A  B 10 66DSPATR(PR)
     A                                      OVRDTA
     A            AI             3Y 0B 11  6DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            D9             4A  B 11 11DSPATR(PR)
     A                                      OVRDTA
     A            AJ             3Y 0B 11 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            D10            4A  B 11 30DSPATR(PR)
     A                                      OVRDTA
     A            AK             3Y 0B 11 43DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            D11            4A  B 11 48DSPATR(PR)
     A                                      OVRDTA
     A            AL             3Y 0B 11 61DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            D12            4A  B 11 66DSPATR(PR)
     A                                      OVRDTA
     A            AM             3Y 0B 12  6DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            D13            4A  B 12 11DSPATR(PR)
     A                                      OVRDTA
     A            AN             3Y 0B 12 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            D14            4A  B 12 30DSPATR(PR)
     A                                      OVRDTA
     A            AO             3Y 0B 12 43DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            D15            4A  B 12 48DSPATR(PR)
     A                                      OVRDTA
     A            AP             3Y 0B 12 61DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            D16            4A  B 12 66DSPATR(PR)
     A                                      OVRDTA
     A            AQ             3Y 0B 13  6DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            D17            4A  B 13 11DSPATR(PR)
     A                                      OVRDTA
     A            AR             3Y 0B 13 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            D18            4A  B 13 30DSPATR(PR)
     A                                      OVRDTA
     A            AS             3Y 0B 13 43DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            D19            4A  B 13 48DSPATR(PR)
     A                                      OVRDTA
     A            AT             3Y 0B 13 61DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A            D20            4A  B 13 66DSPATR(PR)
     A                                      OVRDTA
     A            AU             3Y 0B 14  6DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            D21            4A  B 14 11DSPATR(PR)
     A                                      OVRDTA
     A            AV             3Y 0B 14 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A            D22            4A  B 14 30DSPATR(PR)
     A                                      OVRDTA
     A            AW             3Y 0B 14 43DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A            D23            4A  B 14 48DSPATR(PR)
     A                                      OVRDTA
     A            AX             3Y 0B 14 61DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(PC)
     A            D24            4A  B 14 66DSPATR(PR)
     A                                      OVRDTA
     A            AY             3Y 0B 15  6DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A            D25            4A  B 15 11DSPATR(PR)
     A                                      OVRDTA
     A            AZ             3Y 0B 15 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A            D26            4A  B 15 30DSPATR(PR)
     A                                      OVRDTA
     A            BA             3Y 0B 15 43DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A            D27            4A  B 15 48DSPATR(PR)
     A                                      OVRDTA
     A            BB             3Y 0B 15 61DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  55                                  DSPATR(RI)
     A  55                                  DSPATR(PC)
     A            D28            4A  B 15 66DSPATR(PR)
     A                                      OVRDTA
     A            BC             3Y 0B 16  6DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  57                                  DSPATR(RI)
     A  57                                  DSPATR(PC)
     A            D29            4A  B 16 11DSPATR(PR)
     A                                      OVRDTA
     A            BD             3Y 0B 16 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  59                                  DSPATR(RI)
     A  59                                  DSPATR(PC)
     A            D30            4A  B 16 30DSPATR(PR)
     A                                      OVRDTA
     A            BE             3Y 0B 16 43DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            D31            4A  B 16 48DSPATR(PR)
     A                                      OVRDTA
     A            BF             3Y 0B 16 61DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            D32            4A  B 16 66DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f7-COLLATE MENU f3-MAIN MEN-
     A                                      U                                  -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R COL_MENU
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 34'COLLATE MENU'
     A                                  3  1'You may use this routine to specif-
     A                                      y the sequence in which your depart-
     A                                      ments'
     A                                  4  1'are presented or the sequence in w-
     A                                      hich your classifications within a'
     A                                  4 70'depart-'
     A                                  5  1'ment are presented.  WARNING both'
     A                                  5 35'of these routines may use a lot of'
     A                                  5 70'computer'
     A                                  6  1'time depending on how many records'
     A                                  6 36'it has to modify.  Please use thes-
     A                                      e routines'
     A                                  7  1'during low activity periods.  Note'
     A                                  7 36'also that they may keep your keybo-
     A                                      ard locked'
     A                                  8  1'up for 5 to 10 minutes so be patie-
     A                                      nt.'
     A                                 10  1'If you specify a collating value f-
     A                                      or one department, you should assig-
     A                                      n a UNIQUE'
     A                                 11  1'collating value for each departmen-
     A                                      t.  Likewise, if you specify a coll-
     A                                      ating valu'
     A                                 12  1'for one classification within a de-
     A                                      partment you should assign a UNIQUE-
     A                                       value for'
     A                                 13  1'each classification within that de-
     A                                      partment.'
     A                                 14  6'Departments assigned identical col-
     A                                      lating values in the hundrends and'
     A                                 14 75'tens'
     A                                 15  1'columns will be printed together o-
     A                                      n the attendance report.  If either-
     A                                       the'
     A                                 16  1'hundrends or tens column is differ-
     A                                      ent, they will be printed seperatel-
     A                                      y.  (ie.'
     A                                 17  1'101 and 100 will be printed togeth-
     A                                      er but 201 and 211 will be printed'
     A                                 17 70'seperately)'
     A                                 19  1'Press f5 to collate departments or'
     A                                 19 36'enter a department number and pres-
     A                                      s f6'
     A                                 20  1'to collate classifications within'
     A                                 20 35'a department.'
     A                                 22 31'Dept.'
     A            DEPT           4Y 0B 22 37DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f5-COLLATE DEPTS f6-COLLATE-
     A                                       CLASS f7-MGMT MENU f3-MAIN MENU   -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R EMP_REC_1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  3 26'EMPLOYEE RECORD HANDLING'
     A                                  8  1'USE f1, f2 or f8 to ADD, DELETE or'
     A                                  8 36'EDIT an employee"s record.'
     A                                 10  1'After the information is entered o-
     A                                      n the screen you have to use the EN-
     A                                      TER'
     A                                 11  1'key to perform the transaction.  T-
     A                                      he function keys may refresh the sc-
     A                                      reen'
     A                                 12  1'or return you to another screen, b-
     A                                      ut they will not perform the transa-
     A                                      ction.'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-ADD f2-DELETE f8-EDIT f5-
     A                                      -ENTER TTL HRS f3-MAIN MENU        -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R EMP_REC_AD
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 29'ADD EMPLOYEE RECORD'
     A                                  3  1'LAST NAME'
     A                                  3 28'FI '
     A                                  3 36'MI '
     A                                  3 44'SSN'
     A                                  5  1'SENORITY DATE  MO'
     A                                  5 22'DA'
     A                                  5 28'YR'
     A                                  5 37'PHONE'
     A                                  5 57'UNLISTED (Y OR N)'
     A                                  7  1'DIVISION'
     A                                  7 15'DEPT'
     A                                  7 27'CLASSIFICATION'
     A                                  7 47'SHIFT '
     A                                 10  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 11  1'(You may press f5 to automatically'
     A                                 11 36'enter maximum hours,'
     A                                 12 16'f6 to automatically enter average'
     A                                 12 50'hours -or-'
     A                                 13 16'manually enter hours -leave blank'
     A                                 13 50'if zero.)'
     A                                 16  1'REGULAR HRS  MO  TU  WE  TH  FR  S-
     A                                      A  SU  TOTAL   REG    DOT    SAT'
     A                                 16 70'SUN   HOL'
     A                                 17  6'WORKED'
     A                                 17 43'AVAIL.'
     A                                 18  5'REFUSED'
     A                                 18 42'REFUSED'
     A                                 19  1'OVERTIME'
     A                                 20  6'WORKED'
     A                                 21  5'REFUSED'
     A            NAME          15A  B  3 11DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            FIRSTINIT      1A  B  3 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            MIDINIT        1A  B  3 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            SSN            9Y 0B  3 48DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            MONTH          2Y 0B  5 19DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            DAY            2Y 0B  5 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            YR             3A  B  5 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            AREACODE       3A  B  5 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            FIR            3A  B  5 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            NUMB           4A  B  5 51DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            TRAINEE        1A  B  5 75DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            D              2A  B  7 10DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4Y 0B  7 20DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            CLASS          2Y 0B  7 42DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            SHIFT          1A  B  7 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            REGMONWKD      2Y 0B 17 14DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  55                                  DSPATR(RI)
     A  55                                  DSPATR(PC)
     A            REGTUEWKD      2Y 0B 17 18DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  56                                  DSPATR(RI)
     A  56                                  DSPATR(PC)
     A            REGWEDWKD      2Y 0B 17 22DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  57                                  DSPATR(RI)
     A  57                                  DSPATR(PC)
     A            REGTHUWKD      2Y 0B 17 26DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  58                                  DSPATR(RI)
     A  58                                  DSPATR(PC)
     A            REGFRI         2Y 0B 17 30DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  59                                  DSPATR(RI)
     A  59                                  DSPATR(PC)
     A            REGSATWKD      2Y 0B 17 34DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A            REGSUNWKD      2Y 0B 17 38DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            TOTALREGWK     4Y 0B 17 50DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            TOTDOT         4Y 0B 17 57DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A            SATWKD         3Y 0B 17 64DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            TOTALSUNWK     3Y 0B 17 70DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            TOTALHOLWK     3Y 0B 17 76DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            MONCHG         2Y 0B 18 14DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            TUECHG         2Y 0B 18 18DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A            WEDCHG         2Y 0B 18 22DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A            THUCHG         2Y 0B 18 26DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  66                                  DSPATR(RI)
     A  66                                  DSPATR(PC)
     A            FRICHG         2Y 0B 18 30DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  67                                  DSPATR(RI)
     A  67                                  DSPATR(PC)
     A            SATCHG         2Y 0B 18 34DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  68                                  DSPATR(RI)
     A  68                                  DSPATR(PC)
     A            SUNCHG         2Y 0B 18 38DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  69                                  DSPATR(RI)
     A  69                                  DSPATR(PC)
     A            TOTREGCHG      4Y 0B 18 50DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            TOTDOTCHG      4Y 0B 18 57DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            TOTSATCHG      3Y 0B 18 64DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            TOTSUNCHG      3Y 0B 18 70DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A            TOTHOLCHG      3Y 0B 18 76DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            OTWK           2Y 0B 20 14DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  70                                  DSPATR(RI)
     A  70                                  DSPATR(PC)
     A            TUOTWK         2Y 0B 20 18DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  71                                  DSPATR(RI)
     A  71                                  DSPATR(PC)
     A            WEOTSK         2Y 0B 20 22DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  72                                  DSPATR(RI)
     A  72                                  DSPATR(PC)
     A            THOTWK         2Y 0B 20 26DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  73                                  DSPATR(RI)
     A  73                                  DSPATR(PC)
     A            FROTWK         2Y 0B 20 30DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  74                                  DSPATR(RI)
     A  74                                  DSPATR(PC)
     A            SAOTWK         2Y 0B 20 34DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  75                                  DSPATR(RI)
     A  75                                  DSPATR(PC)
     A            SUOTWK         2Y 0B 20 38DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  76                                  DSPATR(RI)
     A  76                                  DSPATR(PC)
     A            MONOTCHG       2Y 0B 21 14DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A            TUEOTCHG       2Y 0B 21 18DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A            WEDOTCHG       2Y 0B 21 22DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A            THUROTCHG      2Y 0B 21 26DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A            FRIOTCHG       2Y 0B 21 30DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A            SATHRSCHG      2Y 0B 21 34DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A            SUNHRSCHG      2Y 0B 21 38DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  54                                  DSPATR(RI)
     A  54                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-REFRESH f2-DELETE SCREEN-
     A                                       f8-EDIT SCREEN f5-MAX HRS f6-AVG H-
     A                                      RS f3-MAIN MENU  ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R EMP_REC_DE
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 27'DELETE EMPLOYEE RECORD'
     A                                  4  1'ENTER EMPLOYEE"S SSN AND PRESS ENT-
     A                                      ER'
     A            SSN            9Y 0B  4 39DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-ADD SCREEN f8-EDIT SCREE-
     A                                      N f3-MAIN MENU                     -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R EMPRECD2
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 28'DELETE EMPLOYEE RECORD'
     A                                  3  1'LAST NAME'
     A                                  3 28'FI '
     A                                  3 36'MI '
     A                                  3 44'SSN'
     A                                  5  1'SENORITY DATE  MO'
     A                                  5 22'DA'
     A                                  5 28'YR'
     A                                  5 38'PHONE'
     A                                  5 59'UNLISTED'
     A                                  7  1'DIVISION'
     A                                  7 15'DEPT'
     A                                  7 27'CLASSIFICATION'
     A                                  7 47'SHIFT '
     A                                 10  1'REGULAR HRS  MO  TU  WE  TH  FR  S-
     A                                      A  SU  TOTAL   REG    DOT    SAT'
     A                                 10 70'SUN   HOL'
     A                                 11  6'WORKED'
     A                                 11 43'AVAIL.'
     A                                 12  5'REFUSED'
     A                                 12 42'REFUSED'
     A                                 13  1'OVERTIME'
     A                                 14  6'WORKED'
     A                                 15  5'REFUSED'
     A                                 16  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 17  1'IF THIS IS THE CORRECT RECORD TO D-
     A                                      ELETE, TYPE "YES" AND PRESS ENTER.'
     A                                 18  1'IF YOU DO NOT WANT TO DELETE THIS'
     A                                 18 35'RECORD, JUST PRESS ENTER.'
     A            NAME          15A  B  3 11DSPATR(PR)
     A                                      OVRDTA
     A            FIRSTINIT      1A  B  3 32DSPATR(PR)
     A                                      OVRDTA
     A            MIDINIT        1A  B  3 40DSPATR(PR)
     A                                      OVRDTA
     A            SSN            9A  B  3 48DSPATR(PR)
     A                                      OVRDTA
     A            MONTH          2A  B  5 19DSPATR(PR)
     A                                      OVRDTA
     A            DAY            2A  B  5 25DSPATR(PR)
     A                                      OVRDTA
     A            YR             3A  B  5 31DSPATR(PR)
     A                                      OVRDTA
     A            AREACODE       3A  B  5 44DSPATR(PR)
     A                                      OVRDTA
     A            FIR            3A  B  5 48DSPATR(PR)
     A                                      OVRDTA
     A            NUMB           4A  B  5 52DSPATR(PR)
     A                                      OVRDTA
     A            TRAINEE        1A  B  5 68DSPATR(PR)
     A                                      OVRDTA
     A            D              2A  B  7 10DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  7 20DSPATR(PR)
     A                                      OVRDTA
     A            CLASS          2A  B  7 42DSPATR(PR)
     A                                      OVRDTA
     A            SHIFT          1A  B  7 54DSPATR(PR)
     A                                      OVRDTA
     A            REGMONWKD      2A  B 11 14DSPATR(PR)
     A                                      OVRDTA
     A            REGTUEWKD      2A  B 11 18DSPATR(PR)
     A                                      OVRDTA
     A            REGWEDWKD      2A  B 11 22DSPATR(PR)
     A                                      OVRDTA
     A            REGTHUWKD      2A  B 11 26DSPATR(PR)
     A                                      OVRDTA
     A            REGFRI         2A  B 11 30DSPATR(PR)
     A                                      OVRDTA
     A            REGSATWKD      2A  B 11 34DSPATR(PR)
     A                                      OVRDTA
     A            REGSUNWKD      2A  B 11 38DSPATR(PR)
     A                                      OVRDTA
     A            TOTALREGWK     4A  B 11 50DSPATR(PR)
     A                                      OVRDTA
     A            TOTDOT         4A  B 11 57DSPATR(PR)
     A                                      OVRDTA
     A            SATWKD         3A  B 11 64DSPATR(PR)
     A                                      OVRDTA
     A            TOTALSUNWK     3A  B 11 70DSPATR(PR)
     A                                      OVRDTA
     A            TOTALHOLWK     3A  B 11 76DSPATR(PR)
     A                                      OVRDTA
     A            MONCHG         2A  B 12 14DSPATR(PR)
     A                                      OVRDTA
     A            TUECHG         2A  B 12 18DSPATR(PR)
     A                                      OVRDTA
     A            WEDCHG         2A  B 12 22DSPATR(PR)
     A                                      OVRDTA
     A            THUCHG         2A  B 12 26DSPATR(PR)
     A                                      OVRDTA
     A            FRICHG         2A  B 12 30DSPATR(PR)
     A                                      OVRDTA
     A            SATCHG         2A  B 12 34DSPATR(PR)
     A                                      OVRDTA
     A            SUNCHG         2A  B 12 38DSPATR(PR)
     A                                      OVRDTA
     A            TOTREGCHG      4A  B 12 50DSPATR(PR)
     A                                      OVRDTA
     A            TOTDOTCHG      4A  B 12 57DSPATR(PR)
     A                                      OVRDTA
     A            TOTSATCHG      3A  B 12 64DSPATR(PR)
     A                                      OVRDTA
     A            TOTSUNCHG      3A  B 12 70DSPATR(PR)
     A                                      OVRDTA
     A            TOTHOLCHG      3A  B 12 76DSPATR(PR)
     A                                      OVRDTA
     A            OTWK           2A  B 14 14DSPATR(PR)
     A                                      OVRDTA
     A            TUOTWK         2A  B 14 18DSPATR(PR)
     A                                      OVRDTA
     A            WEOTSK         2A  B 14 22DSPATR(PR)
     A                                      OVRDTA
     A            THOTWK         2A  B 14 26DSPATR(PR)
     A                                      OVRDTA
     A            FROTWK         2A  B 14 30DSPATR(PR)
     A                                      OVRDTA
     A            SAOTWK         2A  B 14 34DSPATR(PR)
     A                                      OVRDTA
     A            SUOTWK         2A  B 14 38DSPATR(PR)
     A                                      OVRDTA
     A            MONOTCHG       2A  B 15 14DSPATR(PR)
     A                                      OVRDTA
     A            TUEOTCHG       2A  B 15 18DSPATR(PR)
     A                                      OVRDTA
     A            WEDOTCHG       2A  B 15 22DSPATR(PR)
     A                                      OVRDTA
     A            THUROTCHG      2A  B 15 26DSPATR(PR)
     A                                      OVRDTA
     A            FRIOTCHG       2A  B 15 30DSPATR(PR)
     A                                      OVRDTA
     A            SATHRSCHG      2A  B 15 34DSPATR(PR)
     A                                      OVRDTA
     A            SUNHRSCHG      2A  B 15 38DSPATR(PR)
     A                                      OVRDTA
     A            YES            3A  B 20 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  77                                  DSPATR(RI)
     A  77
     AO 97 96                               DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R EMP_REC_ED
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 29'EDIT EMPLOYEE RECORDS'
     A                                  4  1'ENTER EMPLOYEE"S SSN'
     A                                  4 33'THEN PRESS "ENTER"'
     A            SSN            9Y 0B  4 22DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-ADD SCREEN f2-DELETE SCR-
     A                                      EEN f3-MAIN MENU                   -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R EMPRECE2
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 29'EDIT EMPLOYEE RECORD'
     A                                  3  1'LAST NAME'
     A                                  3 28'FI '
     A                                  3 36'MI '
     A                                  3 44'SSN'
     A                                  5  1'SENORITY DATE  MO'
     A                                  5 22'DA'
     A                                  5 28'YR'
     A                                  5 37'PHONE'
     A                                  5 58'UNLISTED'
     A                                  7  1'DIVISION'
     A                                  7 15'DEPT'
     A                                  7 27'CLASSIFICATION'
     A                                  7 47'SHIFT '
     A                                 11  1'REGULAR HRS  MO  TU  WE  TH  FR  S-
     A                                      A  SU  TOTAL   REG    DOT    SAT'
     A                                 11 70'SUN   HOL'
     A                                 12  6'WORKED'
     A                                 12 43'AVAIL.'
     A                                 13  5'REFUSED'
     A                                 13 42'REFUSED'
     A                                 14  1'OVERTIME'
     A                                 15  6'WORKED'
     A                                 16  5'REFUSED'
     A                                 17  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 18  1'MAKE ALL THE CHANGES DESIRED AND P-
     A                                      RESS "ENTER".'
     A                                 20  1'REFRESH (f8) WILL RESTORE THE ORIG-
     A                                      INAL INFORMATION.'
     A            NAME          15A  B  3 11DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            FIRSTINIT      1A  B  3 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            MIDINIT        1A  B  3 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            SSN            9A  B  3 48DSPATR(PR)
     A                                      OVRDTA
     A            MONTH          2Y 0B  5 19DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            DAY            2Y 0B  5 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            YR             3A  B  5 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            AREACODE       3A  B  5 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            FIR            3A  B  5 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            NUMB           4A  B  5 51DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            TRAINEE        1A  B  5 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            D              2A  B  7 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            DEPT           4Y 0B  7 20DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            CLASS          2Y 0B  7 42DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            SHIFT          1A  B  7 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            REGMONWKD      2Y 0B 12 14DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  55                                  DSPATR(RI)
     A  55                                  DSPATR(PC)
     A            REGTUEWKD      2Y 0B 12 18DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  56                                  DSPATR(RI)
     A  56                                  DSPATR(PC)
     A            REGWEDWKD      2Y 0B 12 22DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  57                                  DSPATR(RI)
     A  57                                  DSPATR(PC)
     A            REGTHUWKD      2Y 0B 12 26DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  58                                  DSPATR(RI)
     A  58                                  DSPATR(PC)
     A            REGFRI         2Y 0B 12 30DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  59                                  DSPATR(RI)
     A  59                                  DSPATR(PC)
     A            REGSATWKD      2Y 0B 12 34DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A            REGSUNWKD      2Y 0B 12 38DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            TOTALREGWK     4Y 0B 12 50DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            TOTDOT         4Y 0B 12 57DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A            SATWKD         3Y 0B 12 64DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            TOTALSUNWK     3Y 0B 12 70DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            TOTALHOLWK     3Y 0B 12 76DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            MONCHG         2Y 0B 13 14DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            TUECHG         2Y 0B 13 18DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A            WEDCHG         2Y 0B 13 22DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A            THUCHG         2Y 0B 13 26DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  66                                  DSPATR(RI)
     A  66                                  DSPATR(PC)
     A            FRICHG         2Y 0B 13 30DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  67                                  DSPATR(RI)
     A  67                                  DSPATR(PC)
     A            SATCHG         2Y 0B 13 34DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  68                                  DSPATR(RI)
     A  68                                  DSPATR(PC)
     A            SUNCHG         2Y 0B 13 38DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  69                                  DSPATR(RI)
     A  69                                  DSPATR(PC)
     A            TOTREGCHG      4Y 0B 13 50DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            TOTDOTCHG      4Y 0B 13 57DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            TOTSATCHG      3Y 0B 13 64DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            TOTSUNCHG      3Y 0B 13 70DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A            TOTHOLCHG      3Y 0B 13 76DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            OTWK           2Y 0B 15 14DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  70                                  DSPATR(RI)
     A  70                                  DSPATR(PC)
     A            TUOTWK         2Y 0B 15 18DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  71                                  DSPATR(RI)
     A  71                                  DSPATR(PC)
     A            WEOTSK         2Y 0B 15 22DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  72                                  DSPATR(RI)
     A  72                                  DSPATR(PC)
     A            THOTWK         2Y 0B 15 26DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  73                                  DSPATR(RI)
     A  73                                  DSPATR(PC)
     A            FROTWK         2Y 0B 15 30DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  74                                  DSPATR(RI)
     A  74                                  DSPATR(PC)
     A            SAOTWK         2Y 0B 15 34DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  75                                  DSPATR(RI)
     A  75                                  DSPATR(PC)
     A            SUOTWK         2Y 0B 15 38DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  76                                  DSPATR(RI)
     A  76                                  DSPATR(PC)
     A            MONOTCHG       2Y 0B 16 14DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A            TUEOTCHG       2Y 0B 16 18DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A            WEDOTCHG       2Y 0B 16 22DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A            THUROTCHG      2Y 0B 16 26DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A            FRIOTCHG       2Y 0B 16 30DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A            SATHRSCHG      2Y 0B 16 34DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A            SUNHRSCHG      2Y 0B 16 38DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  54                                  DSPATR(RI)
     A  54                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-ADD SCREEN f2-DELETE SCR-
     A                                      EEN f8-REFRESH f5-MAX HRS f6-AVG HR-
     A                                      S f3-MAIN MENU   ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R ENTER_HRS_
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 25'AUTOMATIC mode ENTER HOURS'
     A                                  3  6'Press f4 (MANUAL) if you want the'
     A                                  3 40'program to manually enter hours.'
     A                                  4  1'In manual mode the only hours adde-
     A                                      d to the file are the hours that yo-
     A                                      u'
     A                                  5  1'manually enter.  In automatic mode'
     A                                  5 36'(hours worked) if you don"t enter'
     A                                  5 70'8 hours'
     A                                  6  1'for an employee the program will c-
     A                                      harge them hours for that day to ma-
     A                                      ke a total'
     A                                  7  1'of 8 hours.  In automatic mode (ho-
     A                                      urs refused) if you don"t charge an-
     A                                       employee'
     A                                  8  1'with 8 hours refused the program w-
     A                                      ill credit them with hours worked'
     A                                  8 69'to total'
     A                                  9  1'8 hours for that day.'
     A                                 10  6'You may enter a Department number,'
     A                                 10 41'Classification and Shift to start'
     A                                 11  1'entering hours at a selected work'
     A                                 11 35'group.  If you do not enter a depa-
     A                                      rtment'
     A                                 12  1'number the program will start with'
     A                                 12 36'the first work group in your divis-
     A                                      ion and'
     A                                 13  1'sequentially step through your div-
     A                                      ision.'
     A                                 15  6'You may use f7 to go to the FINISH'
     A                                 15 41'HOURS instruction screen.  It will'
     A                                 16  1'allow you to automatically update'
     A                                 16 35'your entire division without havin-
     A                                      g to'
     A                                 17  1'view all the records yourself.'
     A                                 20 21'Department'
     A                                 20 39'Class'
     A                                 20 50'Shift'
     A            DEPT           4Y 0B 20 32DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            CL             2Y 0B 20 45DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            S              1A  B 20 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            WARNING       77A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f2-HOURS WORKED f8-HOURS RE-
     A                                      FUSED f4-MANUAL f7-FINISH HOURS f3--
     A                                      MAIN MENU        ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R ENTERHRS2
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 27'MANUAL mode ENTER HOURS'
     A                                  5  6'Press f4 (AUTO) if you want the pr-
     A                                      ogram to automatically credit the'
     A                                  6  1'employees with hours that you don"-
     A                                      t enter.  In manual mode the only'
     A                                  6 69'hours'
     A                                  7  1'added to the file are the hours th-
     A                                      at you manually enter.'
     A                                  9  6'You may enter a Department number,'
     A                                  9 41'Classification and Shift to start'
     A                                 10  1'entering hours at a selected work'
     A                                 10 35'group.  If you do not enter a depa-
     A                                      rtment'
     A                                 11  1'number the program will start with'
     A                                 11 36'the first work group in you divisi-
     A                                      on and'
     A                                 12  1'sequentially step through the work'
     A                                 12 36'groups in your division.'
     A                                 18 21'Department'
     A                                 18 39'Class'
     A                                 18 50'Shift'
     A            DEPT           4Y 0B 18 32DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            CL             2A  B 18 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            S              1A  B 18 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-OVERTIME HOURS f8-REGULA-
     A                                      R HOURS f4-AUTO f3-MAIN MENU       -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FINISH_HRS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 30'FINISH HOURS ROUTINE'
     A                                  4  6'This routine will automatically en-
     A                                      ter hours for any employee in your'
     A                                  5  1'division who does not already have'
     A                                  5 36'hours entered as hours worked or a-
     A                                      s hours'
     A                                  6  1'refused for the day shown.'
     A                                  8  6'If the day shown below is not the'
     A                                  8 40'day you want to be working on, use'
     A                                  9  1'f5 and f6 to get to the proper day-
     A                                      .'
     A                                 11  6'The box beside the day shows eithe-
     A                                      r "WORKED " or "REFUSED".  Use f4'
     A                                 11 74'to'
     A                                 12  1'change from worked to refused or f-
     A                                      rom refused to worked as desired.'
     A                                 12 70'What'
     A                                 13  1'ever is shown is how the hours wil-
     A                                      l be credited to the employees when-
     A                                       you'
     A                                 14  1'press f1 for REGULAR HOURS or f2 f-
     A                                      or SATURDAY HOURS'
     A                                 16  6'Remember f1 and f2 start the actua-
     A                                      l update of your file.'
     A            DAY            3A  B 19 28DSPATR(PR)
     A                                      OVRDTA
     A            WORKED         7A  B 19 42DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-REG HOURS f2-SAT HOURS f-
     A                                      4-HOURS REF/WK f5-PREV DAY f6-NEXT -
     A                                      DAY f3-MAIN MENU ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FRI_HRS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'Divisio'
     A                                  1 15'Dept'
     A                                  1 27'Class'
     A                                  1 38'Shift'
     A                                  3 10'FI LAST NAME'
     A                                  3 30'MON  TUES WED  THUR FRI  SAT  SUN'
     A            X              2A  B  1 10DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  1 20DSPATR(PR)
     A                                      OVRDTA
     A            CL             2A  B  1 33DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B  1 44DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  4 10DSPATR(PR)
     A                                      OVRDTA
     A            ANAME         15A  B  4 13DSPATR(PR)
     A                                      OVRDTA
     A            A1             2A  B  4 31DSPATR(PR)
     A                                      OVRDTA
     A            A2             2A  B  4 36DSPATR(PR)
     A                                      OVRDTA
     A            A3             2A  B  4 41DSPATR(PR)
     A                                      OVRDTA
     A            A4             2A  B  4 46DSPATR(PR)
     A                                      OVRDTA
     A            A5             2Y 0B  4 51DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11
     AO 97 96                               DSPATR(PC)
     A            A6             2A  B  4 56DSPATR(PR)
     A                                      OVRDTA
     A            A7             2A  B  4 61DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B  6 10DSPATR(PR)
     A                                      OVRDTA
     A            BNAME         15A  B  6 13DSPATR(PR)
     A                                      OVRDTA
     A            B1             2A  B  6 31DSPATR(PR)
     A                                      OVRDTA
     A            B2             2A  B  6 36DSPATR(PR)
     A                                      OVRDTA
     A            B3             2A  B  6 41DSPATR(PR)
     A                                      OVRDTA
     A            B4             2A  B  6 46DSPATR(PR)
     A                                      OVRDTA
     A            B5             2Y 0B  6 51DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            B6             2A  B  6 56DSPATR(PR)
     A                                      OVRDTA
     A            B7             2A  B  6 61DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  8 10DSPATR(PR)
     A                                      OVRDTA
     A            CNAME         15A  B  8 13DSPATR(PR)
     A                                      OVRDTA
     A            C1             2A  B  8 31DSPATR(PR)
     A                                      OVRDTA
     A            C2             2A  B  8 36DSPATR(PR)
     A                                      OVRDTA
     A            C3             2A  B  8 41DSPATR(PR)
     A                                      OVRDTA
     A            C4             2A  B  8 46DSPATR(PR)
     A                                      OVRDTA
     A            C5             2Y 0B  8 51DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            C6             2A  B  8 56DSPATR(PR)
     A                                      OVRDTA
     A            C7             2A  B  8 61DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 10 10DSPATR(PR)
     A                                      OVRDTA
     A            DNAME         15A  B 10 13DSPATR(PR)
     A                                      OVRDTA
     A            D1             2A  B 10 31DSPATR(PR)
     A                                      OVRDTA
     A            D2             2A  B 10 36DSPATR(PR)
     A                                      OVRDTA
     A            D3             2A  B 10 41DSPATR(PR)
     A                                      OVRDTA
     A            D4             2A  B 10 46DSPATR(PR)
     A                                      OVRDTA
     A            D5             2Y 0B 10 51DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            D6             2A  B 10 56DSPATR(PR)
     A                                      OVRDTA
     A            D7             2A  B 10 61DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 12 10DSPATR(PR)
     A                                      OVRDTA
     A            ENAME         15A  B 12 13DSPATR(PR)
     A                                      OVRDTA
     A            E1             2A  B 12 31DSPATR(PR)
     A                                      OVRDTA
     A            E2             2A  B 12 36DSPATR(PR)
     A                                      OVRDTA
     A            E3             2A  B 12 41DSPATR(PR)
     A                                      OVRDTA
     A            E4             2A  B 12 46DSPATR(PR)
     A                                      OVRDTA
     A            E5             2Y 0B 12 51DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(PC)
     A            E6             2A  B 12 56DSPATR(PR)
     A                                      OVRDTA
     A            E7             2A  B 12 61DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 14 10DSPATR(PR)
     A                                      OVRDTA
     A            FNAME         15A  B 14 13DSPATR(PR)
     A                                      OVRDTA
     A            F1             2A  B 14 31DSPATR(PR)
     A                                      OVRDTA
     A            F2             2A  B 14 36DSPATR(PR)
     A                                      OVRDTA
     A            F3             2A  B 14 41DSPATR(PR)
     A                                      OVRDTA
     A            F4             2A  B 14 46DSPATR(PR)
     A                                      OVRDTA
     A            F5             2Y 0B 14 51DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  56                                  DSPATR(RI)
     A  56                                  DSPATR(PC)
     A            F6             2A  B 14 56DSPATR(PR)
     A                                      OVRDTA
     A            F7             2A  B 14 61DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 16 10DSPATR(PR)
     A                                      OVRDTA
     A            GNAME         15A  B 16 13DSPATR(PR)
     A                                      OVRDTA
     A            G1             2A  B 16 31DSPATR(PR)
     A                                      OVRDTA
     A            G2             2A  B 16 36DSPATR(PR)
     A                                      OVRDTA
     A            G3             2A  B 16 41DSPATR(PR)
     A                                      OVRDTA
     A            G4             2A  B 16 46DSPATR(PR)
     A                                      OVRDTA
     A            G5             2Y 0B 16 51DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A            G6             2A  B 16 56DSPATR(PR)
     A                                      OVRDTA
     A            G7             2A  B 16 61DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 18 10DSPATR(PR)
     A                                      OVRDTA
     A            HNAME         15A  B 18 13DSPATR(PR)
     A                                      OVRDTA
     A            H1             2A  B 18 31DSPATR(PR)
     A                                      OVRDTA
     A            H2             2A  B 18 36DSPATR(PR)
     A                                      OVRDTA
     A            H3             2A  B 18 41DSPATR(PR)
     A                                      OVRDTA
     A            H4             2A  B 18 46DSPATR(PR)
     A                                      OVRDTA
     A            H5             2Y 0B 18 51DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  74                                  DSPATR(RI)
     A  74                                  DSPATR(PC)
     A            H6             2A  B 18 56DSPATR(PR)
     A                                      OVRDTA
     A            H7             2A  B 18 61DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 20 10DSPATR(PR)
     A                                      OVRDTA
     A            INAME         15A  B 20 13DSPATR(PR)
     A                                      OVRDTA
     A            I1             2A  B 20 31DSPATR(PR)
     A                                      OVRDTA
     A            I2             2A  B 20 36DSPATR(PR)
     A                                      OVRDTA
     A            I3             2A  B 20 41DSPATR(PR)
     A                                      OVRDTA
     A            I4             2A  B 20 46DSPATR(PR)
     A                                      OVRDTA
     A            I5             2Y 0B 20 51DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  83                                  DSPATR(RI)
     A  83                                  DSPATR(PC)
     A            I6             2A  B 20 56DSPATR(PR)
     A                                      OVRDTA
     A            I7             2A  B 20 61DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FRI_MAN
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  1'Division'
     A                                  2 15'Dept'
     A                                  2 27'Class'
     A                                  2 38'Shift'
     A                                  4  1'FI LAST NAME'
     A                                  4 29'MON  TUES WED  THUR FRI  SAT  SUN'
     A                                  5 20'WORKED'
     A                                  6 20'REFUSED'
     A                                  8 20'WORKED'
     A                                  9 20'REFUSED'
     A                                 11 20'WORKED'
     A                                 12 20'REFUSED'
     A                                 14 20'WORKED'
     A                                 15 20'REFUSED'
     A                                 17 20'WORKED'
     A                                 18 20'REFUSED'
     A                                 20 20'WORKED'
     A                                 21 20'REFUSED'
     A            X              2A  B  2 10DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  2 20DSPATR(PR)
     A                                      OVRDTA
     A            CL             2A  B  2 33DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B  2 44DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            ANAME         15A  B  5  4DSPATR(PR)
     A                                      OVRDTA
     A            A1             2A  B  5 30DSPATR(PR)
     A                                      OVRDTA
     A            A2             2A  B  5 35DSPATR(PR)
     A                                      OVRDTA
     A            A3             2A  B  5 40DSPATR(PR)
     A                                      OVRDTA
     A            A4             2A  B  5 45DSPATR(PR)
     A                                      OVRDTA
     A            A5             2Y 0B  5 50DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 11                               DSPATR(RI)
     A N97 11                               DSPATR(PC)
     A            A6             2A  B  5 55DSPATR(PR)
     A                                      OVRDTA
     A            A7             2A  B  5 60DSPATR(PR)
     A                                      OVRDTA
     A            B1             2A  B  6 30DSPATR(PR)
     A                                      OVRDTA
     A            B2             2A  B  6 35DSPATR(PR)
     A                                      OVRDTA
     A            B3             2A  B  6 40DSPATR(PR)
     A                                      OVRDTA
     A            B4             2A  B  6 45DSPATR(PR)
     A                                      OVRDTA
     A            B5             2Y 0B  6 50DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 20                               DSPATR(RI)
     A N97 20                               DSPATR(PC)
     A            B6             2A  B  6 55DSPATR(PR)
     A                                      OVRDTA
     A            B7             2A  B  6 60DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            CNAME         15A  B  8  4DSPATR(PR)
     A                                      OVRDTA
     A            C1             2A  B  8 30DSPATR(PR)
     A                                      OVRDTA
     A            C2             2A  B  8 35DSPATR(PR)
     A                                      OVRDTA
     A            C3             2A  B  8 40DSPATR(PR)
     A                                      OVRDTA
     A            C4             2A  B  8 45DSPATR(PR)
     A                                      OVRDTA
     A            C5             2Y 0B  8 50DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 29                               DSPATR(RI)
     A N97 29                               DSPATR(PC)
     A            C6             2A  B  8 55DSPATR(PR)
     A                                      OVRDTA
     A            C7             2A  B  8 60DSPATR(PR)
     A                                      OVRDTA
     A            D1             2A  B  9 30DSPATR(PR)
     A                                      OVRDTA
     A            D2             2A  B  9 35DSPATR(PR)
     A                                      OVRDTA
     A            D3             2A  B  9 40DSPATR(PR)
     A                                      OVRDTA
     A            D4             2A  B  9 45DSPATR(PR)
     A                                      OVRDTA
     A            D5             2Y 0B  9 50DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 38                               DSPATR(RI)
     A N97 38                               DSPATR(PC)
     A            D6             2A  B  9 55DSPATR(PR)
     A                                      OVRDTA
     A            D7             2A  B  9 60DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            ENAME         15A  B 11  4DSPATR(PR)
     A                                      OVRDTA
     A            E1             2A  B 11 30DSPATR(PR)
     A                                      OVRDTA
     A            E2             2A  B 11 35DSPATR(PR)
     A                                      OVRDTA
     A            E3             2A  B 11 40DSPATR(PR)
     A                                      OVRDTA
     A            E4             2A  B 11 45DSPATR(PR)
     A                                      OVRDTA
     A            E5             2Y 0B 11 50DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 47                               DSPATR(RI)
     A N97 47                               DSPATR(PC)
     A            E6             2A  B 11 55DSPATR(PR)
     A                                      OVRDTA
     A            E7             2A  B 11 60DSPATR(PR)
     A                                      OVRDTA
     A            F1             2A  B 12 30DSPATR(PR)
     A                                      OVRDTA
     A            F2             2A  B 12 35DSPATR(PR)
     A                                      OVRDTA
     A            F3             2A  B 12 40DSPATR(PR)
     A                                      OVRDTA
     A            F4             2A  B 12 45DSPATR(PR)
     A                                      OVRDTA
     A            F5             2Y 0B 12 50DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 56                               DSPATR(RI)
     A N97 56                               DSPATR(PC)
     A            F6             2A  B 12 55DSPATR(PR)
     A                                      OVRDTA
     A            F7             2A  B 12 60DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            GNAME         15A  B 14  4DSPATR(PR)
     A                                      OVRDTA
     A            G1             2A  B 14 30DSPATR(PR)
     A                                      OVRDTA
     A            G2             2A  B 14 35DSPATR(PR)
     A                                      OVRDTA
     A            G3             2A  B 14 40DSPATR(PR)
     A                                      OVRDTA
     A            G4             2A  B 14 45DSPATR(PR)
     A                                      OVRDTA
     A            G5             2Y 0B 14 50DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 65                               DSPATR(RI)
     A N97 65                               DSPATR(PC)
     A            G6             2A  B 14 55DSPATR(PR)
     A                                      OVRDTA
     A            G7             2A  B 14 60DSPATR(PR)
     A                                      OVRDTA
     A            H1             2A  B 15 30DSPATR(PR)
     A                                      OVRDTA
     A            H2             2A  B 15 35DSPATR(PR)
     A                                      OVRDTA
     A            H3             2A  B 15 40DSPATR(PR)
     A                                      OVRDTA
     A            H4             2A  B 15 45DSPATR(PR)
     A                                      OVRDTA
     A            H5             2Y 0B 15 50DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 74                               DSPATR(RI)
     A N97 74                               DSPATR(PC)
     A            H6             2A  B 15 55DSPATR(PR)
     A                                      OVRDTA
     A            H7             2A  B 15 60DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            INAME         15A  B 17  4DSPATR(PR)
     A                                      OVRDTA
     A            I1             2A  B 17 30DSPATR(PR)
     A                                      OVRDTA
     A            I2             2A  B 17 35DSPATR(PR)
     A                                      OVRDTA
     A            I3             2A  B 17 40DSPATR(PR)
     A                                      OVRDTA
     A            I4             2A  B 17 45DSPATR(PR)
     A                                      OVRDTA
     A            I5             2Y 0B 17 50DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 83                               DSPATR(RI)
     A N97 83                               DSPATR(PC)
     A            I6             2A  B 17 55DSPATR(PR)
     A                                      OVRDTA
     A            I7             2A  B 17 60DSPATR(PR)
     A                                      OVRDTA
     A            J1             2A  B 18 30DSPATR(PR)
     A                                      OVRDTA
     A            J2             2A  B 18 35DSPATR(PR)
     A                                      OVRDTA
     A            J3             2A  B 18 40DSPATR(PR)
     A                                      OVRDTA
     A            J4             2A  B 18 45DSPATR(PR)
     A                                      OVRDTA
     A            J5             2Y 0B 18 50DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 92                               DSPATR(RI)
     A N97 92                               DSPATR(PC)
     A            J6             2A  B 18 55DSPATR(PR)
     A                                      OVRDTA
     A            J7             2A  B 18 60DSPATR(PR)
     A                                      OVRDTA
     A            K              1A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            KNAME         15A  B 20  4DSPATR(PR)
     A                                      OVRDTA
     A            K1             2A  B 20 30DSPATR(PR)
     A                                      OVRDTA
     A            K2             2A  B 20 35DSPATR(PR)
     A                                      OVRDTA
     A            K3             2A  B 20 40DSPATR(PR)
     A                                      OVRDTA
     A            K4             2A  B 20 45DSPATR(PR)
     A                                      OVRDTA
     A            K5             2Y 0B 20 50DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 05                               DSPATR(RI)
     A  97 05                               DSPATR(PC)
     A            K6             2A  B 20 55DSPATR(PR)
     A                                      OVRDTA
     A            K7             2A  B 20 60DSPATR(PR)
     A                                      OVRDTA
     A            L1             2A  B 21 30DSPATR(PR)
     A                                      OVRDTA
     A            L2             2A  B 21 35DSPATR(PR)
     A                                      OVRDTA
     A            L3             2A  B 21 40DSPATR(PR)
     A                                      OVRDTA
     A            L4             2A  B 21 45DSPATR(PR)
     A                                      OVRDTA
     A            L5             2Y 0B 21 50DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 14                               DSPATR(RI)
     A  97 14                               DSPATR(PC)
     A            L6             2A  B 21 55DSPATR(PR)
     A                                      OVRDTA
     A            L7             2A  B 21 60DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R MAIN_MENU
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  1'DATE'
     A                                  4 25'G O O D Y E A R   T O P E K A'
     A                                  6 24'B A L A N C E   O F   H O U R S'
     A                                  8 31'for DIVISION '
     A            DATE           8A  B  2  6DSPATR(PR)
     A                                      OVRDTA
     A            A              2A  B  8 45DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-EMPLOYEE RECORDS f2-VOL.-
     A                                       STATUS f8-ENTER HOURS f5-VIEW HOUR-
     A                                      S f6-OFFER WK BY ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R MGMT_MENU
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'f1 - Will reset all weekly hours f-
     A                                      or the division back to zero.  You'
     A                                  2 11'must have had a division printout'
     A                                  2 45'since the last file update'
     A                                  3 11'or the file will not reset.'
     A                                  5  1'f2 - Will reset total hours back t-
     A                                      o zero.  (This affects total hours'
     A                                  5 70'only.)'
     A                                  6 11'However, this function is only all-
     A                                      owed at the end of the year.'
     A                                  8  1'f8 - To change or set a weekending'
     A                                  8 36'date.'
     A                                 10  1'f4 - To enter the routine to set c-
     A                                      ollating values for departments and-
     A                                      .'
     A                                 11 12'classifications.  This allows you'
     A                                 11 46'to alter the sequence in which'
     A                                 12 12'the departments and classification-
     A                                      s are presented.'
     A                                 14  1'f5 - Displays a menu to select var-
     A                                      ious print options.'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RESET WEEK HRS f2-RESET -
     A                                      TTL HRS f8-SET DATE WEEKENDS f4-SET-
     A                                       COLLATE f3-MAIN ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R MH_PARENT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  1'Division'
     A                                  2 15'Dept'
     A                                  2 27'Class'
     A                                  2 38'Shift'
     A                                  4  1'FI LAST NAME'
     A                                  4 29'MON  TUES WED  THUR FRI  SAT  SUN'
     A                                  5 20'WORKED'
     A                                  6 20'REFUSED'
     A                                  8 20'WORKED'
     A                                  9 20'REFUSED'
     A                                 11 20'WORKED'
     A                                 12 20'REFUSED'
     A                                 14 20'WORKED'
     A                                 15 20'REFUSED'
     A                                 17 20'WORKED'
     A                                 18 20'REFUSED'
     A                                 20 20'WORKED'
     A                                 21 20'REFUSED'
     A            X              2A  B  2 10DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  2 20DSPATR(PR)
     A                                      OVRDTA
     A            CL             2A  B  2 33DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B  2 44DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            ANAME         15A  B  5  4DSPATR(PR)
     A                                      OVRDTA
     A            A1             2A  B  5 30DSPATR(PR)
     A                                      OVRDTA
     A            A2             2A  B  5 35DSPATR(PR)
     A                                      OVRDTA
     A            A3             2A  B  5 40DSPATR(PR)
     A                                      OVRDTA
     A            A4             2A  B  5 45DSPATR(PR)
     A                                      OVRDTA
     A            A5             2A  B  5 50DSPATR(PR)
     A                                      OVRDTA
     A            A6             2A  B  5 55DSPATR(PR)
     A                                      OVRDTA
     A            A7             2A  B  5 60DSPATR(PR)
     A                                      OVRDTA
     A            B1             2A  B  6 30DSPATR(PR)
     A                                      OVRDTA
     A            B2             2A  B  6 35DSPATR(PR)
     A                                      OVRDTA
     A            B3             2A  B  6 40DSPATR(PR)
     A                                      OVRDTA
     A            B4             2A  B  6 45DSPATR(PR)
     A                                      OVRDTA
     A            B5             2A  B  6 50DSPATR(PR)
     A                                      OVRDTA
     A            B6             2A  B  6 55DSPATR(PR)
     A                                      OVRDTA
     A            B7             2A  B  6 60DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            CNAME         15A  B  8  4DSPATR(PR)
     A                                      OVRDTA
     A            C1             2A  B  8 30DSPATR(PR)
     A                                      OVRDTA
     A            C2             2A  B  8 35DSPATR(PR)
     A                                      OVRDTA
     A            C3             2A  B  8 40DSPATR(PR)
     A                                      OVRDTA
     A            C4             2A  B  8 45DSPATR(PR)
     A                                      OVRDTA
     A            C5             2A  B  8 50DSPATR(PR)
     A                                      OVRDTA
     A            C6             2A  B  8 55DSPATR(PR)
     A                                      OVRDTA
     A            C7             2A  B  8 60DSPATR(PR)
     A                                      OVRDTA
     A            D1             2A  B  9 30DSPATR(PR)
     A                                      OVRDTA
     A            D2             2A  B  9 35DSPATR(PR)
     A                                      OVRDTA
     A            D3             2A  B  9 40DSPATR(PR)
     A                                      OVRDTA
     A            D4             2A  B  9 45DSPATR(PR)
     A                                      OVRDTA
     A            D5             2A  B  9 50DSPATR(PR)
     A                                      OVRDTA
     A            D6             2A  B  9 55DSPATR(PR)
     A                                      OVRDTA
     A            D7             2A  B  9 60DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            ENAME         15A  B 11  4DSPATR(PR)
     A                                      OVRDTA
     A            E1             2A  B 11 30DSPATR(PR)
     A                                      OVRDTA
     A            E2             2A  B 11 35DSPATR(PR)
     A                                      OVRDTA
     A            E3             2A  B 11 40DSPATR(PR)
     A                                      OVRDTA
     A            E4             2A  B 11 45DSPATR(PR)
     A                                      OVRDTA
     A            E5             2A  B 11 50DSPATR(PR)
     A                                      OVRDTA
     A            E6             2A  B 11 55DSPATR(PR)
     A                                      OVRDTA
     A            E7             2A  B 11 60DSPATR(PR)
     A                                      OVRDTA
     A            F1             2A  B 12 30DSPATR(PR)
     A                                      OVRDTA
     A            F2             2A  B 12 35DSPATR(PR)
     A                                      OVRDTA
     A            F3             2A  B 12 40DSPATR(PR)
     A                                      OVRDTA
     A            F4             2A  B 12 45DSPATR(PR)
     A                                      OVRDTA
     A            F5             2A  B 12 50DSPATR(PR)
     A                                      OVRDTA
     A            F6             2A  B 12 55DSPATR(PR)
     A                                      OVRDTA
     A            F7             2A  B 12 60DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            GNAME         15A  B 14  4DSPATR(PR)
     A                                      OVRDTA
     A            G1             2A  B 14 30DSPATR(PR)
     A                                      OVRDTA
     A            G2             2A  B 14 35DSPATR(PR)
     A                                      OVRDTA
     A            G3             2A  B 14 40DSPATR(PR)
     A                                      OVRDTA
     A            G4             2A  B 14 45DSPATR(PR)
     A                                      OVRDTA
     A            G5             2A  B 14 50DSPATR(PR)
     A                                      OVRDTA
     A            G6             2A  B 14 55DSPATR(PR)
     A                                      OVRDTA
     A            G7             2A  B 14 60DSPATR(PR)
     A                                      OVRDTA
     A            H1             2A  B 15 30DSPATR(PR)
     A                                      OVRDTA
     A            H2             2A  B 15 35DSPATR(PR)
     A                                      OVRDTA
     A            H3             2A  B 15 40DSPATR(PR)
     A                                      OVRDTA
     A            H4             2A  B 15 45DSPATR(PR)
     A                                      OVRDTA
     A            H5             2A  B 15 50DSPATR(PR)
     A                                      OVRDTA
     A            H6             2A  B 15 55DSPATR(PR)
     A                                      OVRDTA
     A            H7             2A  B 15 60DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            INAME         15A  B 17  4DSPATR(PR)
     A                                      OVRDTA
     A            I1             2A  B 17 30DSPATR(PR)
     A                                      OVRDTA
     A            I2             2A  B 17 35DSPATR(PR)
     A                                      OVRDTA
     A            I3             2A  B 17 40DSPATR(PR)
     A                                      OVRDTA
     A            I4             2A  B 17 45DSPATR(PR)
     A                                      OVRDTA
     A            I5             2A  B 17 50DSPATR(PR)
     A                                      OVRDTA
     A            I6             2A  B 17 55DSPATR(PR)
     A                                      OVRDTA
     A            I7             2A  B 17 60DSPATR(PR)
     A                                      OVRDTA
     A            J1             2A  B 18 30DSPATR(PR)
     A                                      OVRDTA
     A            J2             2A  B 18 35DSPATR(PR)
     A                                      OVRDTA
     A            J3             2A  B 18 40DSPATR(PR)
     A                                      OVRDTA
     A            J4             2A  B 18 45DSPATR(PR)
     A                                      OVRDTA
     A            J5             2A  B 18 50DSPATR(PR)
     A                                      OVRDTA
     A            J6             2A  B 18 55DSPATR(PR)
     A                                      OVRDTA
     A            J7             2A  B 18 60DSPATR(PR)
     A                                      OVRDTA
     A            K              1A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            KNAME         15A  B 20  4DSPATR(PR)
     A                                      OVRDTA
     A            K1             2A  B 20 30DSPATR(PR)
     A                                      OVRDTA
     A            K2             2A  B 20 35DSPATR(PR)
     A                                      OVRDTA
     A            K3             2A  B 20 40DSPATR(PR)
     A                                      OVRDTA
     A            K4             2A  B 20 45DSPATR(PR)
     A                                      OVRDTA
     A            K5             2A  B 20 50DSPATR(PR)
     A                                      OVRDTA
     A            K6             2A  B 20 55DSPATR(PR)
     A                                      OVRDTA
     A            K7             2A  B 20 60DSPATR(PR)
     A                                      OVRDTA
     A            L1             2A  B 21 30DSPATR(PR)
     A                                      OVRDTA
     A            L2             2A  B 21 35DSPATR(PR)
     A                                      OVRDTA
     A            L3             2A  B 21 40DSPATR(PR)
     A                                      OVRDTA
     A            L4             2A  B 21 45DSPATR(PR)
     A                                      OVRDTA
     A            L5             2A  B 21 50DSPATR(PR)
     A                                      OVRDTA
     A            L6             2A  B 21 55DSPATR(PR)
     A                                      OVRDTA
     A            L7             2A  B 21 60DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R MON_HRS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'Divisio'
     A                                  1 15'Dept'
     A                                  1 27'Class'
     A                                  1 38'Shift'
     A                                  3 10'FI LAST NAME'
     A                                  3 30'MON  TUES WED  THUR FRI  SAT  SUN'
     A            X              2A  B  1 10DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  1 20DSPATR(PR)
     A                                      OVRDTA
     A            CL             2A  B  1 33DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B  1 44DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  4 10DSPATR(PR)
     A                                      OVRDTA
     A            ANAME         15A  B  4 13DSPATR(PR)
     A                                      OVRDTA
     A            A1             2Y 0B  4 31DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07
     AO 97 96                               DSPATR(PC)
     A            A2             2A  B  4 36DSPATR(PR)
     A                                      OVRDTA
     A            A3             2A  B  4 41DSPATR(PR)
     A                                      OVRDTA
     A            A4             2A  B  4 46DSPATR(PR)
     A                                      OVRDTA
     A            A5             2A  B  4 51DSPATR(PR)
     A                                      OVRDTA
     A            A6             2A  B  4 56DSPATR(PR)
     A                                      OVRDTA
     A            A7             2A  B  4 61DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B  6 10DSPATR(PR)
     A                                      OVRDTA
     A            BNAME         15A  B  6 13DSPATR(PR)
     A                                      OVRDTA
     A            B1             2Y 0B  6 31DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            B2             2A  B  6 36DSPATR(PR)
     A                                      OVRDTA
     A            B3             2A  B  6 41DSPATR(PR)
     A                                      OVRDTA
     A            B4             2A  B  6 46DSPATR(PR)
     A                                      OVRDTA
     A            B5             2A  B  6 51DSPATR(PR)
     A                                      OVRDTA
     A            B6             2A  B  6 56DSPATR(PR)
     A                                      OVRDTA
     A            B7             2A  B  6 61DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  8 10DSPATR(PR)
     A                                      OVRDTA
     A            CNAME         15A  B  8 13DSPATR(PR)
     A                                      OVRDTA
     A            C1             2Y 0B  8 31DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            C2             2A  B  8 36DSPATR(PR)
     A                                      OVRDTA
     A            C3             2A  B  8 41DSPATR(PR)
     A                                      OVRDTA
     A            C4             2A  B  8 46DSPATR(PR)
     A                                      OVRDTA
     A            C5             2A  B  8 51DSPATR(PR)
     A                                      OVRDTA
     A            C6             2A  B  8 56DSPATR(PR)
     A                                      OVRDTA
     A            C7             2A  B  8 61DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 10 10DSPATR(PR)
     A                                      OVRDTA
     A            DNAME         15A  B 10 13DSPATR(PR)
     A                                      OVRDTA
     A            D1             2Y 0B 10 31DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            D2             2A  B 10 36DSPATR(PR)
     A                                      OVRDTA
     A            D3             2A  B 10 41DSPATR(PR)
     A                                      OVRDTA
     A            D4             2A  B 10 46DSPATR(PR)
     A                                      OVRDTA
     A            D5             2A  B 10 51DSPATR(PR)
     A                                      OVRDTA
     A            D6             2A  B 10 56DSPATR(PR)
     A                                      OVRDTA
     A            D7             2A  B 10 61DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 12 10DSPATR(PR)
     A                                      OVRDTA
     A            ENAME         15A  B 12 13DSPATR(PR)
     A                                      OVRDTA
     A            E1             2Y 0B 12 31DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A            E2             2A  B 12 36DSPATR(PR)
     A                                      OVRDTA
     A            E3             2A  B 12 41DSPATR(PR)
     A                                      OVRDTA
     A            E4             2A  B 12 46DSPATR(PR)
     A                                      OVRDTA
     A            E5             2A  B 12 51DSPATR(PR)
     A                                      OVRDTA
     A            E6             2A  B 12 56DSPATR(PR)
     A                                      OVRDTA
     A            E7             2A  B 12 61DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 14 10DSPATR(PR)
     A                                      OVRDTA
     A            FNAME         15A  B 14 13DSPATR(PR)
     A                                      OVRDTA
     A            F1             2Y 0B 14 31DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A            F2             2A  B 14 36DSPATR(PR)
     A                                      OVRDTA
     A            F3             2A  B 14 41DSPATR(PR)
     A                                      OVRDTA
     A            F4             2A  B 14 46DSPATR(PR)
     A                                      OVRDTA
     A            F5             2A  B 14 51DSPATR(PR)
     A                                      OVRDTA
     A            F6             2A  B 14 56DSPATR(PR)
     A                                      OVRDTA
     A            F7             2A  B 14 61DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 16 10DSPATR(PR)
     A                                      OVRDTA
     A            GNAME         15A  B 16 13DSPATR(PR)
     A                                      OVRDTA
     A            G1             2Y 0B 16 31DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            G2             2A  B 16 36DSPATR(PR)
     A                                      OVRDTA
     A            G3             2A  B 16 41DSPATR(PR)
     A                                      OVRDTA
     A            G4             2A  B 16 46DSPATR(PR)
     A                                      OVRDTA
     A            G5             2A  B 16 51DSPATR(PR)
     A                                      OVRDTA
     A            G6             2A  B 16 56DSPATR(PR)
     A                                      OVRDTA
     A            G7             2A  B 16 61DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 18 10DSPATR(PR)
     A                                      OVRDTA
     A            HNAME         15A  B 18 13DSPATR(PR)
     A                                      OVRDTA
     A            H1             2Y 0B 18 31DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  70                                  DSPATR(RI)
     A  70                                  DSPATR(PC)
     A            H2             2A  B 18 36DSPATR(PR)
     A                                      OVRDTA
     A            H3             2A  B 18 41DSPATR(PR)
     A                                      OVRDTA
     A            H4             2A  B 18 46DSPATR(PR)
     A                                      OVRDTA
     A            H5             2A  B 18 51DSPATR(PR)
     A                                      OVRDTA
     A            H6             2A  B 18 56DSPATR(PR)
     A                                      OVRDTA
     A            H7             2A  B 18 61DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 20 10DSPATR(PR)
     A                                      OVRDTA
     A            INAME         15A  B 20 13DSPATR(PR)
     A                                      OVRDTA
     A            I1             2Y 0B 20 31DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  79                                  DSPATR(RI)
     A  79                                  DSPATR(PC)
     A            I2             2A  B 20 36DSPATR(PR)
     A                                      OVRDTA
     A            I3             2A  B 20 41DSPATR(PR)
     A                                      OVRDTA
     A            I4             2A  B 20 46DSPATR(PR)
     A                                      OVRDTA
     A            I5             2A  B 20 51DSPATR(PR)
     A                                      OVRDTA
     A            I6             2A  B 20 56DSPATR(PR)
     A                                      OVRDTA
     A            I7             2A  B 20 61DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R MON_MAN
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  1'Division'
     A                                  2 15'Dept'
     A                                  2 27'Class'
     A                                  2 38'Shift'
     A                                  4  1'FI LAST NAME'
     A                                  4 29'MON  TUES WED  THUR FRI  SAT  SUN'
     A                                  5 20'WORKED'
     A                                  6 20'REFUSED'
     A                                  8 20'WORKED'
     A                                  9 20'REFUSED'
     A                                 11 20'WORKED'
     A                                 12 20'REFUSED'
     A                                 14 20'WORKED'
     A                                 15 20'REFUSED'
     A                                 17 20'WORKED'
     A                                 18 20'REFUSED'
     A                                 20 20'WORKED'
     A                                 21 20'REFUSED'
     A            X              2A  B  2 10DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  2 20DSPATR(PR)
     A                                      OVRDTA
     A            CL             2A  B  2 33DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B  2 44DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            ANAME         15A  B  5  4DSPATR(PR)
     A                                      OVRDTA
     A            A1             2Y 0B  5 30DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 07                               DSPATR(RI)
     A N97 07                               DSPATR(PC)
     A            A2             2A  B  5 35DSPATR(PR)
     A                                      OVRDTA
     A            A3             2A  B  5 40DSPATR(PR)
     A                                      OVRDTA
     A            A4             2A  B  5 45DSPATR(PR)
     A                                      OVRDTA
     A            A5             2A  B  5 50DSPATR(PR)
     A                                      OVRDTA
     A            A6             2A  B  5 55DSPATR(PR)
     A                                      OVRDTA
     A            A7             2A  B  5 60DSPATR(PR)
     A                                      OVRDTA
     A            B1             2Y 0B  6 30DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 16                               DSPATR(RI)
     A N97 16                               DSPATR(PC)
     A            B2             2A  B  6 35DSPATR(PR)
     A                                      OVRDTA
     A            B3             2A  B  6 40DSPATR(PR)
     A                                      OVRDTA
     A            B4             2A  B  6 45DSPATR(PR)
     A                                      OVRDTA
     A            B5             2A  B  6 50DSPATR(PR)
     A                                      OVRDTA
     A            B6             2A  B  6 55DSPATR(PR)
     A                                      OVRDTA
     A            B7             2A  B  6 60DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            CNAME         15A  B  8  4DSPATR(PR)
     A                                      OVRDTA
     A            C1             2Y 0B  8 30DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 25                               DSPATR(RI)
     A N97 25                               DSPATR(PC)
     A            C2             2A  B  8 35DSPATR(PR)
     A                                      OVRDTA
     A            C3             2A  B  8 40DSPATR(PR)
     A                                      OVRDTA
     A            C4             2A  B  8 45DSPATR(PR)
     A                                      OVRDTA
     A            C5             2A  B  8 50DSPATR(PR)
     A                                      OVRDTA
     A            C6             2A  B  8 55DSPATR(PR)
     A                                      OVRDTA
     A            C7             2A  B  8 60DSPATR(PR)
     A                                      OVRDTA
     A            D1             2Y 0B  9 30DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 34                               DSPATR(RI)
     A N97 34                               DSPATR(PC)
     A            D2             2A  B  9 35DSPATR(PR)
     A                                      OVRDTA
     A            D3             2A  B  9 40DSPATR(PR)
     A                                      OVRDTA
     A            D4             2A  B  9 45DSPATR(PR)
     A                                      OVRDTA
     A            D5             2A  B  9 50DSPATR(PR)
     A                                      OVRDTA
     A            D6             2A  B  9 55DSPATR(PR)
     A                                      OVRDTA
     A            D7             2A  B  9 60DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            ENAME         15A  B 11  4DSPATR(PR)
     A                                      OVRDTA
     A            E1             2Y 0B 11 30DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 43                               DSPATR(RI)
     A N97 43                               DSPATR(PC)
     A            E2             2A  B 11 35DSPATR(PR)
     A                                      OVRDTA
     A            E3             2A  B 11 40DSPATR(PR)
     A                                      OVRDTA
     A            E4             2A  B 11 45DSPATR(PR)
     A                                      OVRDTA
     A            E5             2A  B 11 50DSPATR(PR)
     A                                      OVRDTA
     A            E6             2A  B 11 55DSPATR(PR)
     A                                      OVRDTA
     A            E7             2A  B 11 60DSPATR(PR)
     A                                      OVRDTA
     A            F1             2Y 0B 12 30DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 52                               DSPATR(RI)
     A N97 52                               DSPATR(PC)
     A            F2             2A  B 12 35DSPATR(PR)
     A                                      OVRDTA
     A            F3             2A  B 12 40DSPATR(PR)
     A                                      OVRDTA
     A            F4             2A  B 12 45DSPATR(PR)
     A                                      OVRDTA
     A            F5             2A  B 12 50DSPATR(PR)
     A                                      OVRDTA
     A            F6             2A  B 12 55DSPATR(PR)
     A                                      OVRDTA
     A            F7             2A  B 12 60DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            GNAME         15A  B 14  4DSPATR(PR)
     A                                      OVRDTA
     A            G1             2Y 0B 14 30DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 61                               DSPATR(RI)
     A N97 61                               DSPATR(PC)
     A            G2             2A  B 14 35DSPATR(PR)
     A                                      OVRDTA
     A            G3             2A  B 14 40DSPATR(PR)
     A                                      OVRDTA
     A            G4             2A  B 14 45DSPATR(PR)
     A                                      OVRDTA
     A            G5             2A  B 14 50DSPATR(PR)
     A                                      OVRDTA
     A            G6             2A  B 14 55DSPATR(PR)
     A                                      OVRDTA
     A            G7             2A  B 14 60DSPATR(PR)
     A                                      OVRDTA
     A            H1             2Y 0B 15 30DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 70                               DSPATR(RI)
     A N97 70                               DSPATR(PC)
     A            H2             2A  B 15 35DSPATR(PR)
     A                                      OVRDTA
     A            H3             2A  B 15 40DSPATR(PR)
     A                                      OVRDTA
     A            H4             2A  B 15 45DSPATR(PR)
     A                                      OVRDTA
     A            H5             2A  B 15 50DSPATR(PR)
     A                                      OVRDTA
     A            H6             2A  B 15 55DSPATR(PR)
     A                                      OVRDTA
     A            H7             2A  B 15 60DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            INAME         15A  B 17  4DSPATR(PR)
     A                                      OVRDTA
     A            I1             2Y 0B 17 30DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 79                               DSPATR(RI)
     A N97 79                               DSPATR(PC)
     A            I2             2A  B 17 35DSPATR(PR)
     A                                      OVRDTA
     A            I3             2A  B 17 40DSPATR(PR)
     A                                      OVRDTA
     A            I4             2A  B 17 45DSPATR(PR)
     A                                      OVRDTA
     A            I5             2A  B 17 50DSPATR(PR)
     A                                      OVRDTA
     A            I6             2A  B 17 55DSPATR(PR)
     A                                      OVRDTA
     A            I7             2A  B 17 60DSPATR(PR)
     A                                      OVRDTA
     A            J1             2Y 0B 18 30DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 88                               DSPATR(RI)
     A N97 88                               DSPATR(PC)
     A            J2             2A  B 18 35DSPATR(PR)
     A                                      OVRDTA
     A            J3             2A  B 18 40DSPATR(PR)
     A                                      OVRDTA
     A            J4             2A  B 18 45DSPATR(PR)
     A                                      OVRDTA
     A            J5             2A  B 18 50DSPATR(PR)
     A                                      OVRDTA
     A            J6             2A  B 18 55DSPATR(PR)
     A                                      OVRDTA
     A            J7             2A  B 18 60DSPATR(PR)
     A                                      OVRDTA
     A            K              1A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            KNAME         15A  B 20  4DSPATR(PR)
     A                                      OVRDTA
     A            K1             2Y 0B 20 30DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 01                               DSPATR(RI)
     A  97 01                               DSPATR(PC)
     A            K2             2A  B 20 35DSPATR(PR)
     A                                      OVRDTA
     A            K3             2A  B 20 40DSPATR(PR)
     A                                      OVRDTA
     A            K4             2A  B 20 45DSPATR(PR)
     A                                      OVRDTA
     A            K5             2A  B 20 50DSPATR(PR)
     A                                      OVRDTA
     A            K6             2A  B 20 55DSPATR(PR)
     A                                      OVRDTA
     A            K7             2A  B 20 60DSPATR(PR)
     A                                      OVRDTA
     A            L1             2Y 0B 21 30DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 10                               DSPATR(RI)
     A  97 10                               DSPATR(PC)
     A            L2             2A  B 21 35DSPATR(PR)
     A                                      OVRDTA
     A            L3             2A  B 21 40DSPATR(PR)
     A                                      OVRDTA
     A            L4             2A  B 21 45DSPATR(PR)
     A                                      OVRDTA
     A            L5             2A  B 21 50DSPATR(PR)
     A                                      OVRDTA
     A            L6             2A  B 21 55DSPATR(PR)
     A                                      OVRDTA
     A            L7             2A  B 21 60DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R OFFER_WORK
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 35'OFFER WORK'
     A                                  2 25'BY LOW HOURS - HIGH SENORITY'
     A                                  5  1'Use f1 to select the type of work'
     A                                  5 35'to be offered (ie; Regular Hours,'
     A                                  5 69'Daily'
     A                                  6  1'OverTime, Saturday Work, Sunday Wo-
     A                                      rk or Holiday Work).'
     A                                  8  1'Enter the Department, Classificati-
     A                                      on and Shift.  Press f6 to view the-
     A                                       records'
     A                                  9  1'on the screen or press f5 to print'
     A                                  9 36'the records.'
     A                                 11  1'Enter just the Department number a-
     A                                      nd press f8 to print all the workgr-
     A                                      oups'
     A                                 12  1'within one department.'
     A                                 14  1'Use f4 to print the entire divisio-
     A                                      n by workgroups for the type of wor-
     A                                      k'
     A                                 15  1'indicated.'
     A                                 17 27'Type of work to be offered:'
     A                                 21 23'Dept.'
     A                                 21 37'Class.'
     A                                 21 49'Shift'
     A            TYPE           5A  B 19 37DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4Y 0B 21 29DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02
     AO 97 96                               DSPATR(PC)
     A            CL             2Y 0B 21 44DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            S              1A  B 21 55DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-TOGGLE TYPE f8-PRINT DEP-
     A                                      T f4-PRINT DIV f6-VIEW GROUP f3-MAI-
     A                                      N MENU           ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R OFFERWOR2
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 33'OFFER'
     A                                  1 45'WORK'
     A                                  2 18'To employees in the order as liste-
     A                                      d below.'
     A                                  4 25'Dept.'
     A                                  4 37'Class.'
     A                                  4 48'Shift'
     A                                  6  4'VOL   TOTAL'
     A                                  6 24'SENORITY   SSN'
     A                                  6 49'NAME'
     A                                  7 13'HRS'
     A                                  7 26'DATE'
     A            TYP            5A  B  1 39DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  4 31DSPATR(PR)
     A                                      OVRDTA
     A            CL             2A  B  4 44DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B  4 54DSPATR(PR)
     A                                      OVRDTA
     A            TPE            5A  B  6 16DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  8  5DSPATR(PR)
     A                                      OVRDTA
     A            HRS1           4A  B  8 13DSPATR(PR)
     A                                      OVRDTA
     A            DATE1          9A  B  8 24DSPATR(PR)
     A                                      OVRDTA
     A            SSN1          11A  B  8 35DSPATR(PR)
     A                                      OVRDTA
     A            NAME1         20A  B  8 49DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B  9  5DSPATR(PR)
     A                                      OVRDTA
     A            HRS2           4A  B  9 13DSPATR(PR)
     A                                      OVRDTA
     A            DATE2          9A  B  9 24DSPATR(PR)
     A                                      OVRDTA
     A            SSN2          11A  B  9 35DSPATR(PR)
     A                                      OVRDTA
     A            NAME2         20A  B  9 49DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 10  5DSPATR(PR)
     A                                      OVRDTA
     A            HRS3           4A  B 10 13DSPATR(PR)
     A                                      OVRDTA
     A            DATE3          9A  B 10 24DSPATR(PR)
     A                                      OVRDTA
     A            SSN3          11A  B 10 35DSPATR(PR)
     A                                      OVRDTA
     A            NAME3         20A  B 10 49DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 11  5DSPATR(PR)
     A                                      OVRDTA
     A            HRS4           4A  B 11 13DSPATR(PR)
     A                                      OVRDTA
     A            DATE4          9A  B 11 24DSPATR(PR)
     A                                      OVRDTA
     A            SSN4          11A  B 11 35DSPATR(PR)
     A                                      OVRDTA
     A            NAME4         20A  B 11 49DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 12  5DSPATR(PR)
     A                                      OVRDTA
     A            HRS5           4A  B 12 13DSPATR(PR)
     A                                      OVRDTA
     A            DATE5          9A  B 12 24DSPATR(PR)
     A                                      OVRDTA
     A            SSN5          11A  B 12 35DSPATR(PR)
     A                                      OVRDTA
     A            NAME5         20A  B 12 49DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 13  5DSPATR(PR)
     A                                      OVRDTA
     A            HRS6           4A  B 13 13DSPATR(PR)
     A                                      OVRDTA
     A            DATE6          9A  B 13 24DSPATR(PR)
     A                                      OVRDTA
     A            SSN6          11A  B 13 35DSPATR(PR)
     A                                      OVRDTA
     A            NAME6         20A  B 13 49DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 14  5DSPATR(PR)
     A                                      OVRDTA
     A            HRS7           4A  B 14 13DSPATR(PR)
     A                                      OVRDTA
     A            DATE7          9A  B 14 24DSPATR(PR)
     A                                      OVRDTA
     A            SSN7          11A  B 14 35DSPATR(PR)
     A                                      OVRDTA
     A            NAME7         20A  B 14 49DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 15  5DSPATR(PR)
     A                                      OVRDTA
     A            HRS8           4A  B 15 13DSPATR(PR)
     A                                      OVRDTA
     A            DATE8          9A  B 15 24DSPATR(PR)
     A                                      OVRDTA
     A            SSN8          11A  B 15 35DSPATR(PR)
     A                                      OVRDTA
     A            NAME8         20A  B 15 49DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 16  5DSPATR(PR)
     A                                      OVRDTA
     A            HRS9           4A  B 16 13DSPATR(PR)
     A                                      OVRDTA
     A            DATE9          9A  B 16 24DSPATR(PR)
     A                                      OVRDTA
     A            SSN9          11A  B 16 35DSPATR(PR)
     A                                      OVRDTA
     A            NAME9         20A  B 16 49DSPATR(PR)
     A                                      OVRDTA
     A            J              1A  B 17  5DSPATR(PR)
     A                                      OVRDTA
     A            HR10           4A  B 17 13DSPATR(PR)
     A                                      OVRDTA
     A            DATE10         9A  B 17 24DSPATR(PR)
     A                                      OVRDTA
     A            SSN10         11A  B 17 35DSPATR(PR)
     A                                      OVRDTA
     A            NAME10        20A  B 17 49DSPATR(PR)
     A                                      OVRDTA
     A            K              1A  B 18  5DSPATR(PR)
     A                                      OVRDTA
     A            HR11           4A  B 18 13DSPATR(PR)
     A                                      OVRDTA
     A            DATE11         9A  B 18 24DSPATR(PR)
     A                                      OVRDTA
     A            SSN11         11A  B 18 35DSPATR(PR)
     A                                      OVRDTA
     A            NAME11        20A  B 18 49DSPATR(PR)
     A                                      OVRDTA
     A            L              1A  B 19  5DSPATR(PR)
     A                                      OVRDTA
     A            HR12           4A  B 19 13DSPATR(PR)
     A                                      OVRDTA
     A            DATE12         9A  B 19 24DSPATR(PR)
     A                                      OVRDTA
     A            SSN12         11A  B 19 35DSPATR(PR)
     A                                      OVRDTA
     A            NAME12        20A  B 19 49DSPATR(PR)
     A                                      OVRDTA
     A            M              1A  B 20  5DSPATR(PR)
     A                                      OVRDTA
     A            HR13           4A  B 20 13DSPATR(PR)
     A                                      OVRDTA
     A            DATE13         9A  B 20 24DSPATR(PR)
     A                                      OVRDTA
     A            SSN13         11A  B 20 35DSPATR(PR)
     A                                      OVRDTA
     A            NAME13        20A  B 20 49DSPATR(PR)
     A                                      OVRDTA
     A            N              1A  B 21  5DSPATR(PR)
     A                                      OVRDTA
     A            HR14           4A  B 21 13DSPATR(PR)
     A                                      OVRDTA
     A            DATE14         9A  B 21 24DSPATR(PR)
     A                                      OVRDTA
     A            SSN14         11A  B 21 35DSPATR(PR)
     A                                      OVRDTA
     A            NAME14        20A  B 21 49DSPATR(PR)
     A                                      OVRDTA
     A            O              1A  B 22  5DSPATR(PR)
     A                                      OVRDTA
     A            HR15           4A  B 22 13DSPATR(PR)
     A                                      OVRDTA
     A            DATE15         9A  B 22 24DSPATR(PR)
     A                                      OVRDTA
     A            SSN15         11A  B 22 35DSPATR(PR)
     A                                      OVRDTA
     A            NAME15        20A  B 22 49DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f6-NEXT GROUP f7-NEW GROUP -
     A                                      f3-MAIN MENU                       -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R OT_HDNG
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 28'ENTERING OVERTIME HOURS'
     A                                  2 19'Only the hours entered will be rec-
     A                                      orded.'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-REG HOURS f2-SAT HOURS f-
     A                                      8-SUN HOURS f4-HOL HOURS f5-PREV DA-
     A                                      Y f6-NEXT DAY f7-')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R PRINT_MENU
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'f1 - Causes a printout of the enti-
     A                                      re division file by workgroups, ori-
     A                                      f'
     A                                  2 11'you enter the department, class an-
     A                                      d shift numbers it will just'
     A                                  3 11'print that workgroup.'
     A                                  5  1'f2 - If you enter a SSN, it will p-
     A                                      rint the record for that individual-
     A                                      .'
     A                                  7  1'f8 - Causes a printout of the enti-
     A                                      re division file for the previous'
     A                                  7 69'week.'
     A                                  8 11'The print format is the same as fo-
     A                                      r f1 and f2 but the hours will'
     A                                  9 11'the figures that were present when'
     A                                  9 46'you reset weekly hours last.'
     A                                 11  1'f4 - Generates attendance sheets f-
     A                                      or the entire division, or if you'
     A                                 11 69'enter'
     A                                 12 11'a department number, it will print'
     A                                 12 46'an attendance sheet for just'
     A                                 13 11'that department.'
     A                                 16 20'DEPT'
     A                                 16 33'CLASS'
     A                                 16 45'SHIFT'
     A                                 18 27'SSN'
     A            DEPT           4Y 0B 16 26DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            CL             2Y 0B 16 40DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            S              1A  B 16 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            SSN            9A  B 18 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-ENTIRE DIVISION f2-SINGL-
     A                                      E PERSON f8-PREVIOUS WEEK f4-ATTEND-
     A                                      . REPORT f7-MGMT ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R REFUSED_HD
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 29'ENTERING HOURS REFUSED'
     A                                  3 13'Employees not entered will be list-
     A                                      ed as having worked.'
     A            AUTOMATIC     16A  B  2 32DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-REG HOURS f2-SAT HOURS f-
     A                                      8-SUN HOURS f4-HOL HOURS f5-PREV DA-
     A                                      Y f6-NEXT DAY f7-')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R SAT_HRS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'Divisio'
     A                                  1 15'Dept'
     A                                  1 27'Class'
     A                                  1 38'Shift'
     A                                  3 10'FI LAST NAME'
     A                                  3 30'MON  TUES WED  THUR FRI  SAT  SUN'
     A            X              2A  B  1 10DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  1 20DSPATR(PR)
     A                                      OVRDTA
     A            CL             2A  B  1 33DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B  1 44DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  4 10DSPATR(PR)
     A                                      OVRDTA
     A            ANAME         15A  B  4 13DSPATR(PR)
     A                                      OVRDTA
     A            A1             2A  B  4 31DSPATR(PR)
     A                                      OVRDTA
     A            A2             2A  B  4 36DSPATR(PR)
     A                                      OVRDTA
     A            A3             2A  B  4 41DSPATR(PR)
     A                                      OVRDTA
     A            A4             2A  B  4 46DSPATR(PR)
     A                                      OVRDTA
     A            A5             2A  B  4 51DSPATR(PR)
     A                                      OVRDTA
     A            A6             2Y 0B  4 56DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12
     AO 97 96                               DSPATR(PC)
     A            A7             2A  B  4 61DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B  6 10DSPATR(PR)
     A                                      OVRDTA
     A            BNAME         15A  B  6 13DSPATR(PR)
     A                                      OVRDTA
     A            B1             2A  B  6 31DSPATR(PR)
     A                                      OVRDTA
     A            B2             2A  B  6 36DSPATR(PR)
     A                                      OVRDTA
     A            B3             2A  B  6 41DSPATR(PR)
     A                                      OVRDTA
     A            B4             2A  B  6 46DSPATR(PR)
     A                                      OVRDTA
     A            B5             2A  B  6 51DSPATR(PR)
     A                                      OVRDTA
     A            B6             2Y 0B  6 56DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            B7             2A  B  6 61DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  8 10DSPATR(PR)
     A                                      OVRDTA
     A            CNAME         15A  B  8 13DSPATR(PR)
     A                                      OVRDTA
     A            C1             2A  B  8 31DSPATR(PR)
     A                                      OVRDTA
     A            C2             2A  B  8 36DSPATR(PR)
     A                                      OVRDTA
     A            C3             2A  B  8 41DSPATR(PR)
     A                                      OVRDTA
     A            C4             2A  B  8 46DSPATR(PR)
     A                                      OVRDTA
     A            C5             2A  B  8 51DSPATR(PR)
     A                                      OVRDTA
     A            C6             2Y 0B  8 56DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            C7             2A  B  8 61DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 10 10DSPATR(PR)
     A                                      OVRDTA
     A            DNAME         15A  B 10 13DSPATR(PR)
     A                                      OVRDTA
     A            D1             2A  B 10 31DSPATR(PR)
     A                                      OVRDTA
     A            D2             2A  B 10 36DSPATR(PR)
     A                                      OVRDTA
     A            D3             2A  B 10 41DSPATR(PR)
     A                                      OVRDTA
     A            D4             2A  B 10 46DSPATR(PR)
     A                                      OVRDTA
     A            D5             2A  B 10 51DSPATR(PR)
     A                                      OVRDTA
     A            D6             2Y 0B 10 56DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A            D7             2A  B 10 61DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 12 10DSPATR(PR)
     A                                      OVRDTA
     A            ENAME         15A  B 12 13DSPATR(PR)
     A                                      OVRDTA
     A            E1             2A  B 12 31DSPATR(PR)
     A                                      OVRDTA
     A            E2             2A  B 12 36DSPATR(PR)
     A                                      OVRDTA
     A            E3             2A  B 12 41DSPATR(PR)
     A                                      OVRDTA
     A            E4             2A  B 12 46DSPATR(PR)
     A                                      OVRDTA
     A            E5             2A  B 12 51DSPATR(PR)
     A                                      OVRDTA
     A            E6             2Y 0B 12 56DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A            E7             2A  B 12 61DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 14 10DSPATR(PR)
     A                                      OVRDTA
     A            FNAME         15A  B 14 13DSPATR(PR)
     A                                      OVRDTA
     A            F1             2A  B 14 31DSPATR(PR)
     A                                      OVRDTA
     A            F2             2A  B 14 36DSPATR(PR)
     A                                      OVRDTA
     A            F3             2A  B 14 41DSPATR(PR)
     A                                      OVRDTA
     A            F4             2A  B 14 46DSPATR(PR)
     A                                      OVRDTA
     A            F5             2A  B 14 51DSPATR(PR)
     A                                      OVRDTA
     A            F6             2Y 0B 14 56DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  57                                  DSPATR(RI)
     A  57                                  DSPATR(PC)
     A            F7             2A  B 14 61DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 16 10DSPATR(PR)
     A                                      OVRDTA
     A            GNAME         15A  B 16 13DSPATR(PR)
     A                                      OVRDTA
     A            G1             2A  B 16 31DSPATR(PR)
     A                                      OVRDTA
     A            G2             2A  B 16 36DSPATR(PR)
     A                                      OVRDTA
     A            G3             2A  B 16 41DSPATR(PR)
     A                                      OVRDTA
     A            G4             2A  B 16 46DSPATR(PR)
     A                                      OVRDTA
     A            G5             2A  B 16 51DSPATR(PR)
     A                                      OVRDTA
     A            G6             2Y 0B 16 56DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  66                                  DSPATR(RI)
     A  66                                  DSPATR(PC)
     A            G7             2A  B 16 61DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 18 10DSPATR(PR)
     A                                      OVRDTA
     A            HNAME         15A  B 18 13DSPATR(PR)
     A                                      OVRDTA
     A            H1             2A  B 18 31DSPATR(PR)
     A                                      OVRDTA
     A            H2             2A  B 18 36DSPATR(PR)
     A                                      OVRDTA
     A            H3             2A  B 18 41DSPATR(PR)
     A                                      OVRDTA
     A            H4             2A  B 18 46DSPATR(PR)
     A                                      OVRDTA
     A            H5             2A  B 18 51DSPATR(PR)
     A                                      OVRDTA
     A            H6             2Y 0B 18 56DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  75                                  DSPATR(RI)
     A  75                                  DSPATR(PC)
     A            H7             2A  B 18 61DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 20 10DSPATR(PR)
     A                                      OVRDTA
     A            INAME         15A  B 20 13DSPATR(PR)
     A                                      OVRDTA
     A            I1             2A  B 20 31DSPATR(PR)
     A                                      OVRDTA
     A            I2             2A  B 20 36DSPATR(PR)
     A                                      OVRDTA
     A            I3             2A  B 20 41DSPATR(PR)
     A                                      OVRDTA
     A            I4             2A  B 20 46DSPATR(PR)
     A                                      OVRDTA
     A            I5             2A  B 20 51DSPATR(PR)
     A                                      OVRDTA
     A            I6             2Y 0B 20 56DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  84                                  DSPATR(RI)
     A  84                                  DSPATR(PC)
     A            I7             2A  B 20 61DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R SAT_MAN
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  1'Division'
     A                                  2 15'Dept'
     A                                  2 27'Class'
     A                                  2 38'Shift'
     A                                  4  1'FI LAST NAME'
     A                                  4 29'MON  TUES WED  THUR FRI  SAT  SUN'
     A                                  5 20'WORKED'
     A                                  6 20'REFUSED'
     A                                  8 20'WORKED'
     A                                  9 20'REFUSED'
     A                                 11 20'WORKED'
     A                                 12 20'REFUSED'
     A                                 14 20'WORKED'
     A                                 15 20'REFUSED'
     A                                 17 20'WORKED'
     A                                 18 20'REFUSED'
     A                                 20 20'WORKED'
     A                                 21 20'REFUSED'
     A            X              2A  B  2 10DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  2 20DSPATR(PR)
     A                                      OVRDTA
     A            CL             2A  B  2 33DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B  2 44DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            ANAME         15A  B  5  4DSPATR(PR)
     A                                      OVRDTA
     A            A1             2A  B  5 30DSPATR(PR)
     A                                      OVRDTA
     A            A2             2A  B  5 35DSPATR(PR)
     A                                      OVRDTA
     A            A3             2A  B  5 40DSPATR(PR)
     A                                      OVRDTA
     A            A4             2A  B  5 45DSPATR(PR)
     A                                      OVRDTA
     A            A5             2A  B  5 50DSPATR(PR)
     A                                      OVRDTA
     A            A6             2Y 0B  5 55DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 12                               DSPATR(RI)
     A N97 12                               DSPATR(PC)
     A            A7             2A  B  5 60DSPATR(PR)
     A                                      OVRDTA
     A            B1             2A  B  6 30DSPATR(PR)
     A                                      OVRDTA
     A            B2             2A  B  6 35DSPATR(PR)
     A                                      OVRDTA
     A            B3             2A  B  6 40DSPATR(PR)
     A                                      OVRDTA
     A            B4             2A  B  6 45DSPATR(PR)
     A                                      OVRDTA
     A            B5             2A  B  6 50DSPATR(PR)
     A                                      OVRDTA
     A            B6             2Y 0B  6 55DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 21                               DSPATR(RI)
     A N97 21                               DSPATR(PC)
     A            B7             2A  B  6 60DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            CNAME         15A  B  8  4DSPATR(PR)
     A                                      OVRDTA
     A            C1             2A  B  8 30DSPATR(PR)
     A                                      OVRDTA
     A            C2             2A  B  8 35DSPATR(PR)
     A                                      OVRDTA
     A            C3             2A  B  8 40DSPATR(PR)
     A                                      OVRDTA
     A            C4             2A  B  8 45DSPATR(PR)
     A                                      OVRDTA
     A            C5             2A  B  8 50DSPATR(PR)
     A                                      OVRDTA
     A            C6             2Y 0B  8 55DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 30                               DSPATR(RI)
     A N97 30                               DSPATR(PC)
     A            C7             2A  B  8 60DSPATR(PR)
     A                                      OVRDTA
     A            D1             2A  B  9 30DSPATR(PR)
     A                                      OVRDTA
     A            D2             2A  B  9 35DSPATR(PR)
     A                                      OVRDTA
     A            D3             2A  B  9 40DSPATR(PR)
     A                                      OVRDTA
     A            D4             2A  B  9 45DSPATR(PR)
     A                                      OVRDTA
     A            D5             2A  B  9 50DSPATR(PR)
     A                                      OVRDTA
     A            D6             2Y 0B  9 55DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 39                               DSPATR(RI)
     A N97 39                               DSPATR(PC)
     A            D7             2A  B  9 60DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            ENAME         15A  B 11  4DSPATR(PR)
     A                                      OVRDTA
     A            E1             2A  B 11 30DSPATR(PR)
     A                                      OVRDTA
     A            E2             2A  B 11 35DSPATR(PR)
     A                                      OVRDTA
     A            E3             2A  B 11 40DSPATR(PR)
     A                                      OVRDTA
     A            E4             2A  B 11 45DSPATR(PR)
     A                                      OVRDTA
     A            E5             2A  B 11 50DSPATR(PR)
     A                                      OVRDTA
     A            E6             2Y 0B 11 55DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 48                               DSPATR(RI)
     A N97 48                               DSPATR(PC)
     A            E7             2A  B 11 60DSPATR(PR)
     A                                      OVRDTA
     A            F1             2A  B 12 30DSPATR(PR)
     A                                      OVRDTA
     A            F2             2A  B 12 35DSPATR(PR)
     A                                      OVRDTA
     A            F3             2A  B 12 40DSPATR(PR)
     A                                      OVRDTA
     A            F4             2A  B 12 45DSPATR(PR)
     A                                      OVRDTA
     A            F5             2A  B 12 50DSPATR(PR)
     A                                      OVRDTA
     A            F6             2Y 0B 12 55DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 57                               DSPATR(RI)
     A N97 57                               DSPATR(PC)
     A            F7             2A  B 12 60DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            GNAME         15A  B 14  4DSPATR(PR)
     A                                      OVRDTA
     A            G1             2A  B 14 30DSPATR(PR)
     A                                      OVRDTA
     A            G2             2A  B 14 35DSPATR(PR)
     A                                      OVRDTA
     A            G3             2A  B 14 40DSPATR(PR)
     A                                      OVRDTA
     A            G4             2A  B 14 45DSPATR(PR)
     A                                      OVRDTA
     A            G5             2A  B 14 50DSPATR(PR)
     A                                      OVRDTA
     A            G6             2Y 0B 14 55DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 66                               DSPATR(RI)
     A N97 66                               DSPATR(PC)
     A            G7             2A  B 14 60DSPATR(PR)
     A                                      OVRDTA
     A            H1             2A  B 15 30DSPATR(PR)
     A                                      OVRDTA
     A            H2             2A  B 15 35DSPATR(PR)
     A                                      OVRDTA
     A            H3             2A  B 15 40DSPATR(PR)
     A                                      OVRDTA
     A            H4             2A  B 15 45DSPATR(PR)
     A                                      OVRDTA
     A            H5             2A  B 15 50DSPATR(PR)
     A                                      OVRDTA
     A            H6             2Y 0B 15 55DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 75                               DSPATR(RI)
     A N97 75                               DSPATR(PC)
     A            H7             2A  B 15 60DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            INAME         15A  B 17  4DSPATR(PR)
     A                                      OVRDTA
     A            I1             2A  B 17 30DSPATR(PR)
     A                                      OVRDTA
     A            I2             2A  B 17 35DSPATR(PR)
     A                                      OVRDTA
     A            I3             2A  B 17 40DSPATR(PR)
     A                                      OVRDTA
     A            I4             2A  B 17 45DSPATR(PR)
     A                                      OVRDTA
     A            I5             2A  B 17 50DSPATR(PR)
     A                                      OVRDTA
     A            I6             2Y 0B 17 55DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 84                               DSPATR(RI)
     A N97 84                               DSPATR(PC)
     A            I7             2A  B 17 60DSPATR(PR)
     A                                      OVRDTA
     A            J1             2A  B 18 30DSPATR(PR)
     A                                      OVRDTA
     A            J2             2A  B 18 35DSPATR(PR)
     A                                      OVRDTA
     A            J3             2A  B 18 40DSPATR(PR)
     A                                      OVRDTA
     A            J4             2A  B 18 45DSPATR(PR)
     A                                      OVRDTA
     A            J5             2A  B 18 50DSPATR(PR)
     A                                      OVRDTA
     A            J6             2Y 0B 18 55DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 93                               DSPATR(RI)
     A N97 93                               DSPATR(PC)
     A            J7             2A  B 18 60DSPATR(PR)
     A                                      OVRDTA
     A            K              1A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            KNAME         15A  B 20  4DSPATR(PR)
     A                                      OVRDTA
     A            K1             2A  B 20 30DSPATR(PR)
     A                                      OVRDTA
     A            K2             2A  B 20 35DSPATR(PR)
     A                                      OVRDTA
     A            K3             2A  B 20 40DSPATR(PR)
     A                                      OVRDTA
     A            K4             2A  B 20 45DSPATR(PR)
     A                                      OVRDTA
     A            K5             2A  B 20 50DSPATR(PR)
     A                                      OVRDTA
     A            K6             2Y 0B 20 55DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 06                               DSPATR(RI)
     A  97 06                               DSPATR(PC)
     A            K7             2A  B 20 60DSPATR(PR)
     A                                      OVRDTA
     A            L1             2A  B 21 30DSPATR(PR)
     A                                      OVRDTA
     A            L2             2A  B 21 35DSPATR(PR)
     A                                      OVRDTA
     A            L3             2A  B 21 40DSPATR(PR)
     A                                      OVRDTA
     A            L4             2A  B 21 45DSPATR(PR)
     A                                      OVRDTA
     A            L5             2A  B 21 50DSPATR(PR)
     A                                      OVRDTA
     A            L6             2Y 0B 21 55DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 15                               DSPATR(RI)
     A  97 15                               DSPATR(PC)
     A            L7             2A  B 21 60DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R SUN_HRS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'Divisio'
     A                                  1 15'Dept'
     A                                  1 27'Class'
     A                                  1 38'Shift'
     A                                  3 10'FI LAST NAME'
     A                                  3 30'MON  TUES WED  THUR FRI  SAT  SUN'
     A            X              2A  B  1 10DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  1 20DSPATR(PR)
     A                                      OVRDTA
     A            CL             2A  B  1 33DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B  1 44DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  4 10DSPATR(PR)
     A                                      OVRDTA
     A            ANAME         15A  B  4 13DSPATR(PR)
     A                                      OVRDTA
     A            A1             2A  B  4 31DSPATR(PR)
     A                                      OVRDTA
     A            A2             2A  B  4 36DSPATR(PR)
     A                                      OVRDTA
     A            A3             2A  B  4 41DSPATR(PR)
     A                                      OVRDTA
     A            A4             2A  B  4 46DSPATR(PR)
     A                                      OVRDTA
     A            A5             2A  B  4 51DSPATR(PR)
     A                                      OVRDTA
     A            A6             2A  B  4 56DSPATR(PR)
     A                                      OVRDTA
     A            A7             2Y 0B  4 61DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13
     AO 97 96                               DSPATR(PC)
     A            B              1A  B  6 10DSPATR(PR)
     A                                      OVRDTA
     A            BNAME         15A  B  6 13DSPATR(PR)
     A                                      OVRDTA
     A            B1             2A  B  6 31DSPATR(PR)
     A                                      OVRDTA
     A            B2             2A  B  6 36DSPATR(PR)
     A                                      OVRDTA
     A            B3             2A  B  6 41DSPATR(PR)
     A                                      OVRDTA
     A            B4             2A  B  6 46DSPATR(PR)
     A                                      OVRDTA
     A            B5             2A  B  6 51DSPATR(PR)
     A                                      OVRDTA
     A            B6             2A  B  6 56DSPATR(PR)
     A                                      OVRDTA
     A            B7             2Y 0B  6 61DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            C              1A  B  8 10DSPATR(PR)
     A                                      OVRDTA
     A            CNAME         15A  B  8 13DSPATR(PR)
     A                                      OVRDTA
     A            C1             2A  B  8 31DSPATR(PR)
     A                                      OVRDTA
     A            C2             2A  B  8 36DSPATR(PR)
     A                                      OVRDTA
     A            C3             2A  B  8 41DSPATR(PR)
     A                                      OVRDTA
     A            C4             2A  B  8 46DSPATR(PR)
     A                                      OVRDTA
     A            C5             2A  B  8 51DSPATR(PR)
     A                                      OVRDTA
     A            C6             2A  B  8 56DSPATR(PR)
     A                                      OVRDTA
     A            C7             2Y 0B  8 61DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            D              1A  B 10 10DSPATR(PR)
     A                                      OVRDTA
     A            DNAME         15A  B 10 13DSPATR(PR)
     A                                      OVRDTA
     A            D1             2A  B 10 31DSPATR(PR)
     A                                      OVRDTA
     A            D2             2A  B 10 36DSPATR(PR)
     A                                      OVRDTA
     A            D3             2A  B 10 41DSPATR(PR)
     A                                      OVRDTA
     A            D4             2A  B 10 46DSPATR(PR)
     A                                      OVRDTA
     A            D5             2A  B 10 51DSPATR(PR)
     A                                      OVRDTA
     A            D6             2A  B 10 56DSPATR(PR)
     A                                      OVRDTA
     A            D7             2Y 0B 10 61DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            E              1A  B 12 10DSPATR(PR)
     A                                      OVRDTA
     A            ENAME         15A  B 12 13DSPATR(PR)
     A                                      OVRDTA
     A            E1             2A  B 12 31DSPATR(PR)
     A                                      OVRDTA
     A            E2             2A  B 12 36DSPATR(PR)
     A                                      OVRDTA
     A            E3             2A  B 12 41DSPATR(PR)
     A                                      OVRDTA
     A            E4             2A  B 12 46DSPATR(PR)
     A                                      OVRDTA
     A            E5             2A  B 12 51DSPATR(PR)
     A                                      OVRDTA
     A            E6             2A  B 12 56DSPATR(PR)
     A                                      OVRDTA
     A            E7             2Y 0B 12 61DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A            F              1A  B 14 10DSPATR(PR)
     A                                      OVRDTA
     A            FNAME         15A  B 14 13DSPATR(PR)
     A                                      OVRDTA
     A            F1             2A  B 14 31DSPATR(PR)
     A                                      OVRDTA
     A            F2             2A  B 14 36DSPATR(PR)
     A                                      OVRDTA
     A            F3             2A  B 14 41DSPATR(PR)
     A                                      OVRDTA
     A            F4             2A  B 14 46DSPATR(PR)
     A                                      OVRDTA
     A            F5             2A  B 14 51DSPATR(PR)
     A                                      OVRDTA
     A            F6             2A  B 14 56DSPATR(PR)
     A                                      OVRDTA
     A            F7             2Y 0B 14 61DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  58                                  DSPATR(RI)
     A  58                                  DSPATR(PC)
     A            G              1A  B 16 10DSPATR(PR)
     A                                      OVRDTA
     A            GNAME         15A  B 16 13DSPATR(PR)
     A                                      OVRDTA
     A            G1             2A  B 16 31DSPATR(PR)
     A                                      OVRDTA
     A            G2             2A  B 16 36DSPATR(PR)
     A                                      OVRDTA
     A            G3             2A  B 16 41DSPATR(PR)
     A                                      OVRDTA
     A            G4             2A  B 16 46DSPATR(PR)
     A                                      OVRDTA
     A            G5             2A  B 16 51DSPATR(PR)
     A                                      OVRDTA
     A            G6             2A  B 16 56DSPATR(PR)
     A                                      OVRDTA
     A            G7             2Y 0B 16 61DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  67                                  DSPATR(RI)
     A  67                                  DSPATR(PC)
     A            H              1A  B 18 10DSPATR(PR)
     A                                      OVRDTA
     A            HNAME         15A  B 18 13DSPATR(PR)
     A                                      OVRDTA
     A            H1             2A  B 18 31DSPATR(PR)
     A                                      OVRDTA
     A            H2             2A  B 18 36DSPATR(PR)
     A                                      OVRDTA
     A            H3             2A  B 18 41DSPATR(PR)
     A                                      OVRDTA
     A            H4             2A  B 18 46DSPATR(PR)
     A                                      OVRDTA
     A            H5             2A  B 18 51DSPATR(PR)
     A                                      OVRDTA
     A            H6             2A  B 18 56DSPATR(PR)
     A                                      OVRDTA
     A            H7             2Y 0B 18 61DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  76                                  DSPATR(RI)
     A  76                                  DSPATR(PC)
     A            I              1A  B 20 10DSPATR(PR)
     A                                      OVRDTA
     A            INAME         15A  B 20 13DSPATR(PR)
     A                                      OVRDTA
     A            I1             2A  B 20 31DSPATR(PR)
     A                                      OVRDTA
     A            I2             2A  B 20 36DSPATR(PR)
     A                                      OVRDTA
     A            I3             2A  B 20 41DSPATR(PR)
     A                                      OVRDTA
     A            I4             2A  B 20 46DSPATR(PR)
     A                                      OVRDTA
     A            I5             2A  B 20 51DSPATR(PR)
     A                                      OVRDTA
     A            I6             2A  B 20 56DSPATR(PR)
     A                                      OVRDTA
     A            I7             2Y 0B 20 61DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  85                                  DSPATR(RI)
     A  85                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R SUN_MAN
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  1'Division'
     A                                  2 15'Dept'
     A                                  2 27'Class'
     A                                  2 38'Shift'
     A                                  4  1'FI LAST NAME'
     A                                  4 29'MON  TUES WED  THUR FRI  SAT  SUN'
     A                                  5 20'WORKED'
     A                                  6 20'REFUSED'
     A                                  8 20'WORKED'
     A                                  9 20'REFUSED'
     A                                 11 20'WORKED'
     A                                 12 20'REFUSED'
     A                                 14 20'WORKED'
     A                                 15 20'REFUSED'
     A                                 17 20'WORKED'
     A                                 18 20'REFUSED'
     A                                 20 20'WORKED'
     A                                 21 20'REFUSED'
     A            X              2A  B  2 10DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  2 20DSPATR(PR)
     A                                      OVRDTA
     A            CL             2A  B  2 33DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B  2 44DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            ANAME         15A  B  5  4DSPATR(PR)
     A                                      OVRDTA
     A            A1             2A  B  5 30DSPATR(PR)
     A                                      OVRDTA
     A            A2             2A  B  5 35DSPATR(PR)
     A                                      OVRDTA
     A            A3             2A  B  5 40DSPATR(PR)
     A                                      OVRDTA
     A            A4             2A  B  5 45DSPATR(PR)
     A                                      OVRDTA
     A            A5             2A  B  5 50DSPATR(PR)
     A                                      OVRDTA
     A            A6             2A  B  5 55DSPATR(PR)
     A                                      OVRDTA
     A            A7             2Y 0B  5 60DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 13                               DSPATR(RI)
     A N97 13                               DSPATR(PC)
     A            B1             2A  B  6 30DSPATR(PR)
     A                                      OVRDTA
     A            B2             2A  B  6 35DSPATR(PR)
     A                                      OVRDTA
     A            B3             2A  B  6 40DSPATR(PR)
     A                                      OVRDTA
     A            B4             2A  B  6 45DSPATR(PR)
     A                                      OVRDTA
     A            B5             2A  B  6 50DSPATR(PR)
     A                                      OVRDTA
     A            B6             2A  B  6 55DSPATR(PR)
     A                                      OVRDTA
     A            B7             2Y 0B  6 60DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 22                               DSPATR(RI)
     A N97 22                               DSPATR(PC)
     A            C              1A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            CNAME         15A  B  8  4DSPATR(PR)
     A                                      OVRDTA
     A            C1             2A  B  8 30DSPATR(PR)
     A                                      OVRDTA
     A            C2             2A  B  8 35DSPATR(PR)
     A                                      OVRDTA
     A            C3             2A  B  8 40DSPATR(PR)
     A                                      OVRDTA
     A            C4             2A  B  8 45DSPATR(PR)
     A                                      OVRDTA
     A            C5             2A  B  8 50DSPATR(PR)
     A                                      OVRDTA
     A            C6             2A  B  8 55DSPATR(PR)
     A                                      OVRDTA
     A            C7             2Y 0B  8 60DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 31                               DSPATR(RI)
     A N97 31                               DSPATR(PC)
     A            D1             2A  B  9 30DSPATR(PR)
     A                                      OVRDTA
     A            D2             2A  B  9 35DSPATR(PR)
     A                                      OVRDTA
     A            D3             2A  B  9 40DSPATR(PR)
     A                                      OVRDTA
     A            D4             2A  B  9 45DSPATR(PR)
     A                                      OVRDTA
     A            D5             2A  B  9 50DSPATR(PR)
     A                                      OVRDTA
     A            D6             2A  B  9 55DSPATR(PR)
     A                                      OVRDTA
     A            D7             2Y 0B  9 60DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 40                               DSPATR(RI)
     A N97 40                               DSPATR(PC)
     A            E              1A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            ENAME         15A  B 11  4DSPATR(PR)
     A                                      OVRDTA
     A            E1             2A  B 11 30DSPATR(PR)
     A                                      OVRDTA
     A            E2             2A  B 11 35DSPATR(PR)
     A                                      OVRDTA
     A            E3             2A  B 11 40DSPATR(PR)
     A                                      OVRDTA
     A            E4             2A  B 11 45DSPATR(PR)
     A                                      OVRDTA
     A            E5             2A  B 11 50DSPATR(PR)
     A                                      OVRDTA
     A            E6             2A  B 11 55DSPATR(PR)
     A                                      OVRDTA
     A            E7             2Y 0B 11 60DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 49                               DSPATR(RI)
     A N97 49                               DSPATR(PC)
     A            F1             2A  B 12 30DSPATR(PR)
     A                                      OVRDTA
     A            F2             2A  B 12 35DSPATR(PR)
     A                                      OVRDTA
     A            F3             2A  B 12 40DSPATR(PR)
     A                                      OVRDTA
     A            F4             2A  B 12 45DSPATR(PR)
     A                                      OVRDTA
     A            F5             2A  B 12 50DSPATR(PR)
     A                                      OVRDTA
     A            F6             2A  B 12 55DSPATR(PR)
     A                                      OVRDTA
     A            F7             2Y 0B 12 60DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 58                               DSPATR(RI)
     A N97 58                               DSPATR(PC)
     A            G              1A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            GNAME         15A  B 14  4DSPATR(PR)
     A                                      OVRDTA
     A            G1             2A  B 14 30DSPATR(PR)
     A                                      OVRDTA
     A            G2             2A  B 14 35DSPATR(PR)
     A                                      OVRDTA
     A            G3             2A  B 14 40DSPATR(PR)
     A                                      OVRDTA
     A            G4             2A  B 14 45DSPATR(PR)
     A                                      OVRDTA
     A            G5             2A  B 14 50DSPATR(PR)
     A                                      OVRDTA
     A            G6             2A  B 14 55DSPATR(PR)
     A                                      OVRDTA
     A            G7             2Y 0B 14 60DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 67                               DSPATR(RI)
     A N97 67                               DSPATR(PC)
     A            H1             2A  B 15 30DSPATR(PR)
     A                                      OVRDTA
     A            H2             2A  B 15 35DSPATR(PR)
     A                                      OVRDTA
     A            H3             2A  B 15 40DSPATR(PR)
     A                                      OVRDTA
     A            H4             2A  B 15 45DSPATR(PR)
     A                                      OVRDTA
     A            H5             2A  B 15 50DSPATR(PR)
     A                                      OVRDTA
     A            H6             2A  B 15 55DSPATR(PR)
     A                                      OVRDTA
     A            H7             2Y 0B 15 60DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 76                               DSPATR(RI)
     A N97 76                               DSPATR(PC)
     A            I              1A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            INAME         15A  B 17  4DSPATR(PR)
     A                                      OVRDTA
     A            I1             2A  B 17 30DSPATR(PR)
     A                                      OVRDTA
     A            I2             2A  B 17 35DSPATR(PR)
     A                                      OVRDTA
     A            I3             2A  B 17 40DSPATR(PR)
     A                                      OVRDTA
     A            I4             2A  B 17 45DSPATR(PR)
     A                                      OVRDTA
     A            I5             2A  B 17 50DSPATR(PR)
     A                                      OVRDTA
     A            I6             2A  B 17 55DSPATR(PR)
     A                                      OVRDTA
     A            I7             2Y 0B 17 60DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 85                               DSPATR(RI)
     A N97 85                               DSPATR(PC)
     A            J1             2A  B 18 30DSPATR(PR)
     A                                      OVRDTA
     A            J2             2A  B 18 35DSPATR(PR)
     A                                      OVRDTA
     A            J3             2A  B 18 40DSPATR(PR)
     A                                      OVRDTA
     A            J4             2A  B 18 45DSPATR(PR)
     A                                      OVRDTA
     A            J5             2A  B 18 50DSPATR(PR)
     A                                      OVRDTA
     A            J6             2A  B 18 55DSPATR(PR)
     A                                      OVRDTA
     A            J7             2Y 0B 18 60DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 94                               DSPATR(RI)
     A N97 94                               DSPATR(PC)
     A            K              1A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            KNAME         15A  B 20  4DSPATR(PR)
     A                                      OVRDTA
     A            K1             2A  B 20 30DSPATR(PR)
     A                                      OVRDTA
     A            K2             2A  B 20 35DSPATR(PR)
     A                                      OVRDTA
     A            K3             2A  B 20 40DSPATR(PR)
     A                                      OVRDTA
     A            K4             2A  B 20 45DSPATR(PR)
     A                                      OVRDTA
     A            K5             2A  B 20 50DSPATR(PR)
     A                                      OVRDTA
     A            K6             2A  B 20 55DSPATR(PR)
     A                                      OVRDTA
     A            K7             2Y 0B 20 60DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 07                               DSPATR(RI)
     A  97 07                               DSPATR(PC)
     A            L1             2A  B 21 30DSPATR(PR)
     A                                      OVRDTA
     A            L2             2A  B 21 35DSPATR(PR)
     A                                      OVRDTA
     A            L3             2A  B 21 40DSPATR(PR)
     A                                      OVRDTA
     A            L4             2A  B 21 45DSPATR(PR)
     A                                      OVRDTA
     A            L5             2A  B 21 50DSPATR(PR)
     A                                      OVRDTA
     A            L6             2A  B 21 55DSPATR(PR)
     A                                      OVRDTA
     A            L7             2Y 0B 21 60DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 16                               DSPATR(RI)
     A  97 16                               DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R THU_HRS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'Divisio'
     A                                  1 15'Dept'
     A                                  1 27'Class'
     A                                  1 38'Shift'
     A                                  3 10'FI LAST NAME'
     A                                  3 30'MON  TUES WED  THUR FRI  SAT  SUN'
     A            X              2A  B  1 10DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  1 20DSPATR(PR)
     A                                      OVRDTA
     A            CL             2A  B  1 33DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B  1 44DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  4 10DSPATR(PR)
     A                                      OVRDTA
     A            ANAME         15A  B  4 13DSPATR(PR)
     A                                      OVRDTA
     A            A1             2A  B  4 31DSPATR(PR)
     A                                      OVRDTA
     A            A2             2A  B  4 36DSPATR(PR)
     A                                      OVRDTA
     A            A3             2A  B  4 41DSPATR(PR)
     A                                      OVRDTA
     A            A4             2Y 0B  4 46DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10
     AO 97 96                               DSPATR(PC)
     A            A5             2A  B  4 51DSPATR(PR)
     A                                      OVRDTA
     A            A6             2A  B  4 56DSPATR(PR)
     A                                      OVRDTA
     A            A7             2A  B  4 61DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B  6 10DSPATR(PR)
     A                                      OVRDTA
     A            BNAME         15A  B  6 13DSPATR(PR)
     A                                      OVRDTA
     A            B1             2A  B  6 31DSPATR(PR)
     A                                      OVRDTA
     A            B2             2A  B  6 36DSPATR(PR)
     A                                      OVRDTA
     A            B3             2A  B  6 41DSPATR(PR)
     A                                      OVRDTA
     A            B4             2Y 0B  6 46DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            B5             2A  B  6 51DSPATR(PR)
     A                                      OVRDTA
     A            B6             2A  B  6 56DSPATR(PR)
     A                                      OVRDTA
     A            B7             2A  B  6 61DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  8 10DSPATR(PR)
     A                                      OVRDTA
     A            CNAME         15A  B  8 13DSPATR(PR)
     A                                      OVRDTA
     A            C1             2A  B  8 31DSPATR(PR)
     A                                      OVRDTA
     A            C2             2A  B  8 36DSPATR(PR)
     A                                      OVRDTA
     A            C3             2A  B  8 41DSPATR(PR)
     A                                      OVRDTA
     A            C4             2Y 0B  8 46DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            C5             2A  B  8 51DSPATR(PR)
     A                                      OVRDTA
     A            C6             2A  B  8 56DSPATR(PR)
     A                                      OVRDTA
     A            C7             2A  B  8 61DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 10 10DSPATR(PR)
     A                                      OVRDTA
     A            DNAME         15A  B 10 13DSPATR(PR)
     A                                      OVRDTA
     A            D1             2A  B 10 31DSPATR(PR)
     A                                      OVRDTA
     A            D2             2A  B 10 36DSPATR(PR)
     A                                      OVRDTA
     A            D3             2A  B 10 41DSPATR(PR)
     A                                      OVRDTA
     A            D4             2Y 0B 10 46DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            D5             2A  B 10 51DSPATR(PR)
     A                                      OVRDTA
     A            D6             2A  B 10 56DSPATR(PR)
     A                                      OVRDTA
     A            D7             2A  B 10 61DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 12 10DSPATR(PR)
     A                                      OVRDTA
     A            ENAME         15A  B 12 13DSPATR(PR)
     A                                      OVRDTA
     A            E1             2A  B 12 31DSPATR(PR)
     A                                      OVRDTA
     A            E2             2A  B 12 36DSPATR(PR)
     A                                      OVRDTA
     A            E3             2A  B 12 41DSPATR(PR)
     A                                      OVRDTA
     A            E4             2Y 0B 12 46DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A            E5             2A  B 12 51DSPATR(PR)
     A                                      OVRDTA
     A            E6             2A  B 12 56DSPATR(PR)
     A                                      OVRDTA
     A            E7             2A  B 12 61DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 14 10DSPATR(PR)
     A                                      OVRDTA
     A            FNAME         15A  B 14 13DSPATR(PR)
     A                                      OVRDTA
     A            F1             2A  B 14 31DSPATR(PR)
     A                                      OVRDTA
     A            F2             2A  B 14 36DSPATR(PR)
     A                                      OVRDTA
     A            F3             2A  B 14 41DSPATR(PR)
     A                                      OVRDTA
     A            F4             2Y 0B 14 46DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  55                                  DSPATR(RI)
     A  55                                  DSPATR(PC)
     A            F5             2A  B 14 51DSPATR(PR)
     A                                      OVRDTA
     A            F6             2A  B 14 56DSPATR(PR)
     A                                      OVRDTA
     A            F7             2A  B 14 61DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 16 10DSPATR(PR)
     A                                      OVRDTA
     A            GNAME         15A  B 16 13DSPATR(PR)
     A                                      OVRDTA
     A            G1             2A  B 16 31DSPATR(PR)
     A                                      OVRDTA
     A            G2             2A  B 16 36DSPATR(PR)
     A                                      OVRDTA
     A            G3             2A  B 16 41DSPATR(PR)
     A                                      OVRDTA
     A            G4             2Y 0B 16 46DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A            G5             2A  B 16 51DSPATR(PR)
     A                                      OVRDTA
     A            G6             2A  B 16 56DSPATR(PR)
     A                                      OVRDTA
     A            G7             2A  B 16 61DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 18 10DSPATR(PR)
     A                                      OVRDTA
     A            HNAME         15A  B 18 13DSPATR(PR)
     A                                      OVRDTA
     A            H1             2A  B 18 31DSPATR(PR)
     A                                      OVRDTA
     A            H2             2A  B 18 36DSPATR(PR)
     A                                      OVRDTA
     A            H3             2A  B 18 41DSPATR(PR)
     A                                      OVRDTA
     A            H4             2Y 0B 18 46DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  73                                  DSPATR(RI)
     A  73                                  DSPATR(PC)
     A            H5             2A  B 18 51DSPATR(PR)
     A                                      OVRDTA
     A            H6             2A  B 18 56DSPATR(PR)
     A                                      OVRDTA
     A            H7             2A  B 18 61DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 20 10DSPATR(PR)
     A                                      OVRDTA
     A            INAME         15A  B 20 13DSPATR(PR)
     A                                      OVRDTA
     A            I1             2A  B 20 31DSPATR(PR)
     A                                      OVRDTA
     A            I2             2A  B 20 36DSPATR(PR)
     A                                      OVRDTA
     A            I3             2A  B 20 41DSPATR(PR)
     A                                      OVRDTA
     A            I4             2Y 0B 20 46DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  82                                  DSPATR(RI)
     A  82                                  DSPATR(PC)
     A            I5             2A  B 20 51DSPATR(PR)
     A                                      OVRDTA
     A            I6             2A  B 20 56DSPATR(PR)
     A                                      OVRDTA
     A            I7             2A  B 20 61DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R THU_MAN
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  1'Division'
     A                                  2 15'Dept'
     A                                  2 27'Class'
     A                                  2 38'Shift'
     A                                  4  1'FI LAST NAME'
     A                                  4 29'MON  TUES WED  THUR FRI  SAT  SUN'
     A                                  5 20'WORKED'
     A                                  6 20'REFUSED'
     A                                  8 20'WORKED'
     A                                  9 20'REFUSED'
     A                                 11 20'WORKED'
     A                                 12 20'REFUSED'
     A                                 14 20'WORKED'
     A                                 15 20'REFUSED'
     A                                 17 20'WORKED'
     A                                 18 20'REFUSED'
     A                                 20 20'WORKED'
     A                                 21 20'REFUSED'
     A            X              2A  B  2 10DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  2 20DSPATR(PR)
     A                                      OVRDTA
     A            CL             2A  B  2 33DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B  2 44DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            ANAME         15A  B  5  4DSPATR(PR)
     A                                      OVRDTA
     A            A1             2A  B  5 30DSPATR(PR)
     A                                      OVRDTA
     A            A2             2A  B  5 35DSPATR(PR)
     A                                      OVRDTA
     A            A3             2A  B  5 40DSPATR(PR)
     A                                      OVRDTA
     A            A4             2Y 0B  5 45DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 10                               DSPATR(RI)
     A N97 10                               DSPATR(PC)
     A            A5             2A  B  5 50DSPATR(PR)
     A                                      OVRDTA
     A            A6             2A  B  5 55DSPATR(PR)
     A                                      OVRDTA
     A            A7             2A  B  5 60DSPATR(PR)
     A                                      OVRDTA
     A            B1             2A  B  6 30DSPATR(PR)
     A                                      OVRDTA
     A            B2             2A  B  6 35DSPATR(PR)
     A                                      OVRDTA
     A            B3             2A  B  6 40DSPATR(PR)
     A                                      OVRDTA
     A            B4             2Y 0B  6 45DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 19                               DSPATR(RI)
     A N97 19                               DSPATR(PC)
     A            B5             2A  B  6 50DSPATR(PR)
     A                                      OVRDTA
     A            B6             2A  B  6 55DSPATR(PR)
     A                                      OVRDTA
     A            B7             2A  B  6 60DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            CNAME         15A  B  8  4DSPATR(PR)
     A                                      OVRDTA
     A            C1             2A  B  8 30DSPATR(PR)
     A                                      OVRDTA
     A            C2             2A  B  8 35DSPATR(PR)
     A                                      OVRDTA
     A            C3             2A  B  8 40DSPATR(PR)
     A                                      OVRDTA
     A            C4             2Y 0B  8 45DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 28                               DSPATR(RI)
     A N97 28                               DSPATR(PC)
     A            C5             2A  B  8 50DSPATR(PR)
     A                                      OVRDTA
     A            C6             2A  B  8 55DSPATR(PR)
     A                                      OVRDTA
     A            C7             2A  B  8 60DSPATR(PR)
     A                                      OVRDTA
     A            D1             2A  B  9 30DSPATR(PR)
     A                                      OVRDTA
     A            D2             2A  B  9 35DSPATR(PR)
     A                                      OVRDTA
     A            D3             2A  B  9 40DSPATR(PR)
     A                                      OVRDTA
     A            D4             2Y 0B  9 45DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 37                               DSPATR(RI)
     A N97 37                               DSPATR(PC)
     A            D5             2A  B  9 50DSPATR(PR)
     A                                      OVRDTA
     A            D6             2A  B  9 55DSPATR(PR)
     A                                      OVRDTA
     A            D7             2A  B  9 60DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            ENAME         15A  B 11  4DSPATR(PR)
     A                                      OVRDTA
     A            E1             2A  B 11 30DSPATR(PR)
     A                                      OVRDTA
     A            E2             2A  B 11 35DSPATR(PR)
     A                                      OVRDTA
     A            E3             2A  B 11 40DSPATR(PR)
     A                                      OVRDTA
     A            E4             2Y 0B 11 45DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 46                               DSPATR(RI)
     A N97 46                               DSPATR(PC)
     A            E5             2A  B 11 50DSPATR(PR)
     A                                      OVRDTA
     A            E6             2A  B 11 55DSPATR(PR)
     A                                      OVRDTA
     A            E7             2A  B 11 60DSPATR(PR)
     A                                      OVRDTA
     A            F1             2A  B 12 30DSPATR(PR)
     A                                      OVRDTA
     A            F2             2A  B 12 35DSPATR(PR)
     A                                      OVRDTA
     A            F3             2A  B 12 40DSPATR(PR)
     A                                      OVRDTA
     A            F4             2Y 0B 12 45DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 55                               DSPATR(RI)
     A N97 55                               DSPATR(PC)
     A            F5             2A  B 12 50DSPATR(PR)
     A                                      OVRDTA
     A            F6             2A  B 12 55DSPATR(PR)
     A                                      OVRDTA
     A            F7             2A  B 12 60DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            GNAME         15A  B 14  4DSPATR(PR)
     A                                      OVRDTA
     A            G1             2A  B 14 30DSPATR(PR)
     A                                      OVRDTA
     A            G2             2A  B 14 35DSPATR(PR)
     A                                      OVRDTA
     A            G3             2A  B 14 40DSPATR(PR)
     A                                      OVRDTA
     A            G4             2Y 0B 14 45DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 64                               DSPATR(RI)
     A N97 64                               DSPATR(PC)
     A            G5             2A  B 14 50DSPATR(PR)
     A                                      OVRDTA
     A            G6             2A  B 14 55DSPATR(PR)
     A                                      OVRDTA
     A            G7             2A  B 14 60DSPATR(PR)
     A                                      OVRDTA
     A            H1             2A  B 15 30DSPATR(PR)
     A                                      OVRDTA
     A            H2             2A  B 15 35DSPATR(PR)
     A                                      OVRDTA
     A            H3             2A  B 15 40DSPATR(PR)
     A                                      OVRDTA
     A            H4             2Y 0B 15 45DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 73                               DSPATR(RI)
     A N97 73                               DSPATR(PC)
     A            H5             2A  B 15 50DSPATR(PR)
     A                                      OVRDTA
     A            H6             2A  B 15 55DSPATR(PR)
     A                                      OVRDTA
     A            H7             2A  B 15 60DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            INAME         15A  B 17  4DSPATR(PR)
     A                                      OVRDTA
     A            I1             2A  B 17 30DSPATR(PR)
     A                                      OVRDTA
     A            I2             2A  B 17 35DSPATR(PR)
     A                                      OVRDTA
     A            I3             2A  B 17 40DSPATR(PR)
     A                                      OVRDTA
     A            I4             2Y 0B 17 45DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 82                               DSPATR(RI)
     A N97 82                               DSPATR(PC)
     A            I5             2A  B 17 50DSPATR(PR)
     A                                      OVRDTA
     A            I6             2A  B 17 55DSPATR(PR)
     A                                      OVRDTA
     A            I7             2A  B 17 60DSPATR(PR)
     A                                      OVRDTA
     A            J1             2A  B 18 30DSPATR(PR)
     A                                      OVRDTA
     A            J2             2A  B 18 35DSPATR(PR)
     A                                      OVRDTA
     A            J3             2A  B 18 40DSPATR(PR)
     A                                      OVRDTA
     A            J4             2Y 0B 18 45DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 91                               DSPATR(RI)
     A N97 91                               DSPATR(PC)
     A            J5             2A  B 18 50DSPATR(PR)
     A                                      OVRDTA
     A            J6             2A  B 18 55DSPATR(PR)
     A                                      OVRDTA
     A            J7             2A  B 18 60DSPATR(PR)
     A                                      OVRDTA
     A            K              1A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            KNAME         15A  B 20  4DSPATR(PR)
     A                                      OVRDTA
     A            K1             2A  B 20 30DSPATR(PR)
     A                                      OVRDTA
     A            K2             2A  B 20 35DSPATR(PR)
     A                                      OVRDTA
     A            K3             2A  B 20 40DSPATR(PR)
     A                                      OVRDTA
     A            K4             2Y 0B 20 45DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 04                               DSPATR(RI)
     A  97 04                               DSPATR(PC)
     A            K5             2A  B 20 50DSPATR(PR)
     A                                      OVRDTA
     A            K6             2A  B 20 55DSPATR(PR)
     A                                      OVRDTA
     A            K7             2A  B 20 60DSPATR(PR)
     A                                      OVRDTA
     A            L1             2A  B 21 30DSPATR(PR)
     A                                      OVRDTA
     A            L2             2A  B 21 35DSPATR(PR)
     A                                      OVRDTA
     A            L3             2A  B 21 40DSPATR(PR)
     A                                      OVRDTA
     A            L4             2Y 0B 21 45DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 13                               DSPATR(RI)
     A  97 13                               DSPATR(PC)
     A            L5             2A  B 21 50DSPATR(PR)
     A                                      OVRDTA
     A            L6             2A  B 21 55DSPATR(PR)
     A                                      OVRDTA
     A            L7             2A  B 21 60DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R TITLE
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  1'DATE'
     A                                  4 25'G O O D Y E A R   T O P E K A'
     A                                  6 24'B A L A N C E   O F   H O U R S'
     A                                  8 31'for DIVISION '
     A            DATE           8A  B  2  6DSPATR(PR)
     A                                      OVRDTA
     A            A              2A  B  8 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-EMPLOYEE RECORDS f2-VOL.-
     A                                       STATUS f8-ENTER HOURS f5-VIEW HOUR-
     A                                      S f6-OFFER WK BY ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R TTL_HRS_1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 31'ENTER TOTAL HOURS'
     A                                  5  6'You may enter a Department number,'
     A                                  5 41'Shift and Classification to begin'
     A                                  6  1'entering at a selected work group.'
     A                                  6 37'If you do not enter a Department n-
     A                                      umber'
     A                                  7  1'the program will start with the fi-
     A                                      rst record for your division.'
     A                                 12 25'Press ENTER when you are ready.'
     A                                 14 22'Department'
     A                                 14 40'Class'
     A                                 14 51'Shift'
     A            DEPT           4Y 0B 14 33DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            CL             2Y 0B 14 46DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            S              1A  B 14 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-MAIN MENU               -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R TTL_HRS_2
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 31'ENTER TOTAL HOURS'
     A                                  4 25'SSN'
     A                                  7  1'DEPT'
     A                                  7 13'CLASSIFICATION'
     A                                  7 33'SHIFT'
     A                                 10  3'TOTAL HOURS'
     A                                 10 22'REG    DOT    SAT   SUN   HOL'
     A                                 11  8'AVAILABLE'
     A                                 13  8'REFUSED'
     A                                 14  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                 16  1'MAKE ALL THE CHANGES DESIRED AND P-
     A                                      RESS "ENTER".'
     A            FIRSTINIT      1A  B  4  1DSPATR(PR)
     A                                      OVRDTA
     A            MIDINIT        1A  B  4  3DSPATR(PR)
     A                                      OVRDTA
     A            NAME          15A  B  4  6DSPATR(PR)
     A                                      OVRDTA
     A            SSN            9A  B  4 29DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  7  6DSPATR(PR)
     A                                      OVRDTA
     A            CLASS          2A  B  7 28DSPATR(PR)
     A                                      OVRDTA
     A            SHIFT          1A  B  7 39DSPATR(PR)
     A                                      OVRDTA
     A            TOTALREGWK     4Y 0B 11 22DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24
     AO 97 96                               DSPATR(PC)
     A            TOTDOT         4Y 0B 11 29DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A            SATWKD         3Y 0B 11 36DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            TOTALSUNWK     3Y 0B 11 42DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            TOTALHOLWK     3Y 0B 11 48DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            TOTREGCHG      4Y 0B 13 22DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            TOTDOTCHG      4Y 0B 13 29DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            TOTSATCHG      3Y 0B 13 36DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            TOTSUNCHG      3Y 0B 13 42DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A            TOTHOLCHG      3Y 0B 13 48DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f7-NEW GROUP f3-MAIN MENU  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R TUE_HRS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'Divisio'
     A                                  1 15'Dept'
     A                                  1 27'Class'
     A                                  1 38'Shift'
     A                                  3 10'FI LAST NAME'
     A                                  3 30'MON  TUES WED  THUR FRI  SAT  SUN'
     A            X              2A  B  1 10DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  1 20DSPATR(PR)
     A                                      OVRDTA
     A            CL             2A  B  1 33DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B  1 44DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  4 10DSPATR(PR)
     A                                      OVRDTA
     A            ANAME         15A  B  4 13DSPATR(PR)
     A                                      OVRDTA
     A            A1             2A  B  4 31DSPATR(PR)
     A                                      OVRDTA
     A            A2             2Y 0B  4 36DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08
     AO 97 96                               DSPATR(PC)
     A            A3             2A  B  4 41DSPATR(PR)
     A                                      OVRDTA
     A            A4             2A  B  4 46DSPATR(PR)
     A                                      OVRDTA
     A            A5             2A  B  4 51DSPATR(PR)
     A                                      OVRDTA
     A            A6             2A  B  4 56DSPATR(PR)
     A                                      OVRDTA
     A            A7             2A  B  4 61DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B  6 10DSPATR(PR)
     A                                      OVRDTA
     A            BNAME         15A  B  6 13DSPATR(PR)
     A                                      OVRDTA
     A            B1             2A  B  6 31DSPATR(PR)
     A                                      OVRDTA
     A            B2             2Y 0B  6 36DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            B3             2A  B  6 41DSPATR(PR)
     A                                      OVRDTA
     A            B4             2A  B  6 46DSPATR(PR)
     A                                      OVRDTA
     A            B5             2A  B  6 51DSPATR(PR)
     A                                      OVRDTA
     A            B6             2A  B  6 56DSPATR(PR)
     A                                      OVRDTA
     A            B7             2A  B  6 61DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  8 10DSPATR(PR)
     A                                      OVRDTA
     A            CNAME         15A  B  8 13DSPATR(PR)
     A                                      OVRDTA
     A            C1             2A  B  8 31DSPATR(PR)
     A                                      OVRDTA
     A            C2             2Y 0B  8 36DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            C3             2A  B  8 41DSPATR(PR)
     A                                      OVRDTA
     A            C4             2A  B  8 46DSPATR(PR)
     A                                      OVRDTA
     A            C5             2A  B  8 51DSPATR(PR)
     A                                      OVRDTA
     A            C6             2A  B  8 56DSPATR(PR)
     A                                      OVRDTA
     A            C7             2A  B  8 61DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 10 10DSPATR(PR)
     A                                      OVRDTA
     A            DNAME         15A  B 10 13DSPATR(PR)
     A                                      OVRDTA
     A            D1             2A  B 10 31DSPATR(PR)
     A                                      OVRDTA
     A            D2             2Y 0B 10 36DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            D3             2A  B 10 41DSPATR(PR)
     A                                      OVRDTA
     A            D4             2A  B 10 46DSPATR(PR)
     A                                      OVRDTA
     A            D5             2A  B 10 51DSPATR(PR)
     A                                      OVRDTA
     A            D6             2A  B 10 56DSPATR(PR)
     A                                      OVRDTA
     A            D7             2A  B 10 61DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 12 10DSPATR(PR)
     A                                      OVRDTA
     A            ENAME         15A  B 12 13DSPATR(PR)
     A                                      OVRDTA
     A            E1             2A  B 12 31DSPATR(PR)
     A                                      OVRDTA
     A            E2             2Y 0B 12 36DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A            E3             2A  B 12 41DSPATR(PR)
     A                                      OVRDTA
     A            E4             2A  B 12 46DSPATR(PR)
     A                                      OVRDTA
     A            E5             2A  B 12 51DSPATR(PR)
     A                                      OVRDTA
     A            E6             2A  B 12 56DSPATR(PR)
     A                                      OVRDTA
     A            E7             2A  B 12 61DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 14 10DSPATR(PR)
     A                                      OVRDTA
     A            FNAME         15A  B 14 13DSPATR(PR)
     A                                      OVRDTA
     A            F1             2A  B 14 31DSPATR(PR)
     A                                      OVRDTA
     A            F2             2Y 0B 14 36DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A            F3             2A  B 14 41DSPATR(PR)
     A                                      OVRDTA
     A            F4             2A  B 14 46DSPATR(PR)
     A                                      OVRDTA
     A            F5             2A  B 14 51DSPATR(PR)
     A                                      OVRDTA
     A            F6             2A  B 14 56DSPATR(PR)
     A                                      OVRDTA
     A            F7             2A  B 14 61DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 16 10DSPATR(PR)
     A                                      OVRDTA
     A            GNAME         15A  B 16 13DSPATR(PR)
     A                                      OVRDTA
     A            G1             2A  B 16 31DSPATR(PR)
     A                                      OVRDTA
     A            G2             2Y 0B 16 36DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A            G3             2A  B 16 41DSPATR(PR)
     A                                      OVRDTA
     A            G4             2A  B 16 46DSPATR(PR)
     A                                      OVRDTA
     A            G5             2A  B 16 51DSPATR(PR)
     A                                      OVRDTA
     A            G6             2A  B 16 56DSPATR(PR)
     A                                      OVRDTA
     A            G7             2A  B 16 61DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 18 10DSPATR(PR)
     A                                      OVRDTA
     A            HNAME         15A  B 18 13DSPATR(PR)
     A                                      OVRDTA
     A            H1             2A  B 18 31DSPATR(PR)
     A                                      OVRDTA
     A            H2             2Y 0B 18 36DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  71                                  DSPATR(RI)
     A  71                                  DSPATR(PC)
     A            H3             2A  B 18 41DSPATR(PR)
     A                                      OVRDTA
     A            H4             2A  B 18 46DSPATR(PR)
     A                                      OVRDTA
     A            H5             2A  B 18 51DSPATR(PR)
     A                                      OVRDTA
     A            H6             2A  B 18 56DSPATR(PR)
     A                                      OVRDTA
     A            H7             2A  B 18 61DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 20 10DSPATR(PR)
     A                                      OVRDTA
     A            INAME         15A  B 20 13DSPATR(PR)
     A                                      OVRDTA
     A            I1             2A  B 20 31DSPATR(PR)
     A                                      OVRDTA
     A            I2             2Y 0B 20 36DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(RI)
     A  80                                  DSPATR(PC)
     A            I3             2A  B 20 41DSPATR(PR)
     A                                      OVRDTA
     A            I4             2A  B 20 46DSPATR(PR)
     A                                      OVRDTA
     A            I5             2A  B 20 51DSPATR(PR)
     A                                      OVRDTA
     A            I6             2A  B 20 56DSPATR(PR)
     A                                      OVRDTA
     A            I7             2A  B 20 61DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R TUE_MAN
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  1'Division'
     A                                  2 15'Dept'
     A                                  2 27'Class'
     A                                  2 38'Shift'
     A                                  4  1'FI LAST NAME'
     A                                  4 29'MON  TUES WED  THUR FRI  SAT  SUN'
     A                                  5 20'WORKED'
     A                                  6 20'REFUSED'
     A                                  8 20'WORKED'
     A                                  9 20'REFUSED'
     A                                 11 20'WORKED'
     A                                 12 20'REFUSED'
     A                                 14 20'WORKED'
     A                                 15 20'REFUSED'
     A                                 17 20'WORKED'
     A                                 18 20'REFUSED'
     A                                 20 20'WORKED'
     A                                 21 20'REFUSED'
     A            X              2A  B  2 10DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  2 20DSPATR(PR)
     A                                      OVRDTA
     A            CL             2A  B  2 33DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B  2 44DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            ANAME         15A  B  5  4DSPATR(PR)
     A                                      OVRDTA
     A            A1             2A  B  5 30DSPATR(PR)
     A                                      OVRDTA
     A            A2             2Y 0B  5 35DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 08                               DSPATR(RI)
     A N97 08                               DSPATR(PC)
     A            A3             2A  B  5 40DSPATR(PR)
     A                                      OVRDTA
     A            A4             2A  B  5 45DSPATR(PR)
     A                                      OVRDTA
     A            A5             2A  B  5 50DSPATR(PR)
     A                                      OVRDTA
     A            A6             2A  B  5 55DSPATR(PR)
     A                                      OVRDTA
     A            A7             2A  B  5 60DSPATR(PR)
     A                                      OVRDTA
     A            B1             2A  B  6 30DSPATR(PR)
     A                                      OVRDTA
     A            B2             2Y 0B  6 35DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 17                               DSPATR(RI)
     A N97 17                               DSPATR(PC)
     A            B3             2A  B  6 40DSPATR(PR)
     A                                      OVRDTA
     A            B4             2A  B  6 45DSPATR(PR)
     A                                      OVRDTA
     A            B5             2A  B  6 50DSPATR(PR)
     A                                      OVRDTA
     A            B6             2A  B  6 55DSPATR(PR)
     A                                      OVRDTA
     A            B7             2A  B  6 60DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            CNAME         15A  B  8  4DSPATR(PR)
     A                                      OVRDTA
     A            C1             2A  B  8 30DSPATR(PR)
     A                                      OVRDTA
     A            C2             2Y 0B  8 35DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 26                               DSPATR(RI)
     A N97 26                               DSPATR(PC)
     A            C3             2A  B  8 40DSPATR(PR)
     A                                      OVRDTA
     A            C4             2A  B  8 45DSPATR(PR)
     A                                      OVRDTA
     A            C5             2A  B  8 50DSPATR(PR)
     A                                      OVRDTA
     A            C6             2A  B  8 55DSPATR(PR)
     A                                      OVRDTA
     A            C7             2A  B  8 60DSPATR(PR)
     A                                      OVRDTA
     A            D1             2A  B  9 30DSPATR(PR)
     A                                      OVRDTA
     A            D2             2Y 0B  9 35DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 35                               DSPATR(RI)
     A N97 35                               DSPATR(PC)
     A            D3             2A  B  9 40DSPATR(PR)
     A                                      OVRDTA
     A            D4             2A  B  9 45DSPATR(PR)
     A                                      OVRDTA
     A            D5             2A  B  9 50DSPATR(PR)
     A                                      OVRDTA
     A            D6             2A  B  9 55DSPATR(PR)
     A                                      OVRDTA
     A            D7             2A  B  9 60DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            ENAME         15A  B 11  4DSPATR(PR)
     A                                      OVRDTA
     A            E1             2A  B 11 30DSPATR(PR)
     A                                      OVRDTA
     A            E2             2Y 0B 11 35DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 44                               DSPATR(RI)
     A N97 44                               DSPATR(PC)
     A            E3             2A  B 11 40DSPATR(PR)
     A                                      OVRDTA
     A            E4             2A  B 11 45DSPATR(PR)
     A                                      OVRDTA
     A            E5             2A  B 11 50DSPATR(PR)
     A                                      OVRDTA
     A            E6             2A  B 11 55DSPATR(PR)
     A                                      OVRDTA
     A            E7             2A  B 11 60DSPATR(PR)
     A                                      OVRDTA
     A            F1             2A  B 12 30DSPATR(PR)
     A                                      OVRDTA
     A            F2             2Y 0B 12 35DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 53                               DSPATR(RI)
     A N97 53                               DSPATR(PC)
     A            F3             2A  B 12 40DSPATR(PR)
     A                                      OVRDTA
     A            F4             2A  B 12 45DSPATR(PR)
     A                                      OVRDTA
     A            F5             2A  B 12 50DSPATR(PR)
     A                                      OVRDTA
     A            F6             2A  B 12 55DSPATR(PR)
     A                                      OVRDTA
     A            F7             2A  B 12 60DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            GNAME         15A  B 14  4DSPATR(PR)
     A                                      OVRDTA
     A            G1             2A  B 14 30DSPATR(PR)
     A                                      OVRDTA
     A            G2             2Y 0B 14 35DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 62                               DSPATR(RI)
     A N97 62                               DSPATR(PC)
     A            G3             2A  B 14 40DSPATR(PR)
     A                                      OVRDTA
     A            G4             2A  B 14 45DSPATR(PR)
     A                                      OVRDTA
     A            G5             2A  B 14 50DSPATR(PR)
     A                                      OVRDTA
     A            G6             2A  B 14 55DSPATR(PR)
     A                                      OVRDTA
     A            G7             2A  B 14 60DSPATR(PR)
     A                                      OVRDTA
     A            H1             2A  B 15 30DSPATR(PR)
     A                                      OVRDTA
     A            H2             2Y 0B 15 35DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 71                               DSPATR(RI)
     A N97 71                               DSPATR(PC)
     A            H3             2A  B 15 40DSPATR(PR)
     A                                      OVRDTA
     A            H4             2A  B 15 45DSPATR(PR)
     A                                      OVRDTA
     A            H5             2A  B 15 50DSPATR(PR)
     A                                      OVRDTA
     A            H6             2A  B 15 55DSPATR(PR)
     A                                      OVRDTA
     A            H7             2A  B 15 60DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            INAME         15A  B 17  4DSPATR(PR)
     A                                      OVRDTA
     A            I1             2A  B 17 30DSPATR(PR)
     A                                      OVRDTA
     A            I2             2Y 0B 17 35DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 80                               DSPATR(RI)
     A N97 80                               DSPATR(PC)
     A            I3             2A  B 17 40DSPATR(PR)
     A                                      OVRDTA
     A            I4             2A  B 17 45DSPATR(PR)
     A                                      OVRDTA
     A            I5             2A  B 17 50DSPATR(PR)
     A                                      OVRDTA
     A            I6             2A  B 17 55DSPATR(PR)
     A                                      OVRDTA
     A            I7             2A  B 17 60DSPATR(PR)
     A                                      OVRDTA
     A            J1             2A  B 18 30DSPATR(PR)
     A                                      OVRDTA
     A            J2             2Y 0B 18 35DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 89                               DSPATR(RI)
     A N97 89                               DSPATR(PC)
     A            J3             2A  B 18 40DSPATR(PR)
     A                                      OVRDTA
     A            J4             2A  B 18 45DSPATR(PR)
     A                                      OVRDTA
     A            J5             2A  B 18 50DSPATR(PR)
     A                                      OVRDTA
     A            J6             2A  B 18 55DSPATR(PR)
     A                                      OVRDTA
     A            J7             2A  B 18 60DSPATR(PR)
     A                                      OVRDTA
     A            K              1A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            KNAME         15A  B 20  4DSPATR(PR)
     A                                      OVRDTA
     A            K1             2A  B 20 30DSPATR(PR)
     A                                      OVRDTA
     A            K2             2Y 0B 20 35DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 02                               DSPATR(RI)
     A  97 02                               DSPATR(PC)
     A            K3             2A  B 20 40DSPATR(PR)
     A                                      OVRDTA
     A            K4             2A  B 20 45DSPATR(PR)
     A                                      OVRDTA
     A            K5             2A  B 20 50DSPATR(PR)
     A                                      OVRDTA
     A            K6             2A  B 20 55DSPATR(PR)
     A                                      OVRDTA
     A            K7             2A  B 20 60DSPATR(PR)
     A                                      OVRDTA
     A            L1             2A  B 21 30DSPATR(PR)
     A                                      OVRDTA
     A            L2             2Y 0B 21 35DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 11                               DSPATR(RI)
     A  97 11                               DSPATR(PC)
     A            L3             2A  B 21 40DSPATR(PR)
     A                                      OVRDTA
     A            L4             2A  B 21 45DSPATR(PR)
     A                                      OVRDTA
     A            L5             2A  B 21 50DSPATR(PR)
     A                                      OVRDTA
     A            L6             2A  B 21 55DSPATR(PR)
     A                                      OVRDTA
     A            L7             2A  B 21 60DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R USER_FORM_
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 30'ASSIGN USER ACCESS'
     A                                  3  7'Place an X in each box that you wa-
     A                                      nt'
     A                                  3 53'to be able to access.'
     A                                  5  1'EMPLOYEE RECORDS  '
     A                                  5 26'Allows ADD, DELETE, EDIT and ENTER'
     A                                  5 61'TOTAL HOURS.'
     A                                  6  1'VOLUNTEER STATUS  '
     A                                  7  1'ENTER HOURS  '
     A                                  7 20'Allows manual mode only for regula-
     A                                      r hours and overtime.'
     A                                  8  6'AUTOMATIC MODE  '
     A                                  9  6'FINISH HOURS    '
     A                                 11  1'VIEW HOURS  '
     A                                 13  1'OFFER WORK BY HOURS  '
     A                                 14  6'PRINT OFFER WORK FOR GROUP     '
     A                                 15  6'PRINT OFFER WORK FOR DIVISION  '
     A                                 17  1'MANAGEMENT ROUTINES  '
     A                                 17 30'Allows all print menu functions.'
     A                                 18  6'RESET WEEKLY HOURS'
     A                                 19  6'RESET TOTAL HOURS'
     A                                 20  6'CHANGE WEEK ENDING DATE  '
     A                                 21  6'SET COLLATE VALUES'
     A                                 22  6'SET USER ACCESS'
     A            USERNAME       8A  B  3 44DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  5 20DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02
     AO 97 96                               DSPATR(PC)
     A            O              1A  B  6 20DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            B              1A  B  7 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            C              1A  B  8 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            D              1A  B  9 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            E              1A  B 11 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            F              1A  B 13 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            G              1A  B 14 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            H              1A  B 15 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            I              1A  B 17 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            J              1A  B 18 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            K              1A  B 19 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            L              1A  B 20 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            M              1A  B 21 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            N              1A  B 22 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-ADD NEW USER f7-MGMT MEN-
     A                                      U f3-MAIN MENU                     -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R USERFORM2
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 30'ASSIGN USER ACCESS'
     A                                  3  7'Place an X in each box that you wa-
     A                                      nt'
     A                                  3 53'to be able to access.'
     A                                  5  1'EMPLOYEE RECORDS  '
     A                                  5 26'Allows ADD, DELETE, EDIT and ENTER'
     A                                  5 61'TOTAL HOURS.'
     A                                  6  1'VOLUNTEER STATUS  '
     A                                  7  1'ENTER HOURS  '
     A                                  7 20'Allows manual mode only for regula-
     A                                      r hours and overtime.'
     A                                  8  6'AUTOMATIC MODE  '
     A                                  9  6'FINISH HOURS    '
     A                                 11  1'VIEW HOURS  '
     A                                 13  1'OFFER WORK BY HOURS  '
     A                                 14  6'PRINT OFFER WORK FOR GROUP     '
     A                                 15  6'PRINT OFFER WORK FOR DIVISION  '
     A                                 17  1'MANAGEMENT ROUTINES  '
     A                                 17 30'Allows all print menu functions.'
     A                                 18  6'RESET WEEKLY HOURS'
     A                                 19  6'RESET TOTAL HOURS'
     A                                 20  6'CHANGE WEEK ENDING DATE  '
     A                                 21  6'SET COLLATE VALUES'
     A                                 22  6'SET USER ACCESS'
     A            USERNAME       8A  B  3 44DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  5 20DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02
     AO 97 96                               DSPATR(PC)
     A            O              1A  B  6 20DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            B              1A  B  7 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            C              1A  B  8 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            D              1A  B  9 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            E              1A  B 11 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            F              1A  B 13 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            G              1A  B 14 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            H              1A  B 15 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            I              1A  B 17 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            J              1A  B 18 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            K              1A  B 19 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            L              1A  B 20 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            M              1A  B 21 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            N              1A  B 22 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f8-MODIFY ACCESS f7-MGMT ME-
     A                                      NU f3-MAIN MENU                    -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R USER_MENU
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 29'ASSIGN USERS ACCESS'
     A                                  4  6'This routine allows you to control'
     A                                  4 41'which functions of the balance of'
     A                                  5  1'hours program that another user in'
     A                                  5 36'your division may have access to.'
     A                                  5 71'First'
     A                                  6  1'you should contact the data proces-
     A                                      sing center manager and establish'
     A                                  6 69'a new'
     A                                  7  1'"username" then type that username'
     A                                  7 36'in the space below and press f1 to'
     A                                  7 71'add'
     A                                  8  1'the new user to the file.  You wil-
     A                                      l then be presented with a screen'
     A                                  8 69'to allow'
     A                                  9  1'you to choose which functions you'
     A                                  9 35'want that user to be able to acces-
     A                                      s.'
     A                                 16 28'USERNAME'
     A            USERNAME       8A  B 16 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-ADD NEW USER f2-DELETE U-
     A                                      SER f8-MODIFY ACCESS f7-MGMT MENU f-
     A                                      3-MAIN MENU      ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VIEW_HRS_1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 30'VIEW EMPLOYEE HOURS'
     A                                  3  6'Enter department, shift and classi-
     A                                      fication numbers to begin at a give-
     A                                      n'
     A                                  4  6'workgroup file; or leave blank and'
     A                                  4 41'the program will step through the'
     A                                  5  6'entire department.  Press ENTER wh-
     A                                      en ready.'
     A                                  9 21'DEPT'
     A                                  9 34'CLASS'
     A                                  9 46'SHIFT'
     A            DEPT           4Y 0B  9 27DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            CL             2Y 0B  9 41DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            S              1A  B  9 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-MAIN MENU               -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VIEW_HRS_3
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 35'VIEW HOURS'
     A                                  7 19'MON TUE WED THU FRI SAT SUN  TOTAL'
     A                                  7 56'REG  DOT  SAT SUN HOL'
     A                                  8  4'Regular Work'
     A                                  8 49'AVAIL.'
     A                                  9 12'Ref.'
     A                                  9 48'REFUSED'
     A                                 10  4'Overtime Work'
     A                                 11 13'Ref.'
     A                                 16 19'MON TUE WED THU FRI SAT SUN  TOTAL'
     A                                 16 56'REG  DOT  SAT SUN HOL'
     A                                 17  4'Regular Work'
     A                                 17 49'AVAIL.'
     A                                 18 12'Ref.'
     A                                 18 48'REFUSED'
     A                                 19  4'Overtime Work'
     A                                 20 13'Ref.'
     A            LASTNAME      15A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  5 17DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B  5 19DSPATR(PR)
     A                                      OVRDTA
     A            ADIV           4A  B  5 23DSPATR(PR)
     A                                      OVRDTA
     A            DD             2A  B  5 29DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  5 33DSPATR(PR)
     A                                      OVRDTA
     A            A1             2A  B  8 20DSPATR(PR)
     A                                      OVRDTA
     A            A2             2A  B  8 24DSPATR(PR)
     A                                      OVRDTA
     A            A3             2A  B  8 28DSPATR(PR)
     A                                      OVRDTA
     A            A4             2A  B  8 32DSPATR(PR)
     A                                      OVRDTA
     A            A5             2A  B  8 36DSPATR(PR)
     A                                      OVRDTA
     A            A6             2A  B  8 40DSPATR(PR)
     A                                      OVRDTA
     A            A7             2A  B  8 44DSPATR(PR)
     A                                      OVRDTA
     A            AREG           4A  B  8 56DSPATR(PR)
     A                                      OVRDTA
     A            ADOT           4A  B  8 61DSPATR(PR)
     A                                      OVRDTA
     A            ASA            3A  B  8 66DSPATR(PR)
     A                                      OVRDTA
     A            ASU            3A  B  8 70DSPATR(PR)
     A                                      OVRDTA
     A            AHO            3A  B  8 74DSPATR(PR)
     A                                      OVRDTA
     A            B1             2A  B  9 20DSPATR(PR)
     A                                      OVRDTA
     A            B2             2A  B  9 24DSPATR(PR)
     A                                      OVRDTA
     A            B3             2A  B  9 28DSPATR(PR)
     A                                      OVRDTA
     A            B4             2A  B  9 32DSPATR(PR)
     A                                      OVRDTA
     A            B5             2A  B  9 36DSPATR(PR)
     A                                      OVRDTA
     A            B6             2A  B  9 40DSPATR(PR)
     A                                      OVRDTA
     A            B7             2A  B  9 44DSPATR(PR)
     A                                      OVRDTA
     A            BREG           4A  B  9 56DSPATR(PR)
     A                                      OVRDTA
     A            BDOT           4A  B  9 61DSPATR(PR)
     A                                      OVRDTA
     A            BSA            3A  B  9 66DSPATR(PR)
     A                                      OVRDTA
     A            BSU            3A  B  9 70DSPATR(PR)
     A                                      OVRDTA
     A            BHO            3A  B  9 74DSPATR(PR)
     A                                      OVRDTA
     A            C1             2A  B 10 20DSPATR(PR)
     A                                      OVRDTA
     A            C2             2A  B 10 24DSPATR(PR)
     A                                      OVRDTA
     A            C3             2A  B 10 28DSPATR(PR)
     A                                      OVRDTA
     A            C4             2A  B 10 32DSPATR(PR)
     A                                      OVRDTA
     A            C5             2A  B 10 36DSPATR(PR)
     A                                      OVRDTA
     A            C6             2A  B 10 40DSPATR(PR)
     A                                      OVRDTA
     A            C7             2A  B 10 44DSPATR(PR)
     A                                      OVRDTA
     A            D1             2A  B 11 20DSPATR(PR)
     A                                      OVRDTA
     A            D2             2A  B 11 24DSPATR(PR)
     A                                      OVRDTA
     A            D3             2A  B 11 28DSPATR(PR)
     A                                      OVRDTA
     A            D4             2A  B 11 32DSPATR(PR)
     A                                      OVRDTA
     A            D5             2A  B 11 36DSPATR(PR)
     A                                      OVRDTA
     A            D6             2A  B 11 40DSPATR(PR)
     A                                      OVRDTA
     A            D7             2A  B 11 44DSPATR(PR)
     A                                      OVRDTA
     A            BLASTNAME     15A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 14 17DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 14 19DSPATR(PR)
     A                                      OVRDTA
     A            BDIV           4A  B 14 22DSPATR(PR)
     A                                      OVRDTA
     A            EE             2A  B 14 29DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 14 33DSPATR(PR)
     A                                      OVRDTA
     A            E1             2A  B 17 20DSPATR(PR)
     A                                      OVRDTA
     A            E2             2A  B 17 24DSPATR(PR)
     A                                      OVRDTA
     A            E3             2A  B 17 28DSPATR(PR)
     A                                      OVRDTA
     A            E4             2A  B 17 32DSPATR(PR)
     A                                      OVRDTA
     A            E5             2A  B 17 36DSPATR(PR)
     A                                      OVRDTA
     A            E6             2A  B 17 40DSPATR(PR)
     A                                      OVRDTA
     A            E7             2A  B 17 44DSPATR(PR)
     A                                      OVRDTA
     A            EREG           4A  B 17 56DSPATR(PR)
     A                                      OVRDTA
     A            EDOT           4A  B 17 61DSPATR(PR)
     A                                      OVRDTA
     A            ESA            3A  B 17 66DSPATR(PR)
     A                                      OVRDTA
     A            ESU            3A  B 17 70DSPATR(PR)
     A                                      OVRDTA
     A            EHO            3A  B 17 74DSPATR(PR)
     A                                      OVRDTA
     A            F1             2A  B 18 20DSPATR(PR)
     A                                      OVRDTA
     A            F2             2A  B 18 24DSPATR(PR)
     A                                      OVRDTA
     A            F3             2A  B 18 28DSPATR(PR)
     A                                      OVRDTA
     A            F4             2A  B 18 32DSPATR(PR)
     A                                      OVRDTA
     A            F5             2A  B 18 36DSPATR(PR)
     A                                      OVRDTA
     A            F6             2A  B 18 40DSPATR(PR)
     A                                      OVRDTA
     A            F7             2A  B 18 44DSPATR(PR)
     A                                      OVRDTA
     A            FREG           4A  B 18 56DSPATR(PR)
     A                                      OVRDTA
     A            FDOT           4A  B 18 61DSPATR(PR)
     A                                      OVRDTA
     A            FSA            3A  B 18 66DSPATR(PR)
     A                                      OVRDTA
     A            FSU            3A  B 18 70DSPATR(PR)
     A                                      OVRDTA
     A            FHO            3A  B 18 74DSPATR(PR)
     A                                      OVRDTA
     A            G1             2A  B 19 20DSPATR(PR)
     A                                      OVRDTA
     A            G2             2A  B 19 24DSPATR(PR)
     A                                      OVRDTA
     A            G3             2A  B 19 28DSPATR(PR)
     A                                      OVRDTA
     A            G4             2A  B 19 32DSPATR(PR)
     A                                      OVRDTA
     A            G5             2A  B 19 36DSPATR(PR)
     A                                      OVRDTA
     A            G6             2A  B 19 40DSPATR(PR)
     A                                      OVRDTA
     A            G7             2A  B 19 44DSPATR(PR)
     A                                      OVRDTA
     A            H1             2A  B 20 20DSPATR(PR)
     A                                      OVRDTA
     A            H2             2A  B 20 24DSPATR(PR)
     A                                      OVRDTA
     A            H3             2A  B 20 28DSPATR(PR)
     A                                      OVRDTA
     A            H4             2A  B 20 32DSPATR(PR)
     A                                      OVRDTA
     A            H5             2A  B 20 36DSPATR(PR)
     A                                      OVRDTA
     A            H6             2A  B 20 40DSPATR(PR)
     A                                      OVRDTA
     A            H7             2A  B 20 44DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f5-PREV GROUP f6-NEXT RECOR-
     A                                      D f7-NEW GROUP f3-MAIN MENU        -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VOL_ENTRY
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 30'VOLUNTEER STATUS FOR'
     A                                  2 14'Place an X in the box for each vol-
     A                                      unteer then press ENTER.'
     A                                  4 28'DEPT'
     A                                  4 39'CLASS'
     A                                  4 49'SHIFT'
     A                                  6 31'VOL FOR'
     A                                  7 40'NAME'
     A                                  8  1'---------------------------     '
     A                                  9  1')  For Radial Truck'
     A                                  9 27'¦     '
     A                                 10  1')   Operations the'
     A                                 10 27'¦     '
     A                                 11  1')  following terms apply: ¦     '
     A                                 12  1')'
     A                                 12 27'¦     '
     A                                 13  1')    DOT = Over or In     ¦     '
     A                                 14  1')    SAT = Days Off'
     A                                 14 27'¦     '
     A                                 15  1')    SUN = 1st Shift Sun  ¦     '
     A                                 16  1')    HOL = Holiday'
     A                                 16 27'¦     '
     A                                 17  1'---------------------------     '
     A            TYPE           5A  B  1 51DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  4 33DSPATR(PR)
     A                                      OVRDTA
     A            CL             2A  B  4 45DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B  4 55DSPATR(PR)
     A                                      OVRDTA
     A            BTYPE          5A  B  7 32DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  8 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06
     AO 97 96                               DSPATR(PC)
     A            ANAME         19A  B  8 40DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B  9 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            BNAME         19A  B  9 40DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 10 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            CNAME         19A  B 10 40DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 11 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            DNAME         19A  B 11 40DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 12 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            ENAME         19A  B 12 40DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 13 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            FNAME         19A  B 13 40DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 14 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            GNAME         19A  B 14 40DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 15 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            HNAME         19A  B 15 40DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 16 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            INAME         19A  B 16 40DSPATR(PR)
     A                                      OVRDTA
     A            J              1A  B 17 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            JNAME         19A  B 17 40DSPATR(PR)
     A                                      OVRDTA
     A            K              1A  B 18 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            KNAME         19A  B 18 40DSPATR(PR)
     A                                      OVRDTA
     A            L              1A  B 19 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            LNAME         19A  B 19 40DSPATR(PR)
     A                                      OVRDTA
     A            M              1A  B 20 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            MNAME         19A  B 20 40DSPATR(PR)
     A                                      OVRDTA
     A            N              1A  B 21 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            NNAME         19A  B 21 40DSPATR(PR)
     A                                      OVRDTA
     A            O              1A  B 22 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            ONAME         19A  B 22 40DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-TOGGLE TYPE f6-NEXT GROU-
     A                                      P f7-NEW GROUP f3-MAIN MENU        -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VOL_MENU
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 30'VOLUNTEER STATUS'
     A                                  5  1'Use f1 to toggle between types of'
     A                                  5 35'volunteer status (ie. DOT, SAT, SU-
     A                                      N or HOL).'
     A                                  7  1'Use f4 to reset status of all empl-
     A                                      oyees to non-volunteer for the type-
     A                                       of'
     A                                  8  1'volunteer status currently being d-
     A                                      isplayed.'
     A                                 10  1'You may enter a department, classi-
     A                                      fication and shift to start at a pa-
     A                                      rticular'
     A                                 11  1'work group or leave them blank to'
     A                                 11 35'start at the beginning of your div-
     A                                      ision'
     A                                 12  1'file.  Press f6 to see employee"s'
     A                                 12 35'names and volunteer status.  To ch-
     A                                      ange an'
     A                                 13  1'employee"s status, place an X in t-
     A                                      he box if they are a volunteer or'
     A                                 13 69'leave it'
     A                                 14  1'blank if they are not a volunteer,'
     A                                 14 36'then press ENTER.  Only the ENTER'
     A                                 14 70'key on'
     A                                 15  1'the form screen will affect a chan-
     A                                      ge. Use f1 to change the type of st-
     A                                      atus,'
     A                                 16  1'f6 to see the next workgroup, f7 t-
     A                                      o come back to this screen or f3 to-
     A                                       go to'
     A                                 17  1'the Main Menu.'
     A                                 20 27'VOLUNTEER STATUS FOR'
     A                                 22 26'DEPT'
     A                                 22 37'CLASS'
     A                                 22 47'SHIFT'
     A            TYPE           5A  B 20 48DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4Y 0B 22 31DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02
     AO 97 96                               DSPATR(PC)
     A            CL             2Y 0B 22 43DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            S              1A  B 22 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-TOGGLE TYPE f4-RESET STA-
     A                                      TUS f6-VIEW STATUS f3-MAIN MENU    -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R WED_HRS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'Divisio'
     A                                  1 15'Dept'
     A                                  1 27'Class'
     A                                  1 38'Shift'
     A                                  3 10'FI LAST NAME'
     A                                  3 30'MON  TUES WED  THUR FRI  SAT  SUN'
     A            X              2A  B  1 10DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  1 20DSPATR(PR)
     A                                      OVRDTA
     A            CL             2A  B  1 33DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B  1 44DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  4 10DSPATR(PR)
     A                                      OVRDTA
     A            ANAME         15A  B  4 13DSPATR(PR)
     A                                      OVRDTA
     A            A1             2A  B  4 31DSPATR(PR)
     A                                      OVRDTA
     A            A2             2A  B  4 36DSPATR(PR)
     A                                      OVRDTA
     A            A3             2Y 0B  4 41DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09
     AO 97 96                               DSPATR(PC)
     A            A4             2A  B  4 46DSPATR(PR)
     A                                      OVRDTA
     A            A5             2A  B  4 51DSPATR(PR)
     A                                      OVRDTA
     A            A6             2A  B  4 56DSPATR(PR)
     A                                      OVRDTA
     A            A7             2A  B  4 61DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B  6 10DSPATR(PR)
     A                                      OVRDTA
     A            BNAME         15A  B  6 13DSPATR(PR)
     A                                      OVRDTA
     A            B1             2A  B  6 31DSPATR(PR)
     A                                      OVRDTA
     A            B2             2A  B  6 36DSPATR(PR)
     A                                      OVRDTA
     A            B3             2Y 0B  6 41DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            B4             2A  B  6 46DSPATR(PR)
     A                                      OVRDTA
     A            B5             2A  B  6 51DSPATR(PR)
     A                                      OVRDTA
     A            B6             2A  B  6 56DSPATR(PR)
     A                                      OVRDTA
     A            B7             2A  B  6 61DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  8 10DSPATR(PR)
     A                                      OVRDTA
     A            CNAME         15A  B  8 13DSPATR(PR)
     A                                      OVRDTA
     A            C1             2A  B  8 31DSPATR(PR)
     A                                      OVRDTA
     A            C2             2A  B  8 36DSPATR(PR)
     A                                      OVRDTA
     A            C3             2Y 0B  8 41DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            C4             2A  B  8 46DSPATR(PR)
     A                                      OVRDTA
     A            C5             2A  B  8 51DSPATR(PR)
     A                                      OVRDTA
     A            C6             2A  B  8 56DSPATR(PR)
     A                                      OVRDTA
     A            C7             2A  B  8 61DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 10 10DSPATR(PR)
     A                                      OVRDTA
     A            DNAME         15A  B 10 13DSPATR(PR)
     A                                      OVRDTA
     A            D1             2A  B 10 31DSPATR(PR)
     A                                      OVRDTA
     A            D2             2A  B 10 36DSPATR(PR)
     A                                      OVRDTA
     A            D3             2Y 0B 10 41DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            D4             2A  B 10 46DSPATR(PR)
     A                                      OVRDTA
     A            D5             2A  B 10 51DSPATR(PR)
     A                                      OVRDTA
     A            D6             2A  B 10 56DSPATR(PR)
     A                                      OVRDTA
     A            D7             2A  B 10 61DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 12 10DSPATR(PR)
     A                                      OVRDTA
     A            ENAME         15A  B 12 13DSPATR(PR)
     A                                      OVRDTA
     A            E1             2A  B 12 31DSPATR(PR)
     A                                      OVRDTA
     A            E2             2A  B 12 36DSPATR(PR)
     A                                      OVRDTA
     A            E3             2Y 0B 12 41DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A            E4             2A  B 12 46DSPATR(PR)
     A                                      OVRDTA
     A            E5             2A  B 12 51DSPATR(PR)
     A                                      OVRDTA
     A            E6             2A  B 12 56DSPATR(PR)
     A                                      OVRDTA
     A            E7             2A  B 12 61DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 14 10DSPATR(PR)
     A                                      OVRDTA
     A            FNAME         15A  B 14 13DSPATR(PR)
     A                                      OVRDTA
     A            F1             2A  B 14 31DSPATR(PR)
     A                                      OVRDTA
     A            F2             2A  B 14 36DSPATR(PR)
     A                                      OVRDTA
     A            F3             2Y 0B 14 41DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  54                                  DSPATR(RI)
     A  54                                  DSPATR(PC)
     A            F4             2A  B 14 46DSPATR(PR)
     A                                      OVRDTA
     A            F5             2A  B 14 51DSPATR(PR)
     A                                      OVRDTA
     A            F6             2A  B 14 56DSPATR(PR)
     A                                      OVRDTA
     A            F7             2A  B 14 61DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 16 10DSPATR(PR)
     A                                      OVRDTA
     A            GNAME         15A  B 16 13DSPATR(PR)
     A                                      OVRDTA
     A            G1             2A  B 16 31DSPATR(PR)
     A                                      OVRDTA
     A            G2             2A  B 16 36DSPATR(PR)
     A                                      OVRDTA
     A            G3             2Y 0B 16 41DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            G4             2A  B 16 46DSPATR(PR)
     A                                      OVRDTA
     A            G5             2A  B 16 51DSPATR(PR)
     A                                      OVRDTA
     A            G6             2A  B 16 56DSPATR(PR)
     A                                      OVRDTA
     A            G7             2A  B 16 61DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 18 10DSPATR(PR)
     A                                      OVRDTA
     A            HNAME         15A  B 18 13DSPATR(PR)
     A                                      OVRDTA
     A            H1             2A  B 18 31DSPATR(PR)
     A                                      OVRDTA
     A            H2             2A  B 18 36DSPATR(PR)
     A                                      OVRDTA
     A            H3             2Y 0B 18 41DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  72                                  DSPATR(RI)
     A  72                                  DSPATR(PC)
     A            H4             2A  B 18 46DSPATR(PR)
     A                                      OVRDTA
     A            H5             2A  B 18 51DSPATR(PR)
     A                                      OVRDTA
     A            H6             2A  B 18 56DSPATR(PR)
     A                                      OVRDTA
     A            H7             2A  B 18 61DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 20 10DSPATR(PR)
     A                                      OVRDTA
     A            INAME         15A  B 20 13DSPATR(PR)
     A                                      OVRDTA
     A            I1             2A  B 20 31DSPATR(PR)
     A                                      OVRDTA
     A            I2             2A  B 20 36DSPATR(PR)
     A                                      OVRDTA
     A            I3             2Y 0B 20 41DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  81                                  DSPATR(RI)
     A  81                                  DSPATR(PC)
     A            I4             2A  B 20 46DSPATR(PR)
     A                                      OVRDTA
     A            I5             2A  B 20 51DSPATR(PR)
     A                                      OVRDTA
     A            I6             2A  B 20 56DSPATR(PR)
     A                                      OVRDTA
     A            I7             2A  B 20 61DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R WED_MAN
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  1'Division'
     A                                  2 15'Dept'
     A                                  2 27'Class'
     A                                  2 38'Shift'
     A                                  4  1'FI LAST NAME'
     A                                  4 29'MON  TUES WED  THUR FRI  SAT  SUN'
     A                                  5 20'WORKED'
     A                                  6 20'REFUSED'
     A                                  8 20'WORKED'
     A                                  9 20'REFUSED'
     A                                 11 20'WORKED'
     A                                 12 20'REFUSED'
     A                                 14 20'WORKED'
     A                                 15 20'REFUSED'
     A                                 17 20'WORKED'
     A                                 18 20'REFUSED'
     A                                 20 20'WORKED'
     A                                 21 20'REFUSED'
     A            X              2A  B  2 10DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  2 20DSPATR(PR)
     A                                      OVRDTA
     A            CL             2A  B  2 33DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B  2 44DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            ANAME         15A  B  5  4DSPATR(PR)
     A                                      OVRDTA
     A            A1             2A  B  5 30DSPATR(PR)
     A                                      OVRDTA
     A            A2             2A  B  5 35DSPATR(PR)
     A                                      OVRDTA
     A            A3             2Y 0B  5 40DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 09                               DSPATR(RI)
     A N97 09                               DSPATR(PC)
     A            A4             2A  B  5 45DSPATR(PR)
     A                                      OVRDTA
     A            A5             2A  B  5 50DSPATR(PR)
     A                                      OVRDTA
     A            A6             2A  B  5 55DSPATR(PR)
     A                                      OVRDTA
     A            A7             2A  B  5 60DSPATR(PR)
     A                                      OVRDTA
     A            B1             2A  B  6 30DSPATR(PR)
     A                                      OVRDTA
     A            B2             2A  B  6 35DSPATR(PR)
     A                                      OVRDTA
     A            B3             2Y 0B  6 40DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 18                               DSPATR(RI)
     A N97 18                               DSPATR(PC)
     A            B4             2A  B  6 45DSPATR(PR)
     A                                      OVRDTA
     A            B5             2A  B  6 50DSPATR(PR)
     A                                      OVRDTA
     A            B6             2A  B  6 55DSPATR(PR)
     A                                      OVRDTA
     A            B7             2A  B  6 60DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            CNAME         15A  B  8  4DSPATR(PR)
     A                                      OVRDTA
     A            C1             2A  B  8 30DSPATR(PR)
     A                                      OVRDTA
     A            C2             2A  B  8 35DSPATR(PR)
     A                                      OVRDTA
     A            C3             2Y 0B  8 40DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 27                               DSPATR(RI)
     A N97 27                               DSPATR(PC)
     A            C4             2A  B  8 45DSPATR(PR)
     A                                      OVRDTA
     A            C5             2A  B  8 50DSPATR(PR)
     A                                      OVRDTA
     A            C6             2A  B  8 55DSPATR(PR)
     A                                      OVRDTA
     A            C7             2A  B  8 60DSPATR(PR)
     A                                      OVRDTA
     A            D1             2A  B  9 30DSPATR(PR)
     A                                      OVRDTA
     A            D2             2A  B  9 35DSPATR(PR)
     A                                      OVRDTA
     A            D3             2Y 0B  9 40DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 36                               DSPATR(RI)
     A N97 36                               DSPATR(PC)
     A            D4             2A  B  9 45DSPATR(PR)
     A                                      OVRDTA
     A            D5             2A  B  9 50DSPATR(PR)
     A                                      OVRDTA
     A            D6             2A  B  9 55DSPATR(PR)
     A                                      OVRDTA
     A            D7             2A  B  9 60DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            ENAME         15A  B 11  4DSPATR(PR)
     A                                      OVRDTA
     A            E1             2A  B 11 30DSPATR(PR)
     A                                      OVRDTA
     A            E2             2A  B 11 35DSPATR(PR)
     A                                      OVRDTA
     A            E3             2Y 0B 11 40DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 45                               DSPATR(RI)
     A N97 45                               DSPATR(PC)
     A            E4             2A  B 11 45DSPATR(PR)
     A                                      OVRDTA
     A            E5             2A  B 11 50DSPATR(PR)
     A                                      OVRDTA
     A            E6             2A  B 11 55DSPATR(PR)
     A                                      OVRDTA
     A            E7             2A  B 11 60DSPATR(PR)
     A                                      OVRDTA
     A            F1             2A  B 12 30DSPATR(PR)
     A                                      OVRDTA
     A            F2             2A  B 12 35DSPATR(PR)
     A                                      OVRDTA
     A            F3             2Y 0B 12 40DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 54                               DSPATR(RI)
     A N97 54                               DSPATR(PC)
     A            F4             2A  B 12 45DSPATR(PR)
     A                                      OVRDTA
     A            F5             2A  B 12 50DSPATR(PR)
     A                                      OVRDTA
     A            F6             2A  B 12 55DSPATR(PR)
     A                                      OVRDTA
     A            F7             2A  B 12 60DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            GNAME         15A  B 14  4DSPATR(PR)
     A                                      OVRDTA
     A            G1             2A  B 14 30DSPATR(PR)
     A                                      OVRDTA
     A            G2             2A  B 14 35DSPATR(PR)
     A                                      OVRDTA
     A            G3             2Y 0B 14 40DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 63                               DSPATR(RI)
     A N97 63                               DSPATR(PC)
     A            G4             2A  B 14 45DSPATR(PR)
     A                                      OVRDTA
     A            G5             2A  B 14 50DSPATR(PR)
     A                                      OVRDTA
     A            G6             2A  B 14 55DSPATR(PR)
     A                                      OVRDTA
     A            G7             2A  B 14 60DSPATR(PR)
     A                                      OVRDTA
     A            H1             2A  B 15 30DSPATR(PR)
     A                                      OVRDTA
     A            H2             2A  B 15 35DSPATR(PR)
     A                                      OVRDTA
     A            H3             2Y 0B 15 40DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 72                               DSPATR(RI)
     A N97 72                               DSPATR(PC)
     A            H4             2A  B 15 45DSPATR(PR)
     A                                      OVRDTA
     A            H5             2A  B 15 50DSPATR(PR)
     A                                      OVRDTA
     A            H6             2A  B 15 55DSPATR(PR)
     A                                      OVRDTA
     A            H7             2A  B 15 60DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            INAME         15A  B 17  4DSPATR(PR)
     A                                      OVRDTA
     A            I1             2A  B 17 30DSPATR(PR)
     A                                      OVRDTA
     A            I2             2A  B 17 35DSPATR(PR)
     A                                      OVRDTA
     A            I3             2Y 0B 17 40DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 81                               DSPATR(RI)
     A N97 81                               DSPATR(PC)
     A            I4             2A  B 17 45DSPATR(PR)
     A                                      OVRDTA
     A            I5             2A  B 17 50DSPATR(PR)
     A                                      OVRDTA
     A            I6             2A  B 17 55DSPATR(PR)
     A                                      OVRDTA
     A            I7             2A  B 17 60DSPATR(PR)
     A                                      OVRDTA
     A            J1             2A  B 18 30DSPATR(PR)
     A                                      OVRDTA
     A            J2             2A  B 18 35DSPATR(PR)
     A                                      OVRDTA
     A            J3             2Y 0B 18 40DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 90                               DSPATR(RI)
     A N97 90                               DSPATR(PC)
     A            J4             2A  B 18 45DSPATR(PR)
     A                                      OVRDTA
     A            J5             2A  B 18 50DSPATR(PR)
     A                                      OVRDTA
     A            J6             2A  B 18 55DSPATR(PR)
     A                                      OVRDTA
     A            J7             2A  B 18 60DSPATR(PR)
     A                                      OVRDTA
     A            K              1A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            KNAME         15A  B 20  4DSPATR(PR)
     A                                      OVRDTA
     A            K1             2A  B 20 30DSPATR(PR)
     A                                      OVRDTA
     A            K2             2A  B 20 35DSPATR(PR)
     A                                      OVRDTA
     A            K3             2Y 0B 20 40DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 03                               DSPATR(RI)
     A  97 03                               DSPATR(PC)
     A            K4             2A  B 20 45DSPATR(PR)
     A                                      OVRDTA
     A            K5             2A  B 20 50DSPATR(PR)
     A                                      OVRDTA
     A            K6             2A  B 20 55DSPATR(PR)
     A                                      OVRDTA
     A            K7             2A  B 20 60DSPATR(PR)
     A                                      OVRDTA
     A            L1             2A  B 21 30DSPATR(PR)
     A                                      OVRDTA
     A            L2             2A  B 21 35DSPATR(PR)
     A                                      OVRDTA
     A            L3             2Y 0B 21 40DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 12                               DSPATR(RI)
     A  97 12                               DSPATR(PC)
     A            L4             2A  B 21 45DSPATR(PR)
     A                                      OVRDTA
     A            L5             2A  B 21 50DSPATR(PR)
     A                                      OVRDTA
     A            L6             2A  B 21 55DSPATR(PR)
     A                                      OVRDTA
     A            L7             2A  B 21 60DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R WEEK_DATE
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  4  5'INPUT THE WEEK-ENDING DATE FOR THE'
     A                                  4 40'HOURS THAT YOU WILL BE ENTERING.'
     A                                  7 24'MO'
     A                                  7 31'DA'
     A                                  7 38'YR'
     A                                  9 28'Press ENTER.'
     A            MO             2Y 0B  7 27DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            DA             2Y 0B  7 34DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            YR             2A  B  7 41DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R WORKED_HDN
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 29'ENTERING HOURS WORKED'
     A                                  3 10'Employees not entered will be char-
     A                                      ged as hours refused.'
     A            AUTOMATIC     16A  B  2 32DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-REG HOURS f2-SAT HOURS f-
     A                                      8-SUN HOURS f4-HOL HOURS f5-PREV DA-
     A                                      Y f6-NEXT DAY f7-')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R WORKEDHD2
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 34'MANUAL MODE'
     A                                  2 19'Only the hours entered will be rec-
     A                                      orded.'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-REG HOURS f2-SAT HOURS f-
     A                                      8-SUN HOURS f4-HOL HOURS f5-PREV DA-
     A                                      Y f6-NEXT DAY f7-')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
