     A*%%TS  SD  19980604  124541  A257947     REL-V4R2M0  5769-PW1
     A*  90/03/20  11:01:28    A034675     REL-R01M02  5728-PW1
     A*            20:14:13    T881S28     VPAIDADJ.HPTO38.CME
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A          R BGTADJ1
     A*%%TS  SD  19980604  095850  A257947     REL-V4R2M0  5769-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  3  3'ENTER PO NUMBER :'
     A            COM            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B  3 22DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            REL            3Y 0B  3 30DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A                                  1 14'P O   B U D G E T   A M O U N T   -
     A                                      A D J U S T M E N T'
     A          R BGTADJ2
     A*%%TS  SD  19980604  124541  A257947     REL-V4R2M0  5769-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A            COM            3A  B  1  2DSPATR(PR)
     A                                  1 14'P O   B U D G E T   A M O U N T   -
     A                                      A D J U S T M E N T'
     A                                  4 25'PO NUMBER:'
     A            PONUM         11A  B  4 37DSPATR(PR)
     A                                  6 28'VENDOR:'
     A            VENDOR        10A  B  6 37DSPATR(PR)
     A                                  8  3'==================================-
     A                                      ===================================-
     A                                      ======='
     A                                 10 13'CURRENT BUDGET AMOUNT:'
     A            BUDGET        12A  B 10 37DSPATR(PR)
     A                                 12 21'FREIGHT TERMS:'
     A            FREIGHT        1A  B 12 37DSPATR(PR)
     A                                 14 17'ADJUSTMENT AMOUNT:'
     A            ADJ           12Y 0B 14 37EDTCDE(4)
     A                                      DSPATR(UL)
     A  50                                  DSPATR(PC)
     A  50                                  DSPATR(RI)
     A                                 17  3'FREIGHT TERMS NOT = "P"; UPDATE?'
     A                                      OVRATR
     A N10                                  DSPATR(ND)
     A            YES            3A  B 17 37DSPATR(UL)
     A                                      OVRATR
     A N10                                  DSPATR(ND)
     A N10                                  DSPATR(PR)
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A                                      VALUES('YES' '   ')
     A                                 17 42'(TYPE "YES" TO UPDATE OR'
     A                                      OVRATR
     A N10                                  DSPATR(ND)
     A                                 18 48'"F3" TO CANCEL.)'
     A                                      OVRATR
     A N10                                  DSPATR(ND)
     A                                 22  1'"F3" RETURN TO PREV SCREEN    '
     A                                 23  1'ENTER THE BUDGET AMOUNT ADJUSTMENT-
     A                                       AND PRESS "ENTER" TO UPDATE'
     A  99        MSGLINE       79   M
     A  99                                  OVRDTA
