     A*  90/11/01  15:38:30    T881S28     REL-R02M00  5728-PW1
     A                                      DSPSIZ(24 80 *DS3)
     A                                      INDARA
     A                                      PRINT
     A          R FBLOWUP
     A*  90/11/01  15:38:30    T881S28     REL-R02M00  5728-PW1
     A                                 20 24'Press Enter to continue'
     A                                 12  7'Field 1'
     A                                 13  7'Field 2'
     A                                 14  7'Field 3'
     A                                 15  7'Field 4'
     A                                 16  7'Field 5'
     A                                 12 40'Numeric field 1'
     A                                 13 40'Numeric field 2'
     A                                 14 40'Numeric field 3'
     A                                 15 40'Numeric field 4'
     A                                 16 40'Numeric field 5'
     A            FLD021        50A  O  1 14
     A            FLD022        50A  O  2 14
     A            FLD023        50A  O  3 14
     A            FLD024        50A  O  4 14
     A            FLD025        50A  O  5 14
     A            FLD026        50A  O  6 14
     A            FLD027        50A  O  7 14
     A            FLD028        60A  O  9 10
     A            FLD029        14A  O 12 16
     A            FLD030         8A  O 12 58
     A            FLD031        14A  O 13 16
     A            FLD032         8A  O 13 58
     A            FLD033        14A  O 14 16
     A            FLD034         8A  O 14 58
     A            FLD035        14A  O 15 16
     A            FLD036         8A  O 15 58
     A            FLD037        14A  O 16 16
     A            FLD038         8A  O 16 58
     A                                 18  7'F I L E   S T A T U S : '
     A            FLD039         2   B 18 34DSPATR(PR)
