     A*  89/02/20  08:24:21    T881S03     REL-R01M02  5728-PW1
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A                                      CA03(03 'END PROGRAM')
     A          R FCCCOPY
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF08
     A                                  1 11'-----------------------------------
     A                                      -------------------------'
     A                                  2 11':  M A C H I N E   C A T A L O G'
     A                                  2 46'C O P Y   S C R E E N  :'
     A                                  3 11'-----------------------------------
     A                                      -------------------------'
     A                                  5  8'EQUIPMENT NUMBER:'
     A                                  5 38'TYPE:'
     A                                  5 58'SUBSYSTEM:'
     A                                  9  8'Copy all linked parts from Subsyst-
     A                                      em'
     A                                  9 57'(Required)'
     A                                 11 28'of Equipment Key'
     A                                 11 57'(Optional)'
     A                                 13  4'Equipment Key is EITHER Local Equi-
     A                                      pment Number OR Corporate Type numb-
     A                                      er.'
     A                                 17 24'Enter data and press "ENTER" key'
     A                                 18 20'to copy records of an existing sub-
     A                                      system.'
     A                                 19  8'If Equipment Key is left blank, sy-
     A                                      stem will default to current Key.'
     A                                 22  3'Return to menu, Change:'
     A                                 23  1'¦----------------------------------
     A                                      -----------¦'
     A            EN             6A  B  5 27DSPATR(PR)
     A                                      OVRDTA
     A            ET             8A  B  5 45DSPATR(PR)
     A                                      OVRDTA
     A            SS             4A  B  5 70DSPATR(PR)
     A                                      OVRDTA
     A            SSC            4A  B  9 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            ETC            8A  B 11 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A                                      DSPATR(PR)
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FCCDEL
     A                                      PUTOVR
     A  98                                  INVITE
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  9'-----------------------------------
     A                                      -----------------------------'
     A                                  2  9':  M A C H I N E   C A T A L O G'
     A                                  2 44'D E L E T E   S C R E E N  :'
     A                                  3  9'-----------------------------------
     A                                      -----------------------------'
     A                                  5  8'EQUIPMENT NUMBER:'
     A                                  5 38'TYPE:'
     A                                  5 58'SUBSYSTEM:'
     A                                  8 11'f6  -  To DELETE one CODE entry, p-
     A                                      ress f6 key, enter proper'
     A                                  9 18'corporate code and press "ENTER" k-
     A                                      ey.'
     A                                 12 11'f7  -  To DELETE all codes of name-
     A                                      d SUBSYSTEM, press f7 key,'
     A                                 13 18'enter proper subsystem and press "-
     A                                      ENTER" key.'
     A                                 16 11'f8  -  To DELETE all codes of name-
     A                                      d KEY, press f8 key,'
     A                                 17 20'enter proper key and press "ENTER"-
     A                                       key.'
     A                                 19 11'NOTE:  All applicable MACHINE NOTE-
     A                                      S will also be deleted.'
     A                                 22  3'Return to menu, Change:'
     A                                 23  1'¦----------------------------------
     A                                      -----------¦'
     A            EN             6A  B  5 27DSPATR(PR)
     A                                      OVRDTA
     A            ET             8A  B  5 45DSPATR(PR)
     A                                      OVRDTA
     A            SS             4A  B  5 70DSPATR(PR)
     A                                      OVRDTA
     A            CC             7A  B  9 57DSPATR(PR)
     A                                      OVRDTA
     A            SSD            4A  B 13 65DSPATR(PR)
     A                                      OVRDTA
     A            TYPE           8A  B 17 62DSPATR(PR)
     A                                      OVRDTA
     A            MSG           76A  B 21  2DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A                                      DSPATR(PR)
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FCCDEL6
     A                                      PUTOVR
     A  98                                  INVITE
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  9'-----------------------------------
     A                                      -----------------------------'
     A                                  2  9':  M A C H I N E   C A T A L O G'
     A                                  2 44'D E L E T E   S C R E E N  :'
     A                                  3  9'-----------------------------------
     A                                      -----------------------------'
     A                                  5  8'EQUIPMENT NUMBER:'
     A                                  5 38'TYPE:'
     A                                  5 58'SUBSYSTEM:'
     A                                  8 11'f6  -  To DELETE one CODE entry, p-
     A                                      ress f6 key, enter proper'
     A                                  9 18'corporate code and press "ENTER" k-
     A                                      ey.'
     A                                 12 11'f7  -  To DELETE all codes of name-
     A                                      d SUBSYSTEM, press f7 key,'
     A                                 13 18'enter proper subsystem and press "-
     A                                      ENTER" key.'
     A                                 16 11'f8  -  To DELETE all codes of name-
     A                                      d KEY, press f8 key,'
     A                                 17 20'enter proper key and press "ENTER"-
     A                                       key.'
     A                                 19 11'NOTE:  All applicable MACHINE NOTE-
     A                                      S will also be deleted.'
     A                                 22  3'Return to menu, Change:'
     A                                 23  1'¦------------------------¦'
     A            EN             6A  B  5 27DSPATR(PR)
     A                                      OVRDTA
     A            ET             8A  B  5 45DSPATR(PR)
     A                                      OVRDTA
     A            SS             4A  B  5 70DSPATR(PR)
     A                                      OVRDTA
     A            CC             7A  B  9 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            SSD            4A  B 13 65DSPATR(PR)
     A                                      OVRDTA
     A            TYPE           8A  B 17 62DSPATR(PR)
     A                                      OVRDTA
     A            MSG           76A  B 21  2DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A                                      DSPATR(PR)
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FCCDEL7
     A                                      PUTOVR
     A  98                                  INVITE
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  9'-----------------------------------
     A                                      -----------------------------'
     A                                  2  9':  M A C H I N E   C A T A L O G'
     A                                  2 44'D E L E T E   S C R E E N  :'
     A                                  3  9'-----------------------------------
     A                                      -----------------------------'
     A                                  5  8'EQUIPMENT NUMBER:'
     A                                  5 38'TYPE:'
     A                                  5 58'SUBSYSTEM:'
     A                                  8 11'f6  -  To DELETE one CODE entry, p-
     A                                      ress f6 key, enter proper'
     A                                  9 18'corporate code and press "ENTER" k-
     A                                      ey.'
     A                                 12 11'f7  -  To DELETE all codes of name-
     A                                      d SUBSYSTEM, press f7 key,'
     A                                 13 18'enter proper subsystem and press "-
     A                                      ENTER" key.'
     A                                 16 11'f8  -  To DELETE all codes of name-
     A                                      d KEY, press f8 key,'
     A                                 17 20'enter proper key and press "ENTER"-
     A                                       key.'
     A                                 19 11'NOTE:  All applicable MACHINE NOTE-
     A                                      S will also be deleted.'
     A                                 22  3'Return to menu, Change:'
     A                                 23  1'¦------------------------¦'
     A            EN             6A  B  5 27DSPATR(PR)
     A                                      OVRDTA
     A            ET             8A  B  5 45DSPATR(PR)
     A                                      OVRDTA
     A            SS             4A  B  5 70DSPATR(PR)
     A                                      OVRDTA
     A            CC             7A  B  9 57DSPATR(PR)
     A                                      OVRDTA
     A            SSD            4A  B 13 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            TYPE           8A  B 17 62DSPATR(PR)
     A                                      OVRDTA
     A            MSG           76A  B 21  2DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A                                      DSPATR(PR)
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FCCDEL8
     A                                      PUTOVR
     A  98                                  INVITE
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  9'-----------------------------------
     A                                      -----------------------------'
     A                                  2  9':  M A C H I N E   C A T A L O G'
     A                                  2 44'D E L E T E   S C R E E N  :'
     A                                  3  9'-----------------------------------
     A                                      -----------------------------'
     A                                  5  8'EQUIPMENT NUMBER:'
     A                                  5 38'TYPE:'
     A                                  5 58'SUBSYSTEM:'
     A                                  8 11'f6  -  To DELETE one CODE entry, p-
     A                                      ress f6 key, enter proper'
     A                                  9 18'corporate code and press "ENTER" k-
     A                                      ey.'
     A                                 12 11'f7  -  To DELETE all codes of name-
     A                                      d SUBSYSTEM, press f7 key,'
     A                                 13 18'enter proper subsystem and press "-
     A                                      ENTER" key.'
     A                                 16 11'f8  -  To DELETE all codes of name-
     A                                      d KEY, press f8 key,'
     A                                 17 20'enter proper key and press "ENTER"-
     A                                       key.'
     A                                 19 11'NOTE:  All applicable MACHINE NOTE-
     A                                      S will also be deleted.'
     A                                 22  3'Return to menu, Change:'
     A                                 23  1'¦------------------------¦'
     A            EN             6A  B  5 27DSPATR(PR)
     A                                      OVRDTA
     A            ET             8A  B  5 45DSPATR(PR)
     A                                      OVRDTA
     A            SS             4A  B  5 70DSPATR(PR)
     A                                      OVRDTA
     A            CC             7A  B  9 57DSPATR(PR)
     A                                      OVRDTA
     A            SSD            4A  B 13 65DSPATR(PR)
     A                                      OVRDTA
     A            TYPE           8A  B 17 62DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            MSG           76A  B 21  2DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A                                      DSPATR(PR)
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FCCEXEC1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 18'-----------------------------------
     A                                      ---------'
     A                                  2 18':      M A C H I N E   C A T A L O'
     A                                  2 53'G      :'
     A                                  3 18':'
     A                                  3 60':'
     A                                  4 18':  M A I N T E N A N C E   P R O G'
     A                                  4 53'R A M  :'
     A                                  5 18'-----------------------------------
     A                                      ---------'
     A                                  7 22'LOCAL EQUIPMENT NUMBER'
     A                                 11 21'CORPORATE EQUIPMENT TYPE'
     A                                 15 25'SUBSYSTEM NUMBER'
     A                                  8 49'NOTE:  Entries will be'
     A                                  9 49'keyed by EITHER local'
     A                                 10 49'Equipment/Subsystem or by'
     A                                 11 49'Equipment Type/Subsystem,'
     A                                 12 49'NOT BOTH.  LOCAL entries'
     A                                 13 49'appear only for that named'
     A                                 14 49'machine, TYPE entries'
     A                                 15 49'appear for ALL machines'
     A                                 16 49'of that TYPE.'
     A                                 19 17'Enter data and press appropriate f-
     A                                      unction key.'
     A                                 21  5'f1 OR f2 KEY WILL ALTERNATE ENTRY -
     A                                      BETWEEN LOCAL EQUIPMENT OR CORPORAT-
     A                                      E TYPE'
     A                                 22  3'SELECT BY:'
     A                                 23  3'¦---------------------¦'
     A            EN             6A  B  9 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            ET             8A  B 13 29DSPATR(PR)
     A                                      OVRDTA
     A            SS             4A  B 17 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A                                      DSPATR(PR)
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FCCEXEC2
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 18'-----------------------------------
     A                                      ---------'
     A                                  2 18':      M A C H I N E   C A T A L O'
     A                                  2 53'G      :'
     A                                  3 18':'
     A                                  3 60':'
     A                                  4 18':  M A I N T E N A N C E   P R O G'
     A                                  4 53'R A M  :'
     A                                  5 18'-----------------------------------
     A                                      ---------'
     A                                  7 22'LOCAL EQUIPMENT NUMBER'
     A                                 11 21'CORPORATE EQUIPMENT TYPE'
     A                                 15 25'SUBSYSTEM NUMBER'
     A                                  8 49'NOTE:  Entries will be'
     A                                  9 49'keyed by EITHER local'
     A                                 10 49'Equipment/Subsystem or by'
     A                                 11 49'Equipment Type/Subsystem,'
     A                                 12 49'NOT BOTH.  LOCAL entries'
     A                                 13 49'appear only for that named'
     A                                 14 49'machine, TYPE entries'
     A                                 15 49'appear for ALL machines'
     A                                 16 49'of that TYPE.'
     A                                 19 17'Enter data and press appropriate f-
     A                                      unction key.'
     A                                 21  5'f1 OR f2 KEY WILL ALTERNATE ENTRY -
     A                                      BETWEEN LOCAL EQUIPMENT OR CORPORAT-
     A                                      E TYPE'
     A                                 22  3'SELECT BY:'
     A                                 23  3'¦---------------------¦'
     A            EN             6A  B  9 30DSPATR(PR)
     A                                      OVRDTA
     A            ET             8A  B 13 29DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            SS             4A  B 17 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A                                      DSPATR(PR)
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FCCEXEC3
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 18'-----------------------------------
     A                                      ---------'
     A                                  2 18':      M A C H I N E   C A T A L O'
     A                                  2 53'G      :'
     A                                  3 18':'
     A                                  3 60':'
     A                                  4 18':  M A I N T E N A N C E   P R O G'
     A                                  4 53'R A M  :'
     A                                  5 18'-----------------------------------
     A                                      ---------'
     A                                  7 22'LOCAL EQUIPMENT NUMBER'
     A                                 11 21'CORPORATE EQUIPMENT TYPE'
     A                                 15 25'SUBSYSTEM NUMBER'
     A                                  8 49'NOTE:  Entries will be'
     A                                  9 49'keyed by EITHER local'
     A                                 10 49'Equipment/Subsystem or by'
     A                                 11 49'Equipment Type/Subsystem,'
     A                                 12 49'NOT BOTH.  LOCAL entries'
     A                                 13 49'appear only for that named'
     A                                 14 49'machine, TYPE entries'
     A                                 15 49'appear for ALL machines'
     A                                 16 49'of that TYPE.'
     A                                 19 17'Enter data and press appropriate f-
     A                                      unction key.'
     A                                 21  5'f1 OR f2 KEY WILL ALTERNATE ENTRY -
     A                                      BETWEEN LOCAL EQUIPMENT OR CORPORAT-
     A                                      E TYPE'
     A                                 22  3'SELECT BY:'
     A                                 23  3'¦---------------------¦'
     A            EN             6A  B  9 30DSPATR(PR)
     A                                      OVRDTA
     A            ET             8A  B 13 29DSPATR(PR)
     A                                      OVRDTA
     A            SS             4A  B 17 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A                                      DSPATR(PR)
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FCCINITA
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF08
     A                                  1  7'-----------------------------------
     A                                      ---------------------------------'
     A                                  2  7':  M A C H I N E   C A T A L O G'
     A                                  2 42'I N I T I A T E   S C R E E N  :'
     A                                  3  7'-----------------------------------
     A                                      ---------------------------------'
     A                                  5  8'EQUIPMENT NUMBER:'
     A                                  5 38'TYPE:'
     A                                  5 58'SUBSYSTEM:'
     A                                 16 23'Enter data and press the "ENTER" k-
     A                                      ey.'
     A                                 22  3'Return to menu, Change:'
     A                                 23  1'¦----------------------------------
     A                                      -----¦'
     A            EN             6A  B  5 27DSPATR(PR)
     A                                      OVRDTA
     A            ET             8A  B  5 45DSPATR(PR)
     A                                      OVRDTA
     A            SS             4A  B  5 70DSPATR(PR)
     A                                      OVRDTA
     A            CC1            7A  B  7  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            CC2            7A  B  7 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            CC3            7A  B  7 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            CC4            7A  B  7 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            CC5            7A  B  7 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            CC6            7A  B  9  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            CC7            7A  B  9 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            CC8            7A  B  9 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            CC9            7A  B  9 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            CC10           7A  B  9 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            CC11           7A  B 11  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            CC12           7A  B 11 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            CC13           7A  B 11 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            CC14           7A  B 11 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            CC15           7A  B 11 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A                                      DSPATR(PR)
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FCCMACHNO
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF06
     A                                      CF08
     A  98                                  INVITE
     A                                  1 13'-----------------------------------
     A                                      ---------------------'
     A                                  2 13':'
     A                                  2 26'M A C H I N E   C A T A L O G'
     A                                  2 67':'
     A                                  3 13':   M A C H I N E   N O T E   M A'
     A                                  3 47'I N T E N A N C E   :'
     A                                  4 13'-----------------------------------
     A                                      ---------------------'
     A                                  6  8'EQUIPMENT NUMBER:'
     A                                  6 38'TYPE:'
     A                                  6 58'SUBSYSTEM:'
     A                                  8 28'CORPORATE CODE:'
     A                                  9  3'MACHINE NOTE:'
     A                                 12 10'Enter Corporate Code and Machine N-
     A                                      ote and press "ENTER" key.'
     A                                 13  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                 14  4'==>   If record does not exist, ma-
     A                                      chine note will be ADDED to the fil-
     A                                      e.'
     A                                 16  4'==>   If record exists, machine no-
     A                                      te will be replaced by the new data-
     A                                      '
     A                                 17 18'entered in the machine note field'
     A                                 19  4'==>   If record exists, and machin-
     A                                      e note is left blank, the record wi-
     A                                      ll'
     A                                 20 18'be DELETED.'
     A                                 21  1'-----------------------------------
     A                                      ------------------------------------
     A                                      --------'
     A                                 22  3'Return to menu, Change:'
     A                                 23  1'¦----------------------------------
     A                                      -----------¦'
     A            EN             6A  B  6 27DSPATR(PR)
     A                                      OVRDTA
     A            ET             8A  B  6 45DSPATR(PR)
     A                                      OVRDTA
     A            SS             4A  B  6 70DSPATR(PR)
     A                                      OVRDTA
     A            CC             7A  B  8 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            MN            76A  B 10  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A                                      DSPATR(PR)
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R VSPRPAGE
     A                                      CF01(01)
     A                                      CF02(02)
     A                                      CF04(04)
     A                                      CF05(05)
     A                                      CF06(06)
     A                                      CF08(08)
     A                                      CF09(09)
     A                                      PUTOVR
     A                                  1  2'    ******************  S P A R E -
     A                                        P A R T S   P A G E  ************-
     A                                      ******'
     A                                      DSPATR(HI)
     A                                  2  2'    ***'
     A                                      DSPATR(HI)
     A                                  2 12'EQUIPMENT NUMBER OR TYPE:'
     A                                      DSPATR(HI)
     A                                  2 56'SUBSYSTEM:'
     A                                      DSPATR(HI)
     A                                  2 74'***'
     A                                      DSPATR(HI)
     A                                  3  2'    ***'
     A                                      DSPATR(HI)
     A            FLD058         8A  B  3 19DSPATR(PR HI)
     A                                      OVRDTA
     A            FLD069         4A  B  3 58DSPATR(PR HI)
     A                                      OVRDTA
     A                                  3 74'***'
     A                                      DSPATR(HI)
     A                                  4  2'    ******************************-
     A                                      ***********************************-
     A                                      ******'
     A                                      DSPATR(HI)
     A                                  5  1'Code    Keyword              Adjec-
     A                                      tive          Manufacturer    Part -
     A                                      Number    '
     A                                      DSPATR(HI UL)
     A N01        LIN6          79A  B  6  1OVRDTA
     A                                      DSPATR(PR)
     A N02        LIN7          79A  B  7  1OVRDTA
     A                                      DSPATR(PR)
     A N03        LIN8          79A  B  8  1OVRDTA
     A                                      DSPATR(PR)
     A N04        LIN9          79A  B  9  1OVRDTA
     A                                      DSPATR(PR)
     A N05        LIN10         79A  B 10  1OVRDTA
     A                                      DSPATR(PR)
     A N06        LIN11         79A  B 11  1OVRDTA
     A                                      DSPATR(PR)
     A N07        LIN12         79A  B 12  1OVRDTA
     A                                      DSPATR(PR)
     A N08        LIN13         79A  B 13  1OVRDTA
     A                                      DSPATR(PR)
     A N09        LIN14         79A  B 14  1OVRDTA
     A                                      DSPATR(PR)
     A N10        LIN15         79A  B 15  1OVRDTA
     A                                      DSPATR(PR)
     A N11        LIN16         79A  B 16  1OVRDTA
     A                                      DSPATR(PR)
     A N12        LIN17         79A  B 17  1OVRDTA
     A                                      DSPATR(PR)
     A N13        LIN18         79A  B 18  1OVRDTA
     A                                      DSPATR(PR)
     A N14        LIN19         79A  B 19  1OVRDTA
     A                                      DSPATR(PR)
     A N15        LIN20         79A  B 20  1OVRDTA
     A                                      DSPATR(PR)
     A                                 21  2'Press "ENTER" key for next screen.-
     A                                              "<" indicates TYPE linked p-
     A                                      art.'
     A                                 22  2'F1 RETURN'
     A                                 22 58'F8 NEXT PAGE'
     A                                 23 58'F9 PREV PAGE'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A  99        ERRMSG        79   M      OVRDTA
