      *****************************************************************
      **  DISPLAY FILE:   ZCFTHELP
      **  PROGRAM     :   TXINITWO - INITIATE WO'S
      **                  XXXXXXXX - XXXXXXXXXXXXXXXXXXXXXX
      **
      **  DESCRIPTION :   CRAFTMAN DISPLAY FILE (MULTIPLE FMTS)
      *****************************************************************
      **                MODIFICATION   HISTORY
      *****************************************************************
      *    JAN 24 2005  D. RAUCH     DCR01      REQUEST# 2004-41709
      *       1)  ADDED VERBAGE FOR F5 TO CALL EQUIP SELECTION PGM
      *----------------------------------------------------------------
      *****************************************************************
     A*%%TS  DD  20021112  142018  QUSER       REL-V5.1    iSeries WDT
     A*%%FD DDS of Screen file VCFTHELP
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A  97                                  INVITE
     A                                      HELP
     A                                      PRINT
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A          R CEXECASN
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  2'* * * * *   C  R  A  F  T  S  M  A-
     A                                        N    F  U  N  C  T  I  O  N  S   -
     A                                      * * * * *'
     A                                  2  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A                                  3  3'Clock Card Number:'
     A            CNUM           4A  B  3 23DSPATR(PR)
     A                                      OVRDTA
     A                                  3 30'Temporary Zone:'
     A            ZN             4A  B  3 47DSPATR(PR)
     A                                      OVRDTA
     A                                  3 52'(Leave blank for home Zone)'
     A                                  4  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A                                  5  3'Clock Card:'
     A            CCNM           4A  B  5 16DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  5 24'Name:'
     A            NAME          16A  B  5 31DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  5 51'Currently IP on:'
     A            CWO           10A  B  5 69DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  6  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A                                  7  3'PRESS:'
     A                                  8  5'f1   Next WO Assignment:'
     A            NWO           10A  B  8 31DSPATR(PR)
     A                                      OVRDTA
     A                                  8 43'Equip:'
     A            ENUM           6A  B  8 51DSPATR(PR)
     A                                      OVRDTA
     A                                  8 59'Location:'
     A            LOCATION       8A  B  8 70DSPATR(PR)
     A                                      OVRDTA
     A                                  9 31'Description:'
     A            DESC          30A  B  9 45DSPATR(PR)
     A                                      OVRDTA
     A                                 11  5'f2   CW - Failure Code:'
     A            FC             2A  B 11 30DSPATR(UL)
     A  11                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            SUBS           4A  B 11 33DSPATR(UL)
     A  12                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 11 39'(Enter Failure Code and Press "f2"-
     A                                       key)'
     A                                 13  5'f3   ***** HELP FUNCTION OR EXIT S-
     A                                      ESSION *****'
     A                                 15  5'f4   IP - Workorder:'
     A            IPNWO         10A  B 15 27DSPATR(PR)
     A                                      OVRDTA
     A                                 17  5'f5   Display Workorder:'
     A            DWO           10A  B 17 30DSPATR(UL)
     A  17                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 17 42'(Blank will display Current or Nex-
     A                                      t WO'
     A                                 18 59'===================='
     A                                 19  5'f6   ******  ADDITIONAL FUNCTIONS -
     A                                      MENU  ******        : Enter "NEWS" -
     A                                      and :'
     A                                 20 59': press "ENTER" to :'
     A                                 21  5'f7   Clear Current Clock Card Numb-
     A                                      er from screen      : view news ite-
     A                                      ms. :'
     A                                 22 59'===================='
     A                                 23  5'f8   LV -'
     A            L              1A  B 23 15DSPATR(UL)
     A  18                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 23 20'New Skill:'
     A            N              2A  B 23 32DSPATR(UL)
     A  13                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 23 37'Hold For Material:'
     A            H              1A  B 23 57DSPATR(UL)
     A  14                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 23 60'New MWO:'
     A            NEWWO         10A  B 23 70DSPATR(UL)
     A  15                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            COMMANDLIN    79A  O 24  1OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R CEXECUNA
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  2'* * * * *   C  R  A  F  T  S  M  A-
     A                                        N    F  U  N  C  T  I  O  N  S   -
     A                                      * * * * *'
     A                                  2  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A                                  3  3'Clock Card Number:'
     A            CNUM           4A  B  3 23DSPATR(PR)
     A                                      OVRDTA
     A                                  3 30'Temporary Zone:'
     A            ZN             4A  B  3 47DSPATR(PR)
     A                                      OVRDTA
     A                                  3 52'(Leave blank for home Zone)'
     A                                  4  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A                                  5  3'Clock Card:'
     A            CCNM           4A  B  5 16DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  5 24'Name:'
     A            NAME          16A  B  5 31DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  5 51'Currently IP on:'
     A            CWO           10A  B  5 69DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  6  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A                                  7  3'PRESS:'
     A                                  8  5'f1   Next WO Assignment:'
     A            NWO           10A  B  8 31DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  8 43'Equip:'
     A            ENUM           6A  B  8 51DSPATR(PR)
     A                                      OVRDTA
     A                                  8 59'Location:'
     A            LOCATION       8A  B  8 70DSPATR(PR)
     A                                      OVRDTA
     A                                  9 31'Description:'
     A            DESC          30A  B  9 45DSPATR(PR)
     A                                      OVRDTA
     A                                 11  5'f2   CW - Failure Code:'
     A            FC             2A  B 11 30DSPATR(PR)
     A                                      OVRDTA
     A            SUBS           4A  B 11 33DSPATR(PR)
     A                                      OVRDTA
     A                                 11 39'(Enter Failure Code and Press "f2"-
     A                                       key)'
     A                                 13  5'f3   ***** HELP FUNCTION OR EXIT S-
     A                                      ESSION *****'
     A                                 15  5'f4   IP - Workorder:'
     A            IPNWO         10A  B 15 27DSPATR(UL)
     A  19                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 17  5'f5   Display Workorder:'
     A            DWO           10A  B 17 30DSPATR(UL)
     A  17                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 17 42'(Blank will display Current or Nex-
     A                                      t WO'
     A                                 18 59'===================='
     A                                 19  5'f6   ******  ADDITIONAL FUNCTIONS -
     A                                      MENU  ******        : Enter "NEWS" -
     A                                      and :'
     A                                 20 59': press "ENTER" to :'
     A                                 21  5'f7   Clear Current Clock Card Numb-
     A                                      er from screen      : view news ite-
     A                                      ms. :'
     A                                 22 59'===================='
     A                                 23  5'f8   LV -'
     A            L              1A  B 23 15DSPATR(PR)
     A                                      OVRDTA
     A                                 23 20'New Skill:'
     A            N              2A  B 23 32DSPATR(PR)
     A                                      OVRDTA
     A                                 23 37'Hold For Material:'
     A            H              1A  B 23 57DSPATR(PR)
     A                                      OVRDTA
     A                                 23 60'New MWO:'
     A            NEWWO         10A  B 23 70DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLIN    79A  O 24  1OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R CF8LVWO
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  2'* * * * *   C  R  A  F  T  S  M  A-
     A                                        N    F  U  N  C  T  I  O  N  S   -
     A                                      * * * * *'
     A                                  2  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A                                  3  3'Clock Card Number:'
     A            CNUM           4A  B  3 23DSPATR(PR)
     A                                      OVRDTA
     A                                  3 30'Temporary Zone:'
     A            ZN             4A  B  3 47DSPATR(PR)
     A                                      OVRDTA
     A                                  3 52'(Leave blank for home Zone)'
     A                                  4  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A                                  5  3'Clock Card:'
     A            CCNM           4A  B  5 16DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  5 24'Name:'
     A            NAME          16A  B  5 31DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  5 51'Currently IP on:'
     A            CWO           10A  B  5 69DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  6  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A                                  7  3'PRESS:'
     A                                  8  5'f1   Next WO Assignment:'
     A            NWO           10A  B  8 31DSPATR(PR)
     A                                      OVRDTA
     A                                  8 43'Equip:'
     A            ENUM           6A  B  8 51DSPATR(PR)
     A                                      OVRDTA
     A                                  8 59'Location:'
     A            LOCATION       8A  B  8 70DSPATR(PR)
     A                                      OVRDTA
     A                                  9 31'Description:'
     A            DESC          30A  B  9 45DSPATR(PR)
     A                                      OVRDTA
     A                                 11  5'f2   CW - Failure Code:'
     A            FC             2A  B 11 30DSPATR(PR)
     A                                      OVRDTA
     A            SUBS           4A  B 11 33DSPATR(PR)
     A                                      OVRDTA
     A                                 11 39'(Enter Failure Code and Press "f2"-
     A                                       key)'
     A                                 13  5'f3   ***** HELP FUNCTION OR EXIT S-
     A                                      ESSION *****'
     A                                 15  5'f4   IP - Workorder:'
     A            IPNWO         10A  B 15 27DSPATR(PR)
     A                                      OVRDTA
     A                                 17  5'f5   Display Workorder:'
     A            DWO           10A  B 17 30DSPATR(PR)
     A                                      OVRDTA
     A                                 17 42'(Blank will display Current or Nex-
     A                                      t WO'
     A                                 18 59'===================='
     A                                 19  5'f6   ******  ADDITIONAL FUNCTIONS -
     A                                      MENU  ******        : Enter "NEWS" -
     A                                      and :'
     A                                 20 59': press "ENTER" to :'
     A                                 21  5'f7   Clear Current Clock Card Numb-
     A                                      er from screen      : view news ite-
     A                                      ms. :'
     A                                 22 59'===================='
     A                                 23  5'f8   LV -'
     A            L              1A  B 23 15DSPATR(UL)
     A  18                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 23 20'New Skill:'
     A            N              2A  B 23 32DSPATR(UL)
     A  13                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 23 37'Hold For Material:'
     A            H              1A  B 23 57DSPATR(UL)
     A  14                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 23 60'New MWO:'
     A            NEWWO         10A  B 23 70DSPATR(UL)
     A  15                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            COMMANDLIN    79A  O 24  1OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R CF4IPWO
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  2'* * * * *   C  R  A  F  T  S  M  A-
     A                                        N    F  U  N  C  T  I  O  N  S   -
     A                                      * * * * *'
     A                                  2  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A                                  3  3'Clock Card Number:'
     A            CNUM           4A  B  3 23DSPATR(PR)
     A                                      OVRDTA
     A                                  3 30'Temporary Zone:'
     A            ZN             4A  B  3 47DSPATR(PR)
     A                                      OVRDTA
     A                                  3 52'(Leave blank for home Zone)'
     A                                  4  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A                                  5  3'Clock Card:'
     A            CCNM           4A  B  5 16DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  5 24'Name:'
     A            NAME          16A  B  5 31DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  5 51'Currently IP on:'
     A            CWO           10A  B  5 69DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  6  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A                                  7  3'PRESS:'
     A                                  8  5'f1   Next WO Assignment:'
     A            NWO           10A  B  8 31DSPATR(PR)
     A                                      OVRDTA
     A                                  8 43'Equip:'
     A            ENUM           6A  B  8 51DSPATR(PR)
     A                                      OVRDTA
     A                                  8 59'Location:'
     A            LOCATION       8A  B  8 70DSPATR(PR)
     A                                      OVRDTA
     A                                  9 31'Description:'
     A            DESC          30A  B  9 45DSPATR(PR)
     A                                      OVRDTA
     A                                 11  5'f2   CW - Failure Code:'
     A            FC             2A  B 11 30DSPATR(PR)
     A                                      OVRDTA
     A            SUBS           4A  B 11 33DSPATR(PR)
     A                                      OVRDTA
     A                                 11 39'(Enter Failure Code and Press "f2"-
     A                                       key)'
     A                                 13  5'f3   ***** HELP FUNCTION OR EXIT S-
     A                                      ESSION *****'
     A                                 15  5'f4   IP - Workorder:'
     A            IPNWO         10A  B 15 27DSPATR(UL)
     A  19                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 17  5'f5   Display Workorder:'
     A            DWO           10A  B 17 30DSPATR(PR)
     A                                      OVRDTA
     A                                 17 42'(Blank will display Current or Nex-
     A                                      t WO'
     A                                 18 59'===================='
     A                                 19  5'f6   ******  ADDITIONAL FUNCTIONS -
     A                                      MENU  ******        : Enter "NEWS" -
     A                                      and :'
     A                                 20 59': press "ENTER" to :'
     A                                 21  5'f7   Clear Current Clock Card Numb-
     A                                      er from screen      : view news ite-
     A                                      ms. :'
     A                                 22 59'===================='
     A                                 23  5'f8   LV -'
     A            L              1A  B 23 15DSPATR(PR)
     A                                      OVRDTA
     A                                 23 20'New Skill:'
     A            N              2A  B 23 32DSPATR(PR)
     A                                      OVRDTA
     A                                 23 37'Hold For Material:'
     A            H              1A  B 23 57DSPATR(PR)
     A                                      OVRDTA
     A                                 23 60'New MWO:'
     A            NEWWO         10A  B 23 70DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLIN    79A  O 24  1OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R CF5DISP
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  2'* * * * *   C  R  A  F  T  S  M  A-
     A                                        N    F  U  N  C  T  I  O  N  S   -
     A                                      * * * * *'
     A                                  2  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A                                  3  3'Clock Card Number:'
     A            CNUM           4A  B  3 23DSPATR(PR)
     A                                      OVRDTA
     A                                  3 30'Temporary Zone:'
     A            ZN             4A  B  3 47DSPATR(PR)
     A                                      OVRDTA
     A                                  3 52'(Leave blank for home Zone)'
     A                                  4  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A                                  5  3'Clock Card:'
     A            CCNM           4A  B  5 16DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  5 24'Name:'
     A            NAME          16A  B  5 31DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  5 51'Currently IP on:'
     A            CWO           10A  B  5 69DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  6  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A                                  7  3'PRESS:'
     A                                  8  5'f1   Next WO Assignment:'
     A            NWO           10A  B  8 31DSPATR(PR)
     A                                      OVRDTA
     A                                  8 43'Equip:'
     A            ENUM           6A  B  8 51DSPATR(PR)
     A                                      OVRDTA
     A                                  8 59'Location:'
     A            LOCATION       8A  B  8 70DSPATR(PR)
     A                                      OVRDTA
     A                                  9 31'Description:'
     A            DESC          30A  B  9 45DSPATR(PR)
     A                                      OVRDTA
     A                                 11  5'f2   CW - Failure Code:'
     A            FC             2A  B 11 30DSPATR(PR)
     A                                      OVRDTA
     A            SUBS           4A  B 11 33DSPATR(PR)
     A                                      OVRDTA
     A                                 11 39'(Enter Failure Code and Press "f2"-
     A                                       key)'
     A                                 13  5'f3   ***** HELP FUNCTION OR EXIT S-
     A                                      ESSION *****'
     A                                 15  5'f4   IP - Workorder:'
     A            IPNWO         10A  B 15 27DSPATR(PR)
     A                                      OVRDTA
     A                                 17  5'f5   Display Workorder:'
     A            DWO           10A  B 17 30DSPATR(UL)
     A  17                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 17 42'(Blank will display Current or Nex-
     A                                      t WO'
     A                                 18 59'===================='
     A                                 19  5'f6   ******  ADDITIONAL FUNCTIONS -
     A                                      MENU  ******        : Enter "NEWS" -
     A                                      and :'
     A                                 20 59': press "ENTER" to :'
     A                                 21  5'f7   Clear Current Clock Card Numb-
     A                                      er from screen      : view news ite-
     A                                      ms. :'
     A                                 22 59'===================='
     A                                 23  5'f8   LV -'
     A            L              1A  B 23 15DSPATR(PR)
     A                                      OVRDTA
     A                                 23 20'New Skill:'
     A            N              2A  B 23 32DSPATR(PR)
     A                                      OVRDTA
     A                                 23 37'Hold For Material:'
     A            H              1A  B 23 57DSPATR(PR)
     A                                      OVRDTA
     A                                 23 60'New MWO:'
     A            NEWWO         10A  B 23 70DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLIN    79A  O 24  1OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R CLVCOMM
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1 16'==================================-
     A                                      ================'
     A                                  2 16':    L E A V E  (LV)  A   W O R K -
     A                                        O R D E R    :'
     A                                  3 16'==================================-
     A                                      ================'
     A                                  4  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  5 21'LEAVING INCOMPLETE, WORKORDER:'
     A            LVWO          10A  B  5 53DSPATR(UL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  6  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  7  9'EQUIP:'
     A            ENUM           6A  B  7 17DSPATR(PR)
     A                                      OVRDTA
     A                                  7 28'ZONE:'
     A            ZONE           4A  B  7 35DSPATR(PR)
     A                                      OVRDTA
     A                                  7 44'DEPT:'
     A            DEPT           4A  B  7 51DSPATR(PR)
     A                                      OVRDTA
     A                                  7 60'PRIORITY:'
     A            PT             2A  B  7 71DSPATR(PR)
     A                                      OVRDTA
     A                                  8  9'DESCRIPTION:'
     A            DESC          30A  B  9 11DSPATR(PR)
     A                                      OVRDTA
     A            D2            66A  B 10 11DSPATR(PR)
     A                                      OVRDTA
     A            D3            66A  B 11 11DSPATR(PR)
     A                                      OVRDTA
     A                                 13  9'REASON FOR LEAVING:'
     A            RFL           40A  B 13 30DSPATR(PR)
     A                                      OVRDTA
     A                                 15  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 16  7'COMMENTS:'
     A            RO            10A  B 16 18DSPATR(PR)
     A                                      OVRDTA
     A            C1            70A  B 17  7DSPATR(UL)
     A  01                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            C2            70A  B 18  7DSPATR(UL)
     A  02                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            C3            70A  B 19  7DSPATR(UL)
     A  03                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            C4            70A  B 20  7DSPATR(UL)
     A  04                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            C5            70A  B 21  7DSPATR(UL)
     A  05                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 23 20'ENTER COMMENTS AND PRESS "ENTER" K-
     A                                      EY'
     A            COMMANDLIN    79A  O 24  1OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R COMPWO
     A*%%TS  DD  20021112  122554  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1 15'==================================-
     A                                      =================='
     A                                  2 15':  C O M P L E T E  (CW)  A   W O -
     A                                      R K   O R D E R  :'
     A                                  3 15'==================================-
     A                                      =================='
     A                                  4  5'WAS MACHINE STOPPED AT ANY TIME TO-
     A                                       COMPLETE THIS WORKORDER (Y/N):  '
     A            ED             1A  B  4 73DSPATR(UL)
     A  45                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            FILL           1A  B  4 76DSPATR(PR)
     A                                      OVRDTA
     A                                  5  2'Enter Failure Code:'
     A                                  5 39'PRINT WO ON ZONE PRINTER (Y/N):'
     A            PRT            1A  B  5 73DSPATR(UL)
     A  46                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            FC1            1A  B  6 10DSPATR(UL)
     A  06                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            FC2            1A  B  6 12DSPATR(UL)
     A  07                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  6 14'-'
     A            FC3            1A  B  6 16DSPATR(UL)
     A  08                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            FC4            1A  B  6 18DSPATR(UL)
     A  09                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            FC5            1A  B  6 20DSPATR(UL)
     A  10                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            FC6            1A  B  6 22DSPATR(UL)
     A  11                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A N90                              6 26'and Press "ENTER" OR Press "f8" To-
     A                                       Leave (LV) WO'
     A  90                              6 26'and Press "ENTER"                 -
     A                                                    '
     A                                  7  3'Comments:'
     A                                  7 18'Clock Card Number:'
     A            CCNM           4A  B  7 38DSPATR(PR)
     A                                      OVRDTA
     A                                  7 48'Workorder Number:'
     A            WO            10A  B  7 67DSPATR(PR)
     A                                      OVRDTA
     A            C1            70A  B  8  5DSPATR(UL)
     A  01                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            C2            70A  B  9  5DSPATR(UL)
     A  02                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            C3            70A  B 10  5DSPATR(UL)
     A  03                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            C4            70A  B 11  5DSPATR(UL)
     A  04                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            C5            70A  B 12  5DSPATR(UL)
     A  05                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            AA             1A  B 13 10DSPATR(PR)
     A                                      OVRDTA
     A            D1            40A  B 13 14DSPATR(PR)
     A                                      OVRDTA
     A            BB             1A  B 14 10DSPATR(PR)
     A                                      OVRDTA
     A            D2            40A  B 14 14DSPATR(PR)
     A                                      OVRDTA
     A                                 14 57'======================='
     A            CC             1A  B 15 10DSPATR(PR)
     A                                      OVRDTA
     A            D3            40A  B 15 14DSPATR(PR)
     A                                      OVRDTA
     A                                 15 57': NOTE:  Comments are :'
     A            DD             1A  B 16 10DSPATR(PR)
     A                                      OVRDTA
     A            D4            40A  B 16 14DSPATR(PR)
     A                                      OVRDTA
     A                                 16 57': optional and do not :'
     A            EE             1A  B 17 10DSPATR(PR)
     A                                      OVRDTA
     A            D5            40A  B 17 14DSPATR(PR)
     A                                      OVRDTA
     A                                 17 57': HAVE to be entered. :'
     A            FF             1A  B 18 10DSPATR(PR)
     A                                      OVRDTA
     A            D6            40A  B 18 14DSPATR(PR)
     A                                      OVRDTA
     A            GG             1A  B 19 10DSPATR(PR)
     A                                      OVRDTA
     A            D7            40A  B 19 14DSPATR(PR)
     A                                      OVRDTA
     A            HH             1A  B 20 10DSPATR(PR)
     A                                      OVRDTA
     A            D8            40A  B 20 14DSPATR(PR)
     A                                      OVRDTA
     A            II             1A  B 21 10DSPATR(PR)
     A                                      OVRDTA
     A            D9            40A  B 21 14DSPATR(PR)
     A                                      OVRDTA
     A                                 18 57'======================='
     A            JJ             1A  B 22 10DSPATR(PR)
     A                                      OVRDTA
     A            D10           40A  B 22 14DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLIN    79A  O 23  1OVRDTA
     A*                                     DFT('F1=OVERRIDE SUBSYS            -
     A*                                               F5=DISPLAY WO       F6=CH-
     A*                                     ANGE WO')
     A            SSLIN         79A  O 24  1DSPATR(BL)
     A                                      OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A*%%GP SCREEN1    01
     A          R LVCHECK
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                  4  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  5  2':'
     A                                  5 79':'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8 12'ONCE THE "LV" PROCESS HAS BEEN STA-
     A                                      RTED THE TRANSACTION'
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10 10'MUST BE COMPLETED IN ORDER TO KEEP'
     A                                 10 45'THE DATA FILES IN ORDER'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':    IF THE "f8" KEY WAS PRESSED I-
     A                                      N ERROR, PRESS ANY FUNCTION KEY TO'
     A                                 14 71'CANCEL  :'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 12'TO LEAVE THE WORKORDER PRESS THE "-
     A                                      ENTER" KEY TO CONTINUE'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A            COMMANDLN1    79A  B 24  1DFTVAL('ANY FUNCTION KEY WILL CANCE-
     A                                      L THE ''LV'' TRANSACTION - ''ENTER'-
     A                                      ' TO CONTINUE')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R CRFTEXEC
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  2'* * * * *   C  R  A  F  T  S  M  A-
     A                                        N    F  U  N  C  T  I  O  N  S   -
     A                                      * * * * *'
     A                                  2  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A                                  3  3'Clock Card Number:'
     A            CNUM           4A  B  3 23DSPATR(UL)
     A  01                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  3 30'Temporary Zone:'
     A            ZN             4A  B  3 47DSPATR(UL)
     A  06                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  3 52'(Leave blank for home Zone)'
     A                                  4  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A                                  5  3'Clock Card:'
     A            CCNM           4A  B  5 16DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  5 24'Name:'
     A            NAME          16A  B  5 31DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  5 51'Currently IP on:'
     A            CWO           10A  B  5 69DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  6  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A                                  7  3'PRESS:'
     A                                  8  5'f1   Next WO Assignment:'
     A            NWO           10A  B  8 31DSPATR(PR)
     A                                      OVRDTA
     A                                  8 43'Equip:'
     A            ENUM           6A  B  8 51DSPATR(PR)
     A                                      OVRDTA
     A                                  8 59'Location:'
     A            LOCATION       8A  B  8 70DSPATR(PR)
     A                                      OVRDTA
     A                                  9 31'Description:'
     A            DESC          30A  B  9 45DSPATR(PR)
     A                                      OVRDTA
     A                                 11  5'f2   CW - Failure Code:'
     A            FC             2A  B 11 30DSPATR(PR)
     A                                      OVRDTA
     A            SUBS           4A  B 11 33DSPATR(PR)
     A                                      OVRDTA
     A                                 11 39'(Enter Failure Code and Press "f2"-
     A                                       key)'
     A                                 13  5'f3   ***** HELP FUNCTION OR EXIT S-
     A                                      ESSION *****'
     A                                 15  5'f4   IP - Workorder:'
     A            IPNWO         10A  B 15 27DSPATR(PR)
     A                                      OVRDTA
     A                                 17  5'f5   Display Workorder:'
     A            DWO           10A  B 17 30DSPATR(PR)
     A                                      OVRDTA
     A                                 17 42'(Blank will display Current or Nex-
     A                                      t WO'
     A                                 18 59'===================='
     A                                 19  5'f6   ******  ADDITIONAL FUNCTIONS -
     A                                      MENU  ******        : Enter "NEWS" -
     A                                      and :'
     A                                 20 59': press "ENTER" to :'
     A                                 21  5'f7   Clear Current Clock Card Numb-
     A                                      er from screen      : view news ite-
     A                                      ms. :'
     A                                 22 59'===================='
     A                                 23  5'f8   LV -'
     A            L              1A  B 23 15DSPATR(PR)
     A                                      OVRDTA
     A                                 23 20'New Skill:'
     A            N              2A  B 23 32DSPATR(PR)
     A                                      OVRDTA
     A                                 23 37'Hold For Material:'
     A            H              1A  B 23 57DSPATR(PR)
     A                                      OVRDTA
     A                                 23 60'New MWO:'
     A            NEWWO         10A  B 23 70DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLIN    79A  O 24  1OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R DISPPLAN
     A*%%TS  SD  19930527  073758  A193138     REL-V2R2M0  5738-PW1
     A                                      PUTOVR
     A          H                           HLPRCD(HELP00)
     A                                      HLPARA(1 1 24 80)
     A                                  1  3'==================================-
     A                                      ======'
     A                                  2  3':  P L A N N E D    W O R K O R D -
     A                                      E R  :'
     A                                  3  3'==================================-
     A                                      ======                DATE:'
     A            CURRDATE       8A  B  3 65DSPATR(PR)
     A            CURTM          5A  B  3 75DSPATR(PR)
     A                                      OVRDTA
     A                                  5  1'W/O NUM:'
     A            WONUM         10A  B  5 10DSPATR(UL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  5 24'W/O STATUS:'
     A            ST             2A  B  5 36DSPATR(UL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  5 42'TYPE:'
     A            TP             2A  B  5 48DSPATR(PR)
     A                                      OVRDTA
     A                                  5 54'DATE RECD:'
     A            MR             2A  B  5 65DSPATR(PR)
     A                                      OVRDTA
     A            DR             2A  B  5 68DSPATR(PR)
     A                                      OVRDTA
     A            YR             2A  B  5 71DSPATR(PR)
     A                                      OVRDTA
     A            RM             2A  B  5 75DSPATR(PR)
     A                                      OVRDTA
     A            HR             2A  B  5 78DSPATR(PR)
     A                                      OVRDTA
     A                                  6  1'APPROVAL:'
     A            A              1A  B  6 11DSPATR(PR)
     A                                      OVRDTA
     A                                  6 27'REQUESTER:'
     A            REQEST        16A  B  6 38DSPATR(PR)
     A                                      OVRDTA
     A                                  6 63'EQUIP NUM:'
     A            EQPNUM         6A  B  6 74DSPATR(PR)
     A                                      OVRDTA
     A                                  7  1'EQUIPMENT NAME:'
     A            EQPNAME       50A  B  7 17DSPATR(PR)
     A                                      OVRDTA
     A            TYPNUM         8A  B  7 71DSPATR(PR)
     A                                      OVRDTA
     A                                  8  1'DEPT:'
     A            DEPT           4A  B  8  7DSPATR(PR)
     A                                      OVRDTA
     A                                  8 14'MAINT ZONE:'
     A            ZONE           4A  B  8 26DSPATR(PR)
     A                                      OVRDTA
     A                                  8 34'LOCATION:'
     A            LOC            8A  B  8 44DSPATR(PR)
     A                                      OVRDTA
     A                                  8 56'PRIORITY:'
     A            P              1A  B  8 66DSPATR(PR)
     A                                      OVRDTA
     A                                  8 72'RIME:'
     A            RI             2A  B  8 78DSPATR(PR)
     A                                      OVRDTA
     A                                  9  1'EQUIP DOWN:'
     A            D              1A  B  9 13DSPATR(PR)
     A                                      OVRDTA
     A                                  9 30'EXP CLASS:'
     A            EXPCL          8A  B  9 41DSPATR(PR)
     A                                      OVRDTA
     A                                  9 54'TIME REQD:'
     A            MQ             2A  B  9 65DSPATR(PR)
     A                                      OVRDTA
     A            DQ             2A  B  9 68DSPATR(PR)
     A                                      OVRDTA
     A            YQ             2A  B  9 71DSPATR(PR)
     A                                      OVRDTA
     A            QM             2A  B  9 75DSPATR(PR)
     A                                      OVRDTA
     A            HQ             2A  B  9 78DSPATR(PR)
     A                                      OVRDTA
     A                                 10  1'DESCRIPTION:'
     A            DESC30        30A  B 10 14DSPATR(UL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            DESC661       66A  B 11 14DSPATR(UL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            DESC662       66A  B 12 14DSPATR(UL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            DESC663       66A  B 13 14DSPATR(UL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            DESC664       66A  B 14 14DSPATR(UL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                 15  1'SPECL INSTR:'
     A            DESC665       66A  B 15 14DSPATR(PR)
     A                                      OVRDTA
     A            DESC666       66A  B 16 14DSPATR(PR)
     A                                      OVRDTA
     A                                 17  1'SPECL EQUIP:'
     A            DESC667       66A  B 17 14DSPATR(PR)
     A                                      OVRDTA
     A                                 18  1'SAFETY NOTE:'
     A            DESC668       66A  B 18 14DSPATR(UL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                 19  1'ENGINEER:'
     A            ENGR           4A  B 19 11DSPATR(PR)
     A                                      OVRDTA
     A                                 19 19'PLANNER:'
     A            PLAN           4A  B 19 28DSPATR(PR)
     A                                      OVRDTA
     A                                 19 36'SCHEDULER:'
     A            SCHD           4A  B 19 47DSPATR(PR)
     A                                      OVRDTA
     A                                 19 54'TIME SCHD:'
     A            MT             2A  B 19 65DSPATR(PR)
     A                                      OVRDTA
     A            DT             2A  B 19 68DSPATR(PR)
     A                                      OVRDTA
     A            YT             2A  B 19 71DSPATR(PR)
     A                                      OVRDTA
     A            TM             2A  B 19 75DSPATR(PR)
     A                                      OVRDTA
     A            HT             2A  B 19 78DSPATR(PR)
     A                                      OVRDTA
     A                                 20  1'BUDGET NO:'
     A            BUDNO         13A  B 20 12DSPATR(PR)
     A                                      OVRDTA
     A                                 20 31'REQ NO:'
     A            REQNO         12A  B 20 40DSPATR(PR)
     A                                      OVRDTA
     A                                 20 54'TIME STRT:'
     A            MS             2A  B 20 65DSPATR(PR)
     A                                      OVRDTA
     A            DS             2A  B 20 68DSPATR(PR)
     A                                      OVRDTA
     A            YS             2A  B 20 71DSPATR(PR)
     A                                      OVRDTA
     A            SM             2A  B 20 75DSPATR(PR)
     A                                      OVRDTA
     A            HS             2A  B 20 78DSPATR(PR)
     A                                      OVRDTA
     A                                 21  1'FAILURE CODE:'
     A            F1             2A  B 21 15DSPATR(PR)
     A                                      OVRDTA
     A            F2             4A  B 21 18DSPATR(PR)
     A                                      OVRDTA
     A                                 21 25'JOBPLAN NAME:'
     A            JPNAM         10A  B 21 40DSPATR(PR)
     A                                      OVRDTA
     A                                 21 54'TIME COMP:'
     A            MC             2A  B 21 65DSPATR(PR)
     A                                      OVRDTA
     A            DC             2A  B 21 68DSPATR(PR)
     A                                      OVRDTA
     A            YC             2A  B 21 71DSPATR(PR)
     A                                      OVRDTA
     A            CM             2A  B 21 75DSPATR(PR)
     A                                      OVRDTA
     A            HC             2A  B 21 78DSPATR(PR)
     A                                      OVRDTA
     A                                 22  1'MASTER SCHEDULE NAME:'
     A            SCHEDNAME     10A  B 22 24DSPATR(PR)
     A                                      OVRDTA
     A                                 23  1'F1=RETURN TO MENU   F5=VIEW WO MES-
     A                                      SAGES F6=DISPLAY HISTORY'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F3=EXIT PROGRAM')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R DISPVERB
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  3'==================================-
     A                                      ===='
     A                                  2  3':  V E R B A L    W O R K O R D E -
     A                                      R  :'
     A                                  3  3'==================================-
     A                                      ====                  DATE:'
     A            CURRDATE       8A  B  3 65DSPATR(PR)
     A                                      OVRDTA
     A            CURTM          5A  B  3 75DSPATR(PR)
     A                                      OVRDTA
     A                                  6  1'W/O NUM:'
     A            WONUM         10A  B  6 10DSPATR(UL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  6 24'W/O STATUS:'
     A            ST             2A  B  6 36DSPATR(UL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  6 42'TYPE:'
     A            TP             2A  B  6 48DSPATR(PR)
     A                                      OVRDTA
     A                                  6 54'DATE RECD:'
     A            MR             2A  B  6 65DSPATR(PR)
     A                                      OVRDTA
     A            DR             2A  B  6 68DSPATR(PR)
     A                                      OVRDTA
     A            YR             2A  B  6 71DSPATR(PR)
     A                                      OVRDTA
     A            RM             2A  B  6 75DSPATR(PR)
     A                                      OVRDTA
     A            HR             2A  B  6 78DSPATR(PR)
     A                                      OVRDTA
     A                                  8  1'APPROVAL:'
     A            A              1A  B  8 11DSPATR(PR)
     A                                      OVRDTA
     A                                  8 27'REQUESTER:'
     A            REQEST        16A  B  8 38DSPATR(PR)
     A                                      OVRDTA
     A                                  8 63'EQUIP NUM:'
     A            EQPNUM         6A  B  8 74DSPATR(PR)
     A                                      OVRDTA
     A                                 10  1'EQUIPMENT NAME:'
     A            EQPNAME       50A  B 10 17DSPATR(PR)
     A                                      OVRDTA
     A            TYPNUM         8A  B 10 71DSPATR(PR)
     A                                      OVRDTA
     A                                 12  1'DEPT:'
     A            DEPT           4A  B 12  7DSPATR(PR)
     A                                      OVRDTA
     A                                 12 19'MAINT ZONE:'
     A            ZONE           4A  B 12 31DSPATR(PR)
     A                                      OVRDTA
     A                                 12 44'LOCATION:'
     A            LOC            8A  B 12 54DSPATR(PR)
     A                                      OVRDTA
     A                                 12 69'PRIORITY:'
     A            P              1A  B 12 79DSPATR(PR)
     A                                      OVRDTA
     A                                 14  1'EQUIP DOWN:'
     A            D              1A  B 14 13DSPATR(PR)
     A                                      OVRDTA
     A                                 14 25'CRAFT REQD:'
     A            C1             2A  B 14 37DSPATR(PR)
     A                                      OVRDTA
     A            C2             2A  B 14 40DSPATR(PR)
     A                                      OVRDTA
     A            C3             2A  B 14 43DSPATR(PR)
     A                                      OVRDTA
     A                                 14 61'EXP CLASS:'
     A            EXPCL          8A  B 14 72DSPATR(PR)
     A                                      OVRDTA
     A                                 16  1'DESCRIPTION:'
     A            DESC30        30A  B 16 14DSPATR(UL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            DESC661       66A  B 17 14DSPATR(UL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            DESC662       66A  B 18 14DSPATR(UL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                 20  1'CRAFTSMEN:'
     A            CFT1           4A  B 20 12DSPATR(PR)
     A                                      OVRDTA
     A            CFT2           4A  B 20 18DSPATR(PR)
     A                                      OVRDTA
     A            CFT3           4A  B 20 24DSPATR(PR)
     A                                      OVRDTA
     A                                 20 54'TIME STRT:'
     A            MS             2A  B 20 65DSPATR(PR)
     A                                      OVRDTA
     A            DS             2A  B 20 68DSPATR(PR)
     A                                      OVRDTA
     A            YS             2A  B 20 71DSPATR(PR)
     A                                      OVRDTA
     A            SM             2A  B 20 75DSPATR(PR)
     A                                      OVRDTA
     A            HS             2A  B 20 78DSPATR(PR)
     A                                      OVRDTA
     A                                 22  1'FAILURE CODE:'
     A            F1             2A  B 22 15DSPATR(PR)
     A                                      OVRDTA
     A            F2             4A  B 22 18DSPATR(PR)
     A                                      OVRDTA
     A                                 22 54'TIME COMP:'
     A            MC             2A  B 22 65DSPATR(PR)
     A                                      OVRDTA
     A            DC             2A  B 22 68DSPATR(PR)
     A                                      OVRDTA
     A            YC             2A  B 22 71DSPATR(PR)
     A                                      OVRDTA
     A            CM             2A  B 22 75DSPATR(PR)
     A                                      OVRDTA
     A            HC             2A  B 22 78DSPATR(PR)
     A                                      OVRDTA
     A                                 23  1'F1=RETURN TO MENU   F5=VIEW WO MES-
     A                                      SAGES F6=DISPLAY HISTORY'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F3=EXIT PROGRAM')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R FULLSCRN
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A            F1            79A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            F2            79A  B  2  2DSPATR(PR)
     A                                      OVRDTA
     A            F3            79A  B  3  2DSPATR(PR)
     A                                      OVRDTA
     A            F4            79A  B  4  2DSPATR(PR)
     A                                      OVRDTA
     A            F5            79A  B  5  2DSPATR(PR)
     A                                      OVRDTA
     A            F6            79A  B  6  2DSPATR(PR)
     A                                      OVRDTA
     A            F7            79A  B  7  2DSPATR(PR)
     A                                      OVRDTA
     A            F8            79A  B  8  2DSPATR(PR)
     A                                      OVRDTA
     A            F9            79A  B  9  2DSPATR(PR)
     A                                      OVRDTA
     A            F10           79A  B 10  2DSPATR(PR)
     A                                      OVRDTA
     A            F11           79A  B 11  2DSPATR(PR)
     A                                      OVRDTA
     A            F12           79A  B 12  2DSPATR(PR)
     A                                      OVRDTA
     A            F13           79A  B 13  2DSPATR(PR)
     A                                      OVRDTA
     A            F14           79A  B 14  2DSPATR(PR)
     A                                      OVRDTA
     A            F15           79A  B 15  2DSPATR(PR)
     A                                      OVRDTA
     A            F16           79A  B 16  2DSPATR(PR)
     A                                      OVRDTA
     A            F17           79A  B 17  2DSPATR(PR)
     A                                      OVRDTA
     A            F18           79A  B 18  2DSPATR(PR)
     A                                      OVRDTA
     A            F19           79A  B 19  2DSPATR(PR)
     A                                      OVRDTA
     A            F20           79A  B 20  2DSPATR(PR)
     A                                      OVRDTA
     A            F21           79A  B 21  2DSPATR(PR)
     A                                      OVRDTA
     A            F22           79A  B 22  2DSPATR(PR)
     A                                      OVRDTA
     A            F23           79A  B 23  2DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLIN    79A  O 24  2
     A  96                                  OVRDTA
     A                                      DFT('F1=RETURN    F3=EXIT PROGRAM  -
     A                                       PRESS "ENTER" FOR NEXT SCREEN')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R HELP00
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  7'==================================-
     A                                      ==================================='
     A                                  2  7':  C R A F T S M A N   F U N C T I-
     A                                       O N S   H E L P   S C R E E N S  :'
     A                                  3  7'==================================-
     A                                      ==================================='
     A                                  6  9'PRESS APPROPRIATE FUNCTION KEY FOR-
     A                                       INFORMATION ON:'
     A                                  8 19'f1   -   Next Workorder Assignment'
     A                                 10 19'f2   -   Closing a Workorder'
     A                                 12 19'f4   -   Starting a Workorder'
     A                                 14 19'f5   -   Displaying Workorder Info-
     A                                      rmation'
     A                                 16 19'f6   -   Additional Functions'
     A                                 18 19'f7   -   Clearing Current Clock Ca-
     A                                      rd from Screen'
     A                                 20 19'f8   -   Leaving a Workorder'
     A                                 23 74'HELP 0'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F3=EXIT HELP')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R HELP01
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A  96                                  CF24
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  7'==================================-
     A                                      ==================================='
     A                                  2  7':  C R A F T S M A N   F U N C T I-
     A                                       O N S   H E L P   S C R E E N S  :'
     A                                  3  7'==================================-
     A                                      ==================================='
     A                                  4 14'Craftsman Functions Opening Screen-
     A                                       and Initial Input:'
     A                                  6  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A                                  7  1'  Clock Card Number:  (A).   Tempo-
     A                                      rary Zone:  (B). (Leave Blank for H-
     A                                      ome Zone)'
     A                                  8  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A                                  9  1'  Clock Card:  (C).    Name:  (D).-
     A                                      ............    Currently IP on:  (-
     A                                      E).......'
     A                                 10  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A                                 11  1'At initiation, fields A thru E are-
     A                                       blank.'
     A                                 12  4'A - Clock Card (Badge) Number is i-
     A                                      nput here (required) to identify th-
     A                                      e user'
     A                                 13  8'to the system.'
     A                                 14  4'B - Optional Temporary Zone for Au-
     A                                      tomatic Assignment is entered here.'
     A                                 16  1'Field A must be entered and field -
     A                                      B is optionally entered and the "EN-
     A                                      TER" key'
     A                                 17  3'is pressed.  Fields C thru E will -
     A                                      then appear on a secondary screen.'
     A                                 18  4'C - Current Clock Card Number iden-
     A                                      tified in system is displayed here.'
     A                                 19  4'D - User Name (Current Clock Card)-
     A                                       is displayed here.'
     A                                 20  4'E - If user is in progress on a wo-
     A                                      rkorder, the workorder number will -
     A                                      appear'
     A                                 21  8'here, otherwise the word "UNASSIGN-
     A                                      ED" will appear.'
     A                                 23 74'HELP 0'
     A  95                             24  1'                    F3=EXIT HELP  -
     A                                            F24=More keys'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F2=NEXT SCREEN      F8=PREVIOU-
     A                                      S SCREEN  F5=HELP MENU        F24=M-
     A                                      ore keys')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R HELP02
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A  96                                  CF24
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  7'==================================-
     A                                      ==================================='
     A                                  2  7':  C R A F T S M A N   F U N C T I-
     A                                       O N S   H E L P   S C R E E N S  :'
     A                                  3  7'==================================-
     A                                      ==================================='
     A                                  4 14'Craftsman Functions Opening Screen-
     A                                       and Initial Input:'
     A                                  6  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A                                  7  1'  Clock Card Number:  (A).   Tempo-
     A                                      rary Zone:  (B). (Leave Blank for H-
     A                                      ome Zone)'
     A                                  8  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A                                  9  1'  Clock Card:  (C).    Name:  (D).-
     A                                      ............    Currently IP on:  (-
     A                                      E).......'
     A                                 10  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A                                 12  1'If the word "NEWS" is entered in f-
     A                                      ield A, and the "ENTER" key is pres-
     A                                      sed, the'
     A                                 13  1'MMIS NEWS System (Bulletin Board) -
     A                                      is displayed.  The Bulletin Board a-
     A                                      llows'
     A                                 14  1'plant-wide news to be distributed -
     A                                      to each terminal from the MMIS mana-
     A                                      ger in the'
     A                                 15  1'plant.'
     A                                 23 74'HELP 0'
     A  95                             24  1'                    F3=EXIT HELP  -
     A                                            F24=More keys'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F2=NEXT SCREEN      F8=PREVIOU-
     A                                      S SCREEN  F5=HELP MENU        F24=M-
     A                                      ore keys')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R HELP10
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A  96                                  CF24
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  7'==================================-
     A                                      ==================================='
     A                                  2  7':  C R A F T S M A N   F U N C T I-
     A                                       O N S   H E L P   S C R E E N S  :'
     A                                  3  7'==================================-
     A                                      ==================================='
     A                                  5 10'Selection of the "f1" key, Assignm-
     A                                      ent from the Automatic Queue:'
     A                                  7  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  8  5'f1   Next WO Assignment:  (A).....-
     A                                      ..  Equip:  (B)...  Location:  (C).-
     A                                      ....'
     A                                  9 31'Description:  (D).................-
     A                                      ..........'
     A                                 10  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 11  1'If a Workorder is available from t-
     A                                      he Automatic Assignment Queue, the -
     A                                      informatio'
     A                                 12  1'will be displayed as follows:'
     A                                 13  4'A - Workorder number'
     A                                 14  4'B - Specific local equipment numbe-
     A                                      r involved.'
     A                                 15  4'C - Equipment location.'
     A                                 16  4'D - Short Workorder description.'
     A                                 17  1'If the "f1" key is pressed, the cu-
     A                                      rrent Craftsman will be placed In-P-
     A                                      rogress'
     A                                 18  1'(IP) on this workorder.'
     A                                 19  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 20  1'If the craftsman is already "IP" o-
     A                                      n a workorder, and if the multiple -
     A                                      "IP"'
     A                                 21  1'(workorder reservation) system is -
     A                                      turned on, the "f1" will display th-
     A                                      e list'
     A                                 22  1'of workorders which this craftsman-
     A                                       has reserved.'
     A                                 23 74'HELP 1'
     A  95                             24  1'                    F3=EXIT HELP  -
     A                                            F24=More keys'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F2=NEXT SCREEN      F8=PREVIOU-
     A                                      S SCREEN  F5=HELP MENU        F24=M-
     A                                      ore keys')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R HELP20
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A  96                                  CF24
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  7'==================================-
     A                                      ==================================='
     A                                  2  7':  C R A F T S M A N   F U N C T I-
     A                                       O N S   H E L P   S C R E E N S  :'
     A                                  3  7'==================================-
     A                                      ==================================='
     A                                  5 17'Selection of the "f2" key, Closing-
     A                                       a Workorder:'
     A                                  7  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  8  5'f2   CW - Failure Code:  A.-....  -
     A                                      (Enter Failure Code and Press "f2" -
     A                                      key)'
     A                                  9  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 11  1'If the Current Craftsman is IP on -
     A                                      a Workorder, field A will appear in-
     A                                       inverse'
     A                                 12  1'video.  The Failure Code may be in-
     A                                      put here if known, or the field may-
     A                                       be left'
     A                                 13  1'blank.  In either case, when the "-
     A                                      f2" key is pressed, the screen will-
     A                                       change to'
     A                                 14  1'allow entry of an optional closing-
     A                                       comment to the workorder as well a-
     A                                      s promptin'
     A                                 15  1'for valid sub-systems if the failu-
     A                                      re code is not known or if it is en-
     A                                      tered'
     A                                 16  1'incorrectly.'
     A                                 18  1'If the "f2" key is pressed, the cu-
     A                                      rrent Craftsman will be placed Inac-
     A                                      tive from'
     A                                 19  1'this workorder and if there are no-
     A                                       other craftsmen IP on the workorde-
     A                                      r, it will'
     A                                 20  1'be closed (workorder status change-
     A                                      d to CW).'
     A                                 23 74'HELP 2'
     A  95                             24  1'                    F3=EXIT HELP  -
     A                                            F24=More keys'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F2=NEXT SCREEN      F8=PREVIOU-
     A                                      S SCREEN  F5=HELP MENU        F24=M-
     A                                      ore keys')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R HELP30
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A  96                                  CF24
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  7'==================================-
     A                                      ==================================='
     A                                  2  7':  C R A F T S M A N   F U N C T I-
     A                                       O N S   H E L P   S C R E E N S  :'
     A                                  3  7'==================================-
     A                                      ==================================='
     A                                  5 17'Selection of the "f8" key, Leaving-
     A                                       a Workorder:'
     A                                  7  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  8  5'f8   LV - A    New Skill:  B.   Ho-
     A                                      ld For Material:  C  New MWO:  D...-
     A                                      ......'
     A                                  9  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 11  1'If the Current Craftsman is IP on -
     A                                      a Workorder, he may Leave (LV) the -
     A                                      workorder'
     A                                 12  1'in one of four ways.'
     A                                 13  3'A - Leave workorder not completed.-
     A                                        (An "X" is input)'
     A                                 14  3'B - Leave workorder, New Skill (an-
     A                                      other Craft) Required.  (New Skill -
     A                                      is input'
     A                                 15  3'C - Leave workorder, required part-
     A                                      s not available.  NOTE:  In this ca-
     A                                      se, the'
     A                                 16  7'workorder is placed in "HM" status-
     A                                       - hold for material.  (An "X" is i-
     A                                      nput'
     A                                 17  3'D - Leave to start work on another-
     A                                       workorder.  (New workorder number -
     A                                      is input'
     A                                 19  1'If the "f8" key is pressed, the cu-
     A                                      rrent Craftsman will be placed Inac-
     A                                      tive from'
     A                                 20  1'current workorder and a screen wil-
     A                                      l appear allowing input of a commen-
     A                                      t to the'
     A                                 21  1'workorder describing work done and-
     A                                      /or reason for leaving.  If option -
     A                                      A, B, or C'
     A                                 22  1'is selected, the comment is requir-
     A                                      ed.'
     A                                 23 74'HELP 3'
     A  95                             24  1'                    F3=EXIT HELP  -
     A                                            F24=More keys'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F2=NEXT SCREEN      F8=PREVIOU-
     A                                      S SCREEN  F5=HELP MENU        F24=M-
     A                                      ore keys')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R HELP40
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A  96                                  CF24
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  7'==================================-
     A                                      ==================================='
     A                                  2  7':  C R A F T S M A N   F U N C T I-
     A                                       O N S   H E L P   S C R E E N S  :'
     A                                  3  7'==================================-
     A                                      ==================================='
     A                                  5 17'Selection of the "f4" key, Startin-
     A                                      g a Workorder:'
     A                                  7  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  8  5'f4   IP - Workorder:  A.........'
     A                                  9  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 11  1'If the Current Craftsman is UNASSI-
     A                                      GNED, field A will appear in invers-
     A                                      e video.'
     A                                 12  1'A valid workorder number may be en-
     A                                      tered, and when the "f4" key is pre-
     A                                      ssed, the'
     A                                 13  1'craftsman will be placed active (I-
     A                                      P) on the workorder.'
     A                                 23 74'HELP 4'
     A  95                             24  1'                    F3=EXIT HELP  -
     A                                            F24=More keys'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F2=NEXT SCREEN      F8=PREVIOU-
     A                                      S SCREEN  F5=HELP MENU        F24=M-
     A                                      ore keys')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R HELP50
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A  96                                  CF24
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  7'==================================-
     A                                      ==================================='
     A                                  2  7':  C R A F T S M A N   F U N C T I-
     A                                       O N S   H E L P   S C R E E N S  :'
     A                                  3  7'==================================-
     A                                      ==================================='
     A                                  5 20'Selection of the "f5" key, Display-
     A                                       Workorder:'
     A                                  7  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  8  5'f5   Display Workorder:  A........-
     A                                      .  (Blank will display Current or N-
     A                                      ext WO'
     A                                  9  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 11  1'A valid workorder number may be en-
     A                                      tered, and when the "f5" key is pre-
     A                                      ssed, the'
     A                                 12  1'workorder will be displayed on the-
     A                                       screen.  Additionally, from the di-
     A                                      splay'
     A                                 13  1'screen, the display may be screen--
     A                                      printed, any messages written to th-
     A                                      e workorde'
     A                                 14  1'may be displayed, and a list of al-
     A                                      l other workorders currently in the-
     A                                       system'
     A                                 15  1'which are written to the same piec-
     A                                      e of equipment may be displayed.'
     A                                 17  1'If the craftsman is assigned, (IP -
     A                                      on a workorder) and field A is left-
     A                                       blank whe'
     A                                 18  1'the "f5" key is pressed, the worko-
     A                                      rder to which he is assigned to wil-
     A                                      l be'
     A                                 19  1'displayed.  If he is UNASSIGNED an-
     A                                      d there is a workorder in the Autom-
     A                                      atic'
     A                                 20  1'Assignment Queue available for him-
     A                                      , (see "f1" function), that workord-
     A                                      er will be'
     A                                 21  1'displayed.'
     A                                 23 74'HELP 5'
     A  95                             24  1'                    F3=EXIT HELP  -
     A                                            F24=More keys'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F2=NEXT SCREEN      F8=PREVIOU-
     A                                      S SCREEN  F5=HELP MENU        F24=M-
     A                                      ore keys')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R HELP60
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  7'==================================-
     A                                      ==================================='
     A                                  2  7':  C R A F T S M A N   F U N C T I-
     A                                       O N S   H E L P   S C R E E N S  :'
     A                                  3  7'==================================-
     A                                      ==================================='
     A                                  4 12'Selection of the "f6" key, Additio-
     A                                      nal Craftsman Functions:'
     A                                  6  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  7  6'f6   ******  ADDITIONAL FUNCTIONS -
     A                                      MENU  ******'
     A                                  8  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 10  9'PRESS APPROPRIATE FUNCTION KEY FOR-
     A                                       INFORMATION ON:'
     A                                 12 19'f1   -   Automatic Queue Backlog I-
     A                                      nquiry'
     A                                 14 19'f2   -   Message Functions Program'
     A                                 16 19'f4   -   Storeroom Withdrawal/Inqu-
     A                                      iry'
     A                                 18 19'f5   -   Workorder Initiation'
     A                                 20 19'f6   -   Workorder Inquiry Program-
     A                                      s'
     A                                 22 19'f8   -   Equipment Reference File -
     A                                      Inquiry'
     A                                 23 74'HELP 6'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('                    F3=EXIT HE-
     A                                      LP')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R HELP61
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A  96                                  CF24
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  7'==================================-
     A                                      ==================================='
     A                                  2  7':  C R A F T S M A N   F U N C T I-
     A                                       O N S   H E L P   S C R E E N S  :'
     A                                  3  7'==================================-
     A                                      ==================================='
     A                                  5 16'Selection of the "f1" key, Workord-
     A                                      er Queue Backlog:'
     A                                  7  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  8  5'f1   -   Automatic Queue Backlog I-
     A                                      nquiry'
     A                                  9  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 11  1'The Automatic Queue Backlog will d-
     A                                      isplay the workorder queue in desce-
     A                                      nding orde'
     A                                 12  1'based on the Queue Factor, or rela-
     A                                      tive priority, of the workorder.  F-
     A                                      or Zone'
     A                                 13  1'sign-ons, the program will display-
     A                                       workorders in that zone only.  For-
     A                                       central'
     A                                 14  1'shop locations, the program can be-
     A                                       set to display all workorders for -
     A                                      a given'
     A                                 15  1'craft.  The first time the program-
     A                                       is executed per sign-on, it will r-
     A                                      equire tha'
     A                                 16  1'a zone (or craft) be identified, t-
     A                                      hereafter, it will use the same inf-
     A                                      ormation'
     A                                 17  1'unless a change is requested by th-
     A                                      e craftsman.  While the program is -
     A                                      running,'
     A                                 18  1'the display will automatically ref-
     A                                      resh and update itself every 2 minu-
     A                                      tes,'
     A                                 19  1'keeping the information current to-
     A                                       the shop situation.  If an "X" is -
     A                                      typed on'
     A                                 20  1'any workorder number "ENTER" is pr-
     A                                      essed, the workorder will be displa-
     A                                      yed.'
     A                                 21  1'NOTE:  If a zone has already been -
     A                                      identified by the "f6" Open/Active -
     A                                      Inquiry'
     A                                 22  1'program, the same zone will defaul-
     A                                      t to this program.'
     A                                 23 74'HELP 6'
     A  95                             24  1'                    F3=EXIT HELP  -
     A                                            F24=More keys'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F2=NEXT SCREEN      F8=PREVIOU-
     A                                      S SCREEN  F5=HELP MENU        F24=M-
     A                                      ore keys')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R HELP62
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A  96                                  CF24
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  7'==================================-
     A                                      ==================================='
     A                                  2  7':  C R A F T S M A N   F U N C T I-
     A                                       O N S   H E L P   S C R E E N S  :'
     A                                  3  7'==================================-
     A                                      ==================================='
     A                                  5 19'Selection of the "f2" key, Message-
     A                                       Functions:'
     A                                  7  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  8  5'f2   -   Send Message to Craftsman-
     A                                       or Workorder'
     A                                  9  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 11  1'The Message Functions allow the cr-
     A                                      aftsman to send a message to anothe-
     A                                      r craftsma'
     A                                 12  1'or to write a permanent message to-
     A                                       a workorder.  Either the Clock Car-
     A                                      d (Badge)'
     A                                 13  1'number of the receiving craftsman -
     A                                      or the workorder number must be ent-
     A                                      ered, then'
     A                                 14  1'the message is typed as desired.  -
     A                                      If the message is to be printed, en-
     A                                      ter any'
     A                                 15  1'character in the print field and t-
     A                                      he message will hardcopy to the rec-
     A                                      eiving'
     A                                 16  1'craftsman''s zone printer, or the -
     A                                      zone printer designated on the work-
     A                                      order.'
     A                                 18  1'NOTE:  Messages sent to craftsmen -
     A                                      which are printed are not sent to a-
     A                                       terminal.'
     A                                 19  8'In other words, the message will e-
     A                                      xist as hardcopy but will not appea-
     A                                      r'
     A                                 20  8'when the receiving craftsman signs-
     A                                      -on to a terminal.'
     A                                 23 74'HELP 6'
     A  95                             24  1'                    F3=EXIT HELP  -
     A                                            F24=More keys'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F2=NEXT SCREEN      F8=PREVIOU-
     A                                      S SCREEN  F5=HELP MENU        F24=M-
     A                                      ore keys')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R HELP63
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A  96                                  CF24
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  7'==================================-
     A                                      ==================================='
     A                                  2  7':  C R A F T S M A N   F U N C T I-
     A                                       O N S   H E L P   S C R E E N S  :'
     A                                  3  7'==================================-
     A                                      ==================================='
     A                                  5 16'Selection of the "f8" key, Equipme-
     A                                      nt Reference File:'
     A                                  7  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  8  5'f8   -   Equipment Reference Inqui-
     A                                      ry'
     A                                  9  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 11  1'The Equipment Reference Inquiry al-
     A                                      lows the craftsman access to inform-
     A                                      ation'
     A                                 12  1'stored by local equipment and subs-
     A                                      ystem numbers for equipment in the -
     A                                      plant.'
     A                                 13  1'The engineering department at each-
     A                                       plant can enter various history, r-
     A                                      emarks,'
     A                                 14  1'adjustments, settings, etc. for in-
     A                                      dividual subsystems as well as spar-
     A                                      e parts'
     A                                 15  1'lists and appropriate drawing list-
     A                                      s.  All are available to the crafts-
     A                                      man'
     A                                 16  1'through this program.'
     A                                 17  1'If the craftsman is in-progress (I-
     A                                      P) on a workorder, the equipment na-
     A                                      med on the'
     A                                 18  1'workorder will default to the entr-
     A                                      y field of the inquiry.  The crafts-
     A                                      man may'
     A                                 19  1'enter another number over this if -
     A                                      desired.'
     A                                 20  1'Also, parts may be ordered from th-
     A                                      e storeroom directly from the spare-
     A                                       parts'
     A                                 21  1'portion of this program.'
     A                                 23 74'HELP 6'
     A  95                             24  1'                    F3=EXIT HELP  -
     A                                            F24=More keys'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F2=NEXT SCREEN      F8=PREVIOU-
     A                                      S SCREEN  F5=HELP MENU        F24=M-
     A                                      ore keys')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R HELP64
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A  96                                  CF24
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  7'==================================-
     A                                      ==================================='
     A                                  2  7':  C R A F T S M A N   F U N C T I-
     A                                       O N S   H E L P   S C R E E N S  :'
     A                                  3  7'==================================-
     A                                      ==================================='
     A                                  5 18'Selection of the "f4" key, Storero-
     A                                      om Functions:'
     A                                  7  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  8  5'f4   -   Storeroom Withdrawal/Inqu-
     A                                      iry'
     A                                  9  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 11  1'The Storeroom Functions allow the -
     A                                      craftsman to withdraw materials dir-
     A                                      ectly from'
     A                                 12  1'the storeroom and to inquire inven-
     A                                      tory levels for various parts.'
     A                                 13  1'If the craftsman is in-progress (I-
     A                                      P) on a workorder, the clock card n-
     A                                      umber and'
     A                                 14  1'workorder number will carry into t-
     A                                      he withdrawal screen so that the on-
     A                                      ly fields'
     A                                 15  1'required for the craftsman to fill-
     A                                       in is the part numbers and the qua-
     A                                      ntity.'
     A                                 23 74'HELP 6'
     A  95                             24  1'                    F3=EXIT HELP  -
     A                                            F24=More keys'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F2=NEXT SCREEN      F8=PREVIOU-
     A                                      S SCREEN  F5=HELP MENU        F24=M-
     A                                      ore keys')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R HELP65
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A  96                                  CF24
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  7'==================================-
     A                                      ==================================='
     A                                  2  7':  C R A F T S M A N   F U N C T I-
     A                                       O N S   H E L P   S C R E E N S  :'
     A                                  3  7'==================================-
     A                                      ==================================='
     A                                  5 17'Selection of the "f5" key, Workord-
     A                                      er Initiation:'
     A                                  7  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  8  5'f5   -   Initiate Workorders'
     A                                  9  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 11  1'Verbal or Planned workorders may b-
     A                                      e initiated from this function.'
     A                                 23 74'HELP 6'
     A  95                             24  1'                    F3=EXIT HELP  -
     A                                            F24=More keys'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F2=NEXT SCREEN      F8=PREVIOU-
     A                                      S SCREEN  F5=HELP MENU        F24=M-
     A                                      ore keys')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R HELP66
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A  96                                  CF24
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  7'==================================-
     A                                      ==================================='
     A                                  2  7':  C R A F T S M A N   F U N C T I-
     A                                       O N S   H E L P   S C R E E N S  :'
     A                                  3  7'==================================-
     A                                      ==================================='
     A                                  5 16'Selection of the "f6" key, Workord-
     A                                      er Inquiry Programs:'
     A                                  6  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  7  5'f6   -   Workorder Inquiry Program-
     A                                      s'
     A                                  8  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  9  1'The "f6" key will display another -
     A                                      menu to select from workorder inqui-
     A                                      ries:'
     A                                 11  5'f1   -   Open/Active (OO/IP) Worko-
     A                                      rder Inquiry'
     A                                 13  5'f2   -   Equipment Workorder Histo-
     A                                      ry Inquiry'
     A                                 15  1'The Open/Active inquiry will displ-
     A                                      ay lists of all verbal workorders i-
     A                                      n a zone'
     A                                 16  1'which are currently in open (OO) o-
     A                                      r active (IP) status.  The first ti-
     A                                      me the'
     A                                 17  1'program is executed per sign-on, i-
     A                                      t will require that a zone be ident-
     A                                      ified,'
     A                                 18  1'thereafter, it will use the same i-
     A                                      nformation unless a change is reque-
     A                                      sted by'
     A                                 19  1'the craftsman.'
     A                                 20  1'The Equipment History Inquiry will-
     A                                       list all workorders in all except -
     A                                      the "H"'
     A                                 21  1'statuses which have been written a-
     A                                      gainst a specific piece of equipmen-
     A                                      t.'
     A                                 22  1'NOTE:  If a zone has already been -
     A                                      identified by the "f1" Automatic Qu-
     A                                      eue Backlo'
     A                                 23  1'program, the same zone will defaul-
     A                                      t to the OO/IP inquiry.            -
     A                                          HELP 6'
     A  95                             24  1'                    F3=EXIT HELP  -
     A                                            F24=More keys'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F2=NEXT SCREEN      F8=PREVIOU-
     A                                      S SCREEN  F5=HELP MENU        F24=M-
     A                                      ore keys')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R HELP70
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A  96                                  CF24
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  7'==================================-
     A                                      ==================================='
     A                                  2  7':  C R A F T S M A N   F U N C T I-
     A                                       O N S   H E L P   S C R E E N S  :'
     A                                  3  7'==================================-
     A                                      ==================================='
     A                                  5 12'Selection of the "f7" key, Clear C-
     A                                      urrent Clock Card Number:'
     A                                  7  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  8  5'f7   Clear Current Clock Card Numb-
     A                                      er from screen'
     A                                  9  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 11  1'If the "f7" key is pressed, the cu-
     A                                      rrent craftsman identified by the s-
     A                                      ystem is'
     A                                 12  1'cleared from the program and the s-
     A                                      creen is reset to the initial scree-
     A                                      n to allow'
     A                                 13  1'a new craftsman to enter the syste-
     A                                      m.'
     A                                 15  1'NOTE:  This function will occur au-
     A                                      tomatically after 60 seconds if the-
     A                                      re is no'
     A                                 16  8'activity on the terminal.'
     A                                 23 74'HELP 7'
     A  95                             24  1'                    F3=EXIT HELP  -
     A                                            F24=More keys'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F2=NEXT SCREEN      F8=PREVIOU-
     A                                      S SCREEN  F5=HELP MENU        F24=M-
     A                                      ore keys')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R IMESSAGE
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  2 15'==================================-
     A                                      ==============='
     A                                  3 15':     S E N D   M E S S A G E   S -
     A                                      C R E E N     :'
     A                                  4 15'==================================-
     A                                      ==============='
     A                                  5  5'DATE:'
     A            D              8A  B  5 12DSPATR(PR)
     A                                      OVRDTA
     A                                  5 63'TIME:'
     A            T              4A  B  5 70DSPATR(PR)
     A                                      OVRDTA
     A                                  6  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  7  3'MESSAGE TO:    CLOCK CARD -'
     A            CC             4A  B  7 31DSPATR(UL)
     A  05                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  7 39'OR    WORK ORDER -'
     A            WO            10A  B  7 58DSPATR(UL)
     A  06                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  8  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  9  3'MESSAGE FROM:'
     A            FROM           4A  B  9 18DSPATR(PR)
     A                                      OVRDTA
     A            SO            28A  B  9 26DSPATR(PR)
     A                                      OVRDTA
     A                                 10  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 11  3'MESSAGE:'
     A            F1            70A  B 12  6DSPATR(UL)
     A  07                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            F2            70A  B 13  6DSPATR(UL)
     A  08                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            F8            70A  B 14  6DSPATR(UL)
     A  09                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            F4            70A  B 15  6DSPATR(UL)
     A  10                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            F5            70A  B 16  6DSPATR(UL)
     A  11                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            P              1A  B 18 58DSPATR(UL)
     A  12                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 17  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 18 15'PRINT MESSAGE AT RECEIVER''s ZONE -
     A                                      PRINTER:'
     A                                 19  2'Any character will cause a copy to-
     A                                       be printed at the zone printer.  M-
     A                                      essages'
     A                                 20  2'to Clock Card numbers which are pr-
     A                                      inted are NOT saved in the database-
     A                                       and will'
     A                                 21  2'NOT appear on the receiver''s term-
     A                                      inal.  Workorder messages which are-
     A                                       printed,'
     A                                 22  2'will print on the zone printer of -
     A                                      the workorder zone and WILL be save-
     A                                      d.'
     A                                 23  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F1=RETURN TO MENU   F7=CLEAR M-
     A                                      ESSAGE    F3=EXIT PROGRAM')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R IMESSTWO
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  2 15'==================================-
     A                                      ==============='
     A                                  3 15':     S E N D   M E S S A G E   S -
     A                                      C R E E N     :'
     A                                  4 15'==================================-
     A                                      ==============='
     A                                  5  5'DATE:'
     A            D              8A  B  5 12DSPATR(PR)
     A                                      OVRDTA
     A                                  5 63'TIME:'
     A            T              4A  B  5 70DSPATR(PR)
     A                                      OVRDTA
     A                                  6  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  7  3'MESSAGE TO:    CLOCK CARD -'
     A            CC             4A  B  7 31DSPATR(UL)
     A  05                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  7 39'OR    WORK ORDER -'
     A            WO            10A  B  7 58DSPATR(UL)
     A  06                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  8  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  9  3'MESSAGE FROM:'
     A            FROM           4A  B  9 18DSPATR(UL)
     A  03                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            SO            28A  B  9 26DSPATR(PR)
     A                                      OVRDTA
     A                                 10  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 11  3'MESSAGE:'
     A            F1            70A  B 12  6DSPATR(UL)
     A  07                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            F2            70A  B 13  6DSPATR(UL)
     A  08                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            F8            70A  B 14  6DSPATR(UL)
     A  09                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            F4            70A  B 15  6DSPATR(UL)
     A  10                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            F5            70A  B 16  6DSPATR(UL)
     A  11                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            P              1A  B 18 58DSPATR(UL)
     A  12                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 17  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 18 15'PRINT MESSAGE AT RECEIVER''s ZONE -
     A                                      PRINTER:'
     A                                 19  2'Any character will cause a copy to-
     A                                       be printed at the zone printer.  M-
     A                                      essages'
     A                                 20  2'to Clock Card numbers which are pr-
     A                                      inted are NOT saved in the database-
     A                                       and will'
     A                                 21  2'NOT appear on the receiver''s term-
     A                                      inal.  Workorder messages which are-
     A                                       printed,'
     A                                 22  2'will print on the zone printer of -
     A                                      the workorder zone and WILL be save-
     A                                      d.'
     A                                 23  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F1=RETURN TO MENU   F7=CLEAR M-
     A                                      ESSAGE    F3=EXIT PROGRAM')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R OMSGCC
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1 10'==================================-
     A                                      ============================='
     A                                  2 10':     D I S P L A Y   C L O C K   -
     A                                      C A R D   M E S S A G E     :'
     A                                  3 10'==================================-
     A                                      ============================='
     A                                  4  5'MESSAGE SENT ON:                  -
     A                                                             AT'
     A                                  5  5'DATE:'
     A            D              8A  B  5 12DSPATR(UL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  5 62'TIME:'
     A            T              4A  B  5 69DSPATR(UL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  6  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  7  3'MESSAGE TO:    CLOCK CARD -'
     A            CC             4A  B  7 31DSPATR(PR)
     A                                      OVRDTA
     A            DUMMY         10A  B  7 62DSPATR(PR)
     A                                      OVRDTA
     A                                  8  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  9  3'MESSAGE FROM:'
     A            FROM           4A  B  9 18DSPATR(PR)
     A                                      OVRDTA
     A            SO            28A  B  9 26DSPATR(PR)
     A                                      OVRDTA
     A                                 10  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 11  3'MESSAGE:'
     A            F1            70A  B 12  6DSPATR(PR)
     A                                      OVRDTA
     A            F2            70A  B 13  6DSPATR(PR)
     A                                      OVRDTA
     A            F8            70A  B 14  6DSPATR(PR)
     A                                      OVRDTA
     A            F4            70A  B 15  6DSPATR(PR)
     A                                      OVRDTA
     A            F5            70A  B 16  6DSPATR(PR)
     A                                      OVRDTA
     A                                 17  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 18 17'PRINT MESSAGE AT YOUR ASSIGNED ZON-
     A                                      E PRINTER:'
     A            P              1A  B 18 64DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 19 22'Enter any character to print messa-
     A                                      ge.'
     A                                 20  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 21  3'NOTE:  This message will be automa-
     A                                      tically deleted'
     A            DDATE          8A  B 21 53DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                 21 64'The message may'
     A                                 22 10'be saved up to two weeks by enteri-
     A                                      ng a new Delete Date:'
     A            DMMDATE        2A  B 22 67DSPATR(UL)
     A                                      DSPATR(BL)
     A  27                                  DSPATR(PC)
     A                                      OVRDTA
     A            DDDDATE        2A  B 22 70DSPATR(UL)
     A                                      DSPATR(BL)
     A  29                                  DSPATR(PC)
     A                                      OVRDTA
     A            DYYDATE        2A  B 22 73DSPATR(UL)
     A                                      DSPATR(BL)
     A  30                                  DSPATR(PC)
     A                                      OVRDTA
     A                                 23  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F1=RETURN TO MENU   F3=EXIT PR-
     A                                      OGRAM')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R OMSGWO
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1 11'==================================-
     A                                      ==========================='
     A                                  2 11':     D I S P L A Y   W O R K O R -
     A                                      D E R   M E S S A G E     :'
     A                                  3 11'==================================-
     A                                      ==========================='
     A                                  4  5'MESSAGE SENT ON:                  -
     A                                                             AT'
     A                                  5  5'DATE:'
     A            D              8A  B  5 12DSPATR(UL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  5 62'TIME:'
     A            T              4A  B  5 69DSPATR(UL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            DUMMY          4A  B  5 75DSPATR(PR)
     A                                      OVRDTA
     A                                  6  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  7  3'MESSAGE TO:    WORKORDER -'
     A            WO            10A  B  7 30DSPATR(PR)
     A                                      OVRDTA
     A                                  8  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  9  3'MESSAGE FROM:'
     A            FROM           4A  B  9 18DSPATR(PR)
     A                                      OVRDTA
     A            SO            28A  B  9 26DSPATR(PR)
     A                                      OVRDTA
     A                                 10  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 11  3'MESSAGE:'
     A            F1            70A  B 12  6DSPATR(PR)
     A                                      OVRDTA
     A            F2            70A  B 13  6DSPATR(PR)
     A                                      OVRDTA
     A            F8            70A  B 14  6DSPATR(PR)
     A                                      OVRDTA
     A            F4            70A  B 15  6DSPATR(PR)
     A                                      OVRDTA
     A            F5            70A  B 16  6DSPATR(PR)
     A                                      OVRDTA
     A                                 17  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 18 21'PRINT MESSAGE AT WORKORDER ZONE PR-
     A                                      INTER:'
     A            P              1A  B 18 64DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 19 20'Enter any character to print messa-
     A                                      ge.'
     A            DUMMY1         8A  B 19 60DSPATR(PR)
     A                                      OVRDTA
     A            DUMMY2         6A  B 19 70DSPATR(PR)
     A                                      OVRDTA
     A                                 20  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F1=RETURN TO MENU   F3=EXIT PR-
     A                                      OGRAM')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R ONEWSMSG
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1 25'============================='
     A                                  2 25':  C U R R E N T   N E W S  :'
     A                                  3 25'============================='
     A                                  5 21'DATE:'
     A            D              8A  B  5 28DSPATR(PR)
     A                                      OVRDTA
     A                                  5 48'TIME:'
     A            T              4A  B  5 55DSPATR(PR)
     A                                      OVRDTA
     A            FROM           4A  B  6 38DSPATR(PR)
     A                                      OVRDTA
     A            SO            28A  B  6 46DSPATR(PR)
     A                                      OVRDTA
     A            CC             4A  B  7 61DSPATR(PR)
     A                                      OVRDTA
     A            WO            10A  B  7 67DSPATR(PR)
     A                                      OVRDTA
     A                                  9  5'NEWS MESSAGE:'
     A            F1            70A  B 11  5DSPATR(PR)
     A                                      OVRDTA
     A            F2            70A  B 12  5DSPATR(PR)
     A                                      OVRDTA
     A            F8            70A  B 13  5DSPATR(PR)
     A                                      OVRDTA
     A            F4            70A  B 14  5DSPATR(PR)
     A                                      OVRDTA
     A            F5            70A  B 15  5DSPATR(PR)
     A                                      OVRDTA
     A            P              1A  B 21 76DSPATR(PR)
     A                                      OVRDTA
     A                                 23  1'F1=RETURN TO MENU   F3=EXIT PROGRA-
     A                                      M'
     A            COMMANDLIN    79A  O 24  1OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R PERPASS1
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A            CC             4A  B  2  3DSPATR(UL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            NAME          16A  B  2 11DSPATR(UL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  2 35'Type PASSWORD and press the "ENTER-
     A                                      " key.'
     A                                  4  3'Enter your personal PASSWORD:'
     A            PW             6A  B  4 35
     A  01                                  DSPATR(UL)
     A  01                                  DSPATR(PC)
     A                                      DSPATR(ND)
     A                                      CHECK(LC)
     A                                      OVRDTA
     A                                      OVRATR
     A            IVPMSG        30A  B  4 45DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            PWMSG         56A  B  6  3DSPATR(PR)
     A                                      OVRDTA
     A                                      DFT('If you wish to change your PAS-
     A                                      SWORD, enter new PASSWORD:')
     A            NPW            6A  B  6 62
     A  03                                  DSPATR(UL)
     A  03                                  DSPATR(PC)
     A                                      DSPATR(ND)
     A                                      CHECK(LC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  8  3'If you have problems or need help,-
     A                                       please contact'
     A            HELP          26A  B  8 53DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLIN    79A  O 24  1OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R PERPASS2
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A            CC             4A  B  2  3DSPATR(UL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            NAME          16A  B  2 11DSPATR(UL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  2 35'Type PASSWORD and press the "ENTER-
     A                                      " key.'
     A                                  4  3'Enter your personal PASSWORD:'
     A            PW             6A  B  4 35DSPATR(ND)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            IVPMSG        30A  B  4 45DSPATR(PR)
     A                                      OVRDTA
     A            PWMSG         56A  B  6  3DSPATR(PR)
     A                                      OVRDTA
     A                                      DFT(' Your PASSWORD has expired, pl-
     A                                      ease enter a new PASSWORD:')
     A            NPW            6A  B  6 62
     A  03                                  DSPATR(UL)
     A  03                                  DSPATR(PC)
     A                                      DSPATR(ND)
     A                                      CHECK(LC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  8  3'If you have problems or need help,-
     A                                       please contact'
     A            HELP          26A  B  8 53DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLIN    79A  O 24  1OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R PERPASS3
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A            CC             4A  B  2  3DSPATR(UL)
     A  07                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            NAME          16A  B  2 11DSPATR(UL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  2 35'Type PASSWORD and press the "ENTER-
     A                                      " key.'
     A                                  4  3'Enter your personal PASSWORD:'
     A            PW             6A  B  4 35
     A  01                                  DSPATR(UL)
     A  01                                  DSPATR(PC)
     A                                      DSPATR(ND)
     A                                      CHECK(LC)
     A                                      OVRDTA
     A                                      OVRATR
     A            IVPMSG        30A  B  4 45DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            PWMSG         56A  B  6  3DSPATR(PR)
     A                                      OVRDTA
     A                                      DFT('If you wish to change your PAS-
     A                                      SWORD, enter new PASSWORD:')
     A            NPW            6A  B  6 62
     A  03                                  DSPATR(UL)
     A  03                                  DSPATR(PC)
     A                                      DSPATR(ND)
     A                                      CHECK(LC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  8  3'If you have problems or need help,-
     A                                       please contact'
     A            HELP          26A  B  8 53DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLIN    79A  O 24  1OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VALARM
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  2'##################################-
     A                                      ###################################-
     A                                      ##########'
     A                                  2  1'##################################-
     A                                      ###################################-
     A                                      ##########'
     A                                  3  1'###                               -
     A                                                                         -
     A                                              ##'
     A                                  4  1'###  #############################-
     A                                      ###################################-
     A                                      ######  ##'
     A                                  5  1'###  #############################-
     A                                      ###################################-
     A                                      ######  ##'
     A                                  6  1'###  #############                -
     A                                                                  #######-
     A                                      ######  ##'
     A                                  7  1'###  #############                -
     A                                                                  #######-
     A                                      ######  ##'
     A                                  8  1'###  #############     ------------
     A                                      -----------------------     #######-
     A                                      ######  ##'
     A                                  9  1'###  #############                -
     A                                                                  #######-
     A                                      ######  ##'
     A                                 10  1'###  #############           ONE O-
     A                                      R MORE WORKORDERS           #######-
     A                                      ######  ##'
     A                                 11  1'###  #############                -
     A                                                                  #######-
     A                                      ######  ##'
     A                                 12  1'###  #############         HAVE AP-
     A                                      PEARED IN THE QUEUE         #######-
     A                                      ######  ##'
     A                                 13  1'###  #############                -
     A                                                                  #######-
     A                                      ######  ##'
     A                                 14  1'###  #############     ------------
     A                                      -----------------------     #######-
     A                                      ######  ##'
     A                                 15  1'###  #############                -
     A                                                                  #######-
     A                                      ######  ##'
     A                                 16  1'###  #############                -
     A                                                                  #######-
     A                                      ######  ##'
     A                                 17  1'###  #############################-
     A                                      ###################################-
     A                                      ######  ##'
     A                                 18  1'###  #############################-
     A                                      ###################################-
     A                                      ######  ##'
     A                                 19  1'###                               -
     A                                                                         -
     A                                              ##'
     A                                 20  1'##################################-
     A                                      ###################################-
     A                                      ##########'
     A                                 21  1'##################################-
     A                                      ###################################-
     A                                      ##########'
     A                                 23 18'PRESS ANY FUNCTION KEY OR "ENTER" -
     A                                      TO CONTINUE.'
     A            COMMANDLIN    79A  O 24  1OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VAUTOQUE
     A*%%TS  DD  19960424  094041  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2 10'O P E N   W O R K O R D E R   Q U -
     A                                      E U E   F O R'
     A            ZONECRAFT     10A  B  2 60DSPATR(PR)
     A                                      OVRDTA
     A            ZONE           4A  B  2 71DSPATR(PR)
     A                                      OVRDTA
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2'QUEUE                           (P-
     A                                      ress f2 key to REFRESH Screen data)'
     A                                  5  2'FACTOR CC #   EQUIP  DOWN  WO NUMB-
     A                                      ER  DESCRIPTION                    -
     A                                        SKILLS'
     A                                  6  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A            R1             2A  B  7  3DSPATR(PR)
     A                                      OVRDTA
     A            C1             4A  B  7  9DSPATR(PR)
     A                                      OVRDTA
     A            E1             6A  B  7 16DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  7 25DSPATR(PR)
     A                                      OVRDTA
     A            W1            11A  B  7 28OVRDTA
     A            D1            30A  B  7 40DSPATR(PR)
     A                                      OVRDTA
     A            SA             2A  B  7 72DSPATR(PR)
     A                                      OVRDTA
     A            SB             2A  B  7 75DSPATR(PR)
     A                                      OVRDTA
     A            SC             2A  B  7 78DSPATR(PR)
     A                                      OVRDTA
     A            R2             2A  B  8  3DSPATR(PR)
     A                                      OVRDTA
     A            C2             4A  B  8  9DSPATR(PR)
     A                                      OVRDTA
     A            E2             6A  B  8 16DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B  8 25DSPATR(PR)
     A                                      OVRDTA
     A            W2            11A  B  8 28OVRDTA
     A            D2            30A  B  8 40DSPATR(PR)
     A                                      OVRDTA
     A            SD             2A  B  8 72DSPATR(PR)
     A                                      OVRDTA
     A            SE             2A  B  8 75DSPATR(PR)
     A                                      OVRDTA
     A            SF             2A  B  8 78DSPATR(PR)
     A                                      OVRDTA
     A            R3             2A  B  9  3DSPATR(PR)
     A                                      OVRDTA
     A            C3             4A  B  9  9DSPATR(PR)
     A                                      OVRDTA
     A            E3             6A  B  9 16DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  9 25DSPATR(PR)
     A                                      OVRDTA
     A            W3            11A  B  9 28OVRDTA
     A            D3            30A  B  9 40DSPATR(PR)
     A                                      OVRDTA
     A            SG             2A  B  9 72DSPATR(PR)
     A                                      OVRDTA
     A            SH             2A  B  9 75DSPATR(PR)
     A                                      OVRDTA
     A            SI             2A  B  9 78DSPATR(PR)
     A                                      OVRDTA
     A            R4             2A  B 10  3DSPATR(PR)
     A                                      OVRDTA
     A            C4             4A  B 10  9DSPATR(PR)
     A                                      OVRDTA
     A            E4             6A  B 10 16DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 10 25DSPATR(PR)
     A                                      OVRDTA
     A            W4            11A  B 10 28OVRDTA
     A            D4            30A  B 10 40DSPATR(PR)
     A                                      OVRDTA
     A            SJ             2A  B 10 72DSPATR(PR)
     A                                      OVRDTA
     A            SK             2A  B 10 75DSPATR(PR)
     A                                      OVRDTA
     A            SL             2A  B 10 78DSPATR(PR)
     A                                      OVRDTA
     A            R5             2A  B 11  3DSPATR(PR)
     A                                      OVRDTA
     A            C5             4A  B 11  9DSPATR(PR)
     A                                      OVRDTA
     A            E5             6A  B 11 16DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 11 25DSPATR(PR)
     A                                      OVRDTA
     A            W5            11A  B 11 28OVRDTA
     A            D5            30A  B 11 40DSPATR(PR)
     A                                      OVRDTA
     A            SM             2A  B 11 72DSPATR(PR)
     A                                      OVRDTA
     A            SN             2A  B 11 75DSPATR(PR)
     A                                      OVRDTA
     A            SO             2A  B 11 78DSPATR(PR)
     A                                      OVRDTA
     A            R6             2A  B 12  3DSPATR(PR)
     A                                      OVRDTA
     A            C6             4A  B 12  9DSPATR(PR)
     A                                      OVRDTA
     A            E6             6A  B 12 16DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 12 25DSPATR(PR)
     A                                      OVRDTA
     A            W6            11A  B 12 28OVRDTA
     A            D6            30A  B 12 40DSPATR(PR)
     A                                      OVRDTA
     A            SP             2A  B 12 72DSPATR(PR)
     A                                      OVRDTA
     A            SQ             2A  B 12 75DSPATR(PR)
     A                                      OVRDTA
     A            SR             2A  B 12 78DSPATR(PR)
     A                                      OVRDTA
     A            R7             2A  B 13  3DSPATR(PR)
     A                                      OVRDTA
     A            C7             4A  B 13  9DSPATR(PR)
     A                                      OVRDTA
     A            E7             6A  B 13 16DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 13 25DSPATR(PR)
     A                                      OVRDTA
     A            W7            11A  B 13 28OVRDTA
     A            D7            30A  B 13 40DSPATR(PR)
     A                                      OVRDTA
     A            SS             2A  B 13 72DSPATR(PR)
     A                                      OVRDTA
     A            ST             2A  B 13 75DSPATR(PR)
     A                                      OVRDTA
     A            SU             2A  B 13 78DSPATR(PR)
     A                                      OVRDTA
     A            R8             2A  B 14  3DSPATR(PR)
     A                                      OVRDTA
     A            C8             4A  B 14  9DSPATR(PR)
     A                                      OVRDTA
     A            E8             6A  B 14 16DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 14 25DSPATR(PR)
     A                                      OVRDTA
     A            W8            11A  B 14 28OVRDTA
     A            D8            30A  B 14 40DSPATR(PR)
     A                                      OVRDTA
     A            SV             2A  B 14 72DSPATR(PR)
     A                                      OVRDTA
     A            SW             2A  B 14 75DSPATR(PR)
     A                                      OVRDTA
     A            SX             2A  B 14 78DSPATR(PR)
     A                                      OVRDTA
     A            R9             2A  B 15  3DSPATR(PR)
     A                                      OVRDTA
     A            C9             4A  B 15  9DSPATR(PR)
     A                                      OVRDTA
     A            E9             6A  B 15 16DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 15 25DSPATR(PR)
     A                                      OVRDTA
     A            W9            11A  B 15 28OVRDTA
     A            D9            30A  B 15 40DSPATR(PR)
     A                                      OVRDTA
     A            SY             2A  B 15 72DSPATR(PR)
     A                                      OVRDTA
     A            SZ             2A  B 15 75DSPATR(PR)
     A                                      OVRDTA
     A            SAA            2A  B 15 78DSPATR(PR)
     A                                      OVRDTA
     A            R0             2A  B 16  3DSPATR(PR)
     A                                      OVRDTA
     A            C0             4A  B 16  9DSPATR(PR)
     A                                      OVRDTA
     A            E0             6A  B 16 16DSPATR(PR)
     A                                      OVRDTA
     A            J              1A  B 16 25DSPATR(PR)
     A                                      OVRDTA
     A            W0            11A  B 16 28OVRDTA
     A            D0            30A  B 16 40DSPATR(PR)
     A                                      OVRDTA
     A            SBB            2A  B 16 72DSPATR(PR)
     A                                      OVRDTA
     A            SCC            2A  B 16 75DSPATR(PR)
     A                                      OVRDTA
     A            SDD            2A  B 16 78DSPATR(PR)
     A                                      OVRDTA
     A            RA             2A  B 17  3DSPATR(PR)
     A                                      OVRDTA
     A            CA             4A  B 17  9DSPATR(PR)
     A                                      OVRDTA
     A            EA             6A  B 17 16DSPATR(PR)
     A                                      OVRDTA
     A            K              1A  B 17 25DSPATR(PR)
     A                                      OVRDTA
     A            WA            11A  B 17 28OVRDTA
     A            DA            30A  B 17 40DSPATR(PR)
     A                                      OVRDTA
     A            SEE            2A  B 17 72DSPATR(PR)
     A                                      OVRDTA
     A            SFF            2A  B 17 75DSPATR(PR)
     A                                      OVRDTA
     A            SGG            2A  B 17 78DSPATR(PR)
     A                                      OVRDTA
     A            RB             2A  B 18  3DSPATR(PR)
     A                                      OVRDTA
     A            CB             4A  B 18  9DSPATR(PR)
     A                                      OVRDTA
     A            EB             6A  B 18 16DSPATR(PR)
     A                                      OVRDTA
     A            L              1A  B 18 25DSPATR(PR)
     A                                      OVRDTA
     A            WB            11A  B 18 28OVRDTA
     A            DB            30A  B 18 40DSPATR(PR)
     A                                      OVRDTA
     A            SHH            2A  B 18 72DSPATR(PR)
     A                                      OVRDTA
     A            SII            2A  B 18 75DSPATR(PR)
     A                                      OVRDTA
     A            SJJ            2A  B 18 78DSPATR(PR)
     A                                      OVRDTA
     A            RC             2A  B 19  3DSPATR(PR)
     A                                      OVRDTA
     A            CC             4A  B 19  9DSPATR(PR)
     A                                      OVRDTA
     A            EC             6A  B 19 16DSPATR(PR)
     A                                      OVRDTA
     A            M              1A  B 19 25DSPATR(PR)
     A                                      OVRDTA
     A            WC            11A  B 19 28OVRDTA
     A            DC            30A  B 19 40DSPATR(PR)
     A                                      OVRDTA
     A            SKK            2A  B 19 72DSPATR(PR)
     A                                      OVRDTA
     A            SLL            2A  B 19 75DSPATR(PR)
     A                                      OVRDTA
     A            SMM            2A  B 19 78DSPATR(PR)
     A                                      OVRDTA
     A            RD             2A  B 20  3DSPATR(PR)
     A                                      OVRDTA
     A            CD             4A  B 20  9DSPATR(PR)
     A                                      OVRDTA
     A            ED             6A  B 20 16DSPATR(PR)
     A                                      OVRDTA
     A            N              1A  B 20 25DSPATR(PR)
     A                                      OVRDTA
     A            WD            11A  B 20 28OVRDTA
     A            DD            30A  B 20 40DSPATR(PR)
     A                                      OVRDTA
     A            SNN            2A  B 20 72DSPATR(PR)
     A                                      OVRDTA
     A            SOO            2A  B 20 75DSPATR(PR)
     A                                      OVRDTA
     A            SPP            2A  B 20 78DSPATR(PR)
     A                                      OVRDTA
     A                                 21  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                 22  2'Type a character by the WO number -
     A                                      - Press ''ENTER'' to VIEW, or F4 to-
     A                                       CHANGE, or'
     A                                 23  2'F5 to IP onto, the Workorder.   Pr-
     A                                      ess the ''ENTER'' key to view addit-
     A                                      ional data.'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F1=CHANGE SORT KEY   F3=EXIT  -
     A                                       F4=CHANGE WO   PRESS "ENTER" FOR N-
     A                                      EXT SCREEN')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VBBGETCC
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      OVERLAY
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  8'==================================-
     A                                      ================================'
     A                                  2  1'               M M I S   S Y S T E-
     A                                       M   B U L L E T I N   B O A R D   -
     A                                          '
     A                                  3  1'==================================-
     A                                      ===================================-
     A                                      ===='
     A            LOCA          40A  B  4 21DSPATR(PR)
     A                                      OVRDTA
     A                                  9  1'            Please enter your Cloc-
     A                                      k Card Number to determine if there'
     A                                 11  1'             are any Distribution -
     A                                      Lists on which you are identified.'
     A                                 14  1'                           Clock C-
     A                                      ard Number:'
     A            CCNO           4A  B 14 48DSPATR(UL)
     A  30                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 19  1'                       Enter data -
     A                                      and press "ENTER" key.'
     A            HELPLINE      70A  B 22  5DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F1=RETURN TO MENU   F3=EXIT PR-
     A                                      OGRAM')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VBBOARD
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  8'==================================-
     A                                      ================================'
     A                                  2  1'               M M I S   S Y S T E-
     A                                       M   B U L L E T I N   B O A R D   -
     A                                          '
     A                                  3  1'==================================-
     A                                      ===================================-
     A                                      ===='
     A            LOCA          40A  B  4 21DSPATR(PR)
     A                                      OVRDTA
     A                                  4 65':'
     A                                  6  1':        =========================-
     A                                      ==================================='
     A                                  7  1':        .    DATE:'
     A            DATELINE      18A  B  7 22DSPATR(PR)
     A                                      OVRDTA
     A                                  7 50'TIME:'
     A            TIMELINE       8A  B  7 57DSPATR(PR)
     A                                      OVRDTA
     A                                  8  1'         =========================-
     A                                      ==================================='
     A            R1            70A  B  9  5DSPATR(PR)
     A                                      OVRDTA
     A            R2            70A  B 10  5DSPATR(PR)
     A                                      OVRDTA
     A            R3            70A  B 11  5DSPATR(PR)
     A                                      OVRDTA
     A            R4            70A  B 12  5DSPATR(PR)
     A                                      OVRDTA
     A            R5            70A  B 13  5DSPATR(PR)
     A                                      OVRDTA
     A            R6            70A  B 14  5DSPATR(PR)
     A                                      OVRDTA
     A            R7            70A  B 15  5DSPATR(PR)
     A                                      OVRDTA
     A            R8            70A  B 16  5DSPATR(PR)
     A                                      OVRDTA
     A            R9            70A  B 17  5DSPATR(PR)
     A                                      OVRDTA
     A            R0            70A  B 18  5DSPATR(PR)
     A                                      OVRDTA
     A                                 19 34'              Distribution Code:'
     A            DISTCD         6A  B 19 69DSPATR(PR)
     A                                      OVRDTA
     A                                 20  1'                       PRESS "ENTE-
     A                                      R" KEY FOR NEXT RECORD'
     A            HELPLINE      70A  B 22  5DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F1=RETURN TO MENU   F3=EXIT PR-
     A                                      OGRAM')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VBBOARDO
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  8'==================================-
     A                                      ================================'
     A                                  2  1'               M M I S   S Y S T E-
     A                                       M   B U L L E T I N   B O A R D   -
     A                                          '
     A                                  3  1'==================================-
     A                                      ===================================-
     A                                      ===='
     A            LOCA          40A  B  4 21DSPATR(PR)
     A                                      OVRDTA
     A                                  7  1'              DATE:'
     A            DATELINE      18A  B  7 22DSPATR(PR)
     A                                      OVRDTA
     A                                  7 50'TIME:'
     A            TIMELINE       8A  B  7 57DSPATR(PR)
     A                                      OVRDTA
     A                                  8  1'         =========================-
     A                                      ==================================='
     A            R1            70A  B 10  5DSPATR(PR)
     A                                      OVRDTA
     A            R2            70A  B 11  5DSPATR(PR)
     A                                      OVRDTA
     A            R3            70A  B 12  5DSPATR(PR)
     A                                      OVRDTA
     A            R4            70A  B 13  5DSPATR(PR)
     A                                      OVRDTA
     A            R5            70A  B 14  5DSPATR(PR)
     A                                      OVRDTA
     A            R6            70A  B 15  5DSPATR(PR)
     A                                      OVRDTA
     A            R7            70A  B 16  5DSPATR(PR)
     A                                      OVRDTA
     A            R8            70A  B 17  5DSPATR(PR)
     A                                      OVRDTA
     A            R9            70A  B 18  5DSPATR(PR)
     A                                      OVRDTA
     A            R0            70A  B 19  5DSPATR(PR)
     A                                      OVRDTA
     A                                 20  1'                       PRESS "ENTE-
     A                                      R" KEY FOR NEXT RECORD'
     A            HELPLINE      70A  B 22  5DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F1=RETURN TO MENU   F3=EXIT PR-
     A                                      OGRAM')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VCFTMENU
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  2 18'==================================-
     A                                      ========='
     A                                  3 18':  Z O N E   C R A F T S M A N   M-
     A                                       E N U  :'
     A                                  4 18'==================================-
     A                                      ========='
     A                                  6 19'PRESS:'
     A                                  8 21'f1   -   Automatic Queue Backlog I-
     A                                      nquiry'
     A                                 10 21'f2   -   Send Message to Craftsman-
     A                                       or Workorder'
     A                                 12 21'f3   -   Return to Craftsman Input-
     A                                       Screen'
     A                                 14 21'f4   -   Storeroom Withdrawal/Inqu-
     A                                      iry'
     A                                 16 21'f5   -   Initiate Workorders'
     A                                 18 21'f6   -   Additional Functions and -
     A                                      Inquiries'
     A                                 20 21'f7   -   Workorders-In-Progress In-
     A                                      quiry'
     A                                 22 21'f8   -   Equipment Reference Inqui-
     A                                      ry'
     A                                 23  1'F3=RETURN TO MENU'
     A            COMMANDLIN    79A  O 24  1OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VCHNGWO
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  9'==================================-
     A                                      ==============================='
     A                                  2  9':  C H A N G E   V E R B A L   W O-
     A                                       R K O R D E R   S C R E E N  :'
     A                                  3  9'==================================-
     A                                      ==============================='
     A                                  5  1'W/O NUM:'
     A            WONUM         10A  B  5 10DSPATR(UL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  5 24'W/O STATUS:'
     A            ST             2A  B  5 36DSPATR(UL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  5 42'TYPE:'
     A            TP             2A  B  5 48DSPATR(PR)
     A                                      OVRDTA
     A                                  5 54'DATE RECD:'
     A            MR             2A  B  5 65DSPATR(PR)
     A                                      OVRDTA
     A            DR             2A  B  5 68DSPATR(PR)
     A                                      OVRDTA
     A            YR             2A  B  5 71DSPATR(PR)
     A                                      OVRDTA
     A            RM             2A  B  5 75DSPATR(PR)
     A                                      OVRDTA
     A            HR             2A  B  5 78DSPATR(PR)
     A                                      OVRDTA
     A                                  7  1'APPROVAL:'
     A            A              1A  B  7 11DSPATR(PR)
     A                                      OVRDTA
     A                                  7 27'REQUESTER:'
     A            REQEST        16A  B  7 38DSPATR(PR)
     A                                      OVRDTA
     A                                  7 63'EQUIP NUM:'
     A            EQPNUM         6A  B  7 74DSPATR(UL)
     A  13                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  9  1'EQUIPMENT NAME:'
     A            EQPNAME       50A  B  9 17DSPATR(PR)
     A                                      OVRDTA
     A            TYPNUM         8A  B  9 71DSPATR(PR)
     A                                      OVRDTA
     A                                 11  1'DEPT:'
     A            DEPT           4A  B 11  7DSPATR(PR)
     A                                      OVRDTA
     A                                 11 19'MAINT ZONE:'
     A            ZONE           4A  B 11 31DSPATR(PR)
     A                                      OVRDTA
     A                                 11 44'LOCATION:'
     A            LOC            8A  B 11 54DSPATR(PR)
     A                                      OVRDTA
     A                                 11 69'PRIORITY:'
     A            P              1A  B 11 79DSPATR(UL)
     A  19                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 13  1'EQUIP DOWN:'
     A            D              1A  B 13 13DSPATR(UL)
     A  20                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 13 25'CRAFT REQD:'
     A            C1             2A  B 13 37DSPATR(UL)
     A  21                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            C2             2A  B 13 40DSPATR(UL)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            C3             2A  B 13 43DSPATR(UL)
     A  23                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 13 61'EXP CLASS:'
     A            EXPCL          8A  B 13 72DSPATR(PR)
     A                                      OVRDTA
     A                                 15  1'DESCRIPTION:'
     A            DESC30        30A  B 15 14DSPATR(UL)
     A  25                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            DESC661       66A  B 16 14DSPATR(UL)
     A  26                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            DESC662       66A  B 17 14DSPATR(UL)
     A  27                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 19  1'CRAFTSMEN:'
     A            CFT1           4A  B 19 12DSPATR(PR)
     A                                      OVRDTA
     A            CFT2           4A  B 19 18DSPATR(PR)
     A                                      OVRDTA
     A            CFT3           4A  B 19 24DSPATR(PR)
     A                                      OVRDTA
     A                                 19 54'TIME STRT:'
     A            MS             2A  B 19 65DSPATR(PR)
     A                                      OVRDTA
     A            DS             2A  B 19 68DSPATR(PR)
     A                                      OVRDTA
     A            YS             2A  B 19 71DSPATR(PR)
     A                                      OVRDTA
     A            SM             2A  B 19 75DSPATR(PR)
     A                                      OVRDTA
     A            HS             2A  B 19 78DSPATR(PR)
     A                                      OVRDTA
     A                                 23  1'F1=RETURN           F3=EXIT PROGRA-
     A                                      M'
     A            COMMANDLIN    79A  O 24  1OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VEQPHIST
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  2 11'==================================-
     A                                      ====================='
     A                                  3 11':  W O R K O R D E R   H I S T O R-
     A                                       Y   I N Q U I R Y  :'
     A                                  4 11'==================================-
     A                                      ====================='
     A                                  7 27'ENTER EQUIPMENT NUMBER'
     A            EQPNUM         6A  B  9 34DSPATR(UL)
     A  01                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 11 10'List to be Sorted by:   (place an -
     A                                      "X" in only one selection)'
     A                                 13 18'FAILURE CODE -'
     A            A              1A  B 13 33DSPATR(UL)
     A  02                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 13 37'<---<<  NOTE:  Enter an "S" to sor-
     A                                      t'
     A                                 14 52'on Subsystem only.'
     A                                 15 14'WORKORDER NUMBER -'
     A            B              1A  B 15 33DSPATR(UL)
     A  03                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 15 52'Otherwise, the entire'
     A                                 16 52'Failure Code will sort.'
     A                                 17 17'COMPLETE DATE -'
     A            C              1A  B 17 33DSPATR(UL)
     A  04                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 19 15'Planned Workorders to be included -
     A                                      in list:'
     A            P              1A  B 19 59DSPATR(UL)
     A  05                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DFT('N')
     A                                 21  9'Enter Equipment Number and Sort Fi-
     A                                      eld and press "ENTER" key.'
     A                                 23  1'F1=RETURN TO MENU     F3=EXIT PROG-
     A                                      RAM     PRESS "ENTER" FOR NEXT SCRE-
     A                                      EN'
     A            COMMANDLIN    79A  O 24  1OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VEXIT
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  2 13'==================================-
     A                                      ======================='
     A                                  3 13':  T E R M I N A T I O N   O R   H-
     A                                       E L P   S C R E E N  :'
     A                                  4 13'==================================-
     A                                      ======================='
     A                                  7  4'PRESS APPROPRIATE'
     A                                  8  5'FUNCTION KEY TO:'
     A                                 10 23'======     =======================-
     A                                      ==============='
     A                                 11  7'CONTINUE -->    : f1 :     :   RET-
     A                                      URN TO CRAFTSMANS FUNCTIONS   :'
     A                                 12 23'======     =======================-
     A                                      ==============='
     A                                 14 23'======     =======================-
     A                                      ==============='
     A                                 15  7'GET HELP -->    : f2 :     :    PR-
     A                                      OGRAM INSTRUCTIONS  (HELP)    :'
     A                                 16 23'======     =======================-
     A                                      ==============='
     A                                 18 23'======     =======================-
     A                                      ==============='
     A                                 19  6'TERMINATE -->    : f3 :     :  EXI-
     A                                      T SESSION AND SIGN-OFF SYSTEM  :'
     A                                 20 23'======     =======================-
     A                                      ==============='
     A                                 23  1'F1=RETURN TO MENU   F2=HELP FUNCTI-
     A                                      ON    F3=EXIT SESSION'
     A            COMMANDLIN    79A  O 24  1OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VEXITSAF
     A*%%TS  DD  19940217  080148  T881S32     REL-V2R3M0  5738-CD1
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1 13'==================================-
     A                                      ======================='
     A                                  2 13':  T E R M I N A T I O N   O R   H-
     A                                       E L P   S C R E E N  :'
     A                                  3 13'==================================-
     A                                      ======================='
     A                                  5  4'PRESS APPROPRIATE'
     A                                  5 22'FUNCTION KEY TO:'
     A                                  7 24'======     =======================-
     A                                      ==============='
     A                                  8  8'CONTINUE -->    : f1 :     :   RET-
     A                                      URN TO CRAFTSMANS FUNCTIONS   :'
     A                                  9 24'======     =======================-
     A                                      ==============='
     A                                 11 24'======     =======================-
     A                                      ==============='
     A                                 12  8'GET HELP -->    : f2 :     :    PR-
     A                                      OGRAM INSTRUCTIONS  (HELP)    :'
     A                                 13 24'======     =======================-
     A                                      ==============='
     A                                 15 24'======     =======================-
     A                                      ==============='
     A                                 16  7'TERMINATE -->    : f3 :     :  EXI-
     A                                      T SESSION AND SIGN-OFF SYSTEM  :'
     A                                 17 24'======     =======================-
     A                                      ==============='
     A                                 19  9'SAFETY '
     A                                 19 24'======     =======================-
     A                                      ==============='
     A                                 20  9'CONTACT -->    : f4 :     :      I-
     A                                      NITIATE SAFETY CONTACT       :'
     A                                 21 24'======     =======================-
     A                                      ==============='
     A                                 23  1'F1=RETURN TO MENU   F2=HELP FUNCTI-
     A                                      ON    F3=EXIT SESSION   F4=SAFETY C-
     A                                      ONTACT'
     A            COMMANDLIN    79A  O 24  1OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VFULSCRN
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A            F1            79A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            F2            79A  B  2  1DSPATR(PR)
     A                                      OVRDTA
     A            F8            79A  B  3  1DSPATR(PR)
     A                                      OVRDTA
     A            F4            79A  B  4  1DSPATR(PR)
     A                                      OVRDTA
     A            F5            79A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            F6            79A  B  6  1DSPATR(PR)
     A                                      OVRDTA
     A            F7            79A  B  7  1DSPATR(PR)
     A                                      OVRDTA
     A            F3            79A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            F9            79A  B  9  1DSPATR(PR)
     A                                      OVRDTA
     A            F10           79A  B 10  1DSPATR(PR)
     A                                      OVRDTA
     A            F11           79A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            F12           79A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            F13           79A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            F14           79A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            F15           79A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            F16           79A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            F17           79A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            F18           79A  B 18  1DSPATR(PR)
     A                                      OVRDTA
     A            F19           79A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            F20           79A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            F21           79A  B 21  1DSPATR(PR)
     A                                      OVRDTA
     A            F22           79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            F23           79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F1=CHANGE SORT KEY   F3=EXIT  -
     A                                        PRESS "ENTER" FOR NEXT SCREEN')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VGETCRFT
     A*%%TS  SD  19890302  150338  T881S32     REL-R01M02  5728-PW1
     A                                      PUTOVR
     A          H                           HLPRCD(HELP00)
     A                                      HLPARA(1 1 24 80)
     A                                  1  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A                                  2  2':                                 -
     A                                                                         -
     A                                              :'
     A                                  3  2':                                 -
     A                                                                         -
     A                                              :'
     A                                  4  2':               EEEEEE   NNN   NN -
     A                                        TTTTTT   EEEEEE   RRRRR          -
     A                                              :'
     A                                  5  2':               EE       NNNN  NN -
     A                                          TT     EE       RR  RR         -
     A                                              :'
     A                                  6  2':               EEEE     NN NN NN -
     A                                          TT     EEEE     RRRRR          -
     A                                              :'
     A                                  7  2':               EE       NN  NNNN -
     A                                          TT     EE       RR RR          -
     A                                              :'
     A                                  8  2':               EEEEEE   NN   NNN -
     A                                          TT     EEEEEE   RR  RR         -
     A                                              :'
     A                                  9  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 10  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 11  2':              CCCCC   RRRRR      -
     A                                        AAA       FFFFFF   TTTTTT        -
     A                                              :'
     A                                 12  2':             CC       RR  RR     -
     A                                       AA AA      FF         TT          -
     A                                              :'
     A                                 13  2':             CC       RRRRR      -
     A                                      AA   AA     FFFF       TT          -
     A                                              :'
     A                                 14  2':             CC       RR RR     A-
     A                                      AAAAAAAA    FF         TT          -
     A                                              :'
     A                                 15  2':              CCCCC   RR  RR   AA-
     A                                             AA   FF         TT          -
     A                                              :'
     A                                 16  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 17  2':               ==================-
     A                                      ========================           -
     A                                              :'
     A                                 18  2':               :                 -
     A                                                             :           -
     A                                              :'
     A                                 19  2':               :'
     A            CRAFT          2A  B 19 39DSPATR(UL)
     A  01                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 19 59':                   :'
     A                                 20  2':               :                 -
     A                                                             :           -
     A                                              :'
     A                                 21  2':               ==================-
     A                                      ========================           -
     A                                              :'
     A                                 22  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 23  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('  F3=RETURN TO MENU')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VGETZONE
     A*%%TS  SD  19890302  150338  T881S32     REL-R01M02  5728-PW1
     A                                      PUTOVR
     A          H                           HLPRCD(HELP00)
     A                                      HLPARA(1 1 24 80)
     A                                  1  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A                                  2  2':                                 -
     A                                                                         -
     A                                              :'
     A                                  3  2':                                 -
     A                                                                         -
     A                                              :'
     A                                  4  2':                                 -
     A                                                                         -
     A                                              :'
     A                                  5  2':              EEEEEE   NNN   NN  -
     A                                       TTTTTT   EEEEEE   RRRRR           -
     A                                              :'
     A                                  6  2':              EE       NNNN  NN  -
     A                                         TT     EE       RR  RR          -
     A                                              :'
     A                                  7  2':              EEEE     NN NN NN  -
     A                                         TT     EEEE     RRRRR           -
     A                                              :'
     A                                  8  2':              EE       NN  NNNN  -
     A                                         TT     EE       RR RR           -
     A                                              :'
     A                                  9  2':              EEEEEE   NN   NNN  -
     A                                         TT     EEEEEE   RR  RR          -
     A                                              :'
     A                                 10  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 11  2':                  ZZZZZZ    OOOOO-
     A                                          NNN   NN   EEEEEE              -
     A                                              :'
     A                                 12  2':                     ZZ    OO   O-
     A                                      O   NNNN  NN   EE                  -
     A                                              :'
     A                                 13  2':                    ZZ     OO   O-
     A                                      O   NN NN NN   EEEE                -
     A                                              :'
     A                                 14  2':                   ZZ      OO   O-
     A                                      O   NN  NNNN   EE                  -
     A                                              :'
     A                                 15  2':                  ZZZZZZ    OOOOO-
     A                                          NN   NNN   EEEEEE              -
     A                                              :'
     A                                 16  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 17  2':               ==================-
     A                                      ========================           -
     A                                              :'
     A                                 18  2':               :                 -
     A                                                             :           -
     A                                              :'
     A                                 19  2':               :'
     A            ZONE           4A  B 19 38DSPATR(UL)
     A  01                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 19 59':                   :'
     A                                 20  2':               :                 -
     A                                                             :           -
     A                                              :'
     A                                 21  2':               ==================-
     A                                      ========================           -
     A                                              :'
     A                                 22  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 23  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('  F3=RETURN TO MENU')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VHELPMULT
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':           W O R K O R D E R   R -
     A                                      E S E R V A T I O N   S C R E E N  -
     A                                              :'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':                                 -
     A                                                                         -
     A                                              :'
     A                                  5  2': This screen will list up to the -
     A                                      top 5 verbal workorders from the wo-
     A                                      rkorder :'
     A                                  6  2': queue for the same piece of equi-
     A                                      pment on which you have signed "IP"-
     A                                      .       :'
     A                                  7  2': Any or all of these may be reser-
     A                                      ved by placing an "R" in the field -
     A                                      before  :'
     A                                  8  2': the the workorders desired and p-
     A                                      ressing the "ENTER" key.  Also, if -
     A                                      you     :'
     A                                  9  2': press the "f7" key, the workorde-
     A                                      r queue will be displayed for all t-
     A                                      he      :'
     A                                 10  2': equipment in your zone.  If an "-
     A                                      R" is placed before any workorder n-
     A                                      umber   :'
     A                                 11  2': in the queue, it will be reserve-
     A                                      d up to a total of 5 different work-
     A                                      orders. :'
     A                                 12  2': When the "f3" key is pressed fro-
     A                                      m the queue display, this screen wi-
     A                                      ll be   :'
     A                                 13  2': displayed showing all the workor-
     A                                      ders which have been reserved.  At -
     A                                      this    :'
     A                                 14  2': time, the reservations can still-
     A                                       be changed, the queue may by displ-
     A                                      ayed    :'
     A                                 15  2': again, the reservations may be s-
     A                                      aved by pressing the "ENTER" key, o-
     A                                      r       :'
     A                                 16  2': the reservations may be cancelle-
     A                                      d (not saved) by pressing the "f3" -
     A                                      key.    :'
     A                                 17  2': NOTE:  No reservations are actua-
     A                                      lly saved until the "ENTER" key is -
     A                                      pressed :'
     A                                 18  2':        on this screen.          -
     A                                                                         -
     A                                              :'
     A                                 19  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 20  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 21  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 22  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                 23  1'F3=RETURN'
     A            COMMANDLIN    79A  O 24  1OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VINITWO
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1 15'==================================-
     A                                      ============='
     A                                  2 15':  W O R K   O R D E R   I N I T I-
     A                                       A T I O N  :'
     A                                  3 15'==================================-
     A                                      ============='
     A                                  6  3'Requestor'
     A            REQUESTOR     16A  B  6 13DSPATR(UL)
     A  01                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  6 57'Equipment Number'
     A            EQPNUM         6A  B  6 74DSPATR(UL)
     A  02                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  8  3'Priority   Equipment Down   W/O De-
     A                                      scription                    Skill -
     A                                      Required'
     A                                  9  3'--------   --------------   -------
     A                                      ------------------------     -------
     A                                      --------'
     A            P              1A  B 10  3DSPATR(UL)
     A  15                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            EQPDWN         1A  B 10 14DSPATR(UL)
     A  04                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            DESC          30A  B 10 31DSPATR(UL)
     A  08                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            CRAFT1         2A  B 10 66DSPATR(UL)
     A  05                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            CRAFT2         2A  B 10 70DSPATR(UL)
     A  06                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            CRAFT3         2A  B 10 74DSPATR(UL)
     A  07                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 12  3'Additional Information:'
     A            DES2A         66A  B 13  7DSPATR(UL)
     A  09                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            DES2B         66A  B 14  7DSPATR(UL)
     A  10                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 16 15'Enter an "X" to initiate a PLANNED-
     A                                       Workorder'
     A            X              1A  B 16 61DSPATR(UL)
     A  19                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            ASBESTOS      36A  B 18 19DSPATR(PR)
     A                                      OVRDTA
     A            AFLAG          1A  B 18 57OVRATR
     A                                      OVRDTA
     A  80                                  DSPATR(UL)
     A N80                                  DSPATR(PR)
     A            MSG           50A  B 20 14DSPATR(PR)
     A                                      OVRDTA
     A                                 22 23'ENTER DATA AND PRESS "ENTER" KEY'
     A                                 23  1'F1=RETURN TO MENU   F3=EXIT PROGRA-
     A                                      M'
DCR01A                                 23 39'F5=EQUIP SELECTION'
     A            COMMANDLIN    79A  O 24  1OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VINQMENU
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  2 15'==================================-
     A                                      ==============='
     A                                  3 15':  W O R K O R D E R   I N Q U I R-
     A                                       Y   M E N U  :'
     A                                  4 15'==================================-
     A                                      ==============='
     A                                  6 19'PRESS:'
     A                                  8 21'f1   -   Workorder Inquiry by Stat-
     A                                      us'
     A                                 10 21'f2   -   Equipment Workorder Histo-
     A                                      ry Inquiry'
     A                                 12 21'f3   -   Return to Additional Func-
     A                                      tions Screen'
     A                                 14 21'f4   -   Craftsman Current Assignm-
     A                                      ent Inquiry'
     A                                 16 21'f5   -     **  No Function  **'
     A                                 18 21'f6   -     **  No Function  **'
     A                                 20 21'F7   -   Planned Workorder Backlog-
     A                                       Inquiry'
     A                                 22 21'f8   -   Preventive Maintenance Wo-
     A                                      rkorder Queue'
     A                                 23  1'F3=RETURN TO MENU'
     A            COMMANDLIN    79A  O 24  1OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VINQMENU2
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  2 15'==================================-
     A                                      ==============='
     A                                  3 15':  W O R K O R D E R   I N Q U I R-
     A                                       Y   M E N U  :'
     A                                  4 15'==================================-
     A                                      ==============='
     A                                  6 19'PRESS:'
     A                                  8 21'f1   -   Workorder Inquiry by Stat-
     A                                      us'
     A                                 10 21'f2   -   Equipment Workorder Histo-
     A                                      ry Inquiry'
     A                                 12 21'f3   -   Return to Additional Func-
     A                                      tions Screen'
     A                                 14 21'f4   -   Craftsman Current Assignm-
     A                                      ent Inquiry'
     A                                 16 21'f5   -     **  No Function  **'
     A                                 18 21'f6   -   Multiple Item Storeroom W-
     A                                      ithdrawals'
     A                                 20 21'F7   -   Planned Workorder Backlog-
     A                                       Inquiry'
     A                                 22 21'f8   -   Preventive Maintenance Wo-
     A                                      rkorder Queue'
     A                                 23  1'F3=RETURN TO MENU'
     A            COMMANDLIN    79A  O 24  1OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VINQMENU3
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  2 15'==================================-
     A                                      ==============='
     A                                  3 15':  W O R K O R D E R   I N Q U I R-
     A                                       Y   M E N U  :'
     A                                  4 15'==================================-
     A                                      ==============='
     A                                  6 19'PRESS:'
     A                                  8 21'f1   -   Workorder Inquiry by Stat-
     A                                      us'
     A                                 10 21'f2   -   Equipment Workorder Histo-
     A                                      ry Inquiry'
     A                                 12 21'f3   -   Return to Additional Func-
     A                                      tions Screen'
     A                                 14 21'f4   -   Craftsman Current Assignm-
     A                                      ent Inquiry'
     A                                 16 21'f5   -   Print Craftsman''s Worksh-
     A                                      eet'
     A                                 18 21'f6   -     **  No Function  **'
     A                                 20 21'F7   -   Planned Workorder Backlog-
     A                                       Inquiry'
     A                                 22 21'f8   -   Preventive Maintenance Wo-
     A                                      rkorder Queue'
     A                                 23  1'F3=RETURN TO MENU'
     A            COMMANDLIN    79A  O 24  1OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VINQMENU4
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  2 15'==================================-
     A                                      ==============='
     A                                  3 15':  W O R K O R D E R   I N Q U I R-
     A                                       Y   M E N U  :'
     A                                  4 15'==================================-
     A                                      ==============='
     A                                  6 19'PRESS:'
     A                                  8 21'f1   -   Workorder Inquiry by Stat-
     A                                      us'
     A                                 10 21'f2   -   Equipment Workorder Histo-
     A                                      ry Inquiry'
     A                                 12 21'f3   -   Return to Additional Func-
     A                                      tions Screen'
     A                                 14 21'f4   -   Craftsman Current Assignm-
     A                                      ent Inquiry'
     A                                 16 21'f5   -   Print Craftsman''s Worksh-
     A                                      eet'
     A                                 18 21'f6   -   Multiple Item Storeroom W-
     A                                      ithdrawals'
     A                                 20 21'F7   -   Planned Workorder Backlog-
     A                                       Inquiry'
     A                                 22 21'f8   -   Preventive Maintenance Wo-
     A                                      rkorder Queue'
     A                                 23  1'F3=RETURN TO MENU'
     A            COMMANDLIN    79A  O 24  1OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VMULTHELP
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':     M U L T I P L E   W O R K O -
     A                                      R D E R   "L V / C W"   P R O G R A-
     A                                       M      :'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2': The first screen allows the craf-
     A                                      tsman to select from the reserved w-
     A                                      orkorder:'
     A                                  5  2': list, those workorders which he -
     A                                      has completed   those on which he h-
     A                                      as      :'
     A                                  6  2': performed labor but has not comp-
     A                                      leted   and any which he may have r-
     A                                      eserved :'
     A                                  7  2': but did not perform any labor.  -
     A                                      The first workorder is always that -
     A                                      which he:'
     A                                  8  2': is signed "IP" onto.  Enter a "0-
     A                                      ", "1" or "2" as instructed from th-
     A                                      e screen:'
     A                                  9  2': and press the "ENTER" key.  The -
     A                                      "f1" thru "f6" keys will display th-
     A                                      e       :'
     A                                 10  2': corresponding workorder if desir-
     A                                      ed.                                -
     A                                              :'
     A                                 11  2'1----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                 12  2': The second screen allows the tot-
     A                                      al labor time to be apportioned amo-
     A                                      ng the  :'
     A                                 13  2': various reserved workorders.  Th-
     A                                      e total number of labor minutes fro-
     A                                      m the   :'
     A                                 14  2': initial "IP" time to the current-
     A                                       clock time are given.  Enter the l-
     A                                      abor    :'
     A                                 15  2': minutes spent on each workorder -
     A                                      and press the "ENTER" key to calcul-
     A                                      ate the :'
     A                                 16  2': proper start and stop times.  An-
     A                                      y labor minutes may be changed and -
     A                                      the     :'
     A                                 17  2': "ENTER" key may be pressed as of-
     A                                      ten as desired to allow the program-
     A                                       to     :'
     A                                 18  2': re-calculate the times until the-
     A                                       craftsman is satisfied that the nu-
     A                                      mbers   :'
     A                                 19  2': are correct.  When a labor time -
     A                                      has been entered for each workorder-
     A                                       on the :'
     A                                 20  2': list, and when the labor minutes-
     A                                       left unaccounted for is equal to z-
     A                                      ero,    :'
     A                                 21  2': press the "f5" key to write the -
     A                                      labor records.                     -
     A                                              :'
     A                                 22  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                 23  1'F3=RETURN'
     A            COMMANDLIN    79A  O 24  1OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VMULTILV1
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A                                  2  2':    M U L T I P L E   "I P"   W O-
     A                                       R K O R D E R   L E A V E / C L O -
     A                                      S E     :'
     A                                  3  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A                                  6  2'START DATE/TIME:'
     A            MM             2A  B  6 20DSPATR(PR)
     A                                      OVRDTA
     A            DD             2A  B  6 23DSPATR(PR)
     A                                      OVRDTA
     A            YY             2A  B  6 26DSPATR(PR)
     A                                      OVRDTA
     A            IPTM           4A  B  6 29DSPATR(PR)
     A                                      OVRDTA
     A                                  6 39'STOP DATE/TIME:'
     A            SM             2A  B  6 56DSPATR(PR)
     A                                      OVRDTA
     A            SD             2A  B  6 59DSPATR(PR)
     A                                      OVRDTA
     A            SY             2A  B  6 62DSPATR(PR)
     A                                      OVRDTA
     A            CWTM           4A  B  6 65DSPATR(PR)
     A                                      OVRDTA
     A                                  6 71'(CURRENT)'
     A                                  8  1'---------------------------------'
     A                                  9  1':                               : -
     A                                          WO NUMBER   DESCRIPTION'
     A                                 10  1': YOU ARE INDICATED AS HAVING   :'
     A                                 11  1': RESERVED THESE WORKORDERS FOR :'
     A            A              1A  B 11 36DSPATR(UL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            W1            10A  B 11 39DSPATR(PR)
     A                                      OVRDTA
     A            DESC1         30A  B 11 50DSPATR(PR)
     A                                      OVRDTA
     A                                 12  1': COMPLETION.  PLEASE IDENTIFY  :'
     A                                 13  1': EACH WORKORDER FOR:           :'
     A            B              1A  B 13 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A            W2            10A  B 13 39DSPATR(PR)
     A                                      OVRDTA
     A            DESC2         30A  B 13 50DSPATR(PR)
     A                                      OVRDTA
     A                                 14  1':                               :'
     A                                 15  1':   0 -  NO WORK PERFORMED      :'
     A            C              1A  B 15 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A            W3            10A  B 15 39DSPATR(PR)
     A                                      OVRDTA
     A            DESC3         30A  B 15 50DSPATR(PR)
     A                                      OVRDTA
     A                                 16  1':   1 -  WORK PERFORMED BUT NOT :'
     A                                 17  1':        COMPLETED (LV)         :'
     A            D              1A  B 17 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A            W4            10A  B 17 39DSPATR(PR)
     A                                      OVRDTA
     A            DESC4         30A  B 17 50DSPATR(PR)
     A                                      OVRDTA
     A                                 18  1':   2 -  WORK COMPLETED (CW)    :'
     A                                 19  1':                               :'
     A            E              1A  B 19 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A            W5            10A  B 19 39DSPATR(PR)
     A                                      OVRDTA
     A            DESC5         30A  B 19 50DSPATR(PR)
     A                                      OVRDTA
     A                                 20  1': ENTER EACH CODE AND PRESS THE :'
     A                                 21  1': "ENTER" KEY TO APPORTION TIME :'
     A            F              1A  B 21 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A            W6            10A  B 21 39DSPATR(PR)
     A                                      OVRDTA
     A            DESC6         30A  B 21 50DSPATR(PR)
     A                                      OVRDTA
     A                                 22  1'---------------------------------'
     A                                 23  1'F1=DISPLAY WO       F2=DISPLAY WO -
     A                                            F8=DISPLAY WO       F4=DISPLA-
     A                                      Y WO'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F5=DISPLAY WO       F6=DISPLAY-
     A                                       WO       F7=HELP             F3=RE-
     A                                      TURN')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VMULTILV2
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A                                  2  2':    M U L T I P L E   "I P"   W O-
     A                                       R K O R D E R   L E A V E / C L O -
     A                                      S E     :'
     A                                  3  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A                                  5  2'START DATE/TIME:'
     A            MM             2A  B  5 20DSPATR(PR)
     A                                      OVRDTA
     A            DD             2A  B  5 23DSPATR(PR)
     A                                      OVRDTA
     A            YY             2A  B  5 26DSPATR(PR)
     A                                      OVRDTA
     A            IPTM           4A  B  5 29DSPATR(PR)
     A                                      OVRDTA
     A                                  5 39'STOP DATE/TIME:'
     A            SM             2A  B  5 56DSPATR(PR)
     A                                      OVRDTA
     A            SD             2A  B  5 59DSPATR(PR)
     A                                      OVRDTA
     A            SY             2A  B  5 62DSPATR(PR)
     A                                      OVRDTA
     A            CWTM           4A  B  5 65DSPATR(PR)
     A                                      OVRDTA
     A                                  5 71'(CURRENT)'
     A                                  6  2'TOTAL NUMBER OF MINUTES ON JOB:'
     A            JOBT           4A  B  6 35DSPATR(PR)
     A                                      OVRDTA
     A                                  6 45'MINUTES LEFT UNACCOUNTED FOR:'
     A            MINL           4A  B  6 76DSPATR(UL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  7  4'WO NUMBER  DESCRIPTION            -
     A                                           START:        STOP:         MI-
     A                                      NUTES'
     A            S1             2A  B  9  1DSPATR(PR)
     A                                      OVRDTA
     A            W1            10A  B  9  4DSPATR(PR)
     A                                      OVRDTA
     A            DESC1         27A  B  9 15DSPATR(PR)
     A                                      OVRDTA
     A            A1             2A  B  9 43DSPATR(PR)
     A                                      OVRDTA
     A            B1             2A  B  9 46DSPATR(PR)
     A                                      OVRDTA
     A            C1             2A  B  9 49DSPATR(PR)
     A                                      OVRDTA
     A            IPT1           4A  B  9 52DSPATR(PR)
     A                                      OVRDTA
     A            D1             2A  B  9 57DSPATR(PR)
     A                                      OVRDTA
     A            E1             2A  B  9 60DSPATR(PR)
     A                                      OVRDTA
     A            F1             2A  B  9 63DSPATR(PR)
     A                                      OVRDTA
     A            CWT1           4A  B  9 66DSPATR(PR)
     A                                      OVRDTA
     A            MIN1           4A  B  9 71DSPATR(PR)
     A                                      OVRDTA
     A            MNT1           4A  B  9 76DSPATR(UL)
     A  01                                  DSPATR(PC)
     A                                      OVRDTA
     A            S2             2A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            W2            10A  B 11  4DSPATR(PR)
     A                                      OVRDTA
     A            DESC2         27A  B 11 15DSPATR(PR)
     A                                      OVRDTA
     A            A2             2A  B 11 43DSPATR(PR)
     A                                      OVRDTA
     A            B2             2A  B 11 46DSPATR(PR)
     A                                      OVRDTA
     A            C2             2A  B 11 49DSPATR(PR)
     A                                      OVRDTA
     A            IPT2           4A  B 11 52DSPATR(PR)
     A                                      OVRDTA
     A            D2             2A  B 11 57DSPATR(PR)
     A                                      OVRDTA
     A            E2             2A  B 11 60DSPATR(PR)
     A                                      OVRDTA
     A            F2             2A  B 11 63DSPATR(PR)
     A                                      OVRDTA
     A            CWT2           4A  B 11 66DSPATR(PR)
     A                                      OVRDTA
     A            MIN2           4A  B 11 71DSPATR(PR)
     A                                      OVRDTA
     A            MNT2           4A  B 11 76DSPATR(UL)
     A  02                                  DSPATR(PC)
     A                                      OVRDTA
     A            S3             2A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            W3            10A  B 13  4DSPATR(PR)
     A                                      OVRDTA
     A            DESC3         27A  B 13 15DSPATR(PR)
     A                                      OVRDTA
     A            A3             2A  B 13 43DSPATR(PR)
     A                                      OVRDTA
     A            B3             2A  B 13 46DSPATR(PR)
     A                                      OVRDTA
     A            C3             2A  B 13 49DSPATR(PR)
     A                                      OVRDTA
     A            IPT3           4A  B 13 52DSPATR(PR)
     A                                      OVRDTA
     A            D3             2A  B 13 57DSPATR(PR)
     A                                      OVRDTA
     A            E3             2A  B 13 60DSPATR(PR)
     A                                      OVRDTA
     A            F8             2A  B 13 63DSPATR(PR)
     A                                      OVRDTA
     A            CWT3           4A  B 13 66DSPATR(PR)
     A                                      OVRDTA
     A            MIN3           4A  B 13 71DSPATR(PR)
     A                                      OVRDTA
     A            MNT3           4A  B 13 76DSPATR(UL)
     A  03                                  DSPATR(PC)
     A                                      OVRDTA
     A            S4             2A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            W4            10A  B 15  4DSPATR(PR)
     A                                      OVRDTA
     A            DESC4         27A  B 15 15DSPATR(PR)
     A                                      OVRDTA
     A            A4             2A  B 15 43DSPATR(PR)
     A                                      OVRDTA
     A            B4             2A  B 15 46DSPATR(PR)
     A                                      OVRDTA
     A            C4             2A  B 15 49DSPATR(PR)
     A                                      OVRDTA
     A            IPT4           4A  B 15 52DSPATR(PR)
     A                                      OVRDTA
     A            D4             2A  B 15 57DSPATR(PR)
     A                                      OVRDTA
     A            E4             2A  B 15 60DSPATR(PR)
     A                                      OVRDTA
     A            F4             2A  B 15 63DSPATR(PR)
     A                                      OVRDTA
     A            CWT4           4A  B 15 66DSPATR(PR)
     A                                      OVRDTA
     A            MIN4           4A  B 15 71DSPATR(PR)
     A                                      OVRDTA
     A            MNT4           4A  B 15 76DSPATR(UL)
     A  04                                  DSPATR(PC)
     A                                      OVRDTA
     A            S5             2A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            W5            10A  B 17  4DSPATR(PR)
     A                                      OVRDTA
     A            DESC5         27A  B 17 15DSPATR(PR)
     A                                      OVRDTA
     A            A5             2A  B 17 43DSPATR(PR)
     A                                      OVRDTA
     A            B5             2A  B 17 46DSPATR(PR)
     A                                      OVRDTA
     A            C5             2A  B 17 49DSPATR(PR)
     A                                      OVRDTA
     A            IPT5           4A  B 17 52DSPATR(PR)
     A                                      OVRDTA
     A            D5             2A  B 17 57DSPATR(PR)
     A                                      OVRDTA
     A            E5             2A  B 17 60DSPATR(PR)
     A                                      OVRDTA
     A            F5             2A  B 17 63DSPATR(PR)
     A                                      OVRDTA
     A            CWT5           4A  B 17 66DSPATR(PR)
     A                                      OVRDTA
     A            MIN5           4A  B 17 71DSPATR(PR)
     A                                      OVRDTA
     A            MNT5           4A  B 17 76DSPATR(UL)
     A  05                                  DSPATR(PC)
     A                                      OVRDTA
     A            S6             2A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            W6            10A  B 19  4DSPATR(PR)
     A                                      OVRDTA
     A            DESC6         27A  B 19 15DSPATR(PR)
     A                                      OVRDTA
     A            A6             2A  B 19 43DSPATR(PR)
     A                                      OVRDTA
     A            B6             2A  B 19 46DSPATR(PR)
     A                                      OVRDTA
     A            C6             2A  B 19 49DSPATR(PR)
     A                                      OVRDTA
     A            IPT6           4A  B 19 52DSPATR(PR)
     A                                      OVRDTA
     A            D6             2A  B 19 57DSPATR(PR)
     A                                      OVRDTA
     A            E6             2A  B 19 60DSPATR(PR)
     A                                      OVRDTA
     A            F6             2A  B 19 63DSPATR(PR)
     A                                      OVRDTA
     A            CWT6           4A  B 19 66DSPATR(PR)
     A                                      OVRDTA
     A            MIN6           4A  B 19 71DSPATR(PR)
     A                                      OVRDTA
     A            MNT6           4A  B 19 76DSPATR(UL)
     A  06                                  DSPATR(PC)
     A                                      OVRDTA
     A                                 21  1'ENTER MINUTES WORKED ON EACH JOB I-
     A                                      N FIELDS NEXT TO WO#.  PRESS "ENTER-
     A                                      " KEY WHEN'
     A                                 22  1'DESIRED TO RE-CALCULATE ALL TIMES -
     A                                      AND MINUTES LEFT.   WHEN ALL MINUTE-
     A                                      S AND ALL'
     A                                 23  1'WO''s ARE ACCOUNTED FOR, PRESS THE-
     A                                       "f5" KEY TO WRITE DATA.  PRESS "f7-
     A                                      " FOR HELP.'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F5=ACCEPT TIMES     F7=HELP   -
     A                                                F3=RETURN')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VRESMSGS
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A            RM1           50A  B  8 15DSPATR(PR)
     A                                      OVRDTA
     A            RM2           50A  B  9 15DSPATR(PR)
     A                                      OVRDTA
     A            RM3           50A  B 10 15DSPATR(PR)
     A                                      OVRDTA
     A            RM4           50A  B 11 15DSPATR(PR)
     A                                      OVRDTA
     A            RM5           50A  B 12 15DSPATR(PR)
     A                                      OVRDTA
     A            RM6           50A  B 13 15DSPATR(PR)
     A                                      OVRDTA
     A            RM7           50A  B 14 15DSPATR(PR)
     A                                      OVRDTA
     A            RM8           50A  B 15 15DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLIN    79A  O 24  1DFT('  PRESS ''ENTER'' TO CONTINUE -
     A                                           F6 FOR HELP')
     A  96                                  OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VRESLIST
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A            DS1           76A  B  6  3DSPATR(PR)
     A                                      OVRDTA
     A            DS2           76A  B  7  3DSPATR(PR)
     A                                      OVRDTA
     A            RM1           71A  B  9  3DSPATR(PR)
     A                                      OVRDTA
     A            RM2           71A  B 11  3DSPATR(PR)
     A                                      OVRDTA
     A            RM3           71A  B 13  3DSPATR(PR)
     A                                      OVRDTA
     A            RM4           71A  B 15  3DSPATR(PR)
     A                                      OVRDTA
     A            RM5           71A  B 17  3DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLIN    79A  O 24  1DFT('  PRESS ''ENTER'' TO CONTINUE')
     A  96                                  OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VMULTQUE
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A  96                                  CF24
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  2  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  3  2':     OTHER WORKORDERS IN THE QUEU-
     A                                      E FOR YOUR CRAFT FOR EQUIPMENT'
     A            EQUIPN         6A  B  3 67DSPATR(PR)
     A                                      OVRDTA
     A                                  3 79':'
     A                                  4  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6 13'QUEUE'
     A                                  7 13'FACTOR    DOWN  WO NUMBER  DESCRIP-
     A                                      TION                      SKILLS'
     A                                  8  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            F              1A  B  9  2DSPATR(UL)
     A  71                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  9  5'WO - A'
     A            R1             2A  B  9 14DSPATR(PR)
     A                                      OVRDTA
     A            E1             6A  B  9 17DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  9 25DSPATR(PR)
     A                                      OVRDTA
     A            W1            10A  B  9 29DSPATR(PR)
     A                                      OVRDTA
     A            D1            30A  B  9 40DSPATR(PR)
     A                                      OVRDTA
     A            SA             2A  B  9 72DSPATR(PR)
     A                                      OVRDTA
     A            SB             2A  B  9 75DSPATR(PR)
     A                                      OVRDTA
     A            SC             2A  B  9 78DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 11  2DSPATR(UL)
     A  72                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 11  5'WO - B'
     A            R2             2A  B 11 14DSPATR(PR)
     A                                      OVRDTA
     A            E2             6A  B 11 17DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B 11 25DSPATR(PR)
     A                                      OVRDTA
     A            W2            10A  B 11 29DSPATR(PR)
     A                                      OVRDTA
     A            D2            30A  B 11 40DSPATR(PR)
     A                                      OVRDTA
     A            SD             2A  B 11 72DSPATR(PR)
     A                                      OVRDTA
     A            SE             2A  B 11 75DSPATR(PR)
     A                                      OVRDTA
     A            SF             2A  B 11 78DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 13  2DSPATR(UL)
     A  73                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 13  5'WO - C'
     A            R3             2A  B 13 14DSPATR(PR)
     A                                      OVRDTA
     A            E3             6A  B 13 17DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 13 25DSPATR(PR)
     A                                      OVRDTA
     A            W3            10A  B 13 29DSPATR(PR)
     A                                      OVRDTA
     A            D3            30A  B 13 40DSPATR(PR)
     A                                      OVRDTA
     A            SG             2A  B 13 72DSPATR(PR)
     A                                      OVRDTA
     A            SH             2A  B 13 75DSPATR(PR)
     A                                      OVRDTA
     A            SI             2A  B 13 78DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 15  2DSPATR(UL)
     A  74                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 15  5'WO - D'
     A            R4             2A  B 15 14DSPATR(PR)
     A                                      OVRDTA
     A            E4             6A  B 15 17DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 15 25DSPATR(PR)
     A                                      OVRDTA
     A            W4            10A  B 15 29DSPATR(PR)
     A                                      OVRDTA
     A            D4            30A  B 15 40DSPATR(PR)
     A                                      OVRDTA
     A            SJ             2A  B 15 72DSPATR(PR)
     A                                      OVRDTA
     A            SK             2A  B 15 75DSPATR(PR)
     A                                      OVRDTA
     A            SL             2A  B 15 78DSPATR(PR)
     A                                      OVRDTA
     A            J              1A  B 17  2DSPATR(UL)
     A  75                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 17  5'WO - E'
     A            R5             2A  B 17 14DSPATR(PR)
     A                                      OVRDTA
     A            E5             6A  B 17 17DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 17 25DSPATR(PR)
     A                                      OVRDTA
     A            W5            10A  B 17 29DSPATR(PR)
     A                                      OVRDTA
     A            D5            30A  B 17 40DSPATR(PR)
     A                                      OVRDTA
     A            SM             2A  B 17 72DSPATR(PR)
     A                                      OVRDTA
     A            SN             2A  B 17 75DSPATR(PR)
     A                                      OVRDTA
     A            SO             2A  B 17 78DSPATR(PR)
     A                                      OVRDTA
     A                                 18  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 19  5'PRESS "f1, f2, f4, f5, or f8" TO D-
     A                                      ISPLAY ANY OF THE ABOVE WORKORDERS.'
     A                                 20  4'IF YOU WISH TO WORK ON ANY OF THE -
     A                                      ABOVE WORKORDERS AT THE SAME TIME A-
     A                                      S THE'
     A                                 21  5'ONE ON WHICH YOU ARE STARTING  SEL-
     A                                      ECT THEM BY PLACING AN "R" NEXT TO -
     A                                      THE'
     A                                 22  2'DESIRED WORKORDERS, AND PRESSING "-
     A                                      ENTER"  OTHERWISE PRESS "ENTER" TO -
     A                                      CONTINUE.'
     A                                 23  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('   F3=RETURN    F6=HELP SCREEN-
     A                                          F7=DISPLAY WO QUEUE')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VPASWORD
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  2  1'****  PASSWORD REQUIRED  ****'
     A                                  4  2'PROGRAM:'
     A            PROGNAME       8A  B  4 12DSPATR(PR)
     A                                      OVRDTA
     A                                  6  5'USER:'
     A            SG             8A  B  6 12DSPATR(PR)
     A                                      OVRDTA
     A                                  8  1'TERMINAL:'
     A            TERM           4A  B  8 12DSPATR(PR)
     A                                      OVRDTA
     A            INP1          16A  B 10 20DSPATR(PR)
     A                                      OVRDTA
     A            EP            17A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            PASSWORD       8A  B 12 21
     A  13                                  DSPATR(UL)
     A  13                                  DSPATR(PC)
     A                                      DSPATR(ND)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 12 32'AND PRESS "ENTER" KEY.'
     A            ER            40A  B 16  5DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLIN    79A  O 24  1OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VPMQUEUE
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  4'P M   O P E N   W O R K O R D E R -
     A                                        Q U E U E   F O R'
     A            ZONECRAFT     10A  B  2 60DSPATR(PR)
     A                                      OVRDTA
     A            ZONE           4A  B  2 71DSPATR(PR)
     A                                      OVRDTA
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2'QUEUE'
     A            SEARCH        29A  B  4 26DSPATR(PR)
     A                                      OVRDTA
     A                                  4 70'DATE'
     A                                  5  2'FACTOR   WORKORDER  STATUS  EQUIP.-
     A                                        DESCRIPTION                    RE-
     A                                      LEASED'
     A                                  6  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A            Q1             2A  B  7  4DSPATR(PR)
     A                                      OVRDTA
     A            W1            11A  B  7 10
     A  12                                  DSPATR(UL)
     A  12                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            S1             2A  B  7 24DSPATR(PR)
     A                                      OVRDTA
     A            E1             6A  B  7 30DSPATR(PR)
     A                                      OVRDTA
     A            D1            30A  B  7 38DSPATR(PR)
     A                                      OVRDTA
     A            R1             8A  B  7 70DSPATR(PR)
     A                                      OVRDTA
     A            Q2             2A  B  8  4DSPATR(PR)
     A                                      OVRDTA
     A            W2            11A  B  8 10
     A  20                                  DSPATR(UL)
     A  20                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            S2             2A  B  8 24DSPATR(PR)
     A                                      OVRDTA
     A            E2             6A  B  8 30DSPATR(PR)
     A                                      OVRDTA
     A            D2            30A  B  8 38DSPATR(PR)
     A                                      OVRDTA
     A            R2             8A  B  8 70DSPATR(PR)
     A                                      OVRDTA
     A            Q3             2A  B  9  4DSPATR(PR)
     A                                      OVRDTA
     A            W3            11A  B  9 10
     A  28                                  DSPATR(UL)
     A  28                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            S3             2A  B  9 24DSPATR(PR)
     A                                      OVRDTA
     A            E3             6A  B  9 30DSPATR(PR)
     A                                      OVRDTA
     A            D3            30A  B  9 38DSPATR(PR)
     A                                      OVRDTA
     A            R3             8A  B  9 70DSPATR(PR)
     A                                      OVRDTA
     A            Q4             2A  B 10  4DSPATR(PR)
     A                                      OVRDTA
     A            W4            11A  B 10 10
     A  36                                  DSPATR(UL)
     A  36                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            S4             2A  B 10 24DSPATR(PR)
     A                                      OVRDTA
     A            E4             6A  B 10 30DSPATR(PR)
     A                                      OVRDTA
     A            D4            30A  B 10 38DSPATR(PR)
     A                                      OVRDTA
     A            R4             8A  B 10 70DSPATR(PR)
     A                                      OVRDTA
     A            Q5             2A  B 11  4DSPATR(PR)
     A                                      OVRDTA
     A            W5            11A  B 11 10
     A  44                                  DSPATR(UL)
     A  44                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            S5             2A  B 11 24DSPATR(PR)
     A                                      OVRDTA
     A            E5             6A  B 11 30DSPATR(PR)
     A                                      OVRDTA
     A            D5            30A  B 11 38DSPATR(PR)
     A                                      OVRDTA
     A            R5             8A  B 11 70DSPATR(PR)
     A                                      OVRDTA
     A            Q6             2A  B 12  4DSPATR(PR)
     A                                      OVRDTA
     A            W6            11A  B 12 10
     A  52                                  DSPATR(UL)
     A  52                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            S6             2A  B 12 24DSPATR(PR)
     A                                      OVRDTA
     A            E6             6A  B 12 30DSPATR(PR)
     A                                      OVRDTA
     A            D6            30A  B 12 38DSPATR(PR)
     A                                      OVRDTA
     A            R6             8A  B 12 70DSPATR(PR)
     A                                      OVRDTA
     A            Q7             2A  B 13  4DSPATR(PR)
     A                                      OVRDTA
     A            W7            11A  B 13 10
     A  60                                  DSPATR(UL)
     A  60                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            S7             2A  B 13 24DSPATR(PR)
     A                                      OVRDTA
     A            E7             6A  B 13 30DSPATR(PR)
     A                                      OVRDTA
     A            D7            30A  B 13 38DSPATR(PR)
     A                                      OVRDTA
     A            R7             8A  B 13 70DSPATR(PR)
     A                                      OVRDTA
     A            Q8             2A  B 14  4DSPATR(PR)
     A                                      OVRDTA
     A            W8            11A  B 14 10
     A  77                                  DSPATR(UL)
     A  77                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            S8             2A  B 14 24DSPATR(PR)
     A                                      OVRDTA
     A            E8             6A  B 14 30DSPATR(PR)
     A                                      OVRDTA
     A            D8            30A  B 14 38DSPATR(PR)
     A                                      OVRDTA
     A            R8             8A  B 14 70DSPATR(PR)
     A                                      OVRDTA
     A            Q9             2A  B 15  4DSPATR(PR)
     A                                      OVRDTA
     A            W9            11A  B 15 10
     A  86                                  DSPATR(UL)
     A  86                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            S9             2A  B 15 24DSPATR(PR)
     A                                      OVRDTA
     A            E9             6A  B 15 30DSPATR(PR)
     A                                      OVRDTA
     A            D9            30A  B 15 38DSPATR(PR)
     A                                      OVRDTA
     A            R9             8A  B 15 70DSPATR(PR)
     A                                      OVRDTA
     A            Q0             2A  B 16  4DSPATR(PR)
     A                                      OVRDTA
     A            W0            11A  B 16 10
     A  95                                  DSPATR(UL)
     A  95                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            S0             2A  B 16 24DSPATR(PR)
     A                                      OVRDTA
     A            E0             6A  B 16 30DSPATR(PR)
     A                                      OVRDTA
     A            D0            30A  B 16 38DSPATR(PR)
     A                                      OVRDTA
     A            R0             8A  B 16 70DSPATR(PR)
     A                                      OVRDTA
     A            QA             2A  B 17  4DSPATR(PR)
     A                                      OVRDTA
     A            WA            11A  B 17 10
     A  87                                  DSPATR(UL)
     A  87                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            SA             2A  B 17 24DSPATR(PR)
     A                                      OVRDTA
     A            EA             6A  B 17 30DSPATR(PR)
     A                                      OVRDTA
     A            DA            30A  B 17 38DSPATR(PR)
     A                                      OVRDTA
     A            RA             8A  B 17 70DSPATR(PR)
     A                                      OVRDTA
     A            QB             2A  B 18  4DSPATR(PR)
     A                                      OVRDTA
     A            WB            11A  B 18 10
     A  88                                  DSPATR(UL)
     A  88                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            SB             2A  B 18 24DSPATR(PR)
     A                                      OVRDTA
     A            EB             6A  B 18 30DSPATR(PR)
     A                                      OVRDTA
     A            DB            30A  B 18 38DSPATR(PR)
     A                                      OVRDTA
     A            RB             8A  B 18 70DSPATR(PR)
     A                                      OVRDTA
     A            QC             2A  B 19  4DSPATR(PR)
     A                                      OVRDTA
     A            WC            11A  B 19 10
     A  89                                  DSPATR(UL)
     A  89                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            SC             2A  B 19 24DSPATR(PR)
     A                                      OVRDTA
     A            EC             6A  B 19 30DSPATR(PR)
     A                                      OVRDTA
     A            DC            30A  B 19 38DSPATR(PR)
     A                                      OVRDTA
     A            RC             8A  B 19 70DSPATR(PR)
     A                                      OVRDTA
     A            QD             2A  B 20  4DSPATR(PR)
     A                                      OVRDTA
     A            WD            11A  B 20 10
     A  90                                  DSPATR(UL)
     A  90                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            SD             2A  B 20 24DSPATR(PR)
     A                                      OVRDTA
     A            ED             6A  B 20 30DSPATR(PR)
     A                                      OVRDTA
     A            DD            30A  B 20 38DSPATR(PR)
     A                                      OVRDTA
     A            RD             8A  B 20 70DSPATR(PR)
     A                                      OVRDTA
     A                                 21  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                 22  2'TO DISPLAY A WORKORDER, TYPE ANY C-
     A                                      HARACTER BEFORE THE NUMBER AND PRES-
     A                                      S "ENTER"'
     A                                 23 17'PRESS THE "ENTER" KEY TO VIEW ADDI-
     A                                      TIONAL SCREENS.'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F1=CHANGE SORT F3=EXIT F4=EQUI-
     A                                      P SEARCH F5=CANCEL SEARCH   ENTER F-
     A                                      OR NEXT SCREEN')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VRESERVE
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A                                  2  2':                                 -
     A                                                                         -
     A                                              :'
     A                                  3  2':                                 -
     A                                                                         -
     A                                              :'
     A                                  4  2':                                 -
     A                                                                         -
     A                                              :'
     A                                  5  2':         WORKORDER'
     A            WONUM         10A  B  5 22DSPATR(PR)
     A                                      OVRDTA
     A                                  5 33'IS RESERVED BY CLOCK CARD NUMBER'
     A            CCNO           4A  B  5 66DSPATR(PR)
     A                                      OVRDTA
     A                                  5 79':'
     A                                  6  2':                                 -
     A                                                                         -
     A                                              :'
     A                                  7  2':                                 -
     A                                                                         -
     A                                              :'
     A                                  8  2':                                 -
     A                                                                         -
     A                                              :'
     A                                  9  2':                   IF YOU WISH TO-
     A                                       GO IP ON THE WORKORDER,           -
     A                                              :'
     A                                 10  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 11  2':                TYPE ANY CHARACTE-
     A                                      R AND PRESS THE "ENTER" KEY        -
     A                                              :'
     A                                 12  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 13  2':                IF YOU DO NOT WIS-
     A                                      H TO GO IP ON THE WORKORDER,       -
     A                                              :'
     A                                 14  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 15  2':                     PRESS THE "E-
     A                                      NTER" KEY TO CONTINUE.             -
     A                                              :'
     A                                 16  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 17  2':                 ================-
     A                                      ==========================         -
     A                                              :'
     A                                 18  2':                 :               -
     A                                                               :         -
     A                                              :'
     A                                 19  2':                 :'
     A            C              1A  B 19 40
     A  02                                  DSPATR(UL)
     A  02                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 19 61':                 :'
     A                                 20  2':                 :               -
     A                                                               :         -
     A                                              :'
     A                                 21  2':                 ================-
     A                                      ==========================         -
     A                                              :'
     A                                 22  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 23  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A            COMMANDLIN    79A  O 24  1OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VGETEQP
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A                                  2  2':                                 -
     A                                                                         -
     A                                              :'
     A                                  3  2':                                 -
     A                                                                         -
     A                                              :'
     A                                  4  2':                                 -
     A                                                                         -
     A                                              :'
     A                                  5  2':          ENTER THE EQUIPMENT NUM-
     A                                      BER OR PARTIAL NUMBER TO SEARCH BY:-
     A                                              :'
     A                                  6  2':                                 -
     A                                                                         -
     A                                              :'
     A                                  7  2':                                 -
     A                                                                         -
     A                                              :'
     A                                  8  2':                                E-
     A                                      XAMPLES:                           -
     A                                              :'
     A                                  9  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 10  2': To find the "PM" record for Equi-
     A                                      pment "BB01", enter "BB01" and pres-
     A                                      s ENTER :'
     A                                 11  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 12  2':    To find the "PM" records for -
     A                                      all Banburys, enter "BB" and press -
     A                                      ENTER   :'
     A                                 13  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 14  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 15  2':                     PRESS THE "E-
     A                                      NTER" KEY TO CONTINUE.             -
     A                                              :'
     A                                 16  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 17  2':                 ================-
     A                                      ==========================         -
     A                                              :'
     A                                 18  2':                 :               -
     A                                                               :         -
     A                                              :'
     A                                 19  2':                 :'
     A            EQPNUM         6A  B 19 37
     A  02                                  DSPATR(UL)
     A  02                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 19 61':                 :'
     A                                 20  2':                 :               -
     A                                                               :         -
     A                                              :'
     A                                 21  2':                 ================-
     A                                      ==========================         -
     A                                              :'
     A                                 22  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 23  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A            COMMANDLIN    79A  O 24  1OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VSELECT
     A*%%TS  DD  19931123  135739  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  3  8'==================================-
     A                                      ============================='
     A                                  4  8':  O P E N / A C T I V E   V E R B-
     A                                       A L   W O R K O R D E R S  :'
     A                                  5  8'==================================-
     A                                      ============================='
     A                                 10 33'ZONE:'
     A            ZONE           4A  B 10 43DSPATR(UL)
     A  02                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 12 32'CRAFT:'
     A            CR             2A  B 12 43DSPATR(UL)
     A  03                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 14 21'EQUIPMENT NUMBER:'
     A            EQPNUM         6A  B 14 43DSPATR(UL)
     A  08                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 21 22'Enter Data and Press "ENTER" Key'
     A                                 23  1'F3=RETURN TO MENU'
     A            COMMANDLIN    79A  O 24  1OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
