     A                                      DSPSIZ(24 80 *DS3)
     A                                      INDARA
     A                                      PRINT
     A                                      CHGINPDFT
     A          R VCFTREQM
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  6'-----------------------------------
     A                                      ------------------------------------
     A                                      --'
     A                                  3  6':    C R A F T S M A N '' S  /  R'
     A                                  3 39'E Q U I S I T I O N S   M E N U'
     A                                  3 76':'
     A                                  4  6'-----------------------------------
     A                                      ------------------------------------
     A                                      --'
     A                                  6 14'PRESS:'
     A                                  7 22'f1  -  CRAFTSMAN''S FUNCTIONS MENU'
     A                                  9 22'f2  -    *** No Function ***'
     A                                 11 22'f3  -  EXIT - RETURN TO PRODUCTION'
     A                                 13 22'f4  -  NON-MMIS NON-STOREROOM REQU-
     A                                      ISITIONS'
     A                                 15 22'f5  -  REQUISITION APPROVAL'
     A                                 17 22'f6  -  REQUISITION INQUIRY'
     A                                 19 22'f7  -  REQUISITION REPORT'
     A                                 21 22'f8  -    *** No Function ***'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3 - RETURN TO PRODUCTION C-
     A                                      ONTROL')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
