     A*%%TS  SD  20040817  091713  A257947     REL-V5R2M0  5722-WDS
     A*  89/04/17  11:45:48    T881S26     REL-R01M02  5728-PW1
     A*            17:10:51    T881S28     VCHGBLK.HPTO38.CME
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A          R CHGBLKT
     A*  89/04/17  11:45:48    T881S26     REL-R01M02  5728-PW1
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      INZRCD
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1 18'C O P Y    R E Q U I R E M E N T'
     A                                  1 54'O R D E R S'
     A                                  5  6'OLD REQUIREMENT ORDER'
     A                                  7 59'MMDDYY'
     A                                  8  6'NEW REQUIREMENT ORDER'
     A                                  8 42'EXPIRATION DATE'
     A                                 10  9'SORT NEW REQUIREMENT ORDER BY CORP-
     A                                      ORATE CODE ENTER "X"  '
     A                                 13  2'1) ENTER THE REQUIREMENT ORDER YOU'
     A                                 13 37'WISH TO USE TO CREATE THE NEW REQU-
     A                                      IREMENT'
     A                                 14  5'ORDER'
     A                                 15  2'2) ENTER THE NEW REQUIREMENT NUMBE-
     A                                      R AND THE EXPIRATION DATE OF THE OR-
     A                                      DER'
     A                                 16  2'3) PRESS "ENTER" TO PROCESS OR "f3-
     A                                      " TO EXIT'
     A                                 19  7'NOTE: THE OLD REQUIREMENT ORDER IS'
     A                                 19 42'NOT DELETED WHEN THE NEW ORDER'
     A                                 20 13'IS CREATED'
     A            OLDPONO        7A  B  5 29DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            NEWPONO        7A  B  8 29DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            EXPDAT         6A  B  8 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            X              1A  B 10 66DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            COMMANDLN1    79A  B 24  1DFTVAL(' ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A*  89/04/17  11:45:48    T881S26     REL-R01M02  5728-PW1
     A          R CPYPO
     A*%%TS  SD  20040817  091713  A257947     REL-V5R2M0  5722-WDS
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      INZRCD
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  2 22'C O P Y   P U R C H A S E   O R D -
     A                                      E R'
     A                                  5  7'COPY FROM PURCHASE ORDER:'
     A            OLDPONO        7A  B  5 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                  7 64'MMDDYY'
     A                                  8  7'COPY TO NEW PURCHASE ORDER:'
     A            NEWPONO        7A  B  8 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                  8 50'EXPECT DATE:'
     A            EXPDAT         6A  B  8 64DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                 13  3'1) ENTER THE PURCHASE ORDER NUMBER-
     A                                       TO COPY FROM'
     A                                 14  3'2) ENTER THE NEW PURCHASE ORDER NU-
     A                                      MBER AND THE EXPECT DATE OF THE ORD-
     A                                      ER'
     A                                 15  3'3) PRESS "ENTER" TO PROCESS OR "F3-
     A                                      " TO EXIT'
     A                                 19  7'NOTE: THE COPY FROM PURCHASE ORDER-
     A                                       IS NOT DELETED WHEN THE NEW ORDER'
     A                                 20 13'IS CREATED'
     A            COMMANDLN1    79A  B 24  1DFTVAL(' ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
