     A*%%TS  SD  19931101  141640  T881S03     REL-V2R2M0  5738-PW1
     A*  89/03/15  19:07:37    T881S03     REL-R01M02  5728-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A                                      CA03(03 'END PROGRAM')
     A          R FCHGPWOS
     A                                      PUTOVR
     A  98                                  INVITE
     A                                  3 15'THIS PROGRAM WILL MOVE PLANNED "CW-
     A                                      " WORK ORDERS TO "DW" '
     A                                  4 20'BASED ON THE SEARCH CRITERIA ENTER-
     A                                      ED BELOW'
     A                                  6 23'SEARCH RESTRICTIONS FOR "CW" W/O"S-
     A                                      :'
     A                                  8 38'ZONE'
     A            ZONENO         4A  B  8 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                  9 30'EQUIP NUMBER'
     A            EQPNUM         6A  B  9 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                 10 26'YEAR DESIGNATION'
     A            ALPHAY         1A  B 10 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                 22 25'PRESS "F3" TO EXIT PROGRAM'
     A            COMMANDLN     79A  O 24  1OVRDTA
     A  99        MESSAGELN     79   M      OVRDTA
     A          R FCHGPWO2
     A                                      PUTOVR
     A  98                                  INVITE
     A                                  8 13'THERE ARE '
     A                                  8 31'WORK ORDERS THAT ARE MOVEABLE  '
     A            WOCTR          6A  B  8 24DSPATR(PR)
     A                                      OVRDTA
     A                                  9 13'CONTINUE WITH THE MOVES - Y/N?'
     A            DELSW          1A  B  9 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                 13  5'If you want to view a list of the -
     A                                      work orders that will be moved prio-
     A                                      r '
     A                                 14  5'to the actual move, press the F3 k-
     A                                      ey now and the listing should print'
     A                                 15  5'If you want the moves to process, -
     A                                       change the continue flag to a "Y"'
     A                                 16  5'and press enter.'
     A                                 19 25'PRESS "F3" TO EXIT PROGRAM'
     A            COMMANDLN     79A  O 24  1OVRDTA
     A  99        MESSAGELN     79   M      OVRDTA
