     A*%%TS  SD  19931101  141640  T881S03     REL-V2R2M0  5738-PW1
     A*  89/03/15  19:07:37    T881S03     REL-R01M02  5728-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A                                      CA03(03 'END PROGRAM')
     A          R FCNOTICE
     A                                      PUTOVR
     A  98                                  INVITE
     A                                  1 37'STORES'
     A                                  2 27'REQUEST FOR CHANGE NOTICE'
     A                                  3 27'-------------------------'
     A                                  4  2'DATE'
     A            DATE           8A  B  4  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                  4 24'----REASON (USE X OR TYPE IN OTHER-
     A                                      )----'
     A                                  6  2'REQ #'
     A            REQNUM        12A  B  6  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                  6 24'CHANGE PRICE'
     A            CPRICE         4A  B  6 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                  6 44'CHANGE QTY'
     A            CQTY           4A  B  6 55DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                  6 62'ADD TO ORDER'
     A            ADDTOO         4A  B  6 75DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                  8  2'PO # '
     A            PONUM         12A  B  8  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A                                  8 24'CANCEL ITEM'
     A            CANITM         4A  B  8 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A                                  8 44'CANCEL PO#'
     A            CANPO          4A  B  8 55DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A                                  8 62'NEW ITEM '
     A            NEWITM         4A  B  8 75DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A                                 10  2'BUYER'
     A            BUYNUM        12A  B 10  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A                                 10 24'OBSOLETE IT'
     A            OBSITM         4A  B 10 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                 10 44'SCRAP'
     A            SCRAP          4A  B 10 55DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A                                 10 62'ERROR'
     A            ERROR          4A  B 10 75DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A                                 10 12'OTHER:'
     A            OTHERI        40A  B 10 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A                                 13 18'((((((((((   VENDOR INFORMATION   -
     A                                      ))))))))))'
     A            VENNAM        44A  B 14 18DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            VENNA2        44A  B 15 18DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            VENNA3        44A  B 16 18DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A                                 23  2'PRESS "ENTER" TO ACCEPT ALL INPUT -
     A                                      OR "F3" TO CANCEL CHANGE NOTICE'
     A            COMMANDLN     79A  O 24  1OVRDTA
     A  99        MESSAGELN     79   M      OVRDTA
     A          R FCNOTIC2
     A                                      PUTOVR
     A  98                                  INVITE
     A*                                 1 18'                DESCRIPTION       -
     A*                                             PRICE'
     A*                                 2 10'-----------------------------------
     A*                                     -------------------------'
     A                                  1 27'----ORDER NOW READS----'
     A                                  2 10'ITM#   QUANTITY   STORES CODE OR O-
     A                                      THER DESCRIPTION     '
     A            ITM1           4A  B  3 10DSPATR(PR)
     A                                      OVRDTA
     A            QTY1           8A  B  3 17DSPATR(PR)
     A                                      OVRDTA
     A            CODE1         30A  B  3 28DSPATR(PR)
     A                                      OVRDTA
     A            PRICE1        10A  B  3 60DSPATR(PR)
     A                                      OVRDTA
     A            ITM2           4A  B  4 10DSPATR(PR)
     A                                      OVRDTA
     A            QTY2           8A  B  4 17DSPATR(PR)
     A                                      OVRDTA
     A            CODE2         30A  B  4 28DSPATR(PR)
     A                                      OVRDTA
     A            PRICE2        10A  B  4 60DSPATR(PR)
     A                                      OVRDTA
     A            ITM3           4A  B  5 10DSPATR(PR)
     A                                      OVRDTA
     A            QTY3           8A  B  5 17DSPATR(PR)
     A                                      OVRDTA
     A            CODE3         30A  B  5 28DSPATR(PR)
     A                                      OVRDTA
     A            PRICE3        10A  B  5 60DSPATR(PR)
     A                                      OVRDTA
     A            ITM4           4A  B  6 10DSPATR(PR)
     A                                      OVRDTA
     A            QTY4           8A  B  6 17DSPATR(PR)
     A                                      OVRDTA
     A            CODE4         30A  B  6 28DSPATR(PR)
     A                                      OVRDTA
     A            PRICE4        10A  B  6 60DSPATR(PR)
     A                                      OVRDTA
     A            ITM5           4A  B  7 10DSPATR(PR)
     A                                      OVRDTA
     A            QTY5           8A  B  7 17DSPATR(PR)
     A                                      OVRDTA
     A            CODE5         30A  B  7 28DSPATR(PR)
     A                                      OVRDTA
     A            PRICE5        10A  B  7 60DSPATR(PR)
     A                                      OVRDTA
     A            ITM6           4A  B  8 10DSPATR(PR)
     A                                      OVRDTA
     A            QTY6           8A  B  8 17DSPATR(PR)
     A                                      OVRDTA
     A            CODE6         30A  B  8 28DSPATR(PR)
     A                                      OVRDTA
     A            PRICE6        10A  B  8 60DSPATR(PR)
     A                                      OVRDTA
     A            ITM7           4A  B  9 10DSPATR(PR)
     A                                      OVRDTA
     A            QTY7           8A  B  9 17DSPATR(PR)
     A                                      OVRDTA
     A            CODE7         30A  B  9 28DSPATR(PR)
     A                                      OVRDTA
     A            PRICE7        10A  B  9 60DSPATR(PR)
     A                                      OVRDTA
     A            ITM8           4A  B 10 10DSPATR(PR)
     A                                      OVRDTA
     A            QTY8           8A  B 10 17DSPATR(PR)
     A                                      OVRDTA
     A            CODE8         30A  B 10 28DSPATR(PR)
     A                                      OVRDTA
     A            PRICE8        10A  B 10 60DSPATR(PR)
     A                                      OVRDTA
     A                                 12 27'----CHANGE TO READ----'
     A                                 13 10'ITM#   QUANTITY   STORES CODE OR O-
     A                                      THER DESCRIPTION     '
     A            CITM1          4Y 0B 14 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CQTY1          8Y 0B 14 17EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CCOD1         30A  B 14 28DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            CPRI1         10Y 0B 14 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CITM2          4Y 0B 15 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CQTY2          8Y 0B 15 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CCOD2         30A  B 15 28DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            CPRI2         10Y 0B 15 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CITM3          4Y 0B 16 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CQTY3          8Y 0B 16 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CCOD3         30A  B 16 28DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A            CPRI3         10Y 0B 16 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CITM4          4Y 0B 17 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CQTY4          8Y 0B 17 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CCOD4         30A  B 17 28DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A            CPRI4         10Y 0B 17 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CITM5          4Y 0B 18 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CQTY5          8Y 0B 18 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CCOD5         30A  B 18 28DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A            CPRI5         10Y 0B 18 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CITM6          4Y 0B 19 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  54                                  DSPATR(RI)
     A  54                                  DSPATR(PC)
     A            CQTY6          8Y 0B 19 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  55                                  DSPATR(RI)
     A  55                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CCOD6         30A  B 19 28DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  56                                  DSPATR(RI)
     A  56                                  DSPATR(PC)
     A            CPRI6         10Y 0B 19 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  57                                  DSPATR(RI)
     A  57                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CITM7          4Y 0B 20 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  58                                  DSPATR(RI)
     A  58                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CQTY7          8Y 0B 20 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  59                                  DSPATR(RI)
     A  59                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CCOD7         30A  B 20 28DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A            CPRI7         10Y 0B 20 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A                                 23  2'PRESS "ENTER" TO ACCEPT ALL INPUT -
     A                                      OR "F3" TO CANCEL CHANGE NOTICE'
     A            CITM8          4Y 0B 21 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CQTY8          8Y 0B 21 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CCOD8         30A  B 21 28DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A            CPRI8         10Y 0B 21 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A                                 23  2'PRESS "ENTER" TO ACCEPT ALL INPUT -
     A                                      OR "F3" TO CANCEL CHANGE NOTICE'
     A            COMMANDLN     79A  O 24  1OVRDTA
     A  99        MESSAGELN     79   M      OVRDTA
     A          R FCNOTIC2A
     A                                      PUTOVR
     A  98                                  INVITE
     A*                                 1 18'                DESCRIPTION       -
     A*                                             PRICE'
     A*                                 2 10'-----------------------------------
     A*                                     -------------------------'
     A                                  1 27'----ORDER NOW READS----'
     A                                  2 10'ITM#   QUANTITY   STORES CODE OR O-
     A                                      THER DESCRIPTION     '
     A            ITM1           4A  B  3 10DSPATR(PR)
     A                                      OVRDTA
     A            QTY1           8A  B  3 17DSPATR(PR)
     A                                      OVRDTA
     A            CODE1         30A  B  3 28DSPATR(PR)
     A                                      OVRDTA
     A            PRICE1        10A  B  3 60DSPATR(PR)
     A                                      OVRDTA
     A            ITM2           4A  B  4 10DSPATR(PR)
     A                                      OVRDTA
     A            QTY2           8A  B  4 17DSPATR(PR)
     A                                      OVRDTA
     A            CODE2         30A  B  4 28DSPATR(PR)
     A                                      OVRDTA
     A            PRICE2        10A  B  4 60DSPATR(PR)
     A                                      OVRDTA
     A            ITM3           4A  B  5 10DSPATR(PR)
     A                                      OVRDTA
     A            QTY3           8A  B  5 17DSPATR(PR)
     A                                      OVRDTA
     A            CODE3         30A  B  5 28DSPATR(PR)
     A                                      OVRDTA
     A            PRICE3        10A  B  5 60DSPATR(PR)
     A                                      OVRDTA
     A            ITM4           4A  B  6 10DSPATR(PR)
     A                                      OVRDTA
     A            QTY4           8A  B  6 17DSPATR(PR)
     A                                      OVRDTA
     A            CODE4         30A  B  6 28DSPATR(PR)
     A                                      OVRDTA
     A            PRICE4        10A  B  6 60DSPATR(PR)
     A                                      OVRDTA
     A            ITM5           4A  B  7 10DSPATR(PR)
     A                                      OVRDTA
     A            QTY5           8A  B  7 17DSPATR(PR)
     A                                      OVRDTA
     A            CODE5         30A  B  7 28DSPATR(PR)
     A                                      OVRDTA
     A            PRICE5        10A  B  7 60DSPATR(PR)
     A                                      OVRDTA
     A            ITM6           4A  B  8 10DSPATR(PR)
     A                                      OVRDTA
     A            QTY6           8A  B  8 17DSPATR(PR)
     A                                      OVRDTA
     A            CODE6         30A  B  8 28DSPATR(PR)
     A                                      OVRDTA
     A            PRICE6        10A  B  8 60DSPATR(PR)
     A                                      OVRDTA
     A            ITM7           4A  B  9 10DSPATR(PR)
     A                                      OVRDTA
     A            QTY7           8A  B  9 17DSPATR(PR)
     A                                      OVRDTA
     A            CODE7         30A  B  9 28DSPATR(PR)
     A                                      OVRDTA
     A            PRICE7        10A  B  9 60DSPATR(PR)
     A                                      OVRDTA
     A            ITM8           4A  B 10 10DSPATR(PR)
     A                                      OVRDTA
     A            QTY8           8A  B 10 17DSPATR(PR)
     A                                      OVRDTA
     A            CODE8         30A  B 10 28DSPATR(PR)
     A                                      OVRDTA
     A            PRICE8        10A  B 10 60DSPATR(PR)
     A                                      OVRDTA
     A                                 12 27'----CHANGE TO READ----'
     A                                 13 10'ITM#   QUANTITY   STORES CODE OR O-
     A                                      THER DESCRIPTION     '
     A            CITM1          4Y 0B 14 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CQTY1          8Y 0B 14 17EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CCOD1         30A  B 14 28DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            CPRI1         10A  B 14 60DSPATR(PR)
     A                                      OVRDTA
     A            CITM2          4Y 0B 15 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CQTY2          8Y 0B 15 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CCOD2         30A  B 15 28DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            CPRI2         10A  B 15 60DSPATR(PR)
     A                                      OVRDTA
     A            CITM3          4Y 0B 16 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CQTY3          8Y 0B 16 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CCOD3         30A  B 16 28DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A            CPRI3         10A  B 16 60DSPATR(PR)
     A                                      OVRDTA
     A            CITM4          4Y 0B 17 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CQTY4          8Y 0B 17 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CCOD4         30A  B 17 28DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A            CPRI4         10A  B 17 60DSPATR(PR)
     A                                      OVRDTA
     A            CITM5          4Y 0B 18 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CQTY5          8Y 0B 18 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CCOD5         30A  B 18 28DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A            CPRI5         10A  B 18 60DSPATR(PR)
     A                                      OVRDTA
     A            CITM6          4Y 0B 19 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  54                                  DSPATR(RI)
     A  54                                  DSPATR(PC)
     A            CQTY6          8Y 0B 19 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  55                                  DSPATR(RI)
     A  55                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CCOD6         30A  B 19 28DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  56                                  DSPATR(RI)
     A  56                                  DSPATR(PC)
     A            CPRI6         10A  B 19 60DSPATR(PR)
     A                                      OVRDTA
     A            CITM7          4Y 0B 20 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  58                                  DSPATR(RI)
     A  58                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CQTY7          8Y 0B 20 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  59                                  DSPATR(RI)
     A  59                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CCOD7         30A  B 20 28DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A            CPRI7         10A  B 20 60DSPATR(PR)
     A                                      OVRDTA
     A                                 23  2'PRESS "ENTER" TO ACCEPT ALL INPUT -
     A                                      OR "F3" TO CANCEL CHANGE NOTICE'
     A            CITM8          4Y 0B 21 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CQTY8          8Y 0B 21 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CCOD8         30A  B 21 28DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A            CPRI8         10A  B 21 60DSPATR(PR)
     A                                      OVRDTA
     A                                 23  2'PRESS "ENTER" TO ACCEPT ALL INPUT -
     A                                      OR "F3" TO CANCEL CHANGE NOTICE'
     A            COMMANDLN     79A  O 24  1OVRDTA
     A  99        MESSAGELN     79   M      OVRDTA
     A          R FCNOTIC3
     A                                      PUTOVR
     A  98                                  INVITE
     A                                  1 10'REMARKS:'
     A            REM1          20A  B  1 20DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                  1 42'ESTIMATED PRICE:  INCREASE $'
     A            DOLINC        10Y 0B  1 71DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            REM2          30A  B  2 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            REM3          30A  B  3 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                  5 10'RECORDS ONLY'
     A            RECONL         2A  B  5 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                  5 26'CPY TO VENDOR'
     A            CPYVEN         2A  B  5 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A                                  5 60'DECREASE $'
     A            DOLDEC        10Y 0B  5 71DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A                                  7 40'AUTHORITY'
     A            AUTHOR        20A  B  7 50DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A                                  7 71'DEPT'
     A            ADEPT          4A  B  7 76DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A                                 23  2'PRESS "ENTER" TO ACCEPT ALL INPUT -
     A                                      OR "F3" TO CANCEL CHANGE NOTICE'
     A            COMMANDLN     79A  O 24  1OVRDTA
     A  99        MESSAGELN     79   M      OVRDTA
     A          R FCNPURNO
     A                                      PUTOVR
     A                                  6 21'INPUT THE PURCHASE ORDER THAT YOU -
     A                                      WOULD'
     A                                  7 26'LIKE TO DO A CHANGE NOTICE ON'
     A                                 11 21'INPUT THE ITEM NUMBERS THAT REQUIR-
     A                                      E CHANGES'
     A            PURCNO         7A  B  9 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            REL            3A  B  9 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            ITCN1          4Y 0B 12 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            ITCN2          4Y 0B 12 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            ITCN3          4Y 0B 13 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            ITCN4          4Y 0B 13 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            ITCN5          4Y 0B 14 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            ITCN6          4Y 0B 14 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            ITCN7          4Y 0B 15 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            ITCN8          4Y 0B 15 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A                                 23 30'PRESS "F3" TO EXIT'
     A            COMMANDLN     79A  O 24  1OVRDTA
     A  99        MESSAGELN     79   M      OVRDTA
     A          R FCUSERMN
     A                                      CF04
     A                                      CF06
     A                                      CF07
     A                                      PUTOVR
     A  98                                  INVITE
     A            FUNCTION      23A  B  2 29DSPATR(PR)
     A                                      OVRDTA
     A                                  7 18'USER ID        :'
     A            USER          10A  B  7 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                  9 18'VIEW PRICE INFO:'
     A            Q              1A  B  9 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A            INFO          74A  B 22  4DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A          R OPTION
     A                                      PUTOVR
     A                                  2 12'ADD, CHANGE OR DELETE USER ID"S TH-
     A                                      AT DO CHANGE NOTICES'
     A                                  4  4'Option:'
     A            OPTION         1A  B  4 13DSPATR(UL)
     A                                      VALUES('A' 'C' 'D' ' ')
     A                                  7 11'Enter one of the following options-
     A                                      :'
     A                                  9 16'A --> To ADD a USERID for entering-
     A                                       change notices'
     A                                 12 16'C --> To CHANGE a USERID that does-
     A                                       change notices'
     A                                 15 16'D --> To DELETE a USERID that does-
     A                                       change notices'
     A            INFO          74A  B 22  4DSPATR(PR)
     A                                      OVRDTA
     A                                 24  4'F3-EXIT'
     A  99        MESSAGELIN    79   M      OVRDTA
