     A*  90/02/13  16:33:32    T881S28     REL-R01M02  5728-PW1
     A*            16:44:32    T881S28     VCOBAPND.HPTO38.CME
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A          R FCOBAPND
     A*  89/12/04  15:50:08    T881S28     REL-R01M02  5728-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  4  1'DATA SET NAME'
     A                                  6  1'CALL TYPE'
     A                                  6 33'DBGET2, DBGET7, DBFIND, DBPUT, DBU-
     A                                      PDATE,'
     A                                  7 33'DBDELETE'
     A                                  9  1'ACCESS MODE'
     A                                  9 33'"I" FOR INPUT, "O" FOR I-O'
     A                                 11  1'SEARCH ITEM'
     A                                 13  1'Use'
     A                                 13  5'screens?'
     A                                 15  1'DATABASE'
     A                                 17  1'BLOWUPS?'
     A            DSETNAME      16A  B  4 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            CALLTYPE       8A  B  6 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            ACCMD          1A  B  9 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            SEARCHITEM    16A  B 11 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            USESCREENS     1A  B 13 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            DBASEKEY       2A  B 15 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            BLOWUPFLAG     1A  B 17 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL(' ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A                                 19  7'Note: DBFIND will automatically ad-
     A                                      d the call to DBGET5'
