     A*            17:12:53    T881S28     VCOMPPO.HPTO38.CME
     A                                      DSPSIZ(24 80 *DS3)
     A                                      INDARA
     A                                      PRINT
     A                                      CHGINPDFT
     A          R COMPPO1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 14'-----------------------------------
     A                                      ---------------------'
     A                                  2 14':  P U R C H A S E   O R D E R   C'
     A                                  2 49'O M P L E T I O N  :'
     A                                  3 14'-----------------------------------
     A                                      ---------------------'
     A                                  6  9'ENTER PURCHASE ORDER'
     A                                 12  5'ENTER PURCHASE ORDER NUMBER AND PR-
     A                                      ESS "ENTER" TO CANCEL REMAINING'
     A                                 13  5'ONORDER FOR ALL ITEMS.  NOTE THE P-
     A                                      URCHASE ORDER IS NOT DELETED.'
     A                                 14  5'PRESS "f3" TO EXIT.'
     A            CCC            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B  6 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            REL            3Y 0B  6 38DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
