     A*            17:26:08    T881S28     VCOROPEN.HPTO38.CME
     A                                      DSPSIZ(24 80 *DS3)
     A                                      INDARA
     A                                      PRINT
     A                                      CHGINPDFT
     A          R COROPEN1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 22'CORPORATE STORES ACCOUNTING SYSTEM'
     A                                  1 73'SA10-1'
     A                                  2 28'CORRECT OPEN RECEIVERS'
     A                                  4  9'ENTER MATERIAL CODE OR PO INFORMAT-
     A                                      ION TO SELECT OPEN RECEIVERS'
     A                                  6 12'-----------------------------------
     A                                      --------------------'
     A                                  7 12':'
     A                                  7 65':'
     A                                  8 12':      MATERIAL CODE'
     A                                  8 65':'
     A                                  9 12':'
     A                                  9 65':'
     A                                 10 12'-----------------------------------
     A                                      --------------------'
     A                                 12 34'- O R -'
     A                                 14 12'-----------------------------------
     A                                      --------------------'
     A                                 15 12':'
     A                                 15 65':'
     A                                 16 12':      PURCHASE ORDER NUMBER   '
     A                                 16 65':'
     A                                 17 12':      ITEM NUMBER'
     A                                 17 65':'
     A                                 18 12':      RECEIVER'
     A                                 18 50'(OPTIONAL)     :'
     A                                 19 12':'
     A                                 19 65':'
     A                                 20 12'-----------------------------------
     A                                      --------------------'
     A                                 22  1'PRESS "F3" TO END PROGRAM'
     A            CODE           7A  B  8 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            ORDERNO        7A  B 16 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            REL            3Y 0B 16 55DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            ITEM           4Y 0B 17 44DSPATR(UL)
     A                                      CHECK(RZ)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            RCV            3Y 0B 18 44DSPATR(UL)
     A                                      CHECK(RZ)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-END PROGRAM             -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R COROPEN2
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 23'CORPORATE STORES ACCOUNTING SYSTEM'
     A                                  1 74'SA10-2'
     A                                  2 29'CORRECT OPEN RECEIVERS'
     A                                  4  1'MATERIAL CODE'
     A                                  5  1'PURCHASE ORDER'
     A                                  5 37'TOTAL VALUE OF RECEIPT'
     A                                  6  1'RECEIVING SLIP'
     A                                  7  1'ITEM NUMBER'
     A                                  7 37'OPEN RECEIVER QUANTITY'
     A                                  8  1'TRANSACTION CODE'
     A                                  9  1'TRANSACTION DATE'
     A                                 10  1'RECEIPT QUANTITY'
     A                                 10 36'NOTES: 1) YOU CAN ONLY REDUCE OPEN'
     A                                 10 71'RECEIVER'
     A                                 11  1'UNIT OF MEASURE'
     A                                 11 46'QUANTITY'
     A                                 12  1'CLASS'
     A                                 12 43'2) REDUCING OPEN RECEIVER QUANTITY'
     A                                 12 78'ON'
     A                                 13  1'DEPARTMENT'
     A                                 13 46'A "REC" TRANSACTION INCREASES'
     A                                 14  1'ACCOUNT'
     A                                 14 46'INVOICE UNITS AND DOLLARS FOR THE'
     A                                 15 46'MATERIAL CODE'
     A                                 16 43'3) CHANGING THE TOTAL VALUE ON A "-
     A                                      REC"'
     A                                 17 46'TRANSACTION ALSO CHANGES THE OPEN'
     A                                 18 46'RECEIVER DOLLARS FOR THE MATERIAL'
     A                                 19 46'MASTER'
     A                                 20 43'4) CAN ONLY MODIFY CLASS ON A "DCH-
     A                                      G"'
     A                                 21  1'PRESS "F7" TO RETURN TO MAIN MENU'
     A                                 21 46'TRANSACTION'
     A                                 22  1'PRESS "F3" TO END PROGRAM'
     A            CODE           7A  B  4 19DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B  5 19DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  5 27DSPATR(PR)
     A                                      OVRDTA
     A            VALUE         14Y02B  5 61EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            RCV            3A  B  6 19DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4A  B  7 19DSPATR(PR)
     A                                      OVRDTA
     A            OPENQTY       10Y 0B  7 61DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            TC             4A  B  8 19DSPATR(PR)
     A                                      OVRDTA
     A            TCDATE         8A  B  9 19DSPATR(PR)
     A                                      OVRDTA
     A            QTY           10A  B 10 19DSPATR(PR)
     A                                      OVRDTA
     A            UM             2A  B 11 19DSPATR(PR)
     A                                      OVRDTA
     A            CLS            3A  B 12 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            DEPT           4A  B 13 19DSPATR(PR)
     A                                      OVRDTA
     A            ACCT           6A  B 14 19DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f7-PREVIOUS SCREEN f3-END P-
     A                                      ROGRAM                             -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
