     A*****************************************************************
     A**                D I S P L A Y   F I L E
     A*****************************************************************
     A** FILE NAME  :  ZCORLESS
     A**
     A** DESCRIPTION:  DISPLAY FILE FOR WORKORDER PROCESSING
     A**
     A** AUTHOR     :  DAN RAUCH - EXLTECH, LLC
     A** CREATED    :  APR 20, 2005
     A**
      *****************************************************************
      **          M O D I F I C A T I O N    H I S T O R Y
      *****************************************************************
DCR01 *  APR 18, 2005  DCR01  DAN RAUCH       REQUEST# 2005-78291
DCR01 *  ADDED VERBAGE BOTTOM OF FMT INITWO FOR CRAFT & EQUIP SEL CALLS
DCR01 * ---------------------------------------------------------------
      *****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      INDARA
     A                                      INVITE
     A                                      PRINT
     A                                      CHGINPDFT
     A          R CWONUM
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  8 23'ENTER WORK ORDER TO BE DISPLAYED'
     A                                 15 28'AND PRESS "ENTER" KEY'
     A            WO            10A  B 11 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN TO MENU f3-EXIT P-
     A                                      ROGRAM                             -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FDISPJOB
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 26'W O R K   O R D E R'
     A                                  1 56'DATE'
     A                                  2 21'J O B P L A N   D I S P L A Y'
     A                                  4  1'W/O NUM'
     A                                  4 26'W/O DESC'
     A                                  4 69'STATUS'
     A                                  6  8'MACH    DEPT  EXP CLASS ZONE/SHOP'
     A                                  6 42'PRTY    RIME    TIME SCHED'
     A                                  8 76'CLOCK'
     A                                  9 59'MACH    LABOR     EST'
     A                                 10  1'SEQ     DESCRIPTION'
     A                                 10 60'DT    CRF MEN    HRS'
     A            CURRDATE       8A  B  1 61DSPATR(PR)
     A                                      OVRDTA
     A            TIME           5A  B  1 71DSPATR(PR)
     A                                      OVRDTA
     A            WONUMB7        7A  B  4  9DSPATR(PR)
     A                                      OVRDTA
     A            WOR            3A  B  4 17DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIO    30A  B  4 35DSPATR(PR)
     A                                      OVRDTA
     A            ST             2A  B  4 76DSPATR(PR)
     A                                      OVRDTA
     A            EQPNUM         6A  B  7  7DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  7 16DSPATR(PR)
     A                                      OVRDTA
     A            EXPCLASS       8A  B  7 23DSPATR(PR)
     A                                      OVRDTA
     A            ZONE           4A  B  7 34DSPATR(PR)
     A                                      OVRDTA
     A            P              1A  B  7 43DSPATR(PR)
     A                                      OVRDTA
     A            RI             2A  B  7 51DSPATR(PR)
     A                                      OVRDTA
     A            MS             2A  B  7 56DSPATR(PR)
     A                                      OVRDTA
     A            DS             2A  B  7 59DSPATR(PR)
     A                                      OVRDTA
     A            YS             2A  B  7 62DSPATR(PR)
     A                                      OVRDTA
     A            HS             2A  B  7 66DSPATR(PR)
     A                                      OVRDTA
     A            SS             2A  B  7 69DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE1     79A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE2     79A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE3     79A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE4     79A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE5     79A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE6     79A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE7     79A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE8     79A  B 18  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE9     79A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINEA     79A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINEB     79A  B 21  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINEC     79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN TO MENU f2-CHANGE-
     A                                       WO NUM f8-DISPLAY WO f4-DISP NON P-
     A                                      URC MTL f5-DISPLA')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FDISPLAB
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 25'W O R K   O R D E R'
     A                                  1 60'DATE'
     A                                  2 22'L A B O R   D I S P L A Y'
     A                                  3  1'W/O NUM'
     A                                  5  1'CR REQ:'
     A                                  6  1'MEN E :'
     A                                  7  1'MEN A :'
     A                                  8  1'HRS E '
     A                                  9  1'HRS A '
     A                                 10 52'TOTAL COST'
     A                                 11  2'ITM  NAME'
     A                                 11 24'CRFT SFT STDATE  STTM  CODATE  COT-
     A                                      M    HRS'
     A                                 11 76'COST'
     A            CURRDATE       8A  B  1 65DSPATR(PR)
     A                                      OVRDTA
     A            TIME           5A  B  1 75DSPATR(PR)
     A                                      OVRDTA
     A            WO7            7A  B  3  9DSPATR(PR)
     A                                      OVRDTA
     A            WOL            3A  B  3 17DSPATR(PR)
     A                                      OVRDTA
     A            CA             2A  B  5 12DSPATR(PR)
     A                                      OVRDTA
     A            CB             2A  B  5 18DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  69                                  DSPATR(RI PC)
     A            C1             2A  B  5 24DSPATR(PR)
     A                                      OVRDTA
     A            C2             2A  B  5 30DSPATR(PR)
     A                                      OVRDTA
     A            C3             2A  B  5 36DSPATR(PR)
     A                                      OVRDTA
     A            C4             2A  B  5 42DSPATR(PR)
     A                                      OVRDTA
     A            C5             2A  B  5 48DSPATR(PR)
     A                                      OVRDTA
     A            C6             2A  B  5 54DSPATR(PR)
     A                                      OVRDTA
     A            C7             2A  B  5 60DSPATR(PR)
     A                                      OVRDTA
     A            C8             2A  B  5 66DSPATR(PR)
     A                                      OVRDTA
     A            C9             2A  B  5 72DSPATR(PR)
     A                                      OVRDTA
     A            C0             2A  B  5 78DSPATR(PR)
     A                                      OVRDTA
     A            EA             2A  B  6 12DSPATR(PR)
     A                                      OVRDTA
     A            EB             2A  B  6 18DSPATR(PR)
     A                                      OVRDTA
     A            E1             2A  B  6 24DSPATR(PR)
     A                                      OVRDTA
     A            E2             2A  B  6 30DSPATR(PR)
     A                                      OVRDTA
     A            E3             2A  B  6 36DSPATR(PR)
     A                                      OVRDTA
     A            E4             2A  B  6 42DSPATR(PR)
     A                                      OVRDTA
     A            E5             2A  B  6 48DSPATR(PR)
     A                                      OVRDTA
     A            E6             2A  B  6 54DSPATR(PR)
     A                                      OVRDTA
     A            E7             2A  B  6 60DSPATR(PR)
     A                                      OVRDTA
     A            E8             2A  B  6 66DSPATR(PR)
     A                                      OVRDTA
     A            E9             2A  B  6 72DSPATR(PR)
     A                                      OVRDTA
     A            E0             2A  B  6 78DSPATR(PR)
     A                                      OVRDTA
     A            AA             2A  B  7 12DSPATR(PR)
     A                                      OVRDTA
     A            AB             2A  B  7 18DSPATR(PR)
     A                                      OVRDTA
     A            A1             2A  B  7 24DSPATR(PR)
     A                                      OVRDTA
     A            A2             2A  B  7 30DSPATR(PR)
     A                                      OVRDTA
     A            A3             2A  B  7 36DSPATR(PR)
     A                                      OVRDTA
     A            A4             2A  B  7 42DSPATR(PR)
     A                                      OVRDTA
     A            A5             2A  B  7 48DSPATR(PR)
     A                                      OVRDTA
     A            A6             2A  B  7 54DSPATR(PR)
     A                                      OVRDTA
     A            A7             2A  B  7 60DSPATR(PR)
     A                                      OVRDTA
     A            A8             2A  B  7 66DSPATR(PR)
     A                                      OVRDTA
     A            A9             2A  B  7 72DSPATR(PR)
     A                                      OVRDTA
     A            A0             2A  B  7 78DSPATR(PR)
     A                                      OVRDTA
     A            HRESTA        72A  B  8  8DSPATR(PR)
     A                                      OVRDTA
     A            HREST1        72A  B  9  8DSPATR(PR)
     A                                      OVRDTA
     A            HREST3        17A  B 10 63DSPATR(PR)
     A                                      OVRDTA
     A            HREST5        79A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            HREST7        79A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            HREST9        79A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            HRACTA        79A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            HRACT1        79A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            HRACT3        79A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            HRACT5        79A  B 18  1DSPATR(PR)
     A                                      OVRDTA
     A            HRACT7        79A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            HRACT9        79A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            TOTALCST      79A  B 21  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE2     79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN TO MENU f2-CHANGE-
     A                                       WO NUM f8-DISPLAY WO f4-DISP NON P-
     A                                      URC MTL f5-DISPLA')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FDISPMAT
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 26'W O R K   O R D E R'
     A                                  1 57'DATE'
     A                                  2  8'N O N - P U R C H A S E D   M A T'
     A                                  2 42'E R I A L   D I S P L A Y'
     A                                  4  1'W/O NUM'
     A                                  4 26'W/O DESC'
     A                                  4 69'STATUS'
     A                                  6  8'MACH    DEPT  EXP CLASS ZONE/SHOP'
     A                                  6 42'PRTY    RIME    TIME SCHED'
     A                                  9  1'ITEM   CODE  ST UM ORIG REQ DATE S-
     A                                      TG'
     A                                  9 46'QTY'
     A                                  9 56'UNIT COST     TOTAL COST'
     A            CURRDATE       8A  B  1 62DSPATR(PR)
     A                                      OVRDTA
     A            TIME           5A  B  1 73DSPATR(PR)
     A                                      OVRDTA
     A            WONUMB7        7A  B  4  9DSPATR(PR)
     A                                      OVRDTA
     A            WOR            3A  B  4 17DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIO    30A  B  4 35DSPATR(PR)
     A                                      OVRDTA
     A            ST             2A  B  4 76DSPATR(PR)
     A                                      OVRDTA
     A            EQPNUM         6A  B  7  7DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  7 16DSPATR(PR)
     A                                      OVRDTA
     A            EXPCLASS       8A  B  7 23DSPATR(PR)
     A                                      OVRDTA
     A            ZONE           4A  B  7 34DSPATR(PR)
     A                                      OVRDTA
     A            P              1A  B  7 43DSPATR(PR)
     A                                      OVRDTA
     A            RI             2A  B  7 51DSPATR(PR)
     A                                      OVRDTA
     A            MS             2A  B  7 56DSPATR(PR)
     A                                      OVRDTA
     A            DS             2A  B  7 59DSPATR(PR)
     A                                      OVRDTA
     A            YS             2A  B  7 62DSPATR(PR)
     A                                      OVRDTA
     A            HS             2A  B  7 66DSPATR(PR)
     A                                      OVRDTA
     A            SS             2A  B  7 69DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE1     79A  B 10  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE2     79A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE3     79A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE4     79A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE5     79A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE6     79A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE7     79A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE9     79A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINEA     79A  B 18  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINEB     79A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINEC     79A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINED     79A  B 21  1DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELIN    79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN TO MENU f2-PREV P-
     A                                      AGE f8-DISPLAY WO f4-NEXT PAGE f5-D-
     A                                      ISPLAY PURC MTL f')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FDISPUNC
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 26'W O R K   O R D E R'
     A                                  1 57'DATE'
     A                                  2 10'P U R C H A S E D   M A T E R I A'
     A                                  2 44'L   D I S P L A Y'
     A                                  4  1'W/O NUM'
     A                                  4 26'W/O DESC'
     A                                  4 69'STATUS'
     A                                  6  8'MACH    DEPT  EXP CLASS ZONE/SHOP'
     A                                  6 42'PRTY    RIME    TIME SCHED'
     A                                  9  1'ITEM   CODE  ST UM ORIG REQ DATE S-
     A                                      TG'
     A                                  9 46'QTY'
     A                                  9 56'UNIT COST     TOTAL COST'
     A            CURRDATE       8A  B  1 62DSPATR(PR)
     A                                      OVRDTA
     A            TIME           5A  B  1 73DSPATR(PR)
     A                                      OVRDTA
     A            WONUMB7        7A  B  4  9DSPATR(PR)
     A                                      OVRDTA
     A            WOR            3A  B  4 17DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIO    30A  B  4 35DSPATR(PR)
     A                                      OVRDTA
     A            ST             2A  B  4 76DSPATR(PR)
     A                                      OVRDTA
     A            EQPNUM         6A  B  7  7DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  7 16DSPATR(PR)
     A                                      OVRDTA
     A            EXPCLASS       8A  B  7 23DSPATR(PR)
     A                                      OVRDTA
     A            ZONE           4A  B  7 34DSPATR(PR)
     A                                      OVRDTA
     A            P              1A  B  7 43DSPATR(PR)
     A                                      OVRDTA
     A            RI             2A  B  7 51DSPATR(PR)
     A                                      OVRDTA
     A            MS             2A  B  7 56DSPATR(PR)
     A                                      OVRDTA
     A            DS             2A  B  7 59DSPATR(PR)
     A                                      OVRDTA
     A            YS             2A  B  7 62DSPATR(PR)
     A                                      OVRDTA
     A            HS             2A  B  7 66DSPATR(PR)
     A                                      OVRDTA
     A            SS             2A  B  7 69DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE1     79A  B 10  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE2     79A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE3     79A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE4     79A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE5     79A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE6     79A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE7     79A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE9     79A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINEA     79A  B 18  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINEB     79A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINEC     79A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINED     79A  B 21  1DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELIN    79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN TO MENU f2-PREV P-
     A                                      AGE f8-DISPLAY WO f4-DISP NON PURC -
     A                                      MTL f5-NEXT PAGE ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FDISPWO2
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  7  6'IF YOU WANT TO LOOK AT A SPECIFIC'
     A                                  7 40'ITEM ENTER THE ITEM NUMBER'
     A                                  9  6'IF YOU WANT TO LOOK AT A SPECIFIC'
     A                                  9 40'REQUISITION ENTER THE NUMBER'
     A                                 11 14'OTHERWISE DEPRESS ANY FUNCTION KEY'
     A                                 11 49'TO CONTINUE'
     A            ITEM           4A  B  7 69DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI PC)
     A            REQNUM         6A  B  9 69DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FDISPWON
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  7 12'INPUT THE WORK ORDER NUMBER THAT N-
     A                                      EEDS DISPLAYED'
     A                                  9 16'THEN DEPRESS THE APPROPRIATE FUNCT-
     A                                      ION KEY'
     A            WO6           10A  B 11 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f8-DISPLAY WO f4-DISP NON P-
     A                                      URC MTL f5-DISPLAY PURC MTL f6-DISP-
     A                                      LAY LABOR f7-DISP')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FDSPBASC
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 19'W O R K   O R D E R   D I S P L A'
     A                                  1 53'Y'
     A                                  3  2'W/O NUM'
     A                                  3 27'W/O STATUS'
     A                                  3 43'TYPE'
     A                                  3 55'TIME RECD'
     A                                  4  2'APPROVAL CODE'
     A                                  4 27'REQUESTER'
     A                                  4 55'EQUIP NUM'
     A                                  5  2'EQUIP NAME'
     A                                  6  2'DEPT'
     A                                  6 21'MAINT ZONE'
     A                                  6 41'LOCATION'
     A                                  6 62'PRIORITY'
     A                                  7  2'EQUIPMENT DOWN'
     A                                  7 21'CRAFT REQT'
     A                                  7 62'EXP CLASS'
     A                                  8  2'DESCRIPTION'
     A                                  9  2'ADD"L INFO '
     A                                 12  2'CRAFTSMEN'
     A                                 12 55'TIME STRT'
     A                                 13  2'FAILURE CODE'
     A                                 13 55'TIME COMP'
     A            WONUM          7A  B  3 10DSPATR(PR)
     A                                      OVRDTA
     A            WOR            3A  B  3 18DSPATR(PR)
     A                                      OVRDTA
     A            ST             2A  B  3 38DSPATR(PR)
     A                                      OVRDTA
     A            CT             2A  B  3 48DSPATR(PR)
     A                                      OVRDTA
     A            TM             2A  B  3 65DSPATR(PR)
     A                                      OVRDTA
     A            TD             2A  B  3 68DSPATR(PR)
     A                                      OVRDTA
     A            TY             2A  B  3 71DSPATR(PR)
     A                                      OVRDTA
     A            TI             2A  B  3 75DSPATR(PR)
     A                                      OVRDTA
     A            TS             2A  B  3 78DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  4 16DSPATR(PR)
     A                                      OVRDTA
     A            REQUESTER     16A  B  4 37DSPATR(PR)
     A                                      OVRDTA
     A            EQPNUM         6A  B  4 65DSPATR(PR)
     A                                      OVRDTA
     A            EQUIPNAME     50A  B  5 13DSPATR(PR)
     A                                      OVRDTA
     A            EQPTYPE        8A  B  5 65DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  6  7DSPATR(PR)
     A                                      OVRDTA
     A            MZON           4A  B  6 32DSPATR(PR)
     A                                      OVRDTA
     A            LOCATION       8A  B  6 50DSPATR(PR)
     A                                      OVRDTA
     A            P              1A  B  6 71DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B  7 17DSPATR(PR)
     A                                      OVRDTA
     A            C1             2A  B  7 32DSPATR(PR)
     A                                      OVRDTA
     A            C2             2A  B  7 35DSPATR(PR)
     A                                      OVRDTA
     A            C3             2A  B  7 38DSPATR(PR)
     A                                      OVRDTA
     A            EXPCLASS       8A  B  7 72DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIO    30A  B  8 14DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI2    66A  B  9 14DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI3    66A  B 10 14DSPATR(PR)
     A                                      OVRDTA
     A            CRF1           4A  B 12 12DSPATR(PR)
     A                                      OVRDTA
     A            CRF2           4A  B 12 17DSPATR(PR)
     A                                      OVRDTA
     A            CRF3           4A  B 12 22DSPATR(PR)
     A                                      OVRDTA
     A            CRF4           4A  B 12 27DSPATR(PR)
     A                                      OVRDTA
     A            CRF5           4A  B 12 32DSPATR(PR)
     A                                      OVRDTA
     A            BM             2A  B 12 65DSPATR(PR)
     A                                      OVRDTA
     A            BD             2A  B 12 68DSPATR(PR)
     A                                      OVRDTA
     A            BY             2A  B 12 71DSPATR(PR)
     A                                      OVRDTA
     A            BI             2A  B 12 75DSPATR(PR)
     A                                      OVRDTA
     A            BS             2A  B 12 78DSPATR(PR)
     A                                      OVRDTA
     A            F              2A  B 13 15DSPATR(PR)
     A                                      OVRDTA
     A            FREM           4A  B 13 18DSPATR(PR)
     A                                      OVRDTA
     A            CM             2A  B 13 65DSPATR(PR)
     A                                      OVRDTA
     A            CD             2A  B 13 68DSPATR(PR)
     A                                      OVRDTA
     A            CY             2A  B 13 71DSPATR(PR)
     A                                      OVRDTA
     A            CI             2A  B 13 75DSPATR(PR)
     A                                      OVRDTA
     A            CS             2A  B 13 78DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELIN    79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN TO MENU f2-CHANGE-
     A                                       WO NUM f8-DISPLAY MESSAGES f4-DISP-
     A                                       NON PURC MTL f5-')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FDSPBMEN
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 10'DEPRESS'
     A                                  6 14'F2  TO CHANGE THE WORK ORDER NUMBE-
     A                                      R'
     A                                  9 14'F3  TO END DISPLAY PROGRAM'
     A                                 11 10'F4  TO DISPLAY NON-PURCHASED MATER-
     A                                      IALS FOR THE WORK ORDER'
     A                                 13 10'F5  TO DISPLAY PURCHASED MATERIALS'
     A                                 13 45'FOR THE WORK ORDER'
     A                                 15 10'F6  TO DISPLAY LABOR USED FOR THE'
     A                                 15 44'WORK ORDER'
     A                                 18 10'F8  TO DISPLAY THE VERBAL WORK ORD-
     A                                      ER'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f2-CHANGE WO NUM f8-DISPLAY-
     A                                       WO f4-DISP NON PURC MTL f5-DISPLAY-
     A                                       PURC MTL f6-DISP')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FDSPMENU
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  3 10'DEPRESS'
     A                                  6 14'F2  TO CHANGE THE WORK ORDER NUMBE-
     A                                      R'
     A                                  9 14'F3  TO END DISPLAY PROGRAM'
     A                                 11 10'F4  TO DISPLAY NON-PURCHASED MATER-
     A                                      IALS USED FOR THE WORK ORDER'
     A                                 13 10'F5  TO DISPLAY PURCHASED MATERIALS'
     A                                 13 45'USED FOR THE WORK ORDER'
     A                                 15 10'F6  TO DISPLAY LABOR USED FOR THE'
     A                                 15 44'WORK ORDER'
     A                                 17 10'F7  TO DISPLAY JOBPLAN FOR THE WOR-
     A                                      K ORDER'
     A                                 20 10'F8  TO DISPLAY THE PLANNED WORK OR-
     A                                      DER'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f2-CHANGE WO NUM f8-DISPLAY-
     A                                       WO f4-DISP NON PURC MTL f5-DISPLAY-
     A                                       PURC MTL f6-DISP')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FDSPNOWO
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                 10  6'PLANNED WORK ORDER DOES NOT EXIST'
     A                                 11  6'TRY DISPLAYING MATERIALS OR LABOR'
     A                                 11 40'RECORDS'
     A                                 23  2'DEPRESS F1 TO CONTINUE'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-CONTINUE                -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FDSPPLAN
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 22'W O R K   O R D E R   D I S P L A'
     A                                  1 56'Y'
     A                                  3  2'W/O NUM'
     A                                  3 27'W/O STATUS'
     A                                  3 43'TYPE'
     A                                  3 55'TIME RECD'
     A                                  4  2'APPROVAL CODE'
     A                                  4 27'REQUESTER'
     A                                  4 55'EQUIP NUM'
     A                                  5  2'EQUIP NAME'
     A                                  6  2'DEPT'
     A                                  6 14'MAINT ZONE'
     A                                  6 33'LOCATION '
     A                                  6 55'PRIORITY'
     A                                  6 73'RIME'
     A                                  7  2'EQUIPMENT DOWN'
     A                                  7 33'EXP CLASS'
     A                                  7 55'TIME REQD'
     A                                  8  2'DESCRIPTION'
     A                                 13  2'SPECL INSTR'
     A                                 15  2'SPECL EQUIP'
     A                                 16  2'SAFETY NOTE'
     A                                 17  2'ENGINEER'
     A                                 17 18'PLANNER'
     A                                 17 33'SCHEDULER'
     A                                 17 55'TIME SCHD'
     A                                 18  2'BUDGET NO'
     A                                 18 33'REQST NO'
     A                                 18 55'TIME STRT'
     A                                 19  2'FAILURE CODE'
     A                                 19 55'TIME COMP'
     A                                 21  2'L EST'
     A                                 21 22'S EST'
     A                                 21 42'P EST'
     A                                 21 62'T EST'
     A                                 22  2'L ACT'
     A                                 22 22'S ACT'
     A                                 22 42'P ACT'
     A                                 22 62'T ACT'
     A            WONUM          7A  B  3 10DSPATR(PR)
     A                                      OVRDTA
     A            WOR            3A  B  3 18DSPATR(PR)
     A                                      OVRDTA
     A            ST             2A  B  3 38DSPATR(PR)
     A                                      OVRDTA
     A            CT             2A  B  3 48DSPATR(PR)
     A                                      OVRDTA
     A            TM             2A  B  3 65DSPATR(PR)
     A                                      OVRDTA
     A            TD             2A  B  3 68DSPATR(PR)
     A                                      OVRDTA
     A            TY             2A  B  3 71DSPATR(PR)
     A                                      OVRDTA
     A            TI             2A  B  3 75DSPATR(PR)
     A                                      OVRDTA
     A            TS             2A  B  3 78DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  4 16DSPATR(PR)
     A                                      OVRDTA
     A            REQUESTER     16A  B  4 37DSPATR(PR)
     A                                      OVRDTA
     A            EQPNUM         6A  B  4 65DSPATR(PR)
     A                                      OVRDTA
     A            EQUIPNAME     50A  B  5 13DSPATR(PR)
     A                                      OVRDTA
     A            EQPTYPE        8A  B  5 65DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  6  7DSPATR(PR)
     A                                      OVRDTA
     A            MZON           4A  B  6 25DSPATR(PR)
     A                                      OVRDTA
     A            LOCATION       8A  B  6 43DSPATR(PR)
     A                                      OVRDTA
     A            P              1A  B  6 64DSPATR(PR)
     A                                      OVRDTA
     A            RI             2A  B  6 78DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B  7 17DSPATR(PR)
     A                                      OVRDTA
     A            EXPCLASS       8A  B  7 43DSPATR(PR)
     A                                      OVRDTA
     A            RM             2A  B  7 65DSPATR(PR)
     A                                      OVRDTA
     A            RD             2A  B  7 68DSPATR(PR)
     A                                      OVRDTA
     A            RY             2A  B  7 71DSPATR(PR)
     A                                      OVRDTA
     A            RH             2A  B  7 75DSPATR(PR)
     A                                      OVRDTA
     A            RS             2A  B  7 78DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIO    30A  B  8 14DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI2    66A  B  9 14DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI3    66A  B 10 14DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI4    66A  B 11 14DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI5    66A  B 12 14DSPATR(PR)
     A                                      OVRDTA
     A            SPECLINSTR    66A  B 13 14DSPATR(PR)
     A                                      OVRDTA
     A            SPECLINST2    66A  B 14 14DSPATR(PR)
     A                                      OVRDTA
     A            SPECLEQUIP    66A  B 15 14DSPATR(PR)
     A                                      OVRDTA
     A            SAFETYNOTE    66A  B 16 14DSPATR(PR)
     A                                      OVRDTA
     A            ENGR           6A  B 17 11DSPATR(PR)
     A                                      OVRDTA
     A            PLNR           6A  B 17 26DSPATR(PR)
     A                                      OVRDTA
     A            SCDR           6A  B 17 43DSPATR(PR)
     A                                      OVRDTA
     A            SM             2A  B 17 65DSPATR(PR)
     A                                      OVRDTA
     A            SD             2A  B 17 68DSPATR(PR)
     A                                      OVRDTA
     A            SY             2A  B 17 71DSPATR(PR)
     A                                      OVRDTA
     A            SI             2A  B 17 75DSPATR(PR)
     A                                      OVRDTA
     A            SS             2A  B 17 78DSPATR(PR)
     A                                      OVRDTA
     A            BUDGETNUMB    16A  B 18 12DSPATR(PR)
     A                                      OVRDTA
     A            REQNO         12A  B 18 42DSPATR(PR)
     A                                      OVRDTA
     A            BM             2A  B 18 65DSPATR(PR)
     A                                      OVRDTA
     A            BD             2A  B 18 68DSPATR(PR)
     A                                      OVRDTA
     A            BY             2A  B 18 71DSPATR(PR)
     A                                      OVRDTA
     A            BI             2A  B 18 75DSPATR(PR)
     A                                      OVRDTA
     A            BS             2A  B 18 78DSPATR(PR)
     A                                      OVRDTA
     A            F              2A  B 19 15DSPATR(PR)
     A                                      OVRDTA
     A            FREM           4A  B 19 18DSPATR(PR)
     A                                      OVRDTA
     A            CM             2A  B 19 65DSPATR(PR)
     A                                      OVRDTA
     A            CD             2A  B 19 68DSPATR(PR)
     A                                      OVRDTA
     A            CY             2A  B 19 71DSPATR(PR)
     A                                      OVRDTA
     A            CI             2A  B 19 75DSPATR(PR)
     A                                      OVRDTA
     A            CS             2A  B 19 78DSPATR(PR)
     A                                      OVRDTA
     A            LABOREST      12A  B 21  8DSPATR(PR)
     A                                      OVRDTA
     A            STORESEST     12A  B 21 28DSPATR(PR)
     A                                      OVRDTA
     A            PURCHEST      12A  B 21 48DSPATR(PR)
     A                                      OVRDTA
     A            TOTALEST      12A  B 21 68DSPATR(PR)
     A                                      OVRDTA
     A            LABORACT      12A  B 22  8DSPATR(PR)
     A                                      OVRDTA
     A            STORESACT     12A  B 22 28DSPATR(PR)
     A                                      OVRDTA
     A            PURCHACT      12A  B 22 48DSPATR(PR)
     A                                      OVRDTA
     A            TOTALACT      12A  B 22 68DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN TO MENU f2-CHANGE-
     A                                       WO NUM f8-DISPLAY MESSAGES f4-DISP-
     A                                       NON PURC MTL f5-')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FNOBASIC
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                 10  6'WORK ORDER BASIC DOES NOT EXIST'
     A                                 11  6'TRY CONTACTING THE PLANNER FOR YOU-
     A                                      R ZONE'
     A                                 12  6'THE WORK ORDER HAS PROBABLY BEEN M-
     A                                      OVED'
     A                                 13  6'TO THE PLANNED LOOP'
     A                                 23  1'DEPRESS F1 TO CONTINUE'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-CONTINUE                -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FNOJOBPL
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'W/O NUM'
     A                                 10  6'NO JOBPLAN WAS WRITTEN FOR THIS WO-
     A                                      RK ORDER'
     A                                 23  6'DEPRESS F1 TO CONTINUE'
     A            WOMAJOR        7A  B  1 10DSPATR(PR)
     A                                      OVRDTA
     A            WOR            3A  B  1 18DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-CONTINUE                -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FNOMATRL
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'W/O NUM'
     A                                 10  6'NO MATERIALS USED'
     A                                 23  6'DEPRESS F1 TO CONTINUE'
     A            WOMAJOR        7A  B  1 10DSPATR(PR)
     A                                      OVRDTA
     A            WOR            3A  B  1 18DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-CONTINUE                -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R IMESSAGE
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 15'-----------------------------------
     A                                      ---------------'
     A                                  3 15':     S E N D   M E S S A G E   S'
     A                                  3 49'C R E E N     :'
     A                                  4 15'-----------------------------------
     A                                      ---------------'
     A                                  5  5'DATE:'
     A                                  6  2'********************************* -
     A                                      ***********************************-
     A                                      ***********'
     A                                  7  3'MESSAGE TO:    CLOCK CARD -'
     A                                  7 39'OR    WORK ORDER -'
     A                                  8  1'**********************************-
     A                                      ***********************************-
     A                                      ***********'
     A                                  9  3'MESSAGE FROM:'
     A                                 10  1'**********************************-
     A                                      ***********************************-
     A                                      ***********'
     A                                 11  3'MESSAGE:'
     A                                 17  1'**********************************-
     A                                      ***********************************-
     A                                      ***********'
     A                                 18 15'PRINT MESSAGE AT RECEIVER"s ZONE P-
     A                                      RINTER:'
     A                                 19  2'Any character will cause a copy to'
     A                                 19 37'be printed at the zone printer.  M-
     A                                      essages'
     A                                 20  2'to Clock Card numbers which are pr-
     A                                      inted are NOT saved in the database-
     A                                       and will'
     A                                 21  2'NOT appear on the receiver"s termi-
     A                                      nal.  Workorder messages which are'
     A                                 21 71'printed,'
     A                                 22  2'will print on the zone printer of'
     A                                 22 36'the workorder zone and WILL be sav-
     A                                      ed.'
     A                                 23  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A            D             69A  B  5 12DSPATR(PR)
     A                                      OVRDTA
     A            TFILL          4A  B  7 31DSPATR(PR)
     A                                      OVRDTA
     A            FILL2         10A  B  7 58DSPATR(PR)
     A                                      OVRDTA
     A            WO             4A  B  9 18DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI PC)
     A            SUF           28A  B  9 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI PC)
     A            SO            70A  B 12  6DSPATR(PR)
     A                                      OVRDTA
     A            F2            70A  B 13  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI PC)
     A            F3            70A  B 14  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI PC)
     A            F4            70A  B 15  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI PC)
     A            F5            70A  B 16  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI PC)
     A            P             23A  B 18 58DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN TO MENU f3-EXIT P-
     A                                      ROGRAM                             -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INITWO
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 14'-----------------------------------
     A                                      -------------'
     A                                  2 14':  W O R K   O R D E R   I N I T I'
     A                                  2 49'A T I O N  :'
     A                                  3 14'-----------------------------------
     A                                      -------------'
     A                                  5  3'Requestor'
     A            REQUESTOR     16A  B  5 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI PC)
     A                                  5 57'Equipment Number'
     A            EQPNUM         6A  B  5 74DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI PC)
     A                                  7  3'Priority   Equipment Down   W/O De-
     A                                      scription'
     A                                  7 66'Skill Required'
     A                                  8  3'--------   --------------   -------
     A                                      ------------------------     -------
     A                                      --------'
     A            P              1A  B  9  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI PC)
     A            EQPDWN         1A  B  9 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI PC)
     A            DESC          30A  B  9 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI PC)
     A            CRAFT1         2A  B  9 66DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI PC)
     A            CRAFT2         2A  B  9 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI PC)
     A            CRAFT3         2A  B  9 74DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI PC)
     A                                 11  3'Additional Information:'
     A            DES2A         66A  B 12  7DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI PC)
     A            DES2B         66A  B 13  7DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI PC)
     A            ASBESTOS      36A  B 15 16DSPATR(PR)
     A                                      OVRDTA
     A            AFLAG          1A  B 15 54
     A N80                                  DSPATR(PR)
     A  80                                  DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A                                 17 16'Enter an "X" to initiate a PLANNED'
     A                                 17 51'Workorder'
     A            X              1A  B 17 62DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI PC)
     A            QF             2A  B 19 35DSPATR(PR)
     A                                      OVRDTA
     A            NQ             2A  B 19 51DSPATR(PR)
     A                                      OVRDTA
     A            CC             4A  B 19 76DSPATR(PR)
     A                                      OVRDTA
     A            MSG           50A  B 20 14DSPATR(PR)
     A                                      OVRDTA
     A                                 22 23'ENTER DATA AND PRESS "ENTER" KEY'
dcr01A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN TO MENU f2-CHANGE-
     A                                       Q-FACTOR f3-EXIT PROGRAM f5-EQUIP--
     A                                      SEL f6-CRAFT-SEL')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INITWOG
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  3  3'-----------------------------------
     A                                      -------------    Workorder Type:'
     A                                  4  3':  W O R K   O R D E R   I N I T I'
     A                                  4 38'A T I O N  :'
     A                                  4 62'Verbal:  V'
     A                                  5  3'-----------------------------------
     A                                      -------------'
     A                                  5 61'Planned:  P'
     A                                  6 58'Engineered:  E'
     A                                  8  3'Requestor'
     A                                  8 57'Equipment Number'
     A                                 10  3'Priority   Equipment Down   W/O De-
     A                                      scription'
     A                                 10 66'Skill Required'
     A                                 11  3'--------   --------------   -------
     A                                      ------------------------     -------
     A                                      --------'
     A                                 14  3'Additional Information:'
     A                                 22 23'ENTER DATA AND PRESS "ENTER" KEY'
     A            T              1A  B  3 71DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI PC)
     A            REQUESTOR     16A  B  8 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI PC)
     A            EQPNUM         6A  B  8 74DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI PC)
     A            P              1A  B 12  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI PC)
     A            EQPDWN         1A  B 12 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI PC)
     A            DESC          30A  B 12 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI PC)
     A            CRAFT1         2A  B 12 66DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI PC)
     A            CRAFT2         2A  B 12 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI PC)
     A            CRAFT3         2A  B 12 74DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI PC)
     A            DES2A         66A  B 16  7DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI PC)
     A            DES2B         66A  B 17  7DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI PC)
     A            MSG           50A  B 20 14DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN TO MENU f3-EXIT P-
     A                                      ROGRAM                             -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INITWOSON
     A*%%TS  DD  19931124  071615  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 14'-----------------------------------
     A                                      -------------'
     A                                  2 14':  W O R K   O R D E R   I N I T I'
     A                                  2 49'A T I O N  :'
     A                                  3 14'-----------------------------------
     A                                      -------------'
     A                                  5  3'Requestor'
     A            REQUESTOR     16A  B  5 13DSPATR(PR)
     A                                      OVRDTA
     A                                  5 57'Equipment Number'
     A            EQPNUM         6A  B  5 74DSPATR(PR)
     A                                      OVRDTA
     A                                  7  3'Priority   Equipment Down   W/O De-
     A                                      scription'
     A                                  7 66'Skill Required'
     A                                  8  3'--------   --------------   -------
     A                                      ------------------------     -------
     A                                      --------'
     A            P              1A  B  9  3DSPATR(PR)
     A                                      OVRDTA
     A            EQPDWN         1A  B  9 14DSPATR(PR)
     A                                      OVRDTA
     A            DESC          30A  B  9 31DSPATR(PR)
     A                                      OVRDTA
     A            CRAFT1         2A  B  9 66DSPATR(PR)
     A                                      OVRDTA
     A            CRAFT2         2A  B  9 70DSPATR(PR)
     A                                      OVRDTA
     A            CRAFT3         2A  B  9 74DSPATR(PR)
     A                                      OVRDTA
     A                                 11  3'Additional Information:'
     A            DES2A         66A  B 12  7DSPATR(PR)
     A                                      OVRDTA
     A            DES2B         66A  B 13  7DSPATR(PR)
     A                                      OVRDTA
     A            ASBESTOS      36A  B 15 12DSPATR(PR)
     A                                      OVRDTA
     A            AFLAG          1A  B 15 64DSPATR(PR)
     A                                      OVRDTA
     A            X              1A  B 15 70DSPATR(PR)
     A                                      OVRDTA
     A                                 18  2'The calculated Queue Factor is:'
     A            QF             2A  B 18 35DSPATR(PR)
     A                                      OVRDTA
     A                                 18 39'Change to:'
     A            NQ             2A  B 18 51DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI PC)
     A                                 18 57'Assign Craftsman:'
     A            CC             4A  B 18 76DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI PC)
     A            MSG           50A  B 20 14DSPATR(PR)
     A                                      OVRDTA
     A                                 22 23'ENTER DATA AND PRESS "ENTER" KEY'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN TO MENU f3-EXIT P-
     A                                      ROGRAM                             -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R MSGEXEC
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 18'-----------------------------------
     A                                      -------'
     A                                  2 18':   M E S S A G E   F U N C T I O'
     A                                  2 52'N S   :'
     A                                  3 18'-----------------------------------
     A                                      -------'
     A                                  4  6'Enter Your Personal Identification'
     A                                  4 41'Code'
     A                                  4 51'and Press "ENTER" Key'
     A                                  5  8'-----------------------------------
     A                                      ---------------------------'
     A                                  6  8'.  Identification Code:'
     A                                  6 43'Name:'
     A                                  6 68'.'
     A                                  7  8'-----------------------------------
     A                                      ---------------------------'
     A                                  8 13'PRESS:'
     A                                  9 21'f1   Return to Menu'
     A                                 11 21'f2   Write Message to WO or Clock'
     A                                 11 55'Card'
     A                                 13 21'f3   Exit Program'
     A                                 15 21'f4   View Current News Items'
     A                                 17 21'f5      ***  No Function  ***'
     A                                 19 21'f6      ***  No Function  ***'
     A                                 21 21'f7      ***  No Function  ***'
     A                                 23 21'f8   Receive Messages'
     A            CNUM           4A  B  4 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI PC)
     A            CCNM           4A  B  6 33DSPATR(PR)
     A                                      OVRDTA
     A            NAME          16A  B  6 50DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R OMSGCC
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 10'-----------------------------------
     A                                      -----------------------------'
     A                                  2 10':     D I S P L A Y   C L O C K'
     A                                  2 44'C A R D   M E S S A G E     :'
     A                                  3 10'-----------------------------------
     A                                      -----------------------------'
     A                                  4  5'MESSAGE SENT ON:'
     A                                  4 63'AT'
     A                                  5  5'DATE:'
     A                                  6  2'********************************* -
     A                                      ***********************************-
     A                                      ***********'
     A                                  7  3'MESSAGE TO:    CLOCK CARD -'
     A                                  8  1'**********************************-
     A                                      ***********************************-
     A                                      ***********'
     A                                  9  3'MESSAGE FROM:'
     A                                 10  1'**********************************-
     A                                      ***********************************-
     A                                      ***********'
     A                                 11  3'MESSAGE:'
     A                                 17  1'**********************************-
     A                                      ***********************************-
     A                                      ***********'
     A                                 18 17'PRINT MESSAGE AT YOUR ASSIGNED ZON-
     A                                      E PRINTER:'
     A                                 19 22'Enter any character to print messa-
     A                                      ge.'
     A                                 20  1'**********************************-
     A                                      ***********************************-
     A                                      ***********'
     A                                 21  3'NOTE:  This message will be automa-
     A                                      tically deleted'
     A                                 21 62'.  The message ma'
     A                                 22 10'be saved up to two weeks by enteri-
     A                                      ng a new Delete Date:'
     A                                 23  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A            D             69A  B  5 12DSPATR(PR)
     A                                      OVRDTA
     A            TFILL          4A  B  7 31DSPATR(PR)
     A                                      OVRDTA
     A            FILL2         10A  B  7 62DSPATR(PR)
     A                                      OVRDTA
     A            DUMMY          4A  B  9 18DSPATR(PR)
     A                                      OVRDTA
     A            SO            28A  B  9 26DSPATR(PR)
     A                                      OVRDTA
     A            F1            70A  B 12  6DSPATR(PR)
     A                                      OVRDTA
     A            F2            70A  B 13  6DSPATR(PR)
     A                                      OVRDTA
     A            F3            70A  B 14  6DSPATR(PR)
     A                                      OVRDTA
     A            F4            70A  B 15  6DSPATR(PR)
     A                                      OVRDTA
     A            F5            70A  B 16  6DSPATR(PR)
     A                                      OVRDTA
     A            P             18A  B 18 63DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI PC)
     A            DDATE          8A  B 21 53DSPATR(PR)
     A                                      OVRDTA
     A            D1             8A  B 22 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN TO MENU f3-EXIT P-
     A                                      ROGRAM                             -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R OMSGWO
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 11'-----------------------------------
     A                                      ---------------------------'
     A                                  2 11':     D I S P L A Y   W O R K O R'
     A                                  2 45'D E R   M E S S A G E     :'
     A                                  3 11'-----------------------------------
     A                                      ---------------------------'
     A                                  4  5'MESSAGE SENT ON:'
     A                                  4 63'AT'
     A                                  5  5'DATE:'
     A                                  7  2'********************************* -
     A                                      ***********************************-
     A                                      ***********'
     A                                  8  3'MESSAGE TO:    WORKORDER -'
     A                                  9  1'**********************************-
     A                                      ***********************************-
     A                                      ***********'
     A                                 10  3'MESSAGE FROM:'
     A                                 11  1'**********************************-
     A                                      ***********************************-
     A                                      ***********'
     A                                 13  3'MESSAGE:'
     A                                 20  1'**********************************-
     A                                      ***********************************-
     A                                      ***********'
     A                                 21 21'PRINT MESSAGE AT WORKORDER ZONE PR-
     A                                      INTER:'
     A                                 22 23'Enter any character to print messa-
     A                                      ge.'
     A                                 23  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A            D             69A  B  5 12DSPATR(PR)
     A                                      OVRDTA
     A            TFILL          4A  B  6 77DSPATR(PR)
     A                                      OVRDTA
     A            FILL2         10A  B  8 30DSPATR(PR)
     A                                      OVRDTA
     A            WO             4A  B 10 18DSPATR(PR)
     A                                      OVRDTA
     A            SO            28A  B 10 26DSPATR(PR)
     A                                      OVRDTA
     A            F1            70A  B 14  6DSPATR(PR)
     A                                      OVRDTA
     A            F2            70A  B 15  6DSPATR(PR)
     A                                      OVRDTA
     A            F3            70A  B 16  6DSPATR(PR)
     A                                      OVRDTA
     A            F4            70A  B 17  6DSPATR(PR)
     A                                      OVRDTA
     A            F5            70A  B 18  6DSPATR(PR)
     A                                      OVRDTA
     A            P             18A  B 21 63DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI PC)
     A            DUMMY1         8A  B 22  3DSPATR(PR)
     A                                      OVRDTA
     A            DUMMY2         8A  B 22 64DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN TO MENU f3-EXIT P-
     A                                      ROGRAM                             -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R PERPASS1
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 35'Type PASSWORD and press the "ENTER-
     A                                      " key.'
     A                                  4  3'Enter your personal PASSWORD:  '
     A                                  8  3'If you have problems or need help,'
     A                                  8 38'please contact'
     A            CC             4A  B  2  3DSPATR(PR)
     A                                      OVRDTA
     A            NAME          16A  B  2 11DSPATR(PR)
     A                                      OVRDTA
     A            PW             6A  B  4 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI PC)
     A            IVPMSG        30A  B  4 45DSPATR(PR)
     A                                      OVRDTA
     A            PWMSG         56A  B  6  3DSPATR(PR)
     A                                      OVRDTA
     A            NPW            6A  B  6 62DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI PC)
     A            HELP          26A  B  8 53DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R PERPASS2
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 35'Type PASSWORD and press the "ENTER-
     A                                      " key.'
     A                                  4  3'Enter your personal PASSWORD:  '
     A                                  8  3'If you have problems or need help,'
     A                                  8 38'please contact'
     A            CC             4A  B  2  3DSPATR(PR)
     A                                      OVRDTA
     A            NAME          16A  B  2 11DSPATR(PR)
     A                                      OVRDTA
     A            PW             6A  B  4 35DSPATR(PR)
     A                                      OVRDTA
     A            IVPMSG        30A  B  4 45DSPATR(PR)
     A                                      OVRDTA
     A            PWMSG         56A  B  6  3DSPATR(PR)
     A                                      OVRDTA
     A            NPW            6A  B  6 62DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI PC)
     A            HELP          26A  B  8 53DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R PERPASS3
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 35'Type PASSWORD and press the "ENTER-
     A                                      " key.'
     A                                  4  3'Enter your personal PASSWORD:  '
     A                                  8  3'If you have problems or need help,'
     A                                  8 38'please contact'
     A            CC             4A  B  2  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI PC)
     A            NAME          16A  B  2 11DSPATR(PR)
     A                                      OVRDTA
     A            PW             6A  B  4 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI PC)
     A            IVPMSG        30A  B  4 45DSPATR(PR)
     A                                      OVRDTA
     A            PWMSG         56A  B  6  3DSPATR(PR)
     A                                      OVRDTA
     A            NPW            6A  B  6 62DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI PC)
     A            HELP          26A  B  8 53DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R SUPEXECNEW
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  3 15'-----------------------------------
     A                                      -----------'
     A                                  4 15':  S U P E R V I S O R   F U N C T'
     A                                  4 50'I O N S  :'
     A                                  5 15'-----------------------------------
     A                                      -----------'
     A                                  7 12'PRESS:'
     A                                  8 20'f1   Message Functions'
     A                                 10 20'f2   Supervisor Update'
     A                                 12 20'f3   Return To Supervisor Menu'
     A                                 14 20'f4   Review/Update Open Work Order'
     A                                 14 55'Assignment Backlog'
     A                                 16 20'f5   Check Current Work Order Assi-
     A                                      gnment'
     A                                 18 20'f6   Display Work Order'
     A                                 20 20'f7   Release Held Work Orders'
     A                                 22 20'f8   Work Order Initiation'
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R UPDATE
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  3 18'-----------------------------------
     A                                      -----'
     A                                  4 18':  S U P E R V I S O R   U P D A T'
     A                                  4 53'E  :'
     A                                  5 18'-----------------------------------
     A                                      -----'
     A                                  7  5'Clock Card Number:'
     A                                  7 44'Status:'
     A                                  9  5'W/O Number:'
     A                                  9 44'Failure Code:'
     A                                  9 63'-'
     A                                 11  5'Time:'
     A                                 11 44'Date:'
     A                                 13  5'Comment:'
     A                                 22 22'ENTER DATA AND PRESS "ENTER" KEY'
     A            CRFT           4A  B  7 25DSPATR(UL)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            STATUS         2A  B  7 53DSPATR(UL)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI PC)
     A            WONUM          7A  B  9 18DSPATR(UL)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI PC)
     A            SEQ            3A  B  9 26DSPATR(UL)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI PC)
     A            F1             1A  B  9 59DSPATR(UL)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI PC)
     A            F2             1A  B  9 61DSPATR(UL)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI PC)
     A            F3             1A  B  9 65DSPATR(UL)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI PC)
     A            F4             1A  B  9 67DSPATR(UL)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI PC)
     A            F5             1A  B  9 69DSPATR(UL)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI PC)
     A            F6             1A  B  9 71DSPATR(UL)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI PC)
     A            HH             2A  B 11 12DSPATR(UL)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI PC)
     A            MM             2A  B 11 15DSPATR(UL)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI PC)
     A            MO             2A  B 11 51DSPATR(UL)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI PC)
     A            DY             2A  B 11 54DSPATR(UL)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI PC)
     A            YR             2A  B 11 57DSPATR(UL)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI PC)
     A            COM           60A  B 13 15DSPATR(UL)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI PC)
     A            MSGA          76A  B 17  3DSPATR(PR HI)
     A                                      OVRDTA
     A            MSGB          76A  B 18  3DSPATR(PR HI)
     A                                      OVRDTA
     A            MSG1          10A  B 19  3DSPATR(PR HI)
     A                                      OVRDTA
     A            MSG2           2A  B 19 14DSPATR(HI)
     A N30                                  DSPATR(PR)
     A  30                                  DSPATR(UL)
     A                                      OVRDTA
     A  18                                  DSPATR(PC)
     A            MSG3           2A  B 19 17DSPATR(HI)
     A N30                                  DSPATR(PR)
     A  30                                  DSPATR(UL)
     A                                      OVRDTA
     A  19                                  DSPATR(PC)
     A            MSG4           2A  B 19 20DSPATR(HI)
     A N30                                  DSPATR(PR)
     A  30                                  DSPATR(UL)
     A                                      OVRDTA
     A  20                                  DSPATR(PC)
     A            MSG5           8A  B 19 23DSPATR(PR HI)
     A                                      OVRDTA
     A            MSG6           2A  B 19 32DSPATR(HI)
     A N30                                  DSPATR(PR)
     A  30                                  DSPATR(UL)
     A                                      OVRDTA
     A  21                                  DSPATR(PC)
     A            MSG7           2A  B 19 35DSPATR(HI)
     A N30                                  DSPATR(PR)
     A  30                                  DSPATR(UL)
     A                                      OVRDTA
     A  22                                  DSPATR(PC)
     A            MSG8          38A  B 19 38DSPATR(PR HI)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-MENU  f5-MULTIPLE IP  f6-
     A                                      -CHANGE WO  f7-CHANGE TMP ZONE  f3--
     A                                      EXIT')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VAUTOQUE
     A*%%TS  DD  19960424  094041  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2 10'O P E N   W O R K O R D E R   Q U -
     A                                      E U E   F O R'
     A            ZONECRAFT     10A  B  2 60DSPATR(PR)
     A                                      OVRDTA
     A            ZONE           4A  B  2 71DSPATR(PR)
     A                                      OVRDTA
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2'QUEUE'
     A                                  5  2'FACTOR CC #   EQUIP  DOWN  WO NUMB-
     A                                      ER  DESCRIPTION                    -
     A                                        SKILLS'
     A                                  6  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A            R1             2A  B  7  3DSPATR(PR)
     A                                      OVRDTA
     A            C1             4A  B  7  9DSPATR(PR)
     A                                      OVRDTA
     A            E1             6A  B  7 16DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  7 25DSPATR(PR)
     A                                      OVRDTA
     A            W1            11A  B  7 28OVRDTA
     A            D1            30A  B  7 40DSPATR(PR)
     A                                      OVRDTA
     A            SA             2A  B  7 72DSPATR(PR)
     A                                      OVRDTA
     A            SB             2A  B  7 75DSPATR(PR)
     A                                      OVRDTA
     A            SC             2A  B  7 78DSPATR(PR)
     A                                      OVRDTA
     A            R2             2A  B  8  3DSPATR(PR)
     A                                      OVRDTA
     A            C2             4A  B  8  9DSPATR(PR)
     A                                      OVRDTA
     A            E2             6A  B  8 16DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B  8 25DSPATR(PR)
     A                                      OVRDTA
     A            W2            11A  B  8 28OVRDTA
     A            D2            30A  B  8 40DSPATR(PR)
     A                                      OVRDTA
     A            SD             2A  B  8 72DSPATR(PR)
     A                                      OVRDTA
     A            SE             2A  B  8 75DSPATR(PR)
     A                                      OVRDTA
     A            SF             2A  B  8 78DSPATR(PR)
     A                                      OVRDTA
     A            R3             2A  B  9  3DSPATR(PR)
     A                                      OVRDTA
     A            C3             4A  B  9  9DSPATR(PR)
     A                                      OVRDTA
     A            E3             6A  B  9 16DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  9 25DSPATR(PR)
     A                                      OVRDTA
     A            W3            11A  B  9 28OVRDTA
     A            D3            30A  B  9 40DSPATR(PR)
     A                                      OVRDTA
     A            SG             2A  B  9 72DSPATR(PR)
     A                                      OVRDTA
     A            SH             2A  B  9 75DSPATR(PR)
     A                                      OVRDTA
     A            SI             2A  B  9 78DSPATR(PR)
     A                                      OVRDTA
     A            R4             2A  B 10  3DSPATR(PR)
     A                                      OVRDTA
     A            C4             4A  B 10  9DSPATR(PR)
     A                                      OVRDTA
     A            E4             6A  B 10 16DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 10 25DSPATR(PR)
     A                                      OVRDTA
     A            W4            11A  B 10 28OVRDTA
     A            D4            30A  B 10 40DSPATR(PR)
     A                                      OVRDTA
     A            SJ             2A  B 10 72DSPATR(PR)
     A                                      OVRDTA
     A            SK             2A  B 10 75DSPATR(PR)
     A                                      OVRDTA
     A            SL             2A  B 10 78DSPATR(PR)
     A                                      OVRDTA
     A            R5             2A  B 11  3DSPATR(PR)
     A                                      OVRDTA
     A            C5             4A  B 11  9DSPATR(PR)
     A                                      OVRDTA
     A            E5             6A  B 11 16DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 11 25DSPATR(PR)
     A                                      OVRDTA
     A            W5            11A  B 11 28OVRDTA
     A            D5            30A  B 11 40DSPATR(PR)
     A                                      OVRDTA
     A            SM             2A  B 11 72DSPATR(PR)
     A                                      OVRDTA
     A            SN             2A  B 11 75DSPATR(PR)
     A                                      OVRDTA
     A            SO             2A  B 11 78DSPATR(PR)
     A                                      OVRDTA
     A            R6             2A  B 12  3DSPATR(PR)
     A                                      OVRDTA
     A            C6             4A  B 12  9DSPATR(PR)
     A                                      OVRDTA
     A            E6             6A  B 12 16DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 12 25DSPATR(PR)
     A                                      OVRDTA
     A            W6            11A  B 12 28OVRDTA
     A            D6            30A  B 12 40DSPATR(PR)
     A                                      OVRDTA
     A            SP             2A  B 12 72DSPATR(PR)
     A                                      OVRDTA
     A            SQ             2A  B 12 75DSPATR(PR)
     A                                      OVRDTA
     A            SR             2A  B 12 78DSPATR(PR)
     A                                      OVRDTA
     A            R7             2A  B 13  3DSPATR(PR)
     A                                      OVRDTA
     A            C7             4A  B 13  9DSPATR(PR)
     A                                      OVRDTA
     A            E7             6A  B 13 16DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 13 25DSPATR(PR)
     A                                      OVRDTA
     A            W7            11A  B 13 28OVRDTA
     A            D7            30A  B 13 40DSPATR(PR)
     A                                      OVRDTA
     A            SS             2A  B 13 72DSPATR(PR)
     A                                      OVRDTA
     A            ST             2A  B 13 75DSPATR(PR)
     A                                      OVRDTA
     A            SU             2A  B 13 78DSPATR(PR)
     A                                      OVRDTA
     A            R8             2A  B 14  3DSPATR(PR)
     A                                      OVRDTA
     A            C8             4A  B 14  9DSPATR(PR)
     A                                      OVRDTA
     A            E8             6A  B 14 16DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 14 25DSPATR(PR)
     A                                      OVRDTA
     A            W8            11A  B 14 28OVRDTA
     A            D8            30A  B 14 40DSPATR(PR)
     A                                      OVRDTA
     A            SV             2A  B 14 72DSPATR(PR)
     A                                      OVRDTA
     A            SW             2A  B 14 75DSPATR(PR)
     A                                      OVRDTA
     A            SX             2A  B 14 78DSPATR(PR)
     A                                      OVRDTA
     A            R9             2A  B 15  3DSPATR(PR)
     A                                      OVRDTA
     A            C9             4A  B 15  9DSPATR(PR)
     A                                      OVRDTA
     A            E9             6A  B 15 16DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 15 25DSPATR(PR)
     A                                      OVRDTA
     A            W9            11A  B 15 28OVRDTA
     A            D9            30A  B 15 40DSPATR(PR)
     A                                      OVRDTA
     A            SY             2A  B 15 72DSPATR(PR)
     A                                      OVRDTA
     A            SZ             2A  B 15 75DSPATR(PR)
     A                                      OVRDTA
     A            SAA            2A  B 15 78DSPATR(PR)
     A                                      OVRDTA
     A            R0             2A  B 16  3DSPATR(PR)
     A                                      OVRDTA
     A            C0             4A  B 16  9DSPATR(PR)
     A                                      OVRDTA
     A            E0             6A  B 16 16DSPATR(PR)
     A                                      OVRDTA
     A            J              1A  B 16 25DSPATR(PR)
     A                                      OVRDTA
     A            W0            11A  B 16 28OVRDTA
     A            D0            30A  B 16 40DSPATR(PR)
     A                                      OVRDTA
     A            SBB            2A  B 16 72DSPATR(PR)
     A                                      OVRDTA
     A            SCC            2A  B 16 75DSPATR(PR)
     A                                      OVRDTA
     A            SDD            2A  B 16 78DSPATR(PR)
     A                                      OVRDTA
     A            RA             2A  B 17  3DSPATR(PR)
     A                                      OVRDTA
     A            CA             4A  B 17  9DSPATR(PR)
     A                                      OVRDTA
     A            EA             6A  B 17 16DSPATR(PR)
     A                                      OVRDTA
     A            K              1A  B 17 25DSPATR(PR)
     A                                      OVRDTA
     A            WA            11A  B 17 28OVRDTA
     A            DA            30A  B 17 40DSPATR(PR)
     A                                      OVRDTA
     A            SEE            2A  B 17 72DSPATR(PR)
     A                                      OVRDTA
     A            SFF            2A  B 17 75DSPATR(PR)
     A                                      OVRDTA
     A            SGG            2A  B 17 78DSPATR(PR)
     A                                      OVRDTA
     A            RB             2A  B 18  3DSPATR(PR)
     A                                      OVRDTA
     A            CB             4A  B 18  9DSPATR(PR)
     A                                      OVRDTA
     A            EB             6A  B 18 16DSPATR(PR)
     A                                      OVRDTA
     A            L              1A  B 18 25DSPATR(PR)
     A                                      OVRDTA
     A            WB            11A  B 18 28OVRDTA
     A            DB            30A  B 18 40DSPATR(PR)
     A                                      OVRDTA
     A            SHH            2A  B 18 72DSPATR(PR)
     A                                      OVRDTA
     A            SII            2A  B 18 75DSPATR(PR)
     A                                      OVRDTA
     A            SJJ            2A  B 18 78DSPATR(PR)
     A                                      OVRDTA
     A            RC             2A  B 19  3DSPATR(PR)
     A                                      OVRDTA
     A            CC             4A  B 19  9DSPATR(PR)
     A                                      OVRDTA
     A            EC             6A  B 19 16DSPATR(PR)
     A                                      OVRDTA
     A            M              1A  B 19 25DSPATR(PR)
     A                                      OVRDTA
     A            WC            11A  B 19 28OVRDTA
     A            DC            30A  B 19 40DSPATR(PR)
     A                                      OVRDTA
     A            SKK            2A  B 19 72DSPATR(PR)
     A                                      OVRDTA
     A            SLL            2A  B 19 75DSPATR(PR)
     A                                      OVRDTA
     A            SMM            2A  B 19 78DSPATR(PR)
     A                                      OVRDTA
     A            RD             2A  B 20  3DSPATR(PR)
     A                                      OVRDTA
     A            CD             4A  B 20  9DSPATR(PR)
     A                                      OVRDTA
     A            ED             6A  B 20 16DSPATR(PR)
     A                                      OVRDTA
     A            N              1A  B 20 25DSPATR(PR)
     A                                      OVRDTA
     A            WD            11A  B 20 28OVRDTA
     A            DD            30A  B 20 40DSPATR(PR)
     A                                      OVRDTA
     A            SNN            2A  B 20 72DSPATR(PR)
     A                                      OVRDTA
     A            SOO            2A  B 20 75DSPATR(PR)
     A                                      OVRDTA
     A            SPP            2A  B 20 78DSPATR(PR)
     A                                      OVRDTA
     A                                 21  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                 22  2'Type a character by the WO number -
     A                                      - Press ''ENTER'' to VIEW, or F4 to-
     A                                       CHANGE, or'
     A                                 23  2'F5 to IP onto, the Workorder.   Pr-
     A                                      ess the ''ENTER'' key to view addit-
     A                                      ional data.'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F1=CHANGE SORT KEY   F3=EXIT  -
     A                                       F4=CHANGE WO   PRESS "ENTER" FOR N-
     A                                      EXT SCREEN')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VBBGETCC
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  8'-----------------------------------
     A                                      --------------------------------'
     A                                  2  1'--------'
     A                                  2 16'M M I S   S Y S T E M   B U L L E'
     A                                  2 50'T I N   B O A R D      -------'
     A                                  3  1':      ----------------------------
     A                                      ------------------------------------
     A                                      ----      '
     A                                  4  1':'
     A                                  4 16':'
     A                                  4 65':'
     A                                  5  1':'
     A                                  5 16'-----------------------------------
     A                                      ----------------'
     A                                  6  1':'
     A                                  7  1':'
     A                                  8  1':'
     A                                  9  1':'
     A                                  9 13'Please enter your Clock Card Numbe-
     A                                      r to determine if there'
     A                                 10  1':'
     A                                 11  1':'
     A                                 11 14'are any Distribution Lists on whic-
     A                                      h you are identified.'
     A                                 12  1':'
     A                                 13  1':'
     A                                 14  1':'
     A                                 14 28'Clock Card Number:'
     A                                 15  1':'
     A                                 16  1':'
     A                                 17  1':'
     A                                 18  1':'
     A                                 19  1':'
     A                                 19 24'Enter data and press "ENTER" key.'
     A                                 20  1':'
     A                                 21  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 22  1':'
     A                                 23  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            LOCA          40A  B  4 21DSPATR(PR)
     A                                      OVRDTA
     A            CCNO           4A  B 14 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI PC)
     A            HELPLINE      70A  B 22  5DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN TO MENU f3-EXIT P-
     A                                      ROGRAM                             -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VBBOARD
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  8'-----------------------------------
     A                                      --------------------------------'
     A                                  2  1'--------'
     A                                  2 16'M M I S   S Y S T E M   B U L L E'
     A                                  2 50'T I N   B O A R D      -------'
     A                                  3  1':      ----------------------------
     A                                      ------------------------------------
     A                                      ----      '
     A                                  4  1':'
     A                                  4 16':'
     A                                  4 65':'
     A                                  5  1':'
     A                                  5 16'-----------------------------------
     A                                      ----------------'
     A                                  6  1':'
     A                                  6 10'-----------------------------------
     A                                      --------------------------'
     A                                  7  1':'
     A                                  7 10'.    DATE:'
     A                                  7 50'TIME:'
     A                                  7 69'.'
     A                                  8  1':'
     A                                  8 10'-----------------------------------
     A                                      --------------------------'
     A                                  9  1':'
     A                                 10  1':'
     A                                 11  1':'
     A                                 12  1':'
     A                                 13  1':'
     A                                 14  1':'
     A                                 15  1':'
     A                                 16  1':'
     A                                 17  1':'
     A                                 18  1':'
     A                                 19  1':'
     A                                 19 49'Distribution Code:'
     A                                 20  1':'
     A                                 20 24'PRESS "ENTER" KEY FOR NEXT RECORD'
     A                                 21  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 22  1':'
     A                                 23  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            LOCA          40A  B  4 21DSPATR(PR)
     A                                      OVRDTA
     A            DATELINE      18A  B  7 22DSPATR(PR)
     A                                      OVRDTA
     A            TIMELINE       8A  B  7 57DSPATR(PR)
     A                                      OVRDTA
     A            R1            70A  B  9  5DSPATR(PR)
     A                                      OVRDTA
     A            R2            70A  B 10  5DSPATR(PR)
     A                                      OVRDTA
     A            R3            70A  B 11  5DSPATR(PR)
     A                                      OVRDTA
     A            R4            70A  B 12  5DSPATR(PR)
     A                                      OVRDTA
     A            R5            70A  B 13  5DSPATR(PR)
     A                                      OVRDTA
     A            R6            70A  B 14  5DSPATR(PR)
     A                                      OVRDTA
     A            R7            70A  B 15  5DSPATR(PR)
     A                                      OVRDTA
     A            R8            70A  B 16  5DSPATR(PR)
     A                                      OVRDTA
     A            R9            70A  B 17  5DSPATR(PR)
     A                                      OVRDTA
     A            R0            70A  B 18  5DSPATR(PR)
     A                                      OVRDTA
     A            DISTCD         6A  B 19 69DSPATR(PR)
     A                                      OVRDTA
     A            HELPLINE      70A  B 22  5DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN TO MENU f3-EXIT P-
     A                                      ROGRAM                             -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VCHNGWO
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  9'-----------------------------------
     A                                      -------------------------------'
     A                                  2  9':  C H A N G E   V E R B A L   W O'
     A                                  2 44'R K O R D E R   S C R E E N  :'
     A                                  3  9'-----------------------------------
     A                                      -------------------------------'
     A                                  5  1'W/O NUM:'
     A                                  5 24'W/O STATUS:'
     A                                  5 42'TYPE:'
     A                                  5 54'DATE RECD:'
     A                                  7  1'APPROVAL:'
     A                                  7 27'REQUESTER:'
     A                                  7 63'EQUIP NUM:'
     A                                  9  1'EQUIPMENT NAME:'
     A                                 11  1'DEPT:'
     A                                 11 19'MAINT ZONE:'
     A                                 11 44'LOCATION:'
     A                                 11 69'PRIORITY:'
     A                                 13  1'EQUIP DOWN:'
     A                                 13 25'CRAFT REQD:'
     A                                 13 61'EXP CLASS:'
     A                                 15  1'DESCRIPTION:'
     A                                 19  1'CRAFTSMEN:'
     A                                 19 54'TIME STRT:'
     A            WONUM         10A  B  5 10DSPATR(PR)
     A                                      OVRDTA
     A            ST             2A  B  5 36DSPATR(PR)
     A                                      OVRDTA
     A            TP             2A  B  5 48DSPATR(PR)
     A                                      OVRDTA
     A            MR             2A  B  5 65DSPATR(PR)
     A                                      OVRDTA
     A            DR             2A  B  5 68DSPATR(PR)
     A                                      OVRDTA
     A            YR             2A  B  5 71DSPATR(PR)
     A                                      OVRDTA
     A            RM             2A  B  5 75DSPATR(PR)
     A                                      OVRDTA
     A            HR             2A  B  5 78DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  7 11DSPATR(PR)
     A                                      OVRDTA
     A            REQEST        16A  B  7 38DSPATR(PR)
     A                                      OVRDTA
     A            EQPNUM         6A  B  7 74DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI PC)
     A            EQPNAME       50A  B  9 17DSPATR(PR)
     A                                      OVRDTA
     A            TYPNUM         8A  B  9 71DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B 11  7DSPATR(PR)
     A                                      OVRDTA
     A            ZONE           4A  B 11 31DSPATR(PR)
     A                                      OVRDTA
     A            LOC            8A  B 11 54DSPATR(PR)
     A                                      OVRDTA
     A            P              1A  B 11 79DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI PC)
     A            D              1A  B 13 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI PC)
     A            C1             2A  B 13 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI PC)
     A            C2             2A  B 13 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI PC)
     A            C3             2A  B 13 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI PC)
     A            EXPCL          8A  B 13 72DSPATR(PR)
     A                                      OVRDTA
     A            DESC30        30A  B 15 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI PC)
     A            DESC661       66A  B 16 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI PC)
     A            DESC662       66A  B 17 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI PC)
     A            CFT1           4A  B 19 12DSPATR(PR)
     A                                      OVRDTA
     A            CFT2           4A  B 19 18DSPATR(PR)
     A                                      OVRDTA
     A            CFT3           4A  B 19 24DSPATR(PR)
     A                                      OVRDTA
     A            MS             2A  B 19 65DSPATR(PR)
     A                                      OVRDTA
     A            DS             2A  B 19 68DSPATR(PR)
     A                                      OVRDTA
     A            YS             2A  B 19 71DSPATR(PR)
     A                                      OVRDTA
     A            SM             2A  B 19 75DSPATR(PR)
     A                                      OVRDTA
     A            HS             2A  B 19 78DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN f3-EXIT PROGRAM  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VCURRWO
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 11'==================================-
     A                                      =========================='
     A                                  3 11':  CURRENT WORK ORDER ASSIGNMENT F-
     A                                      OR A SPECIFIC CRAFTSMAN  :'
     A                                  4 11'==================================-
     A                                      =========================='
     A                                  6 30'CLOCK CARD #:'
     A                                  8  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A                                  9  1':'
     A                                  9 79':'
     A                                 10  1':   CLOCK CARD NUMBER:'
     A                                 10 37'CRAFTSMAN"S NAME:'
     A                                 10 79':'
     A                                 11  1':'
     A                                 11 79':'
     A                                 12  1':   WO #:'
     A                                 12 31'EQUIPMENT #:'
     A                                 12 56'LOCATION:'
     A                                 12 79':'
     A                                 13  1':'
     A                                 13 79':'
     A                                 14  1':   DESCRIPTION:'
     A                                 14 79':'
     A                                 15  1':'
     A                                 15 79':'
     A                                 16  1':'
     A                                 16 79':'
     A                                 17  1':'
     A                                 17 79':'
     A                                 18  1':'
     A                                 18 79':'
     A                                 19  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A                                 20  5'"*" INDICATES A PLANNED WORK ORDER'
     A                                 22 24'INPUT CC # AND PRESS "ENTER" KEY'
     A            CNUM           4A  B  6 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI PC)
     A            CC             4A  B 10 25DSPATR(PR)
     A                                      OVRDTA
     A            CNAM          16A  B 10 56DSPATR(PR)
     A                                      OVRDTA
     A            P             11A  B 12 11DSPATR(PR)
     A                                      OVRDTA
     A            ENUM           6A  B 12 45DSPATR(PR)
     A                                      OVRDTA
     A            ELOC           8A  B 12 67DSPATR(PR)
     A                                      OVRDTA
     A            DES1          30A  B 15  7DSPATR(PR)
     A                                      OVRDTA
     A            DES2          66A  B 16  7DSPATR(PR)
     A                                      OVRDTA
     A            DES3          66A  B 17  7DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN TO MENU f3-EXIT P-
     A                                      ROGRAM                             -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VCURRWOS
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 11'==================================-
     A                                      ========================='
     A                                  2 11':  CURRENT WORK ORDER ASSIGNMENT F-
     A                                      OR ZONE'
     A                                  2 58'CRAFTSMEN  :'
     A                                  3 11'==================================-
     A                                      ========================='
     A                                  4  1'==================================-
     A                                      ===================================-
     A                                      ==========='
     A                                  5  3'CC #'
     A                                  5 14'NAME'
     A                                  5 28'WO NUM   EQUIP  LOCATION'
     A                                  5 61'DESCRIPTION'
     A                                  6  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A                                 22  6'+ Indicates Temporary Assignment'
     A                                 22 45'* Indicates Planned Workorder'
     A                                 23  3'TAB TO LINE OF WO TO VIEW - PLACE -
     A                                      A CHARACTER AT THE TAB AND PRESS "E-
     A                                      NTER"'
     A            Z1             4A  B  2 53DSPATR(PR)
     A                                      OVRDTA
     A            F1            79A  B  7  1OVRDTA
     A            F2            79A  B  8  1OVRDTA
     A            F3            79A  B  9  1OVRDTA
     A            F4            79A  B 10  1OVRDTA
     A            F5            79A  B 11  1OVRDTA
     A            F6            79A  B 12  1OVRDTA
     A            F7            79A  B 13  1OVRDTA
     A            F8            79A  B 14  1OVRDTA
     A            F9            79A  B 15  1OVRDTA
     A            F10           79A  B 16  1OVRDTA
     A            F11           79A  B 17  1OVRDTA
     A            F12           79A  B 18  1OVRDTA
     A            F13           79A  B 19  1OVRDTA
     A            F14           79A  B 20  1OVRDTA
     A            F15           79A  B 21  1OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN f2-CHANGE f3-EXIT-
     A                                       PROGRAM f4-AUTO-QUEUE  f5-SPECIFIC-
     A                                       CC NUMBER      ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VWOIPINQ
     A*%%TS  DD  19950406  124610  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 11'==================================-
     A                                      ========================='
     A                                  2 11':      WORKORDERS IN-PROGRESS BY Z-
     A                                      ONE'
     A            Z1             4A  B  2 49DSPATR(PR)
     A                                      OVRDTA
     A                                  2 54'CRAFTSMEN      :'
     A                                  3 11'==================================-
     A                                      ========================='
     A                                  4  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A                                  5  3'CC #'
     A                                  5  9'NAME'
     A                                  5 27'WO NUM      EQUIP'
     A                                  5 47'DESCRIPTION'
     A                                  6  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A            F1            79A  B  7  1OVRDTA
     A            F2            79A  B  8  1OVRDTA
     A            F3            79A  B  9  1OVRDTA
     A            F4            79A  B 10  1OVRDTA
     A            F5            79A  B 11  1OVRDTA
     A            F6            79A  B 12  1OVRDTA
     A            F7            79A  B 13  1OVRDTA
     A            F8            79A  B 14  1OVRDTA
     A            F9            79A  B 15  1OVRDTA
     A            F10           79A  B 16  1OVRDTA
     A            F11           79A  B 17  1OVRDTA
     A            F12           79A  B 18  1OVRDTA
     A            F13           79A  B 19  1OVRDTA
     A            F14           79A  B 20  1OVRDTA
     A            F15           79A  B 21  1OVRDTA
     A            F16           79A  B 22  1OVRDTA
     A                                 23  7'PRESS "ENTER" FOR NEXT PAGE'
     A                                 23 65'F3 - EXIT'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN f2-CHANGE f3-EXIT-
     A                                       PROGRAM f4-AUTO-QUEUE  f5-SPECIFIC-
     A                                       CC NUMBER      ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VCURRWOSC
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 11'==================================-
     A                                      ========================='
     A                                  2 11':  CURRENT WORK ORDER ASSIGNMENT F-
     A                                      OR ZONE'
     A                                  2 58'CRAFTSMEN  :'
     A                                  3 11'==================================-
     A                                      ========================='
     A                                  4  1'==================================-
     A                                      ===================================-
     A                                      ==========='
     A                                  5  3'CC #'
     A                                  5 14'NAME'
     A                                  5 28'WO NUM   EQUIP  LOCATION'
     A                                  5 61'DESCRIPTION'
     A                                  6  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A                                 22  1'==================================-
     A                                      ===================================-
     A                                      =========='
     A                                 23  1'+ Indicates Temporary Assignment'
     A                                 23 51'* Indicates Planned Workorder'
     A            Z1             4A  B  2 53DSPATR(PR)
     A                                      OVRDTA
     A            F1            79A  B  7  1OVRDTA
     A            F2            79A  B  8  1OVRDTA
     A            F3            79A  B  9  1OVRDTA
     A            F4            79A  B 10  1OVRDTA
     A            F5            79A  B 11  1OVRDTA
     A            F6            79A  B 12  1OVRDTA
     A            F7            79A  B 13  1OVRDTA
     A            F8            79A  B 14  1OVRDTA
     A            F9            79A  B 15  1OVRDTA
     A            F10           79A  B 16  1OVRDTA
     A            F11           79A  B 17  1OVRDTA
     A            F12           79A  B 18  1OVRDTA
     A            F13           79A  B 19  1OVRDTA
     A            F14           79A  B 20  1OVRDTA
     A            F15           79A  B 21  1OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN f2-CHANGE ZONE f4-
     A                                      -AUTO-QUEUE f5-SPECIFIC CC f3-EXIT -
     A                                       f8-CHANGE CREW')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VGETCREW
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 79':'
     A                                  3  2':'
     A                                  3 79':'
     A                                  4  2':'
     A                                  4 79':'
     A                                  5  2':'
     A                                  5 79':'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 19'-----------------------------------
     A                                      -------'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 19':'
     A                                 18 59':'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 19':'
     A                                 19 59':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 19':'
     A                                 20 59':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 19'-----------------------------------
     A                                      -------'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A            C              1A  B 19 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VGETCRFT
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 79':'
     A                                  3  2':'
     A                                  3 79':'
     A                                  4  2':'
     A                                  4 79':'
     A                                  5  2':'
     A                                  5 79':'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 18'-----------------------------------
     A                                      --------'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 18':'
     A                                 18 59':'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 18':'
     A                                 19 59':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 18':'
     A                                 20 59':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 18'-----------------------------------
     A                                      --------'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A            CR             2A  B 19 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VGETZONE
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 79':'
     A                                  3  2':'
     A                                  3 79':'
     A                                  4  2':'
     A                                  4 79':'
     A                                  5  2':'
     A                                  5 79':'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 18'-----------------------------------
     A                                      --------'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 18':'
     A                                 18 59':'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 18':'
     A                                 19 59':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 18':'
     A                                 20 59':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 18'-----------------------------------
     A                                      --------'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A            ZONE           4A  B 19 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VPASWORD
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  1'****  PASSWORD REQUIRED  ****'
     A                                  4  2'PROGRAM:'
     A                                  6  5'USER:'
     A                                  8  1'TERMINAL:'
     A                                 12 32'AND PRESS "ENTER" KEY.'
     A            PROGNAME       8A  B  4 12DSPATR(PR)
     A                                      OVRDTA
     A            SG             8A  B  6 12DSPATR(PR)
     A                                      OVRDTA
     A            TERM           4A  B  8 12DSPATR(PR)
     A                                      OVRDTA
     A            INP1          16A  B 10 20DSPATR(PR)
     A                                      OVRDTA
     A            EP            17A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            PASSWORD       8A  B 12 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI PC)
     A            ER            40A  B 16  5DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VPMQUEUE
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  4'P M   O P E N   W O R K O R D E R'
     A                                  2 40'Q U E U E   F O R'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2'QUEUE'
     A                                  4 71'DATE'
     A                                  5  2'FACTOR   WORKORDER     EQUIP.    D-
     A                                      ESCRIPTION'
     A                                  5 69'RELEASED'
     A                                  6  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                 21  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                 22  2'TO DISPLAY A WORKORDER, TYPE ANY C-
     A                                      HARACTER BEFORE THE NUMBER AND PRES-
     A                                      S "ENTER".'
     A                                 23 17'PRESS THE "ENTER" KEY TO VIEW ADDI-
     A                                      TIONAL SCREENS.'
     A            ZONECRAFT     21A  B  2 60DSPATR(PR)
     A                                      OVRDTA
     A            Q1             2A  B  7  4DSPATR(PR)
     A                                      OVRDTA
     A            W1            11A  B  7 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI PC)
     A            E1             6A  B  7 25DSPATR(PR)
     A                                      OVRDTA
     A            D1            30A  B  7 35DSPATR(PR)
     A                                      OVRDTA
     A            R1             8A  B  7 69DSPATR(PR)
     A                                      OVRDTA
     A            Q2             2A  B  8  4DSPATR(PR)
     A                                      OVRDTA
     A            W2            11A  B  8 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI PC)
     A            E2             6A  B  8 25DSPATR(PR)
     A                                      OVRDTA
     A            D2            30A  B  8 35DSPATR(PR)
     A                                      OVRDTA
     A            R2             8A  B  8 69DSPATR(PR)
     A                                      OVRDTA
     A            Q3             2A  B  9  4DSPATR(PR)
     A                                      OVRDTA
     A            W3            11A  B  9 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI PC)
     A            E3             6A  B  9 25DSPATR(PR)
     A                                      OVRDTA
     A            D3            30A  B  9 35DSPATR(PR)
     A                                      OVRDTA
     A            R3             8A  B  9 69DSPATR(PR)
     A                                      OVRDTA
     A            Q4             2A  B 10  4DSPATR(PR)
     A                                      OVRDTA
     A            W4            11A  B 10 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI PC)
     A            E4             6A  B 10 25DSPATR(PR)
     A                                      OVRDTA
     A            D4            30A  B 10 35DSPATR(PR)
     A                                      OVRDTA
     A            R4             8A  B 10 69DSPATR(PR)
     A                                      OVRDTA
     A            Q5             2A  B 11  4DSPATR(PR)
     A                                      OVRDTA
     A            W5            11A  B 11 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI PC)
     A            E5             6A  B 11 25DSPATR(PR)
     A                                      OVRDTA
     A            D5            30A  B 11 35DSPATR(PR)
     A                                      OVRDTA
     A            R5             8A  B 11 69DSPATR(PR)
     A                                      OVRDTA
     A            Q6             2A  B 12  4DSPATR(PR)
     A                                      OVRDTA
     A            W6            11A  B 12 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  52                                  DSPATR(RI PC)
     A            E6             6A  B 12 25DSPATR(PR)
     A                                      OVRDTA
     A            D6            30A  B 12 35DSPATR(PR)
     A                                      OVRDTA
     A            R6             8A  B 12 69DSPATR(PR)
     A                                      OVRDTA
     A            Q7             2A  B 13  4DSPATR(PR)
     A                                      OVRDTA
     A            W7            11A  B 13 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(RI PC)
     A            E7             6A  B 13 25DSPATR(PR)
     A                                      OVRDTA
     A            D7            30A  B 13 35DSPATR(PR)
     A                                      OVRDTA
     A            R7             8A  B 13 69DSPATR(PR)
     A                                      OVRDTA
     A            Q8             2A  B 14  4DSPATR(PR)
     A                                      OVRDTA
     A            W8            11A  B 14 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  77                                  DSPATR(RI PC)
     A            E8             6A  B 14 25DSPATR(PR)
     A                                      OVRDTA
     A            D8            30A  B 14 35DSPATR(PR)
     A                                      OVRDTA
     A            R8             8A  B 14 69DSPATR(PR)
     A                                      OVRDTA
     A            Q9             2A  B 15  4DSPATR(PR)
     A                                      OVRDTA
     A            W9            11A  B 15 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  86                                  DSPATR(RI PC)
     A            E9             6A  B 15 25DSPATR(PR)
     A                                      OVRDTA
     A            D9            30A  B 15 35DSPATR(PR)
     A                                      OVRDTA
     A            R9             8A  B 15 69DSPATR(PR)
     A                                      OVRDTA
     A            Q0             2A  B 16  4DSPATR(PR)
     A                                      OVRDTA
     A            W0            11A  B 16 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  95                                  DSPATR(RI PC)
     A            E0             6A  B 16 25DSPATR(PR)
     A                                      OVRDTA
     A            D0            30A  B 16 35DSPATR(PR)
     A                                      OVRDTA
     A            R0             8A  B 16 69DSPATR(PR)
     A                                      OVRDTA
     A            QA             2A  B 17  4DSPATR(PR)
     A                                      OVRDTA
     A            WA            11A  B 17 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI PC)
     A            EA             6A  B 17 25DSPATR(PR)
     A                                      OVRDTA
     A            DA            30A  B 17 35DSPATR(PR)
     A                                      OVRDTA
     A            RA             8A  B 17 69DSPATR(PR)
     A                                      OVRDTA
     A            QB             2A  B 18  4DSPATR(PR)
     A                                      OVRDTA
     A            WB            11A  B 18 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI PC)
     A            EB             6A  B 18 25DSPATR(PR)
     A                                      OVRDTA
     A            DB            30A  B 18 35DSPATR(PR)
     A                                      OVRDTA
     A            RB             8A  B 18 69DSPATR(PR)
     A                                      OVRDTA
     A            QC             2A  B 19  4DSPATR(PR)
     A                                      OVRDTA
     A            WC            11A  B 19 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI PC)
     A            EC             6A  B 19 25DSPATR(PR)
     A                                      OVRDTA
     A            DC            30A  B 19 35DSPATR(PR)
     A                                      OVRDTA
     A            RC             8A  B 19 69DSPATR(PR)
     A                                      OVRDTA
     A            QD             2A  B 20  4DSPATR(PR)
     A                                      OVRDTA
     A            WD            11A  B 20 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI PC)
     A            ED             6A  B 20 25DSPATR(PR)
     A                                      OVRDTA
     A            DD            30A  B 20 35DSPATR(PR)
     A                                      OVRDTA
     A            RD             8A  B 20 69DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-CHANGE SORT KEY f3-GO TO-
     A                                       MENU                              -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VRELWO
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 11'-----------------------------------
     A                                      -------------------'
     A                                  2 11':   R E L E A S E   H E L D   W O'
     A                                  2 45'R K O R D E R S   :'
     A                                  3 11'-----------------------------------
     A                                      -------------------'
     A                                  5 25'Workorder Number:'
     A                                  6  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  7  1'.'
     A                                  7 79'.'
     A                                  8  1'.  WO #:'
     A                                  8 23'STATUS:'
     A                                  8 37'EQUIPMENT #:'
     A                                  8 59'LOCATION:'
     A                                  8 79'.'
     A                                  9  1'.'
     A                                  9 79'.'
     A                                 10  1'.   DESCRIPTION:'
     A                                 10 79'.'
     A                                 11  1'.'
     A                                 11 79'.'
     A                                 12  1'.'
     A                                 12 79'.'
     A                                 13  1'.'
     A                                 13 79'.'
     A                                 14  1'.'
     A                                 14 79'.'
     A                                 15  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 17 19'Input Work Order Number and Press'
     A                                 17 53'"ENTER" key'
     A                                 19  6'After identifying correct Work Ord-
     A                                      er, Press "f2" key to allow Work Or-
     A                                      der'
     A                                 20  6'to be automatically assigned.'
     A            WO            10A  B  5 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI PC)
     A            SUF           10A  B  8 10DSPATR(PR)
     A                                      OVRDTA
     A            ST             2A  B  8 31DSPATR(PR)
     A                                      OVRDTA
     A            ENUM           6A  B  8 50DSPATR(PR)
     A                                      OVRDTA
     A            ELOC           8A  B  8 69DSPATR(PR)
     A                                      OVRDTA
     A            DES1          30A  B 11  7DSPATR(PR)
     A                                      OVRDTA
     A            DES2          66A  B 12  7DSPATR(PR)
     A                                      OVRDTA
     A            DES3          66A  B 13  7DSPATR(PR)
     A                                      OVRDTA
     A            MSG           76A  B 22  3DSPATR(PR)
     A                                      OVRDTA
     A                                 24  1'f1-RETURN TO MENU  f3-EXIT PROGRAM'
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VSELECTQ
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  3 10'-----------------------------------
     A                                      -----------------------'
     A                                  4 10': S E L E C T   O P E N   W O R K'
     A                                  4 44'O R D E R   Q U E U E :'
     A                                  5 10'-----------------------------------
     A                                      -----------------------'
     A                                  9 32'ZONE:'
     A                                 11 19'CLOCK CARD NUMBER:'
     A                                 13 15'PRIMARY SKILL (CRAFT):'
     A                                 15 20'EQUIPMENT NUMBER:'
     A                                 18 12'NOTE:  Either ZONE or CLOCK CARD o-
     A                                      r CRAFT is required.'
     A                                 21 17'ENTER SELECTION DATA AND PRESS "EN-
     A                                      TER" KEY'
     A            ZONE           4A  B  9 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI PC)
     A            CNUM           4A  B 11 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI PC)
     A            SK             2A  B 13 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI PC)
     A            EQPNUM         6A  B 15 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN TO MENU f5-MMIS P-
     A                                      M QUEUE f3-EXIT PROGRAM            -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VSHOWQUEUE
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 15'-----------------------------------
     A                                      -------------'
     A                                  2 15':   O P E N   W O R K O R D E R'
     A                                  2 49'Q U E U E   :'
     A                                  3 15'-----------------------------------
     A                                      -------------'
     A                                  4  1'QUEUE'
     A                                  5  1'FACTOR  CC #   EQUIP  DOWN  WO NUM-
     A                                      BER  DESCRIPTION'
     A                                  5 73'SKILLS'
     A                                 21 21'PRESS "ENTER" KEY TO CONTINUE VIEW-
     A                                      ING'
     A                                 22 12'TO CHANGE DATA - ENTER NEW DATA AN-
     A                                      D PRESS "ENTER" KEY'
     A            R1             2A  B  7  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI PC)
     A            C1             4A  B  7  9DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI PC)
     A            E1             6A  B  7 16DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  7 25DSPATR(PR)
     A                                      OVRDTA
     A            W1            10A  B  7 29DSPATR(PR)
     A                                      OVRDTA
     A            D1            30A  B  7 40DSPATR(PR)
     A                                      OVRDTA
     A            SA             2A  B  7 72DSPATR(PR)
     A                                      OVRDTA
     A            SB             2A  B  7 75DSPATR(PR)
     A                                      OVRDTA
     A            SC             2A  B  7 78DSPATR(PR)
     A                                      OVRDTA
     A            R2             2A  B  9  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI PC)
     A            C2             4A  B  9  9DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI PC)
     A            E2             6A  B  9 16DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B  9 25DSPATR(PR)
     A                                      OVRDTA
     A            W2            10A  B  9 29DSPATR(PR)
     A                                      OVRDTA
     A            D2            30A  B  9 40DSPATR(PR)
     A                                      OVRDTA
     A            SD             2A  B  9 72DSPATR(PR)
     A                                      OVRDTA
     A            SE             2A  B  9 75DSPATR(PR)
     A                                      OVRDTA
     A            SF             2A  B  9 78DSPATR(PR)
     A                                      OVRDTA
     A            R3             2A  B 11  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI PC)
     A            C3             4A  B 11  9DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI PC)
     A            E3             6A  B 11 16DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 11 25DSPATR(PR)
     A                                      OVRDTA
     A            W3            10A  B 11 29DSPATR(PR)
     A                                      OVRDTA
     A            D3            30A  B 11 40DSPATR(PR)
     A                                      OVRDTA
     A            SG             2A  B 11 72DSPATR(PR)
     A                                      OVRDTA
     A            SH             2A  B 11 75DSPATR(PR)
     A                                      OVRDTA
     A            SI             2A  B 11 78DSPATR(PR)
     A                                      OVRDTA
     A            R4             2A  B 13  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI PC)
     A            C4             4A  B 13  9DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI PC)
     A            E4             6A  B 13 16DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 13 25DSPATR(PR)
     A                                      OVRDTA
     A            W4            10A  B 13 29DSPATR(PR)
     A                                      OVRDTA
     A            D4            30A  B 13 40DSPATR(PR)
     A                                      OVRDTA
     A            SJ             2A  B 13 72DSPATR(PR)
     A                                      OVRDTA
     A            SK             2A  B 13 75DSPATR(PR)
     A                                      OVRDTA
     A            SL             2A  B 13 78DSPATR(PR)
     A                                      OVRDTA
     A            R5             2A  B 15  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI PC)
     A            C5             4A  B 15  9DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  42                                  DSPATR(RI PC)
     A            E5             6A  B 15 16DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 15 25DSPATR(PR)
     A                                      OVRDTA
     A            W5            10A  B 15 29DSPATR(PR)
     A                                      OVRDTA
     A            D5            30A  B 15 40DSPATR(PR)
     A                                      OVRDTA
     A            SM             2A  B 15 72DSPATR(PR)
     A                                      OVRDTA
     A            SN             2A  B 15 75DSPATR(PR)
     A                                      OVRDTA
     A            SO             2A  B 15 78DSPATR(PR)
     A                                      OVRDTA
     A            R6             2A  B 17  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  49                                  DSPATR(RI PC)
     A            C6             4A  B 17  9DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(RI PC)
     A            E6             6A  B 17 16DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 17 25DSPATR(PR)
     A                                      OVRDTA
     A            W6            10A  B 17 29DSPATR(PR)
     A                                      OVRDTA
     A            D6            30A  B 17 40DSPATR(PR)
     A                                      OVRDTA
     A            SP             2A  B 17 72DSPATR(PR)
     A                                      OVRDTA
     A            SQ             2A  B 17 75DSPATR(PR)
     A                                      OVRDTA
     A            SR             2A  B 17 78DSPATR(PR)
     A                                      OVRDTA
     A            R7             2A  B 19  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  57                                  DSPATR(RI PC)
     A            C7             4A  B 19  9DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  58                                  DSPATR(RI PC)
     A            E7             6A  B 19 16DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 19 25DSPATR(PR)
     A                                      OVRDTA
     A            W7            10A  B 19 29DSPATR(PR)
     A                                      OVRDTA
     A            D7            30A  B 19 40DSPATR(PR)
     A                                      OVRDTA
     A            SS             2A  B 19 72DSPATR(PR)
     A                                      OVRDTA
     A            ST             2A  B 19 75DSPATR(PR)
     A                                      OVRDTA
     A            SU             2A  B 19 78DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN TO MENU f2-ANOTHE-
     A                                      R SELECT f8-RE-SORT CHANGES f4-REPE-
     A                                      AT SELECT f3-EXIT')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VSTARTUP
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  3'-----------------------------------
     A                                      ------------------------------------
     A                                      --------'
     A                                  2  3':  M U L T I P L E   C R A F T   S'
     A                                  2 38'T A R T  (IP)   I N P U T   S C R'
     A                                  2 72'E E N  :'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      --------'
     A                                  4 26'CC #    W/O NUM-SEQ'
     A                                  5 53'A "D" in the first'
     A                                  6  5'---------------'
     A                                  6 53'position of the Work'
     A                                  7  5'. START TIME: .'
     A                                  7 53'Order will duplicate'
     A                                  8  5'.'
     A                                  8 19'.'
     A                                  8 53'the number directly'
     A                                  9  5'.'
     A                                  9 19'.'
     A                                  9 53'above.'
     A                                 10  5'---------------'
     A            CCNUM1         4A  B  5 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI PC)
     A            WO1            7A  B  5 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI PC)
     A            SEQ1           3A  B  5 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI PC)
     A            CCNUM2         4A  B  7 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI PC)
     A            WO2            7A  B  7 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI PC)
     A            SEQ2           3A  B  7 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI PC)
     A            STIM           4A  B  9 10DSPATR(PR)
     A                                      OVRDTA
     A            CCNUM3         4A  B  9 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI PC)
     A            WO3            7A  B  9 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI PC)
     A            SEQ3           3A  B  9 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI PC)
     A            CCNUM4         4A  B 11 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI PC)
     A            WO4            7A  B 11 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI PC)
     A            SEQ4           3A  B 11 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI PC)
     A            CCNUM5         4A  B 13 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI PC)
     A            WO5            7A  B 13 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI PC)
     A            SEQ5           3A  B 13 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI PC)
     A            CCNUM6         4A  B 15 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI PC)
     A            WO6            7A  B 15 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI PC)
     A            SEQ6           3A  B 15 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI PC)
     A            CCNUM7         4A  B 17 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI PC)
     A            WO7            7A  B 17 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI PC)
     A            SEQ7           3A  B 17 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI PC)
     A            CCNUM8         4A  B 19 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI PC)
     A            WO8            7A  B 19 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI PC)
     A            SEQ8           3A  B 19 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI PC)
     A            COM1          74A  B 21  3DSPATR(PR)
     A                                      OVRDTA
     A            COM2          74A  B 22  3DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN TO MENU f3-EXIT P-
     A                                      ROGRAM                             -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VTEMPZONE
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 18'-----------------------------------
     A                                      -------'
     A                                  3 18':  TEMPORARY CHANGE OF ZONE ASSIGN-
     A                                      MENT  :'
     A                                  4 18'-----------------------------------
     A                                      -------'
     A                                  7 26'CLOCK CARD NUMBER:'
     A                                 10 33'NAME:'
     A                                 12 32'CRAFT:'
     A                                 14 24'ASSIGNED ZONE:'
     A                                 16 23'TEMPORARY ZONE:'
     A                                 19  6'Enter Clock Card Number you wish t-
     A                                      o change Temporary Zone Assignment,'
     A                                 21 27'and press "ENTER" key.'
     A            CCNM           4A  B  7 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI PC)
     A            NAME          16A  B 10 40DSPATR(PR)
     A                                      OVRDTA
     A            CF             2A  B 12 40DSPATR(PR)
     A                                      OVRDTA
     A            ZONE           4A  B 14 40DSPATR(PR)
     A                                      OVRDTA
     A            TZON           4A  B 16 40DSPATR(PR)
     A                                      OVRDTA
     A            DUMY           4A  B 17 58DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN TO MENU f3-EXIT P-
     A                                      ROGRAM                             -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VTEMPZONES
     A*%%TS  DD  19931124  071107  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 18'-----------------------------------
     A                                      -------'
     A                                  3 18':  TEMPORARY CHANGE OF ZONE ASSIGN-
     A                                      MENT  :'
     A                                  4 18'-----------------------------------
     A                                      -------'
     A                                  7 26'CLOCK CARD NUMBER:'
     A                                 10 33'NAME:'
     A                                 12 32'CRAFT:'
     A                                 14 24'ASSIGNED ZONE:'
     A                                 16 23'TEMPORARY ZONE:'
     A                                 19  9'Enter new Temporary Zone Assignmen-
     A                                      t'
     A                                 19 50'and press "ENTER" key.'
     A                                 21 14'NOTE:  To Delete Temporary Zone As-
     A                                      signment,'
     A                                 22 21'leave block blank and press "ENTER-
     A                                      " key.'
     A            CCNM           4A  B  7 46DSPATR(PR)
     A                                      OVRDTA
     A            NAME          16A  B 10 40DSPATR(PR)
     A                                      OVRDTA
     A            CF             2A  B 12 40DSPATR(PR)
     A                                      OVRDTA
     A            ZONE           4A  B 14 40DSPATR(PR)
     A                                      OVRDTA
     A            TZON           4A  B 16 40DSPATR(PR)
     A                                      OVRDTA
     A            NTZN           4A  B 19 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN TO MENU f2-ANOTHE-
     A                                      R CC-NUM f3-EXIT PROGRAM           -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VCWIPMNU
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  3  8'-----------------------------------
     A                                      ---------------------------'
     A                                  4  8':  C U R R E N T   W O R K O R D E-
     A                                       R   A S S I G N M E N T  :'
     A                                  5  8'-----------------------------------
     A                                      ---------------------------'
     A                                  7 12'PRESS:'
     A                                 10 15'f1   CURRENT WORKORDER ASSIGNMENT -
     A                                      FOR ZONE CRAFTSMEN'
     A                                 12 15'f2   WORKORDERS-IN-PROGRESS BY ZON-
     A                                      E OR ALL ZONES'
     A                                 14 15'f3   RETURN TO SUPERVISOR MENU'
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A*%%CP+999CRTDSPF
     A*%%CP+    FILE(MCTST/ZCORLESS)
     A*%%CP+    SRCFILE(MCTST/QDDSSRC)
     A*%%CP+    SRCMBR(ZCORLESS)
     A*%%CP+    TEXT(*SRCMBRTXT)
     A*%%CP     RSTDSP(*YES)
