     A*%%TS  SD  20020828  092255  A257947     REL-V5R1M0  5722-WDS
     A*  89/04/17  11:45:48    T881S26     REL-R01M02  5728-PW1
     A*            17:10:51    T881S28     VCHGBLK.HPTO38.CME
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A*  89/04/17  11:45:48    T881S26     REL-R01M02  5728-PW1
     A          R CRTSCRN
     A*%%TS  SD  20020828  092255  A257947     REL-V5R1M0  5722-WDS
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      INZRCD
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1 23'CREATE BLANKET ORDER FROM ITEM FIL-
     A                                      E'
     A                                      DSPATR(HI)
     A                                  2 23'-----------------------------------
     A                                      -'
     A                                      DSPATR(HI)
     A                                  4  3'FILE NAME CONTAINING LIST OF ITEMS-
     A                                      :'
     A            FILENAME      10A  B  4 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A                                  6 59'MMDDYY'
     A                                  7  3'NEW BLANKET ORDER NUMBER:'
     A            BLK1           7A  B  7 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                  7 41'Expiration Date:'
     A            EXPDAT         6A  B  7 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A                                 10  3'COPY HEADER INFORMATION FROM BLANK-
     A                                      ET:'
     A            COPYHDR        7A  B 10 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A                                 16  3'INSTRUCTIONS:'
     A                                      DSPATR(UL)
     A                                 17  6'1)  Type the file name containing -
     A                                      the list of items.'
     A                                 18  6'2)  Type the new blanket order num-
     A                                      ber and expiration date.'
     A                                 19  6'3)  Type the blanket number to cop-
     A                                      y PO header information from.'
     A                                 20  6'4)  Press Enter to proceed or F3 t-
     A                                      o cancel.'
     A            COMMANDLN1    79A  B 24  1DFTVAL(' ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
