     A*%%TS  DD  20021108  161009  QUSER       REL-V5.1    iSeries WDT
     A*  91/03/07  14:25:45    A171523     REL-R03M00  5728-PW1
     A*            13:02:39    T881S28     VCSISINQ.HPTO38.CME
     A*%%FD CSIS Inquiry Formfile
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A  98                                  INVITE
     A                                      PRINT
     A          R CORP_CODE
     A*%%TS  SD  19970113  110747  A193138     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  6'P. O.    I N Q U I R Y    B Y    C'
     A                                  1 41'O R P O R A T E   C O D E'
     A                                  5  6'KEY IN THE CORPORATE CODE OR ALTER-
     A                                      NATE KEY TO INQUIRE ON AND:'
     A            CODE          12A  B  7 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            SORT           1A  B  9 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-TO EXIT                 -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A                                 12 15'A - PRESS "ENTER" TO SEARCH THE LI-
     A                                      VE DATABASE'
     A                                 14 36'OR'
     A                                 16 15'B - PRESS "F6" TO SEARCH THE HISTO-
     A                                      RY DATABASE'
     A                                 22  8'PRESS "F3" TO EXIT'
     A                                  9  6'SORT PO DATE IN ASCENDING,DESCENDI-
     A                                      NG, OR NO SORT (A,D,BLANK):'
     A          R DISPLAY1
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'MANUFACTURER'
     A                                  1 73'CP1-4-4'
     A                                  2  1'MFR"S NUMBER:'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  3'STORES CODE:'
     A                                 21  1'FOR MORE INFORMATION ON THIS CODE,'
     A                                 21 36'SELECT IT BY TYPING AN "X" AND PRE-
     A                                      SS "ENTER"'
     A            MANUFACTUR    26A  B  1 15DSPATR(PR)
     A                                      OVRDTA
     A            MFRNUM        20A  B  2 15DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  4  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            CODE           7A  B  4 16DSPATR(PR)
     A                                      OVRDTA
     A            DESC01        79A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC02        79A  B  6  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC03        79A  B  7  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC04        79A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC05        79A  B  9  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC06        79A  B 10  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC07        79A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC08        79A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC09        79A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC10        79A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC11        79A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC12        79A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC13        79A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC14        79A  B 18  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC15        79A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC16        79A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCT1     79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCT2     79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R EAAPPAMT
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF03
     A                                  5 12'$ AMOUNT APPROVED FOR APPROVER'
     A                                  7 12'$ AMOUNT APPROVED TODAY       '
     A                                  9 12'$ AMOUNT APPROVED THIS WEEK   '
     A                                 11 12'$ AMOUNT APPROVED THIS MONTH  '
     A            APPCC          4A  B  5 44DSPATR(PR)
     A                                      OVRDTA
     A            APPAMT1        8A  B  7 44DSPATR(PR)
     A                                      OVRDTA
     A            APPAMT2        8A  B  9 44DSPATR(PR)
     A                                      OVRDTA
     A            APPAMT3        8A  B 11 44DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('F3-END-PROGRAM             -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EAAPPINQ
     A*%%TS  DD  20021108  161009  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 17'REQUISITION APPROVAL STATUS INQUIR-
     A                                      Y'
     A                                  3  1'REQ NUMBER   REQ DATE   CORP CODE'
     A                                  3 37'QUANTITY UM   ESTIMATED PRICE   DA-
     A                                      TE WANTED'
     A                                  6 69'PRINTER #'
     A                                  7 28'PATH'
     A                                  7 43'APPROVALS LEFT'
     A                                  9  1'RETURNED BY:'
     A                                  9 20'REASON:'
     A                                 11  1'LV I QUE-DATE APP-DATE ID   NAME'
     A                                 11 46'COMMENTS'
     A            REQNUM        10A  B  4  1DSPATR(PR)
     A                                      OVRDTA
     A            REQDATE        8A  B  4 14DSPATR(PR)
     A                                      OVRDTA
     A            CORPCOD        8A  B  4 25DSPATR(PR)
     A                                      OVRDTA
     A            QTY            8A  B  4 37DSPATR(PR)
     A                                      OVRDTA
     A            UM             2A  B  4 46DSPATR(PR)
     A                                      OVRDTA
     A            ESTIMATEDP    15Y 4B  4 51EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            DATEWANT       8A  B  4 69DSPATR(PR)
     A                                      OVRDTA
     A            REQTYPE       59A  B  6  1DSPATR(PR)
     A                                      OVRDTA
     A            HOLDSTATUS    24A  B  7  1DSPATR(PR)
     A                                      OVRDTA
     A            PHT            3A  B  7 33DSPATR(PR)
     A                                      OVRDTA
     A            AL             2A  B  7 58DSPATR(PR)
     A                                      OVRDTA
     A            PRINTER        2A  B  7 72
     A  50                                  DSPATR(UL)
     A                                      OVRDTA
     A            RETB           4A  B  9 14DSPATR(PR)
     A                                      OVRDTA
     A            REASON1       36A  B  9 28DSPATR(PR)
     A                                      OVRDTA
     A            REASON2       36A  B 10 28DSPATR(PR)
     A                                      OVRDTA
     A            L1             2A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B 12  4DSPATR(PR)
     A                                      OVRDTA
     A            DATE1          8A  B 12  6DSPATR(PR)
     A                                      OVRDTA
     A            ADATE1         8A  B 12 15DSPATR(PR)
     A                                      OVRDTA
     A            ID1            4A  B 12 24DSPATR(PR)
     A                                      OVRDTA
     A            NAME1         16A  B 12 29DSPATR(PR)
     A                                      OVRDTA
     A            COMMENT1      33A  B 12 46DSPATR(PR)
     A                                      OVRDTA
     A            L2             2A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B 13  4DSPATR(PR)
     A                                      OVRDTA
     A            DATE2          8A  B 13  6DSPATR(PR)
     A                                      OVRDTA
     A            ADATE2         8A  B 13 15DSPATR(PR)
     A                                      OVRDTA
     A            ID2            4A  B 13 24DSPATR(PR)
     A                                      OVRDTA
     A            NAME2         16A  B 13 29DSPATR(PR)
     A                                      OVRDTA
     A            COMMENT2      33A  B 13 46DSPATR(PR)
     A                                      OVRDTA
     A            L3             2A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 14  4DSPATR(PR)
     A                                      OVRDTA
     A            DATE3          8A  B 14  6DSPATR(PR)
     A                                      OVRDTA
     A            ADATE3         8A  B 14 15DSPATR(PR)
     A                                      OVRDTA
     A            ID3            4A  B 14 24DSPATR(PR)
     A                                      OVRDTA
     A            NAME3         16A  B 14 29DSPATR(PR)
     A                                      OVRDTA
     A            COMMENT3      33A  B 14 46DSPATR(PR)
     A                                      OVRDTA
     A            L4             2A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 15  4DSPATR(PR)
     A                                      OVRDTA
     A            DATE4          8A  B 15  6DSPATR(PR)
     A                                      OVRDTA
     A            ADATE4         8A  B 15 15DSPATR(PR)
     A                                      OVRDTA
     A            ID4            4A  B 15 24DSPATR(PR)
     A                                      OVRDTA
     A            NAME4         16A  B 15 29DSPATR(PR)
     A                                      OVRDTA
     A            COMMENT4      33A  B 15 46DSPATR(PR)
     A                                      OVRDTA
     A            L5             2A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 16  4DSPATR(PR)
     A                                      OVRDTA
     A            DATE5          8A  B 16  6DSPATR(PR)
     A                                      OVRDTA
     A            ADATE5         8A  B 16 15DSPATR(PR)
     A                                      OVRDTA
     A            ID5            4A  B 16 24DSPATR(PR)
     A                                      OVRDTA
     A            NAME5         16A  B 16 29DSPATR(PR)
     A                                      OVRDTA
     A            COMMENT5      33A  B 16 46DSPATR(PR)
     A                                      OVRDTA
     A            L6             2A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 17  4DSPATR(PR)
     A                                      OVRDTA
     A            DATE6          8A  B 17  6DSPATR(PR)
     A                                      OVRDTA
     A            ADATE6         8A  B 17 15DSPATR(PR)
     A                                      OVRDTA
     A            ID6            4A  B 17 24DSPATR(PR)
     A                                      OVRDTA
     A            NAME6         16A  B 17 29DSPATR(PR)
     A                                      OVRDTA
     A            COMMENT6      33A  B 17 46DSPATR(PR)
     A                                      OVRDTA
     A            L7             2A  B 18  1DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 18  4DSPATR(PR)
     A                                      OVRDTA
     A            DATE7          8A  B 18  6DSPATR(PR)
     A                                      OVRDTA
     A            ADATE7         8A  B 18 15DSPATR(PR)
     A                                      OVRDTA
     A            ID7            4A  B 18 24DSPATR(PR)
     A                                      OVRDTA
     A            NAME7         16A  B 18 29DSPATR(PR)
     A                                      OVRDTA
     A            COMMENT7      33A  B 18 46DSPATR(PR)
     A                                      OVRDTA
     A            L8             2A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 19  4DSPATR(PR)
     A                                      OVRDTA
     A            DATE8          8A  B 19  6DSPATR(PR)
     A                                      OVRDTA
     A            ADATE8         8A  B 19 15DSPATR(PR)
     A                                      OVRDTA
     A            ID8            4A  B 19 24DSPATR(PR)
     A                                      OVRDTA
     A            NAME8         16A  B 19 29DSPATR(PR)
     A                                      OVRDTA
     A            COMMENT8      33A  B 19 46DSPATR(PR)
     A                                      OVRDTA
     A            L9             2A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 20  4DSPATR(PR)
     A                                      OVRDTA
     A            DATE9          8A  B 20  6DSPATR(PR)
     A                                      OVRDTA
     A            ADATE9         8A  B 20 15DSPATR(PR)
     A                                      OVRDTA
     A            ID9            4A  B 20 24DSPATR(PR)
     A                                      OVRDTA
     A            NAME9         16A  B 20 29DSPATR(PR)
     A                                      OVRDTA
     A            COMMENT9      33A  B 20 46DSPATR(PR)
     A                                      OVRDTA
     A            LA             2A  B 21  1DSPATR(PR)
     A                                      OVRDTA
     A            J              1A  B 21  4DSPATR(PR)
     A                                      OVRDTA
     A            DATE10         8A  B 21  6DSPATR(PR)
     A                                      OVRDTA
     A            ADATE10        8A  B 21 15DSPATR(PR)
     A                                      OVRDTA
     A            ID10           4A  B 21 24DSPATR(PR)
     A                                      OVRDTA
     A            NAME10        16A  B 21 29DSPATR(PR)
     A                                      OVRDTA
     A            COMMENT10     33A  B 21 46DSPATR(PR)
     A                                      OVRDTA
     A            LB             2A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            K              1A  B 22  4DSPATR(PR)
     A                                      OVRDTA
     A            DATE11         8A  B 22  6DSPATR(PR)
     A                                      OVRDTA
     A            ADATE11        8A  B 22 15DSPATR(PR)
     A                                      OVRDTA
     A            ID11           4A  B 22 24DSPATR(PR)
     A                                      OVRDTA
     A            NAME11        16A  B 22 29DSPATR(PR)
     A                                      OVRDTA
     A            COMMENT11     33A  B 22 46DSPATR(PR)
     A                                      OVRDTA
     A            LC             2A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            L              1A  B 23  4DSPATR(PR)
     A                                      OVRDTA
     A            DATE12         8A  B 23  6DSPATR(PR)
     A                                      OVRDTA
     A            ADATE12        8A  B 23 15DSPATR(PR)
     A                                      OVRDTA
     A            ID12           4A  B 23 24DSPATR(PR)
     A                                      OVRDTA
     A            NAME12        16A  B 23 29DSPATR(PR)
     A                                      OVRDTA
     A            COMMENT12     33A  B 23 46DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('F1-HELP F2-PATH DEF INQ F3--
     A                                      EXIT F5-QUICK PRNT F6-USER INQ F7-L-
     A                                      EVEL F8-PATHS INQ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A*%%GP SCREEN1    01
     A          R EADEPTIQ
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 11'REQUESTING / CHARGE DEPARTMENT COM-
     A                                      BINED KEYS INQUIRY'
     A                                  3 10'REQUESTING DEPT      CHARGE DEPT'
     A                                  3 48'FLAG'
     A            RQ01           4A  B  4 15DSPATR(PR)
     A                                      OVRDTA
     A            DP01           4A  B  4 34DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  4 49DSPATR(PR)
     A                                      OVRDTA
     A            RQ02           4A  B  5 15DSPATR(PR)
     A                                      OVRDTA
     A            DP02           4A  B  5 34DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B  5 49DSPATR(PR)
     A                                      OVRDTA
     A            RQ03           4A  B  6 15DSPATR(PR)
     A                                      OVRDTA
     A            DP03           4A  B  6 34DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  6 49DSPATR(PR)
     A                                      OVRDTA
     A            RQ04           4A  B  7 15DSPATR(PR)
     A                                      OVRDTA
     A            DP04           4A  B  7 34DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B  7 49DSPATR(PR)
     A                                      OVRDTA
     A            RQ05           4A  B  8 15DSPATR(PR)
     A                                      OVRDTA
     A            DP05           4A  B  8 34DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B  8 49DSPATR(PR)
     A                                      OVRDTA
     A            RQ06           4A  B  9 15DSPATR(PR)
     A                                      OVRDTA
     A            DP06           4A  B  9 34DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B  9 49DSPATR(PR)
     A                                      OVRDTA
     A            RQ07           4A  B 10 15DSPATR(PR)
     A                                      OVRDTA
     A            DP07           4A  B 10 34DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 10 49DSPATR(PR)
     A                                      OVRDTA
     A            RQ08           4A  B 11 15DSPATR(PR)
     A                                      OVRDTA
     A            DP08           4A  B 11 34DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 11 49DSPATR(PR)
     A                                      OVRDTA
     A            RQ09           4A  B 12 15DSPATR(PR)
     A                                      OVRDTA
     A            DP09           4A  B 12 34DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 12 49DSPATR(PR)
     A                                      OVRDTA
     A            RQ10           4A  B 13 15DSPATR(PR)
     A                                      OVRDTA
     A            DP10           4A  B 13 34DSPATR(PR)
     A                                      OVRDTA
     A            J              1A  B 13 49DSPATR(PR)
     A                                      OVRDTA
     A            RQ11           4A  B 14 15DSPATR(PR)
     A                                      OVRDTA
     A            DP11           4A  B 14 34DSPATR(PR)
     A                                      OVRDTA
     A            K              1A  B 14 49DSPATR(PR)
     A                                      OVRDTA
     A            RQ12           4A  B 15 15DSPATR(PR)
     A                                      OVRDTA
     A            DP12           4A  B 15 34DSPATR(PR)
     A                                      OVRDTA
     A            L              1A  B 15 49DSPATR(PR)
     A                                      OVRDTA
     A            RQ13           4A  B 16 15DSPATR(PR)
     A                                      OVRDTA
     A            DP13           4A  B 16 34DSPATR(PR)
     A                                      OVRDTA
     A            M              1A  B 16 49DSPATR(PR)
     A                                      OVRDTA
     A            RQ14           4A  B 17 15DSPATR(PR)
     A                                      OVRDTA
     A            DP14           4A  B 17 34DSPATR(PR)
     A                                      OVRDTA
     A            N              1A  B 17 49DSPATR(PR)
     A                                      OVRDTA
     A            RQ15           4A  B 18 15DSPATR(PR)
     A                                      OVRDTA
     A            DP15           4A  B 18 34DSPATR(PR)
     A                                      OVRDTA
     A            O              1A  B 18 49DSPATR(PR)
     A                                      OVRDTA
     A            RQ16           4A  B 19 15DSPATR(PR)
     A                                      OVRDTA
     A            DP16           4A  B 19 34DSPATR(PR)
     A                                      OVRDTA
     A            P              1A  B 19 49DSPATR(PR)
     A                                      OVRDTA
     A            RQ17           4A  B 20 15DSPATR(PR)
     A                                      OVRDTA
     A            DP17           4A  B 20 34DSPATR(PR)
     A                                      OVRDTA
     A            Q              1A  B 20 49DSPATR(PR)
     A                                      OVRDTA
     A            RQ18           4A  B 21 15DSPATR(PR)
     A                                      OVRDTA
     A            DP18           4A  B 21 34DSPATR(PR)
     A                                      OVRDTA
     A            R              1A  B 21 49DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('F1-START OVER F2-NEXT SCREE-
     A                                      N F3-END INQUIRY                   -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R EADPTXIQ
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 11'EXPLOSION DEPARTMENT RECORDS'
     A                                  3  1'EXPLODE DEPT    DEPARTMENTS TO EXP-
     A                                      LODE TO'
     A            DEPLINE1      79A  B  4  1DSPATR(PR)
     A                                      OVRDTA
     A            DEPLINE2      79A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            DEPLINE3      79A  B  6  1DSPATR(PR)
     A                                      OVRDTA
     A            DEPLINE4      79A  B  7  1DSPATR(PR)
     A                                      OVRDTA
     A            DEPLINE5      79A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            DEPLINE6      79A  B  9  1DSPATR(PR)
     A                                      OVRDTA
     A            DEPLINE7      79A  B 10  1DSPATR(PR)
     A                                      OVRDTA
     A            DEPLINE8      79A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            DEPLINE9      79A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            DEPLINEA      79A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            DEPLINEB      79A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            DEPLINEC      79A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            DEPLINED      79A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            DEPLINEE      79A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            DEPLINEF      79A  B 18  1DSPATR(PR)
     A                                      OVRDTA
     A            DEPLINEG      79A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('F1-START OVER F2-NEXT SCREE-
     A                                      N F3-END INQUIRY                   -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R EALEVINQ
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 17'REQUISITION APPROVAL - LEVEL INQUI-
     A                                      RY'
     A                                  4 49'ACTIVE'
     A                                  5  2'LEVEL    LEVEL DESCRIPTION'
     A                                  5 50'EMPL     ACTIVE EMPL NAME'
     A            L1             2A  B  6  3DSPATR(PR)
     A                                      OVRDTA
     A            DESC1         36A  B  6 11DSPATR(PR)
     A                                      OVRDTA
     A            EM01           4A  B  6 50DSPATR(PR)
     A                                      OVRDTA
     A            NAME01        16A  B  6 59DSPATR(PR)
     A                                      OVRDTA
     A            L2             2A  B  7  3DSPATR(PR)
     A                                      OVRDTA
     A            DESC2         36A  B  7 11DSPATR(PR)
     A                                      OVRDTA
     A            EM02           4A  B  7 50DSPATR(PR)
     A                                      OVRDTA
     A            NAME02        16A  B  7 59DSPATR(PR)
     A                                      OVRDTA
     A            L3             2A  B  8  3DSPATR(PR)
     A                                      OVRDTA
     A            DESC3         36A  B  8 11DSPATR(PR)
     A                                      OVRDTA
     A            EM03           4A  B  8 50DSPATR(PR)
     A                                      OVRDTA
     A            NAME03        16A  B  8 59DSPATR(PR)
     A                                      OVRDTA
     A            L4             2A  B  9  3DSPATR(PR)
     A                                      OVRDTA
     A            DESC4         36A  B  9 11DSPATR(PR)
     A                                      OVRDTA
     A            EM04           4A  B  9 50DSPATR(PR)
     A                                      OVRDTA
     A            NAME04        16A  B  9 59DSPATR(PR)
     A                                      OVRDTA
     A            L5             2A  B 10  3DSPATR(PR)
     A                                      OVRDTA
     A            DESC5         36A  B 10 11DSPATR(PR)
     A                                      OVRDTA
     A            EM05           4A  B 10 50DSPATR(PR)
     A                                      OVRDTA
     A            NAME05        16A  B 10 59DSPATR(PR)
     A                                      OVRDTA
     A            L6             2A  B 11  3DSPATR(PR)
     A                                      OVRDTA
     A            DESC6         36A  B 11 11DSPATR(PR)
     A                                      OVRDTA
     A            EM06           4A  B 11 50DSPATR(PR)
     A                                      OVRDTA
     A            NAME06        16A  B 11 59DSPATR(PR)
     A                                      OVRDTA
     A            L7             2A  B 12  3DSPATR(PR)
     A                                      OVRDTA
     A            DESC7         36A  B 12 11DSPATR(PR)
     A                                      OVRDTA
     A            EM07           4A  B 12 50DSPATR(PR)
     A                                      OVRDTA
     A            NAME07        16A  B 12 59DSPATR(PR)
     A                                      OVRDTA
     A            L8             2A  B 13  3DSPATR(PR)
     A                                      OVRDTA
     A            DESC8         36A  B 13 11DSPATR(PR)
     A                                      OVRDTA
     A            EM08           4A  B 13 50DSPATR(PR)
     A                                      OVRDTA
     A            NAME08        16A  B 13 59DSPATR(PR)
     A                                      OVRDTA
     A            L9             2A  B 14  3DSPATR(PR)
     A                                      OVRDTA
     A            DESC9         36A  B 14 11DSPATR(PR)
     A                                      OVRDTA
     A            EM09           4A  B 14 50DSPATR(PR)
     A                                      OVRDTA
     A            NAME09        16A  B 14 59DSPATR(PR)
     A                                      OVRDTA
     A            L0             2A  B 15  3DSPATR(PR)
     A                                      OVRDTA
     A            DESC10        36A  B 15 11DSPATR(PR)
     A                                      OVRDTA
     A            EM10           4A  B 15 50DSPATR(PR)
     A                                      OVRDTA
     A            NAME10        16A  B 15 59DSPATR(PR)
     A                                      OVRDTA
     A            L11            2A  B 16  3DSPATR(PR)
     A                                      OVRDTA
     A            DESC11        36A  B 16 11DSPATR(PR)
     A                                      OVRDTA
     A            EM11           4A  B 16 50DSPATR(PR)
     A                                      OVRDTA
     A            NAME11        16A  B 16 59DSPATR(PR)
     A                                      OVRDTA
     A            L12            2A  B 17  3DSPATR(PR)
     A                                      OVRDTA
     A            DESC12        36A  B 17 11DSPATR(PR)
     A                                      OVRDTA
     A            EM12           4A  B 17 50DSPATR(PR)
     A                                      OVRDTA
     A            NAME12        16A  B 17 59DSPATR(PR)
     A                                      OVRDTA
     A            L13            2A  B 18  3DSPATR(PR)
     A                                      OVRDTA
     A            DESC13        36A  B 18 11DSPATR(PR)
     A                                      OVRDTA
     A            EM13           4A  B 18 50DSPATR(PR)
     A                                      OVRDTA
     A            NAME13        16A  B 18 59DSPATR(PR)
     A                                      OVRDTA
     A            L14            2A  B 19  3DSPATR(PR)
     A                                      OVRDTA
     A            DESC14        36A  B 19 11DSPATR(PR)
     A                                      OVRDTA
     A            EM14           4A  B 19 50DSPATR(PR)
     A                                      OVRDTA
     A            NAME14        16A  B 19 59DSPATR(PR)
     A                                      OVRDTA
     A            L15            2A  B 20  3DSPATR(PR)
     A                                      OVRDTA
     A            DESC15        36A  B 20 11DSPATR(PR)
     A                                      OVRDTA
     A            EM15           4A  B 20 50DSPATR(PR)
     A                                      OVRDTA
     A            NAME15        16A  B 20 59DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('F1-START OVER F2-NEXT SCREE-
     A                                      N F3-END INQUIRY                   -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R EAPHIQ1
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 18'REQUISITION APPROVAL PATHS INQUIRY'
     A                                  3 71'WO'
     A                                  4  1'PATH#  PATH DESCRIPTION'
     A                                  4 40'MIN VALUE'
     A                                  4 56'MAX VALUE      APP'
     A            P1             4A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            PDESC1        30A  B  5  8DSPATR(PR)
     A                                      OVRDTA
     A            PMINVAL1      14A  B  5 40DSPATR(PR)
     A                                      OVRDTA
     A            PMAXVAL1      14A  B  5 56DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  5 72DSPATR(PR)
     A                                      OVRDTA
     A            P2             4A  B  6  1DSPATR(PR)
     A                                      OVRDTA
     A            PDESC2        30A  B  6  8DSPATR(PR)
     A                                      OVRDTA
     A            PMINVAL2      14A  B  6 40DSPATR(PR)
     A                                      OVRDTA
     A            PMAXVAL2      14A  B  6 56DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B  6 72DSPATR(PR)
     A                                      OVRDTA
     A            P3             4A  B  7  1DSPATR(PR)
     A                                      OVRDTA
     A            PDESC3        30A  B  7  8DSPATR(PR)
     A                                      OVRDTA
     A            PMINVAL3      14A  B  7 40DSPATR(PR)
     A                                      OVRDTA
     A            PMAXVAL3      14A  B  7 56DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  7 72DSPATR(PR)
     A                                      OVRDTA
     A            P4             4A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            PDESC4        30A  B  8  8DSPATR(PR)
     A                                      OVRDTA
     A            PMINVAL4      14A  B  8 40DSPATR(PR)
     A                                      OVRDTA
     A            PMAXVAL4      14A  B  8 56DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B  8 72DSPATR(PR)
     A                                      OVRDTA
     A            P5             4A  B  9  1DSPATR(PR)
     A                                      OVRDTA
     A            PDESC5        30A  B  9  8DSPATR(PR)
     A                                      OVRDTA
     A            PMINVAL5      14A  B  9 40DSPATR(PR)
     A                                      OVRDTA
     A            PMAXVAL5      14A  B  9 56DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B  9 72DSPATR(PR)
     A                                      OVRDTA
     A            P6             4A  B 10  1DSPATR(PR)
     A                                      OVRDTA
     A            PDESC6        30A  B 10  8DSPATR(PR)
     A                                      OVRDTA
     A            PMINVAL6      14A  B 10 40DSPATR(PR)
     A                                      OVRDTA
     A            PMAXVAL6      14A  B 10 56DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 10 72DSPATR(PR)
     A                                      OVRDTA
     A            P7             4A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            PDESC7        30A  B 11  8DSPATR(PR)
     A                                      OVRDTA
     A            PMINVAL7      14A  B 11 40DSPATR(PR)
     A                                      OVRDTA
     A            PMAXVAL7      14A  B 11 56DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 11 72DSPATR(PR)
     A                                      OVRDTA
     A            P8             4A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            PDESC8        30A  B 12  8DSPATR(PR)
     A                                      OVRDTA
     A            PMINVAL8      14A  B 12 40DSPATR(PR)
     A                                      OVRDTA
     A            PMAXVAL8      14A  B 12 56DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 12 72DSPATR(PR)
     A                                      OVRDTA
     A            P9             4A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            PDESC9        30A  B 13  8DSPATR(PR)
     A                                      OVRDTA
     A            PMINVAL9      14A  B 13 40DSPATR(PR)
     A                                      OVRDTA
     A            PMAXVAL9      14A  B 13 56DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 13 72DSPATR(PR)
     A                                      OVRDTA
     A            Q1             4A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            PDESC10       30A  B 14  8DSPATR(PR)
     A                                      OVRDTA
     A            PMINVAL10     14A  B 14 40DSPATR(PR)
     A                                      OVRDTA
     A            PMAXVAL10     14A  B 14 56DSPATR(PR)
     A                                      OVRDTA
     A            J              1A  B 14 72DSPATR(PR)
     A                                      OVRDTA
     A            Q2             4A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            PDESC11       30A  B 15  8DSPATR(PR)
     A                                      OVRDTA
     A            PMINVAL11     14A  B 15 40DSPATR(PR)
     A                                      OVRDTA
     A            PMAXVAL11     14A  B 15 56DSPATR(PR)
     A                                      OVRDTA
     A            K              1A  B 15 72DSPATR(PR)
     A                                      OVRDTA
     A            Q3             4A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            PDESC12       30A  B 16  8DSPATR(PR)
     A                                      OVRDTA
     A            PMINVAL12     14A  B 16 40DSPATR(PR)
     A                                      OVRDTA
     A            PMAXVAL12     14A  B 16 56DSPATR(PR)
     A                                      OVRDTA
     A            L              1A  B 16 72DSPATR(PR)
     A                                      OVRDTA
     A            Q4             4A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            PDESC13       30A  B 17  8DSPATR(PR)
     A                                      OVRDTA
     A            PMINVAL13     14A  B 17 40DSPATR(PR)
     A                                      OVRDTA
     A            PMAXVAL13     14A  B 17 56DSPATR(PR)
     A                                      OVRDTA
     A            M              1A  B 17 72DSPATR(PR)
     A                                      OVRDTA
     A            Q5             4A  B 18  1DSPATR(PR)
     A                                      OVRDTA
     A            PDESC14       30A  B 18  8DSPATR(PR)
     A                                      OVRDTA
     A            PMINVAL14     14A  B 18 40DSPATR(PR)
     A                                      OVRDTA
     A            PMAXVAL14     14A  B 18 56DSPATR(PR)
     A                                      OVRDTA
     A            N              1A  B 18 72DSPATR(PR)
     A                                      OVRDTA
     A            Q6             4A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            PDESC15       30A  B 19  8DSPATR(PR)
     A                                      OVRDTA
     A            PMINVAL15     14A  B 19 40DSPATR(PR)
     A                                      OVRDTA
     A            PMAXVAL15     14A  B 19 56DSPATR(PR)
     A                                      OVRDTA
     A            O              1A  B 19 72DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('F1-START OVER F2-NEXT SCREE-
     A                                      N F3-END INQUIRY                   -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R EAPHIQ2
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 15'REQUISITION APPROVAL PATH DEFINITI-
     A                                      ON INQUIRY'
     A                                  3  3'TYPE  PATH#  PATH DESCRIPTION'
     A                                  3 48'MIN VALUE'
     A                                  3 64'MAX VALUE'
     A                                  6  1'WORKORDER APPROVAL REQUIRED?'
     A                                  6 36'LEVELS:'
     A                                  7 19'IN ORDER / SIMULTANEOUS:'
     A            T              1A  B  4  4DSPATR(UL)
     A            P1             3Y 0B  4  9DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            PDESC1        30A  B  4 16DSPATR(PR)
     A                                      OVRDTA
     A            PMINVAL1      14A  B  4 48DSPATR(PR)
     A                                      OVRDTA
     A            PMAXVAL1      14A  B  4 64DSPATR(PR)
     A                                      OVRDTA
     A            W              1A  B  6 30DSPATR(PR)
     A                                      OVRDTA
     A            L1             2A  B  6 44DSPATR(PR)
     A                                      OVRDTA
     A            L2             2A  B  6 47DSPATR(PR)
     A                                      OVRDTA
     A            L3             2A  B  6 50DSPATR(PR)
     A                                      OVRDTA
     A            L4             2A  B  6 53DSPATR(PR)
     A                                      OVRDTA
     A            L5             2A  B  6 56DSPATR(PR)
     A                                      OVRDTA
     A            L6             2A  B  6 59DSPATR(PR)
     A                                      OVRDTA
     A            L7             2A  B  6 62DSPATR(PR)
     A                                      OVRDTA
     A            L8             2A  B  6 65DSPATR(PR)
     A                                      OVRDTA
     A            L9             2A  B  6 68DSPATR(PR)
     A                                      OVRDTA
     A            L0             2A  B  6 71DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  7 45DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B  7 48DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  7 51DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B  7 54DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B  7 57DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B  7 60DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B  7 63DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B  7 66DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B  7 69DSPATR(PR)
     A                                      OVRDTA
     A            J              1A  B  7 72DSPATR(PR)
     A                                      OVRDTA
     A            INCEX01        7A  B  8  4DSPATR(PR)
     A                                      OVRDTA
     A            TYPE01        16A  B  8 14DSPATR(PR)
     A                                      OVRDTA
     A            LOWVAL01      14A  B  8 33DSPATR(PR)
     A                                      OVRDTA
     A            M01            3A  B  8 50DSPATR(PR)
     A                                      OVRDTA
     A            HIGHVAL01     14A  B  8 56DSPATR(PR)
     A                                      OVRDTA
     A            INCEX02        7A  B  9  4DSPATR(PR)
     A                                      OVRDTA
     A            TYPE02        16A  B  9 14DSPATR(PR)
     A                                      OVRDTA
     A            LOWVAL02      14A  B  9 33DSPATR(PR)
     A                                      OVRDTA
     A            M02            3A  B  9 50DSPATR(PR)
     A                                      OVRDTA
     A            HIGHVAL02     14A  B  9 56DSPATR(PR)
     A                                      OVRDTA
     A            INCEX03        7A  B 10  4DSPATR(PR)
     A                                      OVRDTA
     A            TYPE03        16A  B 10 14DSPATR(PR)
     A                                      OVRDTA
     A            LOWVAL03      14A  B 10 33DSPATR(PR)
     A                                      OVRDTA
     A            M03            3A  B 10 50DSPATR(PR)
     A                                      OVRDTA
     A            HIGHVAL03     14A  B 10 56DSPATR(PR)
     A                                      OVRDTA
     A            INCEX04        7A  B 11  4DSPATR(PR)
     A                                      OVRDTA
     A            TYPE04        16A  B 11 14DSPATR(PR)
     A                                      OVRDTA
     A            LOWVAL04      14A  B 11 33DSPATR(PR)
     A                                      OVRDTA
     A            M04            3A  B 11 50DSPATR(PR)
     A                                      OVRDTA
     A            HIGHVAL04     14A  B 11 56DSPATR(PR)
     A                                      OVRDTA
     A            INCEX05        7A  B 12  4DSPATR(PR)
     A                                      OVRDTA
     A            TYPE05        16A  B 12 14DSPATR(PR)
     A                                      OVRDTA
     A            LOWVAL05      14A  B 12 33DSPATR(PR)
     A                                      OVRDTA
     A            M05            3A  B 12 50DSPATR(PR)
     A                                      OVRDTA
     A            HIGHVAL05     14A  B 12 56DSPATR(PR)
     A                                      OVRDTA
     A            INCEX06        7A  B 13  4DSPATR(PR)
     A                                      OVRDTA
     A            TYPE06        16A  B 13 14DSPATR(PR)
     A                                      OVRDTA
     A            LOWVAL06      14A  B 13 33DSPATR(PR)
     A                                      OVRDTA
     A            M06            3A  B 13 50DSPATR(PR)
     A                                      OVRDTA
     A            HIGHVAL06     14A  B 13 56DSPATR(PR)
     A                                      OVRDTA
     A            INCEX07        7A  B 14  4DSPATR(PR)
     A                                      OVRDTA
     A            TYPE07        16A  B 14 14DSPATR(PR)
     A                                      OVRDTA
     A            LOWVAL07      14A  B 14 33DSPATR(PR)
     A                                      OVRDTA
     A            M07            3A  B 14 50DSPATR(PR)
     A                                      OVRDTA
     A            HIGHVAL07     14A  B 14 56DSPATR(PR)
     A                                      OVRDTA
     A            INCEX08        7A  B 15  4DSPATR(PR)
     A                                      OVRDTA
     A            TYPE08        16A  B 15 14DSPATR(PR)
     A                                      OVRDTA
     A            LOWVAL08      14A  B 15 33DSPATR(PR)
     A                                      OVRDTA
     A            M08            3A  B 15 50DSPATR(PR)
     A                                      OVRDTA
     A            HIGHVAL08     14A  B 15 56DSPATR(PR)
     A                                      OVRDTA
     A            INCEX09        7A  B 16  4DSPATR(PR)
     A                                      OVRDTA
     A            TYPE09        16A  B 16 14DSPATR(PR)
     A                                      OVRDTA
     A            LOWVAL09      14A  B 16 33DSPATR(PR)
     A                                      OVRDTA
     A            M09            3A  B 16 50DSPATR(PR)
     A                                      OVRDTA
     A            HIGHVAL09     14A  B 16 56DSPATR(PR)
     A                                      OVRDTA
     A            INCEX10        7A  B 17  4DSPATR(PR)
     A                                      OVRDTA
     A            TYPE10        16A  B 17 14DSPATR(PR)
     A                                      OVRDTA
     A            LOWVAL10      14A  B 17 33DSPATR(PR)
     A                                      OVRDTA
     A            M10            3A  B 17 50DSPATR(PR)
     A                                      OVRDTA
     A            HIGHVAL10     14A  B 17 56DSPATR(PR)
     A                                      OVRDTA
     A            INCEX11        7A  B 18  4DSPATR(PR)
     A                                      OVRDTA
     A            TYPE11        16A  B 18 14DSPATR(PR)
     A                                      OVRDTA
     A            LOWVAL11      14A  B 18 33DSPATR(PR)
     A                                      OVRDTA
     A            M11            3A  B 18 50DSPATR(PR)
     A                                      OVRDTA
     A            HIGHVAL11     14A  B 18 56DSPATR(PR)
     A                                      OVRDTA
     A            INCEX12        7A  B 19  4DSPATR(PR)
     A                                      OVRDTA
     A            TYPE12        16A  B 19 14DSPATR(PR)
     A                                      OVRDTA
     A            LOWVAL12      14A  B 19 33DSPATR(PR)
     A                                      OVRDTA
     A            M12            3A  B 19 50DSPATR(PR)
     A                                      OVRDTA
     A            HIGHVAL12     14A  B 19 56DSPATR(PR)
     A                                      OVRDTA
     A            INCEX13        7A  B 20  4DSPATR(PR)
     A                                      OVRDTA
     A            TYPE13        16A  B 20 14DSPATR(PR)
     A                                      OVRDTA
     A            LOWVAL13      14A  B 20 33DSPATR(PR)
     A                                      OVRDTA
     A            M13            3A  B 20 50DSPATR(PR)
     A                                      OVRDTA
     A            HIGHVAL13     14A  B 20 56DSPATR(PR)
     A                                      OVRDTA
     A            INCEX14        7A  B 21  4DSPATR(PR)
     A                                      OVRDTA
     A            TYPE14        16A  B 21 14DSPATR(PR)
     A                                      OVRDTA
     A            LOWVAL14      14A  B 21 33DSPATR(PR)
     A                                      OVRDTA
     A            M14            3A  B 21 50DSPATR(PR)
     A                                      OVRDTA
     A            HIGHVAL14     14A  B 21 56DSPATR(PR)
     A                                      OVRDTA
     A            INCEX15        7A  B 22  4DSPATR(PR)
     A                                      OVRDTA
     A            TYPE15        16A  B 22 14DSPATR(PR)
     A                                      OVRDTA
     A            LOWVAL15      14A  B 22 33DSPATR(PR)
     A                                      OVRDTA
     A            M15            3A  B 22 50DSPATR(PR)
     A                                      OVRDTA
     A            HIGHVAL15     14A  B 22 56DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-LEVELS  f3-END INQUIRY  -
     A                                      f2-NEXT SCREEN  f4-START OVER      -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R EAPHIQ2B
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 15'REQUISITION APPROVAL PATH DEFINITI-
     A                                      ON INQUIRY'
     A                                  3  2'TYPE  PATH#  PATH DESCRIPTION'
     A                                  3 47'MIN VALUE'
     A                                  3 63'MAX VALUE'
     A                                  6  1'WORKORDER APPROVAL REQUIRED?'
     A                                  6 35'PRINT REQUISITION WHEN CREATED? '
     A                                  8  1'CATEGORY'
     A                                 10  7'ORD/'
     A                                 10 51'ACTIVE'
     A                                 11  2'LV   SIMEL  LEVEL DESCRIPTION'
     A                                 11 52'EMPL   ACTIVE EMPL NAME'
     A            T              1A  B  4  3DSPATR(PR)
     A                                      OVRDTA
     A            P1             3A  B  4  8DSPATR(PR)
     A                                      OVRDTA
     A            PDESC1        30A  B  4 15DSPATR(PR)
     A                                      OVRDTA
     A            PMINVAL1      14A  B  4 47DSPATR(PR)
     A                                      OVRDTA
     A            PMAXVAL1      14A  B  4 63DSPATR(PR)
     A                                      OVRDTA
     A            W              1A  B  6 30DSPATR(PR)
     A                                      OVRDTA
     A            Y              1A  B  6 68DSPATR(PR)
     A                                      OVRDTA
     A            L              1A  B  8 10DSPATR(PR)
     A                                      OVRDTA
     A            L1             2A  B 12  2DSPATR(PR)
     A                                      OVRDTA
     A            K              1A  B 12  9DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESC1    36A  B 12 14DSPATR(PR)
     A                                      OVRDTA
     A            EM01           4A  B 12 52DSPATR(PR)
     A                                      OVRDTA
     A            NAME01        16A  B 12 59DSPATR(PR)
     A                                      OVRDTA
     A            L2             2A  B 13  2DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B 13  9DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESC2    36A  B 13 14DSPATR(PR)
     A                                      OVRDTA
     A            EM02           4A  B 13 52DSPATR(PR)
     A                                      OVRDTA
     A            NAME02        16A  B 13 59DSPATR(PR)
     A                                      OVRDTA
     A            L3             2A  B 14  2DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 14  9DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESC3    36A  B 14 14DSPATR(PR)
     A                                      OVRDTA
     A            EM03           4A  B 14 52DSPATR(PR)
     A                                      OVRDTA
     A            NAME03        16A  B 14 59DSPATR(PR)
     A                                      OVRDTA
     A            L4             2A  B 15  2DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 15  9DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESC4    36A  B 15 14DSPATR(PR)
     A                                      OVRDTA
     A            EM04           4A  B 15 52DSPATR(PR)
     A                                      OVRDTA
     A            NAME04        16A  B 15 59DSPATR(PR)
     A                                      OVRDTA
     A            L5             2A  B 16  2DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 16  9DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESC5    36A  B 16 14DSPATR(PR)
     A                                      OVRDTA
     A            EM05           4A  B 16 52DSPATR(PR)
     A                                      OVRDTA
     A            NAME05        16A  B 16 59DSPATR(PR)
     A                                      OVRDTA
     A            L6             2A  B 17  2DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 17  9DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESC6    36A  B 17 14DSPATR(PR)
     A                                      OVRDTA
     A            EM06           4A  B 17 52DSPATR(PR)
     A                                      OVRDTA
     A            NAME06        16A  B 17 59DSPATR(PR)
     A                                      OVRDTA
     A            L7             2A  B 18  2DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 18  9DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESC7    36A  B 18 14DSPATR(PR)
     A                                      OVRDTA
     A            EM07           4A  B 18 52DSPATR(PR)
     A                                      OVRDTA
     A            NAME07        16A  B 18 59DSPATR(PR)
     A                                      OVRDTA
     A            L8             2A  B 19  2DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 19  9DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESC8    36A  B 19 14DSPATR(PR)
     A                                      OVRDTA
     A            EM08           4A  B 19 52DSPATR(PR)
     A                                      OVRDTA
     A            NAME08        16A  B 19 59DSPATR(PR)
     A                                      OVRDTA
     A            L9             2A  B 20  2DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 20  9DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESC9    36A  B 20 14DSPATR(PR)
     A                                      OVRDTA
     A            EM09           4A  B 20 52DSPATR(PR)
     A                                      OVRDTA
     A            NAME09        16A  B 20 59DSPATR(PR)
     A                                      OVRDTA
     A            L0             2A  B 21  2DSPATR(PR)
     A                                      OVRDTA
     A            J              1A  B 21  9DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESCA    36A  B 21 14DSPATR(PR)
     A                                      OVRDTA
     A            EM10           4A  B 21 52DSPATR(PR)
     A                                      OVRDTA
     A            NAME10        16A  B 21 59DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-PATH DEFS f3-END INQUIRY-
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R EAUSERINQ
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 20'REQUISITION APPROVAL - USER INQUIR-
     A                                      Y'
     A                                  3  5'ID    LEVEL  NAME'
     A                                  3 37'LEVEL DESCRIPTION'
     A                                  3 74'ACTIVE?'
     A            P              1A  B  4  2DSPATR(UL)
     A            ID1            4A  B  4  5DSPATR(PR)
     A                                      OVRDTA
     A            L1             2A  B  4 12DSPATR(PR)
     A                                      OVRDTA
     A            NAME1         16A  B  4 18DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESC1    36A  B  4 37DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  4 76DSPATR(PR)
     A                                      OVRDTA
     A            Q              1A  B  5  2DSPATR(UL)
     A            ID2            4A  B  5  5DSPATR(PR)
     A                                      OVRDTA
     A            L2             2A  B  5 12DSPATR(PR)
     A                                      OVRDTA
     A            NAME2         16A  B  5 18DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESC2    36A  B  5 37DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B  5 76DSPATR(PR)
     A                                      OVRDTA
     A            R              1A  B  6  2DSPATR(UL)
     A            ID3            4A  B  6  5DSPATR(PR)
     A                                      OVRDTA
     A            L3             2A  B  6 12DSPATR(PR)
     A                                      OVRDTA
     A            NAME3         16A  B  6 18DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESC3    36A  B  6 37DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  6 76DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B  7  2DSPATR(UL)
     A            ID4            4A  B  7  5DSPATR(PR)
     A                                      OVRDTA
     A            L4             2A  B  7 12DSPATR(PR)
     A                                      OVRDTA
     A            NAME4         16A  B  7 18DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESC4    36A  B  7 37DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B  7 76DSPATR(PR)
     A                                      OVRDTA
     A            T              1A  B  8  2DSPATR(UL)
     A            ID5            4A  B  8  5DSPATR(PR)
     A                                      OVRDTA
     A            L5             2A  B  8 12DSPATR(PR)
     A                                      OVRDTA
     A            NAME5         16A  B  8 18DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESC5    36A  B  8 37DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B  8 76DSPATR(PR)
     A                                      OVRDTA
     A            U              1A  B  9  2DSPATR(UL)
     A            ID6            4A  B  9  5DSPATR(PR)
     A                                      OVRDTA
     A            L6             2A  B  9 12DSPATR(PR)
     A                                      OVRDTA
     A            NAME6         16A  B  9 18DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESC6    36A  B  9 37DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B  9 76DSPATR(PR)
     A                                      OVRDTA
     A            V              1A  B 10  2DSPATR(UL)
     A            ID7            4A  B 10  5DSPATR(PR)
     A                                      OVRDTA
     A            L7             2A  B 10 12DSPATR(PR)
     A                                      OVRDTA
     A            NAME7         16A  B 10 18DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESC7    36A  B 10 37DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 10 76DSPATR(PR)
     A                                      OVRDTA
     A            W              1A  B 11  2DSPATR(UL)
     A            ID8            4A  B 11  5DSPATR(PR)
     A                                      OVRDTA
     A            L8             2A  B 11 12DSPATR(PR)
     A                                      OVRDTA
     A            NAME8         16A  B 11 18DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESC8    36A  B 11 37DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 11 76DSPATR(PR)
     A                                      OVRDTA
     A            X              1A  B 12  2DSPATR(UL)
     A            ID9            4A  B 12  5DSPATR(PR)
     A                                      OVRDTA
     A            L9             2A  B 12 12DSPATR(PR)
     A                                      OVRDTA
     A            NAME9         16A  B 12 18DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESC9    36A  B 12 37DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 12 76DSPATR(PR)
     A                                      OVRDTA
     A            Y              1A  B 13  2DSPATR(UL)
     A            ID10           4A  B 13  5DSPATR(PR)
     A                                      OVRDTA
     A            L0             2A  B 13 12DSPATR(PR)
     A                                      OVRDTA
     A            NAME10        16A  B 13 18DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESCA    36A  B 13 37DSPATR(PR)
     A                                      OVRDTA
     A            J              1A  B 13 76DSPATR(PR)
     A                                      OVRDTA
     A            Z              1A  B 14  2DSPATR(UL)
     A            ID11           4A  B 14  5DSPATR(PR)
     A                                      OVRDTA
     A            M1             2A  B 14 12DSPATR(PR)
     A                                      OVRDTA
     A            NAME11        16A  B 14 18DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESCB    36A  B 14 37DSPATR(PR)
     A                                      OVRDTA
     A            K              1A  B 14 76DSPATR(PR)
     A                                      OVRDTA
     A            A1             1A  B 15  2DSPATR(UL)
     A            ID12           4A  B 15  5DSPATR(PR)
     A                                      OVRDTA
     A            M2             2A  B 15 12DSPATR(PR)
     A                                      OVRDTA
     A            NAME12        16A  B 15 18DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESCC    36A  B 15 37DSPATR(PR)
     A                                      OVRDTA
     A            L              1A  B 15 76DSPATR(PR)
     A                                      OVRDTA
     A            B2             1A  B 16  2DSPATR(UL)
     A            ID13           4A  B 16  5DSPATR(PR)
     A                                      OVRDTA
     A            M3             2A  B 16 12DSPATR(PR)
     A                                      OVRDTA
     A            NAME13        16A  B 16 18DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESCD    36A  B 16 37DSPATR(PR)
     A                                      OVRDTA
     A            M              1A  B 16 76DSPATR(PR)
     A                                      OVRDTA
     A            ENTERC         1A  B 17  2DSPATR(UL)
     A            ID14           4A  B 17  5DSPATR(PR)
     A                                      OVRDTA
     A            M4             2A  B 17 12DSPATR(PR)
     A                                      OVRDTA
     A            NAME14        16A  B 17 18DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESCE    36A  B 17 37DSPATR(PR)
     A                                      OVRDTA
     A            N              1A  B 17 76DSPATR(PR)
     A                                      OVRDTA
     A            C2             1A  B 18  2DSPATR(UL)
     A            ID15           4A  B 18  5DSPATR(PR)
     A                                      OVRDTA
     A            M5             2A  B 18 12DSPATR(PR)
     A                                      OVRDTA
     A            NAME15        16A  B 18 18DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESCF    36A  B 18 37DSPATR(PR)
     A                                      OVRDTA
     A            O              1A  B 18 76DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('F1-START OVER F2-NEXT SCREE-
     A                                      N F3-END INQUIRY                   -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R EFPOINQH
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 16'PURCHASE ORDER HEADER INQUIRY - PA-
     A                                      GE 1'
     A                                  3 29'***'
     A                                  3 49'***'
     A                                  4 33'---------------'
     A                                  6  2'PO DATE'
     A                                  6 16'REQ NUMBER'
     A                                  6 53'REC DEPT      FOR DEPT'
     A                                  9  2'SHIP DATE     EXPECT DATE      BUD-
     A                                      GET NUMBER     BUDGET AMT     ADDIT-
     A                                      IONAL INFO'
     A                                 12  1'F.O.B.'
     A                                 12 27'VIA'
     A                                 12 53'TERMS'
     A                                 15  1'TRANSPORTATION MODE '
     A                                 15 27'PAYMENT METHOD  '
     A                                 15 53'DELIVERY TERMS  '
     A                                 18  1'VENDOR CODE'
     A                                 18 35'CO.   PRIME   CLASS  DEPARTMENT  E-
     A                                      XPENSE/NW'
     A                                 20  1'VENDOR'
     A                                 20 55'BUYER'
     A            CCD            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            HISTDBLIT     20A  B  1 57DSPATR(PR)
     A                                      OVRDTA
     A            PO             7A  B  3 35DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  3 43DSPATR(PR)
     A                                      OVRDTA
     A            PODATE         8A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            REQNUM        12A  B  5 16DSPATR(PR)
     A                                      OVRDTA
     A            RDEPT          6A  B  5 53DSPATR(PR)
     A                                      OVRDTA
     A            FDEPT          6A  B  5 67DSPATR(PR)
     A                                      OVRDTA
     A            SHIPDATE       8A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            EXPDATE        8A  B  8 15DSPATR(PR)
     A                                      OVRDTA
     A            BUDGETNUM     12A  B  8 32DSPATR(PR)
     A                                      OVRDTA
     A            BUDGETAMT     11A  B  8 49DSPATR(PR)
     A                                      OVRDTA
     A            ADDLINFO      16A  B  8 65DSPATR(PR)
     A                                      OVRDTA
     A            FOB           20A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            VIA           20A  B 11 27DSPATR(PR)
     A                                      OVRDTA
     A            TM             2A  B 11 53DSPATR(PR)
     A                                      OVRDTA
     A            DISC           5A  B 11 56DSPATR(PR)
     A                                      OVRDTA
     A            TIMEOFDISC    18A  B 12 62DSPATR(PR)
     A                                      OVRDTA
     A            TMODE          2A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            TMODESC       20A  B 14  4DSPATR(PR)
     A                                      OVRDTA
     A            TRCHGPAY       2A  B 14 27DSPATR(PR)
     A                                      OVRDTA
     A            TRCPDESC      20A  B 14 30DSPATR(PR)
     A                                      OVRDTA
     A            TMTERMS        3A  B 14 53DSPATR(PR)
     A                                      OVRDTA
     A            TRTDESC       20A  B 14 57DSPATR(PR)
     A                                      OVRDTA
     A            VENDORCODE    11A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            COMPANY        3A  B 17 35DSPATR(PR)
     A                                      OVRDTA
     A            PRIME          3A  B 17 42DSPATR(PR)
     A                                      OVRDTA
     A            SUB            3A  B 17 50DSPATR(PR)
     A                                      OVRDTA
     A            SUBDETL        4A  B 17 58DSPATR(PR)
     A                                      OVRDTA
     A            ADDLDT         6A  B 17 70DSPATR(PR)
     A                                      OVRDTA
     A            VENDORNAME    44A  B 20 10DSPATR(PR)
     A                                      OVRDTA
     A            BUYER         18A  B 20 63DSPATR(PR)
     A                                      OVRDTA
     A            VENDORCSZ     44A  B 21 10DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 23  1DSPATR(PR)
     A  98                                  OVRDTA
     A            COMMANDLN2    79A  B 24  1DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EFPOINQHL
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 16'PURCHASE ORDER HEADER INQUIRY - PA-
     A                                      GE 1'
     A                                  3 29'***'
     A                                  3 49'***'
     A                                  4 33'---------------'
     A                                  6  2'PO DATE'
     A                                  6 16'REQ NUMBER'
     A                                  6 53'REC DEPT      FOR DEPT'
     A                                  9  2'SHIP DATE     EXPECT DATE      BUD-
     A                                      GET NUMBER     BUDGET AMT     ADDIT-
     A                                      IONAL INFO'
     A                                 12  1'F.O.B.'
     A                                 12 27'VIA'
     A                                 12 53'TERMS'
     A                                 15  1'TRANSPORTATION MODE '
     A                                 15 27'PAYMENT METHOD  '
     A                                 15 53'DELIVERY TERMS  '
     A                                 18  1'VENDOR CODE'
     A                                 20  1'VENDOR'
     A                                 20 55'BUYER'
     A            CCD            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            HISTDBLIT     20A  B  1 57DSPATR(PR)
     A                                      OVRDTA
     A            PO             7A  B  3 35DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  3 43DSPATR(PR)
     A                                      OVRDTA
     A            PODATE         8A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            REQNUM        12A  B  5 16DSPATR(PR)
     A                                      OVRDTA
     A            RDEPT          6A  B  5 53DSPATR(PR)
     A                                      OVRDTA
     A            FDEPT          6A  B  5 67DSPATR(PR)
     A                                      OVRDTA
     A            SHIPDATE       8A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            EXPDATE        8A  B  8 15DSPATR(PR)
     A                                      OVRDTA
     A            BUDGETNUM     12A  B  8 32DSPATR(PR)
     A                                      OVRDTA
     A            BUDGETAMT     11A  B  8 49DSPATR(PR)
     A                                      OVRDTA
     A            ADDLINFO      16A  B  8 65DSPATR(PR)
     A                                      OVRDTA
     A            FOB           20A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            VIA           20A  B 11 27DSPATR(PR)
     A                                      OVRDTA
     A            TM             2A  B 11 53DSPATR(PR)
     A                                      OVRDTA
     A            DISC           5A  B 11 56DSPATR(PR)
     A                                      OVRDTA
     A            TIMEOFDISC    18A  B 12 62DSPATR(PR)
     A                                      OVRDTA
     A            TMODE          2A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            TMODESC       20A  B 14  4DSPATR(PR)
     A                                      OVRDTA
     A            TRCHGPAY       2A  B 14 27DSPATR(PR)
     A                                      OVRDTA
     A            TRCPDESC      20A  B 14 30DSPATR(PR)
     A                                      OVRDTA
     A            TMTERMS        3A  B 14 53DSPATR(PR)
     A                                      OVRDTA
     A            TRTDESC       20A  B 14 57DSPATR(PR)
     A                                      OVRDTA
     A            VENDORCODE    11A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            VENDORNAME    44A  B 20 10DSPATR(PR)
     A                                      OVRDTA
     A            BUYER         18A  B 20 63DSPATR(PR)
     A                                      OVRDTA
     A            VENDORCSZ     44A  B 21 10DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 23  1DSPATR(PR)
     A  98                                  OVRDTA
     A            COMMANDLN2    79A  B 24  1DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FBLKTINQ
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 20'- - -   I T E M   S T A T U S  - -'
     A                                  1 55'-'
     A                                  1 75'MQ1-6'
     A                                  2 22'REQUIREMENTS ORDER INQUIRY SCREEN'
     A                                  3  1'CODE'
     A                                  5  5'PO NUMBER   ITEM #   UM     REQUIR-
     A                                      EMENT DATE      EXPIRATION DATE'
     A                                  6  5'---------   ------   --     -------
     A                                      ----------      ---------------'
     A                                 21  1'  PRESS  "f1"  FOR BASIC INQUIRY F-
     A                                      IELDS'
     A                                 22 10'"f2"  FOR MORE INQUIRY FIELDS'
     A                                 22 46'"f6"  FOR RESERVATION INQUIRY'
     A                                 23 10'"f7"  FOR NEXT INQUIRY'
     A                                 23 46'"f3"  TO END PROGRAM'
     A            COM            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            STRCODE        7A  B  3  6DSPATR(PR)
     A                                      OVRDTA
     A            PONUM1         7A  B  7  5DSPATR(PR)
     A                                      OVRDTA
     A            IT1            5A  B  7 17DSPATR(PR)
     A                                      OVRDTA
     A            U1             2A  B  7 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE1        8A  B  7 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE1        8A  B  7 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM2         7A  B  8  5DSPATR(PR)
     A                                      OVRDTA
     A            IT2            5A  B  8 17DSPATR(PR)
     A                                      OVRDTA
     A            U2             2A  B  8 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE2        8A  B  8 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE2        8A  B  8 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM3         7A  B  9  5DSPATR(PR)
     A                                      OVRDTA
     A            IT3            5A  B  9 17DSPATR(PR)
     A                                      OVRDTA
     A            U3             2A  B  9 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE3        8A  B  9 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE3        8A  B  9 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM4         7A  B 10  5DSPATR(PR)
     A                                      OVRDTA
     A            IT4            5A  B 10 17DSPATR(PR)
     A                                      OVRDTA
     A            U4             2A  B 10 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE4        8A  B 10 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE4        8A  B 10 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM5         7A  B 11  5DSPATR(PR)
     A                                      OVRDTA
     A            IT5            5A  B 11 17DSPATR(PR)
     A                                      OVRDTA
     A            U5             2A  B 11 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE5        8A  B 11 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE5        8A  B 11 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM6         7A  B 12  5DSPATR(PR)
     A                                      OVRDTA
     A            IT6            5A  B 12 17DSPATR(PR)
     A                                      OVRDTA
     A            U6             2A  B 12 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE6        8A  B 12 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE6        8A  B 12 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM7         7A  B 13  5DSPATR(PR)
     A                                      OVRDTA
     A            IT7            5A  B 13 17DSPATR(PR)
     A                                      OVRDTA
     A            U7             2A  B 13 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE7        8A  B 13 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE7        8A  B 13 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM8         7A  B 14  5DSPATR(PR)
     A                                      OVRDTA
     A            IT8            5A  B 14 17DSPATR(PR)
     A                                      OVRDTA
     A            U8             2A  B 14 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE8        8A  B 14 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE8        8A  B 14 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM9         7A  B 15  5DSPATR(PR)
     A                                      OVRDTA
     A            IT9            5A  B 15 17DSPATR(PR)
     A                                      OVRDTA
     A            U9             2A  B 15 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE9        8A  B 15 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE9        8A  B 15 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM10        7A  B 16  5DSPATR(PR)
     A                                      OVRDTA
     A            IT10           5A  B 16 17DSPATR(PR)
     A                                      OVRDTA
     A            U0             2A  B 16 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE10       8A  B 16 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE10       8A  B 16 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM11        7A  B 17  5DSPATR(PR)
     A                                      OVRDTA
     A            IT11           5A  B 17 17DSPATR(PR)
     A                                      OVRDTA
     A            M1             2A  B 17 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE11       8A  B 17 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE11       8A  B 17 59DSPATR(PR)
     A                                      OVRDTA
     A            MORE11MSG     69A  B 19  2DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FEARETRN
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 15'R E T U R N   A   R E Q U I S I T'
     A                                  1 49'I O N'
     A                                  3 10'YOUR EMPLOYEE ID NUMBER: '
     A                                  5 10'REASON FOR RETURN:'
     A                                  8  7'LEVEL  I/O  QUEUED     APPROVED  E-
     A                                      MPL   EMPL NAME'
     A                                 22  1'TYPE REASON FOR RETURN, AND PUT AN'
     A                                 22 36'"X" NEXT TO LEVEL TO RETURN TO, OR'
     A                                 22 71'HIT "f3"'
     A                                 23  1'TO EXIT WITHOUT RETURNING REQUISIT-
     A                                      ION.'
     A            EMPL           4A  B  3 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            REASON1       36A  B  5 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            REASON2       36A  B  6 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            A              1A  B  9  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            L1             2A  B  9  8DSPATR(PR)
     A                                      OVRDTA
     A            M              1A  B  9 15DSPATR(PR)
     A                                      OVRDTA
     A            QUEUED01       8A  B  9 19DSPATR(PR)
     A                                      OVRDTA
     A            APPRVD01       8A  B  9 30DSPATR(PR)
     A                                      OVRDTA
     A            EM01           4A  B  9 40DSPATR(PR)
     A                                      OVRDTA
     A            NAME01        16A  B  9 47DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B 10  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            L2             2A  B 10  8DSPATR(PR)
     A                                      OVRDTA
     A            N              1A  B 10 15DSPATR(PR)
     A                                      OVRDTA
     A            QUEUED02       8A  B 10 19DSPATR(PR)
     A                                      OVRDTA
     A            APPRVD02       8A  B 10 30DSPATR(PR)
     A                                      OVRDTA
     A            EM02           4A  B 10 40DSPATR(PR)
     A                                      OVRDTA
     A            NAME02        16A  B 10 47DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 11  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            L3             2A  B 11  8DSPATR(PR)
     A                                      OVRDTA
     A            O              1A  B 11 15DSPATR(PR)
     A                                      OVRDTA
     A            QUEUED03       8A  B 11 19DSPATR(PR)
     A                                      OVRDTA
     A            APPRVD03       8A  B 11 30DSPATR(PR)
     A                                      OVRDTA
     A            EM03           4A  B 11 40DSPATR(PR)
     A                                      OVRDTA
     A            NAME03        16A  B 11 47DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 12  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            L4             2A  B 12  8DSPATR(PR)
     A                                      OVRDTA
     A            P              1A  B 12 15DSPATR(PR)
     A                                      OVRDTA
     A            QUEUED04       8A  B 12 19DSPATR(PR)
     A                                      OVRDTA
     A            APPRVD04       8A  B 12 30DSPATR(PR)
     A                                      OVRDTA
     A            EM04           4A  B 12 40DSPATR(PR)
     A                                      OVRDTA
     A            NAME04        16A  B 12 47DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 13  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            L5             2A  B 13  8DSPATR(PR)
     A                                      OVRDTA
     A            Q              1A  B 13 15DSPATR(PR)
     A                                      OVRDTA
     A            QUEUED05       8A  B 13 19DSPATR(PR)
     A                                      OVRDTA
     A            APPRVD05       8A  B 13 30DSPATR(PR)
     A                                      OVRDTA
     A            EM05           4A  B 13 40DSPATR(PR)
     A                                      OVRDTA
     A            NAME05        16A  B 13 47DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 14  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A            L6             2A  B 14  8DSPATR(PR)
     A                                      OVRDTA
     A            R              1A  B 14 15DSPATR(PR)
     A                                      OVRDTA
     A            QUEUED06       8A  B 14 19DSPATR(PR)
     A                                      OVRDTA
     A            APPRVD06       8A  B 14 30DSPATR(PR)
     A                                      OVRDTA
     A            EM06           4A  B 14 40DSPATR(PR)
     A                                      OVRDTA
     A            NAME06        16A  B 14 47DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 15  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A            L7             2A  B 15  8DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B 15 15DSPATR(PR)
     A                                      OVRDTA
     A            QUEUED07       8A  B 15 19DSPATR(PR)
     A                                      OVRDTA
     A            APPRVD07       8A  B 15 30DSPATR(PR)
     A                                      OVRDTA
     A            EM07           4A  B 15 40DSPATR(PR)
     A                                      OVRDTA
     A            NAME07        16A  B 15 47DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 16  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A            L8             2A  B 16  8DSPATR(PR)
     A                                      OVRDTA
     A            T              1A  B 16 15DSPATR(PR)
     A                                      OVRDTA
     A            QUEUED08       8A  B 16 19DSPATR(PR)
     A                                      OVRDTA
     A            APPRVD08       8A  B 16 30DSPATR(PR)
     A                                      OVRDTA
     A            EM08           4A  B 16 40DSPATR(PR)
     A                                      OVRDTA
     A            NAME08        16A  B 16 47DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 17  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A            L9             2A  B 17  8DSPATR(PR)
     A                                      OVRDTA
     A            U              1A  B 17 15DSPATR(PR)
     A                                      OVRDTA
     A            QUEUED09       8A  B 17 19DSPATR(PR)
     A                                      OVRDTA
     A            APPRVD09       8A  B 17 30DSPATR(PR)
     A                                      OVRDTA
     A            EM09           4A  B 17 40DSPATR(PR)
     A                                      OVRDTA
     A            NAME09        16A  B 17 47DSPATR(PR)
     A                                      OVRDTA
     A            J              1A  B 18  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  67                                  DSPATR(RI)
     A  67                                  DSPATR(PC)
     A            L0             2A  B 18  8DSPATR(PR)
     A                                      OVRDTA
     A            V              1A  B 18 15DSPATR(PR)
     A                                      OVRDTA
     A            QUEUED10       8A  B 18 19DSPATR(PR)
     A                                      OVRDTA
     A            APPRVD10       8A  B 18 30DSPATR(PR)
     A                                      OVRDTA
     A            EM10           4A  B 18 40DSPATR(PR)
     A                                      OVRDTA
     A            NAME10        16A  B 18 47DSPATR(PR)
     A                                      OVRDTA
     A            K              1A  B 19  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  74                                  DSPATR(RI)
     A  74                                  DSPATR(PC)
     A            M1             2A  B 19  8DSPATR(PR)
     A                                      OVRDTA
     A            W              1A  B 19 15DSPATR(PR)
     A                                      OVRDTA
     A            QUEUED11       8A  B 19 19DSPATR(PR)
     A                                      OVRDTA
     A            APPRVD11       8A  B 19 30DSPATR(PR)
     A                                      OVRDTA
     A            EM11           4A  B 19 40DSPATR(PR)
     A                                      OVRDTA
     A            NAME11        16A  B 19 47DSPATR(PR)
     A                                      OVRDTA
     A            L              1A  B 20  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  81                                  DSPATR(RI)
     A  81                                  DSPATR(PC)
     A            M2             2A  B 20  8DSPATR(PR)
     A                                      OVRDTA
     A            X              1A  B 20 15DSPATR(PR)
     A                                      OVRDTA
     A            QUEUED12       8A  B 20 19DSPATR(PR)
     A                                      OVRDTA
     A            APPRVD12       8A  B 20 30DSPATR(PR)
     A                                      OVRDTA
     A            EM12           4A  B 20 40DSPATR(PR)
     A                                      OVRDTA
     A            NAME12        16A  B 20 47DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-  END    PROGRAM        -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FEARETRO
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 15'R E T U R N   A   R E Q U I S I T'
     A                                  1 49'I O N'
     A                                  4 10'YOUR EMPLOYEE ID NUMBER: '
     A                                  6 10'REASON FOR RETURN:'
     A                                 11 10'TYPE REQUESTED INFORMATION AND HIT'
     A                                 11 45'"ENTER" TO RETURN THE REQUISITION.'
     A                                 12 10'HIT "f3" TO EXIT WITHOUT RETURNING'
     A                                 12 45'REQUISITION.'
     A            EMPL           4A  B  4 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            REASON1       36A  B  6 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            REASON2       36A  B  7 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-END PROGRAM             -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FEAUNAVA
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 13'REQUSITION APPROVAL SYSTEM - UNAVA-
     A                                      ILABILITY'
     A                                  3  1'This screen is used when an approv-
     A                                      er goes inactive: on vacation, trav-
     A                                      elling,'
     A                                  4  1'etc.'
     A                                  6  1'Enter employee ID of person who wi-
     A                                      ll be unavailable for approving'
     A                                  9  1'Enter employee ID of person who wi-
     A                                      ll be the alternate for approving'
     A                                 12  1'If you don"t know the employee ID,'
     A                                 12 36'use f7 for employee inquiry.'
     A                                 14  1'Note: If no alternate is specified-
     A                                       and the F3 key is pressed, the ID '
     A                                 15  1'of the person who is unavailable w-
     A                                      ill remain in the active state and '
     A                                 16  1'requisitions will continue to queu-
     A                                      e to that ID. The old ID will '
     A                                 17  1'automatically be re-activated when-
     A                                       the user signs back into the '
     A                                 18  1'approval program.'
     A            EMPL           4A  B  7 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            EMPLA          4A  B 10 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-CANCEL INACTIVE F7-EMPLO-
     A                                      YEE INQUIRY                        -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FEAVACA
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 13'REQUSITION APPROVAL SYSTEM - GO IN-
     A                                      ACTIVE'
     A                                  3  1'This screen is used when an approv-
     A                                      er goes inactive: on vacation, trav-
     A                                      elling,'
     A                                  4  1'etc.'
     A                                  6  1'Enter employee ID of person who wi-
     A                                      ll be your alternate for requisitio-
     A                                      n'
     A                                  7  1'approvals:'
     A                                 11  1'If you don"t know the employee ID,'
     A                                 11 36'use f7 for employee inquiry.'
     A                                 13  1'Note: you must enter an alternate'
     A                                 13 35'to go inactive.  If you exit witho-
     A                                      ut'
     A                                 14  1'designating an alternate, you will'
     A                                 14 36'remain in an active state and requ-
     A                                      isitions'
     A                                 15  1'will continue to queue to you.  Yo-
     A                                      u will automatically be reactivated-
     A                                       the'
     A                                 16  1'next time you sign into the approv-
     A                                      al program.'
     A            EMPL           4A  B  9 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-CANCEL INACTIVE F7-EMPLO-
     A                                      YEE INQUIRY                        -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FINQKWM
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 20'KEYWORD/MODIFIER RECORDS FROM INQU-
     A                                      IRY'
     A                                  2 16'-----------------------------------
     A                                      ----------'
     A                                  3  3'ENTER AN "X" BY THE KEYWORD  THAT'
     A                                  3 37'YOU WISH TO INQUIRE ON AND PRESS'
     A                                  4  3'THE "ENTER" KEY.  IF YOU DO NOT WI-
     A                                      SH TO SELECT ONE, PRESS "F3" TO EXI-
     A                                      T.'
     A            A1             1A  B  6  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            MAN1          50A  B  6  4DSPATR(PR)
     A                                      OVRDTA
     A            C1             1A  B  7  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            MAN3          50A  B  7  4DSPATR(PR)
     A                                      OVRDTA
     A            E1             1A  B  8  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            MAN5          50A  B  8  4DSPATR(PR)
     A                                      OVRDTA
     A            G1             1A  B  9  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            MAN7          50A  B  9  4DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 10  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            MAN9          50A  B 10  4DSPATR(PR)
     A                                      OVRDTA
     A            K              1A  B 11  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            MAN11         50A  B 11  4DSPATR(PR)
     A                                      OVRDTA
     A            M              1A  B 12  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            MAN13         50A  B 12  4DSPATR(PR)
     A                                      OVRDTA
     A            O              1A  B 13  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            MAN15         50A  B 13  4DSPATR(PR)
     A                                      OVRDTA
     A            Q              1A  B 14  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            MAN17         50A  B 14  4DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            MAN19         50A  B 15  4DSPATR(PR)
     A                                      OVRDTA
     A            U              1A  B 16  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            MAN21         50A  B 16  4DSPATR(PR)
     A                                      OVRDTA
     A            W              1A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A            MAN23         50A  B 17  4DSPATR(PR)
     A                                      OVRDTA
     A            Y              1A  B 18  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A            MAN25         50A  B 18  4DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B 19  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A            MAN27         50A  B 19  4DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 20  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  57                                  DSPATR(RI)
     A  57                                  DSPATR(PC)
     A            MAN29         50A  B 20  4DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 21  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            MAN31         50A  B 21  4DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 22  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A            MAN33         50A  B 22  4DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-START OVER f2-NEXT f3-EX-
     A                                      IT                                 -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FINQMANUF
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 20'MANUFACTURER RECORDS FROM INQUIRY'
     A                                  2 16'-----------------------------------
     A                                      -------'
     A                                  3  3'ENTER AN "X" BY THE MANUFACTURER N-
     A                                      AME THAT YOU WISH TO INQUIRE ON AND-
     A                                       PRESS'
     A                                  4  3'THE "ENTER" KEY.  IF YOU DO NOT WI-
     A                                      SH TO SELECT ONE, PRESS "F3" TO EXI-
     A                                      T.'
     A            A1             1A  B  6  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            MAN1          26A  B  6  4DSPATR(PR)
     A                                      OVRDTA
     A            B1             1A  B  6 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            MAN2          26A  B  6 38DSPATR(PR)
     A                                      OVRDTA
     A            C1             1A  B  7  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            MAN3          26A  B  7  4DSPATR(PR)
     A                                      OVRDTA
     A            D1             1A  B  7 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            MAN4          26A  B  7 38DSPATR(PR)
     A                                      OVRDTA
     A            E1             1A  B  8  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            MAN5          26A  B  8  4DSPATR(PR)
     A                                      OVRDTA
     A            F1             1A  B  8 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            MAN6          26A  B  8 38DSPATR(PR)
     A                                      OVRDTA
     A            G1             1A  B  9  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            MAN7          26A  B  9  4DSPATR(PR)
     A                                      OVRDTA
     A            H1             1A  B  9 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            MAN8          26A  B  9 38DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 10  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            MAN9          26A  B 10  4DSPATR(PR)
     A                                      OVRDTA
     A            J              1A  B 10 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            MAN10         26A  B 10 38DSPATR(PR)
     A                                      OVRDTA
     A            K              1A  B 11  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            MAN11         26A  B 11  4DSPATR(PR)
     A                                      OVRDTA
     A            L              1A  B 11 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            MAN12         26A  B 11 38DSPATR(PR)
     A                                      OVRDTA
     A            M              1A  B 12  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            MAN13         26A  B 12  4DSPATR(PR)
     A                                      OVRDTA
     A            N              1A  B 12 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            MAN14         26A  B 12 38DSPATR(PR)
     A                                      OVRDTA
     A            O              1A  B 13  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            MAN15         26A  B 13  4DSPATR(PR)
     A                                      OVRDTA
     A            P              1A  B 13 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            MAN16         26A  B 13 38DSPATR(PR)
     A                                      OVRDTA
     A            Q              1A  B 14  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            MAN17         26A  B 14  4DSPATR(PR)
     A                                      OVRDTA
     A            R              1A  B 14 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            MAN18         26A  B 14 38DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            MAN19         26A  B 15  4DSPATR(PR)
     A                                      OVRDTA
     A            T              1A  B 15 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A            MAN20         26A  B 15 38DSPATR(PR)
     A                                      OVRDTA
     A            U              1A  B 16  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            MAN21         26A  B 16  4DSPATR(PR)
     A                                      OVRDTA
     A            V              1A  B 16 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A            MAN22         26A  B 16 38DSPATR(PR)
     A                                      OVRDTA
     A            W              1A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A            MAN23         26A  B 17  4DSPATR(PR)
     A                                      OVRDTA
     A            X              1A  B 17 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(PC)
     A            MAN24         26A  B 17 38DSPATR(PR)
     A                                      OVRDTA
     A            Y              1A  B 18  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A            MAN25         26A  B 18  4DSPATR(PR)
     A                                      OVRDTA
     A            Z              1A  B 18 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A            MAN26         26A  B 18 38DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B 19  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A            MAN27         26A  B 19  4DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B 19 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  55                                  DSPATR(RI)
     A  55                                  DSPATR(PC)
     A            MAN28         26A  B 19 38DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 20  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  57                                  DSPATR(RI)
     A  57                                  DSPATR(PC)
     A            MAN29         26A  B 20  4DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 20 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  59                                  DSPATR(RI)
     A  59                                  DSPATR(PC)
     A            MAN30         26A  B 20 38DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 21  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            MAN31         26A  B 21  4DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 21 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            MAN32         26A  B 21 38DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 22  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A            MAN33         26A  B 22  4DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 22 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  67                                  DSPATR(RI)
     A  67                                  DSPATR(PC)
     A            MAN34         26A  B 22 38DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-START OVER f2-NEXT f3-EX-
     A                                      IT                                 -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FINQVEN
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 22'VENDOR NAME RECORDS FROM INQUIRY'
     A                                  2 16'-----------------------------------
     A                                      ----------'
     A                                  3  3'ENTER AN "X" BY THE VENDOR THAT YO-
     A                                      U WISH TO INQUIRE ON AND PRESS'
     A                                  4  3'THE "ENTER" KEY.  IF YOU DO NOT WI-
     A                                      SH TO SELECT ONE, PRESS "F3" TO EXI-
     A                                      T.'
     A            A1             1A  B  6  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            CODE1         10A  B  6  4DSPATR(PR)
     A                                      OVRDTA
     A            MAN1          44A  B  6 17DSPATR(PR)
     A                                      OVRDTA
     A            C1             1A  B  7  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            CODE2         10A  B  7  4DSPATR(PR)
     A                                      OVRDTA
     A            MAN3          44A  B  7 17DSPATR(PR)
     A                                      OVRDTA
     A            E1             1A  B  8  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            CODE3         10A  B  8  4DSPATR(PR)
     A                                      OVRDTA
     A            MAN5          44A  B  8 17DSPATR(PR)
     A                                      OVRDTA
     A            G1             1A  B  9  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            CODE4         10A  B  9  4DSPATR(PR)
     A                                      OVRDTA
     A            MAN7          44A  B  9 17DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 10  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            CODE5         10A  B 10  4DSPATR(PR)
     A                                      OVRDTA
     A            MAN9          44A  B 10 17DSPATR(PR)
     A                                      OVRDTA
     A            K              1A  B 11  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            CODE6         10A  B 11  4DSPATR(PR)
     A                                      OVRDTA
     A            MAN11         44A  B 11 17DSPATR(PR)
     A                                      OVRDTA
     A            M              1A  B 12  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            CODE7         10A  B 12  4DSPATR(PR)
     A                                      OVRDTA
     A            MAN13         44A  B 12 17DSPATR(PR)
     A                                      OVRDTA
     A            O              1A  B 13  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            CODE8         10A  B 13  4DSPATR(PR)
     A                                      OVRDTA
     A            MAN15         44A  B 13 17DSPATR(PR)
     A                                      OVRDTA
     A            Q              1A  B 14  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            CODE9         10A  B 14  4DSPATR(PR)
     A                                      OVRDTA
     A            MAN17         44A  B 14 17DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            CODE10        10A  B 15  4DSPATR(PR)
     A                                      OVRDTA
     A            MAN19         44A  B 15 17DSPATR(PR)
     A                                      OVRDTA
     A            U              1A  B 16  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            CODE11        10A  B 16  4DSPATR(PR)
     A                                      OVRDTA
     A            MAN21         44A  B 16 17DSPATR(PR)
     A                                      OVRDTA
     A            W              1A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A            CODE12        10A  B 17  4DSPATR(PR)
     A                                      OVRDTA
     A            MAN23         44A  B 17 17DSPATR(PR)
     A                                      OVRDTA
     A            Y              1A  B 18  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A            CODE13        10A  B 18  4DSPATR(PR)
     A                                      OVRDTA
     A            MAN25         44A  B 18 17DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B 19  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A            CODE14        10A  B 19  4DSPATR(PR)
     A                                      OVRDTA
     A            MAN27         44A  B 19 17DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 20  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  57                                  DSPATR(RI)
     A  57                                  DSPATR(PC)
     A            CODE15        10A  B 20  4DSPATR(PR)
     A                                      OVRDTA
     A            MAN29         44A  B 20 17DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 21  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            CODE16        10A  B 21  4DSPATR(PR)
     A                                      OVRDTA
     A            MAN31         44A  B 21 17DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 22  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A            CODE17        10A  B 22  4DSPATR(PR)
     A                                      OVRDTA
     A            MAN33         44A  B 22 17DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-START OVER f2-NEXT f3-EX-
     A                                      IT                                 -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FINVPBV
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 25'PURCHASE ORDER INQUIRY BY VENDOR'
     A                                  3  7'VENDOR CODE ==>'
     A                                  3 29'***'
     A                                  3 49'***'
     A                                  4 33'---------------'
     A                                  6  7'VENDOR DATA ==>'
     A                                  9  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                 11  7'PURCHASE ORDERS ==>     '
     A                                 17  1'"f1" TO VIEW PREV PO"S'
     A                                 18  1'"f2" TO VIEW MORE PO"S'
     A                                 19  1'"f5" TO PRINT SCREEN'
     A                                 20  1'"f3" RETURN TO PREV SCREEN    '
     A                                 22  1'PLACE  "X"  IN BOX NEXT TO PURCHAS-
     A                                      E ORDER(S) TO BE REVIEWED  AND  PRE-
     A                                      SS  "ENTER"'
     A            VC             7A  B  3 35DSPATR(PR)
     A                                      OVRDTA
     A            VI             3A  B  3 43DSPATR(PR)
     A                                      OVRDTA
     A            VENDORNAME    44A  B  6 25DSPATR(PR)
     A                                      OVRDTA
     A            VENDORCSZ     44A  B  7 25DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B 11 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            PORLSE01      11A  B 11 36DSPATR(PR)
     A                                      OVRDTA
     A            INHIST01      19   B 11 50DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B 12 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            PORLSE02      11A  B 12 36DSPATR(PR)
     A                                      OVRDTA
     A            INHIST02      19   B 12 50DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 13 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            PORLSE03      11A  B 13 36DSPATR(PR)
     A                                      OVRDTA
     A            INHIST03      19   B 13 50DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 14 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            PORLSE04      11A  B 14 36DSPATR(PR)
     A                                      OVRDTA
     A            INHIST04      19   B 14 50DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 15 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            PORLSE05      11A  B 15 36DSPATR(PR)
     A                                      OVRDTA
     A            INHIST05      19   B 15 50DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 16 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            PORLSE06      11A  B 16 36DSPATR(PR)
     A                                      OVRDTA
     A            INHIST06      19   B 16 50DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 17 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            PORLSE07      11A  B 17 36DSPATR(PR)
     A                                      OVRDTA
     A            INHIST07      19   B 17 50DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 18 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            PORLSE08      11A  B 18 36DSPATR(PR)
     A                                      OVRDTA
     A            INHIST08      19   B 18 50DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 19 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            PORLSE09      11A  B 19 36DSPATR(PR)
     A                                      OVRDTA
     A            INHIST09      19   B 19 50DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            J              1A  B 20 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            PORLSE10      11A  B 20 36DSPATR(PR)
     A                                      OVRDTA
     A            INHIST10      19   B 20 50DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-PREV SCREEN             -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FINVPO
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 19'P U R C H A S E   O R D E R   I N'
     A                                  1 53'Q U I R Y'
     A                                  2 16'-----------------------------------
     A                                      ---------------'
     A                                  8 22'PURCHASE ORDER NUMBER'
     A                                 12  1'***  OPTIONS:'
     A                                 13  1'----------------'
     A                                 16  6'ENTER   ITEM NUMBER'
     A                                 16 35'{OR}   CORP CODE'
     A                                 16 64'IF DESIRED'
     A                                 20  1'PRESS  "ENTER"  TO CONTINUE'
     A                                 22  1'PRESS  "f3" TO RETURN TO PREV SCRE-
     A                                      EN'
     A            HISTMSG       35   B  5 22DSPATR(HI)
     A                                      DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            PO             7A  B  8 46DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  8 54DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4Y 0B 16 28DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            CORPCDE        7A  B 16 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-PREV SCREEN             -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FMTLSTAT1
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 19'- - -  I T E M   S T A T U S - - -'
     A                                  1 74'MQ1-1'
     A                                 23  1'  PRESS  "f3"  TO END PROGRAM'
     A            COMP           4A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            STRCODE       12A  B  3  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            INSTRUCTLI    65A  B  3 15DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTL2    65A  B  4 15DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTL3    65A  B  5 15DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTL4    65A  B  6 15DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FMTLSTAT1B
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 20'- - -  I T E M   S T A T U S  - -'
     A                                  1 54'-'
     A                                  1 75'MQ1-1B'
     A                                  7  7'O V E R A L L   D A T A   B A S E'
     A                                  7 43'O N H A N D   I N Q U I R Y'
     A                                  9  3'PLANT     LOC 1'
     A                                  9 27'LOC2'
     A                                  9 39'ONHAND   STR   REQ.    ITEM ORDER'
     A                                  9 74'EXP.'
     A                                 10 49'UM   ORDER    NO.  UM    DATE'
     A                                 22  7'ENTER AN "X" IN FRONT OF THE DESIR-
     A                                      ED PLANT FOR MORE INFORMATION OR'
     A                                 23  4'PRESS  "f5" TO PRINT SCREEN, "f7"'
     A                                 23 38'TO ENTER NEXT CODE, "f3" TO END PR-
     A                                      OGRAM'
     A            COM            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            STRCODE        7A  B  3  1DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTLI    65A  B  3 10DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTL2    65A  B  4 10DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B 12  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  67                                  DSPATR(RI)
     A  67                                  DSPATR(PC)
     A            DES1           4A  B 12  4DSPATR(PR)
     A                                      OVRDTA
     A            LOC1PLT1      12A  B 12 10DSPATR(PR)
     A                                      OVRDTA
     A            LOC2PLT1      12A  B 12 24DSPATR(PR)
     A                                      OVRDTA
     A            ONHDPLT1       9A  B 12 38DSPATR(PR)
     A                                      OVRDTA
     A            U1             2A  B 12 49DSPATR(PR)
     A                                      OVRDTA
     A            REQORD1        7A  B 12 53DSPATR(PR)
     A                                      OVRDTA
     A            ITM1           4A  B 12 62DSPATR(PR)
     A                                      OVRDTA
     A            O1             2A  B 12 68DSPATR(PR)
     A                                      OVRDTA
     A            REQDATE1       8A  B 12 72DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B 13  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  69                                  DSPATR(RI)
     A  69                                  DSPATR(PC)
     A            DES2           4A  B 13  4DSPATR(PR)
     A                                      OVRDTA
     A            LOC1PLT2      12A  B 13 10DSPATR(PR)
     A                                      OVRDTA
     A            LOC2PLT2      12A  B 13 24DSPATR(PR)
     A                                      OVRDTA
     A            OHNDPLT2       9A  B 13 38DSPATR(PR)
     A                                      OVRDTA
     A            U2             2A  B 13 49DSPATR(PR)
     A                                      OVRDTA
     A            REQORD2        7A  B 13 53DSPATR(PR)
     A                                      OVRDTA
     A            ITM2           4A  B 13 62DSPATR(PR)
     A                                      OVRDTA
     A            O2             2A  B 13 68DSPATR(PR)
     A                                      OVRDTA
     A            REQDATE2       8A  B 13 72DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 14  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  72                                  DSPATR(RI)
     A  72                                  DSPATR(PC)
     A            DES3           4A  B 14  4DSPATR(PR)
     A                                      OVRDTA
     A            LOC1PLT3      12A  B 14 10DSPATR(PR)
     A                                      OVRDTA
     A            LOC2PLT3      12A  B 14 24DSPATR(PR)
     A                                      OVRDTA
     A            OHNDPLT3       9A  B 14 38DSPATR(PR)
     A                                      OVRDTA
     A            U3             2A  B 14 49DSPATR(PR)
     A                                      OVRDTA
     A            REQORD3        7A  B 14 53DSPATR(PR)
     A                                      OVRDTA
     A            ITM3           4A  B 14 62DSPATR(PR)
     A                                      OVRDTA
     A            O3             2A  B 14 68DSPATR(PR)
     A                                      OVRDTA
     A            REQDATE3       8A  B 14 72DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  74                                  DSPATR(RI)
     A  74                                  DSPATR(PC)
     A            DES4           4A  B 15  4DSPATR(PR)
     A                                      OVRDTA
     A            LOC1PLT4      12A  B 15 10DSPATR(PR)
     A                                      OVRDTA
     A            LOC2PLT4      12A  B 15 24DSPATR(PR)
     A                                      OVRDTA
     A            OHNDPLT4       9A  B 15 38DSPATR(PR)
     A                                      OVRDTA
     A            U4             2A  B 15 49DSPATR(PR)
     A                                      OVRDTA
     A            REQORD4        7A  B 15 53DSPATR(PR)
     A                                      OVRDTA
     A            ITM4           4A  B 15 62DSPATR(PR)
     A                                      OVRDTA
     A            O4             2A  B 15 68DSPATR(PR)
     A                                      OVRDTA
     A            REQDATE4       8A  B 15 72DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 16  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  83                                  DSPATR(RI)
     A  83                                  DSPATR(PC)
     A            DES5           4A  B 16  4DSPATR(PR)
     A                                      OVRDTA
     A            LOC1PLT5      12A  B 16 10DSPATR(PR)
     A                                      OVRDTA
     A            LOC2PLT5      12A  B 16 24DSPATR(PR)
     A                                      OVRDTA
     A            ONHDPLT5       9A  B 16 38DSPATR(PR)
     A                                      OVRDTA
     A            U5             2A  B 16 49DSPATR(PR)
     A                                      OVRDTA
     A            REQORD5        7A  B 16 53DSPATR(PR)
     A                                      OVRDTA
     A            ITM5           4A  B 16 62DSPATR(PR)
     A                                      OVRDTA
     A            O5             2A  B 16 68DSPATR(PR)
     A                                      OVRDTA
     A            REQDATE5       8A  B 16 72DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  85                                  DSPATR(RI)
     A  85                                  DSPATR(PC)
     A            DES6           4A  B 17  4DSPATR(PR)
     A                                      OVRDTA
     A            LOC1PLT9      12A  B 17 10DSPATR(PR)
     A                                      OVRDTA
     A            LOC2PLT9      12A  B 17 24DSPATR(PR)
     A                                      OVRDTA
     A            ONHDPLT9       9A  B 17 38DSPATR(PR)
     A                                      OVRDTA
     A            U9             2A  B 17 49DSPATR(PR)
     A                                      OVRDTA
     A            REQORD9        7A  B 17 53DSPATR(PR)
     A                                      OVRDTA
     A            ITM9           4A  B 17 62DSPATR(PR)
     A                                      OVRDTA
     A            O9             2A  B 17 68DSPATR(PR)
     A                                      OVRDTA
     A            REQDATE9       8A  B 17 72DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 18  1DSPATR(UL)
     A            DES7           4A  B 18  4DSPATR(PR)
     A                                      OVRDTA
     A            LOC1MIXCTR    12A  B 18 10DSPATR(PR)
     A                                      OVRDTA
     A            LOC2MIXCTR    12A  B 18 24DSPATR(PR)
     A                                      OVRDTA
     A            ONHDPLTM       9A  B 18 38DSPATR(PR)
     A                                      OVRDTA
     A            UM             2A  B 18 49DSPATR(PR)
     A                                      OVRDTA
     A            REQORDM        7A  B 18 53DSPATR(PR)
     A                                      OVRDTA
     A            ITMM           4A  B 18 62DSPATR(PR)
     A                                      OVRDTA
     A            OM             2A  B 18 68DSPATR(PR)
     A                                      OVRDTA
     A            REQDATEM       8A  B 18 72DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f7-NEXT CODE f3-EXIT PROGRA-
     A                                      M                                  -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FMTLSTAT2
     A*%%TS  SD  20000412  134350  A257947     REL-V4R4M0  5769-PW1
     A N90                                  CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A N90                                  CF05
     A N90                                  CF06
     A                                      CF07
     A N90                                  CF08
     A                                      PUTOVR
     A                                  1 20'- - -   I T E M   S T A T U S   -'
     A                                  1 54'- -'
     A                                  1 75'MQ1-2'
     A                                  2 66'TECH. BULLETIN'
     A                                      DSPATR(BL)
     A N91                                  DSPATR(ND)
     A                                  4  1'CODE'
     A                                  4 17' PREV-CODE'
     A                                  4 44'CLASS'
     A                                  4 58'DEFAULT DEPT'
     A                                  9  1'UM'
     A                                  9 25'ONHAND'
     A                                  9 53'LOC1'
     A                                 10 25'RESERVED'
     A                                 10 53'LOC2'
     A                                 11 25'AVAILABLE'
     A                                 11 53'LOC3'
     A                                 12 25'STR ONORD'
     A                                 12 53'LOC4'
     A                                 13 25'DIR ONORD'
     A                                 13 53'LOC5'
     A                                 14 25'TOTAL ONR'
     A                                 14 53'LOC6'
     A                                 15 25'ON DOCK'
     A                                 16  1'AV CST'
     A  90                                  DSPATR(ND)
     A                                 16 25'LAST PO'
     A  90                                  DSPATR(ND)
     A                                 16 47'LAST BUYER'
     A  90                                  DSPATR(ND)
     A                                 17 19'LAST REQ#'
     A  90                                  DSPATR(ND)
     A                                 18  1'DISP INSTR -'
     A                                 18 53'HIGH USAGE AREAS'
     A                                 21  1'  PRESS  "f2"  FOR MORE INQUIRY FI-
     A                                      ELDS'
     A                                 21 47'"f5"  FOR LAST PO INQUIRY'
     A  90                                  DSPATR(ND)
     A                                 22 10'"f4"  FOR FULL DESCRIPTION'
     A                                 22 47'"f6"  FOR RESERVATION INQUIRY'
     A  90                                  DSPATR(ND)
     A                                 23 10'"f7"  FOR NEXT INQUIRY'
     A                                 23 47'"f3"  TO END PROGRAM'
     A            COM            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            CODEISFROZ    34A  B  3 23DSPATR(PR)
     A                                      OVRDTA
     A            STRCODE        7A  B  4  6DSPATR(PR)
     A                                      OVRDTA
     A            LOCCODE       12A  B  4 28DSPATR(PR)
     A                                      OVRDTA
     A            CLSS           4A  B  4 50DSPATR(PR)
     A                                      OVRDTA
     A            DFTDEP         6A  B  4 71DSPATR(PR)
     A                                      OVRDTA
     A            DESC1         79A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC2         79A  B  6  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC3         79A  B  7  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC4         79A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            UM             2A  B  9  6DSPATR(PR)
     A                                      OVRDTA
     A            ALTUMCF        9A  B  9 11DSPATR(PR)
     A                                      OVRDTA
     A            ONHAND         9A  B  9 35DSPATR(PR)
     A                                      OVRDTA
     A            LOC1          12A  B  9 58DSPATR(PR)
     A                                      OVRDTA
     A            LOC1ONHAN      9A  B  9 71DSPATR(PR)
     A                                      OVRDTA
     A            UM1            3A  B 10  1DSPATR(PR)
     A                                      OVRDTA
     A            U1             2A  B 10  6DSPATR(PR)
     A                                      OVRDTA
     A            UMCF1         11A  B 10  9DSPATR(PR)
     A                                      OVRDTA
     A            RESERVED       9A  B 10 35DSPATR(PR)
     A                                      OVRDTA
     A            LOC2          12A  B 10 58DSPATR(PR)
     A                                      OVRDTA
     A            LOC2ONHAN      9A  B 10 71DSPATR(PR)
     A                                      OVRDTA
     A            UM2            3A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            U2             2A  B 11  6DSPATR(PR)
     A                                      OVRDTA
     A            UMCF2         11A  B 11  9DSPATR(PR)
     A                                      OVRDTA
     A            AVAIL          9A  B 11 35DSPATR(PR)
     A                                      OVRDTA
     A            LOC3          12A  B 11 58DSPATR(PR)
     A                                      OVRDTA
     A            LOC3ONHAN      9A  B 11 71DSPATR(PR)
     A                                      OVRDTA
     A            ONORDER        9A  B 12 35DSPATR(PR)
     A                                      OVRDTA
     A            LOC4          12A  B 12 58DSPATR(PR)
     A                                      OVRDTA
     A            LOC4ONHAN      9A  B 12 71DSPATR(PR)
     A                                      OVRDTA
     A            DONORDER       9A  B 13 35DSPATR(PR)
     A                                      OVRDTA
     A            LOC5          12A  B 13 58DSPATR(PR)
     A                                      OVRDTA
     A            LOC5ONHAN      9A  B 13 71DSPATR(PR)
     A                                      OVRDTA
     A            TONORDER       9A  B 14 35DSPATR(PR)
     A                                      OVRDTA
     A            LOC6          12A  B 14 58DSPATR(PR)
     A                                      OVRDTA
     A            LOC6ONHAN      9A  B 14 71DSPATR(PR)
     A                                      OVRDTA
     A            ONDOCK         9A  B 15 35DSPATR(PR)
     A                                      OVRDTA
     A            AVGCST        16A  B 16  8DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A            PONUM          7A  B 16 33DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(HI)
     A  90                                  DSPATR(ND)
     A            RLS            3A  B 16 41DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(HI)
     A  90                                  DSPATR(ND)
     A            BUYER         15A  B 16 58DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A            REQNUM        12A  B 17 30DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A            REQDATE        8A  B 17 44DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A            DISPINSTR     30A  B 18 14DSPATR(PR)
     A                                      OVRDTA
     A            DISPREPAIR    18A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            DISPSTOCK     16A  B 19 24DSPATR(PR)
     A                                      OVRDTA
     A            H1             2A  B 19 53DSPATR(PR)
     A                                      OVRDTA
     A            H2             2A  B 19 56DSPATR(PR)
     A                                      OVRDTA
     A            H3             2A  B 19 59DSPATR(PR)
     A                                      OVRDTA
     A            H4             2A  B 19 62DSPATR(PR)
     A                                      OVRDTA
     A            H5             2A  B 19 65DSPATR(PR)
     A                                      OVRDTA
     A            H6             2A  B 19 68DSPATR(PR)
     A                                      OVRDTA
     A            DISPBLKMSG    58A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FMTLSTAT3
     A*%%TS  SD  20020509  140601  A257947     REL-V5R1M0  5722-WDS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A N90                                  CF05
     A N90                                  CF06
     A                                      CF07
     A N90                                  CF08
     A            COM            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A                                  1 20'- - -   I T E M   S T A T U S   -'
     A                                  1 54'- -'
     A                                  1 75'MQ1-3'
     A                                  2 66'TECH. BULLETIN'
     A                                      DSPATR(BL)
     A N91                                  DSPATR(ND)
     A            CODEISFROZ    34A  B  3 23DSPATR(PR)
     A                                      OVRDTA
     A                                  4  1'CODE'
     A            STRCODE        7A  B  4  6DSPATR(PR)
     A                                      OVRDTA
     A                                  4 17'CLASSIFICATIONS   WD  OE  MR  OR'
     A                                  4 51'INS  IMP  SO  CO  SA  RW  OV'
     A                                  5  1'UM'
     A            UM             2A  B  5  6DSPATR(PR)
     A                                      OVRDTA
     A            WRITEDOWN      1A  B  5 36DSPATR(PR)
     A                                      OVRDTA
     A            ORDERENG       1A  B  5 40DSPATR(PR)
     A                                      OVRDTA
     A            MAINTREPAI     1A  B  5 44DSPATR(PR)
     A                                      OVRDTA
     A            OUTSIDEREP     1A  B  5 48DSPATR(PR)
     A                                      OVRDTA
     A            INSURANCE      1A  B  5 52DSPATR(PR)
     A                                      OVRDTA
     A            RELEASE        1A  B  5 57DSPATR(PR)
     A                                      OVRDTA
     A            STOCKOUT       1A  B  5 62DSPATR(PR)
     A                                      OVRDTA
     A            CONSIGNMEN     1A  B  5 66DSPATR(PR)
     A                                      OVRDTA
     A            SA             1A  B  5 70DSPATR(PR)
     A                                      OVRDTA
     A            RW             1A  B  5 74DSPATR(PR)
     A                                      OVRDTA
     A            OV             1A  B  5 78DSPATR(PR)
     A                                      OVRDTA
     A                                  6  1'ONHAND'
     A            ONHAND         9A  B  6 10DSPATR(PR)
     A                                      OVRDTA
     A                                  6 23'ADD TO STOCK DATE'
     A            ADDDATE        8A  B  6 42DSPATR(PR)
     A                                      OVRDTA
     A                                  6 51'ORIGINATOR'
     A            ORIGINATOR    10A  B  6 62DSPATR(PR)
     A                                      OVRDTA
     A                                  7  1'MAXIMUM'
     A            MAX            9A  B  7 10DSPATR(PR)
     A                                      OVRDTA
     A                                  7 23'LAST ISSUE DATE'
     A            ISSDATE        8A  B  7 42DSPATR(PR)
     A                                      OVRDTA
     A                                  7 51'TO EMPL'
     A            EMPL           4A  B  7 59DSPATR(PR)
     A                                      OVRDTA
     A                                  7 64'DEPT'
     A            CHARDEPT      10A  B  7 69DSPATR(PR)
     A                                      OVRDTA
     A                                  8  1'REORDER'
     A            REORDER        9A  B  8 10DSPATR(PR)
     A                                      OVRDTA
     A                                  8 23'LAST ACTIVITY DATE'
     A            ACTDATE        8A  B  8 42DSPATR(PR)
     A                                      OVRDTA
     A            EMPLNAME      16A  B  8 59DSPATR(PR)
     A                                      OVRDTA
     A                                  9  1'EXPEDITE'
     A            EXPEDITE       9A  B  9 10DSPATR(PR)
     A                                      OVRDTA
     A                                  9 23'LAST PHYS INV DATE'
     A            PHYDATE        8A  B  9 42DSPATR(PR)
     A                                      OVRDTA
     A                                  9 51'CYCLE'
     A            CYCL           5A  B  9 57DSPATR(PR)
     A                                      OVRDTA
     A                                  9 63'DAYS'
     A                                 11  1'SOQ'
     A            SOQ            9A  B 11  6DSPATR(PR)
     A                                      OVRDTA
     A                                 11 19'STD COST'
     A  90                                  DSPATR(ND)
     A            STDCOST       16A  B 11 28DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 11 48'EST GDYR LT'
     A  90                                  DSPATR(ND)
     A            ESLT           5A  B 11 65DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 11 71'DAYS'
     A  90                                  DSPATR(ND)
     A                                 12  1'EOQ'
     A            EOQ            9A  B 12  6DSPATR(PR)
     A                                      OVRDTA
     A                                 12 19'MKT COST'
     A  90                                  DSPATR(ND)
     A            MKTCOST       16A  B 12 28DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 12 48'OUT. REP. COST'
     A  90                                  DSPATR(ND)
     A            OUTREPCOST    16A  B 12 63DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 13  1'LAST ACTUAL LEADTIMES'
     A  90                                  DSPATR(ND)
     A            ACLT           5A  B 13 23DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 13 29'DAYS'
     A  90                                  DSPATR(ND)
     A            ACLT2          5A  B 13 35DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 13 41'DAYS'
     A  90                                  DSPATR(ND)
     A            ACLT3          5A  B 13 47DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 13 53'DAYS'
     A  90                                  DSPATR(ND)
     A                                 15  1'JA'
     A  90                                  DSPATR(ND)
     A            USAGELIT      60A  B 14  1DSPATR(PR)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A            JANUSAGE       9A  B 15  4DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 15 14'FE'
     A  90                                  DSPATR(ND)
     A            FEBUSAGE       9A  B 15 17DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 15 27'MA'
     A  90                                  DSPATR(ND)
     A            MARUSAGE       9A  B 15 30DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 15 40'AP'
     A  90                                  DSPATR(ND)
     A            APRUSAGE       9A  B 15 43DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 15 53'MA'
     A  90                                  DSPATR(ND)
     A            MAYUSAGE       9A  B 15 56DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 15 66'JU'
     A  90                                  DSPATR(ND)
     A            JUNUSAGE       9A  B 15 69DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 16  1'JU'
     A  90                                  DSPATR(ND)
     A            JULUSAGE       9A  B 16  4DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 16 14'AU'
     A  90                                  DSPATR(ND)
     A            AUGUSAGE       9A  B 16 17DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 16 27'SE'
     A  90                                  DSPATR(ND)
     A            SEPUSAGE       9A  B 16 30DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 16 40'OC'
     A  90                                  DSPATR(ND)
     A            OCTUSAGE       9A  B 16 43DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 16 53'NO'
     A  90                                  DSPATR(ND)
     A            NOVUSAGE       9A  B 16 56DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 16 66'DE'
     A  90                                  DSPATR(ND)
     A            DECUSAGE       9A  B 16 69DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 17  1'USAGE:'
     A  90                                  DSPATR(ND)
     A                                 17 21'AVERAGE MONTHLY USAGE'
     A  90                                  DSPATR(ND)
     A            AVGMUSAG       9A  B 17 43DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 18  3'MONTH-TO-DATE'
     A  90                                  DSPATR(ND)
     A            MONTODAT       9A  B 18 17DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 18 28'LAST-12-MONTHS'
     A  90                                  DSPATR(ND)
     A            LST12MONU      9A  B 18 43DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 18 55'USED YESTERDAY'
     A  90                                  DSPATR(ND)
     A            USEDYEST       9A  B 18 70DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 19  1'RECEIPTS:'
     A  90                                  DSPATR(ND)
     A                                 20  3'MONTH-TO-DATE'
     A  90                                  DSPATR(ND)
     A            RMONTODAT      9A  B 20 17DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 20 28'LAST-12-MONTHS'
     A  90                                  DSPATR(ND)
     A            LST12MONR      9A  B 20 43DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 20 55'RECD YESTERDAY'
     A  90                                  DSPATR(ND)
     A            RECDYEST       9A  B 20 70DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 21  1'  PRESS  "f1"  FOR BASIC INQUIRY F-
     A                                      IELDS'
     A                                 21 46'"f5"  FOR LAST PO INQUIRY'
     A  90                                  DSPATR(ND)
     A                                 22 10'"f4"  FOR FULL DESCRIPTION'
     A                                 22 46'"f6"  FOR RESERVATION INQUIRY'
     A  90                                  DSPATR(ND)
     A                                 23 10'"f7"  FOR NEXT INQUIRY'
     A                                 23 46'"f3"  TO END PROGRAM'
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FMTLSTAT4
     A*%%TS  SD  19991111  104836  A257947     REL-V4R2M0  5769-PW1
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A N90                                  CF05
     A N90                                  CF06
     A                                      CF07
     A                                      CF08
     A                                      PUTOVR
     A                                  1 20'- - -   I T E M   S T A T U S   -'
     A                                  1 54'- -'
     A                                  1 75'MQ1-4'
     A                                  4  1'CODE'
     A                                 20  1'  PRESS  "f1"  FOR BASIC INQUIRY F-
     A                                      IELDS'
     A                                 20 48'"f2"  FOR MORE INQUIRY FIELDS'
     A                                 21 10'"f6"  FOR RESERVATION INQUIRY'
     A  90                                  DSPATR(ND)
     A                                 21 48'"f5"  FOR LAST PO INQUIRY'
     A  90                                  DSPATR(ND)
     A                                 22 10'"f7"  FOR NEXT INQUIRY'
     A                                 22 48'"f3"  TO END PROGRAM'
     A            COM            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            STRCODE        7A  B  4  6DSPATR(PR)
     A                                      OVRDTA
     A            DESC1         79A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC2         79A  B  6  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC3         79A  B  7  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC4         79A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC5         79A  B  9  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC6         79A  B 10  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC7         79A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC8         79A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC9         79A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC10        79A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC11        79A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC12        79A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            DESCMSG       58A  B 18  6DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FMTLSTAT5
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 14'- - - INSTRUCTIONS ON OBTAINING P.-
     A                                      O. INFORMATION - - -'
     A                                  1 76'MQ1-5'
     A                                  2 22'FOLLOW INSTRUCTIONS ON BOTTOM OF S-
     A                                      CREEN'
     A                                  5  1'P.O.-RCV SLIP INQUIRY BY CODE -- (-
     A                                      SELECT KEY TO RUN PROGRAM FROM MAST-
     A                                      ER MENU)'
     A                                  7  4'USE THIS INQUIRY TO LOOK AT ALL PU-
     A                                      RCHASE ORDERS FOR ANY CORP CODE'
     A                                  8  8'(a)  DETERMINE IF ANY ITEMS ARE RE-
     A                                      CEIVED BUT NOT STORED'
     A                                  9  8'(b)  OBTAIN PURCHASE ORDER NUMBER(-
     A                                      s)'
     A                                 11  1'PURCHASE ORDER INQUIRY BY P.O. --'
     A                                 11 35'(SELECT KEY TO RUN PROGRAM FROM MA-
     A                                      STER MENU)'
     A                                 13  4'USE THIS INQUIRY TO OBTAIN INFORMA-
     A                                      TION ON P.O. HEADER AND ITEMS'
     A                                 14  8'(a)  HEADER - ACCT. DATA, DELIVER'
     A                                 14 42'TO DATA, PO DATE, SHIP DATE, EXPEC-
     A                                      TED'
     A                                 15 22'DELIVERY DATE, VENDOR DATA.'
     A                                 16  8'(b)  ITEMS  - DESCRIPTION, PRICE,'
     A                                 16 42'QUANTITIES (ORDERED,RECEIVED,STORE-
     A                                      D),'
     A                                 17 22'DATE RECEIVED, DATE STORED.'
     A                                 19  1'  PRESS  "f1"  FOR BASIC INQUIRY F-
     A                                      IELDS     "f2"  FOR MORE INQUIRY FI-
     A                                      ELDS'
     A                                 20 10'"f4"  FOR FULL INQUIRY'
     A                                 21 10'"f6"  FOR RESERVATION INQUIRY'
     A                                 21 45'"f7"  FOR NEXT INQUIRY'
     A                                 22 10'"f3"  TO END PROGRAM'
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FPOINQR
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 19'P U R C H A S E   O R D E R   I N'
     A                                  1 53'Q U I R Y'
     A                                  2 16'-----------------------------------
     A                                      ---------------'
     A                                  8  1'ENTER PURCHASE ORDER NUMBER'
     A                                  8 44'{OR}  ITEM REQ NUMBER'
     A                                 12  1'***  OPTIONS:'
     A                                 13  1'----------------'
     A                                 15  7'IF  PURCHASE ORDER NUMBER  WAS CHO-
     A                                      SEN,'
     A                                 17 11'ENTER   ITEM NUMBER'
     A                                 17 40'{OR}   CORP CODE'
     A                                 17 69'IF DESIRED'
     A                                 20 45'SEARCH HISTORY DATA BASE  '
     A            PO             7A  B  8 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            RLS            3Y 0B  8 39DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            REQNUM        12A  B  8 66DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            ITEM           4Y 0B 17 33DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            CORPCDE        7A  B 17 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            A              1A  B 20 72DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            INSTRUCTIO    71A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTI2    71A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT F4-CODE INQUIRY F6--
     A                                      REC SLIP INQUIRY F7-PO INQ BY CODE -
     A                                      F8-VENDOR INQUIRY')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FPOHCHK
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 16'PURCHASE ORDER INQUIRY - HISTORY D-
     A                                      ATA BASE DELETE'
     A                                  3  7'PURCHASE ORDER NUMBER'
     A                                  5  7'DATE DELETED FROM HISTORY DATA BAS-
     A                                      E:'
     A                                 10  3'The above purchase order has been'
     A                                 10 37'deleted from the po history data b-
     A                                      ase.'
     A                                 11  3'If you need to review this order y-
     A                                      ou must contact your purchasing or'
     A                                 12  3'accounting department and tell the-
     A                                      m the order and date it was deleted'
     A                                 13  3'from the history data base.  Then'
     A                                 13 37'the appropriate tape containing th-
     A                                      e'
     A                                 14  3'purchase order desired must be res-
     A                                      tored onto the system by your data'
     A                                 15  3'processing department.  Once the c-
     A                                      orrect tape is restored onto the sy-
     A                                      stem a'
     A                                 16  3'complete report of the purchase or-
     A                                      der can be requested by purchasing'
     A                                 16 72'or'
     A                                 17  3'accounts payable using "PH1".'
     A                                 20  6'PRESS "ENTER" OF "f3" TO RETURN TO'
     A                                 20 41'THE PREVIOUS SCREEN'
     A            CCC            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B  3 30DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  3 38DSPATR(PR)
     A                                      OVRDTA
     A            DATE1          8A  B  5 45DSPATR(PR)
     A                                      OVRDTA
     A            DATE2          8A  B  5 56DSPATR(PR)
     A                                      OVRDTA
     A            DATE3          8A  B  6 45DSPATR(PR)
     A                                      OVRDTA
     A            DATE4          8A  B  6 56DSPATR(PR)
     A                                      OVRDTA
     A            DATE5          8A  B  7 45DSPATR(PR)
     A                                      OVRDTA
     A            DATE6          8A  B  7 56DSPATR(PR)
     A                                      OVRDTA
     A            DATE7          8A  B  8 45DSPATR(PR)
     A                                      OVRDTA
     A            DATE8          8A  B  8 56DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-PREVIOUS SCREEN         -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FPOINQH
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 16'PURCHASE ORDER HEADER INQUIRY - PA-
     A                                      GE 1'
     A                                  3 29'***'
     A                                  3 49'***'
     A                                  4 33'---------------'
     A                                  6  2'PO DATE'
     A                                  6 16'REQ NUMBER'
     A                                  6 53'REC DEPT      FOR DEPT'
     A                                  9  2'SHIP DATE     EXPECT DATE      BUD-
     A                                      GET NUMBER     BUDGET AMT     ADDIT-
     A                                      IONAL INFO'
     A                                 12  1'F.O.B.'
     A                                 12 27'VIA'
     A                                 12 53'TERMS'
     A                                 15  1'VENDOR CODE'
     A                                 15 35'CO.   PRIME   CLASS  DEPARTMENT  E-
     A                                      XPENSE/NW'
     A                                 17  1'VENDOR'
     A                                 17 55'BUYER'
     A                                 20  1'PRESS:  "f1"  TO SEE PURCHASE ORDE-
     A                                      R HEADER - PAGE 2'
     A                                 21  1'------  "f2"  TO SEE PURCHASE ORDE-
     A                                      R ITEMS'
     A            CCD            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            HISTDBLIT     20A  B  1 57DSPATR(PR)
     A                                      OVRDTA
     A            PO             7A  B  3 35DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  3 43DSPATR(PR)
     A                                      OVRDTA
     A            PODATE         8A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            REQNUM        12A  B  5 16DSPATR(PR)
     A                                      OVRDTA
     A            RDEPT          6A  B  5 53DSPATR(PR)
     A                                      OVRDTA
     A            FDEPT          6A  B  5 67DSPATR(PR)
     A                                      OVRDTA
     A            SHIPDATE       8A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            EXPDATE        8A  B  8 15DSPATR(PR)
     A                                      OVRDTA
     A            BUDGETNUM     12A  B  8 32DSPATR(PR)
     A                                      OVRDTA
     A            BUDGETAMT     11A  B  8 49DSPATR(PR)
     A                                      OVRDTA
     A            ADDLINFO      16A  B  8 65DSPATR(PR)
     A                                      OVRDTA
     A            FOB           20A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            VIA           20A  B 11 27DSPATR(PR)
     A                                      OVRDTA
     A            TM             2A  B 11 53DSPATR(PR)
     A                                      OVRDTA
     A            DISC           5A  B 11 56DSPATR(PR)
     A                                      OVRDTA
     A            TIMEOFDISC    18A  B 11 62DSPATR(PR)
     A                                      OVRDTA
     A            VENDORCODE    11A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            COMPANY        3A  B 14 35DSPATR(PR)
     A                                      OVRDTA
     A            PRIME          3A  B 14 42DSPATR(PR)
     A                                      OVRDTA
     A            SUB            3A  B 14 50DSPATR(PR)
     A                                      OVRDTA
     A            SUBDETL        4A  B 14 58DSPATR(PR)
     A                                      OVRDTA
     A            ADDLDT         6A  B 14 70DSPATR(PR)
     A                                      OVRDTA
     A            VENDORNAME    44A  B 17 10DSPATR(PR)
     A                                      OVRDTA
     A            BUYER         18A  B 17 63DSPATR(PR)
     A                                      OVRDTA
     A            VENDORCSZ     44A  B 18 10DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 23  1DSPATR(PR)
     A  98                                  OVRDTA
     A            COMMANDLN2    79A  B 24  1DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPOINQHB
     A*%%TS  SD  19970127  100226  A257947     REL-V3R7M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 18'PURCHASE ORDER HEADER INQUIRY - PA-
     A                                      GE 2'
     A                                  3 29'***'
     A                                  3 49'***'
     A                                  4 33'---------------'
     A                                  6  4'PO TYPE'
     A                                  6 23'PO DELETION   LAST PAYMENT     CUR-
     A                                      RENCY'
     A                                  7 26'DATE'
     A                                  7 38'DATE (YYMM)'
     A                                  7 56'CODE'
     A                                 10 31'CONFIRMING ORDER FREE VERBAGE'
     A                                 13  3'STD INSTRUCTIONS (BEFORE ITEMS)'
     A                                 13 41'STD INSTRUCTIONS (AFTER ITEMS)'
     A                                 14  3'LAST FOLLOWUP DATE'
     A                                 14 34'NO. OF FOLLOWUPS'
     A                                 16 23'BUDGET AMOUNT'
     A                                 16 54'CPW TAKEN'
     A                                 17  3'ALT. REMIT ADDRESS  APPROVED INVOI-
     A                                      CE'
     A                                 17 54'CPW PAYED'
     A                                 18 31'PAYMENTS'
     A                                 18 54'CPW BAL.'
     A                                 19 23'OPEN BUDGET AMT.'
     A                                 20  1'PRESS:  "f1"  TO SEE PURCHASE ORDE-
     A                                      R HEADER - PAGE 1'
     A                                 21  1'------  "f2"  TO SEE PURCHASE ORDE-
     A                                      R ITEMS'
     A            CCD            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            HISTDBLIT     20A  B  1 59DSPATR(PR)
     A                                      OVRDTA
     A            PO             7A  B  3 35DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  3 43DSPATR(PR)
     A                                      OVRDTA
     A            POTYPE        16A  B  5  3DSPATR(PR)
     A                                      OVRDTA
     A            DELDATE        8A  B  5 24DSPATR(PR)
     A                                      OVRDTA
     A            LTPY           4A  B  5 40DSPATR(PR)
     A                                      OVRDTA
     A            CC             2A  B  5 54DSPATR(PR)
     A                                      OVRDTA
     A            CURCODE       12A  B  5 57DSPATR(PR)
     A                                      OVRDTA
     A            CONFIRMLIT    20A  B  9  3DSPATR(PR)
     A                                      OVRDTA
     A            CONFIRMVER    34A  B  9 31DSPATR(PR)
     A                                      OVRDTA
     A            S1             3A  B 12  3DSPATR(PR)
     A                                      OVRDTA
     A            S2             3A  B 12  8DSPATR(PR)
     A                                      OVRDTA
     A            S3             3A  B 12 13DSPATR(PR)
     A                                      OVRDTA
     A            S4             3A  B 12 18DSPATR(PR)
     A                                      OVRDTA
     A            S5             3A  B 12 23DSPATR(PR)
     A                                      OVRDTA
     A            S6             3A  B 12 28DSPATR(PR)
     A                                      OVRDTA
     A            S7             3A  B 12 41DSPATR(PR)
     A                                      OVRDTA
     A            S8             3A  B 12 46DSPATR(PR)
     A                                      OVRDTA
     A            S9             3A  B 12 51DSPATR(PR)
     A                                      OVRDTA
     A            S10            3A  B 12 56DSPATR(PR)
     A                                      OVRDTA
     A            S11            3A  B 12 61DSPATR(PR)
     A                                      OVRDTA
     A            S12            3A  B 12 66DSPATR(PR)
     A                                      OVRDTA
     A            FLWPDATE       8A  B 14 23DSPATR(PR)
     A                                      OVRDTA
     A            NF             2A  B 14 52DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B 16  9DSPATR(PR)
     A                                      OVRDTA
     A            BUDGETAT      11A  B 16 41DSPATR(PR)
     A                                      OVRDTA
     A            CPWDEDUCT     13A  B 16 64DSPATR(PR)
     A                                      OVRDTA
     A            CPWPAYED      13A  B 17 64DSPATR(PR)
     A                                      OVRDTA
     A            INVPAY        11A  B 18 41DSPATR(PR)
     A                                      OVRDTA
     A            CPWBALANCE    14A  B 18 63DSPATR(PR)
     A                                      OVRDTA
     A            OPENBDGT      12A  B 19 40DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 23  1DSPATR(PR)
     A            COMMANDLN2    79A  B 24  1DSPATR(PR)
     A            INDICMSG      20A  B 21 55DSPATR(PR)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPOINQD
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 21'P U R C H A S E  O R D E R  I N Q'
     A                                  2 55'U I R Y'
     A                                  3 18'-----------------------------------
     A                                      -------------'
     A                                  4 34'PO'
     A                                  6  4'THE FOLLOWING PLANTS ARE AVAILABLE'
     A                                  6 39'FOR INQUIRY:'
     A                                  8 24'PLANT  PLANT'
     A                                  9 19'"X"  CODE   DESCRIPTION'
     A                                 10 19'---  -----  ------------'
     A                                 20  4'ENTER AN "X" BY THE PLANT TO SEE P-
     A                                      URCHASE ORDER INFORMATION'
     A            CCD            3A  B  2  4DSPATR(PR)
     A                                      OVRDTA
     A            PO             7A  B  4 38DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  4 46DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B 11 20DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  79                                  DSPATR(RI)
     A  79                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            PL1            3A  B 11 25DSPATR(PR)
     A                                      OVRDTA
     A            DESC1         30A  B 11 31DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B 12 20DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  82                                  DSPATR(RI)
     A  82                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            PL2            3A  B 12 25DSPATR(PR)
     A                                      OVRDTA
     A            DESC2         30A  B 12 31DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 13 20DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  85                                  DSPATR(RI)
     A  85                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            PL3            3A  B 13 25DSPATR(PR)
     A                                      OVRDTA
     A            DESC3         30A  B 13 31DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 14 20DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  88                                  DSPATR(RI)
     A  88                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            PL4            3A  B 14 25DSPATR(PR)
     A                                      OVRDTA
     A            DESC4         30A  B 14 31DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 15 20DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  91                                  DSPATR(RI)
     A  91                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            PL5            3A  B 15 25DSPATR(PR)
     A                                      OVRDTA
     A            DESC5         30A  B 15 31DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 16 20DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  94                                  DSPATR(RI)
     A  94                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            PL6            3A  B 16 25DSPATR(PR)
     A                                      OVRDTA
     A            DESC6         30A  B 16 31DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 17 20DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  97                                  DSPATR(RI)
     A  97                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            PL7            3A  B 17 25DSPATR(PR)
     A                                      OVRDTA
     A            DESC7         30A  B 17 31DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FPOINQHL
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 16'PURCHASE ORDER HEADER INQUIRY - PA-
     A                                      GE 1'
     A                                  3 29'***'
     A                                  3 49'***'
     A                                  4 33'---------------'
     A                                  6  2'PO DATE'
     A                                  6 16'REQ NUMBER'
     A                                  6 53'REC DEPT      FOR DEPT'
     A                                  9  2'SHIP DATE     EXPECT DATE      BUD-
     A                                      GET NUMBER     BUDGET AMT     ADDIT-
     A                                      IONAL INFO'
     A                                 12  1'F.O.B.'
     A                                 12 27'VIA'
     A                                 12 53'TERMS'
     A                                 15  1'VENDOR CODE'
     A                                 17  1'VENDOR'
     A                                 17 55'BUYER'
     A            CCD            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            HISTDBLIT     20A  B  1 57DSPATR(PR)
     A                                      OVRDTA
     A            PO             7A  B  3 35DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  3 43DSPATR(PR)
     A                                      OVRDTA
     A            PODATE         8A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            REQNUM        12A  B  5 16DSPATR(PR)
     A                                      OVRDTA
     A            RDEPT          6A  B  5 53DSPATR(PR)
     A                                      OVRDTA
     A            FDEPT          6A  B  5 67DSPATR(PR)
     A                                      OVRDTA
     A            SHIPDATE       8A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            EXPDATE        8A  B  8 15DSPATR(PR)
     A                                      OVRDTA
     A            BUDGETNUM     12A  B  8 32DSPATR(PR)
     A                                      OVRDTA
     A            BUDGETAMT     11A  B  8 49DSPATR(PR)
     A                                      OVRDTA
     A            ADDLINFO      16A  B  8 65DSPATR(PR)
     A                                      OVRDTA
     A            FOB           20A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            VIA           20A  B 11 27DSPATR(PR)
     A                                      OVRDTA
     A            TM             2A  B 11 53DSPATR(PR)
     A                                      OVRDTA
     A            DISC           5A  B 11 56DSPATR(PR)
     A                                      OVRDTA
     A            TIMEOFDISC    18A  B 11 62DSPATR(PR)
     A                                      OVRDTA
     A            VENDORCODE    11A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            VENDORNAME    44A  B 17 10DSPATR(PR)
     A                                      OVRDTA
     A            BUYER         18A  B 17 63DSPATR(PR)
     A                                      OVRDTA
     A            VENDORCSZ     44A  B 18 10DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 23  1DSPATR(PR)
     A  98                                  OVRDTA
     A            COMMANDLN2    79A  B 24  1DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPOINQSI
     A*%%TS  SD  19961118  112026  A193138     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 24'PURCHASE ORDER ITEM INQUIRY'
     A                                  3  1'ITEM  CODE'
     A                                  3 24'***'
     A                                  3 44'***    TAX CODE   LANGUAGE INDIC.'
     A                                  4 28'---------------'
     A                                  6  1'****** PRICE ****** **************-
     A                                      * QUANTITIES *****************  ***-
     A                                      *DATES***'
     A                                  7  6'AMOUNT      UM   ORDERED     UM  D-
     A                                      ELIVERED'
     A                                  7 55'STORED'
     A                                  7 69'DLVR  STOR'
     A                                 21  1'PRESS:  "f1"  TO SEE PURCHASE ORDE-
     A                                      R HEADER'
     A  01                             21 50'"f5" TO SEE QS9000 TRACKING'
     A                                 22  1'------  "f3"  TO RETURN TO THE REQ-
     A                                      UEST SCREEN'
     A            CCD            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            HISTDBLIT     20A  B  1 57DSPATR(PR)
     A                                      OVRDTA
     A            PO             7A  B  3 30DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  3 38DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4A  B  4  1DSPATR(PR)
     A                                      OVRDTA
     A            CORPCODE       7A  B  4  7DSPATR(PR)
     A                                      OVRDTA
     A            TX             2A  B  4 54DSPATR(PR)
     A                                      OVRDTA
     A            LANGTYPE      10A  B  4 64DSPATR(PR)
     A                                      OVRDTA
     A            MASTSTKLIT    12A  B  5  7DSPATR(PR)
     A                                      OVRDTA
     A            MASTSTK        7A  B  5 20DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE01    79A  B  9  1DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE02    79A  B 10  1DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE03    79A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE04    79A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE05    79A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE06    79A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE07    79A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE08    79A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE09    79A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            MSGLINE01     79A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-PO HEADER f3-REQUEST SCR-
     A                                      EEN                                -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FPOINQTR
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  9'P U R C H A S E   O R D E R   T R -
     A                                      A I L E R   C O M M E N T S'
     A                                  3  2'P.O:'
     A                                  5  2'SEQ'
     A                                  5  7'COMMENT'
     A            PONUM         14A  B  3  7DSPATR(PR)
     A                                      OVRDTA
     A            SEQ6           4A  B  6  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE6         70A  B  6  7DSPATR(PR)
     A                                      OVRDTA
     A            SEQ7           4A  B  7  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE7         70A  B  7  7DSPATR(PR)
     A                                      OVRDTA
     A            SEQ8           4A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE8         70A  B  8  7DSPATR(PR)
     A                                      OVRDTA
     A            SEQ9           4A  B  9  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE9         70A  B  9  7DSPATR(PR)
     A                                      OVRDTA
     A            SEQ10          4A  B 10  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE10        70A  B 10  7DSPATR(PR)
     A                                      OVRDTA
     A            SEQ11          4A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE11        70A  B 11  7DSPATR(PR)
     A                                      OVRDTA
     A            SEQ12          4A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE12        70A  B 12  7DSPATR(PR)
     A                                      OVRDTA
     A            SEQ13          4A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE13        70A  B 13  7DSPATR(PR)
     A                                      OVRDTA
     A            SEQ14          4A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE14        70A  B 14  7DSPATR(PR)
     A                                      OVRDTA
     A            SEQ15          4A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE15        70A  B 15  7DSPATR(PR)
     A                                      OVRDTA
     A            SEQ16          4A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE16        70A  B 16  7DSPATR(PR)
     A                                      OVRDTA
     A            SEQ117         4A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE17        70A  B 17  7DSPATR(PR)
     A                                      OVRDTA
     A            SEQ18          4A  B 18  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE18        70A  B 18  7DSPATR(PR)
     A                                      OVRDTA
     A            SEQ119         4A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE19        70A  B 19  7DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FREQRLSE
     A*%%TS  SD  20020806  152713  A257947     REL-V5R1M0  5722-WDS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 17'R E Q U I S I T I O N   A P P R O'
     A                                  1 51'V A L'
     A                                  3  1'Type options and hit "enter" to st-
     A                                      art approvals, or hit "f2" to tab'
     A                                  3 69'to req num.'
     A                                  5  2'Sort key  '
     A                                  5 17'1  No sort'
     A                                  5 35'4  Budget number'
     A                                  6 17'2  Req number'
     A                                  6 35'5  Date (most recent first)'
     A                                  7 17'3  Workorder'
     A                                  7 35'6  Date (oldest first)'
     A                                  8 35'7  Queue Date (most recent first)'
     A                                 10  1'Include at least 1 of the followin-
     A                                      g:'
     A                                 11  4'Unapproved      '
     A                                 11 29'In purchasing'
     A                                 11 58'On PO     '
     A                                 12  1'Include at least 1 of the followin-
     A                                      g:'
     A                                 13  4'Coded storeroom '
     A                                 13 29'Coded non-storeroom '
     A                                 13 58'Non-coded '
     A                                 15  4'Exclude reqs you approved '
     A                                 15 40'Include only "on hold" reqs '
     A                                 17  2'Selection on one of the following:'
     A                                 18  3'Requisition number '
     A                                 18 38'Workorder number '
     A                                 20  3'Corporate code     '
     A                                 20 38'Originator'
     A                                 22  3'Approver'
     A                                 22 38'Date'
     A            S              1A  B  5 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            R              1A  B  9  2DSPATR(PR)
     A                                      OVRDTA
     A                                      DSPATR(ND)
     A            U              1A  B 11 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            C              1A  B 11 50DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            P              1A  B 11 69DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            T              1A  B 13 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            O              1A  B 13 50DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            N              1A  B 13 69DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            E              1A  B 15 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            H              1A  B 15 69DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            REQUISITIO    12A  B 18 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            WORKORDER     10A  B 18 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            CORPCOD        7A  B 20 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            EMP1           4A  B 20 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            EMP2           4A  B 22 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            DATE1          2A  B 22 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            DATE2          2A  B 22 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            DATE3          2A  B 22 62DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FREQRLSE2
     A*%%TS  SD  20020423  153847  A257947     REL-V5R1M0  5722-WDS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  9'REQUISITION APPROVAL: REQ NUMBER'
     A                                  1 56'DATE'
     A                                  2  1'CORP CODE'
     A                                  2 13'QUANTITY'
     A                                  2 25'UM'
     A                                  2 29'ESTIMATED PRICE'
     A                                  2 46'CURR'
     A  40                                  DSPATR(ND)
     A                                      OVRATR
     A                                  2 52'BUDGET AMOUNT'
     A                                  2 67'BUDGET NUMBER'
     A                                  6  1'DT WANTED CO  PRM CLS DEPT'
     A                                  6 37'STAG ORIG ORIGINATOR NAME  WORKORD-
     A                                      ER    APP'
     A                                  8 19'SUGGESTED VENDOR'
     A                                  8 50'TYPE  MOD?  PATH  APP LEFT'
     A                                 10  1'FIRST 3 LINES OF DESCRIPTION'
     A                                 14  1'REMARKS'
     A                                 17  1'PURCHASE ORDER      ORDERED'
     A                                 17 35'UM   DELIVERED      DATE DLVR   BL-
     A                                      ANKET'
     A                                 20 50'APP STATUS '
     A                                 20 66'TAX CODE'
     A                                 21  1'HELP '
     A                                 21 11'RETURN '
     A                                 21 23'FORWARD TO '
     A                                 21 42'MODIFY '
     A                                 21 54'UNAVAIL '
     A                                 21 67'REPRINT '
     A                                 22  1'BUYER:'
     A                                 22 27'ROUTE COMMENTS:'
     A                                 23  1'REQUESTING DEPT:'
     A            REQ           12A  B  1 42DSPATR(PR)
     A                                      OVRDTA
     A            RDATE          8A  B  1 61DSPATR(PR)
     A                                      OVRDTA
     A            CODE           7A  B  3  2DSPATR(PR)
     A                                      OVRDTA
     A            QUANTITY      12Y 4B  3 11EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            UM             2A  B  3 25DSPATR(PR)
     A                                      OVRDTA
     A            ESTIMATPRI    15A  B  3 29DSPATR(PR)
     A                                      OVRDTA
     A            CURRENCY       2A  B  3 47DSPATR(PR)
     A                                      OVRDTA
     A  40                                  DSPATR(ND)
     A                                      OVRATR
     A            BUDGETAMT     12A  B  3 52DSPATR(PR)
     A                                      OVRDTA
     A            BUDGETNUM     14A  B  3 67DSPATR(PR)
     A                                      OVRDTA
     A            ESTIMATPR2    15A  B  4 29DSPATR(PR)
     A                                      OVRDTA
     A  40                                  DSPATR(ND)
     A            CURRENCY2      2A  B  4 47DSPATR(PR)
     A                                      OVRDTA
     A  40                                  DSPATR(ND)
     A                                      OVRATR
     A            CURRNAME      12A  B  4 52DSPATR(PR)
     A                                      OVRDTA
     A  40                                  DSPATR(ND)
     A            WOAMTSFIEL    79A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            NWADLIT        7A  B  6 28DSPATR(PR)
     A                                      OVRDTA
     A            DATEWANT       8A  B  7  1DSPATR(PR)
     A                                      OVRDTA
     A            COM            3A  B  7 11DSPATR(PR)
     A                                      OVRDTA
     A            PRM            3A  B  7 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            CLS            3A  B  7 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            DEPT           4A  B  7 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            EXP            8A  B  7 28DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            STAG           4A  B  7 37DSPATR(PR)
     A                                      OVRDTA
     A            ORIG           4A  B  7 42DSPATR(PR)
     A                                      OVRDTA
     A            ORIGINATOR    16A  B  7 47DSPATR(PR)
     A                                      OVRDTA
     A            WORKORDER     12A  B  7 64DSPATR(PR)
     A                                      OVRDTA
     A            Z              1A  B  7 78DSPATR(PR)
     A                                      OVRDTA
     A            ADDTLLIT      15A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            ADDTLINFO     16A  B  9  1
     A N18                                  DSPATR(PR)
     A                                      OVRDTA
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A  18                                  DSPATR(UL)
     A            SUGGESTEDV    30A  B  9 19DSPATR(PR)
     A                                      OVRDTA
     A            T              1A  B  9 51DSPATR(PR)
     A                                      OVRDTA
     A            M              1A  B  9 57DSPATR(PR)
     A                                      OVRDTA
     A            PHT            3A  B  9 63DSPATR(PR)
     A                                      OVRDTA
     A            APL            3A  B  9 70DSPATR(PR)
     A                                      OVRDTA
     A            DESC1         79A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC2         79A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC3         79A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            REM1          79A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            REM2          79A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            PO            10A  B 18  3DSPATR(PR)
     A                                      OVRDTA
     A            ORDEREDX      12Y 4B 18 18EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            U2             2A  B 18 35DSPATR(PR)
     A                                      OVRDTA
     A            DELIVERD      12Y 4B 18 39EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            DATEDLVR       8A  B 18 55DSPATR(PR)
     A                                      OVRDTA
     A            BLANKET        7A  B 18 67DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGE1      59A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGE3      24A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B 20 63DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(PC)
     A            TAXCDE         2A  B 20 76DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  55                                  DSPATR(PC)
     A            H              1A  B 21  7DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  51                                  DSPATR(PC)
     A            R              1A  B 21 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(PC)
     A            FWRD           4A  B 21 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A            O              1A  B 21 50DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(PC)
     A            U              1A  B 21 63DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(PC)
     A            P              1A  B 21 76DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  52                                  DSPATR(PC)
     A            BUYER         16A  B 22  8DSPATR(PR)
     A                                      OVRDTA
     A            COMMENT       36A  B 22 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A            RQDEPT         6A  B 23 18DSPATR(PR)
     A                                      OVRDTA
     A            COMMENT2      36A  B 23 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FREQRLSE4
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 14'R E Q U I S I T I O N   A P P R O'
     A                                  1 48'V A L'
     A                                  2  3'REQ#    QUANTITY  BUDGET AMT ORIGI-
     A                                      NATOR CLS DEPT EXP/NW DATE'
     A                                 21 10'TOTAL:'
     A                                 22  1'A-APPROVE  R-RETURN  X-INQUIRE  P--
     A                                      PRINT  I-PO INQUIRY  D-FULL DESC'
     A                                 22 69'F-FORWARD'
     A                                 23  1'M-MODIFY'
     A            A              1A  B  3  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            REQNM01        7A  B  3  3DSPATR(PR)
     A                                      OVRDTA
     A            QTY01          8A  B  3 11DSPATR(PR)
     A                                      OVRDTA
     A            BUDGET01      11A  B  3 20DSPATR(PR)
     A                                      OVRDTA
     A            ORIG01        10A  B  3 32DSPATR(PR)
     A                                      OVRDTA
     A            C01            3A  B  3 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  74                                  DSPATR(RI)
     A  74                                  DSPATR(PC)
     A            DP01           4A  B  3 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  75                                  DSPATR(RI)
     A  75                                  DSPATR(PC)
     A            EXP01          6A  B  3 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            DAT01          6A  B  3 59DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B  3 66DSPATR(PR)
     A                                      OVRDTA
     A            DESC01        79A  B  4  1DSPATR(PR)
     A                                      OVRDTA
     A            REMARK01      79A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B  6  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            REQNM02        7A  B  6  3DSPATR(PR)
     A                                      OVRDTA
     A            QTY02          8A  B  6 11DSPATR(PR)
     A                                      OVRDTA
     A            BUDGET02      11A  B  6 20DSPATR(PR)
     A                                      OVRDTA
     A            ORIG02        10A  B  6 32DSPATR(PR)
     A                                      OVRDTA
     A            C02            3A  B  6 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            DP02           4A  B  6 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  76                                  DSPATR(RI)
     A  76                                  DSPATR(PC)
     A            EXP02          6A  B  6 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            DAT02          6A  B  6 59DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B  6 66DSPATR(PR)
     A                                      OVRDTA
     A            DESC02        79A  B  7  1DSPATR(PR)
     A                                      OVRDTA
     A            REMARK02      79A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  9  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            REQNM03        7A  B  9  3DSPATR(PR)
     A                                      OVRDTA
     A            QTY03          8A  B  9 11DSPATR(PR)
     A                                      OVRDTA
     A            BUDGET03      11A  B  9 20DSPATR(PR)
     A                                      OVRDTA
     A            ORIG03        10A  B  9 32DSPATR(PR)
     A                                      OVRDTA
     A            C03            3A  B  9 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            DP03           4A  B  9 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  77                                  DSPATR(RI)
     A  77                                  DSPATR(PC)
     A            EXP03          6A  B  9 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            DAT03          6A  B  9 59DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B  9 66DSPATR(PR)
     A                                      OVRDTA
     A            DESC03        79A  B 10  1DSPATR(PR)
     A                                      OVRDTA
     A            REMARK03      79A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 12  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            REQNM04        7A  B 12  3DSPATR(PR)
     A                                      OVRDTA
     A            QTY04          8A  B 12 11DSPATR(PR)
     A                                      OVRDTA
     A            BUDGET04      11A  B 12 20DSPATR(PR)
     A                                      OVRDTA
     A            ORIG04        10A  B 12 32DSPATR(PR)
     A                                      OVRDTA
     A            C04            3A  B 12 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            DP04           4A  B 12 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  78                                  DSPATR(RI)
     A  78                                  DSPATR(PC)
     A            EXP04          6A  B 12 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            DAT04          6A  B 12 59DSPATR(PR)
     A                                      OVRDTA
     A            J              1A  B 12 66DSPATR(PR)
     A                                      OVRDTA
     A            DESC04        79A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            REMARK04      79A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A            REQNM05        7A  B 15  3DSPATR(PR)
     A                                      OVRDTA
     A            QTY05          8A  B 15 11DSPATR(PR)
     A                                      OVRDTA
     A            BUDGET05      11A  B 15 20DSPATR(PR)
     A                                      OVRDTA
     A            ORIG05        10A  B 15 32DSPATR(PR)
     A                                      OVRDTA
     A            C05            3A  B 15 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A            DP05           4A  B 15 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  79                                  DSPATR(RI)
     A  79                                  DSPATR(PC)
     A            EXP05          6A  B 15 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A            DAT05          6A  B 15 59DSPATR(PR)
     A                                      OVRDTA
     A            K              1A  B 15 66DSPATR(PR)
     A                                      OVRDTA
     A            DESC05        79A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            REMARK05      79A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 18  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  56                                  DSPATR(RI)
     A  56                                  DSPATR(PC)
     A            REQNM06        7A  B 18  3DSPATR(PR)
     A                                      OVRDTA
     A            QTY06          8A  B 18 11DSPATR(PR)
     A                                      OVRDTA
     A            BUDGET06      11A  B 18 20DSPATR(PR)
     A                                      OVRDTA
     A            ORIG06        10A  B 18 32DSPATR(PR)
     A                                      OVRDTA
     A            C06            3A  B 18 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A            DP06           4A  B 18 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(RI)
     A  80                                  DSPATR(PC)
     A            EXP06          6A  B 18 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            DAT06          6A  B 18 59DSPATR(PR)
     A                                      OVRDTA
     A            L              1A  B 18 66DSPATR(PR)
     A                                      OVRDTA
     A            DESC06        79A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            REMARK06      79A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            TOTAL         14A  B 21 17DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-END PROGRAM f4-UNAVAIL f-
     A                                      7-NEW INQUIRY                      -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FRSRVINQ
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 19'R E S E R V A T I O N    I N Q U I'
     A                                  1 54'R Y'
     A                                  1 75'MQ1-7'
     A                                  3  1'CODE:'
     A                                  3 18'ONHAND:'
     A                                  3 38'RESERVED:'
     A                                  3 60'AVAILABLE:'
     A                                  5  4'WORKORDER'
     A                                  5 22'QUANTITY      DATE RESERVED     ST-
     A                                      AGE LOCATION    MACHINE'
     A                                 22 47'"f3"  TO END PROGRAM'
     A            COMPANY        3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            CORPCOD        7A  B  3  8DSPATR(PR)
     A                                      OVRDTA
     A            ONHAND         8A  B  3 27DSPATR(PR)
     A                                      OVRDTA
     A            RESERVED       8A  B  3 49DSPATR(PR)
     A                                      OVRDTA
     A            AVAILABL       8A  B  3 72DSPATR(PR)
     A                                      OVRDTA
     A            LINE1         79A  B  6  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE2         79A  B  7  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE3         79A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE4         79A  B  9  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE5         79A  B 10  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE6         79A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE7         79A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE8         79A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE9         79A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE10        79A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE11        79A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE12        79A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE13        79A  B 18  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE14        79A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE15        79A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HAPPIQ01
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 10'REQUISITION APPROVAL STATUS INQUIR-
     A                                      Y - HELP SCREEN   1 OF 2'
     A                                  3  1'The fields REQ NUMBER, REQ DATE, C-
     A                                      ORP CODE, QUANTITY, UM, ESTIMATED'
     A                                  3 69'PRICE,'
     A                                  4  1'DATE WANTED, PATH, and APPROVALS L-
     A                                      EFT are defined in the help screen'
     A                                  4 70'off the'
     A                                  5  1'requisition inquiry data screen.'
     A                                  7  1'LV'
     A                                  7 11'-  APPROVAL LEVEL.  Each approval'
     A                                  7 45'level that this requisition'
     A                                  8 14'must be approved at is shown.  Lev-
     A                                      el "00" is for the originator'
     A                                  9 14'of the requisition.'
     A                                 11  1'I'
     A                                 11 11'-  IN ORDER / SIMULTANEOUS.  This'
     A                                 11 45'field shows for each level whether'
     A                                 12 14'in order or simultaneous queueing'
     A                                 12 48'is in effect.  "O" stands for'
     A                                 13 14'"in order", and "S" stands for sim-
     A                                      ultaneous.  For any req path,'
     A                                 14 14'there can be a mixture of "in orde-
     A                                      r" and "simultaneous".  For'
     A                                 15 14'example, the approval path may go'
     A                                 15 48'like this:  1.  First, Department'
     A                                 16 14'Manager   2.  Next, Engineering Ma-
     A                                      nager, Accounting, and Business'
     A                                 17 14'Center Manager simultaneously.  3.'
     A                                 17 49'Last, Plant Manager.  For this'
     A                                 18 14'example, the "in order"/"simultane-
     A                                      ous" fields for the 5 approval'
     A                                 19 14'levels would look like this:  O-S--
     A                                      S-S-O.  In two cases, "in order"'
     A                                 20 14'and "simultaneous" do not apply: f-
     A                                      or level "00", which is the'
     A                                 21 14'req originator, because this is au-
     A                                      tomatically queued and approved.'
     A                                 22 14'The second is for a req that was f-
     A                                      orwarded to another approver.'
     A                                 23 14'In these two cases this field will'
     A                                 23 49'be blank.'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f2-NEXT f3-EXIT            -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HAPPIQ02
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 10'REQUISITION APPROVAL STATUS INQUIR-
     A                                      Y - HELP SCREEN   2 OF 2'
     A                                  4  1'QUE-DATE  -  REQUISITION DATE QUEU-
     A                                      ED TO APPROVER.  This shows the dat-
     A                                      e that'
     A                                  5 14'the requisition entered the approv-
     A                                      al queue of each approver.'
     A                                  6 14'This will be updated depending on'
     A                                  6 48'if the level is "in order"'
     A                                  7 14'or "simultaneous".  If all levels'
     A                                  7 48'for this approval path are'
     A                                  8 14'"simultaneous", all queued dates w-
     A                                      ill be set immediately to'
     A                                  9 14'date the req was created.  If all'
     A                                  9 48'levels for this approval path'
     A                                 10 14'are "in order", only the first app-
     A                                      rover"s queue date will be'
     A                                 11 14'updated.  When he approves the req-
     A                                      uisition, the next approvers'
     A                                 12 14'queue date will be updated, and so'
     A                                 12 49'on.  If the req has not yet'
     A                                 13 14'been put in the approvers queue, t-
     A                                      his field will be blank.'
     A                                 15  1'APP-DATE   - The date the requisit-
     A                                      ion was approved by each approver.'
     A                                 16 14'If not yet approved by the approve-
     A                                      r, this field will be blank.'
     A                                 18  1'ID'
     A                                 18 12'- Four-digit MMIS personnel system'
     A                                 18 47'identification number.'
     A                                 20  1'Name'
     A                                 20 12'- Full name of the approver from t-
     A                                      he MMIS personnel system.'
     A                                 22  1'Comments   - If the req has been f-
     A                                      orwarded to an approver, comments'
     A                                 22 69'may'
     A                                 23 14'be sent along with the forwarded r-
     A                                      eq.'
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HLPRQA01
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 14'REQUISITION INQUIRY/APPROVAL HELP'
     A                                  1 48'SCREEN'
     A                                  1 61'1 OF 6'
     A                                  4  1'SORT KEY'
     A                                  4 17'-  This tells in what order you wa-
     A                                      nt the requisitions to come'
     A                                  5 20'up.  Put one of the 6 numbers in t-
     A                                      he box:'
     A                                  6 20'1  -  No sort.  Reqs will come up'
     A                                  6 54'in whatever order they'
     A                                  7 26'happen to be in.'
     A                                  8 20'2  -  Req number.  Reqs will show'
     A                                  8 54'up in ascending order'
     A                                  9 26'by the requisition number (lower n-
     A                                      umber first).'
     A                                 10 20'3  -  Workorder.  Reqs will show u-
     A                                      p in order by workorder'
     A                                 11 26'number.  Those reqs without a work-
     A                                      order will show up'
     A                                 12 26'last.'
     A                                 13 20'4  -  Budget number.  Reqs will co-
     A                                      me up in ascending order'
     A                                 14 26'by budget number.'
     A                                 15 20'5  -  Date (most recent first).  R-
     A                                      eqs will come up in'
     A                                 16 26'descending order by date.'
     A                                 17 20'6  -  Date (oldest first).  Reqs w-
     A                                      ill come up in ascending'
     A                                 18 26'order by date.'
     A            COMMANDLN1    79A  B 24  1DFTVAL('        F2-NEXT            -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HLPRQA02
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 14'REQUISITION INQUIRY/APPROVAL HELP'
     A                                  1 48'SCREEN'
     A                                  1 61'2 OF 6'
     A                                  4  1'EXCLUDE OPTIONS'
     A                                  5  1'---------------'
     A                                  6  1'These options let you see subsets'
     A                                  6 35'of the data requested in the selec-
     A                                      tion'
     A                                  7  1'options.  Example:  if looking for'
     A                                  7 36'all reqs for WO 1086H, you could l-
     A                                      ook at'
     A                                  8  1'non-coded items only.  These optio-
     A                                      ns are also used for requisition ap-
     A                                      proval:'
     A                                  9  1'to select only those reqs for an a-
     A                                      pprover that have not already been'
     A                                  9 70'approved.'
     A                                 10  1'Note: you may exclude multiple ite-
     A                                      ms, but remember that it is possibl-
     A                                      e to'
     A                                 11  1'exclude ALL reqs, and thus the pro-
     A                                      gram will not bring up anything on'
     A                                 11 70'the'
     A                                 12  1'inquiry.  The program will not che-
     A                                      ck for this.  Example:  show all re-
     A                                      qs for'
     A                                 13  1'corporate code 4440011, exclude co-
     A                                      ded storeroom.'
     A                                 15  1'Three of the exclude options have'
     A                                 15 35'to do with the STATUS of the requi-
     A                                      sition.'
     A                                 16  1'There are 3 statuses:'
     A                                 18  3'1.  Awaiting approvals (unapproved-
     A                                      ).  These reqs have not yet gone to'
     A                                 19  7'purchasing.'
     A                                 20  3'2.  In purchasing.  These reqs hav-
     A                                      e been approved, but not yet assign-
     A                                      ed to'
     A                                 21  7'a PO.'
     A                                 22  3'3.  On Purchase Order.  These reqs'
     A                                 22 38'have been assigned to a PO.'
     A            COMMANDLN1    79A  B 24  1DFTVAL('F1-PREV F2-NEXT            -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HLPRQA03
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 14'REQUISITION INQUIRY/APPROVAL HELP'
     A                                  1 48'SCREEN'
     A                                  1 61'3 OF 6'
     A                                  4  1'EXCLUDE UNAPPROVED'
     A                                  4 27'-  Excludes all reqs not yet appro-
     A                                      ved from the'
     A                                  5 30'inquiry.  This leaves only those i-
     A                                      n purchasing'
     A                                  6 30'or on a PO.'
     A                                  8  1'EXCLUDE IN PURCHASING     -  Exclu-
     A                                      des all reqs in purchasing.  Leaves-
     A                                       unapproved'
     A                                  9 30'or on a PO.'
     A                                 11  1'EXCLUDE ON PO'
     A                                 11 27'-  Excludes all reqs on a PO.  Lea-
     A                                      ves only unapproved'
     A                                 12 30'or in purchasing.'
     A                                 14  1'EXCLUDE REQS YOU APPROVED -  Norma-
     A                                      lly used by approvers.  Approvers'
     A                                 14 69'want to see'
     A                                 15 30'only those reqs they need to appro-
     A                                      ve.  A req may'
     A                                 16 30'be in an unapproved state, but alr-
     A                                      eady approved'
     A                                 17 30'by that person.  This lets him avo-
     A                                      id looking at'
     A                                 18 30'those reqs he has already approved-
     A                                      .'
     A            COMMANDLN1    79A  B 24  1DFTVAL('F1-PREV F2-NEXT            -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HLPRQA04
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 14'REQUISITION INQUIRY/APPROVAL HELP'
     A                                  1 48'SCREEN'
     A                                  1 61'4 OF 6'
     A                                  3  1'Three of the exclude options have'
     A                                  3 35'to do with the type of code:'
     A                                  5  1'1.  Coded storeroom.  These are it-
     A                                      ems that have a corporate code and'
     A                                  5 70'are'
     A                                  6  5'handled by the storeroom.  Requisi-
     A                                      tions for coded storeroom items go'
     A                                  7  5'directly to materials control, byp-
     A                                      assing the online approval process.'
     A                                  9  1'2.  Coded non-storeroom.  These ar-
     A                                      e items that have a corporate code,-
     A                                       but'
     A                                 10  5'are not handled by the storeroom.'
     A                                 10 40'A code is classified as coded non-'
     A                                 11  5'storeroom if REORDER = 0,  EXPEDIT-
     A                                      E = 0,  and  MAX = 0.'
     A                                 13  1'3.  Non-coded.  These are items th-
     A                                      at do not have a corporate code.'
     A                                 15  1'EXCLUDE CODED STOREROOM   -  Exclu-
     A                                      des all reqs for coded storeroom it-
     A                                      ems.'
     A                                 17  1'EXCLUDE CODED NON-STORES  -  Exclu-
     A                                      des all reqs for coded non-storeroo-
     A                                      m items.'
     A                                 19  1'EXCLUDE NON-CODED'
     A                                 19 27'-  Excludes all reqs for non-coded'
     A                                 19 62'items.'
     A            COMMANDLN1    79A  B 24  1DFTVAL('F1-PREV F2-NEXT            -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HLPRQA05
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 14'REQUISITION INQUIRY/APPROVAL HELP'
     A                                  1 48'SCREEN'
     A                                  1 61'5 OF 6'
     A                                  3  1'The final exclusion option is to s-
     A                                      how only reqs that are "on hold".'
     A                                  3 70'This'
     A                                  4  1'can be used by requisition origina-
     A                                      tors to find out if any of their'
     A                                  5  1'requisitions have been returned.'
     A                                  5 35'To do this, put your employee ID i-
     A                                      n the'
     A                                  6  1'Originator field, and put an "X" i-
     A                                      n the Include only "on hold" reqs'
     A                                  6 69'box.'
     A                                  8  1'If an approver returns a requisiti-
     A                                      on, the req goes into hold status'
     A                                  9  1'RETURNED, and nothing further can'
     A                                  9 35'be done to it until it is modified-
     A                                      .'
     A                                 10  1'The approver can send comments alo-
     A                                      ng with the req if it is returned.'
     A                                 11  1'Look for these in the ROUTE COMMEN-
     A                                      TS field when the data screen is br-
     A                                      ought'
     A                                 12  1'up for the returned reqs.'
     A            COMMANDLN1    79A  B 24  1DFTVAL('F1-PREV F2-NEXT            -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HLPRQA06
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 14'REQUISITION INQUIRY/APPROVAL HELP'
     A                                  1 48'SCREEN'
     A                                  1 61'6 OF 6'
     A                                  4  1'REQUSIITION NUMBER   -  Enter a re-
     A                                      q number you wish to inquire on or'
     A                                  4 70'approve.'
     A                                  5 25'Only this particular req will be b-
     A                                      rought up.'
     A                                  7  1'WORK ORDER NUMBER    -  Enter an M-
     A                                      MIS workorder number.  All requsiti-
     A                                      ons for'
     A                                  8 25'this workorder will be brought up.'
     A                                 10  1'CORPORATE CODE'
     A                                 10 22'-  Enter a storeroom corporate cod-
     A                                      e number.  All reqs'
     A                                 11 25'for this corporate code will be br-
     A                                      ought up.'
     A                                 13  1'ORIGINATOR'
     A                                 13 22'-  Enter the employee ID of any pe-
     A                                      rson in the MMIS'
     A                                 14 25'Personnel system.  All requisition-
     A                                      s that this person'
     A                                 15 25'has originated will be brought up.'
     A                                 17  1'APPROVER'
     A                                 17 22'-  Enter the employee ID of any va-
     A                                      lid person that'
     A                                 18 25'is set up to approve requisitions.'
     A                                 18 61'This will show'
     A                                 19 25'all requisitions waiting for appro-
     A                                      val by this person.'
     A            COMMANDLN1    79A  B 24  1DFTVAL('F1-PREV                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HLPRQB01
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 13'REQUISITION INQUIRY/APPROVAL HELP'
     A                                  1 47'SCREEN     1 OF 7'
     A                                  3  1'REQ NUMBER     -  Req numbers are'
     A                                  3 35'computer-generated sequential numb-
     A                                      ers.'
     A                                  4 19'Coded storeroom reqs are up to 5 n-
     A                                      umeric digits.'
     A                                  5 19'MMIS and non-storeroom non-MMIS re-
     A                                      quisitions start with'
     A                                  6 19'"M", followed by up to 6 digits.'
     A                                  8  1'DATE'
     A                                  8 16'-  Date the requisition was create-
     A                                      d.'
     A                                 10  1'CORP CODE      -  Corporate code.'
     A                                 10 36'For non-coded items, this will rea-
     A                                      d NON-STR.'
     A                                 11 19'Coded non-storeroom items have a c-
     A                                      ode, but ONHAND, REORDER,'
     A                                 12 19'EXPEDITE, and MAX are all zero.'
     A                                 14  1'UM'
     A                                 14 16'-  The unit of measure the item is'
     A                                 14 51'requisitioned in.  For'
     A                                 15 19'coded items, this must be the stor-
     A                                      eroom UM.  For non-coded'
     A                                 16 19'items, the order UM must match the'
     A                                 16 54'price UM.'
     A                                 18  1'ESTIMATED PRICE-  Estimated unit p-
     A                                      rice of the item.'
     A                                 20  1'BUDGET AMOUNT  -  The quanity orde-
     A                                      red times the estimated unit price,-
     A                                       rounded'
     A                                 21 19'to the nearest dollar.'
     A                                 23  1'BUDGET NUMBER  -  The budget numbe-
     A                                      r under which this req falls, if an-
     A                                      y.'
     A            COMMANDLN1    79A  B 24  1DFTVAL('        F2-NEXT            -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HLPRQB02
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 13'REQUISITION INQUIRY/APPROVAL HELP'
     A                                  1 47'SCREEN     2 OF 7'
     A                                  3  1'APP'
     A                                  3 16'-  Workorder cost amounts.  This i-
     A                                      s the amount approved'
     A                                  4 19'for that workorder: sum of labor e-
     A                                      stimate, stores estimate,'
     A                                  5 19'and purchasing estimate at the tim-
     A                                      e the workorder was'
     A                                  6 19'approved.'
     A                                  8  1'COMT'
     A                                  8 16'-  Workorder cost amounts.  This i-
     A                                      s the amount committed for that'
     A                                  9 19'workorder so far:  sum of labor ac-
     A                                      tual, stores actual,'
     A                                 10 19'and purchasing actual.'
     A                                 12  1'REQ'
     A                                 12 16'-  Workorder cost amounts.  This i-
     A                                      s the amount requisitioned'
     A                                 13 19'but not yet purchased.'
     A                                 15  1'AVAIL'
     A                                 15 16'-  Workorder cost amounts.  This i-
     A                                      s the amount available on the'
     A                                 16 19'workorder.  This equals the follow-
     A                                      ing:'
     A                                 17 19'WO AMT APPROVED - AMT COMMITTED +'
     A                                 17 53'AMT REQ NOT PURCH'
     A                                 19  1'Note: if the requisition is not as-
     A                                      sociated with a workorder, all thes-
     A                                      e'
     A                                 20  1'workorder cost fields will be zero-
     A                                      .'
     A            COMMANDLN1    79A  B 24  1DFTVAL('F1-PREV F2-NEXT            -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HLPRQB03
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 12'REQUISITION INQUIRY/APPROVAL HELP'
     A                                  1 46'SCREEN      3 OF 7'
     A                                  3  1'DATE WANTED    -  The date the ori-
     A                                      ginator needs the item.'
     A                                  5  1'CO'
     A                                  5 16'-  Accounting data - company code.'
     A                                  7  1'PRM'
     A                                  7 16'-  Accounting data - prime.'
     A                                  9  1'CLS'
     A                                  9 16'-  Accounting data - accounting cl-
     A                                      ass (sub).'
     A                                 11  1'DEPT'
     A                                 11 16'-  Accounting data - department (s-
     A                                      ub-detail).'
     A                                 13  1'EXP/NW'
     A                                 13 16'-  Accounting data - expense class-
     A                                      /new work (Addtl-data).'
     A                                 15  1'STAG'
     A                                 15 16'-  Staging area:  where the item i-
     A                                      s to be staged after receipt.'
     A                                 17  1'ORIG'
     A                                 17 16'-  Employee ID of the originator.'
     A                                 19  1'NAME'
     A                                 19 16'-  Name of the employee from the M-
     A                                      MIS personnel system.'
     A                                 21  1'WORKORDER      -  MMIS workorder n-
     A                                      umber from which this req was gener-
     A                                      ated.'
     A                                 23  1'APP?'
     A                                 23 16'-  "Y" if workorder is approved, "-
     A                                      N" if WO is not approved.'
     A            COMMANDLN1    79A  B 24  1DFTVAL('F1-PREV F2-NEXT            -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HLPRQB04
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 12'REQUISITION INQUIRY/APPROVAL HELP'
     A                                  1 46'SCREEN      4 OF 7'
     A                                  3  1'ADDITIONAL INFO -  Free format com-
     A                                      ment field.'
     A                                  5  1'SUGGESTED VENDOR-  Free format com-
     A                                      ment field for suggested vendor to'
     A                                  5 70'buy from.'
     A                                  7  1'TYPE'
     A                                  7 17'-  "P" for purchase requisition, "-
     A                                      R" for repair requisition.'
     A                                  9  1'MOD?'
     A                                  9 17'-  Modify flag.  "Y" if this req h-
     A                                      as been modified, "N" if not.'
     A                                 11  1'PATH'
     A                                 11 17'-  Approval path this requisition'
     A                                 11 51'follows.  Different types of'
     A                                 12 20'reqs may need to be approved by di-
     A                                      fferent people.  The'
     A                                 13 20'approval path defines which people'
     A                                 13 55'need to approve this'
     A                                 14 20'req.  To see what type of req will'
     A                                 14 55'take this approval path,'
     A                                 15 20'see the Requisition Approval Path'
     A                                 15 54'Definition Inquiry.'
     A                                 17  1'APP LEFT'
     A                                 17 17'-  Number of approvals left before'
     A                                 17 52'this req gets released to'
     A                                 18 20'purchasing.'
     A                                 20  1'DESCRIPTION     -  The first 3 lin-
     A                                      es of free-format description for'
     A                                 20 69'a non-coded'
     A                                 21 20'req, or the first 3 lines of the c-
     A                                      orporate code description'
     A                                 22 20'for a coded req.  Note: the f4 key'
     A                                 22 55'can always be used to see'
     A                                 23 20'the full description.'
     A            COMMANDLN1    79A  B 24  1DFTVAL('F1-PREV F2-NEXT            -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HLPRQB05
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 12'REQUISITION INQUIRY/APPROVAL HELP'
     A                                  1 46'SCREEN      5 OF 7'
     A                                  3  1'REMARKS'
     A                                  3 17'-  Two free format comment fields.'
     A                                  5  1'PURCHASE ORDER  -  If the req has'
     A                                  5 35'been assigned a PO, this show PO n-
     A                                      umber.'
     A                                  7  1'ORDERED'
     A                                  7 17'-  If on PO, the quantity ordered.'
     A                                  9  1'UM'
     A                                  9 17'-  If on PO, the ordered unit of m-
     A                                      easure.'
     A                                 11  1'DELIVERED'
     A                                 11 17'-  If on PO, the delivered (receiv-
     A                                      ed) quantity.'
     A                                 13  1'DATE DLVR'
     A                                 13 17'-  If on PO, the date of the last'
     A                                 13 51'receiving slip.'
     A                                 15  1'BLANKET'
     A                                 15 17'-  For coded items only.  If the c-
     A                                      ode is on a blanket or'
     A                                 16 20'requirements order, most recent un-
     A                                      expired blanket is shown.'
     A                                 18  1'TYPE'
     A                                 18 17'-  The next field shows the type a-
     A                                      nd status of the requisition.'
     A                                 19 20'Possibilities are:'
     A                                 20 22'NON CODED ITEM'
     A                                 20 48'no corporate code'
     A                                 21 22'CODED NON-STOREROOM ITEM  onhand,'
     A                                 21 56'max, reorder = 0'
     A                                 22 22'CODED STOREROOM ITEM      coded, s-
     A                                      toreroom controlled'
     A            COMMANDLN1    79A  B 24  1DFTVAL('F1-PREV F2-NEXT            -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HLPRQB06
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 12'REQUISITION INQUIRY/APPROVAL HELP'
     A                                  1 46'SCREEN      6 OF 7'
     A                                  3  1'STATUS'
     A                                  3 17'-  This field shows the status of'
     A                                  3 51'the requisition: where it'
     A                                  4 20'is at.  The possibilities are:'
     A                                  5 22'AWAITING APPROVALS'
     A                                  6 22'IN PURCHASING'
     A                                  7 22'ON A PURCHASE ORDER'
     A                                  9  1'APP STATUS      -  Type an "X" in'
     A                                  9 35'this box to get a requisition appr-
     A                                      oval'
     A                                 10 20'status inquiry for this requisitio-
     A                                      n.'
     A                                 12  1'HELP'
     A                                 12 17'-  Type an "X" in this box to brin-
     A                                      g up the help screens.'
     A                                 14  1'RETURN'
     A                                 14 17'-  APPROVERS ONLY.  This box allow-
     A                                      s the requisition to be'
     A                                 15 20'returned to the originator, if the'
     A                                 15 55'approver has return'
     A                                 16 20'capability.  All current queue ent-
     A                                      ries for this req will'
     A                                 17 20'be deleted, and the req will be co-
     A                                      mpletely re-queued.'
     A                                 18 20'The req will go into hold status "-
     A                                      returned", and no further'
     A                                 19 20'processing will be allowed until a'
     A                                 19 55'modification is done.'
     A                                 21  1'FORWARD TO      -  APPROVERS ONLY.'
     A                                 21 37'This box allows an approver to for-
     A                                      ward the'
     A                                 22 20'req to any other approvers queue f-
     A                                      or approval.'
     A            COMMANDLN1    79A  B 24  1DFTVAL('F1-PREV F2-NEXT            -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HLPRQB07
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 12'REQUISITION INQUIRY/APPROVAL HELP'
     A                                  1 46'SCREEN      7 OF 7'
     A                                  3  1'MODIFY'
     A                                  3 17'-  APPROVERS ONLY.  If the approve-
     A                                      r has modify capability,'
     A                                  4 20'putting an "X" in this box will br-
     A                                      ing up the requisition'
     A                                  5 20'modify screen for that req.'
     A                                  7  1'UNAVAIL'
     A                                  7 17'-  APPROVERS ONLY.  This box is us-
     A                                      ed to mark yourself'
     A                                  8 20'unavailable for approving reqs - f-
     A                                      or vacations, sick days,'
     A                                  9 20'etc.  In this case whoever is the'
     A                                  9 54'alternate at your level'
     A                                 10 20'will take over any subsequent requ-
     A                                      isitions for approval.'
     A                                 12  1'REPRT'
     A                                 12 17'-  APPROVERS ONLY.  Putting an "X"'
     A                                 12 52'in this box will cause a'
     A                                 13 20'reprint of the requisition to be g-
     A                                      enerated at your local'
     A                                 14 20'printer.'
     A                                 16  1'ROUTE COMMENTS  -  APPROVERS ONLY.'
     A                                 16 37'This field is used to send a comme-
     A                                      nt when'
     A                                 17 20'the requisition if forwarded to an-
     A                                      other approver.'
     A                                 18 20'If any comments are in the req ent-
     A                                      ry in your queue, those'
     A                                 19 20'comments will appear in the field.'
     A            COMMANDLN1    79A  B 24  1DFTVAL('F1-PREV                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HMJGRP01
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 19'MAJOR GROUP INQUIRY - GENERAL'
     A                                  3  1'01   ABRASIVES, ADHESIVES (CEMENTS-
     A                                      , GLUE)'
     A                                  4  1'02   COMPRESSOR, GAS GENERATOR, BL-
     A                                      OWER, PUMP-PARTS AND ACCESSORIES'
     A                                  5  1'03   DO NOT USE'
     A                                  6  1'04   CABLE, ROPE, CHAIN, HOIST-PAR-
     A                                      TS AND ACCESSORIES'
     A                                  7  1'05   DO NOT USE'
     A                                  8  1'06   CHARTS'
     A                                  9  1'07   DO NOT USE'
     A                                 10  1'08   DRUM AND DRUM PARTS - MOLD PA-
     A                                      RTS, CURING BLADDER'
     A                                 11  1'09   DUST COLLECTORS, AIR HANDLING-
     A                                      -COOLING, HEATING, FILTERS'
     A                                 12  1'10   FASTENER, WASHERS, EYEBOLTS'
     A                                 13  1'11   DO NOT USE'
     A                                 14  1'12   DO NOT USE'
     A                                 15  1'13   GASKETS, O-RINGS, PACKING'
     A                                 16  1'14   DO NOT USE'
     A                                 17  1'15   HEALTH, SAFETY AND JANITORIAL'
     A                                 17 36'SUPPLIES'
     A                                 18  1'16   DO NOT USE'
     A                                 19  1'17   HOSE, HOSE ASSEMBLIES, HOSE F-
     A                                      ITTINGS'
     A                                 20  1'18   DO NOT USE'
     A                                 21  1'19   LUBRICANTS, LUBRICATING EQUIP-
     A                                      MENT AND PARTS'
     A                                 22  1'20   LABORATORY SUPPLIES 01 TO 10'
     A                                 23  1'21   LUMBER, GLASS, BUILDING MATER-
     A                                      IALS AND HARDWARE'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f2-NEXT f3-EXIT            -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HMJGRP02
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 19'MAJOR GROUP INQUIRY - GENERAL'
     A                                  3  1'22   MAJOR MACHINE MANUFACTURERS"'
     A                                  3 35'- SPARE PARTS'
     A                                  4  1'23   METALS'
     A                                  5  1'24   DO NOT USE'
     A                                  6  1'25   PAINT, AIR MOTORS AND SPRAY E-
     A                                      QUIPMENT - PARTS AND SUPPLIES'
     A                                  7  1'26   RAW MATERIALS NAME AND NUMBER'
     A                                  7 36'CODES'
     A                                  8  1'27   EXPERIMENTAL RAW MATERIAL TIR-
     A                                      E WIRE POLYETHYLENE PROCESS MATERIA-
     A                                      L'
     A                                  9  1'28   INDUSTRIAL FABRICS LINER YARN'
     A                                  9 36'- MISC TEXTILES - CHEMICALS'
     A                                 10  1'29   TIRE FABRIC'
     A                                 11  1'30   RETURNABLE CONTAINERS - MATER-
     A                                      IALS PACKAGING'
     A                                 12  1'31   STATIONERY, OFFICE SUPPLIES,'
     A                                 12 35'TAGS, LABELS'
     A                                 13  1'32   SPRINGS'
     A                                 14  1'33   TOOLS - METAL PRODUCTS MACHIN-
     A                                      ERY'
     A                                 15  1'34   TOOLING DIE'
     A                                 16  1'35   TRANSPORTATION EQUIPMENT AND'
     A                                 16 35'PARTS'
     A                                 17  1'36   DO NOT USE'
     A                                 18  1'37   WELDING AND SOLDERING - PARTS'
     A                                 18 36'AND SUPPLIES'
     A                                 19  1'38   DO NOT USE'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-PREVIOUS f2-NEXT f3-EXIT-
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HMJGRP03
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 13'MAJOR GROUP INQUIRY - NON-GROUPED'
     A                                  1 47'ALPHA LISTING'
     A                                  3  1'39   A-B'
     A                                  4  1'40   C-D'
     A                                  5  1'41   E-F'
     A                                  6  1'42   G-H'
     A                                  7  1'43   I-J-K'
     A                                  8  1'44   I-M'
     A                                  9  1'45   N-O'
     A                                 10  1'46   P-Q-R'
     A                                 11  1'47   S-T'
     A                                 12  1'48   U-V'
     A                                 13  1'49   W-X-Y-Z'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-PREVIOUS f2-NEXT f3-EXIT-
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HMJGRP04
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 14'MAJOR GROUP INQUIRY - PIPING AND V-
     A                                      ALVES'
     A                                  3  1'50   PIPE AND TUBING'
     A                                  4  1'51   PIPE FITTINGS'
     A                                  5  1'52   DO NOT USE'
     A                                  6  1'53   DO NOT USE'
     A                                  7  1'54   TUBE FITTINGS'
     A                                  8  1'55   DO NOT USE'
     A                                  9  1'56   VALVES'
     A                                 10  1'57   VALVE PARTS AND REPAIR KITS'
     A                                 11  1'58   FAUCET - PNEUMATIC INSTRUMENT'
     A                                 11 36'PARTS'
     A                                 12  1'59   MISCELLANEOUS'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-PREVIOUS f2-NEXT f3-EXIT-
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HMJGRP05
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 11'MAJOR GROUP INQUIRY - ELECTRICAL A-
     A                                      ND ELECTRONIC'
     A                                  3  1'60   DO NOT USE'
     A                                  4  1'61   CIRCUIT BOARD AMPLIFIER, MODU-
     A                                      LE, POWER SUPPLY, METER'
     A                                  5  1'62   DO NOT USE'
     A                                  6  1'63   COIL, CONTACT, CONTACT BLOCK,'
     A                                  6 36'CONTACT KIT'
     A                                  7  1'64   DO NOT USE'
     A                                  8  1'65   CONDUIT, CONDUIT FITTINGS AND'
     A                                  8 36'ACCESSORIES'
     A                                  9  1'66   LAMP, FIXTURES, BALLAST'
     A                                 10  1'67   MOTOR, GENERATOR, BRUSHES, MO-
     A                                      TOR BEARINGS'
     A                                 11  1'68   DO NOT USE'
     A                                 12  1'69   PROTECTIVE DEVICES (CIRCUIT B-
     A                                      REAKER, FUSE, OVERLOAD HEATER)'
     A                                 13  1'70   RELAY, TIMER, PHOTOELECTRIC A-
     A                                      CCESSORIES'
     A                                 14  1'71   CAPACITOR, POTENTIOMETER, RES-
     A                                      ISTOR, RHEOSTAT'
     A                                 15  1'72   SEMICONDUCTORS, TUBE'
     A                                 16  1'73   DO NOT USE'
     A                                 17  1'74   STARTER, CONTACTOR'
     A                                 18  1'75   SWITCH, SWITCH ACCESSORIES'
     A                                 19  1'76   DO NOT USE'
     A                                 20  1'77   TRANSFORMER, CHOKE'
     A                                 21  1'78   WIRE, WIRING DEVICES, CABLE,'
     A                                 21 35'CORD'
     A                                 22  1'79   MISCELLANEOUS'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-PREVIOUS f2-NEXT f3-EXIT-
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HMJGRP06
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 14'MAJOR GROUP INQUIRY - POWER TRANSM-
     A                                      ISSION'
     A                                  3  1'80   DO NOT USE'
     A                                  4  1'81   BEARING'
     A                                  5  1'82   DO NOT USE'
     A                                  6  1'83   BELT, BELTING AND ACCESSORIES'
     A                                  7  1'84   BRAKE, CLUTCH'
     A                                  8  1'85   COUPLING, JOINT'
     A                                  9  1'86   CYLINDER'
     A                                 10  1'87   DO NOT USE'
     A                                 11  1'88   GEAR'
     A                                 12  1'89   GEAR BOXES, SPEED REDUCER'
     A                                 13  1'90   DO NOT USE'
     A                                 14  1'91   GEAR MOTOR, HYDRAULIC MOTOR'
     A                                 15  1'92   SEALS, SET COLLAR, RETAINING'
     A                                 15 35'RINGS, SHAFT'
     A                                 16  1'93   SPROCKET, CHAIN, PULLEY, SHEA-
     A                                      VE'
     A                                 17  1'94   DO NOT USE'
     A                                 18  1'95   TENSIONER, IDLER, TORQUE LIMI-
     A                                      TER'
     A                                 19  1'96   DO NOT USE'
     A                                 20  1'97   DO NOT USE'
     A                                 21  1'98   DO NOT USE'
     A                                 22  1'--   DO NOT USE'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-PREVIOUS f3-EXIT        -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INQFRT_4
     A*%%TS  SD  19940624  093014  A193138     REL-V2R3M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 20'-----------------------------------
     A                                      ---'
     A                                  2 20':  F R E I G H T     I N Q U I R Y'
     A                                  2 56':'
     A                                  3 20':'
     A                                  3 56':'
     A                                  4 20':'
     A                                  4 56':'
     A                                  5 20':'
     A                                  5 56':'
     A                                  6 20':    RECEIVERS 001 THROUGH'
     A                                  6 56':'
     A                                  7 20'-----------------------------------
     A                                      ---'
     A            PO             7A  B  4 31DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  4 39DSPATR(PR)
     A                                      OVRDTA
     A            RS             3A  B  4 43DSPATR(PR)
     A                                      OVRDTA
     A            END            3A  B  6 47DSPATR(PR)
     A                                      OVRDTA
     A            REFERLIT      24A  B  8 18DSPATR(PR)
     A                                      OVRDTA
     A            REFERPO        7A  B  8 43DSPATR(PR)
     A                                      OVRDTA
     A            REFERRLSE      3A  B  8 51DSPATR(PR)
     A                                      OVRDTA
     A            REFERRS        3A  B  8 55DSPATR(PR)
     A                                      OVRDTA
     A                                  9  2'SEQUENCE:'
     A                                  9 30'FRT TYPE:'
     A                                  9 55'INSPECTING EMPLOYEE:'
     A                                 11  2'PACKING SLIP'
     A                                 11 30'CHARGE:'
     A                                 11 55'CARRIER:'
     A                                 13  2'BILL NO:'
     A                                 13 30'ORIGIN:'
     A                                 13 55'FREIGHT DATE:'
     A                                 15  2'CAR NUMBER:'
     A                                 15 30'ZBILL:'
     A                                 15 55'OSD:'
     A                                 17  2'CARRIER"S WEIGHT:'
     A                                 17 30'OUR WEIGHT:'
     A                                 17 55'LOT:'
     A                                 19  2'SEALS:'
     A                                 20  2'OSD CMT:'
     A            SEQ            6A  B  9 16DSPATR(PR)
     A                                      OVRDTA
     A            TYPE           8A  B  9 43DSPATR(PR)
     A                                      OVRDTA
     A            EMPL           4A  B  9 76DSPATR(PR)
     A                                      OVRDTA
     A            PACK          12A  B 11 15DSPATR(PR)
     A                                      OVRDTA
     A            CHARGES       16A  B 11 38DSPATR(PR)
     A                                      OVRDTA
     A            CARR           4A  B 11 69DSPATR(PR)
     A                                      OVRDTA
     A            FRTBILL       16A  B 13 11DSPATR(PR)
     A                                      OVRDTA
     A            ORIGIN        10A  B 13 43DSPATR(PR)
     A                                      OVRDTA
     A            MMDDYY         8A  B 13 69DSPATR(PR)
     A                                      OVRDTA
     A            CAR           10A  B 15 16DSPATR(PR)
     A                                      OVRDTA
     A            ZBILL          5A  B 15 43DSPATR(PR)
     A                                      OVRDTA
     A            OSD            4A  B 15 69DSPATR(PR)
     A                                      OVRDTA
     A            CARRWT         8A  B 17 20DSPATR(PR)
     A                                      OVRDTA
     A            OUR            8A  B 17 43DSPATR(PR)
     A                                      OVRDTA
     A            LOT            8A  B 17 69DSPATR(PR)
     A                                      OVRDTA
     A            SEALS         68A  B 19 12DSPATR(PR)
     A                                      OVRDTA
     A            OSDCLM        68A  B 20 12DSPATR(PR)
     A                                      OVRDTA
     A            LIVEHIST      23A  B 22 57DSPATR(PR)
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RECEIVER INQUIRY f2-NEXT-
     A                                       FREIGHT f8-PREVIOUS FREIGHT f7-EXI-
     A                                      T f3-END PROGRAM ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INQKWM
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 74'CP1-4-2'
     A                                  2 18'-----------------------------------
     A                                      -----------'
     A                                  3 18'.'
     A                                  3 31'I N Q U I R Y   B Y'
     A                                  3 62'.'
     A                                  4 18'.'
     A                                  4 62'.'
     A                                  5 18'.      K E Y W O R D / M O D I F I'
     A                                  5 53'E R      .'
     A                                  6 18'-----------------------------------
     A                                      -----------'
     A                                  9 15'KEYWORD'
     A                                  9 37'MODIFIER'
     A                                 13  5'SELECTION OPTIONS:'
     A                                 15  5'MAJOR GROUP'
     A                                 15 23'SUB GROUP'
     A                                 15 40'FIRST DIGIT OF SEQUENCE'
     A                                 20  5'PRESS "ENTER" TO RETRIEVE CODES AN-
     A                                      D THEIR PRIMARY LANGUAGE DESCRIPTIO-
     A                                      NS'
     A                                 21 12'"f1"   TO RETRIEVE CODES AND THEIR'
     A                                 21 47'SECONDARY LANGUAGE DESCRIPTIONS'
     A                                 22 12'"f3"   TO RETURN TO THE INQUIRY ME-
     A                                      NU'
     A            KEYWORD       19A  B 10 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            MODIFIER      30A  B 10 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            DUMMY         19A  B 14  5DSPATR(PR)
     A                                      OVRDTA
     A            DUMMY2        30A  B 14 26DSPATR(PR)
     A                                      OVRDTA
     A            MG             2A  B 15 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            SG             2A  B 15 33DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            F              1A  B 15 64DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-SECOND LANGUAGE f2-MAJ G-
     A                                      RP INQUIRY                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INQKWM2
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'KEYWORD/MODIFIER'
     A                                  1 72'CP1-4-2A'
     A                                  2  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 21  1'FOR MORE INFORMATION ON ANY CODE,'
     A                                 21 35'SELECT IT BY TYPING AN "X" AND PRE-
     A                                      SS "ENTER"'
     A            MANUFACTUR    50A  B  1 19DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  3  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            CODE1          7A  B  3  3DSPATR(PR)
     A                                      OVRDTA
     A            TY1            3A  B  3 11DSPATR(PR)
     A                                      OVRDTA
     A            PARTNO1       20A  B  3 15DSPATR(PR)
     A                                      OVRDTA
     A            PARTIALKWM    44A  B  3 36DSPATR(PR)
     A                                      OVRDTA
     A            C1DESC1       79A  B  4  1DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B  5  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            CODE2          7A  B  5  3DSPATR(PR)
     A                                      OVRDTA
     A            TY2            3A  B  5 11DSPATR(PR)
     A                                      OVRDTA
     A            PARTNO2       20A  B  5 15DSPATR(PR)
     A                                      OVRDTA
     A            PARTIALKW2    44A  B  5 36DSPATR(PR)
     A                                      OVRDTA
     A            C2DESC1       79A  B  6  1DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  7  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            CODE3          7A  B  7  3DSPATR(PR)
     A                                      OVRDTA
     A            TY3            3A  B  7 11DSPATR(PR)
     A                                      OVRDTA
     A            PARTNO3       20A  B  7 15DSPATR(PR)
     A                                      OVRDTA
     A            PARTIALKW3    44A  B  7 36DSPATR(PR)
     A                                      OVRDTA
     A            C3DESC1       79A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B  9  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            CODE4          7A  B  9  3DSPATR(PR)
     A                                      OVRDTA
     A            TY4            3A  B  9 11DSPATR(PR)
     A                                      OVRDTA
     A            PARTNO4       20A  B  9 15DSPATR(PR)
     A                                      OVRDTA
     A            PARTIALKW4    44A  B  9 36DSPATR(PR)
     A                                      OVRDTA
     A            C4DESC1       79A  B 10  1DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 11  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            CODE5          7A  B 11  3DSPATR(PR)
     A                                      OVRDTA
     A            TY5            3A  B 11 11DSPATR(PR)
     A                                      OVRDTA
     A            PARTNO5       20A  B 11 15DSPATR(PR)
     A                                      OVRDTA
     A            PARTIALKW5    44A  B 11 36DSPATR(PR)
     A                                      OVRDTA
     A            C5DESC1       79A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 13  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A            CODE6          7A  B 13  3DSPATR(PR)
     A                                      OVRDTA
     A            TY6            3A  B 13 11DSPATR(PR)
     A                                      OVRDTA
     A            PARTNO6       20A  B 13 15DSPATR(PR)
     A                                      OVRDTA
     A            PARTIALKW6    44A  B 13 36DSPATR(PR)
     A                                      OVRDTA
     A            C6DESC1       79A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A            CODE7          7A  B 15  3DSPATR(PR)
     A                                      OVRDTA
     A            TY7            3A  B 15 11DSPATR(PR)
     A                                      OVRDTA
     A            PARTNO7       20A  B 15 15DSPATR(PR)
     A                                      OVRDTA
     A            PARTIALKW7    44A  B 15 36DSPATR(PR)
     A                                      OVRDTA
     A            C7DESC1       79A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  55                                  DSPATR(RI)
     A  55                                  DSPATR(PC)
     A            CODE8          7A  B 17  3DSPATR(PR)
     A                                      OVRDTA
     A            TY8            3A  B 17 11DSPATR(PR)
     A                                      OVRDTA
     A            PARTNO8       20A  B 17 15DSPATR(PR)
     A                                      OVRDTA
     A            PARTIALKW8    44A  B 17 36DSPATR(PR)
     A                                      OVRDTA
     A            C8DESC1       79A  B 18  1DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 19  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            CODE9          7A  B 19  3DSPATR(PR)
     A                                      OVRDTA
     A            TY9            3A  B 19 11DSPATR(PR)
     A                                      OVRDTA
     A            PARTNO9       20A  B 19 15DSPATR(PR)
     A                                      OVRDTA
     A            PARTIALKW9    44A  B 19 36DSPATR(PR)
     A                                      OVRDTA
     A            C9DESC1       79A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCT1     79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCT2     79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INQMENU
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 14'-----------------------------------
     A                                      ---------------------'
     A                                  1 76'CP1-4'
     A                                  2 14'.'
     A                                  2 68'.'
     A                                  3 14'.   S T O R E S   C O D E   I N Q'
     A                                  3 48'U I R Y   M E N U   .'
     A                                  4 14'.'
     A                                  4 68'.'
     A                                  5 14'-----------------------------------
     A                                      ---------------------'
     A                                  8 19'f1 - MATERIAL STATUS BY STORES COD-
     A                                      E'
     A                                 10 19'f2 - INQUIRY BY KEYWORD/MODIFIER'
     A                                 12 19'f8 - INQUIRY BY MANUFACTURER'
     A                                 20 14'PRESS: DESIRED FUNCTION KEY'
     A                                 21 21'"f3" TO EXIT THE STORES CODE INQUI-
     A                                      RY SUBSYSTEM'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-MATERIAL STATUS f2-INQUI-
     A                                      RY BY KWM f8-INQUIRY BY MFR        -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INQMFR
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 74'CP1-4-3'
     A                                  2 18'-----------------------------------
     A                                      -----------'
     A                                  3 18'.'
     A                                  3 31'I N Q U I R Y   B Y'
     A                                  3 62'.'
     A                                  4 18'.'
     A                                  4 62'.'
     A                                  5 18'.'
     A                                  5 29'M A N U F A C T U R E R'
     A                                  5 62'.'
     A                                  6 18'-----------------------------------
     A                                      -----------'
     A                                  9 10'MANUFACTURER'
     A                                  9 37'MANUFACTURER"S PART NUMBER (OPTION-
     A                                      AL)'
     A                                 13  5'SELECTION OPTIONS:'
     A                                 15  5'KEYWORD'
     A                                 15 33'MODIFIER'
     A                                 17  5'MAJOR GROUP'
     A                                 17 23'SUB GROUP'
     A                                 17 40'FIRST DIGIT OF SEQUENCE'
     A                                 19  5'TYPE MANUFACTURER NAME, MANUFACTUR-
     A                                      ER"S PART NUMBER, OR BOTH'
     A                                 20  5'THEN TYPE ONE OR MORE OPTIONAL SEL-
     A                                      ECTIONS IF DESIRED.'
     A                                 21  5'PRESS "ENTER" TO RETRIEVE CODES AN-
     A                                      D THEIR PRIMARY LANGUAGE DESCRIPTIO-
     A                                      NS'
     A                                 22 12'"f1"   TO RETRIEVE CODES AND THEIR'
     A                                 22 47'SECONDARY LANGUAGE DESCRIPTIONS'
     A                                 23 12'"f3"   TO RETURN TO THE INQUIRY ME-
     A                                      NU'
     A            MANUFACTUR    26A  B 10 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            MANPARTNO     20A  B 10 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            XXX            3A  B 10 67DSPATR(PR)
     A                                      OVRDTA
     A            KEYWORD       19A  B 15 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            MODIFIER      30A  B 15 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            MG             2A  B 17 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            SG             2A  B 17 33DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            F              1A  B 17 64DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-SECOND LANGUAGE f2-MAJ G-
     A                                      RP INQUIRY                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INQMFR2
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'MANUFACTURER'
     A                                  1 72'CP1-4-3A'
     A                                  2  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 21  1'FOR MORE INFORMATION ON ANY CODE,'
     A                                 21 35'SELECT IT BY TYPING AN "X" AND PRE-
     A                                      SS "ENTER"'
     A            MANUFACTUR    50A  B  1 15DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  3  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            CODE1          7A  B  3  3DSPATR(PR)
     A                                      OVRDTA
     A            TY1            3A  B  3 11DSPATR(PR)
     A                                      OVRDTA
     A            PARTNO1       20A  B  3 15DSPATR(PR)
     A                                      OVRDTA
     A            PARTIALKWM    44A  B  3 36DSPATR(PR)
     A                                      OVRDTA
     A            C1DESC1       79A  B  4  1DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B  5  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            CODE2          7A  B  5  3DSPATR(PR)
     A                                      OVRDTA
     A            TY2            3A  B  5 11DSPATR(PR)
     A                                      OVRDTA
     A            PARTNO2       20A  B  5 15DSPATR(PR)
     A                                      OVRDTA
     A            PARTIALKW2    44A  B  5 36DSPATR(PR)
     A                                      OVRDTA
     A            C2DESC1       79A  B  6  1DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  7  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            CODE3          7A  B  7  3DSPATR(PR)
     A                                      OVRDTA
     A            TY3            3A  B  7 11DSPATR(PR)
     A                                      OVRDTA
     A            PARTNO3       20A  B  7 15DSPATR(PR)
     A                                      OVRDTA
     A            PARTIALKW3    44A  B  7 36DSPATR(PR)
     A                                      OVRDTA
     A            C3DESC1       79A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B  9  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            CODE4          7A  B  9  3DSPATR(PR)
     A                                      OVRDTA
     A            TY4            3A  B  9 11DSPATR(PR)
     A                                      OVRDTA
     A            PARTNO4       20A  B  9 15DSPATR(PR)
     A                                      OVRDTA
     A            PARTIALKW4    44A  B  9 36DSPATR(PR)
     A                                      OVRDTA
     A            C4DESC1       79A  B 10  1DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 11  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            CODE5          7A  B 11  3DSPATR(PR)
     A                                      OVRDTA
     A            TY5            3A  B 11 11DSPATR(PR)
     A                                      OVRDTA
     A            PARTNO5       20A  B 11 15DSPATR(PR)
     A                                      OVRDTA
     A            PARTIALKW5    44A  B 11 36DSPATR(PR)
     A                                      OVRDTA
     A            C5DESC1       79A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 13  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A            CODE6          7A  B 13  3DSPATR(PR)
     A                                      OVRDTA
     A            TY6            3A  B 13 11DSPATR(PR)
     A                                      OVRDTA
     A            PARTNO6       20A  B 13 15DSPATR(PR)
     A                                      OVRDTA
     A            PARTIALKW6    44A  B 13 36DSPATR(PR)
     A                                      OVRDTA
     A            C6DESC1       79A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A            CODE7          7A  B 15  3DSPATR(PR)
     A                                      OVRDTA
     A            TY7            3A  B 15 11DSPATR(PR)
     A                                      OVRDTA
     A            PARTNO7       20A  B 15 15DSPATR(PR)
     A                                      OVRDTA
     A            PARTIALKW7    44A  B 15 36DSPATR(PR)
     A                                      OVRDTA
     A            C7DESC1       79A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  55                                  DSPATR(RI)
     A  55                                  DSPATR(PC)
     A            CODE8          7A  B 17  3DSPATR(PR)
     A                                      OVRDTA
     A            TY8            3A  B 17 11DSPATR(PR)
     A                                      OVRDTA
     A            PARTNO8       20A  B 17 15DSPATR(PR)
     A                                      OVRDTA
     A            PARTIALKW8    44A  B 17 36DSPATR(PR)
     A                                      OVRDTA
     A            C8DESC1       79A  B 18  1DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 19  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            CODE9          7A  B 19  3DSPATR(PR)
     A                                      OVRDTA
     A            TY9            3A  B 19 11DSPATR(PR)
     A                                      OVRDTA
     A            PARTNO9       20A  B 19 15DSPATR(PR)
     A                                      OVRDTA
     A            PARTIALKW9    44A  B 19 36DSPATR(PR)
     A                                      OVRDTA
     A            C9DESC1       79A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCT1     79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCT2     79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INQMFR3
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'MANUFACTURER'
     A                                  1 73'CP1-4-3'
     A                                  2  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 20  1'FOR MORE INFORMATION ON ANY CODE,'
     A                                 20 35'SELECT IT BY TYPING AN "X" AND PRE-
     A                                      SS "ENTER"'
     A            MANUFACTUR    26A  B  1 15DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  3  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            CODE1          7A  B  3  3DSPATR(PR)
     A                                      OVRDTA
     A            TY1            3A  B  3 11DSPATR(PR)
     A                                      OVRDTA
     A            PARTNO1       20A  B  3 15DSPATR(PR)
     A                                      OVRDTA
     A            PARTIALKWM    44A  B  3 36DSPATR(PR)
     A                                      OVRDTA
     A            C1DESC1       79A  B  4  1DSPATR(PR)
     A                                      OVRDTA
     A            C1DESC2       79A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            C1DESC3       79A  B  6  1DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B  7  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            CODE2          7A  B  7  3DSPATR(PR)
     A                                      OVRDTA
     A            TY2            3A  B  7 11DSPATR(PR)
     A                                      OVRDTA
     A            PARTNO2       20A  B  7 15DSPATR(PR)
     A                                      OVRDTA
     A            PARTIALKW2    44A  B  7 36DSPATR(PR)
     A                                      OVRDTA
     A            C2DESC1       79A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            C2DESC2       79A  B  9  1DSPATR(PR)
     A                                      OVRDTA
     A            C2DESC3       79A  B 10  1DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 11  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            CODE3          7A  B 11  3DSPATR(PR)
     A                                      OVRDTA
     A            TY3            3A  B 11 11DSPATR(PR)
     A                                      OVRDTA
     A            PARTNO3       20A  B 11 15DSPATR(PR)
     A                                      OVRDTA
     A            PARTIALKW3    44A  B 11 36DSPATR(PR)
     A                                      OVRDTA
     A            C3DESC1       79A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            C3DESC2       79A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            C3DESC3       79A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            CODE4          7A  B 15  3DSPATR(PR)
     A                                      OVRDTA
     A            TY4            3A  B 15 11DSPATR(PR)
     A                                      OVRDTA
     A            PARTNO4       20A  B 15 15DSPATR(PR)
     A                                      OVRDTA
     A            PARTIALKW4    44A  B 15 36DSPATR(PR)
     A                                      OVRDTA
     A            C4DESC1       79A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            C4DESC2       79A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            C4DESC3       79A  B 18  1DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCT1     79A  B 21  1DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCT2     79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INQRSA_2
     A*%%TS  SD  19931109  143453  A193138     REL-V2R2M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 17'-----------------------------------
     A                                      -------------'
     A                                  3 17':  A L L   R E C E I V E R S   I N'
     A                                  3 52'Q U I R Y  :'
     A                                  4 17':'
     A                                  4 63':'
     A                                  5 17':'
     A                                  5 63':'
     A                                  6 17'-----------------------------------
     A                                      -------------'
     A                                  8 13'PURCHASE ORDER HAS RECEIVERS NUMBE-
     A                                      RED 001 THROUGH'
     A                                 12  5'1.  TO SEE ALL RECEIVERS: DEPRESS'
     A                                 12 39'ENTER (WITH ZEROES IN THE BOX BELO-
     A                                      W)'
     A                                 13 37'OR'
     A                                 14  5'2.  TO BEGIN WITH A SPECIFIC RECEI-
     A                                      VER, ENTER THE RECEIVER NUMBER IN'
     A                                 15  9'THE BOX BELOW AND DEPRESS ENTER.'
     A            PO             7A  B  5 35DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  5 43DSPATR(PR)
     A                                      OVRDTA
     A            END            3A  B  8 63DSPATR(PR)
     A                                      OVRDTA
     A            RCV            3Y 0B 17 37DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            LIVEHIST      23   B 23 57DSPATR(PR)
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f7-EXIT f3-END PROGRAM     -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INQRSI_3
     A*%%TS  SD  19940919  094816  A193138     REL-V2R3M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 14'R E C E I V I N G   S L I P   I T'
     A                                  1 48'E M   I N Q U I R Y'
     A                                  2 13'-----------------------------------
     A                                      ---------------------'
     A                                  3 23'         SEQUENCE:'
     A                                  3 52'RECEIVERS 001 THROUGH'
     A                                  4  2'ITEM    CORP CODE   ---------  QUA-
     A                                      NTITIES  ---------      ----- DATES-
     A                                       -----'
     A                                  5  2'DESCRIPTION'
     A                                  5 30'DLVR   UM'
     A                                  5 50'STOR'
     A                                  5 61'DLVR      STOR'
     A                                 21  2'* - DENOTES COMPLETED ITEM'
     A                                 21 33'LOT'
     A                                 21 45'TALLY'
     A            PO             7A  B  3  1DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  3  9DSPATR(PR)
     A                                      OVRDTA
     A            RS             3A  B  3 13DSPATR(PR)
     A                                      OVRDTA
     A            NUM            3A  B  3 19DSPATR(PR)
     A                                      OVRDTA
     A            SEQ            6A  B  3 43DSPATR(PR)
     A                                      OVRDTA
     A            END            3A  B  3 74DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           5A  B  7  2DSPATR(PR)
     A                                      OVRDTA
     A            CORPCOD        7A  B  7 10DSPATR(PR)
     A                                      OVRDTA
     A            DLVRQTY       13A  B  7 22DSPATR(PR)
     A                                      OVRDTA
     A            UM             2A  B  7 37DSPATR(PR)
     A                                      OVRDTA
     A            STORQTY       13A  B  7 41DSPATR(PR)
     A                                      OVRDTA
     A            DDATE          8A  B  7 60DSPATR(PR)
     A                                      OVRDTA
     A            SDATE          8A  B  7 70DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE01    79A  B  8  2DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE02    79A  B  9  2DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE03    79A  B 10  2DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE04    79A  B 11  2DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE05    79A  B 12  2DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE06    79A  B 13  2DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE07    79A  B 14  2DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE08    79A  B 15  2DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE09    79A  B 16  2DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE10    79A  B 17  2DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE11    79A  B 18  2DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE12    79A  B 19  2DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE13    79A  B 20  2DSPATR(PR)
     A                                      OVRDTA
     A            LOTN           4A  B 21 37DSPATR(PR)
     A                                      OVRDTA
     A            TALY           4A  B 21 51DSPATR(PR)
     A                                      OVRDTA
     A                                 21 58'CHAT NUMBER:'
     A            CHATNO         6A  B 21 71DSPATR(PR)
     A                                      OVRDTA
     A            HISTLIVE      23A  B 22 58DSPATR(PR)
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-FRT F2-NEXT RCVR F7-EXIT-
     A                                       f8-MORE ITEMS f4-PREV ITEMS F5-COR-
     A                                      RECT F6-PREV RCVR')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INQRSICR
     A*%%TS  SD  19940616  072433  A193138     REL-V2R3M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  3'R E C E I V I N G   S L I P   I T -
     A                                      E M   C O R R E C T I O N   I N Q U-
     A                                       I R Y'
     A                                  2  3'-----------------------------------
     A                                      ------------------------------------
     A                                      ------'
     A                                  3 23'         SEQUENCE:'
     A                                  3 52'RECEIVERS 001 THROUGH'
     A                                  5  1'ITEM    CORP CODE'
     A            PO             7A  B  3  1DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  3  9DSPATR(PR)
     A                                      OVRDTA
     A            RS             3A  B  3 13DSPATR(PR)
     A                                      OVRDTA
     A            NUM            3A  B  3 19DSPATR(PR)
     A                                      OVRDTA
     A            SEQ            6A  B  3 43DSPATR(PR)
     A                                      OVRDTA
     A            END            3A  B  3 74DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4A  B  6  1DSPATR(PR)
     A                                      OVRDTA
     A            CORPCOD        7A  B  6  9DSPATR(PR)
     A                                      OVRDTA
     A                                  8  3'DATE'
     A                                  8 10'CORRECTION EXPLANATION'
     A            CORRDATE1      8A  B  9  1DSPATR(PR)
     A                                      OVRDTA
     A            CORR1A        71A  B  9 10DSPATR(PR)
     A                                      OVRDTA
     A            CORR1B        70A  B 10 10DSPATR(PR)
     A                                      OVRDTA
     A            CORRDATE2      8A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            CORR2A        71A  B 11 10DSPATR(PR)
     A                                      OVRDTA
     A            CORR2B        70A  B 12 10DSPATR(PR)
     A                                      OVRDTA
     A            CORRDATE3      8A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            CORR3A        71A  B 13 10DSPATR(PR)
     A                                      OVRDTA
     A            CORR3B        70A  B 14 10DSPATR(PR)
     A                                      OVRDTA
     A            CORRDATE4      8A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            CORR4A        71A  B 15 10DSPATR(PR)
     A                                      OVRDTA
     A            CORR4B        70A  B 16 10DSPATR(PR)
     A                                      OVRDTA
     A            CORRDATE5      8A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            CORR5A        71A  B 17 10DSPATR(PR)
     A                                      OVRDTA
     A            CORR5B        70A  B 18 10DSPATR(PR)
     A                                      OVRDTA
     A            CORRDATE6      8A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            CORR6A        71A  B 19 10DSPATR(PR)
     A                                      OVRDTA
     A            CORR6B        70A  B 20 10DSPATR(PR)
     A                                      OVRDTA
     A            PAGECORR       1   B 22 33DSPATR(UL)
     A  01                                  DSPATR(RI)
     A                                      OVRDTA
     A                                      OVRATR
     A            HISTLIVE      23A  B 22 57DSPATR(PR)
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-FRT F2-NEXT RCVR F7-EXIT-
     A                                       f8-MORE ITEMS f4-PREV ITEMS F5-RCV-
     A                                       INQ F6-PREV RCVR')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A                                 22  1'M=More, P=Previous Corrections:'
     A          R INQUIRY
     A*%%TS  SD  19961219  090053  A193138     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  9'P. O.   I N Q U I R Y    B Y    C'
     A                                  1 43'O R P O R A T E   C O D E'
     A                                  3  1'CODE:'
     A                                  3 17'ONORDER:'
     A                                  3 40'UM:'
     A                                  3 50'BIN LOC:'
     A                                  5 32'************  QUANTITIES  ********-
     A                                      ** ** DATES **'
     A                                  6  3'PO.....-RLS-RS'
     A                                  6 33'ORDERED     DELIVERED      STORED'
     A                                  6 70'DLVR  STOR'
     A                                 22  1'ENTER "X" NEXT TO PO OR RCVR FOR I-
     A                                      NQUIRY'
     A                                 23  1'PRESS f3 TO EXIT.'
     A                                 23 34'PRESS f6 TO SWITCH TO LIVE/HISTORY-
     A                                       DATABASE'
     A            CODE           7A  B  3  7DSPATR(PR)
     A                                      OVRDTA
     A            ONORDER        8A  B  3 28DSPATR(PR)
     A                                      OVRDTA
     A            UM             2A  B  3 44DSPATR(PR)
     A                                      OVRDTA
     A            BINLOCATIO    12A  B  3 59DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIO    79A  B  4  1DSPATR(PR)
     A                                      OVRDTA
     A            INQ01          1   B  8  1OVRDTA
     A                                      OVRATR
     A N01                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            LINE1         77A  B  8  3DSPATR(PR)
     A                                      OVRDTA
     A            INQ02          1   B  9  1OVRDTA
     A                                      OVRATR
     A N02                                  DSPATR(UL)
     A  02                                  DSPATR(PR)
     A            LINE2         77A  B  9  3DSPATR(PR)
     A                                      OVRDTA
     A            INQ03          1   B 10  1OVRDTA
     A                                      OVRATR
     A N03                                  DSPATR(UL)
     A  03                                  DSPATR(PR)
     A            LINE3         77A  B 10  3DSPATR(PR)
     A                                      OVRDTA
     A            INQ04          1   B 11  1OVRDTA
     A                                      OVRATR
     A N04                                  DSPATR(UL)
     A  04                                  DSPATR(PR)
     A            LINE4         77A  B 11  3DSPATR(PR)
     A                                      OVRDTA
     A            INQ05          1   B 12  1OVRDTA
     A                                      OVRATR
     A N05                                  DSPATR(UL)
     A  05                                  DSPATR(PR)
     A            LINE5         77A  B 12  3DSPATR(PR)
     A                                      OVRDTA
     A            INQ06          1   B 13  1OVRDTA
     A                                      OVRATR
     A N06                                  DSPATR(UL)
     A  06                                  DSPATR(PR)
     A            LINE6         77A  B 13  3DSPATR(PR)
     A                                      OVRDTA
     A            INQ07          1   B 14  1OVRDTA
     A                                      OVRATR
     A N07                                  DSPATR(UL)
     A  07                                  DSPATR(PR)
     A            LINE7         77A  B 14  3DSPATR(PR)
     A                                      OVRDTA
     A            INQ08          1   B 15  1OVRDTA
     A                                      OVRATR
     A N08                                  DSPATR(UL)
     A  08                                  DSPATR(PR)
     A            LINE8         77A  B 15  3DSPATR(PR)
     A                                      OVRDTA
     A            INQ09          1   B 16  1OVRDTA
     A                                      OVRATR
     A N09                                  DSPATR(UL)
     A  09                                  DSPATR(PR)
     A            LINE9         77A  B 16  3DSPATR(PR)
     A                                      OVRDTA
     A            INQ10          1   B 17  1OVRDTA
     A                                      OVRATR
     A N10                                  DSPATR(UL)
     A  10                                  DSPATR(PR)
     A            LINE10        77A  B 17  3DSPATR(PR)
     A                                      OVRDTA
     A            INQ11          1   B 18  1OVRDTA
     A                                      OVRATR
     A N11                                  DSPATR(UL)
     A  11                                  DSPATR(PR)
     A            LINE11        77A  B 18  3DSPATR(PR)
     A                                      OVRDTA
     A            INQ12          1   B 19  1OVRDTA
     A                                      OVRATR
     A N12                                  DSPATR(UL)
     A  12                                  DSPATR(PR)
     A            LINE12        77A  B 19  3DSPATR(PR)
     A                                      OVRDTA
     A            CONTINUATI    79A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            HISTMSG       23A  B 22 50DSPATR(HI)
     A                                      DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f7-NEW CODE f3-EXIT PROGRAM-
     A                                       f6-SWITCH DATABASES               -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A                                  6 19'ITEM'
     A                                  6 24'UM'
     A                                  6  1'X'
     A*  91/03/07  14:25:45    A171523     REL-R03M00  5728-PW1
     A          R INQVEND
     A*%%TS  SD  19980203  162911  A257947     REL-V3R7M0  5716-PW1
     A                                      PUTOVR
     A                                      CF03
     A                                      CF07
     A            TITLE         35A  B  1 21DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTIO    75A  B  3  1DSPATR(PR)
     A                                      OVRDTA
     A                                  4  1'CODE:'
     A            VENDORCOD     10A  B  4 11DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A                                  5  1'NAME:'
     A            NAME          44A  B  5 11DSPATR(PR)
     A                                      OVRDTA
     A                                  6  1'ADDRESS:'
     A            ADDRESS       44A  B  6 11DSPATR(PR)
     A                                      OVRDTA
     A            ADD2          44A  B  7 11DSPATR(PR)
     A                                      OVRDTA
     A            ADD3          44A  B  8 11DSPATR(PR)
     A                                      OVRDTA
     A            ADD4          44A  B  9 11DSPATR(PR)
     A                                      OVRDTA
     A                                  8 65'"X" MEANS THAT'
     A            ADD5          44A  B 10 11DSPATR(PR)
     A                                      OVRDTA
     A                                  9 65'ZIP/POSTAL CODE'
     A            ADD6          44A  B 11 11DSPATR(PR)
     A                                      OVRDTA
     A                                 10 65'WILL BE PRINTED'
     A                                 11 65'BEFORE CITY'
     A                                 12  1'CITY:'
     A            CITY          24A  B 12 11DSPATR(PR)
     A                                      OVRDTA
     A                                 12 36'STATE:'
     A            ST             2A  B 12 44DSPATR(PR)
     A                                      OVRDTA
     A                                 12 48'ZIP:'
     A            ZIPCODE        9A  B 12 54DSPATR(PR)
     A                                      OVRDTA
     A            X              1A  B 12 71DSPATR(PR)
     A                                      OVRDTA
     A                                 13  1'PROVINCE:'
     A            PROV           4A  B 13 11DSPATR(PR)
     A                                      OVRDTA
     A                                 13 17'COUNTRY:'
     A            COUNTRY       18A  B 13 27DSPATR(PR)
     A                                      OVRDTA
     A                                 13 47'CURRENCY CODE:'
     A            CC             2A  B 13 63DSPATR(PR)
     A                                      OVRDTA
     A            CURRENCY      12A  B 13 67DSPATR(PR)
     A                                      OVRDTA
     A                                 14  1'CONTACT:'
     A            CONTACT       34A  B 14 11DSPATR(PR)
     A                                      OVRDTA
     A                                 14 49'FAX:'
     A            FAX           24A  B 14 55DSPATR(PR)
     A                                      OVRDTA
     A                                      CHECK(LC)
     A                                 15  1'NOTE1:'
     A            NOTE1         44A  B 15 11DSPATR(PR)
     A                                      OVRDTA
     A                                 15 61'TELEX:'
     A            TELEX         10A  B 15 69DSPATR(PR)
     A                                      OVRDTA
     A                                 16  1'NOTE2:'
     A            NOTE2         44A  B 16 11DSPATR(PR)
     A                                      OVRDTA
     A                                 16 61'PHONE:'
     A            PHONE         10A  B 16 69DSPATR(PR)
     A                                      OVRDTA
     A                                 17  1'F.O.B.:'
     A            FOB           20A  B 17 10DSPATR(PR)
     A                                      OVRDTA
     A                                 17 33' PAYMENT TERMS:'
     A            TERMS          2A  B 17 50DSPATR(PR)
     A                                      OVRDTA
     A                                 17 56'MINIMUM ORDER:'
     A            MINM           4A  B 17 72DSPATR(PR)
     A                                      OVRDTA
     A                                 18  1'INVOICELESS VENDOR (Y/N):'
     A            INVLESSIND     1A  B 18 27DSPATR(PR)
     A                                      OVRDTA
     A                                 18 36'EDI VENDOR (Y/N):'
     A            E              1A  B 18 54DSPATR(PR)
     A                                      OVRDTA
     A                                 19  1'EDI DOLLAR MAX:'
     A            DOLLM          7A  B 19 17DSPATR(PR)
     A                                      OVRDTA
     A                                 19 36'EDI STANDARD:'
     A            A              1A  B 19 50DSPATR(PR)
     A                                      OVRDTA
     A                                 19 53'(1-EDIFACT  2-ASCX12)'
     A                                 20  1'GOODYEAR CODE:'
     A            GOODYEARCO    17A  B 20 16DSPATR(PR)
     A                                      OVRDTA
     A                                 20 36'TRADING PARTNER ID:'
     A            TRADINGPID    16A  B 20 56DSPATR(PR)
     A                                      OVRDTA
     A                                 21  1'EDI STATUS IND:'
     A            EDISTATIND     1A  B 21 17DSPATR(PR)
     A                                      OVRDTA
     A                                 21 20'(0-NO SEND, 1-SEND AND PRINT, 2-SE-
     A                                      ND ONLY)'
     A                                 22  1'EXCLUDE CODED DESCRIPTION ON RELEA-
     A                                      SES (Y/N):'
     A            EXCODESW       1A  B 22 46DSPATR(PR)
     A                                      OVRDTA
     A                                 23  1'STD. INSTRUCTIONS:'
     A            INSTR1         3A  B 23 20DSPATR(PR)
     A                                      OVRDTA
     A            ITEM1          1A  B 23 24DSPATR(PR)
     A                                      OVRDTA
     A            INSTR2         3A  B 23 27DSPATR(PR)
     A                                      OVRDTA
     A            ITEM2          1A  B 23 31DSPATR(PR)
     A                                      OVRDTA
     A            INSTR3         3A  B 23 34DSPATR(PR)
     A                                      OVRDTA
     A            ITEM3          1A  B 23 38DSPATR(PR)
     A                                      OVRDTA
     A            INSTR4         3A  B 23 41DSPATR(PR)
     A                                      OVRDTA
     A            ITEM4          1A  B 23 45DSPATR(PR)
     A                                      OVRDTA
     A                                 23 48'(B-PRINT BEFORE ITEMS;A-AFTER)'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT f7-CLEAR SCREEN')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R NREQRLSE
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 17'R E Q U I S I T I O N   A P P R O'
     A                                  1 51'V A L'
     A                                  3  1'Type options and hit "enter" to st-
     A                                      art approvals, or hit "f2" to tab'
     A                                  3 69'to req num.'
     A                                  5  2'Sort key  '
     A                                  5 20'1  No sort'
     A                                  5 40'4  Budget number'
     A                                  6 20'2  Req number'
     A                                  6 40'5  Date (most recent first)'
     A                                  7 20'3  Workorder'
     A                                  7 40'6  Date (oldest first)'
     A                                  9  1'Single or multiple item screen (S/-
     A                                      M)?  '
     A                                 11  1'Include at least 1 of the followin-
     A                                      g:'
     A                                 12  4'Unapproved      '
     A                                 12 29'In purchasing'
     A                                 12 58'On PO     '
     A                                 13  1'Include at least 1 of the followin-
     A                                      g:'
     A                                 14  4'Coded storeroom '
     A                                 14 29'Coded non-storeroom '
     A                                 14 58'Non-coded '
     A                                 16  4'Exclude reqs you approved '
     A                                 16 40'Include only "on hold" reqs '
     A                                 18  2'Selection on one of the following:'
     A                                 19  3'Requisition number '
     A                                 19 38'Workorder number '
     A                                 21  3'Corporate code     '
     A                                 21 38'Originator'
     A                                 23  3'Approver'
     A            S              1A  B  5 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            R              1A  B  9 41DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            U              1A  B 12 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            C              1A  B 12 50DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            P              1A  B 12 69DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            T              1A  B 14 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            O              1A  B 14 50DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            N              1A  B 14 69DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            E              1A  B 16 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            H              1A  B 16 69DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            REQUISITIO    12A  B 19 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            WORKORDER     10A  B 19 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            CORPCOD        7A  B 21 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            EMP1           4A  B 21 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            EMP2           4A  B 23 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-HELP f2-TAB TO REQ NUM f-
     A                                      3-EXIT F6-USER INQUIRY F7-CLEAR FOR-
     A                                      M                ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R NREQSCRN1
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 17'R E Q U I S I T I O N   I N Q U I'
     A                                  1 51'R Y'
     A                                  3  1'Type options and hit "enter" to st-
     A                                      art inquiry, or hit "f2" to tab to'
     A                                  3 70'req num.'
     A                                  5  2'Sort key  '
     A                                  5 20'1  No sort'
     A                                  5 40'4  Budget number'
     A                                  6 20'2  Req number'
     A                                  6 40'5  Date (most recent first)'
     A                                  7 20'3  Workorder'
     A                                  7 40'6  Date (oldest first)'
     A                                  9  1'Single or multiple item screen (S/-
     A                                      M)?  '
     A                                 11  1'Include at least 1 of the followin-
     A                                      g:'
     A                                 12  1'Unapproved      '
     A                                 12 26'In purchasing'
     A                                 12 55'On PO     '
     A                                 13  1'Include at least 1 of the followin-
     A                                      g:'
     A                                 14  1'Coded storeroom '
     A                                 14 26'Coded non-storeroom '
     A                                 14 55'Non-coded '
     A                                 16 37'Include only "on hold" reqs '
     A                                 18  2'Selection on one of the following:'
     A                                 19  3'Requisition number '
     A                                 19 38'Workorder number '
     A                                 21  3'Corporate code     '
     A                                 21 38'Originator'
     A                                 23  3'Approver'
     A            S              1A  B  5 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            R              1A  B  9 41DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            U              1A  B 12 18DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            C              1A  B 12 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            P              1A  B 12 66DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            T              1A  B 14 18DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            O              1A  B 14 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            N              1A  B 14 66DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            E              1A  B 16  3DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 16 66DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            REQUISITIO    12A  B 19 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            WORKORDER     10A  B 19 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            CORPCOD        7A  B 21 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            EMP1           4A  B 21 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            EMP2           4A  B 23 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-HELP f2-TAB TO REQ NUM f-
     A                                      3-END PROGRAM f6-USER INQUIRY f7-CL-
     A                                      EAR FORM         ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R PERPASS1
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3'ID: '
     A                                  4  3'Enter your personal PASSWORD:  '
     A                                  8  3'If you have problems or need help,'
     A                                  8 38'please contact'
     A            CC             4A  B  2  8DSPATR(PR)
     A                                      OVRDTA
     A            NAME          16A  B  2 22DSPATR(PR)
     A                                      OVRDTA
     A            PW             6A  B  4 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            IVPMSG        30A  B  4 45DSPATR(PR)
     A                                      OVRDTA
     A            PWMSG         56A  B  6  3DSPATR(PR)
     A                                      OVRDTA
     A            NPW            6A  B  6 62DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            HELP          26A  B  8 53DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R PERPASS2
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3'ID: '
     A                                  4  3'Enter your personal PASSWORD:  '
     A                                  8  3'If you have problems or need help,'
     A                                  8 38'please contact'
     A            CC             4A  B  2  8DSPATR(PR)
     A                                      OVRDTA
     A            NAME          16A  B  2 21DSPATR(PR)
     A                                      OVRDTA
     A            PW             6A  B  4 35DSPATR(PR)
     A                                      OVRDTA
     A            IVPMSG        30A  B  4 45DSPATR(PR)
     A                                      OVRDTA
     A            PWMSG         56A  B  6  3DSPATR(PR)
     A                                      OVRDTA
     A            NPW            6A  B  6 62DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            HELP          26A  B  8 53DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R PERPASS3
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3'ID: '
     A                                  4  3'Enter your personal PASSWORD:  '
     A                                  8  3'If you have problems or need help,'
     A                                  8 38'please contact'
     A            CC             4A  B  2  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            NAME          16A  B  2 21DSPATR(PR)
     A                                      OVRDTA
     A            PW             6A  B  4 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            IVPMSG        30A  B  4 45DSPATR(PR)
     A                                      OVRDTA
     A            PWMSG         56A  B  6  3DSPATR(PR)
     A                                      OVRDTA
     A            NPW            6A  B  6 62DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            HELP          26A  B  8 53DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R REQSCRN1
     A*%%TS  SD  20020806  153607  A257947     REL-V5R1M0  5722-WDS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 17'R E Q U I S I T I O N   I N Q U I'
     A                                  1 51'R Y'
     A                                  3  1'Type options and hit "enter" to st-
     A                                      art inquiry, or hit "f2" to tab to'
     A                                  3 70'req num.'
     A                                  5  2'Sort key  '
     A                                  5 17'1  No sort'
     A                                  5 36'4  Budget number'
     A                                  6 17'2  Req number'
     A                                  6 36'5  Date (most recent first)'
     A                                  7 17'3  Workorder'
     A                                  7 36'6  Date (oldest first)'
     A                                 10  1'Include at least 1 of the followin-
     A                                      g:'
     A                                 11  1'Unapproved      '
     A                                 11 26'In purchasing'
     A                                 11 55'On PO     '
     A                                 12  1'Include at least 1 of the followin-
     A                                      g:'
     A                                 13  1'Coded storeroom '
     A                                 13 26'Coded non-storeroom '
     A                                 13 55'Non-coded '
     A                                 15 37'Include only "on hold" reqs '
     A                                 17  2'Selection on one of the following:'
     A                                 18  3'Requisition number '
     A                                 18 38'Workorder number '
     A                                 20  3'Corporate code     '
     A                                 20 38'Originator'
     A                                 22  3'Approver'
     A                                 22 38'Date'
     A            S              1A  B  5 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            R              1A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A                                      DSPATR(ND)
     A            U              1A  B 11 18DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            C              1A  B 11 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            P              1A  B 11 66DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            T              1A  B 13 18DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            O              1A  B 13 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            N              1A  B 13 66DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            E              1A  B 15  3DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 15 66DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            REQUISITIO    12A  B 18 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            WORKORDER     10A  B 18 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            CORPCOD        7A  B 20 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            EMP1           4A  B 20 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            EMP2           4A  B 22 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            DATE1          2A  B 22 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            DATE2          2A  B 22 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            DATE3          2A  B 22 62DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A                                  8 36'7  Queue Date (most recent first)'
     A          R REQSCRN2
     A*%%TS  SD  20020423  153151  A257947     REL-V5R1M0  5722-WDS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  9'REQUISITION INQUIRY: REQ NUMBER'
     A                                  1 55'DATE'
     A                                  2  1'CORP CODE'
     A                                  2 13'QUANTITY'
     A                                  2 25'UM'
     A                                  2 29'ESTIMATED PRICE'
     A                                  2 46'CURR'
     A  40                                  DSPATR(ND)
     A                                      OVRATR
     A                                  2 52'BUDGET AMOUNT'
     A                                  2 67'BUDGET NUMBER'
     A                                  6  1'DT WANTED CO  PRM CLS DEPT'
     A                                  6 37'STAG ORIG ORIGINATOR NAME  WORKORD-
     A                                      ER    APP'
     A                                  8 19'SUGGESTED VENDOR'
     A                                  8 50'TYPE  MOD?  PATH  APP LEFT'
     A                                 10  1'FIRST 3 LINES OF DESCRIPTION'
     A                                 14  1'REMARKS'
     A                                 17  1'PURCHASE ORDER      ORDERED'
     A                                 17 35'UM   DELIVERED      DATE DLVR   BL-
     A                                      ANKET'
     A                                 20 49'APP STATUS '
     A                                 20 67'TAX CODE'
     A                                 21  1'HELP '
     A                                 21 25'REPRINT '
     A                                 22  1'BUYER:'
     A                                 22 27'ROUTE COMMENTS:'
     A                                 23  1'REQUESTING DEPT:'
     A            REQ           12A  B  1 41DSPATR(PR)
     A                                      OVRDTA
     A            RDATE          8A  B  1 60DSPATR(PR)
     A                                      OVRDTA
     A            CODE           7A  B  3  2DSPATR(PR)
     A                                      OVRDTA
     A            QUANTITY      12Y 4B  3 11EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            UM             2A  B  3 25DSPATR(PR)
     A                                      OVRDTA
     A            ESTIMATPRI    15A  B  3 29DSPATR(PR)
     A                                      OVRDTA
     A            CURRENCY       2A  B  3 47DSPATR(PR)
     A                                      OVRDTA
     A  40                                  DSPATR(ND)
     A                                      OVRATR
     A            BUDGETAMT     12A  B  3 52DSPATR(PR)
     A                                      OVRDTA
     A            BUDGETNUM     14A  B  3 67DSPATR(PR)
     A                                      OVRDTA
     A            ESTIMATPR2    15A  B  4 29DSPATR(PR)
     A                                      OVRDTA
     A  40                                  DSPATR(ND)
     A            CURRENCY2      2A  B  4 47DSPATR(PR)
     A                                      OVRDTA
     A  40                                  DSPATR(ND)
     A                                      OVRATR
     A            CURRNAME      12A  B  4 52DSPATR(PR)
     A                                      OVRDTA
     A  40                                  DSPATR(ND)
     A            WOAMTSFIEL    79A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            NWADLIT        7A  B  6 28DSPATR(PR)
     A                                      OVRDTA
     A            DATEWANT       8A  B  7  1DSPATR(PR)
     A                                      OVRDTA
     A            COM            3A  B  7 11DSPATR(PR)
     A                                      OVRDTA
     A            PRM            3A  B  7 15DSPATR(PR)
     A                                      OVRDTA
     A            CLS            3A  B  7 19DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  7 23DSPATR(PR)
     A                                      OVRDTA
     A            EXP            8A  B  7 28DSPATR(PR)
     A                                      OVRDTA
     A            STAG           4A  B  7 37DSPATR(PR)
     A                                      OVRDTA
     A            ORIG           4A  B  7 42DSPATR(PR)
     A                                      OVRDTA
     A            ORIGINATOR    16A  B  7 47DSPATR(PR)
     A                                      OVRDTA
     A            WORKORDER     12A  B  7 64DSPATR(PR)
     A                                      OVRDTA
     A            Z              1A  B  7 78DSPATR(PR)
     A                                      OVRDTA
     A            ADDTLLIT      15A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            ADDTLINFO     16A  B  9  1DSPATR(PR)
     A                                      OVRDTA
     A            SUGGESTEDV    30A  B  9 19DSPATR(PR)
     A                                      OVRDTA
     A            T              1A  B  9 51DSPATR(PR)
     A                                      OVRDTA
     A            M              1A  B  9 57DSPATR(PR)
     A                                      OVRDTA
     A            PHT            3A  B  9 63DSPATR(PR)
     A                                      OVRDTA
     A            APL            3A  B  9 70DSPATR(PR)
     A                                      OVRDTA
     A            DESC1         79A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC2         79A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC3         79A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            REM1          79A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            REM2          79A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            PO            10A  B 18  3DSPATR(PR)
     A                                      OVRDTA
     A            ORDEREDX      12Y 4B 18 18EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            U2             2A  B 18 35DSPATR(PR)
     A                                      OVRDTA
     A            DELIVERD      12Y 4B 18 39EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            DATEDLVR       8A  B 18 55DSPATR(PR)
     A                                      OVRDTA
     A            BLANKET        7A  B 18 67DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGE1      59A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGE3      24A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B 20 63DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(PC)
     A            TAXCDE         2A  B 20 77DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 21  7DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A            R              1A  B 21 11DSPATR(PR)
     A                                      OVRDTA
     A            FWRD           4A  B 21 13DSPATR(PR)
     A                                      OVRDTA
     A            O              1A  B 21 19DSPATR(PR)
     A                                      OVRDTA
     A            U              1A  B 21 22DSPATR(PR)
     A                                      OVRDTA
     A            P              1A  B 21 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A            BUYER         16A  B 22  8DSPATR(PR)
     A                                      OVRDTA
     A            COMMENT       36A  B 22 43DSPATR(PR)
     A                                      OVRDTA
     A            RQDEPT         6A  B 23 18DSPATR(PR)
     A                                      OVRDTA
     A            COMMENT2      36A  B 23 43DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R REQSCRN3
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                 22 20'f5 - PRINT SCREEN'
     A                                 22 71'f3 - EXIT'
     A            DESCRIPT1     79A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPT2     79A  B  2  1DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPT3     79A  B  3  1DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPT4     79A  B  4  1DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPT5     79A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPT6     79A  B  6  1DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPT7     79A  B  7  1DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPT8     79A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPT9     79A  B  9  1DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPT10    79A  B 10  1DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPT11    79A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPT12    79A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPT13    79A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPT14    79A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPT15    79A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPT16    79A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPT17    79A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPT18    79A  B 18  1DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPT19    79A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPT20    79A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            ENTER         16A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            F6            13A  B 22 40DSPATR(PR)
     A                                      OVRDTA
     A            F7            13A  B 22 55DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R REQSCRN5
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                 22 20'f5 - PRINT SCREEN'
     A                                 22 71'f3 - EXIT'
     A            DESCRIPT1     79A  B  1  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            DESCRIPT2     79A  B  2  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            DESCRIPT3     79A  B  3  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            DESCRIPT4     79A  B  4  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            DESCRIPT5     79A  B  5  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            DESCRIPT6     79A  B  6  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            DESCRIPT7     79A  B  7  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            DESCRIPT8     79A  B  8  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            DESCRIPT9     79A  B  9  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            DESCRIPT10    79A  B 10  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            DESCRIPT11    79A  B 11  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            DESCRIPT12    79A  B 12  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            DESCRIPT13    79A  B 13  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            DESCRIPT14    79A  B 14  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            DESCRIPT15    79A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            DESCRIPT16    79A  B 16  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            DESCRIPT17    79A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            DESCRIPT18    79A  B 18  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            DESCRIPT19    79A  B 19  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            DESCRIPT20    79A  B 20  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            ENTER         16A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            F6            13A  B 22 40DSPATR(PR)
     A                                      OVRDTA
     A            F7            13A  B 22 55DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R RLSEINQ
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  3 18'-----------------------------------
     A                                      -------------'
     A                                  4 18':'
     A                                  4 64':'
     A                                  5 18':      CSIS/MMIS SOFTWARE RELEASE'
     A                                  5 52'INQUIRY     :'
     A                                  6 18':'
     A                                  6 64':'
     A                                  7 18'-----------------------------------
     A                                      -------------'
     A                                 11 10'PLANT:'
     A                                 13 10'Your plant has installed CSIS/MMIS'
     A                                 13 45'release'
     A                                 13 60'on'
     A            PLANTNAME      3A  B 11 18DSPATR(PR)
     A                                      OVRDTA
     A            INSTDATE      50A  B 11 23DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPT3      6A  B 13 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            DESCRIPT4      8A  B 13 63DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R RSORPO_1
     A*%%TS  SD  19950816  084742  A193138     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 11'-----------------------------------
     A                                      --------------------'
     A                                  2 11'|'
     A                                  2 64'|'
     A                                  3 11'|  R E C E I V E R  /  F R E I G H'
     A                                  3 46'T   I N Q U I R Y |'
     A                                  4 11'|'
     A                                  4 64'|'
     A                                  5 11'-----------------------------------
     A                                      --------------------'
     A                                  9 48'OR'
     A N88                                  DSPATR(ND)
     A                                 10 30'PO      RLS RS'
     A                                 10 50'PRAPS NUMBER'
     A N88                                  DSPATR(ND)
     A                                 13  9'1.  ENTER PO AND RELEASE (RLS) TO'
     A                                 13 43'SEE ALL RECEIVING SLIPS'
     A                                 14 37'OR'
     A                                 15  9'2.  ENTER PO, RELEASE (RLS), AND R-
     A                                      ECEIVER (RS) TO BEGIN BROWSING'
     A                                 17  9'3.  DEPRESS f1 OR f2 OR f4'
     A                                 18 37'OR'
     A                                 19  9'4.  DEPRESS f6 TO SWITCH DATABASE -
     A                                      TO LIVE OR HISTORY'
     A            PO             7A  B  9 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            RLS            3Y 0B  9 38DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            RS             3Y 0B  9 42DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            PRAPS          6Y 0B  9 53EDTCDE(Z)
     A N88                                  DSPATR(ND)
     A  88                                  DSPATR(UL)
     A N88                                  DSPATR(PR)
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            LIVEHIST      23A  B 23 57DSPATR(PR)
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RECEIVER f2-FREIGHT f4-R-
     A                                      CVR CORRECTIONS f6-SWITCH DATABASES-
     A                                       f7-CLEAR f3-END')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R TALLYINQ
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 16'-----------------------------------
     A                                      ----------'
     A                                  2 16':  RECEIVING SLIP INQUIRY BY TALLY'
     A                                  2 51'NUMBER  :'
     A                                  3 16'-----------------------------------
     A                                      ----------'
     A                                  4  9'RECEIVING SLIPS ARE SHOWN IN ORDER'
     A                                  4 44'OF THE MOST RECENT FIRST.'
     A                                  6 26'ENTER TALLY NUMBER:'
     A                                  8  5'"X"'
     A                                  8 15'RECEIVER      CORPORATE CODE'
     A                                  9  5'---    --------------   -----------
     A                                      -----'
     A                                 10 53'ENTER "X" BY THE RECEIVER'
     A                                 11 53'YOU WISH TO REVIEW OR PRESS'
     A                                 12 53'F4 TO REVIEW ALL RECEIVERS'
     A                                 21  1'If F4-SHOW ALL is pressed, when in'
     A                                 21 36'the inquiry item screen you may pr-
     A                                      ess "enter'
     A                                 22  1'or any function key to see the nex-
     A                                      t receiver.  Press F7 or F3 to retu-
     A                                      rn early'
     A                                 23  1'to this screen.'
     A            TALY           4A  B  6 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            A              1A  B 10  6DSPATR(PR)
     A                                      OVRDTA
     A            PO1           14A  B 10 12DSPATR(PR)
     A                                      OVRDTA
     A            CODE1          7A  B 10 32DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B 11  6DSPATR(PR)
     A                                      OVRDTA
     A            PO2           14A  B 11 12DSPATR(PR)
     A                                      OVRDTA
     A            CODE2          7A  B 11 32DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 12  6DSPATR(PR)
     A                                      OVRDTA
     A            PO3           14A  B 12 12DSPATR(PR)
     A                                      OVRDTA
     A            CODE3          7A  B 12 32DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 13  6DSPATR(PR)
     A                                      OVRDTA
     A            PO4           14A  B 13 12DSPATR(PR)
     A                                      OVRDTA
     A            CODE4          7A  B 13 32DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 14  6DSPATR(PR)
     A                                      OVRDTA
     A            PO5           14A  B 14 12DSPATR(PR)
     A                                      OVRDTA
     A            CODE5          7A  B 14 32DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 15  6DSPATR(PR)
     A                                      OVRDTA
     A            PO6           14A  B 15 12DSPATR(PR)
     A                                      OVRDTA
     A            CODE6          7A  B 15 32DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 16  6DSPATR(PR)
     A                                      OVRDTA
     A            PO7           14A  B 16 12DSPATR(PR)
     A                                      OVRDTA
     A            CODE7          7A  B 16 32DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 17  6DSPATR(PR)
     A                                      OVRDTA
     A            PO8           14A  B 17 12DSPATR(PR)
     A                                      OVRDTA
     A            CODE8          7A  B 17 32DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 18  6DSPATR(PR)
     A                                      OVRDTA
     A            PO9           14A  B 18 12DSPATR(PR)
     A                                      OVRDTA
     A            CODE9          7A  B 18 32DSPATR(PR)
     A                                      OVRDTA
     A            J              1A  B 19  6DSPATR(PR)
     A                                      OVRDTA
     A            PO10          14A  B 19 12DSPATR(PR)
     A                                      OVRDTA
     A            CODE10         7A  B 19 32DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R TALLYINQ2
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 16'-----------------------------------
     A                                      ----------'
     A                                  2 16':  RECEIVING SLIP INQUIRY BY TALLY'
     A                                  2 51'NUMBER  :'
     A                                  3 16'-----------------------------------
     A                                      ----------'
     A                                  4  9'RECEIVING SLIPS ARE SHOWN IN ORDER'
     A                                  4 44'OF THE MOST RECENT FIRST.'
     A                                  6 26'ENTER TALLY NUMBER:'
     A                                  8  5'"X"'
     A                                  8 15'RECEIVER      CORPORATE CODE'
     A                                  9  5'---    --------------   -----------
     A                                      -----'
     A                                 10 53'ENTER "X" BY THE RECEIVER'
     A                                 11 53'YOU WISH TO REVIEW OR PRESS'
     A                                 12 53'F4 TO REVIEW ALL RECEIVERS'
     A                                 21  1'If F4-SHOW ALL is pressed, when in'
     A                                 21 36'the inquiry item screen you may pr-
     A                                      ess "enter'
     A                                 22  1'or any function key to see the nex-
     A                                      t receiver.  Press F7 or F3 to retu-
     A                                      rn early'
     A                                 23  1'to this screen.'
     A            TALY           4A  B  6 47DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B 10  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            PO1           14A  B 10 12DSPATR(PR)
     A                                      OVRDTA
     A            CODE1          7A  B 10 32DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B 11  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            PO2           14A  B 11 12DSPATR(PR)
     A                                      OVRDTA
     A            CODE2          7A  B 11 32DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 12  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            PO3           14A  B 12 12DSPATR(PR)
     A                                      OVRDTA
     A            CODE3          7A  B 12 32DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 13  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            PO4           14A  B 13 12DSPATR(PR)
     A                                      OVRDTA
     A            CODE4          7A  B 13 32DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 14  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            PO5           14A  B 14 12DSPATR(PR)
     A                                      OVRDTA
     A            CODE5          7A  B 14 32DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 15  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            PO6           14A  B 15 12DSPATR(PR)
     A                                      OVRDTA
     A            CODE6          7A  B 15 32DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 16  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            PO7           14A  B 16 12DSPATR(PR)
     A                                      OVRDTA
     A            CODE7          7A  B 16 32DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 17  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            PO8           14A  B 17 12DSPATR(PR)
     A                                      OVRDTA
     A            CODE8          7A  B 17 32DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 18  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            PO9           14A  B 18 12DSPATR(PR)
     A                                      OVRDTA
     A            CODE9          7A  B 18 32DSPATR(PR)
     A                                      OVRDTA
     A            J              1A  B 19  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            PO10          14A  B 19 12DSPATR(PR)
     A                                      OVRDTA
     A            CODE10         7A  B 19 32DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f2-NEXT f8-PREV f4-SHOW ALL-
     A                                       f7-NEW TALLY f3-EXIT              -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VENBYSC
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 21'-----------------------------------
     A                                      -'
     A                                  3 21'|'
     A                                  3 55'|'
     A                                  4 21'|   V E N D O R   I N Q U I R Y'
     A                                  4 55'|'
     A                                  5 21'|'
     A                                  5 55'|'
     A                                  6 21'-----------------------------------
     A                                      -'
     A                                  9 19'CORPORATE CODE'
     A                                  9 48'VENDOR CODE'
     A                                 10 18'----------------'
     A                                 10 47'-------------'
     A                                 11 39'OR'
     A                                 14  5'TYPE A CODE AND PRESS "ENTER" KEY'
     A                                 16  5'NOTE:  The f4 key on the inquiry s-
     A                                      creens will delete all vendors tied'
     A                                 17 12'to a corporate code that are not o-
     A                                      n a quote if corporate code is'
     A                                 18 12'selected here.  If vendor code is'
     A                                 18 46'selected here, the f4 key will'
     A                                 19 12'delete all corporate codes tied to'
     A                                 19 47'the vendor that are not on a'
     A                                 20 12'quote.  These entries are created'
     A                                 20 46'whenever a purchase order is'
     A                                 21 12'created.'
     A            CORPCOD        7A  B 11 22DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            VENDORCODE    10A  B 11 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT PROGRAM            -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VENBYSC2
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 23'-----------------------------------
     A                                      ----'
     A                                  2 23':  VENDOR INQUIRY BY CORPORATE COD-
     A                                      E  :'
     A                                  3 23'-----------------------------------
     A                                      ----'
     A                                  4  1'CORPORATE CODE:'
     A                                  6 65'EST'
     A                                  6 76'MIN'
     A                                  7  3'VENDOR'
     A                                  7 34'PRICE UM  EXP DATE LT1 LT2 LT3 LT'
     A                                  7 69'TERMS  ORD'
     A                                  8  3'------'
     A                                  8 34'----- --  -------- --- --- --- ---'
     A                                  8 69'-----  ---'
     A            CORPCODE       8A  B  4 18DSPATR(PR)
     A                                      OVRDTA
     A            DESC1         50A  B  4 30DSPATR(PR)
     A                                      OVRDTA
     A            DESC2         79A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-MORE DATA f2-PREVIOUS DA-
     A                                      TA f7-NEW CODE f3-END PROGRAM      -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VENBYSC3
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                 12  1'"L" - DENOTES THE LAST VENDOR THAT'
     A                                 12 36'BUSINESS WAS TRANSACTED WITH FOR T-
     A                                      HIS CODE'
     A                                 13  1'"P" - DENOTES PREFERRED VENDOR'
     A                                 14  1'F4  - DELETE NON-QUOTE ITEMS TIED'
     A                                 14 35'TO CORPORATE CODE FOR ALL VENDORS'
     A            L              2A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            VENCODE       10A  B  1  5DSPATR(PR)
     A                                      OVRDTA
     A            PRICE1        16A  B  1 23DSPATR(PR)
     A                                      OVRDTA
     A            P1             2A  B  1 40DSPATR(PR)
     A                                      OVRDTA
     A            UM            24A  B  1 44DSPATR(PR)
     A                                      OVRDTA
     A            LT1A           2A  B  1 71DSPATR(PR)
     A                                      OVRDTA
     A            LT3A           5A  B  1 74DSPATR(PR)
     A                                      OVRDTA
     A            T1            44A  B  2  4DSPATR(PR)
     A                                      OVRDTA
     A            VENNAME       10A  B  2 50DSPATR(PR)
     A                                      OVRDTA
     A            SURCHARGEA    16A  B  2 63DSPATR(PR)
     A                                      OVRDTA
     A            ADDR1         44A  B  3  4DSPATR(PR)
     A                                      OVRDTA
     A            ADDR2         44A  B  4  4DSPATR(PR)
     A                                      OVRDTA
     A            DISCOUNT      11A  B  4 50DSPATR(PR)
     A                                      OVRDTA
     A            DCPCNT         7A  B  4 63DSPATR(PR)
     A                                      OVRDTA
     A            ADDR3         44A  B  5  4DSPATR(PR)
     A                                      OVRDTA
     A            CON1           8A  B  6  4DSPATR(PR)
     A                                      OVRDTA
     A            CONTACT       34A  B  6 14DSPATR(PR)
     A                                      OVRDTA
     A            PHONE1         8A  B  6 50DSPATR(PR)
     A                                      OVRDTA
     A            PHONE         12A  B  6 63DSPATR(PR)
     A                                      OVRDTA
     A            NOTE1          8A  B  7  4DSPATR(PR)
     A                                      OVRDTA
     A            NOTE1A        38A  B  7 14DSPATR(PR)
     A                                      OVRDTA
     A            NOTE2A        38A  B  8 14DSPATR(PR)
     A                                      OVRDTA
     A            PRICEBREAK    13A  B  9  1DSPATR(PR)
     A                                      OVRDTA
     A            LOWQTY1       12A  B  9 16DSPATR(PR)
     A                                      OVRDTA
     A            HIGHQTY1      12A  B  9 35DSPATR(PR)
     A                                      OVRDTA
     A            U1             2A  B  9 50DSPATR(PR)
     A                                      OVRDTA
     A            PRICEB1       16A  B  9 61DSPATR(PR)
     A                                      OVRDTA
     A            LOW            3A  B 10 10DSPATR(PR)
     A                                      OVRDTA
     A            LOWQTY2       12A  B 10 16DSPATR(PR)
     A                                      OVRDTA
     A            HIGH           4A  B 10 29DSPATR(PR)
     A                                      OVRDTA
     A            HIGHQTY2      12A  B 10 35DSPATR(PR)
     A                                      OVRDTA
     A            U2             2A  B 10 50DSPATR(PR)
     A                                      OVRDTA
     A            PRICE          5A  B 10 54DSPATR(PR)
     A                                      OVRDTA
     A            PRICEB2       16A  B 10 61DSPATR(PR)
     A                                      OVRDTA
     A            LOWQTY3       12A  B 11 16DSPATR(PR)
     A                                      OVRDTA
     A            HIGHQTY3      12A  B 11 35DSPATR(PR)
     A                                      OVRDTA
     A            U3             2A  B 11 50DSPATR(PR)
     A                                      OVRDTA
     A            PRICEB3       16A  B 11 61DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-NEXT VENDOR f2-PREVIOUS -
     A                                      VENDOR f4-DELETE PO DATA f6-"L" VEN-
     A                                      DOR f7-NEW CODE  ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VENBYSC4
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 24'----------------------------------'
     A                                  2 24': VENDOR INQUIRY BY VENDOR CODE  :'
     A                                  3 24'----------------------------------'
     A                                  4  1'VENDOR:'
     A                                  6 57'MINIMUM ORDER:'
     A                                  8  1'(f4 - DELETE ALL NON-QUOTE CODES T-
     A                                      IED TO THIS VENDOR)'
     A                                  9  1'CODE'
     A                                  9 29'PRICE  UM  EXP-DATE   LT1  LT2  LT-
     A                                      3  LT4 TERMS FOB'
     A                                 10  1'----'
     A                                 10 29'-----  --  --------   ---  ---  ---
     A                                      - ---- ----- ---'
     A            VENNAME       10A  B  4 11DSPATR(PR)
     A                                      OVRDTA
     A            CONTACT1      44A  B  5 11DSPATR(PR)
     A                                      OVRDTA
     A            PHONE          8A  B  6  1DSPATR(PR)
     A                                      OVRDTA
     A            PHONE1        34A  B  6 11DSPATR(PR)
     A                                      OVRDTA
     A            UM             6A  B  6 73DSPATR(PR)
     A                                      OVRDTA
     A            LT1A           8A  B  7  1DSPATR(PR)
     A                                      OVRDTA
     A            LT3A          12A  B  7 11DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-NEXT VENDOR f2-PREVIOUS -
     A                                      VENDOR f4-DELETE PO DATA f6-"L" VEN-
     A                                      DOR f7-NEW CODE  ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VENBYSC5
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A            CORPCODE       8A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            PRICE         16A  B  1 18DSPATR(PR)
     A                                      OVRDTA
     A            UM             2A  B  1 36DSPATR(PR)
     A                                      OVRDTA
     A            EDATE          8A  B  1 40DSPATR(PR)
     A                                      OVRDTA
     A            LT1            4A  B  1 50DSPATR(PR)
     A                                      OVRDTA
     A            LT2            4A  B  1 55DSPATR(PR)
     A                                      OVRDTA
     A            LT3            4A  B  1 60DSPATR(PR)
     A                                      OVRDTA
     A            LT4            4A  B  1 65DSPATR(PR)
     A                                      OVRDTA
     A            TM             2A  B  1 71DSPATR(PR)
     A                                      OVRDTA
     A            FO             2A  B  1 76DSPATR(PR)
     A                                      OVRDTA
     A            DESC1         79A  B  2  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC2         79A  B  3  1DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B  4  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-MORE CODES f2-PREVIOUS C-
     A                                      ODES f4-DELETE PO DATA f7-NEW CODE -
     A                                      f3-END           ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VENBYSC6
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A            COMMANDLN1    79A  B 24  1DFTVAL('  ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VPOBYVEN
     A*%%TS  SD  19961219  124714  A193138     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  3  1'MQ5'
     A                                  3 17'P O   I N Q U I R Y   B Y   V E N'
     A                                  3 51'D O R   C O D E'
     A                                  4 17'**********************************-
     A                                      ***************'
     A                                  7 14'ENTER THE VENDOR CODE AND PRESS "E-
     A                                      NTER"'
     A                                  8 21'ENTER BUYER CODE OR LEAVE BLANK'
     A                                 10 38'OR'
     A                                 12  8'ENTER THE VENDOR CODE AND PRESS "F-
     A                                      2" TO LIST MOST RECENT PO FIRST  '
     A                                 14 38'OR'
     A                                 16  7'ENTER THE VENDOR CODE AND PRESS "F-
     A                                      6" TO SEARCH THE HISTORY DATABASE'
     A                                 21 24'f1 - VENDOR HELP   f3 - EXIT'
     A            ABCDEFG        7A  B  7 55DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            HIJ            3A  B  7 63DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            BUYERCDE       4   B  8 55DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R EDIVEND
     A*%%TS  SD  19980615  143746  A257947     REL-V4R2M0  5769-PW1
     A                                      PUTOVR
     A                                  1 23'E D I   V E N D O R   O P T I O N -
     A                                      S'
     A                                  3  5'VENDOR CODE:'
     A            VENDCODE      10A  B  3 19DSPATR(PR)
     A                                  4  5'VENDOR NAME:'
     A            VENDNAME      44A  B  4 19DSPATR(PR)
     A                                  6  5'IF ALL PURCHASE ORDERS ARE TO BE S-
     A                                      ENT AS NEW ORDERS, PRESS ENTER;'
     A                                  7  5'OTHERWISE, SELECT EDI OPTIONS FOR -
     A                                      THIS VENDOR BY ENTERING "X" NEXT'
     A                                  8  5'TO THE OPTION(S).'
     A            NEW            1A  B 10 21DSPATR(UL)
     A                                      OVRDTA
     A                                      DSPATR(PR)
     A                                 10 25'00  NEW PURCHASE ORDER'
     A            CHANGE         1A  B 12 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES(' ' 'X')
     A  10                                  DSPATR(PR)
     A                                 12 25'04  CHANGE PURCHASE ORDER'
     A            REPAIR         1A  B 14 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES(' ' 'X')
     A  10                                  DSPATR(PR)
     A                                 14 25'RR  REPAIR PURCHASE ORDER'
     A            CONFIRM        1A  B 16 21DSPATR(UL)
     A                                      OVRDTA
     A                                      VALUES(' ' 'X')
     A                                      DSPATR(PR)
     A                                      DSPATR(ND)
     A                                 16 25'06  CONFIRM PURCHASE ORDER'
     A                                      DSPATR(ND)
     A            FOLLOWUP       1A  B 18 21DSPATR(UL)
     A                                      OVRDTA
     A                                      VALUES(' ' 'X')
     A                                      DSPATR(PR)
     A                                      DSPATR(ND)
     A                                 18 25'45  FOLLOW-UP PURCHASE ORDER'
     A                                      DSPATR(ND)
     A                                 24  5'ENTER-PROCESS'
     A  99        MESSAGELIN    79   M      OVRDTA
