     A*%%TS  SD  19961031  130518  A193138     REL-V3R6M0  5716-PW1
     A*            07:18:43    T881S28     VDECOM.HPTO38.CME
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A  98                                  INVITE
     A          R ADD
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 16'P O   I N S T R U C T I O N   A D'
     A                                  1 50'D I T I O N'
     A                                  3  1'INSTRUCTION NUMBER'
     A                                  3 37'SUBJECT CODE'
     A                                  5  6'PO INSTRUCTION'
     A                                  5 37'*STOP HERE IF EXPANDED PRINT'
     A                                 11  1'IF ADDITIONAL LINES ARE NEEDED, KE-
     A                                      Y "X" AND PRESS "ENTER"'
     A                                 13  1'ENTER "E" FOR EXPANDED PRINT, "C"'
     A                                 13 35'FOR COMPRESSED PRINT'
     A                                 14  1'(DEFAULT IS REGULAR SIZED PRINT)'
     A                                 18  1'ENTER THE INSTRUCTION NUMBER THAT'
     A                                 18 35'WILL REFERENCE THIS INSTRUCTION AN-
     A                                      D THE'
     A                                 19  1'INSTRUCTION ITSELF.  THEN DEPRESS'
     A                                 19 35'"ENTER".  DEPRESS "F3" TO EXIT WIT-
     A                                      H NO'
     A                                 20  1'PROCESSING PERFORMED.'
     A            NUM            3A  B  3 20DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            SUB            3A  B  3 50DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            FIRST1        36A  B  6  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            LAST1         36A  B  6 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            FIRST2        36A  B  7  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            LAST2         36A  B  7 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            FIRST3        36A  B  8  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            LAST3         36A  B  8 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            FIRST4        36A  B  9  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            LAST4         36A  B  9 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            X              1A  B 11 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            P              1A  B 13 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-HELP SUB CODE f3-EXIT   -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R DELETE
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 19'P O   I N S T R U C T I O N  D E L'
     A                                  1 54'E T E'
     A                                  4  8'ENTER THE INSTRUCTION NUMBER TO DE-
     A                                      LETE AND DEPRESS "ENTER"'
     A                                 20  8'DEPRESS "f3" TO END DELETE'
     A            NUM            3A  B  4 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HELP01
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 21'P  O     I  N  S  T  R  U  C  T  I'
     A                                  2 57'O  N'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 26'H  E  L  P    S  C  R  E  E  N'
     A                                  4 73'1/3    '
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  7  1':'
     A                                  7 24'ALL  -  ALL DOCUMENTS'
     A                                  8  1':'
     A                                  8 24'BOL  -  BILL OF LADING NOTE'
     A                                  9  1':'
     A                                  9 24'CHG  -  CHANGE'
     A                                 10  1':'
     A                                 10 24'CUS  -  CUSTOMS DECLARATION'
     A                                 11  1':'
     A                                 11 24'DEL  -  DELIVERY'
     A                                 12  1':'
     A                                 12 24'GEN  -  ENTIRE TRANSACTION SET'
     A                                 13  1':'
     A                                 13 24'INS  -  INSURANCE'
     A                                 14  1':'
     A                                 14 24'INT  -  GENERAL ORDER INSURANCE'
     A                                 15  1':'
     A                                 15 24'INV  -  INVOICE INSTRUCTION'
     A                                 16  1':'
     A                                 16 24'LAB  -  LABELLING INSTRUCTIONS'
     A                                 17  1':'
     A                                 17 24'LIN  -  LINE ITEM'
     A                                 18  1':'
     A                                 18 24'LOI  -  LOADING INSTRUCTIONS'
     A                                 19  1':'
     A                                 19 24'MFG  -  MANUFACTURING INSTRUCTIONS'
     A                                 20  1':'
     A                                 20 24'ORI  -  ORDER INSTRUCTIONS'
     A                                 21  1':'
     A                                 21 24'OTH  -  OTHER INSTRUCTIONS'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HELP02
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 21'P  O     I  N  S  T  R  U  C  T  I'
     A                                  2 57'O  N'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 26'H  E  L  P    S  C  R  E  E  N'
     A                                  4 73'2/3    '
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  7  1':'
     A                                  7 24'PAY  -  PAYABLES'
     A                                  8  1':'
     A                                  8 24'PKG  -  PACKAGING INSTRUCTIONS'
     A                                  9  1':'
     A                                  9 24'PMT  -  PAYMENT'
     A                                 10  1':'
     A                                 10 24'PRI  -  PRIORITY'
     A                                 11  1':'
     A                                 11 24'PUR  -  PURCHASING'
     A                                 12  1':'
     A                                 12 24'QUT  -  QUOTATION INSTRUCTION'
     A                                 13  1':'
     A                                 13 24'REV  -  RECEIVABLES'
     A                                 14  1':'
     A                                 14 24'SPH  -  SPECIAL HANDLING'
     A                                 15  1':'
     A                                 15 24'TAF  -  TARIFF ABBREVIATION'
     A                                 16  1':'
     A                                 16 24'TCF  -  TARIFF COMMODITY FOOTNOTES'
     A                                 17  1':'
     A                                 17 24'TIL  -  TARIFF INDEX'
     A                                 18  1':'
     A                                 18 24'TLF  -  TARIFF RULE'
     A                                 19  1':'
     A                                 19 24'TRA  -  TRANSPORTATION'
     A                                 20  1':'
     A                                 20 24'TRF  -  TARIFF RATE FOOTNOTES'
     A                                 21  1':'
     A                                 21 24'TSF  -  TARIFF SECTION FOOTNOTES'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HELP03
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 21'P  O     I  N  S  T  R  U  C  T  I'
     A                                  2 57'O  N'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 26'H  E  L  P    S  C  R  E  E  N'
     A                                  4 73'3/3    '
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  7  1':'
     A                                  7 24'WHI  -  WAREHOUSE INSTRUCTION'
     A                                  8  1':'
     A                                  8 24'WRP  -  WRAPPING INSTRUCTIONS'
     A                                  9  1':'
     A                                  9 24'ZZZ  -  MUTUALLY DEFINED'
     A                                 10  1':'
     A                                 11  1':'
     A                                 12  1':'
     A                                 13  1':'
     A                                 14  1':'
     A                                 15  1':'
     A                                 16  1':'
     A                                 17  1':'
     A                                 18  1':'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HELP1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 21'P  O     I  N  S  T  R  U  C  T  I'
     A                                  2 57'O  N'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 26'H  E  L  P    S  C  R  E  E  N'
     A                                  4 73'1/10   '
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  7  1':'
     A                                  7 21'11  -  PARTLY TO BE BILLED (AAR AC-
     A                                      COUNTING RULE 11)'
     A                                  8  1':'
     A                                  8 21'AC  -  AIR CARGO COMPANY'
     A                                  9  1':'
     A                                  9 21'AD  -  PARTY TO BE ADVISED(WRITTEN'
     A                                  9 56'ORDERS)'
     A                                 10  1':'
     A                                 10 21'AG  -  AGENT'
     A                                 11  1':'
     A                                 11 21'AK  -  PARTLY TO WHOM ACKNOWLEDGEM-
     A                                      ENT SHOULD BE SENT'
     A                                 12  1':'
     A                                 12 21'AL  -  ALLOTMENT CUSTOMER'
     A                                 13  1':'
     A                                 13 21'AO  -  ACCOUNT OF'
     A                                 14  1':'
     A                                 15  1':'
     A                                 15 21'BF  -  BILLED FROM'
     A                                 16  1':'
     A                                 16 21'BG  -  BUYING GROUP'
     A                                 17  1':'
     A                                 17 21'BK  -  BANK'
     A                                 18  1':'
     A                                 18 21'BL  -  PARTY TO RECEIVE BILL OF LA-
     A                                      DING'
     A                                 19  1':'
     A                                 19 21'BN  -  BENEFICIAL OWNER'
     A                                 20  1':'
     A                                 20 21'BO  -  BROKER OR SALES OFFICE'
     A                                 21  1':'
     A                                 21 21'BS  -  BILL AND SHIP TO'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HELP10
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 21'P  O     I  N  S  T  R  U  C  T  I'
     A                                  2 57'O  N'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 26'H  E  L  P    S  C  R  E  E  N'
     A                                  4 72'10/10   '
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  6 20'CODE    DEFINITION'
     A                                  7  1':'
     A                                  7 21'TC  -  TOOL SOURCE'
     A                                  8  1':'
     A                                  8 21'TF  -  TANK FARM'
     A                                  9  1':'
     A                                  9 21'TO  -  MESSAGE TO'
     A                                 10  1':'
     A                                 10 21'TR  -  TERMINAL'
     A                                 11  1':'
     A                                 11 21'TS  -  PARTY TO RECEIVE CERTIFIED'
     A                                 11 55'TEST RESULTS'
     A                                 12  1':'
     A                                 12 21'TT  -  TRANSFER TO'
     A                                 13  1':'
     A                                 14  1':'
     A                                 14 21'UC  -  ULTIMATE CONSIGNEE'
     A                                 15  1':'
     A                                 15 21'UP  -  UNLOADING PARTY'
     A                                 16  1':'
     A                                 17  1':'
     A                                 17 21'VN  -  VENDOR'
     A                                 18  1':'
     A                                 19  1':'
     A                                 19 21'WF  -  TANK FARM OWNER'
     A                                 20  1':'
     A                                 20 21'WH  -  WAREHOUSE'
     A                                 21  1':'
     A                                 21 21'ZZ  -  MUTUALLY DEFINED'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HELP2
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 21'P  O     I  N  S  T  R  U  C  T  I'
     A                                  2 57'O  N'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 26'H  E  L  P    S  C  R  E  E  N'
     A                                  4 73'2/10   '
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  6 20'CODE    DEFINITION'
     A                                  7  1':'
     A                                  7 21'BT  -  PARTY TO BE BILLED FOR OTHE-
     A                                      R THAN FREIGHT (BILL TO) '
     A                                  8  1':'
     A                                  8 21'BW  -  BORROWER'
     A                                  9  1':'
     A                                  9 21'BY  -  BUYING PARTY (PURCHASER)'
     A                                 10  1':'
     A                                 11  1':'
     A                                 11 21'C1  -  IN CARE OF PARTY NO. 1'
     A                                 12  1':'
     A                                 12 21'C2  -  IN CARE OF PARTY NO. 2'
     A                                 13  1':'
     A                                 13 21'CA  -  CARRIER'
     A                                 14  1':'
     A                                 14 21'CB  -  CUSTOMS BROKER'
     A                                 15  1':'
     A                                 15 21'CC  -  CLAIMENT'
     A                                 16  1':'
     A                                 16 21'CD  -  CONSIGNEE (TO RECEIVE SMALL'
     A                                 16 56'PARCELS AND MAIL)'
     A                                 17  1':'
     A                                 17 21'CE  -  CONSIGNEE (TO RECEIVE LARGE'
     A                                 17 56'PARCELS AND MAIL)'
     A                                 18  1':'
     A                                 18 21'CF  -  SUBSIDARY / DIVISION'
     A                                 19  1':'
     A                                 19 21'CI  -  CONSIGNOR'
     A                                 20  1':'
     A                                 20 21'CL  -  CONTAINER LOCATION'
     A                                 21  1':'
     A                                 21 21'CM  -  CUSTOMS'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HELP3
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 21'P  O     I  N  S  T  R  U  C  T  I'
     A                                  2 57'O  N'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 26'H  E  L  P    S  C  R  E  E  N'
     A                                  4 73'3/10   '
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  6 20'CODE    DEFINITION'
     A                                  7  1':'
     A                                  7 21'CN  -  CONSIGNEE'
     A                                  8  1':'
     A                                  8 21'CO  -  CORPORATE OFFICE'
     A                                  9  1':'
     A                                  9 21'CP  -  PARTY TO RECEIVE CERT. OF C-
     A                                      OMPLIANCE'
     A                                 10  1':'
     A                                 10 21'CR  -  CONTAINER RETURN COMPANY'
     A                                 11  1':'
     A                                 11 21'CS  -  CONSOLIDATOR'
     A                                 12  1':'
     A                                 12 21'CV  -  CONVERTOR'
     A                                 13  1':'
     A                                 14  1':'
     A                                 14 21'DB  -  DISTRIBUTOR BRANCH'
     A                                 15  1':'
     A                                 15 21'DC  -  DESTINATION CARRIER'
     A                                 16  1':'
     A                                 16 21'DE  -  DEPOSITOR'
     A                                 17  1':'
     A                                 17 21'DL  -  DEALER'
     A                                 18  1':'
     A                                 18 21'DP  -  PARTY TO PROVIDE DISCOUNT'
     A                                 19  1':'
     A                                 19 21'DS  -  DISTRIBUTOR'
     A                                 20  1':'
     A                                 21  1':'
     A                                 21 21'EC  -  EXCHANGER'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HELP4
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 21'P  O     I  N  S  T  R  U  C  T  I'
     A                                  2 57'O  N'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 26'H  E  L  P    S  C  R  E  E  N'
     A                                  4 73'4/10   '
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  6 20'CODE    DEFINITION'
     A                                  7  1':'
     A                                  7 21'EE  -  LOCATION OF GOODS FOR CUSTO-
     A                                      MS EXAMINATION'
     A                                  8  1':'
     A                                  8 28'BEFORE CLEARANCE'
     A                                  9  1':'
     A                                  9 21'EM  -  PARTY TO RECEIVE ELECTRONIC'
     A                                  9 56'MEMO OF INVOICE'
     A                                 10  1':'
     A                                 10 21'EN  -  END USER'
     A                                 11  1':'
     A                                 11 21'EP  -  ELIGIBLE PARTY TO THE RATE'
     A                                 12  1':'
     A                                 12 21'EX  -  EXPORTER'
     A                                 13  1':'
     A                                 14  1':'
     A                                 14 21'FH  -  PARTY TO RECEIVE LIMITATION-
     A                                      S OF HEAVY'
     A                                 15  1':'
     A                                 15 28'ELEMENTS REPORT'
     A                                 16  1':'
     A                                 16 21'FR  -  MESSAGE FROM'
     A                                 17  1':'
     A                                 17 21'FW  -  FORWARDER'
     A                                 18  1':'
     A                                 19  1':'
     A                                 19 21'IA  -  INSTALLED AT'
     A                                 20  1':'
     A                                 20 21'IC  -  INTERMEDIATE CONSIGNEE'
     A                                 21  1':'
     A                                 21 21'II  -  ISSUER OF INVOICE'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HELP5
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 21'P  O     I  N  S  T  R  U  C  T  I'
     A                                  2 57'O  N'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 26'H  E  L  P    S  C  R  E  E  N'
     A                                  4 73'5/10   '
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  6 20'CODE    DEFINITION'
     A                                  7  1':'
     A                                  7 21'IK  -  INTERMEDIATE CARRIER'
     A                                  8  1':'
     A                                  8 21'IM  -  IMPORTER'
     A                                  9  1':'
     A                                  9 21'IN  -  INSURER'
     A                                 10  1':'
     A                                 10 21'IS  -  PARTY TO RECEIVE CERTIFIED'
     A                                 10 55'INSPECTION REPORT'
     A                                 11  1':'
     A                                 11 21'IT  -  INSTALLATION ON SITE'
     A                                 12  1':'
     A                                 13  1':'
     A                                 13 21'LN  -  LENDER'
     A                                 14  1':'
     A                                 14 21'LP  -  LOADING PARTY'
     A                                 15  1':'
     A                                 16  1':'
     A                                 16 21'MA  -  PARTY TO WHOM ITEM IS ULTIM-
     A                                      ATELY INTENDED'
     A                                 17  1':'
     A                                 17 21'MC  -  MOTOR CARRIER'
     A                                 18  1':'
     A                                 18 21'MF  -  MANUFACTURER OF GOODS'
     A                                 19  1':'
     A                                 19 21'MI  -  PLANNING SCHEDULE / MATERIA-
     A                                      L RELEASE ISSUER'
     A                                 20  1':'
     A                                 20 21'MP  -  MANUFACTURING PLANT'
     A                                 21  1':'
     A                                 21 21'MQ  -  METERING LOCATION'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HELP6
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 21'P  O     I  N  S  T  R  U  C  T  I'
     A                                  2 57'O  N'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 26'H  E  L  P    S  C  R  E  E  N'
     A                                  4 73'6/10   '
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  6 20'CODE    DEFINITION'
     A                                  7  1':'
     A                                  7 21'N1  -  NOTIFY PARTY NO. 1'
     A                                  8  1':'
     A                                  8 21'N2  -  NOTIFY PARTY NO. 2'
     A                                  9  1':'
     A                                 10  1':'
     A                                 10 21'OB  -  ORDERED BY'
     A                                 11  1':'
     A                                 11 21'OC  -  ORIGIN CARRIER'
     A                                 12  1':'
     A                                 12 21'OI  -  OUTSIDE INSPECTION AGENCY'
     A                                 13  1':'
     A                                 13 21'OO  -  ORDER OF(SHIPPERS ORDERS) -'
     A                                 13 56'(TRANSPORTATION)'
     A                                 14  1':'
     A                                 14 21'OP  -  OPERATOR OF PROPERTY OR UNI-
     A                                      T'
     A                                 15  1':'
     A                                 15 21'OT  -  OUTSIDE TEST AGENCY'
     A                                 16  1':'
     A                                 16 21'OV  -  OWNER OF VESSEL'
     A                                 17  1':'
     A                                 17 21'OW  -  OWNER OF PROPERTY OR UNIT'
     A                                 18  1':'
     A                                 19  1':'
     A                                 19 21'PA  -  PARTY TO RECEIVE INSPECTION'
     A                                 19 56'REPORT'
     A                                 20  1':'
     A                                 20 21'PB  -  PAYING BANK'
     A                                 21  1':'
     A                                 21 21'PC  -  PARTY TO RECEIVE CERT.OF CO-
     A                                      NFORMANCE (C.A.A.)'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HELP7
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 21'P  O     I  N  S  T  R  U  C  T  I'
     A                                  2 57'O  N'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 26'H  E  L  P    S  C  R  E  E  N'
     A                                  4 73'7/10   '
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  6 20'CODE    DEFINITION'
     A                                  7  1':'
     A                                  7 21'PD  -  PURCHASER"S DEPARTMENT BUYE-
     A                                      R'
     A                                  8  1':'
     A                                  8 21'PE  -  PAYEE'
     A                                  9  1':'
     A                                  9 21'PF  -  PARTY TO RECEIVE FREIGHT BI-
     A                                      LL'
     A                                 10  1':'
     A                                 10 21'PG  -  PRIME CONTRACTOR'
     A                                 11  1':'
     A                                 11 21'PH  -  PRINTER'
     A                                 12  1':'
     A                                 12 21'PI  -  PUBLISHER'
     A                                 13  1':'
     A                                 13 21'PJ  -  PARTY TO RECEIVE CORRESPOND-
     A                                      ENCE'
     A                                 14  1':'
     A                                 14 21'PK  -  PARTY TO RECEIVE COPY'
     A                                 15  1':'
     A                                 15 21'PM  -  PARTY TO RECEIVE PAPER MEMO'
     A                                 15 56'OF INVOICE'
     A                                 16  1':'
     A                                 16 21'PN  -  PARTY TO RECEIVE SHIPPING N-
     A                                      OTICE'
     A                                 17  1':'
     A                                 17 21'PP  -  PROPERTY'
     A                                 18  1':'
     A                                 18 21'PR  -  PAYER'
     A                                 19  1':'
     A                                 19 21'PT  -  PARTY TO RECEIVE TEST REPOR-
     A                                      T'
     A                                 20  1':'
     A                                 20 21'PU  -  PARTY AT PICKUP LOCATION'
     A                                 21  1':'
     A                                 21 21'PV  -  PARTY PERFORMING CERTIFICAT-
     A                                      ION'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HELP8
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 21'P  O     I  N  S  T  R  U  C  T  I'
     A                                  2 57'O  N'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 26'H  E  L  P    S  C  R  E  E  N'
     A                                  4 73'8/10   '
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  6 20'CODE    DEFINITION'
     A                                  7  1':'
     A                                  7 21'RB  -  RECEIVING BANK'
     A                                  8  1':'
     A                                  8 21'RC  -  RECEIVING LOCATION'
     A                                  9  1':'
     A                                  9 21'RE  -  PARTY TO RECEIVE COMMMERCIA-
     A                                      L INVOICE REMITTANCE     '
     A                                 10  1':'
     A                                 10 21'RF  -  REFINERY'
     A                                 11  1':'
     A                                 11 21'RL  -  REPORTING LOCATION'
     A                                 12  1':'
     A                                 12 21'RM  -  PARTY THAT REMITS PAYMENT'
     A                                 13  1':'
     A                                 13 21'RP  -  RECEIVING POINT FOR CUSTOME-
     A                                      R SAMPLES'
     A                                 14  1':'
     A                                 14 21'RQ  -  RESALE CUSTOMER'
     A                                 15  1':'
     A                                 15 21'RR  -  RAILROAD'
     A                                 16  1':'
     A                                 16 21'RS  -  RECEIVING FACILITY SCHEDULE-
     A                                      R'
     A                                 17  1':'
     A                                 18  1':'
     A                                 18 21'SA  -  SALVAGE CARRIER'
     A                                 19  1':'
     A                                 19 21'SB  -  STORAGE AREA'
     A                                 20  1':'
     A                                 20 21'SC  -  STORAGE CLASS'
     A                                 21  1':'
     A                                 21 21'SD  -  SOLD TO AND SHIP TO'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HELP9
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 21'P  O     I  N  S  T  R  U  C  T  I'
     A                                  2 57'O  N'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 26'H  E  L  P    S  C  R  E  E  N'
     A                                  4 73'9/10   '
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  6 20'CODE    DEFINITION'
     A                                  7  1':'
     A                                  7 21'SE  -  SELLING PARTY'
     A                                  8  1':'
     A                                  8 21'SF  -  SHIP FROM'
     A                                  9  1':'
     A                                  9 21'SG  -  STORE GROUP'
     A                                 10  1':'
     A                                 10 21'SH  -  SHIPPER'
     A                                 11  1':'
     A                                 11 21'SI  -  SHIPPING SCHEDULE ISSUER'
     A                                 12  1':'
     A                                 12 21'SM  -  PARTY TO RECEIVE SHIPPING M-
     A                                      ANIFEST'
     A                                 13  1':'
     A                                 13 21'SN  -  STORE'
     A                                 14  1':'
     A                                 14 21'SO  -  SOLD TO IF DIFFERENT FROM B-
     A                                      ILL TO'
     A                                 15  1':'
     A                                 15 21'SP  -  PARTY FILLING SHIPPER"S ORD-
     A                                      ER'
     A                                 16  1':'
     A                                 16 21'SR  -  SAMPLES TO BE RETURNED TO'
     A                                 17  1':'
     A                                 17 21'SS  -  STEAMSHIP COMPANY'
     A                                 18  1':'
     A                                 18 21'ST  -  SHIP TO'
     A                                 19  1':'
     A                                 19 21'SU  -  SUPPLIER/MANUFACTURER'
     A                                 20  1':'
     A                                 20 21'SW  -  SEALING COMPANY'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INQUIRE
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 19'P O   I N S T R U C TI O N   I N Q'
     A                                  1 54'U I R Y'
     A                                  4  3'-----------------------  INSTRUCTI-
     A                                      ON'
     A                                  4 44'-------------------------------'
     A                                 22  3'DEPRESS "f7" TO SUBMIT NEXT INSTRU-
     A                                      CTION NUMBER; "f3" TO END INQUIRY'
     A            PRINT         16A  B  3  3DSPATR(PR)
     A                                      OVRDTA
     A            NUM            3A  B  4 40DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTIO    72A  B  6  3DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTI2    72A  B  7  3DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTI3    72A  B  8  3DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTI4    72A  B  9  3DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTI5    72A  B 10  3DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTI6    72A  B 11  3DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTI7    72A  B 12  3DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTI8    72A  B 13  3DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTI9    72A  B 14  3DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTIA    72A  B 15  3DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTIB    72A  B 16  3DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTIC    72A  B 17  3DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTID    72A  B 18  3DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTIE    72A  B 19  3DSPATR(PR)
     A                                      OVRDTA
     A            CONTINUE      72A  B 21  3DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R MAININQ
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 17'P O   I N S T R U C T I O N   I N'
     A                                  1 51'Q U I R Y'
     A                                  4 13'ENTER THE INSTRUCTION NUMBER AND P-
     A                                      RESS "ENTER"'
     A            NUM            3A  B  4 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R MAINMENU
     A*%%TS  SD  19961031  130518  A193138     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 16'P U R C H A S E   O R D E R   S T'
     A                                  1 50'A N D A R D'
     A                                  3 26'I N S T R U C T I O N S'
     A                                  7 21'"F1" KEY--INQUIRE PO INSTRUCTIONS'
     A                                  9 21'"F2" KEY--ADD     PO INSTRUCTIONS'
     A                                 11 21'"F8" KEY--MODIFY  PO INSTRUCTIONS'
     A                                 13 21'"F4" KEY--DELETE  PO INSTRUCTIONS'
     A                                 15 21'"F5"'
     A                                 15 26'KEY--RECEIVING INSTRUCTIONS MENU'
     A                                 17 21'"F3" KEY--END PROGRAM'
     A                                 19 15'PRESS APPROPRIATE KEY TO DO DESIRE-
     A                                      D FUNCTION'
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R MODIFY
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 14'P O   I N S T R U C T I O N   M O'
     A                                  1 48'D I F I C A T I O N'
     A                                  3 14'INSTRUCTION NUMBER'
     A                                  3 44'SUBJECT CODE'
     A                                  8  6'PO INSTRUCTION'
     A                                  8 37'*STOP HERE IF EXPANDED PRINT'
     A                                 14  1'IF ADDITIONAL LINES ARE NEEDED, KE-
     A                                      Y "X" AND PRESS "ENTER"'
     A            NUM            3A  B  3 34DSPATR(PR)
     A                                      OVRDTA
     A            SUB            3A  B  3 58DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13
     AO 97 96                               DSPATR(PC)
     A            PRINT         16A  B  6  1DSPATR(PR)
     A                                      OVRDTA
     A            FIRST1        36A  B  9  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            LAST1         36A  B  9 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            FIRST2        36A  B 10  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            LASTT2        36A  B 10 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            FIRST3        36A  B 11  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            LAST3         36A  B 11 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            FIRST4        36A  B 12  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            LAST4         36A  B 12 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            X              1A  B 14 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-HELP SUB CODE f3-EXIT   -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R MODIFYNUM
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 14'P O   I N S T R U C T I O N   M O'
     A                                  1 48'D I F I C A T I O N'
     A                                  5  1'ENTER INSTRUCTION NUMBER AND PRESS'
     A                                  5 36'"ENTER"'
     A                                 21  2'DEPRESS "f3" TO END MODIFY'
     A            NUM            3A  B  5 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R NUM
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  1'FORMSPEC  VERSION B.05.04'
     A                                  2 54'WED, MAY 22, ---1,  7:18 A'
     A                                  3  1'FORMS FILE: VDECOM.HPTO38.CME'
     A                                  3 74'PAGE 28'
     A                                  5  1'Form: ADD'
     A                                  6  4'Repeat Option: N'
     A                                  8  4'Next Form Option: C'
     A                                  9  4'Next Form: $HEAD'
     A                                 10  4'Reproduced from:'
     A                                 13  1'Comments:  SCREEN TO ADD INSTRUCTI-
     A                                      ONS'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-HELP SUB CODE f3-EXIT   -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R DELETE2
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 19'P O   I N S T R U C T I O N  D E L'
     A                                  1 54'E T E'
     A                                  4  8'ENTER THE INSTRUCTION NUMBER TO DE-
     A                                      LETE AND DEPRESS "ENTER"'
     A                                 20  8'DEPRESS "f3" TO END DELETE'
     A            NUM            3A  B  4 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HELP012
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 21'P  O     I  N  S  T  R  U  C  T  I'
     A                                  2 57'O  N'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 26'H  E  L  P    S  C  R  E  E  N'
     A                                  4 73'1/3    '
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  7  1':'
     A                                  7 24'ALL  -  ALL DOCUMENTS'
     A                                  8  1':'
     A                                  8 24'BOL  -  BILL OF LADING NOTE'
     A                                  9  1':'
     A                                  9 24'CHG  -  CHANGE'
     A                                 10  1':'
     A                                 10 24'CUS  -  CUSTOMS DECLARATION'
     A                                 11  1':'
     A                                 11 24'DEL  -  DELIVERY'
     A                                 12  1':'
     A                                 12 24'GEN  -  ENTIRE TRANSACTION SET'
     A                                 13  1':'
     A                                 13 24'INS  -  INSURANCE'
     A                                 14  1':'
     A                                 14 24'INT  -  GENERAL ORDER INSURANCE'
     A                                 15  1':'
     A                                 15 24'INV  -  INVOICE INSTRUCTION'
     A                                 16  1':'
     A                                 16 24'LAB  -  LABELLING INSTRUCTIONS'
     A                                 17  1':'
     A                                 17 24'LIN  -  LINE ITEM'
     A                                 18  1':'
     A                                 18 24'LOI  -  LOADING INSTRUCTIONS'
     A                                 19  1':'
     A                                 19 24'MFG  -  MANUFACTURING INSTRUCTIONS'
     A                                 20  1':'
     A                                 20 24'ORI  -  ORDER INSTRUCTIONS'
     A                                 21  1':'
     A                                 21 24'OTH  -  OTHER INSTRUCTIONS'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
