     A*  89/02/20  08:24:21    T881S03     REL-R01M02  5728-PW1
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A                                      CA03(03 'END PROGRAM')
     A          R FDISPSAV
     A                                      PUTOVR
     A                                      CF01
     A                                  1 30'SAVED WORK ORDERS'
     A            LINE1         79A  O  3  1OVRDTA
     A            LINE2         79A  O  4  1OVRDTA
     A            LINE3         79A  O  5  1OVRDTA
     A            LINE4         79A  O  6  1OVRDTA
     A            LINE5         79A  O  7  1OVRDTA
     A            LINE6         79A  O  8  1OVRDTA
     A            LINE7         79A  O  9  1OVRDTA
     A            LINE8         79A  O 10  1OVRDTA
     A            LINE9         79A  O 11  1OVRDTA
     A            LINEA         79A  O 12  1OVRDTA
     A            LINEB         79A  O 13  1OVRDTA
     A            LINEC         79A  O 14  1OVRDTA
     A            LINED         79A  O 15  1OVRDTA
     A            LINEE         79A  O 16  1OVRDTA
     A            LINEF         79A  O 17  1OVRDTA
     A            COMMANDLN1    79A  O 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
