     A* Free Form Menu: ZDOC
     A*%%TS  SD  19941207  101520  A229282     REL-V2R3M0  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT(*LIBL/QSYSPRT)
     A          R ZDOC
     A*%%TS  SD  19931227  142336  A229282     REL-V2R2M0  5738-PW1
     A                                      DSPMOD(*DS3)
     A                                      LOCK
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A                                      ALWROL
     A                                      CF03
     A                                      HELP
     A                                      HOME
     A                                      HLPRTN
     A                                  1  2'ZDOC'
     A                                      COLOR(BLU)
     A                                  1 22'CSIS/MMIS Online Documentation Sys-
     A                                      tem'
     A                                      DSPATR(HI)
     A* CMDPROMPT  Do not delete this DDS spec.
     A                                021  2'Selection or command              -
     A                                          '
     A                                  1 71DATE
     A                                      EDTCDE(Y)
     A                                  2 71TIME
     A                                  5  9'1)  Create/Maintain Documents  (AS-
     A                                      /400 Office Vision)'
     A                                  7  9'2)  Document Description List     -
     A                                        '
     A                                 11  9'4)  Sub-System Selection Maintenan-
     A                                      ce'
     A                                 13  9'5)  Online Documentation System Se-
     A                                      tup/Maintenance'
     A                                 19  2'F3-Exit'
     A                                 19 69'F12-Cancel'
     A                                  9  9'3)  Sub-System Maintenance'
     A                                 15  9'6)'
     A                                 15 13'View'
     A                                 15 18'Online'
     A                                 15 25'Documentation'
     A                                 15 39'System'
