     A*  89/04/14  11:04:11    T881S03     REL-R01M02  5728-PW1
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A                                      CA03(03 'END PROGRAM')
     A          R VDRAWADD
     A                                      PUTOVR
     A                                      CF01
     A                                  2  7'-----------------------------------
     A                                      -----------------------------'
     A                                  3  7':  I N I T I A T E   D R A W I N G'
     A                                  3 44'F I L E   E N T R I E S  :'
     A                                  4  7'-----------------------------------
     A                                      -----------------------------'
     A                                  7  7'Drawing Number:'
     A                                  7 48'Drawing Revision:'
     A                                  9  7'Description:'
     A                                 11  7'Drawing Code:'
     A                                 11 53'Vendor Code:'
     A                                 13  7'Equipment:   Number:'
     A                                 13 38'Type:'
     A                                 13 55'Subsystem:'
     A                                 15  7'Zone:'
     A                                 15 29'Department:'
     A                                 15 56'Building:'
     A                                 17  7'Initiation Date:'
     A                                 17 47'Revision Date:'
     A                                 19  7'Key/Part List:'
     A                                 19 44'Drawing Location:'
     A                                 22 10'ENTER DATA AND PRESS "ENTER" KEY O-
     A                                      R PRESS F3 TO EXIT SCREEN'
     A            DNUM          16A  B  7 24DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            DREV           4A  B  7 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            DESC          50A  B  9 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            DCODE          8A  B 11 22DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            S              1A  B 11 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            VCOD           4A  B 11 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            DEQPNO         6A  B 13 29DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            DEQPTY         8A  B 13 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            DSUBS          4A  B 13 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            DZONE          4A  B 15 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            DDEPT          4A  B 15 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            DBLDG          4A  B 15 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            I1             2A  B 17 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            I2             2A  B 17 28DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            I3             2A  B 17 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            R1             2A  B 17 63DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            R2             2A  B 17 66DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            R3             2A  B 17 69DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            KPLIST         8A  B 19 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            DLOC           8A  B 19 63DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            MSGLIN1       79A  B 23  1OVRDTA
     A            COMMANDLN1    79A  O 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R VDRAWDAT
     A                                      PUTOVR
     A                                  7  5'* * *'
     A                                  7 37'D A T E   S E L E C T I O N     *'
     A                                  7 71'* *'
     A                                 11  7'FROM STARTING DATE'
     A                                 11 35'UNTIIL ENDING DATE'
     A                                 11 63'INCLUSIVE'
     A                                 21 12'ENTER DATES (MONTH - DAY - YEAR) A-
     A                                      ND PRESS "ENTER" KEY'
     A            DATE          20A  B  7 15DSPATR(PR)
     A                                      OVRDTA
     A            M1             2A  B 11 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            D1             2A  B 11 29DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            Y1             2A  B 11 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            M2             2A  B 11 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            D2             2A  B 11 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            Y2             2A  B 11 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            COMMANDLN1    79A  O 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R VDRAWDEL
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF05
     A                                  1  9'-----------------------------------
     A                                      -------------------------'
     A                                  2  9':  D E L E T E   D R A W I N G   F'
     A                                  2 44'I L E   E N T R I E S  :'
     A                                  3  9'-----------------------------------
     A                                      -------------------------'
     A                                  6  7'Drawing Number:'
     A                                  6 48'Drawing Revision:'
     A                                  8  7'Description:'
     A                                 10  7'Drawing Code:'
     A                                 10 53'Vendor Code:'
     A                                 12  7'Equipment:   Number:'
     A                                 12 38'Type:'
     A                                 12 55'Subsystem:'
     A                                 14  7'Zone:'
     A                                 14 29'Department:'
     A                                 14 56'Building:'
     A                                 16  7'Initiation Date:'
     A                                 16 47'Revision Date:'
     A                                 18  7'Key/Part List:'
     A                                 18 44'Drawing Location:'
     A                                 21 18'Enter drawing number and press "EN-
     A                                      TER" key'
     A                                 22  8'Then press "f5" key to view each d-
     A                                      rawing with the same number.'
     A            DNUM          16A  B  6 24DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            DREV           4A  B  6 67DSPATR(PR)
     A                                      OVRDTA
     A            DESC          50A  B  8 21DSPATR(PR)
     A                                      OVRDTA
     A            DCODE          8A  B 10 22DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B 10 31DSPATR(PR)
     A                                      OVRDTA
     A            VCOD           4A  B 10 67DSPATR(PR)
     A                                      OVRDTA
     A            DEQPNU         6A  B 12 29DSPATR(PR)
     A                                      OVRDTA
     A            DTYPNU         8A  B 12 45DSPATR(PR)
     A                                      OVRDTA
     A            DSUBNU         4A  B 12 67DSPATR(PR)
     A                                      OVRDTA
     A            DZONNU         4A  B 14 14DSPATR(PR)
     A                                      OVRDTA
     A            DDEPTU         4A  B 14 42DSPATR(PR)
     A                                      OVRDTA
     A            DBLDGU         4A  B 14 67DSPATR(PR)
     A                                      OVRDTA
     A            DI1U           2A  B 16 25DSPATR(PR)
     A                                      OVRDTA
     A            DI2U           2A  B 16 28DSPATR(PR)
     A                                      OVRDTA
     A            DI3U           2A  B 16 31DSPATR(PR)
     A                                      OVRDTA
     A            DR1U           2A  B 16 63DSPATR(PR)
     A                                      OVRDTA
     A            DR2U           2A  B 16 66DSPATR(PR)
     A                                      OVRDTA
     A            DR3U           2A  B 16 69DSPATR(PR)
     A                                      OVRDTA
     A            KPLISTU        8A  B 18 23DSPATR(PR)
     A                                      OVRDTA
     A            LOCU           8A  B 18 63DSPATR(PR)
     A                                      OVRDTA
     A            MSGL1         79A  O 23  1OVRDTA
     A            COMMANDLN1    79A  O 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R VDRAWALL
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                  2 16'-----------------------------------
     A                                      ------------'
     A                                  3 16':  D I S P L A Y   D R A W I N G'
     A                                  3 51'D A T A   :'
     A                                  4 16'-----------------------------------
     A                                      ------------'
     A                                  7  7'Drawing Number:'
     A                                  7 48'Drawing Revision:'
     A                                  9  7'Description:'
     A                                 11  7'Drawing Code:'
     A                                 11 53'Vendor Code:'
     A                                 13  7'Equipment:   Number:'
     A                                 13 38'Type:'
     A                                 13 55'Subsystem:'
     A                                 15  7'Zone:'
     A                                 15 29'Department:'
     A                                 15 56'Building:'
     A                                 17  7'Initiation Date:'
     A                                 17 47'Revision Date:'
     A                                 19  7'Key/Part List:'
     A                                 19 44'Drawing Location:'
     A                                 22 24'PRESS "ENTER" KEY TO CONTINUE'
     A            DNUM          16A  B  7 24DSPATR(PR)
     A                                      OVRDTA
     A            DREV           4A  B  7 67DSPATR(PR)
     A                                      OVRDTA
     A            DESC          50A  B  9 21DSPATR(PR)
     A                                      OVRDTA
     A            DCODE          8A  B 11 22DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B 11 31DSPATR(PR)
     A                                      OVRDTA
     A            VCOD           4A  B 11 67DSPATR(PR)
     A                                      OVRDTA
     A            EQPNUM         6A  B 13 29DSPATR(PR)
     A                                      OVRDTA
     A            DTYPEV         8A  B 13 45DSPATR(PR)
     A                                      OVRDTA
     A            DSUBSV         4A  B 13 67DSPATR(PR)
     A                                      OVRDTA
     A            DZONEV         4A  B 15 14DSPATR(PR)
     A                                      OVRDTA
     A            DDEPTV         4A  B 15 42DSPATR(PR)
     A                                      OVRDTA
     A            DBLDGV         4A  B 15 67DSPATR(PR)
     A                                      OVRDTA
     A            DI1V           2A  B 17 25DSPATR(PR)
     A                                      OVRDTA
     A            DI2V           2A  B 17 28DSPATR(PR)
     A                                      OVRDTA
     A            DI3V           2A  B 17 31DSPATR(PR)
     A                                      OVRDTA
     A            DR1V           2A  B 17 63DSPATR(PR)
     A                                      OVRDTA
     A            DR2V           2A  B 17 66DSPATR(PR)
     A                                      OVRDTA
     A            DR3V           2A  B 17 69DSPATR(PR)
     A                                      OVRDTA
     A            KPLISTV        8A  B 19 23DSPATR(PR)
     A                                      OVRDTA
     A            LOCV           8A  B 19 63DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R VDRAWDNO
     A                                      PUTOVR
     A                                  1 20'D R A W I N G   F I L E   D I S P'
     A                                  1 54'L A Y'
     A                                  2 18'-----------------------------------
     A                                      ---------'
     A                                  3  4'DRAWING NUMBER:  REV: CODE:    DES-
     A                                      CRIPTION:'
     A                                  5  1'A'
     A                                  7  1'B'
     A                                  9  1'C'
     A                                 11  1'D'
     A                                 13  1'E'
     A                                 15  1'F'
     A                                 17  1'G'
     A                                 19  1'H'
     A                                 21  3'Enter letter of specific Drawing t-
     A                                      o view full data'
     A                                 21 56'Then press "ENTER" key.'
     A                                 22 26'Otherwise press F3 to exit'
     A            N1A           16A  B  5  4DSPATR(PR)
     A                                      OVRDTA
     A            R1A            4A  B  5 21DSPATR(PR)
     A                                      OVRDTA
     A            C1A            8A  B  5 26DSPATR(PR)
     A                                      OVRDTA
     A            D1A           45A  B  5 35DSPATR(PR)
     A                                      OVRDTA
     A            N2B           16A  B  7  4DSPATR(PR)
     A                                      OVRDTA
     A            R2B            4A  B  7 21DSPATR(PR)
     A                                      OVRDTA
     A            C2B            8A  B  7 26DSPATR(PR)
     A                                      OVRDTA
     A            D2B           45A  B  7 35DSPATR(PR)
     A                                      OVRDTA
     A            N3C           16A  B  9  4DSPATR(PR)
     A                                      OVRDTA
     A            R3C            4A  B  9 21DSPATR(PR)
     A                                      OVRDTA
     A            C3C            8A  B  9 26DSPATR(PR)
     A                                      OVRDTA
     A            D3C           45A  B  9 35DSPATR(PR)
     A                                      OVRDTA
     A            N4D           16A  B 11  4DSPATR(PR)
     A                                      OVRDTA
     A            R4D            4A  B 11 21DSPATR(PR)
     A                                      OVRDTA
     A            C4D            8A  B 11 26DSPATR(PR)
     A                                      OVRDTA
     A            D4D           45A  B 11 35DSPATR(PR)
     A                                      OVRDTA
     A            N5E           16A  B 13  4DSPATR(PR)
     A                                      OVRDTA
     A            R5E            4A  B 13 21DSPATR(PR)
     A                                      OVRDTA
     A            C5E            8A  B 13 26DSPATR(PR)
     A                                      OVRDTA
     A            D5E           45A  B 13 35DSPATR(PR)
     A                                      OVRDTA
     A            N6F           16A  B 15  4DSPATR(PR)
     A                                      OVRDTA
     A            R6F            4A  B 15 21DSPATR(PR)
     A                                      OVRDTA
     A            C6F            8A  B 15 26DSPATR(PR)
     A                                      OVRDTA
     A            D6F           45A  B 15 35DSPATR(PR)
     A                                      OVRDTA
     A            N7G           16A  B 17  4DSPATR(PR)
     A                                      OVRDTA
     A            R7G            4A  B 17 21DSPATR(PR)
     A                                      OVRDTA
     A            C7G            8A  B 17 26DSPATR(PR)
     A                                      OVRDTA
     A            D7H           45A  B 17 35DSPATR(PR)
     A                                      OVRDTA
     A            N8H           16A  B 19  4DSPATR(PR)
     A                                      OVRDTA
     A            R8H            4A  B 19 21DSPATR(PR)
     A                                      OVRDTA
     A            C8H            8A  B 19 26DSPATR(PR)
     A                                      OVRDTA
     A            D8H           45A  B 19 35DSPATR(PR)
     A                                      OVRDTA
     A            LH             1A  B 21 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            COMMANDLN1    79A  O 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R VDRAWEXC
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                  2  4'-----------------------------------
     A                                      ------------------------------------
     A                                      ----'
     A                                  3  4':  D R A W I N G   F I L E   M A I'
     A                                  3 39'N T E N A N C E   F U N C T I O N'
     A                                  3 73'S  :'
     A                                  4  4'-----------------------------------
     A                                      ------------------------------------
     A                                      ----'
     A                                  6 12'PRESS:'
     A                                  7 20'f1    Initiate Drawing File Entrie-
     A                                      s'
     A                                  9 20'f2    Update Drawing File Entries'
     A                                 11 20'f4    Delete Drawing File Entries'
     A                                 13 20'f5    Display Drawing File Entries'
     A                                 21 20'f3    Return to Menu'
     A            COMMANDLN1    79A  O 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R VDRAWSEL
     A                                      PUTOVR
     A                                      CF01
     A                                  1 15'-----------------------------------
     A                                      -----------'
     A                                  2 15':  D R A W I N G   F I L E   I N Q'
     A                                  2 50'U I R Y  :'
     A                                  3 15'-----------------------------------
     A                                      -----------'
     A                                  5 14'DRAWING NUMBER:    <A>'
     A                                  7 14'DRAWING CODE:      <B>'
     A                                  7 48'-'
     A                                  9 14'EQUIPMENT NUMBER:  <C>'
     A                                  9 50'SUBSYSTEM -'
     A                                 11 14'EQUIPMENT TYPE:    <D>'
     A                                 11 50'SUBSYSTEM -'
     A                                 12 10'**********************************-
     A                                      ************************'
     A                                 13 12'ZONE:'
     A                                 13 29'DEPARTMENT:'
     A                                 13 52'BUILDING:'
     A                                 15 15'INITIATION DATE:'
     A                                 15 44'REVISION DATE:'
     A                                 17 23'KEY LIST/PARTS LIST:'
     A                                 19 29'VENDOR CODE:'
     A                                 21  8'Allowable selections from above th-
     A                                      e line: A, B-C, B-D, C, OR D.'
     A                                 22 11'Enter as many selections as desire-
     A                                      d from below the line.'
     A                                 23 25'Then press the "ENTER" key.'
     A            DNA           16A  B  5 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            DCA            8A  B  7 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            GA             1A  B  7 50DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            ENA            6A  B  9 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            SUB1A          4A  B  9 62DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            ETA            8A  B 11 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            SUB2A          4A  B 11 62DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            ZONEA          4A  B 13 20DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            DEPTA          4A  B 13 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            BLDGA          4A  B 13 63DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            INA            1A  B 15 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            RNA            1A  B 15 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            KPLA           8A  B 17 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            VCA            4A  B 19 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            COMMANDLN1    79A  O 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R VDRAWUPD
     A                                      PUTOVR
     A                                      CF01
     A                                  1  9'-----------------------------------
     A                                      -------------------------'
     A                                  2  9':  U P D A T E   D R A W I N G   F'
     A                                  2 44'I L E   E N T R I E S  :'
     A                                  3  9'-----------------------------------
     A                                      -------------------------'
     A                                  5  7'Drawing Number:'
     A                                  5 48'Drawing Revision:'
     A                                  7  7'Description:'
     A                                  9  7'Drawing Code:'
     A                                  9 53'Vendor Code:'
     A                                 11  7'Equipment:   Number:'
     A                                 11 38'Type:'
     A                                 11 55'Subsystem:'
     A                                 13  7'Zone:'
     A                                 13 29'Department:'
     A                                 13 56'Building:'
     A                                 15  7'Initiation Date:'
     A                                 15 47'Revision Date:'
     A                                 17  7'Key/Part List:'
     A                                 17 44'Drawing Location:'
     A                                 19 09'ENTER DRAWING NUMBER AND PRESS "En-
     A                                      ter" KEY OR PRESS F3 TO EXIT'
     A            DNUM          16A  B  5 24DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            DREV           4A  B  5 67DSPATR(PR)
     A                                      OVRDTA
     A            DESC          50A  B  7 21DSPATR(PR)
     A                                      OVRDTA
     A            DCODE          8A  B  9 22DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B  9 31DSPATR(PR)
     A                                      OVRDTA
     A            VCOD           4A  B  9 67DSPATR(PR)
     A                                      OVRDTA
     A            EQPNUM         6A  B 11 29DSPATR(PR)
     A                                      OVRDTA
     A            TYPEQ          8A  B 11 45DSPATR(PR)
     A                                      OVRDTA
     A            SUBSQ          4A  B 11 67DSPATR(PR)
     A                                      OVRDTA
     A            ZONEQ          4A  B 13 14DSPATR(PR)
     A                                      OVRDTA
     A            DEPTQ          4A  B 13 42DSPATR(PR)
     A                                      OVRDTA
     A            BLDGQ          4A  B 13 67DSPATR(PR)
     A                                      OVRDTA
     A            I1Q            2A  B 15 25DSPATR(PR)
     A                                      OVRDTA
     A            I2Q            2A  B 15 28DSPATR(PR)
     A                                      OVRDTA
     A            I3Q            2A  B 15 31DSPATR(PR)
     A                                      OVRDTA
     A            R1Q            2A  B 15 63DSPATR(PR)
     A                                      OVRDTA
     A            R2Q            2A  B 15 66DSPATR(PR)
     A                                      OVRDTA
     A            R3Q            2A  B 15 69DSPATR(PR)
     A                                      OVRDTA
     A            KPLISTQ        8A  B 17 23DSPATR(PR)
     A                                      OVRDTA
     A            LOCQ           8A  B 17 63DSPATR(PR)
     A                                      OVRDTA
     A            MESSG1        79A  O 23  1OVRDTA
     A            COMMANDLN1    79A  O 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R VDRAWUP2
     A                                      PUTOVR
     A                                      CF01
     A                                      CF04
     A                                      CF05
     A                                  1  9'-----------------------------------
     A                                      -------------------------'
     A                                  2  9':  U P D A T E   D R A W I N G   F'
     A                                  2 44'I L E   E N T R I E S  :'
     A                                  3  9'-----------------------------------
     A                                      -------------------------'
     A                                  5  7'Drawing Number:'
     A                                  5 48'Drawing Revision:'
     A                                  7  7'Description:'
     A                                  9  7'Drawing Code:'
     A                                  9 53'Vendor Code:'
     A                                 11  7'Equipment:   Number:'
     A                                 11 38'Type:'
     A                                 11 55'Subsystem:'
     A                                 13  7'Zone:'
     A                                 13 29'Department:'
     A                                 13 56'Building:'
     A                                 15  7'Initiation Date:'
     A                                 15 47'Revision Date:'
     A                                 17  7'Key/Part List:'
     A                                 17 44'Drawing Location:'
     A                                 19 05'Press F3 to exit or F5 to view suc-
     A                                      cessive drawings with the same numb-
     A                                      er'
     A                                 20  3'After locating drawing to be chang-
     A                                      ed, make changes and press "ENTER"'
     A                                 20 72'key, or'
     A                                 21  3'press "f4" key to duplicate screen'
     A                                 21 38'into file, make changes and press'
     A                                 21 72'"ENTER".'
     A            DNUM          16A  B  5 24DSPATR(PR)
     A                                      OVRDTA
     A            DREV           4A  B  5 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            DESC          50A  B  7 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            DCODE          8A  B  9 22DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            SR             1A  B  9 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            VCOD           4A  B  9 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            EQPNUMR        6A  B 11 29DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            TYPER          8A  B 11 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            SUBSR          4A  B 11 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            ZONER          4A  B 13 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            DEPTR          4A  B 13 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            BLDGR          4A  B 13 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            I1R            2A  B 15 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            I2R            2A  B 15 28DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            I3R            2A  B 15 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            R1R            2A  B 15 63DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            R2R            2A  B 15 66DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            R3R            2A  B 15 69DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            KPLISTR        8A  B 17 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            LOCR           8A  B 17 63DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            MESSLIN1      79A  O 23  1OVRDTA
     A            COMMANDLN1    79A  O 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
