     A*            14:01:06    T881S28     VPLTSTUP.HPTO38.CME
     A                                      DSPSIZ(24 80 *DS3)
     A                                      INDARA
     A                                      PRINT
     A                                      CHGINPDFT
     A  98                                  INVITE
     A          R BUYRCODE
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  3  1':'
     A                                  3 30'B U Y E R   C O D E S'
     A                                  4  1':'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  7  1':'
     A                                  7 26'A D D  A  B U Y E R  C O D E'
     A                                  8  1':'
     A                                  9  1':'
     A                                  9 11'CODE'
     A                                  9 25'BUYER NAME'
     A                                  9 49'PHONE NUMBER'
     A                                 10  1':'
     A                                 11  1':'
     A                                 12  1':'
     A                                 13  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 14  1':'
     A                                 15  1':'
     A                                 15 23'M O D I F Y  A  B U Y E R  N A M E'
     A                                 16  1':'
     A                                 17  1':'
     A                                 17 11'CODE'
     A                                 17 25'BUYER NAME'
     A                                 17 49'PHONE NUMBER'
     A                                 18  1':'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            CODE           4A  B 11 11DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06
     AO 97 96                               DSPATR(PC)
     A            BUYERNAME     16A  B 11 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            PHONENUMBE    25A  B 11 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            MCDE           4A  B 19 11DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            MBUYERNAME    16A  B 19 25DSPATR(PR)
     A                                      OVRDTA
     A            MPHONENUMB    25A  B 19 49DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELIN    79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELI2    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R BUYRCODEM
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  3  1':'
     A                                  3 30'B U Y E R   C O D E S'
     A                                  4  1':'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  7  1':'
     A                                  7 26'A D D  A  B U Y E R  C O D E'
     A                                  8  1':'
     A                                  9  1':'
     A                                  9 11'CODE'
     A                                  9 25'BUYER NAME'
     A                                  9 49'PHONE NUMBER'
     A                                 10  1':'
     A                                 11  1':'
     A                                 12  1':'
     A                                 13  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 14  1':'
     A                                 15  1':'
     A                                 15 23'M O D I F Y  A  B U Y E R  N A M E'
     A                                 16  1':'
     A                                 17  1':'
     A                                 17 11'CODE'
     A                                 17 25'BUYER NAME'
     A                                 17 49'PHONE NUMBER'
     A                                 18  1':'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            CODE           4A  B 11 11DSPATR(PR)
     A                                      OVRDTA
     A            BUYERNAME     16A  B 11 25DSPATR(PR)
     A                                      OVRDTA
     A            PHONENUMBE    25A  B 11 49DSPATR(PR)
     A                                      OVRDTA
     A            MCDE           4A  B 19 11DSPATR(PR)
     A                                      OVRDTA
     A            MBUYERNAME    16A  B 19 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03
     AO 97 96                               DSPATR(PC)
     A            MPHONENUMB    25A  B 19 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            MESSAGELIN    79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELI2    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R CURRENCY
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  3  1':'
     A                                  3 27'C U R R E N C Y  C O D E S'
     A                                  4  1':'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  7  1':'
     A                                  8  1':'
     A                                  8 24'A D D   A  C U R R E N C Y  C O D'
     A                                  8 58'E'
     A                                  9  1':'
     A                                 10  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 11  1':'
     A                                 12  1':'
     A                                 13  1':'
     A                                 14  1':'
     A                                 14 29'CURRENCY CODE:'
     A                                 15  1':'
     A                                 16  1':'
     A                                 16 29'DESCRIPTION  :'
     A                                 17  1':'
     A                                 18  1':'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            CC             2A  B 14 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            DESCRIPTIO    12A  B 16 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            MESSAGELIN    79A  B 22  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            MESSAGELI2    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-HELP SCREEN f3-EXIT     -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R CURRMENU
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  3  1':'
     A                                  3 16'C  U  R  R  E  N  C  Y     C  O  D'
     A                                  3 52'E     M  E  N U'
     A                                  4  1':'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  7  1':'
     A                                  8  1':'
     A                                  9  1':'
     A                                 10  1':'
     A                                 10 23'"f1"'
     A                                 10 35'--'
     A                                 10 44'ADD'
     A                                 10 55'CURRENY CODES'
     A                                 11  1':'
     A                                 12  1':'
     A                                 12 23'"f2"'
     A                                 12 35'--'
     A                                 12 44'EXCHANGE   RATE QUESTION'
     A                                 13  1':'
     A                                 14  1':'
     A                                 14 23'"f8"'
     A                                 14 35'--'
     A                                 14 44'ADD/DELETE EXCHANGE RATES'
     A                                 15  1':'
     A                                 16  1':'
     A                                 16 23'"f4"'
     A                                 16 35'--'
     A                                 16 44'MODIFY     EXCHANGE RATE TABLE'
     A                                 17  1':'
     A                                 18  1':'
     A                                 19  1':'
     A                                 19 17'PRESS THE APPROPRIATE FUNCTION KEY'
     A                                 19 52'TO CONTINUE'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1':'
     A                                 23  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-ADD CODE f2-EXCHANGE RAT-
     A                                      E QST f8-EXCHANGE RATES f4-EXCHANGE-
     A                                       RATE TBL f3-EXIT')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R DOCKINFO
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 25'D O C K   I N F O R M A T I O N'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':  OVERSHIPMENT VALUES FOR DOCK RE-
     A                                      CEIPTS:'
     A                                  5  1':'
     A                                  5 25'CODED  :'
     A                                  5 39'%   (KELLY PLANTS WILL ALWAYS BY 1-
     A                                      0%)    '
     A                                  6  1':'
     A                                  6 23'NONCODED :'
     A                                  6 39'%   (FOR RAW MATERIALS'
     A                                  6 75'¦    '
     A                                  7  1':'
     A                                  7 12'CODED RAW MATERIALS :'
     A                                  7 39'%'
     A                                  8  1':'
     A                                  9  1':  RAW MATERIALS MAJOR GROUP DESIG-
     A                                      NATORS:   (NOT APPLICABLE TO KELLY'
     A                                  9 70'PLANTS)   '
     A                                 10  1':   enter first two digits of majo-
     A                                      r group that will designate raw mat-
     A                                      erials    '
     A                                 11  1':'
     A                                 12  1':'
     A                                 13  1':'
     A                                 14  1':  ENTER "Y" BESIDE EACH RAW MATER-
     A                                      IAL GROUP THAT SHOULD BE AUTOMATICA-
     A                                      LLY'
     A                                 15  1':  STORED WHEN RECEIVED. (APPLICAB-
     A                                      LE TO GROUPS 26, 27, 28 AND 29 ONLY-
     A                                      )'
     A                                 16  1':'
     A                                 17  1':'
     A                                 17 21'26'
     A                                 17 31'27'
     A                                 17 41'28'
     A                                 17 50'29'
     A                                 18  1':'
     A                                 19  1':  REQUIRE TALLY NUMBER FOR NATURA-
     A                                      L RUBBER RECEIPTS (Y/N) ?'
     A                                 20  1':  IF YES, FORCE TALLY ENTRY FOR C-
     A                                      LASS'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            X1             2Y 0B  5 35DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            X2             2Y 0B  6 35DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            X3             2Y 0B  7 35DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            G1             2Y 0B 12 26DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            G2             2Y 0B 12 30DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            G3             2Y 0B 12 34DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            G4             2Y 0B 12 38DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            G5             2Y 0B 12 42DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            G6             2Y 0B 12 46DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            A              1A  B 17 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            B              1A  B 17 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            C              1A  B 17 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            D              1A  B 17 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            Q              1A  B 19 63DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            CLS            3Y 0B 20 40DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            MSGLINE       79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R ECURRENCY
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  3  1':'
     A                                  3 27'C U R R E N C Y  C O D E S'
     A                                  4  1':'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  7  1':'
     A                                  8  1':'
     A                                  8 24'A D D   A  C U R R E N C Y  C O D'
     A                                  8 58'E'
     A                                  9  1':'
     A                                 10  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 11  1':'
     A                                 12  1':'
     A                                 13  1':'
     A                                 13 29'CURRENCY CODE:'
     A                                 14  1':'
     A                                 15  1':'
     A                                 15 29'DESCRIPTION  :'
     A                                 16  1':'
     A                                 17  1':'
     A                                 17 28'EDI EQUIVALENT:'
     A                                 18  1':'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            CC             2A  B 13 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            DESCRIPTIO    12A  B 15 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            EDI            3A  B 17 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            MESSAGELIN    79A  B 22  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            MESSAGELI2    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-HELP SCREEN f3-EXIT     -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R EDELTERMSA
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 21'D  E  L  I  V  E  R  Y    T  E  R'
     A                                  2 56'M  S'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 16'A  D  D    D  E  L  I  V  E  R  Y'
     A                                  4 53'T  E  R  M  S'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  7  1':   1. TERMS OF DELIVERY FUNCTION'
     A                                  7 35': please enter function'
     A                                  7 73':'
     A                                  8  1':'
     A                                  9  1':   2. TERMS OF DELIVERY'
     A                                  9 35': please enter terms of delivery c-
     A                                      ode :'
     A                                 10  1':'
     A                                 11  1':   3. PLACE / LOCATION QUALIFIER'
     A                                 11 35': please  enter qualifier'
     A                                 11 73':'
     A                                 12  1':'
     A                                 13  1':   4. PLACE / LOCATION : please e-
     A                                      nter UN/LOCODE  :'
     A                                 14  1':'
     A                                 15  1':'
     A                                 15 49'OR'
     A                                 16  1':'
     A                                 17  1':'
     A                                 17 40'any other location :'
     A                                 18  1':'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            TF             2A  B  7 75DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04
     AO 97 96                               DSPATR(PC)
     A            TOD            3A  B  9 75DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            PLQ            3A  B 11 75DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            PLACELOCCO    25A  B 13 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            ANYOTHERLO    17A  B 17 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-HELP SCREEN f3-EXIT     -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R EDIQUES
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  3  1':'
     A                                  3 23'E  D  I    Q  U  E  S  T  I  O  N'
     A                                  4  1':'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  7  1': IS YOUR PLANT USING ELECTONIC DA-
     A                                      TA INTERCHANGE FOR PURCHASING ?'
     A                                  8  1':'
     A                                  9  1':'
     A                                 10  1':'
     A                                 11  1':'
     A                                 12  1':'
     A                                 13  1':'
     A                                 14  1':'
     A                                 15  1':'
     A                                 16  1':'
     A                                 17  1':'
     A                                 18  1':'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            E              1A  B  7 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R EDIRECSEL
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  3  1':'
     A                                  3 15'C  R  E  A  T  E    E  D  I    R'
     A                                  3 49'E  C  O  R  D  S'
     A                                  4  1':'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  7  1':    SELECT ALL PURCHASE ORDERS FO-
     A                                      R VENDOR CODE :'
     A                                  8  1':'
     A                                  9  1':'
     A                                  9 46'OR'
     A                                 10  1':'
     A                                 11  1':'
     A                                 11 31'PURCHASE ORDER NO :'
     A                                 12  1':'
     A                                 13  1':'
     A                                 13 46'OR'
     A                                 14  1':'
     A                                 15  1':'
     A                                 15 36'BATCH NUMBER :'
     A                                 16  1':'
     A                                 17  1':'
     A                                 18  1':'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            VENDORCODE    10A  B  7 51DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03
     AO 97 96                               DSPATR(PC)
     A            PONUMBR        7A  B 11 51DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            REL            3A  B 11 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            BATCHN         6A  B 15 51DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-HELP f3-EXIT            -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R EPAYTERMCD
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 17'E  D  I    P  A  Y  M  E  N  T'
     A                                  2 51'T  E  R  M  S'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  7  1':   ENTER 2 DIGIT EDI PAYMENT CODE'
     A                                  7 36':'
     A                                  8  1':'
     A                                  9  1':   1. PAYMENT TERMS TYPE ... : pl-
     A                                      ease enter payment type code .....'
     A                                  9 70':'
     A                                 10  1':'
     A                                 11  1':   2. PAYMENT TIME REFERENCE : pl-
     A                                      ease enter payment type reference'
     A                                 11 70':'
     A                                 12  1':'
     A                                 13  1':   3. TIME RELATION ........ : pl-
     A                                      ease enter time relation code ....'
     A                                 13 70':'
     A                                 14  1':'
     A                                 15  1':   4. TYPE OF PERIOD ....... : pl-
     A                                      ease enter type of period code ...'
     A                                 15 70':'
     A                                 16  1':'
     A                                 17  1':   5. NUMBER OF PERIODS .... : pl-
     A                                      ease enter the number of periods .'
     A                                 17 70':'
     A                                 18  1':'
     A                                 19  1':   6. PERCENTAGE ........... : pl-
     A                                      ease enter the discount rate .....'
     A                                 19 70':'
     A                                 20  1':'
     A                                 21  1':   7. PAYMENT NET DAYS ..... : pl-
     A                                      ease enter payment net days ......'
     A                                 21 70':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            MODE          35A  B  4 27DSPATR(PR)
     A                                      OVRDTA
     A            PC             2A  B  7 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27
     AO 97 96                               DSPATR(PC)
     A            PT             2A  B  9 72DSPATR(PR)
     A                                      OVRDTA
     A            TRF            3A  B 11 72DSPATR(PR)
     A                                      OVRDTA
     A            TR             2A  B 13 72DSPATR(PR)
     A                                      OVRDTA
     A            TOP            3A  B 15 72DSPATR(PR)
     A                                      OVRDTA
     A            NOP            3A  B 17 72DSPATR(PR)
     A                                      OVRDTA
     A            PE             2A  B 19 72DSPATR(PR)
     A                                      OVRDTA
     A            CNT            3A  B 19 75DSPATR(PR)
     A                                      OVRDTA
     A            PND            3A  B 21 72DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R EPAYTERMS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  3  1':'
     A                                  3 23'P  A  Y  M  E  N  T    T  E  R  M'
     A                                  3 58'S'
     A                                  4  1':'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  7  1':'
     A                                  8  1':'
     A                                  9  1':'
     A                                  9 23'"f1"'
     A                                  9 35'--'
     A                                  9 44'HELP   SCREEN'
     A                                 10  1':'
     A                                 11  1':'
     A                                 11 23'"f2"'
     A                                 11 35'--'
     A                                 11 44'ADD    PAYMENT TERMS'
     A                                 12  1':'
     A                                 13  1':'
     A                                 13 23'"f8"'
     A                                 13 35'--'
     A                                 13 44'MODIFY PAYMENT TERMS'
     A                                 14  1':'
     A                                 15  1':'
     A                                 15 23'"f4"'
     A                                 15 35'--'
     A                                 15 44'DELETE PAYMENT TERMS'
     A                                 16  1':'
     A                                 17  1':'
     A                                 17 23'"f6"'
     A                                 17 35'--'
     A                                 17 44'EDI PAYMENT TERMS'
     A                                 18  1':'
     A                                 19  1':'
     A                                 19 17'PRESS THE APPROPRIATE FUNCTION KEY'
     A                                 19 52'TO CONTINUE'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1':'
     A                                 23  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-HELP SCREEN f2-ADD FUNCT-
     A                                      ION f8-MODIFY FUNCTION f4-DELETE FU-
     A                                      NCTION f6-EDI MEN')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R EPAYTERMSA
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 17'E  D  I    P  A  Y  M  E  N  T'
     A                                  2 51'T  E  R  M  S'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  7  1':   ENTER 2 DIGIT EDI PAYMENT CODE'
     A                                  7 36':'
     A                                  8  1':'
     A                                  9  1':   1. PAYMENT TERMS TYPE ... : pl-
     A                                      ease enter payment type code .....'
     A                                  9 70':'
     A                                 10  1':'
     A                                 11  1':   2. PAYMENT TIME REFERENCE : pl-
     A                                      ease enter payment type reference'
     A                                 11 70':'
     A                                 12  1':'
     A                                 13  1':   3. TIME RELATION ........ : pl-
     A                                      ease enter time relation code ....'
     A                                 13 70':'
     A                                 14  1':'
     A                                 15  1':   4. TYPE OF PERIOD ....... : pl-
     A                                      ease enter type of period code ...'
     A                                 15 70':'
     A                                 16  1':'
     A                                 17  1':   5. NUMBER OF PERIODS .... : pl-
     A                                      ease enter the number of periods .'
     A                                 17 70':'
     A                                 18  1':'
     A                                 19  1':   6. PERCENTAGE ........... : pl-
     A                                      ease enter the discount rate .....'
     A                                 19 70':'
     A                                 20  1':'
     A                                 21  1':   7. PAYMENT NET DAYS ..... : pl-
     A                                      ease enter payment net days ......'
     A                                 21 70':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            MODE          35A  B  4 27DSPATR(PR)
     A                                      OVRDTA
     A            PC             2A  B  7 38DSPATR(PR)
     A                                      OVRDTA
     A            PT             2A  B  9 72DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20
     AO 97 96                               DSPATR(PC)
     A            TRF            3A  B 11 72DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            TR             2Y 0B 13 72DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            TOP            3A  B 15 72DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            NOP            3Y 0B 17 72DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            PE             2Y 0B 19 72DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            CNT            3A  B 19 75DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            PND            3Y 0B 21 72DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-HELP SCREEN f3-EXIT     -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R EPAYTERMSD
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 17'E  D  I    P  A  Y  M  E  N  T'
     A                                  2 51'T  E  R  M  S'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  7  1':   ENTER 2 DIGIT EDI PAYMENT CODE'
     A                                  7 36':'
     A                                  8  1':'
     A                                  9  1':   1. PAYMENT TERMS TYPE ... : pl-
     A                                      ease enter payment type code .....'
     A                                  9 70':'
     A                                 10  1':'
     A                                 11  1':   2. PAYMENT TIME REFERENCE : pl-
     A                                      ease enter payment type reference'
     A                                 11 70':'
     A                                 12  1':'
     A                                 13  1':   3. TIME RELATION ........ : pl-
     A                                      ease enter time relation code ....'
     A                                 13 70':'
     A                                 14  1':'
     A                                 15  1':   4. TYPE OF PERIOD ....... : pl-
     A                                      ease enter type of period code ...'
     A                                 15 70':'
     A                                 16  1':'
     A                                 17  1':   5. NUMBER OF PERIODS .... : pl-
     A                                      ease enter the number of periods .'
     A                                 17 70':'
     A                                 18  1':'
     A                                 19  1':   6. PERCENTAGE ........... : pl-
     A                                      ease enter the discount rate .....'
     A                                 19 70':'
     A                                 20  1':'
     A                                 21  1':   7. PAYMENT NET DAYS ..... : pl-
     A                                      ease enter payment net days ......'
     A                                 21 70':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            MODE          35A  B  4 27DSPATR(PR)
     A                                      OVRDTA
     A            PC             2A  B  7 38DSPATR(PR)
     A                                      OVRDTA
     A            PT             2A  B  9 72DSPATR(PR)
     A                                      OVRDTA
     A            TRF            3A  B 11 72DSPATR(PR)
     A                                      OVRDTA
     A            TR             2A  B 13 72DSPATR(PR)
     A                                      OVRDTA
     A            TOP            3A  B 15 72DSPATR(PR)
     A                                      OVRDTA
     A            NOP            3A  B 17 72DSPATR(PR)
     A                                      OVRDTA
     A            PE             2A  B 19 72DSPATR(PR)
     A                                      OVRDTA
     A            CNT            3A  B 19 75DSPATR(PR)
     A                                      OVRDTA
     A            PND            3A  B 21 72DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f2-DELETE RECORD f3-EXIT   -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R EPAYTERMSM
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  3  1':'
     A                                  3 18'E  D  I    P  A  Y  M  E  N  T'
     A                                  3 52'T  E  R  M  S'
     A                                  4  1':'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  7  1':'
     A                                  8  1':'
     A                                  9  1':'
     A                                  9 23'"f1"'
     A                                  9 35'--'
     A                                  9 44'HELP SCREEN'
     A                                 10  1':'
     A                                 11  1':'
     A                                 11 23'"f2"'
     A                                 11 35'--'
     A                                 11 44'ADD EDI PAYMENT TERMS'
     A                                 12  1':'
     A                                 13  1':'
     A                                 13 23'"f8"'
     A                                 13 35'--'
     A                                 13 44'MODIFY EDI PAYMENT TERMS'
     A                                 14  1':'
     A                                 15  1':'
     A                                 15 23'"f4"'
     A                                 15 35'--'
     A                                 15 44'DELETE EDI PAYMENT TERMS'
     A                                 16  1':'
     A                                 17  1':'
     A                                 18  1':'
     A                                 19  1':'
     A                                 19 17'PRESS THE APPROPRIATE FUNCTION KEY'
     A                                 19 52'TO CONTINUE'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1':'
     A                                 23  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-HELP SCREEN f2-ADD FUNCT-
     A                                      ION f8-MODIFY FUNCTION f4-DELETE FU-
     A                                      NCTION f3-EXIT   ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R EPURCHMENU
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 26'P U R C H A S I N G    M E N U'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  5  1':'
     A                                  5  6'-- BUYER INFORMATION'
     A                                  5 42'-- PURCHASE ORDER DELETION QUESTIO-
     A                                      N   '
     A                                  6  1':'
     A                                  7  1':'
     A                                  7  6'-- CURRENCY CODE MENU'
     A                                  7 42'-- STANDARD FOLLOWUP INSTRUCTIONS'
     A                                  8  1':'
     A                                  9  1':'
     A                                  9  6'-- EDI QUESTION'
     A                                  9 42'-- TERMS OF TRANSPORT/DELIVERY'
     A                                 10  1':'
     A                                 11  1':'
     A                                 11  6'-- FOB CODES'
     A                                 11 42'-- UNIT OF MEASURE'
     A                                 12  1':'
     A                                 13  1':'
     A                                 13  6'-- PAYMENT TERMS'
     A                                 13 42'-- CREATE EDI FILE'
     A                                 14  1':'
     A                                 15  1':'
     A                                 16  1':'
     A                                 17  1':'
     A                                 18  1':'
     A                                 19  1':'
     A                                 20  1':'
     A                                 20 10'****  ENTER AN "X" IN FRONT OF THE'
     A                                 20 45'DESIRED TOPIC'
     A                                 21  1':'
     A                                 21 43'OR PRESS "f3" TO EXIT  ****'
     A                                 22  1':'
     A                                 23  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            B              1A  B  5  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            Q              1A  B  5 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            C              1A  B  7  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            S              1A  B  7 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            E              1A  B  9  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            T              1A  B  9 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            F              1A  B 11  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            U              1A  B 11 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            P              1A  B 13  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            X              1A  B 13 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R ETRANSADC
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 24'T E R M S   O F   T R A N S O R T'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 19'A D D   M O D E S   O F   T R A N'
     A                                  4 53'S P O R T'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  6 22'M O D E S'
     A                                  6 38'D E S C R I P T I O N'
     A                                  7  1':'
     A                                  8  1':'
     A                                  9  1':'
     A                                 10  1':'
     A                                 11  1':'
     A                                 12  1':'
     A                                 13  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 14  1':'
     A                                 14 19'C H A N G E   D E S C R I P T I O'
     A                                 14 53'N   O N L Y'
     A                                 15  1':'
     A                                 16  1':'
     A                                 17  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 18  1':'
     A                                 18 18'D E L E T E   M O D E   O F   T R'
     A                                 18 52'A N S P O R T'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            M1             2A  B  8 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19
     AO 97 96                               DSPATR(PC)
     A            DESC1         20A  B  8 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            M2             2A  B 10 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            DESC2         20A  B 10 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            M3             2A  B 12 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            DESC3         20A  B 12 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            M5             2A  B 16 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            DESC4         20A  B 16 38DSPATR(PR)
     A                                      OVRDTA
     A            M6             2A  B 20 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            DESC5         20A  B 20 38DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R ETRANSADD
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  3  1':'
     A                                  3 17'T  E  R  M  S    O  F    T  R  A'
     A                                  3 51'N  P  O  R  T'
     A                                  4  1':'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  7  1':'
     A                                  8  1':'
     A                                  8 17'TRANSPORTATION PAYMENT METHOD :'
     A                                  9  1':'
     A                                 10  1':'
     A                                 10 17'TERMS OF DELIVERY'
     A                                 10 47':'
     A                                 11  1':'
     A                                 12  1':'
     A                                 13  1':'
     A                                 14  1':'
     A                                 15  1':'
     A                                 16  1':'
     A                                 17  1':'
     A                                 18  1':'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            TP             2A  B  8 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03
     AO 97 96                               DSPATR(PC)
     A            TOD            3A  B 10 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-HELP PAY METHOD f2-HELP -
     A                                      TRM OF DLVRY f3-EXIT               -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R ETRANSDSP
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 24'T E R M S   O F   T R A N S O R T'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 19'A D D   M O D E S   O F   T R A N'
     A                                  4 53'S P O R T'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  6 22'M O D E S'
     A                                  6 38'D E S C R I P T I O N'
     A                                  7  1':'
     A                                  8  1':'
     A                                  9  1':'
     A                                 10  1':'
     A                                 11  1':'
     A                                 12  1':'
     A                                 13  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 14  1':'
     A                                 14 19'C H A N G E   D E S C R I P T I O'
     A                                 14 53'N   O N L Y'
     A                                 15  1':'
     A                                 16  1':'
     A                                 17  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 18  1':'
     A                                 18 18'D E L E T E   M O D E   O F   T R'
     A                                 18 52'A N S P O R T'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            M1             2A  B  8 26DSPATR(PR)
     A                                      OVRDTA
     A            DESC1         20A  B  8 38DSPATR(PR)
     A                                      OVRDTA
     A            M2             2A  B 10 26DSPATR(PR)
     A                                      OVRDTA
     A            DESC2         20A  B 10 38DSPATR(PR)
     A                                      OVRDTA
     A            M3             2A  B 12 26DSPATR(PR)
     A                                      OVRDTA
     A            DESC3         20A  B 12 38DSPATR(PR)
     A                                      OVRDTA
     A            M5             2A  B 16 26DSPATR(PR)
     A                                      OVRDTA
     A            DESC4         20A  B 16 38DSPATR(PR)
     A                                      OVRDTA
     A            M6             2A  B 20 26DSPATR(PR)
     A                                      OVRDTA
     A            DESC5         20A  B 20 38DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R ETRANSMENU
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  3  1':'
     A                                  3 17'T  E  R  M  S    O  F    T  R  A'
     A                                  3 51'N  P  O  R  T'
     A                                  4  1':'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  7  1':'
     A                                  8  1':'
     A                                  8 29'F1  -  TERMS OF DELIVERY'
     A                                  9  1':'
     A                                 10 29'F2  - MODE OF TRANSPORT'
     A                                 11  1':'
     A                                 12  1':'
     A                                 13  1':'
     A                                 14  1':'
     A                                 15  1':'
     A                                 16  1':'
     A                                 17  1':'
     A                                 18  1':'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-TERMS f2-MODES f3-EXIT  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R ETRANSMOD
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 24'T E R M S   O F   T R A N S O R T'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 19'A D D   M O D E S   O F   T R A N'
     A                                  4 53'S P O R T'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  6 22'M O D E S'
     A                                  6 38'D E S C R I P T I O N'
     A                                  7  1':'
     A                                  8  1':'
     A                                  9  1':'
     A                                 10  1':'
     A                                 11  1':'
     A                                 12  1':'
     A                                 13  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 14  1':'
     A                                 14 19'C H A N G E   D E S C R I P T I O'
     A                                 14 53'N   O N L Y'
     A                                 15  1':'
     A                                 16  1':'
     A                                 17  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 18  1':'
     A                                 18 18'D E L E T E   M O D E   O F   T R'
     A                                 18 52'A N S P O R T'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            M1             2A  B  8 26DSPATR(PR)
     A                                      OVRDTA
     A            DESC1         20A  B  8 38DSPATR(PR)
     A                                      OVRDTA
     A            M2             2A  B 10 26DSPATR(PR)
     A                                      OVRDTA
     A            DESC2         20A  B 10 38DSPATR(PR)
     A                                      OVRDTA
     A            M3             2A  B 12 26DSPATR(PR)
     A                                      OVRDTA
     A            DESC3         20A  B 12 38DSPATR(PR)
     A                                      OVRDTA
     A            M5             2A  B 16 26DSPATR(PR)
     A                                      OVRDTA
     A            DESC4         20A  B 16 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26
     AO 97 96                               DSPATR(PC)
     A            M6             2A  B 20 26DSPATR(PR)
     A                                      OVRDTA
     A            DESC5         20A  B 20 38DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R EUNITMEAS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 24'U N I T   O F   M E A S U R E S'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 20'A D D   U N I T   O F   M E A S U'
     A                                  4 54'R E S'
     A                                  5  1':'
     A                                  6  1':'
     A                                  6 15'UNIT OF MEASURE      EDI EQUIVALEN-
     A                                      T      DESCRIPTION'
     A                                  7  1':'
     A                                  8  1':'
     A                                  9  1':'
     A                                 10  1':'
     A                                 11  1':'
     A                                 12  1':'
     A                                 13  1':'
     A                                 14  1':'
     A                                 15  1':'
     A                                 16  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 17  1':'
     A                                 18  1':'
     A                                 18 17'M O D I F Y   A   D E S C R I P T'
     A                                 18 51'I O N   O N L Y'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            U1             2A  B  8 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04
     AO 97 96                               DSPATR(PC)
     A            ED1            3A  B  8 41DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            DESCRIPTIO    12A  B  8 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            U2             2A  B 10 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            ED2            3A  B 10 41DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            DESCRIPTI2    12A  B 10 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            U3             2A  B 12 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            ED3            3A  B 12 41DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            DESCRIPTI3    12A  B 12 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            U4             2A  B 14 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            ED4            3A  B 14 41DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            DESCRIPTI4    12A  B 14 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            U5             2A  B 20 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            ED5            3A  B 20 41DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI5    12A  B 20 56DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELIN    79A  B 23  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R EUNITMEASM
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 24'U N I T   O F   M E A S U R E S'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 20'A D D   U N I T   O F   M E A S U'
     A                                  4 54'R E S'
     A                                  5  1':'
     A                                  6  1':'
     A                                  6 15'UNIT OF MEASURE      EDI EQUIVALEN-
     A                                      T      DESCRIPTION'
     A                                  7  1':'
     A                                  8  1':'
     A                                  9  1':'
     A                                 10  1':'
     A                                 11  1':'
     A                                 12  1':'
     A                                 13  1':'
     A                                 14  1':'
     A                                 15  1':'
     A                                 16  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 17  1':'
     A                                 18  1':'
     A                                 18 17'M O D I F Y   A   D E S C R I P T'
     A                                 18 51'I O N   O N L Y'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            U1             2A  B  8 21DSPATR(PR)
     A                                      OVRDTA
     A            ED1            3A  B  8 41DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIO    12A  B  8 56DSPATR(PR)
     A                                      OVRDTA
     A            U2             2A  B 10 21DSPATR(PR)
     A                                      OVRDTA
     A            ED2            3A  B 10 41DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI2    12A  B 10 56DSPATR(PR)
     A                                      OVRDTA
     A            U3             2A  B 12 21DSPATR(PR)
     A                                      OVRDTA
     A            ED3            3A  B 12 41DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI3    12A  B 12 56DSPATR(PR)
     A                                      OVRDTA
     A            U4             2A  B 14 21DSPATR(PR)
     A                                      OVRDTA
     A            ED4            3A  B 14 41DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI4    12A  B 14 56DSPATR(PR)
     A                                      OVRDTA
     A            U5             2A  B 20 21DSPATR(PR)
     A                                      OVRDTA
     A            ED5            3A  B 20 41DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18
     AO 97 96                               DSPATR(PC)
     A            DESCRIPTI5    12A  B 20 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            MESSAGELIN    79A  B 23  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R EXCHANGE
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  3  1':'
     A                                  3 18'E X C H A N G E   R A T E   Q U E'
     A                                  3 52'S T I O N'
     A                                  4  1':'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  7  1':'
     A                                  8  1':'
     A                                  9  1':'
     A                                 10  1':'
     A                                 10 14'SHOULD PO TRANSACTIONS FOR ACCOUNT-
     A                                      ING AND BUDGET AMOUNTS'
     A                                 11  1':'
     A                                 11 14'BE CONVERTED TO THE LOCAL CURRENCY-
     A                                      ?'
     A                                 12  1':'
     A                                 12 17'ENTER A "Y" OR "N"'
     A                                 13  1':'
     A                                 14  1':'
     A                                 15  1':'
     A                                 15 14'ENTER YOUR LOCAL CURRENCY CODE:'
     A                                 16  1':'
     A                                 17  1':'
     A                                 18  1':'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            Y              1A  B 12 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05
     AO 97 96                               DSPATR(PC)
     A            CO             2A  B 15 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            MSGLINE       79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-HELP SCREEN f3-EXIT     -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R EXCHANGEM
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 21'E X C H A N G E    R A T E    T A'
     A                                  2 55'B L E'
     A                                  2 79':'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 11'LOCAL CURRENCY'
     A                                  4 44'FOREIGN CURRENCY'
     A                                  4 79':'
     A                                  5  1':'
     A                                  5 79':'
     A                                  6  1':'
     A                                  6 27'='
     A                                  6 79':'
     A                                  7  1':'
     A                                  7 27'='
     A                                  7 79':'
     A                                  8  1':'
     A                                  8 27'='
     A                                  8 79':'
     A                                  9  1':'
     A                                  9 27'='
     A                                  9 79':'
     A                                 10  1':'
     A                                 10 27'='
     A                                 10 79':'
     A                                 11  1':'
     A                                 11 27'='
     A                                 11 79':'
     A                                 12  1':'
     A                                 12 27'='
     A                                 12 79':'
     A                                 13  1':'
     A                                 13 27'='
     A                                 13 79':'
     A                                 14  1':'
     A                                 14 27'='
     A                                 14 79':'
     A                                 15  1':'
     A                                 15 27'='
     A                                 15 79':'
     A                                 16  1':'
     A                                 16 27'='
     A                                 16 79':'
     A                                 17  1':'
     A                                 17 27'='
     A                                 17 79':'
     A                                 18  1':'
     A                                 18 27'='
     A                                 18 79':'
     A                                 19  1':'
     A                                 19 27'='
     A                                 19 79':'
     A                                 20  1':'
     A                                 20 27'='
     A                                 20 79':'
     A                                 21  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            ON1            3A  B  6  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIO    12A  B  6 14DSPATR(PR)
     A                                      OVRDTA
     A            X1111          5Y 0B  6 29DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 74                               DSPATR(RI)
     A N97 74                               DSPATR(PC)
     A            N111111        7Y 0B  6 35DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 59                               DSPATR(RI)
     A  97 59                               DSPATR(PC)
     A            C1             2A  B  6 44DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPTI    12A  B  6 48DSPATR(PR)
     A                                      OVRDTA
     A            REFDA1         6A  B  6 65DSPATR(PR)
     A                                      OVRDTA
     A            ON2            3A  B  7  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI2    12A  B  7 14DSPATR(PR)
     A                                      OVRDTA
     A            X2222          5Y 0B  7 29DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 79                               DSPATR(RI)
     A N97 79                               DSPATR(PC)
     A            N222222        7Y 0B  7 35DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 60                               DSPATR(RI)
     A  97 60                               DSPATR(PC)
     A            C2             2A  B  7 44DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPT2    12A  B  7 48DSPATR(PR)
     A                                      OVRDTA
     A            REFDA2         6A  B  7 65DSPATR(PR)
     A                                      OVRDTA
     A            ON3            3A  B  8  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI3    12A  B  8 14DSPATR(PR)
     A                                      OVRDTA
     A            X3333          5Y 0B  8 29DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 84                               DSPATR(RI)
     A N97 84                               DSPATR(PC)
     A            N333333        7Y 0B  8 35DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 61                               DSPATR(RI)
     A  97 61                               DSPATR(PC)
     A            C3             2A  B  8 44DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPT3    12A  B  8 48DSPATR(PR)
     A                                      OVRDTA
     A            REFDA3         6A  B  8 65DSPATR(PR)
     A                                      OVRDTA
     A            ON4            3A  B  9  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI4    12A  B  9 14DSPATR(PR)
     A                                      OVRDTA
     A            X4444          5Y 0B  9 29DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 89                               DSPATR(RI)
     A N97 89                               DSPATR(PC)
     A            N444444        7Y 0B  9 35DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 76                               DSPATR(RI)
     A  97 76                               DSPATR(PC)
     A            C4             2A  B  9 44DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPT4    12A  B  9 48DSPATR(PR)
     A                                      OVRDTA
     A            REFDA4         6A  B  9 65DSPATR(PR)
     A                                      OVRDTA
     A            ON5            3A  B 10  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI5    12A  B 10 14DSPATR(PR)
     A                                      OVRDTA
     A            X5555          5Y 0B 10 29DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A N97 94                               DSPATR(RI)
     A N97 94                               DSPATR(PC)
     A            N555555        7Y 0B 10 35DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 63                               DSPATR(RI)
     A  97 63                               DSPATR(PC)
     A            C5             2A  B 10 44DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPT5    12A  B 10 48DSPATR(PR)
     A                                      OVRDTA
     A            REFDA5         6A  B 10 65DSPATR(PR)
     A                                      OVRDTA
     A            ON6            3A  B 11  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI6    12A  B 11 14DSPATR(PR)
     A                                      OVRDTA
     A            X6666          5Y 0B 11 29DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 03                               DSPATR(RI)
     A  97 03                               DSPATR(PC)
     A            N666666        7Y 0B 11 35DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 64                               DSPATR(RI)
     A  97 64                               DSPATR(PC)
     A            C6             2A  B 11 44DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPT6    12A  B 11 48DSPATR(PR)
     A                                      OVRDTA
     A            REFDA6         6A  B 11 65DSPATR(PR)
     A                                      OVRDTA
     A            ON7            3A  B 12  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI7    12A  B 12 14DSPATR(PR)
     A                                      OVRDTA
     A            X7777          5Y 0B 12 29DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 08                               DSPATR(RI)
     A  97 08                               DSPATR(PC)
     A            N777777        7Y 0B 12 35DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 65                               DSPATR(RI)
     A  97 65                               DSPATR(PC)
     A            C7             2A  B 12 44DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPT7    12A  B 12 48DSPATR(PR)
     A                                      OVRDTA
     A            REFDA7         6A  B 12 65DSPATR(PR)
     A                                      OVRDTA
     A            ON8            3A  B 13  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI8    12A  B 13 14DSPATR(PR)
     A                                      OVRDTA
     A            X8888          5Y 0B 13 29DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 13                               DSPATR(RI)
     A  97 13                               DSPATR(PC)
     A            N888888        7Y 0B 13 35DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 66                               DSPATR(RI)
     A  97 66                               DSPATR(PC)
     A            C8             2A  B 13 44DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPT8    12A  B 13 48DSPATR(PR)
     A                                      OVRDTA
     A            REFDA8         6A  B 13 65DSPATR(PR)
     A                                      OVRDTA
     A            ON9            3A  B 14  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI9    12A  B 14 14DSPATR(PR)
     A                                      OVRDTA
     A            X9999          5Y 0B 14 29DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 18                               DSPATR(RI)
     A  97 18                               DSPATR(PC)
     A            N999999        7Y 0B 14 35DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 67                               DSPATR(RI)
     A  97 67                               DSPATR(PC)
     A            C9             2A  B 14 44DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPT9    12A  B 14 48DSPATR(PR)
     A                                      OVRDTA
     A            REFDA9         6A  B 14 65DSPATR(PR)
     A                                      OVRDTA
     A            O10            3A  B 15  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIA    12A  B 15 14DSPATR(PR)
     A                                      OVRDTA
     A            X1000          5Y 0B 15 29DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 23                               DSPATR(RI)
     A  97 23                               DSPATR(PC)
     A            N100000        7Y 0B 15 35DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 68                               DSPATR(RI)
     A  97 68                               DSPATR(PC)
     A            D0             2A  B 15 44DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPTN    12A  B 15 48DSPATR(PR)
     A                                      OVRDTA
     A            REFD10         6A  B 15 65DSPATR(PR)
     A                                      OVRDTA
     A            O11            3A  B 16  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIB    12A  B 16 14DSPATR(PR)
     A                                      OVRDTA
     A            X1100          5Y 0B 16 29DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 29                               DSPATR(RI)
     A  97 29                               DSPATR(PC)
     A            N110000        7Y 0B 16 35DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 69                               DSPATR(RI)
     A  97 69                               DSPATR(PC)
     A            D1             2A  B 16 44DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPTA    12A  B 16 48DSPATR(PR)
     A                                      OVRDTA
     A            REFD11         6A  B 16 65DSPATR(PR)
     A                                      OVRDTA
     A            O12            3A  B 17  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIC    12A  B 17 14DSPATR(PR)
     A                                      OVRDTA
     A            X1200          5Y 0B 17 29DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 35                               DSPATR(RI)
     A  97 35                               DSPATR(PC)
     A            N120000        7Y 0B 17 35DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 70                               DSPATR(RI)
     A  97 70                               DSPATR(PC)
     A            D2             2A  B 17 44DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPTB    12A  B 17 48DSPATR(PR)
     A                                      OVRDTA
     A            REFD12         6A  B 17 65DSPATR(PR)
     A                                      OVRDTA
     A            O13            3A  B 18  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTID    12A  B 18 14DSPATR(PR)
     A                                      OVRDTA
     A            X1300          5Y 0B 18 29DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 41                               DSPATR(RI)
     A  97 41                               DSPATR(PC)
     A            N130000        7Y 0B 18 35DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 71                               DSPATR(RI)
     A  97 71                               DSPATR(PC)
     A            D3             2A  B 18 44DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPTC    12A  B 18 48DSPATR(PR)
     A                                      OVRDTA
     A            REFD13         6A  B 18 65DSPATR(PR)
     A                                      OVRDTA
     A            O14            3A  B 19  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIE    12A  B 19 14DSPATR(PR)
     A                                      OVRDTA
     A            X1400          5Y 0B 19 29DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 47                               DSPATR(RI)
     A  97 47                               DSPATR(PC)
     A            N140000        7Y 0B 19 35DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 72                               DSPATR(RI)
     A  97 72                               DSPATR(PC)
     A            D4             2A  B 19 44DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPTD    12A  B 19 48DSPATR(PR)
     A                                      OVRDTA
     A            REFD14         6A  B 19 65DSPATR(PR)
     A                                      OVRDTA
     A            O15            3A  B 20  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIF    12A  B 20 14DSPATR(PR)
     A                                      OVRDTA
     A            X1500          5Y 0B 20 29DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 54                               DSPATR(RI)
     A  97 54                               DSPATR(PC)
     A            N150000        7Y 0B 20 35DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  97 73                               DSPATR(RI)
     A  97 73                               DSPATR(PC)
     A            D5             2A  B 20 44DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPTE    12A  B 20 48DSPATR(PR)
     A                                      OVRDTA
     A            REFD15         6A  B 20 65DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGE1      79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGE2      79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-NEXT SCREEN f3-EXIT     -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R EXCHANGES
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  3  1':'
     A                                  3 23'E  X  C  H  A  N  G  E    R  A  T'
     A                                  3 58'E'
     A                                  4  1':'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  6 25'A D D  /  D E L E T E   O N L Y'
     A                                  7  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  8  1':'
     A                                  9  1':'
     A                                  9 13'ENTER FOREIGN CURRENCY CODE :'
     A                                 10  1':'
     A                                 11  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 12  1':'
     A                                 13  1':'
     A                                 14  1':'
     A                                 15  1':'
     A                                 15 13'ONE UNIT LOCAL CURRENCY = ????????'
     A                                 15 49'FOREIGN CURRENCY'
     A                                 16  1':'
     A                                 17  1':'
     A                                 17 18'ONE'
     A                                 17 37'='
     A                                 18  1':'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            CO             2A  B  9 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26
     AO 97 96                               DSPATR(PC)
     A            DESCRIPTIO    12A  B 17 22DSPATR(PR)
     A                                      OVRDTA
     A            XXXXX          5A  B 17 39DSPATR(PR)
     A                                      OVRDTA
     A            N999999        7A  B 17 45DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPTI    12A  B 17 53DSPATR(PR)
     A                                      OVRDTA
     A            REFDAT         6A  B 17 67DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-HELP SCREEN f7-DELETE FU-
     A                                      NCTION f3-EXIT                     -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R EXCHANGES2
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  3  1':'
     A                                  3 23'E  X  C  H  A  N  G  E    R  A  T'
     A                                  3 58'E'
     A                                  4  1':'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  6 25'A D D  /  D E L E T E   O N L Y'
     A                                  7  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  8  1':'
     A                                  9  1':'
     A                                  9 13'ENTER FOREIGN CURRENCY CODE :'
     A                                 10  1':'
     A                                 11  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 12  1':'
     A                                 13  1':'
     A                                 14  1':'
     A                                 15  1':'
     A                                 15 13'ONE UNIT LOCAL CURRENCY = ????????'
     A                                 15 49'FOREIGN CURRENCY'
     A                                 16  1':'
     A                                 17  1':'
     A                                 17 18'ONE'
     A                                 17 37'='
     A                                 18  1':'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            CO             2A  B  9 45DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIO    12A  B 17 22DSPATR(PR)
     A                                      OVRDTA
     A            XXXXX          5Y 0B 17 39DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22
     AO 97 96                               DSPATR(PC)
     A            N999999        7Y 0B 17 45DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            FDESCRIPTI    12A  B 17 53DSPATR(PR)
     A                                      OVRDTA
     A            REFDAT         6A  B 17 67DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-HELP SCREEN f7-DELETE FU-
     A                                      NCTION f3-EXIT                     -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FLLOWUP
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 79':'
     A                                  3  1':'
     A                                  3 17'P U R C H A S E   O R D E R   F O'
     A                                  3 51'L L O W U P'
     A                                  3 79':'
     A                                  4  1':'
     A                                  4 79':'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  6 79':'
     A                                  7  1':'
     A                                  7 79':'
     A                                  8  1':'
     A                                  8 13'STANDARD INSTRUCTIONS FOR PRINTING'
     A                                  8 48'OF FOLLOWUPS'
     A                                  8 79':'
     A                                  9  1':'
     A                                  9 79':'
     A                                 10  1':'
     A                                 10 79':'
     A                                 11  1':'
     A                                 11 79':'
     A                                 12  1':'
     A                                 12 13'THE STANDARD INSTRUCTIONS CHOOSEN'
     A                                 12 47'HERE WILL BE USED'
     A                                 12 79':'
     A                                 13  1':'
     A                                 13 13'WHEN PRINTING YOUR FOLLOWUPS BUT C-
     A                                      AN BE OVERRIDDEN.'
     A                                 13 79':'
     A                                 14  1':'
     A                                 14 13'ENTER "A" OR "B" IN THE 1 CHARACTE-
     A                                      R BOX PRECEDING'
     A                                 14 79':'
     A                                 15  1':'
     A                                 15 13'EVERY STANDARD INSTRUCTION SELECTE-
     A                                      D.'
     A                                 15 79':'
     A                                 16  1':'
     A                                 16 13'"A" DENOTES PRINT INSTRUCTION AFTE-
     A                                      R THE ITEMS.'
     A                                 16 79':'
     A                                 17  1':'
     A                                 17 13'"B" DENOTES PRINT INSTRUCTION BEFO-
     A                                      RE THE ITEMS.'
     A                                 17 79':'
     A                                 18  1':'
     A                                 18 13'DEFAULT IS "B" PRINT INSTRUCTION B-
     A                                      EFORE ITEMS.'
     A                                 18 79':'
     A                                 19  1':'
     A                                 19 79':'
     A                                 20  1':'
     A                                 20 79':'
     A                                 21  1':'
     A                                 21 79':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            A              1A  B 10 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03
     AO 97 96                               DSPATR(PC)
     A            S1             3A  B 10 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            B              1A  B 10 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            S2             3A  B 10 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            C              1A  B 10 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            S3             3A  B 10 41DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            MSGLINE       79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT PROGRAM            -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FOBCODES
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 28'F  O  B   C  O  D  E  S'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 22'A  D  D    F  O  B    C  O  D  E'
     A                                  4 56'S'
     A                                  5  1':'
     A                                  6  1':'
     A                                  6 24'FOB CODES'
     A                                  6 51'DESCRIPTION'
     A                                  7  1':'
     A                                  8  1':'
     A                                  9  1':'
     A                                 10  1':'
     A                                 11  1':'
     A                                 12  1':'
     A                                 13  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 14  1':'
     A                                 14 17'M O D I F Y   A   D E S C R I P T'
     A                                 14 51'I O N   O N L Y'
     A                                 15  1':'
     A                                 16  1':'
     A                                 17  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 18  1':'
     A                                 18 20'D  E  L  E  T  E    F  O  B   C  O'
     A                                 18 56'D  E  S'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            F1             2A  B  8 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14
     AO 97 96                               DSPATR(PC)
     A            DESCRIPTIO    20A  B  8 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            F2             2A  B 10 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            DESCRIPTI2    20A  B 10 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            F3             2A  B 12 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            DESCRIPTI3    20A  B 12 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            F4             2A  B 16 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            DESCRIPTI4    20A  B 16 47DSPATR(PR)
     A                                      OVRDTA
     A            F5             2A  B 20 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            DESCRIPTI5    20A  B 20 47DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELIN    79A  B 23  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FOBCODESD
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 28'F  O  B   C  O  D  E  S'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 22'A  D  D    F  O  B    C  O  D  E'
     A                                  4 56'S'
     A                                  5  1':'
     A                                  6  1':'
     A                                  6 24'FOB CODES'
     A                                  6 51'DESCRIPTION'
     A                                  7  1':'
     A                                  8  1':'
     A                                  9  1':'
     A                                 10  1':'
     A                                 11  1':'
     A                                 12  1':'
     A                                 13  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 14  1':'
     A                                 14 17'M O D I F Y   A   D E S C R I P T'
     A                                 14 51'I O N   O N L Y'
     A                                 15  1':'
     A                                 16  1':'
     A                                 17  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 18  1':'
     A                                 18 20'D  E  L  E  T  E    F  O  B   C  O'
     A                                 18 56'D  E  S'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            F1             2A  B  8 27DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIO    20A  B  8 47DSPATR(PR)
     A                                      OVRDTA
     A            F2             2A  B 10 27DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI2    20A  B 10 47DSPATR(PR)
     A                                      OVRDTA
     A            F3             2A  B 12 27DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI3    20A  B 12 47DSPATR(PR)
     A                                      OVRDTA
     A            F4             2A  B 16 27DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI4    20A  B 16 47DSPATR(PR)
     A                                      OVRDTA
     A            F5             2A  B 20 27DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI5    20A  B 20 47DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELIN    79A  B 23  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21
     AO 97 96                               DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FOBCODESM
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 28'F  O  B   C  O  D  E  S'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 22'A  D  D    F  O  B    C  O  D  E'
     A                                  4 56'S'
     A                                  5  1':'
     A                                  6  1':'
     A                                  6 24'FOB CODES'
     A                                  6 51'DESCRIPTION'
     A                                  7  1':'
     A                                  8  1':'
     A                                  9  1':'
     A                                 10  1':'
     A                                 11  1':'
     A                                 12  1':'
     A                                 13  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 14  1':'
     A                                 14 17'M O D I F Y   A   D E S C R I P T'
     A                                 14 51'I O N   O N L Y'
     A                                 15  1':'
     A                                 16  1':'
     A                                 17  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 18  1':'
     A                                 18 20'D  E  L  E  T  E    F  O  B   C  O'
     A                                 18 56'D  E  S'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            F1             2A  B  8 27DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIO    20A  B  8 47DSPATR(PR)
     A                                      OVRDTA
     A            F2             2A  B 10 27DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI2    20A  B 10 47DSPATR(PR)
     A                                      OVRDTA
     A            F3             2A  B 12 27DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI3    20A  B 12 47DSPATR(PR)
     A                                      OVRDTA
     A            F4             2A  B 16 27DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI4    20A  B 16 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11
     AO 97 96                               DSPATR(PC)
     A            F5             2A  B 20 27DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI5    20A  B 20 47DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELIN    79A  B 23  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HELP
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 79':'
     A                                  3  1':'
     A                                  3 12'THE CODE CATALOGS PROGRAM HAVE LAN-
     A                                      GUAGE OPTIONS AND VALIDATE THE   :'
     A                                  4  1':     LANGUAGE CHOOSEN AGAINST THE-
     A                                      SE LANGUAGES DEFINED FOR INDIVIDUAL-
     A                                       PLANTS. :'
     A                                  5  1':     WHEN THE USER ENTERS AN INVA-
     A                                      LID LANGUAGE, THE CATALOG PROGRAMS'
     A                                  5 70'DEFAULT  :'
     A                                  6  1':     TO THE PRIMARY LANGUAGE.  SE-
     A                                      COND AND THIRD LANGUAGES ARE OPTION-
     A                                      AL.      :'
     A                                  7  1':'
     A                                  7 79':'
     A                                  8  1':'
     A                                  8 29'VALID LANGUAGES ARE :'
     A                                  8 79':'
     A                                  9  1':'
     A                                  9 79':'
     A                                 10  1':'
     A                                 10 30'001    AMERICAN'
     A                                 10 79':'
     A                                 11  1':'
     A                                 11 30'002    CANADIAN-FRENCH'
     A                                 11 79':'
     A                                 12  1':'
     A                                 12 30'005    ENGLISH'
     A                                 12 79':'
     A                                 13  1':'
     A                                 13 30'007    FRENCH'
     A                                 13 79':'
     A                                 14  1':'
     A                                 14 30'008    GERMAN'
     A                                 14 79':'
     A                                 15  1':'
     A                                 15 30'009    ITALIAN'
     A                                 15 79':'
     A                                 16  1':'
     A                                 16 30'011    PORTUGUESE'
     A                                 16 79':'
     A                                 17  1':'
     A                                 17 30'012    SPANISH'
     A                                 17 79':'
     A                                 18  1':'
     A                                 18 79':'
     A                                 19  1':'
     A                                 19 79':'
     A                                 20  1':'
     A                                 20 79':'
     A                                 21  1':'
     A                                 21 79':'
     A                                 22  1':'
     A                                 22 79':'
     A                                 23  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HELP2
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 23'P  A  Y  M  E  N  T    T  E  R  M'
     A                                  2 58'S'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1': EXAMPLE:  (1)  1% DISCOUNT NET 3-
     A                                      0 DAYS    (2)   PROX 15TH & 25TH'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  6 27'D I S C O U N T   A M O U N T'
     A                                  7  1':'
     A                                  8  1':'
     A                                  8 13'CODE'
     A                                  8 30'DESCRIPTION'
     A                                  8 57'NUMERIC VALUE'
     A                                  9  1':     (USER ASSIGNED)      (FREE V-
     A                                      ERBAGE)'
     A                                  9 52'(ACC. % - 4 DEC. PLACES)    '
     A                                 10  1':'
     A                                 11  1': (1)'
     A                                 11 14'1'
     A                                 11 29'1 %   DISCOUNT'
     A                                 11 58'1.0000'
     A                                 12  1': (2)'
     A                                 12 14'2'
     A                                 12 29'NO    DISCOUNT'
     A                                 12 58'0.0000'
     A                                 13  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 14  1':'
     A                                 14 15'T I M E   F R A M E   O F  D I S C'
     A                                 14 50'O U N T (DUE DATE)'
     A                                 15  1':'
     A                                 15 65'MULTIPLE'
     A                                 16  1':      CODE'
     A                                 16 19'DESCRIPTION'
     A                                 16 37'DAYS/PROX   FLAG      DAYS/PROX'
     A                                 16 71'FLAG     '
     A                                 17  1': (USER ASSIGN) (FREE VERBAGE)'
     A                                 17 37'(3 DIG)  (PROX = P,  (IF FLAG = P,'
     A                                 17 72'THEN    '
     A                                 18  1':'
     A                                 18 47'DAYS = D,   ANOTHER DATE CAN     '
     A                                 19  1':'
     A                                 19 47'N/A  = N)   BE SELECTED)'
     A                                 20  1':'
     A                                 21  1': (1)    A'
     A                                 21 19'NET 30 DAYS'
     A                                 21 39'30'
     A                                 21 51'D'
     A                                 22  1': (2)    B'
     A                                 22 19'PROX 15TH & 25TH    15'
     A                                 22 51'P'
     A                                 22 64'25'
     A                                 22 74'P     '
     A                                 23  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HELP3
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 79':'
     A                                  3  1':'
     A                                  3 12'THE FOLLOWING REQUISITION HOLD STA-
     A                                      TUS ARE INITIALIZED IN YOUR      :'
     A                                  4  1':     SYSTEM.  THESE CAN BE MODIFI-
     A                                      ED OR DELETED AT YOUR DISCRETION.'
     A                                  4 79':'
     A                                  5  1':'
     A                                  5 12'THE REQUISITION HOLD STATUS ARE US-
     A                                      ED FOR REQUISITIONS THAT ARE     :'
     A                                  6  1':     PLACED ON HOLD IN MATERIALS'
     A                                  6 35'CONTROL OR PURCHASING.'
     A                                  6 79':'
     A                                  7  1':'
     A                                  7 79':'
     A                                  8  1':'
     A                                  8 79':'
     A                                  9  1':'
     A                                  9 25'CODE'
     A                                  9 40'DESCRIPTION'
     A                                  9 79':'
     A                                 10  1':'
     A                                 10 79':'
     A                                 11  1':'
     A                                 11 26'MC'
     A                                 11 41'MTL. CTL.'
     A                                 11 79':'
     A                                 12  1':'
     A                                 12 26'QU'
     A                                 12 41'QUOTE'
     A                                 12 79':'
     A                                 13  1':'
     A                                 13 26'BD'
     A                                 13 41'PURCHASING'
     A                                 13 79':'
     A                                 14  1':'
     A                                 14 26'EA'
     A                                 14 41'ENG. APPR.'
     A                                 14 79':'
     A                                 15  1':'
     A                                 15 26'RQ'
     A                                 15 41'MIN. REQ.'
     A                                 15 79':'
     A                                 16  1':'
     A                                 16 26'MR'
     A                                 16 41'MAINT. REP'
     A                                 16 79':'
     A                                 17  1':'
     A                                 17 26'DR'
     A                                 17 41'DRAWING'
     A                                 17 79':'
     A                                 18  1':'
     A                                 18 79':'
     A                                 19  1':'
     A                                 19 79':'
     A                                 20  1':'
     A                                 20 79':'
     A                                 21  1':'
     A                                 21 79':'
     A                                 22  1':'
     A                                 22 79':'
     A                                 23  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HELP4
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 79':'
     A                                  3  1':'
     A                                  3 12'THE FOLLOWING CURRENCY CODES ARE I-
     A                                      NITIALIZED IN YOUR SYSTEM.'
     A                                  3 79':'
     A                                  4  1':     THESE CURRENCY CODES MAY NOT'
     A                                  4 36'BE MODIFIED OR TAMPERED WITH IN AN-
     A                                      Y'
     A                                  4 79':'
     A                                  5  1':     WAY.  YOU MAY USE THE CURREN-
     A                                      CY ADD SCREEN TO ADD NEW CURRENCIES-
     A                                      '
     A                                  5 79':'
     A                                  6  1':     THAT DO NOT EXIST IN THE PRE-
     A                                      SENT SYSTEM.'
     A                                  6 79':'
     A                                  7  1':'
     A                                  7 79':'
     A                                  8  1': CODE DESCRIPTION   CODE DESCRIPT-
     A                                      ION   CODE DESCRIPTION   CODE DESCR-
     A                                      IPTION   :'
     A                                  9  1':'
     A                                  9 79':'
     A                                 10  1':'
     A                                 10 79':'
     A                                 11  1':'
     A                                 11 79':'
     A                                 12  1':'
     A                                 12 79':'
     A                                 13  1':'
     A                                 13 79':'
     A                                 14  1':'
     A                                 14 79':'
     A                                 15  1':'
     A                                 15 79':'
     A                                 16  1':'
     A                                 16 79':'
     A                                 17  1':'
     A                                 17 79':'
     A                                 18  1':'
     A                                 18 79':'
     A                                 19  1':'
     A                                 19 79':'
     A                                 20  1':'
     A                                 20 79':'
     A                                 21  1':'
     A                                 21 79':'
     A                                 22  1':'
     A                                 22 79':'
     A                                 23  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            A              2A  B 10  4DSPATR(PR)
     A                                      OVRDTA
     A            DESC1         12A  B 10  8DSPATR(PR)
     A                                      OVRDTA
     A            B              2A  B 10 23DSPATR(PR)
     A                                      OVRDTA
     A            DESC2         12A  B 10 27DSPATR(PR)
     A                                      OVRDTA
     A            C              2A  B 10 42DSPATR(PR)
     A                                      OVRDTA
     A            DESC3         12A  B 10 46DSPATR(PR)
     A                                      OVRDTA
     A            D1             2A  B 10 61DSPATR(PR)
     A                                      OVRDTA
     A            DESC37        12A  B 10 65DSPATR(PR)
     A                                      OVRDTA
     A            D              2A  B 11  4DSPATR(PR)
     A                                      OVRDTA
     A            DESC4         12A  B 11  8DSPATR(PR)
     A                                      OVRDTA
     A            E              2A  B 11 23DSPATR(PR)
     A                                      OVRDTA
     A            DESC5         12A  B 11 27DSPATR(PR)
     A                                      OVRDTA
     A            F              2A  B 11 42DSPATR(PR)
     A                                      OVRDTA
     A            DESC6         12A  B 11 46DSPATR(PR)
     A                                      OVRDTA
     A            D2             2A  B 11 61DSPATR(PR)
     A                                      OVRDTA
     A            DESC38        12A  B 11 65DSPATR(PR)
     A                                      OVRDTA
     A            G              2A  B 12  4DSPATR(PR)
     A                                      OVRDTA
     A            DESC7         12A  B 12  8DSPATR(PR)
     A                                      OVRDTA
     A            H              2A  B 12 23DSPATR(PR)
     A                                      OVRDTA
     A            DESC8         12A  B 12 27DSPATR(PR)
     A                                      OVRDTA
     A            I              2A  B 12 42DSPATR(PR)
     A                                      OVRDTA
     A            DESC9         12A  B 12 46DSPATR(PR)
     A                                      OVRDTA
     A            D3             2A  B 12 61DSPATR(PR)
     A                                      OVRDTA
     A            DESC39        12A  B 12 65DSPATR(PR)
     A                                      OVRDTA
     A            A1             2A  B 13  4DSPATR(PR)
     A                                      OVRDTA
     A            DESC10        12A  B 13  8DSPATR(PR)
     A                                      OVRDTA
     A            A2             2A  B 13 23DSPATR(PR)
     A                                      OVRDTA
     A            DESC11        12A  B 13 27DSPATR(PR)
     A                                      OVRDTA
     A            A3             2A  B 13 42DSPATR(PR)
     A                                      OVRDTA
     A            DESC12        12A  B 13 46DSPATR(PR)
     A                                      OVRDTA
     A            D4             2A  B 13 61DSPATR(PR)
     A                                      OVRDTA
     A            DESC40        12A  B 13 65DSPATR(PR)
     A                                      OVRDTA
     A            A4             2A  B 14  4DSPATR(PR)
     A                                      OVRDTA
     A            DESC13        12A  B 14  8DSPATR(PR)
     A                                      OVRDTA
     A            A5             2A  B 14 23DSPATR(PR)
     A                                      OVRDTA
     A            DESC14        12A  B 14 27DSPATR(PR)
     A                                      OVRDTA
     A            A6             2A  B 14 42DSPATR(PR)
     A                                      OVRDTA
     A            DESC15        12A  B 14 46DSPATR(PR)
     A                                      OVRDTA
     A            D5             2A  B 14 61DSPATR(PR)
     A                                      OVRDTA
     A            DESC41        12A  B 14 65DSPATR(PR)
     A                                      OVRDTA
     A            A7             2A  B 15  4DSPATR(PR)
     A                                      OVRDTA
     A            DESC16        12A  B 15  8DSPATR(PR)
     A                                      OVRDTA
     A            A8             2A  B 15 23DSPATR(PR)
     A                                      OVRDTA
     A            DESC17        12A  B 15 27DSPATR(PR)
     A                                      OVRDTA
     A            A9             2A  B 15 42DSPATR(PR)
     A                                      OVRDTA
     A            DESC18        12A  B 15 46DSPATR(PR)
     A                                      OVRDTA
     A            D6             2A  B 15 61DSPATR(PR)
     A                                      OVRDTA
     A            DESC42        12A  B 15 65DSPATR(PR)
     A                                      OVRDTA
     A            B1             2A  B 16  4DSPATR(PR)
     A                                      OVRDTA
     A            DESC19        12A  B 16  8DSPATR(PR)
     A                                      OVRDTA
     A            B2             2A  B 16 23DSPATR(PR)
     A                                      OVRDTA
     A            DESC20        12A  B 16 27DSPATR(PR)
     A                                      OVRDTA
     A            B3             2A  B 16 42DSPATR(PR)
     A                                      OVRDTA
     A            DESC21        12A  B 16 46DSPATR(PR)
     A                                      OVRDTA
     A            D7             2A  B 16 61DSPATR(PR)
     A                                      OVRDTA
     A            DESC43        12A  B 16 65DSPATR(PR)
     A                                      OVRDTA
     A            B4             2A  B 17  4DSPATR(PR)
     A                                      OVRDTA
     A            DESC22        12A  B 17  8DSPATR(PR)
     A                                      OVRDTA
     A            B5             2A  B 17 23DSPATR(PR)
     A                                      OVRDTA
     A            DESC23        12A  B 17 27DSPATR(PR)
     A                                      OVRDTA
     A            B6             2A  B 17 42DSPATR(PR)
     A                                      OVRDTA
     A            DESC24        12A  B 17 46DSPATR(PR)
     A                                      OVRDTA
     A            D8             2A  B 17 61DSPATR(PR)
     A                                      OVRDTA
     A            DESC44        12A  B 17 65DSPATR(PR)
     A                                      OVRDTA
     A            B7             2A  B 18  4DSPATR(PR)
     A                                      OVRDTA
     A            DESC25        12A  B 18  8DSPATR(PR)
     A                                      OVRDTA
     A            B8             2A  B 18 23DSPATR(PR)
     A                                      OVRDTA
     A            DESC26        12A  B 18 27DSPATR(PR)
     A                                      OVRDTA
     A            B9             2A  B 18 42DSPATR(PR)
     A                                      OVRDTA
     A            DESC27        12A  B 18 46DSPATR(PR)
     A                                      OVRDTA
     A            D9             2A  B 18 61DSPATR(PR)
     A                                      OVRDTA
     A            DESC45        12A  B 18 65DSPATR(PR)
     A                                      OVRDTA
     A            C1             2A  B 19  4DSPATR(PR)
     A                                      OVRDTA
     A            DESC28        12A  B 19  8DSPATR(PR)
     A                                      OVRDTA
     A            C2             2A  B 19 23DSPATR(PR)
     A                                      OVRDTA
     A            DESC29        12A  B 19 27DSPATR(PR)
     A                                      OVRDTA
     A            C3             2A  B 19 42DSPATR(PR)
     A                                      OVRDTA
     A            DESC30        12A  B 19 46DSPATR(PR)
     A                                      OVRDTA
     A            E1             2A  B 19 61DSPATR(PR)
     A                                      OVRDTA
     A            DESC46        12A  B 19 65DSPATR(PR)
     A                                      OVRDTA
     A            C4             2A  B 20  4DSPATR(PR)
     A                                      OVRDTA
     A            DESC31        12A  B 20  8DSPATR(PR)
     A                                      OVRDTA
     A            C5             2A  B 20 23DSPATR(PR)
     A                                      OVRDTA
     A            DESC32        12A  B 20 27DSPATR(PR)
     A                                      OVRDTA
     A            C6             2A  B 20 42DSPATR(PR)
     A                                      OVRDTA
     A            DESC33        12A  B 20 46DSPATR(PR)
     A                                      OVRDTA
     A            E2             2A  B 20 61DSPATR(PR)
     A                                      OVRDTA
     A            DESC47        12A  B 20 65DSPATR(PR)
     A                                      OVRDTA
     A            C7             2A  B 21  4DSPATR(PR)
     A                                      OVRDTA
     A            DESC34        12A  B 21  8DSPATR(PR)
     A                                      OVRDTA
     A            C8             2A  B 21 23DSPATR(PR)
     A                                      OVRDTA
     A            DESC35        12A  B 21 27DSPATR(PR)
     A                                      OVRDTA
     A            C9             2A  B 21 42DSPATR(PR)
     A                                      OVRDTA
     A            DESC36        12A  B 21 46DSPATR(PR)
     A                                      OVRDTA
     A            E3             2A  B 21 61DSPATR(PR)
     A                                      OVRDTA
     A            DESC48        12A  B 21 65DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HELP5
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 79':'
     A                                  3  1':'
     A                                  3 12'THE FOLLOWING CURRENCY CODES ARE I-
     A                                      NITIALIZED IN YOUR SYSTEM.'
     A                                  3 79':'
     A                                  4  1':     THESE CURRENCY CODES MAY NOT'
     A                                  4 36'BE MODIFIED OR TAMPERED WITH IN AN-
     A                                      Y'
     A                                  4 79':'
     A                                  5  1':     WAY.  YOU MAY USE THE CURREN-
     A                                      CY ADD SCREEN TO ADD NEW CURRENCIES-
     A                                      '
     A                                  5 79':'
     A                                  6  1':     THAT DO NOT EXIST IN THE PRE-
     A                                      SENT SYSTEM.'
     A                                  6 79':'
     A                                  7  1':'
     A                                  7 79':'
     A                                  8  1': CURR CODE   EDI CODE   DESCRIPTI-
     A                                      ON      CURR CODE   EDI CODE   DESC-
     A                                      RIPTION  :'
     A                                  9  1':'
     A                                  9 79':'
     A                                 10  1':'
     A                                 10 79':'
     A                                 11  1':'
     A                                 11 79':'
     A                                 12  1':'
     A                                 12 79':'
     A                                 13  1':'
     A                                 13 79':'
     A                                 14  1':'
     A                                 14 79':'
     A                                 15  1':'
     A                                 15 79':'
     A                                 16  1':'
     A                                 16 79':'
     A                                 17  1':'
     A                                 17 79':'
     A                                 18  1':'
     A                                 18 79':'
     A                                 19  1':'
     A                                 19 79':'
     A                                 20  1':'
     A                                 20 79':'
     A                                 21  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            C1             2A  B 10  6DSPATR(PR)
     A                                      OVRDTA
     A            E01            3A  B 10 17DSPATR(PR)
     A                                      OVRDTA
     A            DESC01        12A  B 10 26DSPATR(PR)
     A                                      OVRDTA
     A            CC             2A  B 10 46DSPATR(PR)
     A                                      OVRDTA
     A            E12            3A  B 10 57DSPATR(PR)
     A                                      OVRDTA
     A            DESC12        12A  B 10 66DSPATR(PR)
     A                                      OVRDTA
     A            C2             2A  B 11  6DSPATR(PR)
     A                                      OVRDTA
     A            E02            3A  B 11 17DSPATR(PR)
     A                                      OVRDTA
     A            DESC02        12A  B 11 26DSPATR(PR)
     A                                      OVRDTA
     A            CD             2A  B 11 46DSPATR(PR)
     A                                      OVRDTA
     A            E13            3A  B 11 57DSPATR(PR)
     A                                      OVRDTA
     A            DESC13        12A  B 11 66DSPATR(PR)
     A                                      OVRDTA
     A            C3             2A  B 12  6DSPATR(PR)
     A                                      OVRDTA
     A            E03            3A  B 12 17DSPATR(PR)
     A                                      OVRDTA
     A            DESC03        12A  B 12 26DSPATR(PR)
     A                                      OVRDTA
     A            CE             2A  B 12 46DSPATR(PR)
     A                                      OVRDTA
     A            E14            3A  B 12 57DSPATR(PR)
     A                                      OVRDTA
     A            DESC14        12A  B 12 66DSPATR(PR)
     A                                      OVRDTA
     A            C4             2A  B 13  6DSPATR(PR)
     A                                      OVRDTA
     A            E04            3A  B 13 17DSPATR(PR)
     A                                      OVRDTA
     A            DESC04        12A  B 13 26DSPATR(PR)
     A                                      OVRDTA
     A            CF             2A  B 13 46DSPATR(PR)
     A                                      OVRDTA
     A            E15            3A  B 13 57DSPATR(PR)
     A                                      OVRDTA
     A            DESC15        12A  B 13 66DSPATR(PR)
     A                                      OVRDTA
     A            C5             2A  B 14  6DSPATR(PR)
     A                                      OVRDTA
     A            E05            3A  B 14 17DSPATR(PR)
     A                                      OVRDTA
     A            DESC05        12A  B 14 26DSPATR(PR)
     A                                      OVRDTA
     A            CG             2A  B 14 46DSPATR(PR)
     A                                      OVRDTA
     A            E16            3A  B 14 57DSPATR(PR)
     A                                      OVRDTA
     A            DESC16        12A  B 14 66DSPATR(PR)
     A                                      OVRDTA
     A            C6             2A  B 15  6DSPATR(PR)
     A                                      OVRDTA
     A            E06            3A  B 15 17DSPATR(PR)
     A                                      OVRDTA
     A            DESC06        12A  B 15 26DSPATR(PR)
     A                                      OVRDTA
     A            CH             2A  B 15 46DSPATR(PR)
     A                                      OVRDTA
     A            E17            3A  B 15 57DSPATR(PR)
     A                                      OVRDTA
     A            DESC17        12A  B 15 66DSPATR(PR)
     A                                      OVRDTA
     A            C7             2A  B 16  6DSPATR(PR)
     A                                      OVRDTA
     A            E07            3A  B 16 17DSPATR(PR)
     A                                      OVRDTA
     A            DESC07        12A  B 16 26DSPATR(PR)
     A                                      OVRDTA
     A            CI             2A  B 16 46DSPATR(PR)
     A                                      OVRDTA
     A            E18            3A  B 16 57DSPATR(PR)
     A                                      OVRDTA
     A            DESC18        12A  B 16 66DSPATR(PR)
     A                                      OVRDTA
     A            C8             2A  B 17  6DSPATR(PR)
     A                                      OVRDTA
     A            E08            3A  B 17 17DSPATR(PR)
     A                                      OVRDTA
     A            DESC08        12A  B 17 26DSPATR(PR)
     A                                      OVRDTA
     A            CJ             2A  B 17 46DSPATR(PR)
     A                                      OVRDTA
     A            E19            3A  B 17 57DSPATR(PR)
     A                                      OVRDTA
     A            DESC19        12A  B 17 66DSPATR(PR)
     A                                      OVRDTA
     A            C9             2A  B 18  6DSPATR(PR)
     A                                      OVRDTA
     A            E09            3A  B 18 17DSPATR(PR)
     A                                      OVRDTA
     A            DESC09        12A  B 18 26DSPATR(PR)
     A                                      OVRDTA
     A            CK             2A  B 18 46DSPATR(PR)
     A                                      OVRDTA
     A            E20            3A  B 18 57DSPATR(PR)
     A                                      OVRDTA
     A            DESC20        12A  B 18 66DSPATR(PR)
     A                                      OVRDTA
     A            CA             2A  B 19  6DSPATR(PR)
     A                                      OVRDTA
     A            E10            3A  B 19 17DSPATR(PR)
     A                                      OVRDTA
     A            DESC10        12A  B 19 26DSPATR(PR)
     A                                      OVRDTA
     A            CL             2A  B 19 46DSPATR(PR)
     A                                      OVRDTA
     A            E21            3A  B 19 57DSPATR(PR)
     A                                      OVRDTA
     A            DESC21        12A  B 19 66DSPATR(PR)
     A                                      OVRDTA
     A            CB             2A  B 20  6DSPATR(PR)
     A                                      OVRDTA
     A            E11            3A  B 20 17DSPATR(PR)
     A                                      OVRDTA
     A            DESC11        12A  B 20 26DSPATR(PR)
     A                                      OVRDTA
     A            CM             2A  B 20 46DSPATR(PR)
     A                                      OVRDTA
     A            E22            3A  B 20 57DSPATR(PR)
     A                                      OVRDTA
     A            DESC22        12A  B 20 66DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELIN    79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELI2    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HELP6
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 17'E  D  I    P  A  Y  M  E  N  T'
     A                                  2 51'T  E  R  M  S'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 27'H  E  L  P    S  C  R  E  E  N'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  7  1':   ENTER 2 DIGIT EDI PAYMENT CODE'
     A                                  7 36': 1D'
     A                                  8  1':'
     A                                  9  1':'
     A                                 10  1':   1. PAYMENT TERMS TYPE ... : pl-
     A                                      ease enter payment type code .....'
     A                                 10 70': 01      '
     A                                 11  1':'
     A                                 12  1':   2. PAYMENT TIME REFERENCE : pl-
     A                                      ease enter payment type reference'
     A                                 12 70': 05      '
     A                                 13  1':'
     A                                 14  1':   3. TIME RELATION ........ : pl-
     A                                      ease enter time relation code ....'
     A                                 14 70': 03      '
     A                                 15  1':'
     A                                 16  1':   4. TYPE OF PERIOD ....... : pl-
     A                                      ease enter type of period code ...'
     A                                 16 70': D'
     A                                 17  1':'
     A                                 18  1':   5. NUMBER OF PERIODS .... : pl-
     A                                      ease enter the number of periods .'
     A                                 18 70': 60      '
     A                                 19  1':'
     A                                 20  1':   6. PERCENTAGE ........... : pl-
     A                                      ease enter the discount rate .....'
     A                                 20 70': 00.00   '
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HELP7
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 15'E  D  I    T  R  A  N  S  P  O  R'
     A                                  2 50'T    T  E  R  M  S'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 26'H  E  L  P    S  C  R  E  E  N'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  6 26'TRANSPORTATION PAYMENT METHOD'
     A                                  7  1':'
     A                                  8  1':CODE  DEFINITION'
     A                                  8 41'CODE  DEFINITION'
     A                                  9  1':'
     A                                 10  1': CA   ADVANCE COLLECT'
     A                                 10 42'PA   ADVANCE PREPAID'
     A                                 11  1': CC   COLLECT'
     A                                 11 42'PB   CUSTOMER PICKUP/BLACKHAUL'
     A                                 12  1': CF   COLLECT FREIGHT CREDITED BA-
     A                                      CK     PC   PREPAID BUT CHARGED TO'
     A                                 12 70'CUSTOMER  '
     A                                 13  1':      TO CUSTOMER'
     A                                 13 42'PO   PREPAID ONLY'
     A                                 14  1': DF   DEFINED BY BUYER & SELLER'
     A                                 14 42'PP   PREPAID BY SELLER'
     A                                 15  1': FO   FOB PORT OF CALL'
     A                                 15 42'PU   PICKUP'
     A                                 16  1': HP   HALF PREPAID'
     A                                 16 42'RC   RETURN CONT. FREIGHT PD BY CU-
     A                                      ST"R'
     A                                 17  1': IC   INFORMATION COPY,NO PAYMENT'
     A                                 17 36'DUE   RF   RETURN CONTAINER FREIGH-
     A                                      T FREE    '
     A                                 18  1': MX   MIXED'
     A                                 18 42'RS   RET.CONTAINER FREIGHT PAID SU-
     A                                      PP"R'
     A                                 19  1': NC   SERVICE FREIGHT,NO CHARGE'
     A                                 19 42'TP   THIRD PARTY PAY'
     A                                 20  1': NR   NON REVENUE'
     A                                 20 42'WC   WEIGHT CONDITION'
     A                                 21  1': NS   NOT SPECIFIED'
     A                                 21 42'ZZ   MUTUALLY DEFINED'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HELP8
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 15'E  D  I    T  R  A  N  S  P  O  R'
     A                                  2 50'T    T  E  R  M  S'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 26'H  E  L  P    S  C  R  E  E  N'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1': CODE DEFINITION      TERMS OF DE-
     A                                      LIVERY      CODE DEFINITION'
     A                                  7  1':'
     A                                  8  1': CAF  COST & FREIGHT TO DESTINATI-
     A                                      ON'
     A                                  8 47'FCT  FREIGHT CARRIAGE & INSURANCE'
     A                                  9  1': CAI  COST & INSURANCE TO NAMED D-
     A                                      ESTINATION'
     A                                  9 52'PAID TO'
     A                                 10  1': CIF  COST, INSURANCE FREIGHT TO'
     A                                 10 35'NAMED DEST. FOA  FOB AIRPORT- NAME-
     A                                      D AIRPORT  '
     A                                 11  1': CIP  FREIGHT,CARRIAGE,INSURANCE'
     A                                 11 35'TO DEST.'
     A                                 11 52'OF DEPARTURE'
     A                                 12  1': DAF  DELIVERY AT FRONTIER - NAME-
     A                                      D PLACE     FOB  FREE ON BOARD - NA-
     A                                      MED PORT  '
     A                                 13  1': DCP  FREIGHT, CARRIAGE PAID TO D-
     A                                      ESTINATION'
     A                                 13 52'ON SHIPMENT'
     A                                 14  1': DDP  DELIVERED DUTY PAID TO DEST-
     A                                      INATION     FOR  FREE ON RAIL - NAM-
     A                                      ED'
     A                                 15  1': EXQ  EX QUAY - DUTY PAID,NAMED P-
     A                                      ORT'
     A                                 15 52'DEPARTURE POINT (D.P)'
     A                                 16  1': EXS  EX SHIP - NAMED PORT OF DES-
     A                                      TINATION    FOS  FREE ON BOARD STOW-
     A                                      ED NAMED  '
     A                                 17  1': EXW  EX WORKS'
     A                                 17 52'PORT OF SHIPMENT'
     A                                 18  1': FAS  FREE ALONGSIDE SHIP - NAMED'
     A                                 18 36'PORT'
     A                                 18 47'FOT  FREE ON TRUCK - NAMED D.P.  '
     A                                 19  1': FCA  FREE CARRIER - NAMED PORT'
     A                                 19 47'FPC  FREE IN PIPELINE CONNECTION '
     A                                 20  1': FCI  FREIGHT CARRIAGE AND INSURA-
     A                                      NCE PAID TO FPC  NAMED PLACE.'
     A                                 21  1': FCP  FREIGHT CARRIAGE AND PAID T-
     A                                      O'
     A                                 21 47'ZZZ  MUTUALLY DEFINED'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HELP9
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 15'C  R  E  A  T  E    E  D  I    R'
     A                                  2 49'E  C  O  R  D  S'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 26'H  E  L  P    S  C  R  E  E  N'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  7  1':  IF VENCODE IS TYPED IN, ALL PUR-
     A                                      CHASE ORDERS FOR THE VENDOR ARE SEL-
     A                                      ECTED.    '
     A                                  8  1':'
     A                                  9  1':  IF PURCHASE ORDER IS TYPED IN,'
     A                                  9 35'ONLY ONE PURCHASE ORDER IS SELECTE-
     A                                      D.'
     A                                 10  1':'
     A                                 11  1':  IF BATCH NO. IS TYPED IN, PURCH-
     A                                      ASE ORDERS MARKED WITH INPUT BATCH'
     A                                 11 70'NUMBER    '
     A                                 12  1':  ARE PREPARED FOR RETRANSMISSION-
     A                                      .'
     A                                 13  1':'
     A                                 14  1':'
     A                                 15  1':'
     A                                 16  1':'
     A                                 17  1':'
     A                                 18  1':'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R MAINMENU
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 18'P L A N T   S E T   U P   M A I N'
     A                                  2 54'M E N U'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 25'SOFTWARE VERSION -'
     A                                  5  1':'
     A                                  6  1':'
     A                                  6 15'--  PLANT INFORMATION'
     A                                  6 50'-- QUOTE INFORMATION'
     A                                  7  1':'
     A                                  8  1':'
     A                                  8 15'--  PURCHASING MENU'
     A                                  8 50'-- STANDARD INSTRUCTIONS      '
     A                                  9  1':'
     A                                 10  1':'
     A                                 10 15'--  DOCK INFORMATION'
     A                                 10 50'-- STOREROOM DEPARTMENTS      '
     A                                 11  1':'
     A                                 12  1':'
     A                                 12 15'--  REQ. HOLD STATUSES'
     A                                 12 50'-- USER OPTIONS'
     A                                 13  1':'
     A                                 14  1':'
     A                                 14 15'--  PRINTER OPTIONS'
     A                                 14 50'-- MULTIPLE STOREROOM'
     A                                 15  1':'
     A                                 16  1':'
     A                                 16 15'--  MISCELLANEOUS'
     A                                 16 50'-- SYSTEM OPTIONS'
     A                                 17  1':'
     A                                 17 21'RECEIVING DEPT., ORDERING COST,'
     A                                 18  1':'
     A                                 18 21'CARRYING COST, TAX DISTRICTS,'
     A                                 19  1':'
     A                                 19 21'LANGUAGE OPTIONS, DATE AND DECIMAL'
     A                                 19 56'FORMATS.'
     A                                 20  1':'
     A                                 21  1':'
     A                                 21 10'****  ENTER AN "X" IN FRONT OF THE'
     A                                 21 45'DESIRED TOPIC'
     A                                 22  1':'
     A                                 22 43'OR PRESS "f3" TO EXIT  ****'
     A                                 23  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            RLSENO         6A  B  4 45DSPATR(PR)
     A                                      OVRDTA
     A            P              1A  B  6 12DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            Q              1A  B  6 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            U              1A  B  8 12DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            S              1A  B  8 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            O              1A  B 10 12DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            D              1A  B 10 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            R              1A  B 12 12DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            E              1A  B 12 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            I              1A  B 14 12DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            C              1A  B 14 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            M              1A  B 16 12DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            K              1A  B 16 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R MISCINFO
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 26'M I S C E L L A N E O U S'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  5  1':    RECEIVING DEPARTMENT :'
     A                                  5 44'LANGUAGE OPTIONS:'
     A                                  6  1':'
     A                                  6 45'** PRESS "f1" FOR HELP SCREEN **'
     A                                  7  1':    ORDERING COSTS'
     A                                  7 27':'
     A                                  7 46'PRIMARY   LANGUAGE :'
     A                                  8  1':     (USED TO CALCULATE EOQ)'
     A                                  8 46'SECONDARY LANGUAGE :'
     A                                  9  1':    CARRYING COSTS'
     A                                  9 27':'
     A                                 10  1':     (AS A PERCENTAGE OF UNIT COS-
     A                                      T)'
     A                                 10 44'EUROPEAN DECIMAL FORMAT (,) :'
     A                                 11  1':    EUROPEAN DATE FORMAT :'
     A                                 11 41'(PLACE AN "X" IN THE BOX IF YOU WO-
     A                                      ULD  '
     A                                 12  1':     (PLACE AN "X" IN THE BOX IF'
     A                                 12 35'YOU    LIKE  --.------ INSTEAD OF'
     A                                 12 69'------.--  '
     A                                 13  1':      WOULD LIKE DMY FORMAT)'
     A                                 14  1':'
     A                                 15  1':'
     A                                 16  1':    TAX DISTRICTS :      DISTRICT'
     A                                 16 52'ACCOUNT'
     A                                 17  1':'
     A                                 18  1':'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            RECV           4A  B  5 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18
     AO 97 96                               DSPATR(PC)
     A            OC             6Y 0B  7 30DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            PR1            3A  B  7 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            PR2            3A  B  8 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            CC             2Y 0B  9 30DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            X              1A  B 10 74DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            Y              1A  B 11 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            TAXDISTRIC    15A  B 17 24DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            TAXACCT1       9Y 0B 17 51DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            TAXDISTRI2    15A  B 18 24DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            TAXACCT2       9Y 0B 18 51DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            TAXDISTRI3    15A  B 19 24DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            TAXACCT3       9Y 0B 19 51DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            TAXDISTRI4    15A  B 20 24DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            TAXACCT4       9Y 0B 20 51DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            MESSAGELIN    79A  B 23  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-HELP SCREEN f3-EXIT     -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R MULTSTR
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 14'M U L T I P L E   S T O R E R O O'
     A                                  2 48'M   O P T I O N S'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  5  1':    IS THIS A MULTIPLE-STOREROOM'
     A                                  5 35'PLANT?'
     A                                  6  1':    (MULTIPLE STOREROOMS WITHIN A'
     A                                  6 36'SINGLE DATABASE)'
     A                                  7  1':'
     A                                  8  1':    IF MULTIPLE STOREROOM, IF A C-
     A                                      ODE HAS NO BIN PREFIXES (A-,'
     A                                  9  1':    B-, ETC), IS IT CONSIDERED A'
     A                                  9 35'SINGLE-STOREROOM CODE'
     A                                 10  1':    (DEFAULT TO THE MAIN STOREROO-
     A                                      M)?'
     A                                 11  1':'
     A                                 12  1':    IF MULTIPLE STOREROOM, ENTER'
     A                                 12 35'THE PRINTER NUMBERS FOR APPLICABLE'
     A                                 13  1':    STOREROOMS:'
     A                                 14  1':'
     A                                 14  9'STOREROOM  PRINTER NUMBER   NOTE:'
     A                                 14 43'FOR MULTIPLE STOREROOM, SINGLE'
     A                                 15  1':'
     A                                 15 43'DB PLANTS, THE BINS ARE PREFIXED'
     A                                 16  1':'
     A                                 16 43'WITH THE STOREROOM CODE:'
     A                                 17  1':'
     A                                 17 46'A-  STOREROOM A'
     A                                 18  1':'
     A                                 18 46'B-  STOREROOM B'
     A                                 19  1':'
     A                                 19 43'ETC, UP TO 6 BIN LOCATIONS.'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A            M              1A  B  5 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29
     AO 97 96                               DSPATR(PC)
     A            S              1A  B 10 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            A              2A  B 15 12DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            P1             2Y 0B 15 26DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            B              2A  B 16 12DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            P2             2Y 0B 16 26DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            C              2A  B 17 12DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            P3             2Y 0B 17 26DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            D              2A  B 18 12DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            P4             2Y 0B 18 26DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            E              2A  B 19 12DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            P5             2Y 0B 19 26DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            F              2A  B 20 12DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            P6             2Y 0B 20 26DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R PAYTERMS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  3  1':'
     A                                  3 23'P  A  Y  M  E  N  T    T  E  R  M'
     A                                  3 58'S'
     A                                  4  1':'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  7  1':'
     A                                  8  1':'
     A                                  9  1':'
     A                                  9 23'"f1"'
     A                                  9 35'--'
     A                                  9 44'HELP   SCREEN'
     A                                 10  1':'
     A                                 11  1':'
     A                                 11 23'"f2"'
     A                                 11 35'--'
     A                                 11 44'ADD    PAYMENT TERMS'
     A                                 12  1':'
     A                                 13  1':'
     A                                 13 23'"f8"'
     A                                 13 35'--'
     A                                 13 44'MODIFY PAYMENT TERMS'
     A                                 14  1':'
     A                                 15  1':'
     A                                 15 23'"f4"'
     A                                 15 35'--'
     A                                 15 44'DELETE PAYMENT TERMS'
     A                                 16  1':'
     A                                 17  1':'
     A                                 18  1':'
     A                                 19  1':'
     A                                 19 17'PRESS THE APPROPRIATE FUNCTION KEY'
     A                                 19 52'TO CONTINUE'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1':'
     A                                 23  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-HELP SCREEN f2-ADD FUNCT-
     A                                      ION f8-MODIFY FUNCTION f4-DELETE FU-
     A                                      NCTION f3-EXIT   ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R PAYTERMSA
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 23'P  A  Y  M  E  N  T    T  E  R  M'
     A                                  2 58'S'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 32'A D D   O N L Y'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  7  1':'
     A                                  7 27'D I S C O U N T   A M O U N T'
     A                                  8  1':'
     A                                  9  1':'
     A                                  9 13'CODE'
     A                                  9 30'DESCRIPTION'
     A                                  9 57'NUMERIC VALUE'
     A                                 10  1':'
     A                                 11  1':'
     A                                 12  1':'
     A                                 13  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 14  1':'
     A                                 15  1':'
     A                                 15 15'T I M E   F R A M E   O F  D I S C'
     A                                 15 50'O U N T (DUE DATE)'
     A                                 16  1':'
     A                                 17  1':'
     A                                 17 62'MUTIPLE'
     A                                 18  1':      CODE'
     A                                 18 19'DESCRIPTION'
     A                                 18 37'DAYS/PROX   FLAG    DAYS/PROX  FLA-
     A                                      G'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            C              1A  B 11 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06
     AO 97 96                               DSPATR(PC)
     A            DESCR          5A  B 11 33DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            NN             4Y02B 11 60CHECK(RZ)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            O              1A  B 20  9DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            DESCRIPTIO    18A  B 20 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            DP1            3Y 0B 20 40DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            F              1A  B 20 50DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            DP2            3Y 0B 20 60DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            L              1A  B 20 69DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            MESSAGELIN    79A  B 23  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-HELP SCREEN f3-EXIT     -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R PAYTERMSD
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 23'P  A  Y  M  E  N  T    T  E  R  M'
     A                                  2 58'S'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 28'D E L E T E   O N L Y'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  7  1':'
     A                                  7 27'D I S C O U N T   A M O U N T'
     A                                  8  1':'
     A                                  9  1':'
     A                                  9 13'CODE'
     A                                  9 30'DESCRIPTION'
     A                                  9 57'NUMERIC VALUE'
     A                                 10  1':'
     A                                 11  1':'
     A                                 12  1':'
     A                                 13  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 14  1':'
     A                                 15  1':'
     A                                 15 15'T I M E   F R A M E   O F  D I S C'
     A                                 15 50'O U N T (DUE DATE)'
     A                                 16  1':'
     A                                 17  1':'
     A                                 17 62'MUTIPLE'
     A                                 18  1':      CODE'
     A                                 18 19'DESCRIPTION'
     A                                 18 37'DAYS/PROX   FLAG    DAYS/PROX  FLA-
     A                                      G'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            C              1A  B 11 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06
     AO 97 96                               DSPATR(PC)
     A            DESCR          5A  B 11 33DSPATR(PR)
     A                                      OVRDTA
     A            NN             4Y02B 11 60CHECK(RZ)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            O              1A  B 20  9DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            DESCRIPTIO    18A  B 20 15DSPATR(PR)
     A                                      OVRDTA
     A            DP1            3A  B 20 40DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 20 50DSPATR(PR)
     A                                      OVRDTA
     A            DP2            3A  B 20 60DSPATR(PR)
     A                                      OVRDTA
     A            L              1A  B 20 69DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELIN    79A  B 23  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-HELP SCREEN f3-EXIT     -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R PAYTERMSDX
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 23'P  A  Y  M  E  N  T    T  E  R  M'
     A                                  2 58'S'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 28'D E L E T E   O N L Y'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  7  1':'
     A                                  7 27'D I S C O U N T   A M O U N T'
     A                                  8  1':'
     A                                  9  1':'
     A                                  9 13'CODE'
     A                                  9 30'DESCRIPTION'
     A                                  9 57'NUMERIC VALUE'
     A                                 10  1':'
     A                                 11  1':'
     A                                 12  1':'
     A                                 13  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 14  1':'
     A                                 15  1':'
     A                                 15 15'T I M E   F R A M E   O F  D I S C'
     A                                 15 50'O U N T (DUE DATE)'
     A                                 16  1':'
     A                                 17  1':'
     A                                 17 62'MUTIPLE'
     A                                 18  1':      CODE'
     A                                 18 19'DESCRIPTION'
     A                                 18 37'DAYS/PROX   FLAG    DAYS/PROX  FLA-
     A                                      G'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            C              1A  B 11 14DSPATR(PR)
     A                                      OVRDTA
     A            DESCR          5A  B 11 33DSPATR(PR)
     A                                      OVRDTA
     A            NN             4Y02B 11 60CHECK(RZ)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            O              1A  B 20  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIO    18A  B 20 15DSPATR(PR)
     A                                      OVRDTA
     A            DP1            3A  B 20 40DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 20 50DSPATR(PR)
     A                                      OVRDTA
     A            DP2            3A  B 20 60DSPATR(PR)
     A                                      OVRDTA
     A            L              1A  B 20 69DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELIN    79A  B 23  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03
     AO 97 96                               DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-HELP SCREEN f3-EXIT     -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R PAYTERMSM
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 23'P  A  Y  M  E  N  T    T  E  R  M'
     A                                  2 58'S'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 28'M O D I F Y   O N L Y'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  7  1':'
     A                                  7 27'D I S C O U N T   A M O U N T'
     A                                  8  1':'
     A                                  9  1':'
     A                                  9 13'CODE'
     A                                  9 30'DESCRIPTION'
     A                                  9 57'NUMERIC VALUE'
     A                                 10  1':'
     A                                 11  1':'
     A                                 12  1':'
     A                                 13  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 14  1':'
     A                                 15  1':'
     A                                 15 15'T I M E   F R A M E   O F  D I S C'
     A                                 15 50'O U N T (DUE DATE)'
     A                                 16  1':'
     A                                 17  1':'
     A                                 17 62'MUTIPLE'
     A                                 18  1':      CODE'
     A                                 18 19'DESCRIPTION'
     A                                 18 37'DAYS/PROX   FLAG    DAYS/PROX  FLA-
     A                                      G'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            C              1A  B 11 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06
     AO 97 96                               DSPATR(PC)
     A            DESCR          5A  B 11 33DSPATR(PR)
     A                                      OVRDTA
     A            NN             4Y02B 11 60CHECK(RZ)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            O              1A  B 20  9DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            DESCRIPTIO    18A  B 20 15DSPATR(PR)
     A                                      OVRDTA
     A            DP1            3A  B 20 40DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 20 50DSPATR(PR)
     A                                      OVRDTA
     A            DP2            3A  B 20 60DSPATR(PR)
     A                                      OVRDTA
     A            L              1A  B 20 69DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELIN    79A  B 23  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-HELP SCREEN f3-EXIT     -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R PAYTERMSMX
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 23'P  A  Y  M  E  N  T    T  E  R  M'
     A                                  2 58'S'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 28'M O D I F Y   O N L Y'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  7  1':'
     A                                  7 27'D I S C O U N T   A M O U N T'
     A                                  8  1':'
     A                                  9  1':'
     A                                  9 13'CODE'
     A                                  9 30'DESCRIPTION'
     A                                  9 57'NUMERIC VALUE'
     A                                 10  1':'
     A                                 11  1':'
     A                                 12  1':'
     A                                 13  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 14  1':'
     A                                 15  1':'
     A                                 15 15'T I M E   F R A M E   O F  D I S C'
     A                                 15 50'O U N T (DUE DATE)'
     A                                 16  1':'
     A                                 17  1':'
     A                                 17 62'MUTIPLE'
     A                                 18  1':      CODE'
     A                                 18 19'DESCRIPTION'
     A                                 18 37'DAYS/PROX   FLAG    DAYS/PROX  FLA-
     A                                      G'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            C              1A  B 11 14DSPATR(PR)
     A                                      OVRDTA
     A            DESCR          5A  B 11 33DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07
     AO 97 96                               DSPATR(PC)
     A            NN             4Y02B 11 60CHECK(RZ)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            O              1A  B 20  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIO    18A  B 20 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            DP1            3Y 0B 20 40DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            F              1A  B 20 50DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            DP2            3Y 0B 20 60DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            L              1A  B 20 69DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            MESSAGELIN    79A  B 23  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-HELP SCREEN f3-EXIT     -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R PLTINFO
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 26'P L A N T   I N F O R M A T I O N'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':   PLANT CODE :'
     A                                  4 34'PRIME :'
     A                                  4 60'TERRITORY :'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  6 32'PURCHASE ORDER ADDRESS'
     A                                  7  1':'
     A                                  8  1':    COMPANY NAME      :'
     A                                  9  1':    PLANT   NAME      :'
     A                                 10  1':    ADDRESS'
     A                                 10 24':'
     A                                 11  1':'
     A                                 12  1':'
     A                                 13  1':    RECEIVING LOCATION:'
     A                                 14  1':'
     A                                 14 10'VERBAGE'
     A                                 15  1':    PURCHASE DEPT FAX :'
     A                                 16  1':'
     A                                 16 11'TELEX NUMBER :'
     A                                 17  1':'
     A                                 17 32'ALTERNATE PURCHASE ORDER ADDRESS'
     A                                 18  1':    COMPANY NAME      :'
     A                                 19  1':    PLANT   NAME      :'
     A                                 20  1':    ADDRESS'
     A                                 20 24':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            COM            3A  B  4 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13
     AO 97 96                               DSPATR(PC)
     A            PRI            3A  B  4 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            TERR           4A  B  4 73DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMPANYNAM    35A  B  8 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            PLANTNAME     35A  B  9 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            ADDRESS1      35A  B 10 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            ADDRESS2      35A  B 11 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            SHIPPINGLO    29A  B 13 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            PURCHDEPTF    20A  B 15 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            PURCHDEPTT    20A  B 16 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            ALTCOMPANY    35A  B 18 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            ALTPLANTNA    35A  B 19 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            ALTADDRESS    35A  B 20 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            ALTADDRES2    35A  B 21 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R PODELINFO
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  3  1':      P U R C H A S E   O R D E R'
     A                                  3 38'D E L E T E   I N F O R M A T I O'
     A                                  3 72'N'
     A                                  4  1':'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  7  1':'
     A                                  8  1':'
     A                                  8  9'1.  ENTER THE NUMBER OF MONTHS THA-
     A                                      T PURCHASE ORDERS SHOULD BE'
     A                                  9  1':'
     A                                  9 13'KEPT IN THE CSIS DATABASE ONCE THE'
     A                                  9 48'PURCHASE ORDER HAS BEEN'
     A                                 10  1':'
     A                                 10 13'COMPLETED.'
     A                                 11  1':'
     A                                 12  1':'
     A                                 12  9'2.  ENTER THE NUMBER OF MONTHS THA-
     A                                      T PURCHASE ORDERS SHOULD BE'
     A                                 13  1':'
     A                                 13 13'KEPT IN THE HISTORY DATABASE BEFOR-
     A                                      E BEING MOVED TO TAPE.'
     A                                 14  1':'
     A                                 15  1':'
     A                                 16  1':'
     A                                 16  9'3.  ENTER "Y" IF USING THE INVOICE'
     A                                 16 44'PROCESSING SYSTEM PROVIDED'
     A                                 17  1':'
     A                                 17 13'BY CSIS.'
     A                                 18  1':'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            PO             2Y 0B 10 35DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04
     AO 97 96                               DSPATR(PC)
     A            HD             2Y 0B 14 35DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            Y              1A  B 17 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            MESSAGELIN    79A  B 23  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R POMENU
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 11'M I S C E L L A N E O U S    P U R'
     A                                  2 46'C H A S I N G    M E N U'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  5  1':'
     A                                  6  1':'
     A                                  7  1':'
     A                                  7 33'--  PAYMENT TERMS'
     A                                  8  1':'
     A                                  9  1':'
     A                                  9 33'--  BUYER INFORMATION'
     A                                 10  1':'
     A                                 11  1':'
     A                                 11 33'--  FOB CODES'
     A                                 12  1':'
     A                                 13  1':'
     A                                 13 33'--  UNIT OF MEASURES'
     A                                 14  1':'
     A                                 15  1':'
     A                                 15 33'--  CURRENCY CODE MENU'
     A                                 16  1':'
     A                                 17  1':'
     A                                 17 33'--  STANDARD FOLLOWUP INSTRUCTIONS'
     A                                 18  1':'
     A                                 19  1':'
     A                                 20  1':'
     A                                 20 10'****  ENTER AN "X" IN FRONT OF THE'
     A                                 20 45'DESIRED TOPIC'
     A                                 21  1':'
     A                                 21 43'OR PRESS "f3" TO EXIT  ****'
     A                                 22  1':'
     A                                 23  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            T              1A  B  7 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09
     AO 97 96                               DSPATR(PC)
     A            B              1A  B  9 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            F              1A  B 11 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            U              1A  B 13 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            C              1A  B 15 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            S              1A  B 17 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R PRNTINFO
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 24'P R I N T E R   O P T I O N S'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':    PRINTER OPTIONS:     **** ENT-
     A                                      ER THE SPOOLER NUMBER ****'
     A                                  5  1':'
     A                                  5  9'P.O. PRINTER'
     A                                  5 33':'
     A                                  5 40'P.O. PRINTER - MPE SPOOLED (Y/N)?:'
     A                                  6  1':'
     A                                  6  9'REQ. PRINTER'
     A                                  6 33':'
     A                                  6 53'- HP PRINTER  (Y/N)?:'
     A                                  7  1':'
     A                                  7  9'QUOTE PRINTER'
     A                                  7 33':'
     A                                  8  1':'
     A                                  8  9'INTERNAL ORDER PRINTERS :'
     A                                  9  1':'
     A                                 10  1':'
     A                                 10  9'STOREROOM PRINTER'
     A                                 11  1':'
     A                                 11  9'RAW MATERIAL PRINTER'
     A                                 11 40'("00" if not used)'
     A                                 12  1':    REQUISTION RELEASES:'
     A                                 13  1':'
     A                                 13  9'SHOULD THE REQUISTION RELEASES BE'
     A                                 13 43'PRINTED (Y/N)?  :'
     A                                 14  1':'
     A                                 14  9'IF YES, SHOULD THE RELEASES PRINT'
     A                                 14 43'ON A LOCAL OR P.O. PRINTER?'
     A                                 15  1':'
     A                                 15 14'(ENTER L FOR LOCAL OR P FOR P.O)'
     A                                 15 59':'
     A                                 16  1':'
     A                                 17  1':    CAPITAL ITEM RECEIPTS:'
     A                                 18  1':'
     A                                 18  9'SHOULD CAPITAL ITEM RECEIPTS (addi-
     A                                      tional data greater than 10,000)'
     A                                 19  1':'
     A                                 19  9'PRINT ON AN ADDITIONAL PRINTER (Y/-
     A                                      N)?'
     A                                 19 59':'
     A                                 20  1':'
     A                                 20  9'IF YES, ENTER SPOOLER NUMBER OF AD-
     A                                      DITIONAL PRINTER:'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            P1             2Y 0B  5 36DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16
     AO 97 96                               DSPATR(PC)
     A            S              1A  B  5 76DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            P2             2Y 0B  6 36DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            P              1A  B  6 76DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            P3             2Y 0B  7 36DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            P4             2Y 0B  8 36DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            P5             2Y 0B  9 36DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            P6             2Y 0B 10 36DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            P7             2Y 0B 11 36DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            Q              1A  B 13 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            X              1A  B 15 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            U              1A  B 19 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            U1             2Y 0B 20 61DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R PURCHMENU
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 26'P U R C H A S I N G    M E N U'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  5  1':'
     A                                  5 33'--  PAYMENT TERMS'
     A                                  6  1':'
     A                                  7  1':'
     A                                  7 33'--  BUYER INFORMATION'
     A                                  8  1':'
     A                                  9  1':'
     A                                  9 33'--  FOB CODES'
     A                                 10  1':'
     A                                 11  1':'
     A                                 11 33'--  UNIT OF MEASURES'
     A                                 12  1':'
     A                                 13  1':'
     A                                 13 33'--  CURRENCY CODE MENU'
     A                                 14  1':'
     A                                 15  1':'
     A                                 15 33'--  PURCHASE ORDER DELETION QUESTI-
     A                                      ON'
     A                                 16  1':'
     A                                 17  1':'
     A                                 17 33'--  STANDARD FOLLOWUP INSTRUCTIONS'
     A                                 18  1':'
     A                                 19  1':'
     A                                 19 10'****  ENTER AN "X" IN FRONT OF THE'
     A                                 19 45'DESIRED TOPIC'
     A                                 20  1':'
     A                                 20 43'OR PRESS "f3" TO EXIT  ****'
     A                                 21  1':'
     A                                 22  1':'
     A                                 23  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            T              1A  B  5 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09
     AO 97 96                               DSPATR(PC)
     A            B              1A  B  7 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            F              1A  B  9 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            U              1A  B 11 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            C              1A  B 13 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            Q              1A  B 15 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            S              1A  B 17 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R QUOTEINFO
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 26'Q U O T E   I N F O R M A T I O N'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1': QUOTE HEADING:'
     A                                  5  1':'
     A                                  6  1':'
     A                                  7  1': SECONDARY QUOTE HEADING:'
     A                                  8  1':'
     A                                  9  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 10  1': ALTERNATE QUOTATION RETURN ADDRE-
     A                                      SS:'
     A                                 11  1':'
     A                                 12  1':'
     A                                 13  1':'
     A                                 14  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 15  1': STANDARD INSTRUCTIONS TO VENDOR'
     A                                 15 35'FOR QUOTATION SHEET COMPLETION:'
     A                                 16  1':'
     A                                 17  1':'
     A                                 18  1':'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            HEADING1      72A  B  5  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23
     AO 97 96                               DSPATR(PC)
     A            HEADING       45A  B  8 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            ADDRESS1      60A  B 11 11DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            ADDRESS2      60A  B 12 11DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            ADDRESS3      60A  B 13 11DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            LINE1         72A  B 16  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            LINE2         72A  B 17  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            LINE3         72A  B 18  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            LINE4         72A  B 19  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            LINE5         72A  B 20  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            MSGLINE       79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R REQHOLDSTA
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 17'R E Q U I S I T I O N  H O L D  S'
     A                                  2 51'T A T U S E S'
     A                                  3  1':'
     A                                  4  1':*********  REQUSITION HOLD STATUS-
     A                                      ES FOR REQUISITIONS PLACED ON HOLD'
     A                                  4 71'*********'
     A                                  5  1':*********'
     A                                  5 23'IN MATERIAL CONTROL AND PURCHASING-
     A                                      .'
     A                                  5 71'*********'
     A                                  6  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  7  1':'
     A                                  8  1':'
     A                                  8 11'A D D  A  R E Q U I S I T I O N  H'
     A                                  8 46'O L D  S T A T U S'
     A                                  9  1':'
     A                                 10  1':'
     A                                 10 26'CODE'
     A                                 10 43'DESCRIPTION'
     A                                 11  1':'
     A                                 12  1':'
     A                                 13  1':'
     A                                 14  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 15  1':'
     A                                 16  1':'
     A                                 16 12'M O D I F Y  A  R E Q U I S I T I'
     A                                 16 46'O N  H O L D  S T A T U S'
     A                                 17  1':'
     A                                 18  1':'
     A                                 18 26'CODE'
     A                                 18 42'DESCRIPTION'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            CD             2A  B 12 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07
     AO 97 96                               DSPATR(PC)
     A            DESCRIPT      10A  B 12 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            MC             2A  B 20 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            DESCRIPT2     10A  B 20 43DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELIN    79A  B 23  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-HELP SCREEN f3-EXIT     -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R REQHOLDST2
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 17'R E Q U I S I T I O N  H O L D  S'
     A                                  2 51'T A T U S E S'
     A                                  3  1':'
     A                                  4  1':*********  REQUSITION HOLD STATUS-
     A                                      ES FOR REQUISITIONS PLACED ON HOLD'
     A                                  4 71'*********'
     A                                  5  1':*********'
     A                                  5 23'IN MATERIAL CONTROL AND PURCHASING-
     A                                      .'
     A                                  5 71'*********'
     A                                  6  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  7  1':'
     A                                  8  1':'
     A                                  8 11'A D D  A  R E Q U I S I T I O N  H'
     A                                  8 46'O L D  S T A T U S'
     A                                  9  1':'
     A                                 10  1':'
     A                                 10 26'CODE'
     A                                 10 43'DESCRIPTION'
     A                                 11  1':'
     A                                 12  1':'
     A                                 13  1':'
     A                                 14  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 15  1':'
     A                                 16  1':'
     A                                 16 12'M O D I F Y  A  R E Q U I S I T I'
     A                                 16 46'O N  H O L D  S T A T U S'
     A                                 17  1':'
     A                                 18  1':'
     A                                 18 26'CODE'
     A                                 18 42'DESCRIPTION'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            CD             2A  B 12 27DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPT      10A  B 12 44DSPATR(PR)
     A                                      OVRDTA
     A            MC             2A  B 20 27DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPT2     10A  B 20 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10
     AO 97 96                               DSPATR(PC)
     A            MESSAGELIN    79A  B 23  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-HELP SCREEN f3-EXIT     -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R STNDINST
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 20'S T A N D A R D   I N S T R U C T'
     A                                  2 54'I O N S'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  5  1':  SHIPPING STANDARD INSTRUCTIONS'
     A                                  5 35'(APPEAR ON SHIPPING RELEASE PRINTO-
     A                                      UTS) :     '
     A                                  6  1':'
     A                                  7  1':'
     A                                  8  1':'
     A                                  9  1':'
     A                                 10  1':'
     A                                 11  1':'
     A                                 12  1':  ZBILL STANDARD INSTRUCTIONS :'
     A                                 13  1':'
     A                                 14  1':'
     A                                 15  1':'
     A                                 16  1':'
     A                                 17  1':'
     A                                 18  1':'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            SHIPPING1     72A  B  7  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            SHIPPING2     72A  B  8  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            SHIPPING3     72A  B  9  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            SHIPPING4     72A  B 10  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            ZBILL1        72A  B 14  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            ZBILL2        72A  B 15  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            ZBILL3        72A  B 16  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            ZBILL4        72A  B 17  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            MESSAGELIN    79A  B 23  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R STRMDEPT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  3  1':'
     A                                  3 12'S  T  O  R  E  R  O  O  M    D  E'
     A                                  3 47'P  A  R  T  M  E  N  T  S'
     A                                  4  1':'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1':'
     A                                  6 54'LAST DATE MODIFIED'
     A                                  7  1':'
     A                                  8  1':'
     A                                  8 22'DEPARTMENT  1 :'
     A                                  9  1':'
     A                                 10  1':'
     A                                 10 22'DEPARTMENT  2 :'
     A                                 11  1':'
     A                                 12  1':'
     A                                 12 22'DEPARTMENT  3 :'
     A                                 13  1':'
     A                                 14  1':'
     A                                 14 22'DEPARTMENT  4 :'
     A                                 15  1':'
     A                                 16  1':'
     A                                 16 22'DEPARTMENT  5 :'
     A                                 17  1':'
     A                                 18  1':'
     A                                 18 22'DEPARTMENT  6 :'
     A                                 19  1':'
     A                                 20  1':'
     A                                 20 17'ARE SPACES A VALID DEPARTMENT NUMB-
     A                                      ER (Y OR N) :'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            DPT1           4A  B  8 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            DATE1          6A  B  8 61DSPATR(PR)
     A                                      OVRDTA
     A            DPT2           4A  B 10 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            DATE2          6A  B 10 61DSPATR(PR)
     A                                      OVRDTA
     A            DPT3           4A  B 12 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            DATE3          6A  B 12 61DSPATR(PR)
     A                                      OVRDTA
     A            DPT4           4A  B 14 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            DATE4          6A  B 14 61DSPATR(PR)
     A                                      OVRDTA
     A            DPT5           4A  B 16 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            DATE5          6A  B 16 61DSPATR(PR)
     A                                      OVRDTA
     A            DPT6           4A  B 18 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            DATE6          6A  B 18 61DSPATR(PR)
     A                                      OVRDTA
     A            X              1A  B 20 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R SYSOPT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 27'S Y S T E M   O P T I O N S'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  5  1': ALLOW BATCH CORPORATE CODE DELET-
     A                                      ES THROUGH AKRON UPDATE?'
     A                                  6  1':'
     A                                  7  1': ARE RAW MATERIAL BATCH WITHDRAWA-
     A                                      LS FROM ASPICS ENABLED?'
     A                                  8  1':'
     A                                  9  1': IF SO, ENTER THE CHARGE DATA FOR'
     A                                  9 36'RAW BATCH WITHDRAWAL TRANSACTIONS:'
     A                                 10  1':'
     A                                 11  1':'
     A                                 11 17'CHARGE DEPT   REQ DEPT   EXP CLASS'
     A                                 12  1':'
     A                                 13  1':'
     A                                 14  1': NOTE: IF YOU LEAVE CHARGE DEPT O-
     A                                      R EXP CLASS BLANK, THE DEFAULT OF'
     A                                 14 69'THE RAW    '
     A                                 15  1': MATERIAL CODE (FROM MP1) WILL BE'
     A                                 15 36'USED IN AUTOMATIC RAW BATCH WITHDR-
     A                                      AWALS.    '
     A                                 16  1':'
     A                                 17  1': IF STOREROOM EXP CLASS (FROM MP1-
     A                                      ) IS NOT BLANK, OVERRIDE ABOVE EXP'
     A                                 17 70'CLASS?'
     A                                 18  1':'
     A                                 19  1': ARE TC--- (ONHAND INVENTORY FOR'
     A                                 19 35'CODES WITH CURRENT DAY ACTIVITY)'
     A                                 20  1': TRANSACTIONS TO BE CREATED THROU-
     A                                      GH BCUTOFF.DB.CME ?'
     A                                 21  1':'
     A                                 22  1': FOR LOADPO, IF A VENDOR CODE IS'
     A                                 22 35'TO BE SUBSTITUTED, ENTER IT:'
     A                                 23  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            N              1A  B  5 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  38                                  DSPATR(RI)
     A  38
     AO 97 96                               DSPATR(PC)
     A            R              1A  B  7 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A            CHRG           6A  B 12 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            REQ            4A  B 12 33DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            EXP            6Y 0B 12 44DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A            Q              1A  B 17 77DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A            C              1A  B 20 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A            VENCODE       10A  B 22 64DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R UNITMEAS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 24'U N I T   O F   M E A S U R E S'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 20'A D D   U N I T   O F   M E A S U'
     A                                  4 54'R E S'
     A                                  5  1':'
     A                                  6  1':'
     A                                  6 22'UNIT OF MEASURE'
     A                                  6 47'DESCRIPTION'
     A                                  7  1':'
     A                                  8  1':'
     A                                  9  1':'
     A                                 10  1':'
     A                                 11  1':'
     A                                 12  1':'
     A                                 13  1':'
     A                                 14  1':'
     A                                 15  1':'
     A                                 16  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 17  1':'
     A                                 18  1':'
     A                                 18 17'M O D I F Y   A   D E S C R I P T'
     A                                 18 51'I O N   O N L Y'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            U1             2A  B  8 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04
     AO 97 96                               DSPATR(PC)
     A            DESCRIPTIO    12A  B  8 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            U2             2A  B 10 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            DESCRIPTI2    12A  B 10 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            U3             2A  B 12 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            DESCRIPTI3    12A  B 12 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            U4             2A  B 14 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            DESCRIPTI4    12A  B 14 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            U5             2A  B 20 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            DESCRIPTI5    12A  B 20 47DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELIN    79A  B 23  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R UNITMEASM
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 24'U N I T   O F   M E A S U R E S'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 20'A D D   U N I T   O F   M E A S U'
     A                                  4 54'R E S'
     A                                  5  1':'
     A                                  6  1':'
     A                                  6 22'UNIT OF MEASURE'
     A                                  6 47'DESCRIPTION'
     A                                  7  1':'
     A                                  8  1':'
     A                                  9  1':'
     A                                 10  1':'
     A                                 11  1':'
     A                                 12  1':'
     A                                 13  1':'
     A                                 14  1':'
     A                                 15  1':'
     A                                 16  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 17  1':'
     A                                 18  1':'
     A                                 18 17'M O D I F Y   A   D E S C R I P T'
     A                                 18 51'I O N   O N L Y'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            U1             2A  B  8 27DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIO    12A  B  8 47DSPATR(PR)
     A                                      OVRDTA
     A            U2             2A  B 10 27DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI2    12A  B 10 47DSPATR(PR)
     A                                      OVRDTA
     A            U3             2A  B 12 27DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI3    12A  B 12 47DSPATR(PR)
     A                                      OVRDTA
     A            U4             2A  B 14 27DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI4    12A  B 14 47DSPATR(PR)
     A                                      OVRDTA
     A            U5             2A  B 20 27DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI5    12A  B 20 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13
     AO 97 96                               DSPATR(PC)
     A            MESSAGELIN    79A  B 23  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R USEROPTION
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 30'U S E R    O P T I O N S'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1': SHOULD BIN PHYSICAL QUANTITIES B-
     A                                      E SHOWN WHEN PHYSICAL INVENTORY WOR-
     A                                      KSHEETS   '
     A                                  5  1': ARE PREPARED (Y OR N)?'
     A                                  6  1': SHOULD THE DATE-WANTED BE CALCUL-
     A                                      ATED FOR STOREROOM REQUISTIONS'
     A                                  7  1': (Y OR N) ?'
     A                                  8  1':'
     A                                  9  1': SHOULD USER PASSWORDS (PERSONNEL'
     A                                  9 36'VERIFICATION) BE REQUIRED FOR REMO-
     A                                      TE'
     A                                 10  1': WORKSHEETS (Y OR N)?'
     A                                 11  1': SHOULD EMPLOYEE ID ALWAYS BE VAL-
     A                                      IDATED ON REMOTE WORKSHEETS, EVEN'
     A                                 11 69'IF NO      '
     A                                 12  1': WORKORDER (Y OR N)?'
     A                                 13  1':'
     A                                 14  1': SHOULD EMPLOYEE ID ALWAYS BE VAL-
     A                                      IDATED ON STOREROOM ISSUES, EVEN IF-
     A                                       NO'
     A                                 15  1': WORKORDER (Y OR N)?'
     A                                 16  1': SHOULD PLANT BE ALLOWED TO CHANG-
     A                                      E AVERAGE COST ON THE MP1 TRANSACTI-
     A                                      ON'
     A                                 17  1': (Y OR N) ?'
     A                                 18  1': SHOULD RETURN WITH VALUE ON RAW'
     A                                 18 35'MATERIALS BE ALLOWED'
     A                                 19  1': (Y OR N) ?'
     A                                 20  1':'
     A                                 21  1': FOR INVOICING USERS: SHOULD PREP-
     A                                      AYS BE ALLOWED ON AP1?'
     A                                 22  1':  ***** PURCHASING QUESTIONS ON N-
     A                                      EXT PAGE - PRESS "ENTER"'
     A                                 23  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            A              1A  B  5 28DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21
     AO 97 96                               DSPATR(PC)
     A            B              1A  B  7 28DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            C              1A  B 10 28DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            E              1A  B 12 28DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            F              1A  B 15 28DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            D              1A  B 17 28DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            H              1A  B 19 28DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            G              1A  B 21 58DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-HELP SCREEN f3-EXIT     -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R USEROPTIO2
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 16'P U R C H A S I N G   U S E R    O'
     A                                  2 51'P T I O N S'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1': SHOULD BUYER AND TYPIST BE CARRI-
     A                                      ED OVER FROM PO TO PO DURING PO ENT-
     A                                      RY'
     A                                  5  1': ON PU1-3 (Y OR N)?'
     A                                  6  1':'
     A                                  7  1': SHOULD SELLER ADDRESS APPEAR ON'
     A                                  7 35'THE LEFT OR RIGHT SIDE OF THE PURC-
     A                                      HASE'
     A                                  8  1': ORDER PRINTOUT (L OR R)?'
     A                                  9  1':'
     A                                 10  1': SHOULD CURRENCY CODE BY REQUIRED'
     A                                 10 36'DURING PO-ENTRY ON PU1-1 (Y OR N)?'
     A                                 11  1':'
     A                                 12  1': SHOULD MATERIALS CONTROL BE ABLE'
     A                                 12 36'TO CANCEL REMAINING ONORDER FOR AL-
     A                                      L TYPES   '
     A                                 13  1': OF PURCHASE ORDERS, NOT ONLY ITs'
     A                                 13 37'(Y OR N)?'
     A                                 14  1':'
     A                                 15  1': SHOULD A COST COMPARISON BE PERF-
     A                                      ORMED BETWEEN MARKET COST AND PO CO-
     A                                      ST'
     A                                 16  1': DURING PO ENTRY (Y OR N)?'
     A                                 17  1': IF YES, ENTER THE PERCENTAGE VAR-
     A                                      IANCE TO BE FLAGGED DURING PO ENTRY-
     A                                      ?'
     A                                 17 76'%   '
     A                                 18  1':'
     A                                 19  1': SHOULD ALL MANUFACTURES, NOT JUS-
     A                                      T SELECTED ONES BE SHOWN ON REQUISI-
     A                                      TIONS     '
     A                                 20  1': (Y OR N)?'
     A                                 21  1':'
     A                                 22  1': SHOULD ADDITIONAL DATA ALWAYS BE'
     A                                 22 36'VERIFIED ON POs AND REQs? (Y OR N)-
     A                                      ?'
     A                                 23  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            G              1A  B  5 28DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27
     AO 97 96                               DSPATR(PC)
     A            H              1A  B  8 28DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            C              1A  B 10 72DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            D              1A  B 13 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            E              1A  B 16 29DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            ABC            3Y 0B 17 72DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            F              1A  B 20 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            I              1A  B 22 72DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-HELP SCREEN f3-EXIT     -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
