     A*            21:49:59    T881S28     VEDIABST.HPTO38.CME
     A                                      DSPSIZ(24 80 *DS3)
     A                                      INDARA
     A                                      PRINT
     A                                      CHGINPDFT
     A          R FEDICRTE
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 22'EDI LOG FILE REVIEW/PROCESS'
     A                                  1 75'SEDI'
     A                                  5  7'1)   PROCESS THE ENTIRE FILE'
     A                                  5 42'(THIS BYPASSES THE REVIEW SCREEN -
     A                                      AND'
     A                                  6 43'STARTS A JOB TO DO THE PROCESSIN-
     A                                      G)'
     A                                  8  7'2)   REVIEW/PROCESS SPECIFIC'
     A                                  9 12'ENTRIES OR ALL ENTRIES'
     A                                 13  4'1) TO PROCESS ALL ENTRIES IN THE E-
     A                                      DI LOG FILE WITHOUT REVIEWING, '
     A                                 14  7'PLACE AN "X" IN BOX 1 AND PRESS TH-
     A                                      E "ENTER" KEY'
     A                                 15  4'2) TO REVIEW/PROCESS ALL ENTRIES I-
     A                                      N THE EDI LOG FILE FOR A SPECIFIC V-
     A                                      ENDOR,'
     A                                 16  7'KEY THE VENDOR CODE IN BOX 2 AND P-
     A                                      RESS THE "ENTER" KEY'
     A                                 17  4'3) TO REVIEW/PROCESS THE ENTIRE ED-
     A                                      I LOG FILE, KEY IN THE WORD "ALL" I-
     A                                      N BOX 2'
     A                                 18  7'AND PRESS THE "ENTER" KEY'
     A                                 19  4'4) PRESS "f3" TO END THE PROGRAM.'
     A            COM            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            X1             1A  B  5 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES(' ' 'X')
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            X2            10A  B  8 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-END PROGRAM             -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FEDICRTE2
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 23'EDI LOG FILE REVIEW/PROCESS'
     A                                  1 75'SEDI'
     A                                  3  1'1) PROCESS THE ENTIRE FILE'
     A                                  4  1'2) PROCESS THE SELECTED'
     A                                  5  4'EDI ORDERS ONLY'
     A                                  7  1'3) EXCLUDE THESE EDI ORDERS'
     A                                  8  4'BUT PROCESS REMAINDER'
     A                                 10  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 11  5' EDI PO NO   INITDT   ADD   MOD   -
     A                                      DEL   EDI VENDOR   ITEM#    '
     A                                 21  2'1) MAKE SELECTION(S) AND PRESS "EN-
     A                                      TER"'
     A                                 22  2'2) PRESS "f1" FOR INSTRUCTIONS'
     A                                 23  2'3) PRESS "f3" TO RETURN TO PREVIOU-
     A                                      S SCREEN'
     A            COM            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            X              1A  B  3 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                      VALUES('X' ' ')
     A            PO4A           7A  B  4 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                  4 40'-'
     A            REL4A          3A  B  4 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            PO4B           7A  B  4 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                  4 55'-'
     A            REL4B          3A  B  4 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            PO4C           7A  B  4 62DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A                                  4 70'-'
     A            REL4C          3A  B  4 72DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            PO5A           7A  B  5 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A                                  5 40'-'
     A            REL5A          3A  B  5 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            PO5B           7A  B  5 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                  5 55'-'
     A            REL5B          3A  B  5 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            PO5C           7A  B  5 62DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A                                  5 70'-'
     A            REL5C          3A  B  5 72DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            PO6A           7A  B  6 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A                                  6 40'-'
     A            REL6A          3A  B  6 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            PO6B           7A  B  6 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A                                  6 55'-'
     A            REL6B          3A  B  6 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            PO7A           7A  B  7 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A                                  7 40'-'
     A            REL7A          3A  B  7 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            PO7B           7A  B  7 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A                                  7 55'-'
     A            REL7B          3A  B  7 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            PO7C           7A  B  7 62DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A                                  7 70'-'
     A            REL7C          3A  B  7 72DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            PO8A           7A  B  8 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A                                  8 40'-'
     A            REL8A          3A  B  8 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            PO8B           7A  B  8 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A                                  8 55'-'
     A            REL8B          3A  B  8 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            PO8C           7A  B  8 62DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A                                  8 70'-'
     A            REL8C          3A  B  8 72DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            PO9A           7A  B  9 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                  9 40'-'
     A            REL9A          3A  B  9 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            PO9B           7A  B  9 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A                                  9 55'-'
     A            REL9B          3A  B  9 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            RELEASEENT    79A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            RELEASEEN2    79A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            RELEASEEN3    79A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            RELEASEEN4    79A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            RELEASEEN5    79A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            RELEASEEN6    79A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            RELEASEEN7    79A  B 18  1DSPATR(PR)
     A                                      OVRDTA
     A            RELEASEEN8    79A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            MSGLINE       30A  B 20 48DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FEDICRTE3
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 14'EDI LOG FILE PURCHASE ORDER REVIEW-
     A                                      /PROCESS'
     A                                  1 75'SEDI'
     A                                  3  4'THE FOLLOWING OPTIONS ARE AVAILABL-
     A                                      E WHEN ROCESSING THE EDI LOG FILE:'
     A                                  5  1'1)  ALL ENTRIES IN THE LOG FILE CA-
     A                                      N BE PROCESSED BY PLACING AN "X" '
     A                                  6  5'IN THE APPROPRIATE POSITION OF THE-
     A                                       INITIAL SCREEN. ALL ENTRIES CAN '
     A                                  7  5'ALSO BE PROCESSED BY PLACING AN "X-
     A                                      " IN THE PROCESS THE ENTIRE FILE '
     A                                  8  5'POSITION OF THE 2ND SCREEN; HOWEVE-
     A                                      R, IF YOU HAVE SELECTED A SPECIFIC'
     A                                  9  5'VENDOR ON THE INITIAL SCREEN FOR R-
     A                                      EVIEW, PLACING AN "X" IN THE '
     A                                 10  5'PROCESS THE ENTIRE FILE POSITION W-
     A                                      ILL PROCESS ALL THE ENTRIES IN THE '
     A                                 11  5'LOG FILE FOR THAT VENDOR ONLY.'
     A                                 12  1'2)  PROCESS THE LOG FILE FOR SELEC-
     A                                      TED PURCHASE ORDERS - THE REMAINDER'
     A                                 13  5'OF THE ENTRIES THAT DO NOT CORRESP-
     A                                      OND TO THE SELECTED ORDERS ENTERED'
     A                                 14  5'WILL REMAIN IN THE LOG FILE. THE M-
     A                                      AXIMUM NUMBER OF PURCHASE ORDERS'
     A                                 15  5'THAT CAN BE SELECTED IS EIG-
     A                                      HT (8).'
     A                                 16  1'3)  PROCESS THE ENTIRE LOG FILE'
     A                                 16 33'EXCEPT FOR A SELECTED NUMBER OF PU-
     A                                      RCHASE'
     A                                 17  5'ORDERS. THE ENTRIES THAT CORRESPON-
     A                                      D TO THE SELECTED ORDERS WILL REMAI-
     A                                      N'
     A                                 18  5'IN THE LOG FILE, THE REMAINDER OF -
     A                                      ENTRIES WILL BE PROCESSED. THE MAXI-
     A                                      MUM'
     A                                 19  5'NUMBER OF PURCHASE ORDERS THAT'
     A                                 19 36'CAN BE SELECTED IS EIGHT (8).'
     A                                 20  1'4)  IF NO PROCESSING OPTION IS DES-
     A                                      IRED AND YOU WISH TO ONLY REVIEW TH-
     A                                      E LOG'
     A                                 21  5'FILE THEN PRESS "f3" WHEN YOU ARE'
     A                                 21 39'DONE TO RETURN TO THE FIRST SCREEN-
     A                                      .'
     A                                 22  5'NO PROCESSING WILL BE DONE.'
     A                                 23  1'PRESS "F3" TO RETURN TO PREVIOUS S-
     A                                      CREEN'
     A            COM            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
