     A*%%TS  SD  20050125  112421  Z010830     REL-V5R2M0  5722-WDS
     A*****************************************************************
     A** FILE NAME  :  ZEQUIPSEL
     A**
     A** DESCRIPTION:  DISPLAY FILE FOR EQUIPMENT SELECTION
     A**
     A** AUTHOR     :  DAN RAUCH - EXLTECH, LLC
     A** CREATED    :  01-21-2005
     A*****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT(HI UL)
     A                                      INDARA
     A                                      CF03
     A**===============================================================
     A**=== HEADING LINE
     A**===============================================================
     A          R H01
     A                                  1  3'Date:'
     A                                  1  9DATE
     A                                      EDTCDE(Y)
     A                                  1 26'Equipment Selection Screen'
     A                                      DSPATR(HI)
     A                                  1 65'Time:'
     A                                  1 71TIME
     A            VERSION       15A  O  2 64
     A**===============================================================
     A**=== SUBFILE
     A**===============================================================
     A          R SFL01                     SFL
     A  86                                  SFLNXTCHG
     A            SEL            1A  B  7  3
     A            SFEQNBR        6A  O  7  7
     A            SFEQDSC       40A  O  7 15
     A            SFEQLOC        8A  O  7 57
     A**===============================================================
     A**=== CONTROL RECORD
     A**===============================================================
     A          R CTL01                     SFLCTL(SFL01)
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(0015)
     A                                      CF04
     A                                      OVERLAY
     A  85                                  SFLDSP
     A                                      SFLDSPCTL
     A  84                                  SFLCLR
     A**83                                  SFLEND(*MORE)
     A                                      ROLLUP(91)
     A            CRRN           4S 0H      SFLRCDNBR(CURSOR *TOP)
     A            CREC          10A  H
     A            CFLD          10A  H
     A                                  3  3'Reposition List to Equipment Nbr:'
     A            CEQNBR         6A  B  3 38
     A                                  5  2'(X)'
     A                                  6  2'Sel'
     A                                      DSPATR(UL)
     A                                  6  7'Equip#'
     A                                      DSPATR(UL)
     A                                  6 15'Description                       -
     A                                            '
     A                                      DSPATR(UL)
     A                                  6 57'Location'
     A                                      DSPATR(UL)
     A**===============================================================
     A**=== PROCESSES MESSAGE LINE - SFL
     A**===============================================================
     A          R B01
     A                                      OVERLAY
     A            MSSG          65   O 22  2
     A                                      DSPATR(HI)
     A                                 23  2'F3-Exit'
     A                                      DSPATR(BL)
     A                                      COLOR(BLU)
     A  85        PGMSG         10   O 22 69
     A  85                                  DSPATR(RI HI)
     A  85                                  COLOR(YLW)
