     A*  89/04/20  16:21:12    T881S26     REL-R01M02  5728-PW1
     A*            18:47:49    T881S28     VFLUPSEL.HPTO38.CME
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A  98                                  INVITE
     A          R FLUPSEL1
     A*  89/04/20  16:21:12    T881S26     REL-R01M02  5728-PW1
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      PUTOVR
     A                                  1  8'P U R C H A S E   O R D E R   F O'
     A                                  1 42'L L O W U P   S E L E C T I O N'
     A                                  1 77'FP1'
     A                                  4 26'BUYER CODE'
     A                                  7  4'FIND ALL PURCHASE ORDERS THAT ARE'
     A                                  7 43'DAYS PAST LAST FOLLOWUP DATE OR'
     A                                  8  4'IF NO FOLLOWUP DATE IS FOUND FOR T-
     A                                      HE ORDER FIND ALL PURCHASE ORDERS'
     A                                  9  4'THAT ARE '
     A                                  9 18'DAYS PAST EXPECTED DELIVERY DATE.'
     A                                 11  6'OPTIONAL:  RESTRICT TO OPEN PURCHA-
     A                                      SE ORDERS FOR A SPECIFIED'
     A                                 12 17'VENDOR CODE  '
     A                                 13 17'NOTE: BUYER CODE IS NOT A FACTOR W-
     A                                      HEN SELECTING OPEN ORDERS'
     A                                 14 23'OF A PARTICULAR VENDOR CODE'
     A                                 16  4'THIS PROGRAM WILL LOCATE ALL OPEN'
     A                                 16 38'ORDERS ASSIGNED TO A SPECIFIED BUY-
     A                                      ER CODE'
     A                                 17  1'BASED THE NUMBER OF DAYS SINCE LAS-
     A                                      T FOLLOWUP DATE OR EXPECED DELIVERY-
     A                                       DATE.'
     A                                 18  1'A BUYER FILE CONTAINING ALL OF THE-
     A                                      SE ORDERS WILL BE CREATED WHICH WIL-
     A                                      L BE'
     A                                 19  1'USED FOR CREATING FOLLOWUP ORDER D-
     A                                      OCUMENTS TO SEND TO THE VENDOR.  TH-
     A                                      IS BUYER'
     A                                 20  1'FILE MUST BE CREATED BEFORE ONLINE'
     A                                 20 36'FOLLOWUP ORDER PROGRAM (FP2) IS US-
     A                                      ED.'
     A            CCC            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            BYCD           4A  B  4 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            FD             2Y 0B  7 39DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            ED             2Y 0B  9 14DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            VENDOR         7A  B 12 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            VC1            3Y 0B 12 41DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL(' ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
