     A*%%TS  SD  19961114  143928  A193138     REL-V3R6M0  5716-PW1
     A*  90/03/08  14:25:16    T000144     REL-R01M02  5728-PW1
     A*            18:49:19    T881S28     VFRTUPDG.HPTO38.CME
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A          R ADDFRT
     A*%%TS  SD  19961114  143928  A193138     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'TUPDACCG'
     A                                  1 23'CORPORATE STORES ACCOUNTING SYSTEM'
     A                                  1 75'SIN-2'
     A                                  2 29'UPDATE ACCOUNTING DATA'
     A                                  6  1'ENTER NEW DATA'
     A                                  8  1'FREIGHT CARRIER CODE:  '
     A                                  9  1'FREIGHT CARRIER NAME:  '
     A                                 10  1'EXPEDITE CARRIER (Y/N):'
     A                                 19  1'PRESS "F7" TO RETURN TO MENU'
     A                                 20  1'PRESS "F3" TO END PROGRAM'
     A            FRTC           4A  B  8 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            FRTNAME       30A  B  9 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            EXPEDITE       1   B 10 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R CHGFRT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'TUPDACCG'
     A                                  1 23'CORPORATE STORES ACCOUNTING SYSTEM'
     A                                  1 75'SIN-3'
     A                                  2 29'UPDATE ACCOUNTING DATA'
     A                                  6  1'ENTER FREIGHT CARRIER CODE TO BE C-
     A                                      HANGED  '
     A                                  7  1'**********************************-
     A                                      ***********************************-
     A                                      *********'
     A                                 19  1'PRESS "F7" TO RETURN TO MENU'
     A                                 20  1'PRESS "F3" TO END PROGRAM'
     A            FRTC           4A  B  6 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R CHGFRT2
     A*%%TS  SD  19961114  143928  A193138     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'TUPDACCG'
     A                                  1 23'CORPORATE STORES ACCOUNTING SYSTEM'
     A                                  1 75'SIN-3'
     A                                  2 29'UPDATE ACCOUNTING DATA'
     A                                  6  1'**********************************-
     A                                      ***********************************-
     A                                      *********'
     A                                  7  1'TO CHANGE CARRIER CODE:'
     A                                  8  4'TO NEW CARRIER NAME:  '
     A                                  9  7'EXPEDITE CARRIER:'
     A                                 11  1'PRESS ENTER'
     A                                 19  1'PRESS "F7" TO RETURN TO MENU'
     A                                 20  1'PRESS "F3" TO END PROGRAM'
     A            FRTC           4A  B  7 27DSPATR(PR)
     A                                      OVRDTA
     A            FRTNAME       30A  B  8 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            EXPEDITE       1   B  9 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R DELFRT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'TUPDACCG'
     A                                  1 23'CORPORATE STORES ACCOUNTING SYSTEM'
     A                                  1 75'SIN-4'
     A                                  2 29'UPDATE ACCOUNTING DATA'
     A                                  6  1'ENTER CARRIER CODE TO BE DELETED'
     A                                  6 35'--  '
     A                                  7  1'**********************************-
     A                                      ***********************************-
     A                                      *********'
     A                                 19  1'PRESS "F7" TO RETURN TO MENU'
     A                                 20  1'PRESS "F3" TO END PROGRAM'
     A            FRTC           4A  B  6 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R DELFRT2
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'TUPDACCG'
     A                                  1 23'CORPORATE STORES ACCOUNTING SYSTEM'
     A                                  1 75'SIN-4'
     A                                  2 29'UPDATE ACCOUNTING DATA'
     A                                  6  1'**********************************-
     A                                      ***********************************-
     A                                      *********'
     A                                  7  1'TO DELETE CARRIER CODE:'
     A                                  9  1'PRESS "F2" TO DELETE'
     A                                 19  1'PRESS "F7" TO RETURN TO MENU'
     A                                 20  1'PRESS "F3" TO END PROGRAM'
     A            FRTC           4A  B  7 26DSPATR(PR)
     A                                      OVRDTA
     A            FRTNAME       30A  B  8 26DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FRTHDR
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'TUPDACCG'
     A                                  1 23'CORPORATE STORES ACCOUNTING SYSTEM'
     A                                  1 75'SIN=1'
     A                                  2 29'UPDATE ACCOUNTING DATA'
     A                                  6  1'UPDATE FREIGHT CARRIER CODE AND NA-
     A                                      ME'
     A                                  8  2'ENTER  "A" FOR ADD'
     A                                  9  9'"C" FOR CHANGE'
     A                                 10  9'"D" FOR DELETE'
     A                                 13  2'SELECT:  '
     A                                 19  1'PRESS "F7" FOR NEW SELECTION'
     A                                 20  1'PRESS "F3" TO END PROGRAM'
     A            X              1A  B 13 12DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
