     A*  89/02/15  14:24:47    T881S29     REL-R01M02  5728-PW1
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A                                      CA03(03 'end of program')
     A          R SCREEN1
     A*  89/02/15  14:24:47    T881S29     REL-R01M02  5728-PW1
     A                                      PUTOVR
     A                                  2 20'M M I S   H I S T O R Y   R E T R -
     A                                      I E V E'
     A                                      DSPATR(HI)
     A                                  6  7'Enter the sequence number you wish-
     A                                       to retrieve'
     A            HSEQUENCE      4A  B  6 54CHGINPDFT(CS UL)
     A                                      CHECK(RZ)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                  8  7'After pressing'
     A                                  8 22'Enter'
     A                                      DSPATR(HI)
     A                                  8 28'a job will be submitted :'
     A                                 10  9'The history will be retrieved'
     A                                 12  9'The history will be transmitted'
     A  99        ERRMSG        79   M      OVRDTA
