     A*%%TS  SD  20040922  084121  A257947     REL-V5R2M0  5722-WDS
     A*  89/01/03  15:27:06    T881S32     REL-R01M02  5728-PW1
     A*            18:24:49    T881S28     VHOTCODE.HPTO38.CME
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A  97                                  INVITE
     A                                      PRINT
     A                                      INDARA
     A                                      CF01(01)
     A                                      CF03(03)
     A                                      CF06(06)
     A                                      CF07(07)
     A                                      CF08(08)
     A                                      CF09(09)
     A                                      CF12(12)
     A          R VDISPHC
     A                                      PUTOVR
     A                                  2 14'D I S P L A Y   H O T   C O D E'
                                            DSPATR(HI)
     A                                  2 48'E Q U I P M E N T'
                                            DSPATR(HI)
     A                                  5  2'EQUIPMENT'
     A                                  5 18'START'
     A                                  5 36'ENDING'
     A                                  6  3'NUMBER      DATE AND TIME     DATE'
     A                                  6 38'AND TIME    REMARKS'
     A                                 22  9'PRESS ENTER KEY TO CONTINUE OR CMD-
     A                                      12 KEY FOR ANOTHER SELECTION'
     A            EQPNUM         6A  B  8  3DSPATR(PR)
     A                                      OVRDTA
     A            S1             2A  B  8 14DSPATR(PR)
     A                                      OVRDTA
     A            S2             2A  B  8 17DSPATR(PR)
     A                                      OVRDTA
     A            S3             2A  B  8 20DSPATR(PR)
     A                                      OVRDTA
     A            S4             2A  B  8 24DSPATR(PR)
     A                                      OVRDTA
     A            S5             2A  B  8 27DSPATR(PR)
     A                                      OVRDTA
     A            E1             2A  B  8 32DSPATR(PR)
     A                                      OVRDTA
     A            E2             2A  B  8 35DSPATR(PR)
     A                                      OVRDTA
     A            E3             2A  B  8 38DSPATR(PR)
     A                                      OVRDTA
     A            E4             2A  B  8 42DSPATR(PR)
     A                                      OVRDTA
     A            E5             2A  B  8 45DSPATR(PR)
     A                                      OVRDTA
     A            R1            30A  B  8 50DSPATR(PR)
     A                                      OVRDTA
     A            NUM2           6A  B 10  3DSPATR(PR)
     A                                      OVRDTA
     A            A1             2A  B 10 14DSPATR(PR)
     A                                      OVRDTA
     A            A2             2A  B 10 17DSPATR(PR)
     A                                      OVRDTA
     A            A3             2A  B 10 20DSPATR(PR)
     A                                      OVRDTA
     A            A4             2A  B 10 24DSPATR(PR)
     A                                      OVRDTA
     A            A5             2A  B 10 27DSPATR(PR)
     A                                      OVRDTA
     A            B1             2A  B 10 32DSPATR(PR)
     A                                      OVRDTA
     A            B2             2A  B 10 35DSPATR(PR)
     A                                      OVRDTA
     A            B3             2A  B 10 38DSPATR(PR)
     A                                      OVRDTA
     A            B4             2A  B 10 42DSPATR(PR)
     A                                      OVRDTA
     A            B5             2A  B 10 45DSPATR(PR)
     A                                      OVRDTA
     A            R2            30A  B 10 50DSPATR(PR)
     A                                      OVRDTA
     A            NUM3           6A  B 12  3DSPATR(PR)
     A                                      OVRDTA
     A            C1             2A  B 12 14DSPATR(PR)
     A                                      OVRDTA
     A            C2             2A  B 12 17DSPATR(PR)
     A                                      OVRDTA
     A            C3             2A  B 12 20DSPATR(PR)
     A                                      OVRDTA
     A            C4             2A  B 12 24DSPATR(PR)
     A                                      OVRDTA
     A            C5             2A  B 12 27DSPATR(PR)
     A                                      OVRDTA
     A            D1             2A  B 12 32DSPATR(PR)
     A                                      OVRDTA
     A            D2             2A  B 12 35DSPATR(PR)
     A                                      OVRDTA
     A            D3             2A  B 12 38DSPATR(PR)
     A                                      OVRDTA
     A            D4             2A  B 12 42DSPATR(PR)
     A                                      OVRDTA
     A            D5             2A  B 12 45DSPATR(PR)
     A                                      OVRDTA
     A            R3            30A  B 12 50DSPATR(PR)
     A                                      OVRDTA
     A            NUM4           6A  B 14  3DSPATR(PR)
     A                                      OVRDTA
     A            F1             2A  B 14 14DSPATR(PR)
     A                                      OVRDTA
     A            F2             2A  B 14 17DSPATR(PR)
     A                                      OVRDTA
     A            F3             2A  B 14 20DSPATR(PR)
     A                                      OVRDTA
     A            F4             2A  B 14 24DSPATR(PR)
     A                                      OVRDTA
     A            F5             2A  B 14 27DSPATR(PR)
     A                                      OVRDTA
     A            G1             2A  B 14 32DSPATR(PR)
     A                                      OVRDTA
     A            G2             2A  B 14 35DSPATR(PR)
     A                                      OVRDTA
     A            G3             2A  B 14 38DSPATR(PR)
     A                                      OVRDTA
     A            G4             2A  B 14 42DSPATR(PR)
     A                                      OVRDTA
     A            G5             2A  B 14 45DSPATR(PR)
     A                                      OVRDTA
     A            R4            30A  B 14 50DSPATR(PR)
     A                                      OVRDTA
     A            NUM5           6A  B 16  3DSPATR(PR)
     A                                      OVRDTA
     A            H1             2A  B 16 14DSPATR(PR)
     A                                      OVRDTA
     A            H2             2A  B 16 17DSPATR(PR)
     A                                      OVRDTA
     A            H3             2A  B 16 20DSPATR(PR)
     A                                      OVRDTA
     A            H4             2A  B 16 24DSPATR(PR)
     A                                      OVRDTA
     A            H5             2A  B 16 27DSPATR(PR)
     A                                      OVRDTA
     A            I1             2A  B 16 32DSPATR(PR)
     A                                      OVRDTA
     A            I2             2A  B 16 35DSPATR(PR)
     A                                      OVRDTA
     A            I3             2A  B 16 38DSPATR(PR)
     A                                      OVRDTA
     A            I4             2A  B 16 42DSPATR(PR)
     A                                      OVRDTA
     A            I5             2A  B 16 45DSPATR(PR)
     A                                      OVRDTA
     A            R5            30A  B 16 50DSPATR(PR)
     A                                      OVRDTA
     A            NUM6           6A  B 18  3DSPATR(PR)
     A                                      OVRDTA
     A            J1             2A  B 18 14DSPATR(PR)
     A                                      OVRDTA
     A            J2             2A  B 18 17DSPATR(PR)
     A                                      OVRDTA
     A            J3             2A  B 18 20DSPATR(PR)
     A                                      OVRDTA
     A            J4             2A  B 18 24DSPATR(PR)
     A                                      OVRDTA
     A            J5             2A  B 18 27DSPATR(PR)
     A                                      OVRDTA
     A            K1             2A  B 18 32DSPATR(PR)
     A                                      OVRDTA
     A            K2             2A  B 18 35DSPATR(PR)
     A                                      OVRDTA
     A            K3             2A  B 18 38DSPATR(PR)
     A                                      OVRDTA
     A            K4             2A  B 18 42DSPATR(PR)
     A                                      OVRDTA
     A            K5             2A  B 18 45DSPATR(PR)
     A                                      OVRDTA
     A            R6            30A  B 18 50DSPATR(PR)
     A                                      OVRDTA
     A            NUM7           6A  B 20  3DSPATR(PR)
     A                                      OVRDTA
     A            L1             2A  B 20 14DSPATR(PR)
     A                                      OVRDTA
     A            L2             2A  B 20 17DSPATR(PR)
     A                                      OVRDTA
     A            L3             2A  B 20 20DSPATR(PR)
     A                                      OVRDTA
     A            L4             2A  B 20 24DSPATR(PR)
     A                                      OVRDTA
     A            L5             2A  B 20 27DSPATR(PR)
     A                                      OVRDTA
     A            M1             2A  B 20 32DSPATR(PR)
     A                                      OVRDTA
     A            M2             2A  B 20 35DSPATR(PR)
     A                                      OVRDTA
     A            M3             2A  B 20 38DSPATR(PR)
     A                                      OVRDTA
     A            M4             2A  B 20 42DSPATR(PR)
     A                                      OVRDTA
     A            M5             2A  B 20 45DSPATR(PR)
     A                                      OVRDTA
     A            R7            30A  B 20 50DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R VHCDELETE
     A                                      PUTOVR
     A                                  3 15'D E L E T E   H O T   C O D E'
                                            DSPATR(HI)
     A                                  3 47'E Q U I P M E N T'
                                            DSPATR(HI)
     A                                  6 12'ENTER EQUIPMENT NUMBER:'
     A                                  6 45'AND PRESS "ENTER" KEY'
     A                                  9 10'STARTING'
     A                                  9 30'ENDING'
     A                                 10  8'DATE AND TIME      DATE AND TIME'
     A                                 10 45'REMARKS'
     A            EQPNUM         6A  B  6 37DSPATR(UL)
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                      OVRDTA
     A            S1             2A  B 12  7DSPATR(PR)
     A                                      OVRDTA
     A            S2             2A  B 12 10DSPATR(PR)
     A                                      OVRDTA
     A            S3             2A  B 12 13DSPATR(PR)
     A                                      OVRDTA
     A            S4             2A  B 12 17DSPATR(PR)
     A                                      OVRDTA
     A            S5             2A  B 12 20DSPATR(PR)
     A                                      OVRDTA
     A            E1             2A  B 12 26DSPATR(PR)
     A                                      OVRDTA
     A            E2             2A  B 12 29DSPATR(PR)
     A                                      OVRDTA
     A            E3             2A  B 12 32DSPATR(PR)
     A                                      OVRDTA
     A            E4             2A  B 12 36DSPATR(PR)
     A                                      OVRDTA
     A            E5             2A  B 12 39DSPATR(PR)
     A                                      OVRDTA
     A            R1            30A  B 12 45DSPATR(PR)
     A                                      OVRDTA
     A            MSG           70A  B 18  6DSPATR(PR)
     A                                      OVRDTA
     A  98        COMMANDLN1    79A  O 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R VHCEXEC
     A*  88/12/20  09:25:17    T881S32     REL-R01M02  5728-PW1
     A                                      PUTOVR
     A                                  3 11'   P R O D U C T I O N   C O N T R'
     A                                      DSPATR(HI)
     A                                  3 46'O L   F U N C T I O N S   '
     A                                      DSPATR(HI)
     A                                  6 14'PRESS:'
     A                                  8 22'CMD-6'
     A                                      DSPATR(HI)
     A                                  8 31'Initiate Hot Code Equipment'
     A                                 10 22'CMD-7'
     A                                      DSPATR(HI)
     A                                 10 31'Update Hot Code Equipment'
     A                                 12 22'CMD-8'
     A                                      DSPATR(HI)
     A                                 12 31'Delete Hot Code Equipment'
     A                                 14 22'CMD-9'
     A                                      DSPATR(HI)
     A                                 14 31'Display Hot Code Equipment'
     A                                 18 22'CMD-3'
     A                                      DSPATR(HI)
     A                                 18 31'Return To Main Menu'
     A            COMMANDLN1    79A  O 24  1
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R VHCSELECT
     A*  89/01/03  15:27:06    T881S32     REL-R01M02  5728-PW1
     A                                      PUTOVR
     A                                  4 11'S E L E C T   H O T   C O D E'
     A                                      DSPATR(HI)
     A                                  4 43'E Q U I P M E N T'
     A                                      DSPATR(HI)
     A                                  9 31'ZONE:'
     A                                 12 19'EQUIPMENT NUMBER:'
     A                                 22 15'ENTER SELECTION DATA AND PRESS "EN-
     A                                      TER" KEY'
     A            ZONE           4A  B  9 38DSPATR(UL)
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                      OVRDTA
     A            EQPNUM         6A  B 12 38DSPATR(UL)
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A*  REQUST 2004-07089   REMOVED EXTRA SPACE BETWEEN STARTING & ENDING
     A*                      DATES AND TIMES.
     A          R VHCUPDATE
     A*%%TS  SD  20040922  084121  A257947     REL-V5R2M0  5722-WDS
     A                                      PUTOVR
     A                                  3 15'U P D A T E   H O T   C O D E'
     A                                      DSPATR(HI)
     A                                  3 47'E Q U I P M E N T'
     A                                      DSPATR(HI)
     A                                  6 12'ENTER EQUIPMENT NUMBER:'
     A                                  6 45'AND PRESS "ENTER" KEY'
     A                                  9 11'STARTING'
     A                                  9 30'ENDING'
     A                                 10  8' DATE AND TIME     DATE AND TIME'
     A                                 10 44'REMARKS'
     A            EQPNUM         6A  B  6 37
     A  90                                  DSPATR(UL)
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A  91                                  DSPATR(PR)
     A                                      OVRDTA
     A            S1             2A  B 12  8
     A  90                                  DSPATR(PR)
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A  91                                  DSPATR(UL)
     A                                      OVRDTA
     A            S2             2A  B 12 11
     A  90                                  DSPATR(PR)
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A  91                                  DSPATR(UL)
     A                                      OVRDTA
     A            S3             2A  B 12 14
     A  90                                  DSPATR(PR)
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A  91                                  DSPATR(UL)
     A                                      OVRDTA
     A            S4             2A  B 12 18
     A  90                                  DSPATR(PR)
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A  91                                  DSPATR(UL)
     A                                      OVRDTA
     A            S5             2A  B 12 21
     A  90                                  DSPATR(PR)
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A  91                                  DSPATR(UL)
     A                                      OVRDTA
     A            E1             2A  B 12 26
     A  90                                  DSPATR(PR)
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A  91                                  DSPATR(UL)
     A                                      OVRDTA
     A            E2             2A  B 12 29
     A  90                                  DSPATR(PR)
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A  91                                  DSPATR(UL)
     A                                      OVRDTA
     A            E3             2A  B 12 32
     A  90                                  DSPATR(PR)
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A  91                                  DSPATR(UL)
     A                                      OVRDTA
     A            E4             2A  B 12 36
     A  90                                  DSPATR(PR)
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A  91                                  DSPATR(UL)
     A                                      OVRDTA
     A            E5             2A  B 12 39
     A  90                                  DSPATR(PR)
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A  91                                  DSPATR(UL)
     A                                      OVRDTA
     A            R1            30A  B 12 44
     A  90                                  DSPATR(PR)
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A  91                                  DSPATR(UL)
     A                                      OVRDTA
     A            MSG           70A  B 18  6DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R VINITHC
     A                                      PUTOVR
     A                                  2 13'I N I T I A T E   H O T   C O D'
     A                                      DSPATR(HI)
     A                                  2 45'E   E Q U I P M E N T'
     A                                      DSPATR(HI)
     A                                  5  2'EQUIPMENT'
     A                                  5 18'START'
     A                                  5 36'ENDING'
     A                                  6  3'NUMBER      DATE AND TIME     DATE'
     A                                  6 38'AND TIME    REMARKS'
     A                                 22 21'ENTER DATA AND PRESS "ENTER" KEY'
     A            EQPNUM         6A  B  8  3DSPATR(UL)
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                      OVRDTA
     A            S1             2A  B  8 14DSPATR(UL)
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                      OVRDTA
     A            S2             2A  B  8 17DSPATR(UL)
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                      OVRDTA
     A            S3             2A  B  8 20DSPATR(UL)
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                      OVRDTA
     A            S4             2A  B  8 24DSPATR(UL)
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                      OVRDTA
     A            S5             2A  B  8 27DSPATR(UL)
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A                                      OVRDTA
     A            E1             2A  B  8 32DSPATR(UL)
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A                                      OVRDTA
     A            E2             2A  B  8 35DSPATR(UL)
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A                                      OVRDTA
     A            E3             2A  B  8 38DSPATR(UL)
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A                                      OVRDTA
     A            E4             2A  B  8 42DSPATR(UL)
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A                                      OVRDTA
     A            E5             2A  B  8 45DSPATR(UL)
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                      OVRDTA
     A            R1            30A  B  8 50DSPATR(UL)
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A                                      OVRDTA
     A            NUM2           6A  B 10  3DSPATR(UL)
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A                                      OVRDTA
     A            A1             2A  B 10 14DSPATR(UL)
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A                                      OVRDTA
     A            A2             2A  B 10 17DSPATR(UL)
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A                                      OVRDTA
     A            A3             2A  B 10 20DSPATR(UL)
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A                                      OVRDTA
     A            A4             2A  B 10 24DSPATR(UL)
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A                                      OVRDTA
     A            A5             2A  B 10 27DSPATR(UL)
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A                                      OVRDTA
     A            B1             2A  B 10 32DSPATR(UL)
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A                                      OVRDTA
     A            B2             2A  B 10 35DSPATR(UL)
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                      OVRDTA
     A            B3             2A  B 10 38DSPATR(UL)
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A                                      OVRDTA
     A            B4             2A  B 10 42DSPATR(UL)
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A            B5             2A  B 10 45DSPATR(UL)
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A                                      OVRDTA
     A            R2            30A  B 10 50DSPATR(UL)
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A                                      OVRDTA
     A            NUM3           6A  B 12  3DSPATR(UL)
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A                                      OVRDTA
     A            C1             2A  B 12 14DSPATR(UL)
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A                                      OVRDTA
     A            C2             2A  B 12 17DSPATR(UL)
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A                                      OVRDTA
     A            C3             2A  B 12 20DSPATR(UL)
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A                                      OVRDTA
     A            C4             2A  B 12 24DSPATR(UL)
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A                                      OVRDTA
     A            C5             2A  B 12 27DSPATR(UL)
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A                                      OVRDTA
     A            D1             2A  B 12 32DSPATR(UL)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                      OVRDTA
     A            D2             2A  B 12 35DSPATR(UL)
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A                                      OVRDTA
     A            D3             2A  B 12 38DSPATR(UL)
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A                                      OVRDTA
     A            D4             2A  B 12 42DSPATR(UL)
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A                                      OVRDTA
     A            D5             2A  B 12 45DSPATR(UL)
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A                                      OVRDTA
     A            R3            30A  B 12 50DSPATR(UL)
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A                                      OVRDTA
     A            NUM4           6A  B 14  3DSPATR(UL)
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A                                      OVRDTA
     A            F1             2A  B 14 14DSPATR(UL)
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A                                      OVRDTA
     A            F2             2A  B 14 17DSPATR(UL)
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A                                      OVRDTA
     A            F3             2A  B 14 20DSPATR(UL)
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A                                      OVRDTA
     A            F4             2A  B 14 24DSPATR(UL)
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A                                      OVRDTA
     A            F5             2A  B 14 27DSPATR(UL)
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A                                      OVRDTA
     A            G1             2A  B 14 32DSPATR(UL)
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A                                      OVRDTA
     A            G2             2A  B 14 35DSPATR(UL)
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A                                      OVRDTA
     A            G3             2A  B 14 38DSPATR(UL)
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A                                      OVRDTA
     A            G4             2A  B 14 42DSPATR(UL)
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A                                      OVRDTA
     A            G5             2A  B 14 45DSPATR(UL)
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(PC)
     A                                      OVRDTA
     A            R4            30A  B 14 50DSPATR(UL)
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A                                      OVRDTA
     A            NUM5           6A  B 16  3DSPATR(UL)
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A                                      OVRDTA
     A            H1             2A  B 16 14DSPATR(UL)
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A                                      OVRDTA
     A            H2             2A  B 16 17DSPATR(UL)
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A                                      OVRDTA
     A            H3             2A  B 16 20DSPATR(UL)
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A                                      OVRDTA
     A            H4             2A  B 16 24DSPATR(UL)
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A                                      OVRDTA
     A            H5             2A  B 16 27DSPATR(UL)
     A  54                                  DSPATR(RI)
     A  54                                  DSPATR(PC)
     A                                      OVRDTA
     A            I1             2A  B 16 32DSPATR(UL)
     A  55                                  DSPATR(RI)
     A  55                                  DSPATR(PC)
     A                                      OVRDTA
     A            I2             2A  B 16 35DSPATR(UL)
     A  56                                  DSPATR(RI)
     A  56                                  DSPATR(PC)
     A                                      OVRDTA
     A            I3             2A  B 16 38DSPATR(UL)
     A  57                                  DSPATR(RI)
     A  57                                  DSPATR(PC)
     A                                      OVRDTA
     A            I4             2A  B 16 42DSPATR(UL)
     A  58                                  DSPATR(RI)
     A  58                                  DSPATR(PC)
     A                                      OVRDTA
     A            I5             2A  B 16 45DSPATR(UL)
     A  59                                  DSPATR(RI)
     A  59                                  DSPATR(PC)
     A                                      OVRDTA
     A            R5            30A  B 16 50DSPATR(UL)
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A                                      OVRDTA
     A            NUM6           6A  B 18  3DSPATR(UL)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                      OVRDTA
     A            J1             2A  B 18 14DSPATR(UL)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A                                      OVRDTA
     A            J2             2A  B 18 17DSPATR(UL)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A                                      OVRDTA
     A            J3             2A  B 18 20DSPATR(UL)
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A                                      OVRDTA
     A            J4             2A  B 18 24DSPATR(UL)
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A                                      OVRDTA
     A            J5             2A  B 18 27DSPATR(UL)
     A  66                                  DSPATR(RI)
     A  66                                  DSPATR(PC)
     A                                      OVRDTA
     A            K1             2A  B 18 32DSPATR(UL)
     A  67                                  DSPATR(RI)
     A  67                                  DSPATR(PC)
     A                                      OVRDTA
     A            K2             2A  B 18 35DSPATR(UL)
     A  68                                  DSPATR(RI)
     A  68                                  DSPATR(PC)
     A                                      OVRDTA
     A            K3             2A  B 18 38DSPATR(UL)
     A  69                                  DSPATR(RI)
     A  69                                  DSPATR(PC)
     A                                      OVRDTA
     A            K4             2A  B 18 42DSPATR(UL)
     A  70                                  DSPATR(RI)
     A  70                                  DSPATR(PC)
     A                                      OVRDTA
     A            K5             2A  B 18 45DSPATR(UL)
     A  71                                  DSPATR(RI)
     A  71                                  DSPATR(PC)
     A                                      OVRDTA
     A            R6            30A  B 18 50DSPATR(UL)
     A  72                                  DSPATR(RI)
     A  72                                  DSPATR(PC)
     A                                      OVRDTA
     A            NUM7           6A  B 20  3DSPATR(UL)
     A  73                                  DSPATR(RI)
     A  73                                  DSPATR(PC)
     A                                      OVRDTA
     A            L1             2A  B 20 14DSPATR(UL)
     A  74                                  DSPATR(RI)
     A  74                                  DSPATR(PC)
     A                                      OVRDTA
     A            L2             2A  B 20 17DSPATR(UL)
     A  75                                  DSPATR(RI)
     A  75                                  DSPATR(PC)
     A                                      OVRDTA
     A            L3             2A  B 20 20DSPATR(UL)
     A  76                                  DSPATR(RI)
     A  76                                  DSPATR(PC)
     A                                      OVRDTA
     A            L4             2A  B 20 24DSPATR(UL)
     A  77                                  DSPATR(RI)
     A  77                                  DSPATR(PC)
     A                                      OVRDTA
     A            L5             2A  B 20 27DSPATR(UL)
     A  78                                  DSPATR(RI)
     A  78                                  DSPATR(PC)
     A                                      OVRDTA
     A            M1             2A  B 20 32DSPATR(UL)
     A  79                                  DSPATR(RI)
     A  79                                  DSPATR(PC)
     A                                      OVRDTA
     A            M2             2A  B 20 35DSPATR(UL)
     A  80                                  DSPATR(RI)
     A  80                                  DSPATR(PC)
     A                                      OVRDTA
     A            M3             2A  B 20 38DSPATR(UL)
     A  81                                  DSPATR(RI)
     A  81                                  DSPATR(PC)
     A                                      OVRDTA
     A            M4             2A  B 20 42DSPATR(UL)
     A  82                                  DSPATR(RI)
     A  82                                  DSPATR(PC)
     A                                      OVRDTA
     A            M5             2A  B 20 45DSPATR(UL)
     A  83                                  DSPATR(RI)
     A  83                                  DSPATR(PC)
     A                                      OVRDTA
     A            R7            30A  B 20 50DSPATR(UL)
     A  84                                  DSPATR(RI)
     A  84                                  DSPATR(PC)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R VPASWORD
     A                                      PUTOVR
     A*  88/11/15  11:14:00    T881S32     REL-R01M00  5728-PW1
     A                                  2  1'****  PASSWORD REQUIRED  ****'
     A                                  4  2'PROGRAM:'
     A                                  6  5'USER:'
     A                                  8  1'TERMINAL:'
     A                                 12 30' AND PRESS "ENTER" KEY.'
     A            PROGNAME       8A  B  4 12DSPATR(PR)
     A                                      OVRDTA
     A            SG             8A  B  6 12DSPATR(PR)
     A                                      OVRDTA
     A            TERM           4A  B  8 12DSPATR(PR)
     A                                      OVRDTA
     A            INP1          16A  B 10 20DSPATR(PR)
     A                                      OVRDTA
     A            EP            17A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            PASSWORD       8A  B 12 21DSPATR(ND)
     A                                      OVRDTA
     A            ER            40A  B 16  5DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
