     A*****************************************************************
     A**                D I S P L A Y   F I L E
     A*****************************************************************
     A** FILE NAME  :  ZINITWOG
     A**
     A** DESCRIPTION:  DISPLAY FILE FOR WORK ORDER MAINT
     A**
     A** AUTHOR     :  DAN RAUCH - EXLTECH, LLC
     A** CREATED    :  APR 21, 2005
     A**
     A*****************************************************************
      **          M O D I F I C A T I O N    H I S T O R Y
      *****************************************************************
DCR01 *  APR 21, 2005  DCR01  DAN RAUCH       REQUEST# 2005-78291
DCR01 *  ADDED VERBAGE AT THE BOTTOM OF FORMAT INITWOG FOR CALLS TO
DCR01 *  CRAFT & EQUIP SELECTION PGMS
DCR01 * ---------------------------------------------------------------
     A                                      DSPSIZ(24 80 *DS3)
     A                                      INDARA
     A                                      INVITE
     A                                      PRINT
     A                                      CHGINPDFT
     A          R INITWOG
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3'-----------------------------------
     A                                      -------------    Workorder Type:'
     A            T              1A  B  2 71DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI PC)
     A                                  3  3':  W O R K   O R D E R   I N I T I'
     A                                  3 38'A T I O N  :'
     A                                  3 62'Verbal:  V'
     A                                  4  3'-----------------------------------
     A                                      -------------'
     A                                  4 61'Planned:  P'
     A                                  5 58'Engineered:  E'
     A                                  7  3'Requestor'
     A            REQUESTOR     16A  B  7 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI PC)
     A                                  7 57'Equipment Number'
     A            EQPNUM         6A  B  7 74DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI PC)
     A                                  9  3'Priority   Equipment Down   W/O De-
     A                                      scription'
     A                                  9 66'Skill Required'
     A                                 10  3'--------   --------------   -------
     A                                      ------------------------     -------
     A                                      --------'
     A            P              1A  B 11  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI PC)
     A            EQPDWN         1A  B 11 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI PC)
     A            DESC          30A  B 11 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI PC)
     A            CRAFT1         2A  B 11 66DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI PC)
     A            CRAFT2         2A  B 11 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI PC)
     A            CRAFT3         2A  B 11 74DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI PC)
     A                                 13  3'Additional Information:'
     A            DES2A         66A  B 14  7DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI PC)
     A            DES2B         66A  B 15  7DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI PC)
     A                                 17  3'REPEAT DATA (Screen will not clear-
     A                                       last workorder data):'
     A            REPT           1A  B 17 62DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI PC)
     A                                 18 46'Any character will cause REPEAT'
     A            ASBESTOS      36A  B 20 10OVRDTA
     A                                      DSPATR(PR)
     A            XFLAG          1A  B 20 48
     A  80                                  DSPATR(UL)
     A N80                                  DSPATR(PR)
     A                                      OVRATR
     A                                      OVRDTA
     A            ASBMSG2       16A  B 20 51DSPATR(PR)
     A                                      OVRDTA
     A            MSG           50A  B 22 14DSPATR(PR)
     A                                      OVRDTA
     A                                 23 23'ENTER DATA AND PRESS "ENTER" KEY'
DCR01A****************************************************************
DCR01A**********  COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN TO MENU f3-EXIT P-
DCR01A************************              ROGRAM                             -
DCR01A************************                               ')
DCR01A****************************************************************
DCR01A            COMMANDLN1    79A  B 24  1DFTVAL('F1-MENU  F3-EXIT F5-EQUIP-S-
DCR01A                                      EL F6-CRAFT-SEL                    -
DCR01A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
