     A*  90/12/28  09:09:05    T881S28     REL-R03M00  5728-PW1
     A*            13:02:39    T881S28     ZINQMFR
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A          R INQMFR
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 74'CP1-4-3'
     A                                  2 18'-----------------------------------
     A                                      -----------'
     A                                  3 18'.'
     A                                  3 31'I N Q U I R Y   B Y'
     A                                  3 62'.'
     A                                  4 18'.'
     A                                  4 62'.'
     A                                  5 18'.'
     A                                  5 29'M A N U F A C T U R E R'
     A                                  5 62'.'
     A                                  6 18'-----------------------------------
     A                                      -----------'
     A                                  9 10'MANUFACTURER'
     A                                  9 37'MANUFACTURER"S PART NUMBER (OPTION-
     A                                      AL)'
     A                                 13  5'SELECTION OPTIONS:'
     A                                 15  5'KEYWORD'
     A                                 15 33'MODIFIER'
     A                                 17  5'MAJOR GROUP'
     A                                 17 23'SUB GROUP'
     A                                 17 40'FIRST DIGIT OF SEQUENCE'
     A                                 19  5'TYPE MANUFACTURER NAME, MANUFACTUR-
     A                                      ER"S PART NUMBER, OR BOTH'
     A                                 20  5'THEN TYPE ONE OR MORE OPTIONAL SEL-
     A                                      ECTIONS IF DESIRED.'
     A                                 21  5'PRESS "ENTER" TO RETRIEVE CODES AN-
     A                                      D THEIR PRIMARY LANGUAGE DESCRIPTIO-
     A                                      NS'
     A                                 22 12'"f1"   TO RETRIEVE CODES AND THEIR'
     A                                 22 47'SECONDARY LANGUAGE DESCRIPTIONS'
     A                                 23 12'"f3"   TO RETURN TO THE INQUIRY ME-
     A                                      NU'
     A            MANUFACTUR    26A  B 10 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            MANPARTNO     20A  B 10 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            XXX            3A  B 10 67DSPATR(PR)
     A                                      OVRDTA
     A            KEYWORD       19A  B 15 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            MODIFIER      30A  B 15 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            MG             2A  B 17 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            SG             2A  B 17 33DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            F              1A  B 17 64DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-SECOND LANGUAGE f2-MAJ G-
     A                                      RP INQUIRY                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INQKWM
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 74'CP1-4-2'
     A                                  2 18'-----------------------------------
     A                                      -----------'
     A                                  3 18'.'
     A                                  3 31'I N Q U I R Y   B Y'
     A                                  3 62'.'
     A                                  4 18'.'
     A                                  4 62'.'
     A                                  5 18'.      K E Y W O R D / M O D I F I'
     A                                  5 53'E R      .'
     A                                  6 18'-----------------------------------
     A                                      -----------'
     A                                  9 15'KEYWORD'
     A                                  9 37'MODIFIER'
     A                                 13  5'SELECTION OPTIONS:'
     A                                 15  5'MAJOR GROUP'
     A                                 15 23'SUB GROUP'
     A                                 15 40'FIRST DIGIT OF SEQUENCE'
     A                                 20  5'PRESS "ENTER" TO RETRIEVE CODES AN-
     A                                      D THEIR PRIMARY LANGUAGE DESCRIPTIO-
     A                                      NS'
     A                                 21 12'"f1"   TO RETRIEVE CODES AND THEIR'
     A                                 21 47'SECONDARY LANGUAGE DESCRIPTIONS'
     A                                 22 12'"f3"   TO RETURN TO THE INQUIRY ME-
     A                                      NU'
     A            KEYWORD       19A  B 10 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            MODIFIER      30A  B 10 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            DUMMY         19A  B 14  5DSPATR(PR)
     A                                      OVRDTA
     A            DUMMY2        30A  B 14 26DSPATR(PR)
     A                                      OVRDTA
     A            MG             2A  B 15 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            SG             2A  B 15 33DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            F              1A  B 15 64DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-SECOND LANGUAGE f2-MAJ G-
     A                                      RP INQUIRY                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A*         **** SUBFILE RECORD ***
     A          R RDSF                      SFL
     A  14                                  SFLNXTCHG
     A*  89/03/02  10:42:16    T881S28     REL-R01M02  5728-PW1
     A            VKSELECT       1A  B  3  2DSPATR(UL)
     A            VKCODE         7A  B  3  4DSPATR(PR)
     A                                      DSPATR(UL)
     A            VKTYPE         3A  B  3 12DSPATR(PR)
     A            VKPARTNO      20A  B  3 16DSPATR(PR)
     A            VKKWM         44A  B  3 37DSPATR(PR)
     A            VKDESCLN      79A  B  4  2DSPATR(PR)
     A          R RDSC                      SFLCTL(RDSF)
     A*  89/03/02  12:52:03    T881S28     REL-R01M02  5728-PW1
     A                                      CF03(03)
     A                                      ROLLUP(78)
     A                                      OVERLAY
     A  75                                  SFLDSP
     A  76                                  SFLDSPCTL
     A  77                                  SFLCLR
     A N74                                  SFLEND
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(0009)
     A            RCDNBR         4S 0H      SFLRCDNBR
     A            MANUFACTUR    50A  B  1 19DSPATR(PR)
     A                                  1 72'CP1-4-2A'
     A                                  2  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ------'
     A          R RDSB
     A*  90/12/28  09:09:05    T881S28     REL-R03M00  5728-PW1
     A                                 21  2'FOR MORE INFORMATION ON ANY CODE,'
     A                                 21 36'SELECT IT BY TYPING AN "X" AND PRE-
     A                                      SS "ENTER"'
     A                                 22  2'Use '
     A                                 22  7'S'
     A                                 22  9' or '
     A                                 22 14'Y'
     A                                 22 16' to SELECT a code to bring back to-
     A                                       prior screen'
