     A*  89/07/19  10:54:36    A034675     REL-R01M02  5728-PW1
     A*            19:22:23    T881S28     VINVINQ.HPTO38.CME
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A          R INVINQ1
     A*  89/07/19  10:54:36    A034675     REL-R01M02  5728-PW1
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      PUTOVR
     A                                  1 20'I N V O I C E    I N Q U I R Y'
     A                                  1 73'INQ-1'
     A                                  2 20'---   (SELECTION SCREEN)   ---'
     A                                  4  1'SELECT ONE OPTION:  1)  REGISTER N-
     A                                      O.'
     A                                  5 25'PO ITEM NUMBER'
     A                                  6 27'(PO ITEM NO. IS OPTIONAL WHEN REVI-
     A                                      EWING ITEMS "f2")'
     A                                  8 33'- OR -'
     A                                 10 21'2)  INVOICE NO.'
     A                                 12 33'- OR -'
     A                                 14 21'3)  PURCHASE ORDER'
     A                                 16 33'- OR -'
     A                                 18 21'4)  VENDOR CODE'
     A                                 20  1'PRESS "f1" TO REVIEW HEADER DATA'
     A                                 21  7'"f2" TO REVIEW ITEMS'
     A                                 21 44'SEARCH HISTORY DATA BASE  '
     A                                 22  7'"f3" TO END PROGRAM'
     A            REGNO          5Y 0B  4 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            ITEM           4Y 0B  5 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            INVOICENO     14A  B 10 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            PONUM          7A  B 14 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            RLE            3Y 0B 14 50DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            VENDORCODE    10A  B 18 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            A              1A  B 21 71DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-REVIEW HEADER f2-REVIEW -
     A                                      ITEMS f3-END PROGRAM f4-SWITCH DB')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INVINQ2
     A*  89/07/19  10:54:36    A034675     REL-R01M02  5728-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 16'I N V O I C E   I N Q U I R Y'
     A                                  1 76'INQ-2'
     A                                  2 16'---    (HEADER DATA)      ---'
     A                                  2 76'-----'
     A                                  4  7'PO #'
     A                                  4 27'INVOICE #'
     A                                  4 56'REGISTER #'
     A                                  7  2'STATUS    MANIFEST NUMBER    CHECK'
     A                                  7 37'NUMBER    CHECK DATE   NO CHECK IN-
     A                                      DIC.'
     A                                 10  1'INVOICE DATE    DUE DATE   TERMS'
     A                                 10 37'ENTRY DATE    MODIFY DATE    ADD I-
     A                                      D   MOD ID'
     A                                 13  3'MAT"L CE     INV MAT"L EXT     PO'
     A                                 13 37'MAT"L EXT     PAYMENT ID     VENDO-
     A                                      R CODE'
     A                                 16 10'NET DUE VENDOR    DISTRIBUTED COST'
     A                                 16 51'CURRENCY CODE'
     A                                 16 66'RECEIVER'
     A                                 18  2'HOLD OPTION FREE VERBAGE'
     A            HISTLIT       20A  B  1 51DSPATR(PR)
     A                                      OVRDTA
     A            PO             7A  B  4 12DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  4 20DSPATR(PR)
     A                                      OVRDTA
     A            INVNUM        14A  B  4 38DSPATR(PR)
     A                                      OVRDTA
     A            RNUM           5A  B  4 68DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B  6  2DSPATR(PR)
     A                                      OVRDTA
     A            MFNUM          8A  B  6 13DSPATR(PR)
     A                                      OVRDTA
     A            CHKNO          8A  B  6 33DSPATR(PR)
     A                                      OVRDTA
     A            CHKDATE        8A  B  6 48DSPATR(PR)
     A                                      OVRDTA
     A            X              1A  B  6 65DSPATR(PR)
     A                                      OVRDTA
     A            IDATE          8A  B  9  1DSPATR(PR)
     A                                      OVRDTA
     A            DDATE          8A  B  9 17DSPATR(PR)
     A                                      OVRDTA
     A            TM             2A  B  9 28DSPATR(PR)
     A                                      OVRDTA
     A            EDATE          8A  B  9 37DSPATR(PR)
     A                                      OVRDTA
     A            MDATE          8A  B  9 51DSPATR(PR)
     A                                      OVRDTA
     A            ACLK           4A  B  9 66DSPATR(PR)
     A                                      OVRDTA
     A            MCLK           4A  B  9 75DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 12  3DSPATR(PR)
     A                                      OVRDTA
     A            IMATEXT       15A  B 12 14DSPATR(PR)
     A                                      OVRDTA
     A            PMATEXT       15A  B 12 31DSPATR(PR)
     A                                      OVRDTA
     A            P              1A  B 12 51DSPATR(PR)
     A                                      OVRDTA
     A            VENCODE        7A  B 12 66DSPATR(PR)
     A                                      OVRDTA
     A            VC             3A  B 12 74DSPATR(PR)
     A                                      OVRDTA
     A            NETDUEVEN     15A  B 15  9DSPATR(PR)
     A                                      OVRDTA
     A            DISTCOST      15A  B 15 29DSPATR(PR)
     A                                      OVRDTA
     A            CC             2A  B 15 49DSPATR(PR)
     A                                      OVRDTA
     A            CURCODEDES    12A  B 15 52DSPATR(PR)
     A                                      OVRDTA
     A            RCVR           3A  B 15 68DSPATR(PR)
     A                                      OVRDTA
     A            HOLDVERBAG    20A  B 18 28DSPATR(PR)
     A                                      OVRDTA
     A            MSGLINE       60A  B 21  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-INVOICE TOTAL f2-CE DEDU-
     A                                      CTS. f3-SELECT SCREEN f4-REVIEW ITE-
     A                                      MS f5-DIST. COST')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INVINQ3
     A*  89/07/19  10:54:36    A034675     REL-R01M02  5728-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 16'I N V O I C E   I N Q U I R Y'
     A                                  1 76'INQ-3'
     A                                  2 17'(INVOICE AMOUNT CALCULATED)'
     A                                  2 76'-----'
     A                                  4  7'PO #'
     A                                  4 28'INVOICE #'
     A                                  4 57'REGISTER #'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  7  4'AMOUNT ENTERED FROM INVOICE'
     A                                  7 52'C/E'
     A                                  7 59'CE ACCTG'
     A                                  9  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                 11 13'MATERIAL EXTENSION'
     A                                 13  3'INCLUDE ANY:     FREIGHT'
     A                                 13 53'FOB'
     A                                 14 20'TAX'
     A                                 14 53'TAX CODE'
     A                                 15 20'CONTAINERS'
     A                                 16 20'INSURANCE'
     A                                 17 20'OTHER'
     A                                 18 33'--------------'
     A                                 20  6'CALCULATED INVOICE AMOUNT'
     A            HISTLIT       20A  B  1 51DSPATR(PR)
     A                                      OVRDTA
     A            PO             7A  B  4 13DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  4 21DSPATR(PR)
     A                                      OVRDTA
     A            INVNUM        14A  B  4 39DSPATR(PR)
     A                                      OVRDTA
     A            RNUM           5A  B  4 69DSPATR(PR)
     A                                      OVRDTA
     A            INVAMT        15A  B  7 34DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  7 56DSPATR(PR)
     A                                      OVRDTA
     A            CEACCTG        9A  B  7 68DSPATR(PR)
     A                                      OVRDTA
     A            MATEXT        15A  B 11 34DSPATR(PR)
     A                                      OVRDTA
     A            VFRT          15A  B 13 34DSPATR(PR)
     A                                      OVRDTA
     A            FOB           20A  B 13 58DSPATR(PR)
     A                                      OVRDTA
     A            VTAX          15A  B 14 34DSPATR(PR)
     A                                      OVRDTA
     A            T              2A  B 14 63DSPATR(PR)
     A                                      OVRDTA
     A            VCNTRS        15A  B 15 34DSPATR(PR)
     A                                      OVRDTA
     A            VINS          15A  B 16 34DSPATR(PR)
     A                                      OVRDTA
     A            VOTHER        15A  B 17 34DSPATR(PR)
     A                                      OVRDTA
     A            CINVAMT       15A  B 20 34DSPATR(PR)
     A                                      OVRDTA
     A            MSGLINE       60A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-INVOICE HEADER f2-CE DED-
     A                                      UCTS. f3-SELECT SCREEN f4-REVIEW IT-
     A                                      EMS f5-DIST. COST')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INVINQ4
     A*  89/07/19  10:54:36    A034675     REL-R01M02  5728-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 16'I N V O I C E   I N Q U I R Y'
     A                                  1 76'INQ-4'
     A                                  2 16'(CLASS OF ENTRY DEDUCTIONS)'
     A                                  2 76'-----'
     A                                  3  7'PO #'
     A                                  3 28'INVOICE #'
     A                                  3 57'REGISTER #'
     A                                  5  6'* AMOUNT ENTERED FROM INVOICE'
     A                                  5 55'C/E'
     A                                  5 62'CE ACCTG'
     A                                  7  1'C/E DEDUCTIONS: (6) EXTENSION ERRO-
     A                                      R'
     A                                  8 17'(7) UNIT PRICE ERROR'
     A                                  9 17'(8) CORRECTION OTHER'
     A                                 11  8'* CALCULATED INVOICE AMOUNT'
     A                                 13 18'(3) FREIGHT'
     A                                 14 18'(4) INSURANCE'
     A                                 15 18'(5) TAX'
     A                                 16 18'(9) CASH DISCOUNT'
     A                                 17  1'CONTRACTOR"S PAYMENT WITHHELD (CPW-
     A                                      )'
     A                                 19 13'C/E  '
     A                                 19 23'OTHER C/E'
     A                                 19 55'C/E ACCTG'
     A                                 21 18'* NET DUE VENDOR'
     A            HISTLIT       20A  B  1 51DSPATR(PR)
     A                                      OVRDTA
     A            PO             7A  B  3 13DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  3 21DSPATR(PR)
     A                                      OVRDTA
     A            INVNUM        14A  B  3 39DSPATR(PR)
     A                                      OVRDTA
     A            RNUM           5A  B  3 69DSPATR(PR)
     A                                      OVRDTA
     A            OINVAMT       15A  B  5 38DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  5 59DSPATR(PR)
     A                                      OVRDTA
     A            CEACCT         9A  B  5 71DSPATR(PR)
     A                                      OVRDTA
     A            DEXTERR       15A  B  7 38DSPATR(PR)
     A                                      OVRDTA
     A            DPRCERR       15A  B  8 38DSPATR(PR)
     A                                      OVRDTA
     A            DOTHER        15A  B  9 38DSPATR(PR)
     A                                      OVRDTA
     A            CINVAMT       15A  B 11 38DSPATR(PR)
     A                                      OVRDTA
     A            DFRT          15A  B 13 38DSPATR(PR)
     A                                      OVRDTA
     A            DINS          15A  B 14 38DSPATR(PR)
     A                                      OVRDTA
     A            DTAX          15A  B 15 38DSPATR(PR)
     A                                      OVRDTA
     A            DDSCNT        15A  B 16 38DSPATR(PR)
     A                                      OVRDTA
     A            DCPW          15A  B 17 38DSPATR(PR)
     A                                      OVRDTA
     A            CPW            4A  B 17 56DSPATR(PR)
     A                                      OVRDTA
     A            O              1A  B 19 19DSPATR(PR)
     A                                      OVRDTA
     A            DEOTHER       15A  B 19 38DSPATR(PR)
     A                                      OVRDTA
     A            CEOACCT        9A  B 19 66DSPATR(PR)
     A                                      OVRDTA
     A            NDV           15A  B 21 38DSPATR(PR)
     A                                      OVRDTA
     A            MSGLINE       60A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-INVOICE HEADER f2-INV TO-
     A                                      TAL F3-SELECT SCREEN F4-REVIEW ITEM-
     A                                      S F5-DIST COST')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INVINQ5
     A*  89/07/19  10:54:36    A034675     REL-R01M02  5728-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 16'I N V O I C E   I N Q U I R Y'
     A                                  1 76'INQ-5'
     A                                  2 16'---   (DISTRIBUTED COST)  ---'
     A                                  2 76'-----'
     A                                  4  7'PO #'
     A                                  4 28'INVOICE #'
     A                                  4 57'REGISTER #'
     A                                  6 17'NET DUE VENDOR'
     A                                  8  1'ADJUSTMENTS: CASH DISCOUNTS (C/E 9-
     A                                      )'
     A                                  9 14'CONTAINERS'
     A                                 10 14'C.P.W.'
     A                                 11 14'TOTAL COLLECT FREIGHT'
     A                                 12 14'OTHER'
     A                                 13 14'ACCRUED TAX :'
     A                                 18 11'COST TO BE DISTRIBUTED'
     A            HISTLIT       20A  B  1 51DSPATR(PR)
     A                                      OVRDTA
     A            PO             7A  B  4 13DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  4 21DSPATR(PR)
     A                                      OVRDTA
     A            INVNUM        14A  B  4 39DSPATR(PR)
     A                                      OVRDTA
     A            RNUM           5A  B  4 69DSPATR(PR)
     A                                      OVRDTA
     A            NDV           15A  B  6 38DSPATR(PR)
     A                                      OVRDTA
     A            ADSCNT        15A  B  8 38DSPATR(PR)
     A                                      OVRDTA
     A            ACTNRS        15A  B  9 38DSPATR(PR)
     A                                      OVRDTA
     A            ACPW          15A  B 10 38DSPATR(PR)
     A                                      OVRDTA
     A            ATCFRT        15A  B 11 38DSPATR(PR)
     A                                      OVRDTA
     A            AOTHER        15A  B 12 38DSPATR(PR)
     A                                      OVRDTA
     A            AACRTAX       15A  B 13 38DSPATR(PR)
     A                                      OVRDTA
     A            ATAXDESC1     15A  B 13 54DSPATR(PR)
     A                                      OVRDTA
     A            ATAXACCT1      9A  B 13 70DSPATR(PR)
     A                                      OVRDTA
     A            AACRTAX2      15A  B 14 38DSPATR(PR)
     A                                      OVRDTA
     A            ATAXDESC2     15A  B 14 54DSPATR(PR)
     A                                      OVRDTA
     A            ATAXACCT2      9A  B 14 70DSPATR(PR)
     A                                      OVRDTA
     A            AACRTAX3      15A  B 15 38DSPATR(PR)
     A                                      OVRDTA
     A            ATAXDESC3     15A  B 15 54DSPATR(PR)
     A                                      OVRDTA
     A            ATAXACCT3      9A  B 15 70DSPATR(PR)
     A                                      OVRDTA
     A            AACRTAX4      15A  B 16 38DSPATR(PR)
     A                                      OVRDTA
     A            ATAXDESC4     15A  B 16 54DSPATR(PR)
     A                                      OVRDTA
     A            ATAXACCT4      9A  B 16 70DSPATR(PR)
     A                                      OVRDTA
     A            DCOST         15A  B 18 38DSPATR(PR)
     A                                      OVRDTA
     A            MSGLINE       60A  B 21  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-INVOICE HEADER f2-CE DED-
     A                                      UCTS. f3-SELECT f4-REVIEW ITEMS f5--
     A                                      GDYR PAID FRT')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INVINQ6
     A*  89/07/19  10:54:36    A034675     REL-R01M02  5728-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 16'I N V O I C E   I N Q U I R Y'
     A                                  1 76'INQ-6'
     A                                  2 16'-- (GOODYEAR PAID FREIGHT) --'
     A                                  2 76'-----'
     A                                  4  7'PO #'
     A                                  4 28'INVOICE #'
     A                                  4 57'REGISTER #'
     A                                  6 25'***  GOODYEAR PAID FREIGHT  ***'
     A                                  7 29'-----------------------'
     A                                  9  2'RCVR    CARRIER CODE      PRO NUMB-
     A                                      ER'
     A                                  9 46'RAIL CAR NO'
     A                                  9 65'AMOUNT'
     A                                 10  2'----   --------------    ----------
     A                                      ---'
     A                                 10 46'------------      --------'
     A            HISTLIT       20A  B  1 51DSPATR(PR)
     A                                      OVRDTA
     A            PO             7A  B  4 13DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  4 21DSPATR(PR)
     A                                      OVRDTA
     A            INVNUM        14A  B  4 39DSPATR(PR)
     A                                      OVRDTA
     A            RNUM           5A  B  4 69DSPATR(PR)
     A                                      OVRDTA
     A            R1             3A  B 11  2DSPATR(PR)
     A                                      OVRDTA
     A            CC1            4A  B 11 14DSPATR(PR)
     A                                      OVRDTA
     A            PRO1          16A  B 11 28DSPATR(PR)
     A                                      OVRDTA
     A            CARNO1        10A  B 11 46DSPATR(PR)
     A                                      OVRDTA
     A            AMT1          15A  B 11 60DSPATR(PR)
     A                                      OVRDTA
     A            R2             3A  B 12  2DSPATR(PR)
     A                                      OVRDTA
     A            CC2            4A  B 12 14DSPATR(PR)
     A                                      OVRDTA
     A            PRO2          16A  B 12 28DSPATR(PR)
     A                                      OVRDTA
     A            CARNO2        10A  B 12 46DSPATR(PR)
     A                                      OVRDTA
     A            AMT2          15A  B 12 60DSPATR(PR)
     A                                      OVRDTA
     A            R3             3A  B 13  2DSPATR(PR)
     A                                      OVRDTA
     A            CC3            4A  B 13 14DSPATR(PR)
     A                                      OVRDTA
     A            PRO3          16A  B 13 28DSPATR(PR)
     A                                      OVRDTA
     A            CARNO3        10A  B 13 46DSPATR(PR)
     A                                      OVRDTA
     A            AMT3          15A  B 13 60DSPATR(PR)
     A                                      OVRDTA
     A            R4             3A  B 14  2DSPATR(PR)
     A                                      OVRDTA
     A            CC4            4A  B 14 14DSPATR(PR)
     A                                      OVRDTA
     A            PRO4          16A  B 14 28DSPATR(PR)
     A                                      OVRDTA
     A            CARNO4        10A  B 14 46DSPATR(PR)
     A                                      OVRDTA
     A            AMT4          15A  B 14 60DSPATR(PR)
     A                                      OVRDTA
     A            R5             3A  B 15  2DSPATR(PR)
     A                                      OVRDTA
     A            CC5            4A  B 15 14DSPATR(PR)
     A                                      OVRDTA
     A            PRO5          16A  B 15 28DSPATR(PR)
     A                                      OVRDTA
     A            CARNO5        10A  B 15 46DSPATR(PR)
     A                                      OVRDTA
     A            AMT5          15A  B 15 60DSPATR(PR)
     A                                      OVRDTA
     A            R6             3A  B 16  2DSPATR(PR)
     A                                      OVRDTA
     A            CC6            4A  B 16 14DSPATR(PR)
     A                                      OVRDTA
     A            PRO6          16A  B 16 28DSPATR(PR)
     A                                      OVRDTA
     A            CARNO6        10A  B 16 46DSPATR(PR)
     A                                      OVRDTA
     A            AMT6          15A  B 16 60DSPATR(PR)
     A                                      OVRDTA
     A            R7             3A  B 17  2DSPATR(PR)
     A                                      OVRDTA
     A            CC7            4A  B 17 14DSPATR(PR)
     A                                      OVRDTA
     A            PRO7          16A  B 17 28DSPATR(PR)
     A                                      OVRDTA
     A            CARNO7        10A  B 17 46DSPATR(PR)
     A                                      OVRDTA
     A            AMT7          15A  B 17 60DSPATR(PR)
     A                                      OVRDTA
     A            R8             3A  B 18  2DSPATR(PR)
     A                                      OVRDTA
     A            CC8            4A  B 18 14DSPATR(PR)
     A                                      OVRDTA
     A            PRO8          16A  B 18 28DSPATR(PR)
     A                                      OVRDTA
     A            CARNO8        10A  B 18 46DSPATR(PR)
     A                                      OVRDTA
     A            AMT8          15A  B 18 60DSPATR(PR)
     A                                      OVRDTA
     A            R9             3A  B 19  2DSPATR(PR)
     A                                      OVRDTA
     A            CC9            4A  B 19 14DSPATR(PR)
     A                                      OVRDTA
     A            PRO9          16A  B 19 28DSPATR(PR)
     A                                      OVRDTA
     A            CARNO9        10A  B 19 46DSPATR(PR)
     A                                      OVRDTA
     A            AMT9          15A  B 19 60DSPATR(PR)
     A                                      OVRDTA
     A            R10            3A  B 20  2DSPATR(PR)
     A                                      OVRDTA
     A            CC10           4A  B 20 14DSPATR(PR)
     A                                      OVRDTA
     A            PRO10         16A  B 20 28DSPATR(PR)
     A                                      OVRDTA
     A            CARNO10       10A  B 20 46DSPATR(PR)
     A                                      OVRDTA
     A            AMT10         15A  B 20 60DSPATR(PR)
     A                                      OVRDTA
     A            MSGLINE       60A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-INVOICE HEADER f2-INVOIC-
     A                                      E TOTAL f3-SELECT F4-REVIEW ITEMS F-
     A                                      -5 DIST. COSTS')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INVINQ7
     A*  89/07/19  10:54:36    A034675     REL-R01M02  5728-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 16'I N V O I C E   I N Q U I R Y'
     A                                  1 76'INQ-7'
     A                                  2 16'---    (ITEM INQUIRY)     ---'
     A                                  2 76'-----'
     A                                  3  7'PO #'
     A                                  3 28'INVOICE #'
     A                                  3 57'REGISTER #'
     A                                  5  1'ITEM  CORP CODE'
     A                                  5 24'QUANTITY PAID   UM'
     A                                  5 50'UNIT PRICE     EXTENDED PRICE'
     A                                  6  1'DESCRIPTION **********************-
     A                                      ***********************************-
     A                                      **********'
     A                                  7 16'PO ==>'
     A                                  8 11'INVOICE ==>'
     A                                  9 30'TAX CODE'
     A                                 16 20'PRIME   SUB   SUB-D   ADDL DATA'
     A                                 16 54'PERCENT'
     A                                 17 13'PO ==>'
     A            HISTLIT       20A  B  1 51DSPATR(PR)
     A                                      OVRDTA
     A            PO             7A  B  3 13DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  3 21DSPATR(PR)
     A                                      OVRDTA
     A            INVNUM        14A  B  3 39DSPATR(PR)
     A                                      OVRDTA
     A            RNUM           5A  B  3 69DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4A  B  7  1DSPATR(PR)
     A                                      OVRDTA
     A            CRPCODE        7A  B  7  7DSPATR(PR)
     A                                      OVRDTA
     A            UNPDQTY       14A  B  7 24DSPATR(PR)
     A                                      OVRDTA
     A            PU             2A  B  7 40DSPATR(PR)
     A                                      OVRDTA
     A            PUPRICE       17A  B  7 44DSPATR(PR)
     A                                      OVRDTA
     A            PEXT          17A  B  7 63DSPATR(PR)
     A                                      OVRDTA
     A            IQTYPD        14A  B  8 24DSPATR(PR)
     A                                      OVRDTA
     A            IU             2A  B  8 40DSPATR(PR)
     A                                      OVRDTA
     A            IUPRICE       17A  B  8 44DSPATR(PR)
     A                                      OVRDTA
     A            IEXT          17A  B  8 63DSPATR(PR)
     A                                      OVRDTA
     A            TX             2A  B  9 26DSPATR(PR)
     A                                      OVRDTA
     A            MEMOQTYMSG    36A  B  9 43DSPATR(PR)
     A                                      OVRDTA
     A            DESCLINE01    79A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            DESCLINE02    79A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            DESCLINE03    79A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            DESCLINE04    79A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            PR1            3A  B 17 21DSPATR(PR)
     A                                      OVRDTA
     A            S1             3A  B 17 28DSPATR(PR)
     A                                      OVRDTA
     A            SD1            4A  B 17 34DSPATR(PR)
     A                                      OVRDTA
     A            AD1            6A  B 17 42DSPATR(PR)
     A                                      OVRDTA
     A            PC1            6A  B 17 55DSPATR(PR)
     A                                      OVRDTA
     A            PR2            3A  B 18 21DSPATR(PR)
     A                                      OVRDTA
     A            S2             3A  B 18 28DSPATR(PR)
     A                                      OVRDTA
     A            SD2            4A  B 18 34DSPATR(PR)
     A                                      OVRDTA
     A            AD2            6A  B 18 42DSPATR(PR)
     A                                      OVRDTA
     A            PC2            6A  B 18 55DSPATR(PR)
     A                                      OVRDTA
     A            PR3            3A  B 19 21DSPATR(PR)
     A                                      OVRDTA
     A            S3             3A  B 19 28DSPATR(PR)
     A                                      OVRDTA
     A            SD3            4A  B 19 34DSPATR(PR)
     A                                      OVRDTA
     A            AD3            6A  B 19 42DSPATR(PR)
     A                                      OVRDTA
     A            PC3            6A  B 19 55DSPATR(PR)
     A                                      OVRDTA
     A            PR4            3A  B 20 21DSPATR(PR)
     A                                      OVRDTA
     A            S4             3A  B 20 28DSPATR(PR)
     A                                      OVRDTA
     A            SD4            4A  B 20 34DSPATR(PR)
     A                                      OVRDTA
     A            AD4            6A  B 20 42DSPATR(PR)
     A                                      OVRDTA
     A            PC4            6A  B 20 55DSPATR(PR)
     A                                      OVRDTA
     A            PR5            3A  B 21 21DSPATR(PR)
     A                                      OVRDTA
     A            S5             3A  B 21 28DSPATR(PR)
     A                                      OVRDTA
     A            SD5            4A  B 21 34DSPATR(PR)
     A                                      OVRDTA
     A            AD5            6A  B 21 42DSPATR(PR)
     A                                      OVRDTA
     A            PC5            6A  B 21 55DSPATR(PR)
     A                                      OVRDTA
     A            MSGLINE       60A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  93                                  DSPATR(RI)
     A  93                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-SELECT SCREEN f4-REVIEW -
     A                                      HEADER')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
