     A*%%TS  SD  20021203  125930  A257947     REL-V5R1M0  5722-WDS
     A*            14:13:33    T881S28     VINVWS.HPTO38.CME
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A  98                                  INVITE
     A          R FALLCODE
     A*%%TS  SD  20021203  125930  A257947     REL-V5R1M0  5722-WDS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  4 14'%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%-
     A                                      %%%%%%%%%%%%%%%%%%%%%%%%%'
     A                                  5 14'%%'
     A                                  5 71'%%'
     A                                  6 14'%%'
     A                                  6 71'%%'
     A                                  7 14'%%     ----------------------------
     A                                      ----------------'
     A                                  7 71'%%'
     A                                  8 14'%%     : YOU HAVE CHOSEN THE OPTIO-
     A                                      N TO FREEZE OR :'
     A                                  8 71'%%'
     A                                  9 14'%%     :'
     A                                  9 63':'
     A                                  9 71'%%'
     A                                 10 14'%%     :  UNFREEZE ALL THE ITEMS I-
     A                                      N THE STORE.   :'
     A                                 10 71'%%'
     A                                 11 14'%%     ----------------------------
     A                                      ----------------'
     A                                 11 71'%%'
     A                                 12 14'%%'
     A                                 12 71'%%'
     A                                 13 14'%%      ---------------------------
     A                                      ----------------'
     A                                 13 71'%%'
     A                                 14 14'%%      :DO YOU WISH TO CONTINUE?'
     A                                 14 63':'
     A                                 14 71'%%'
     A                                 15 14'%%      ---------------------------
     A                                      ----------------'
     A                                 15 71'%%'
     A                                 16 14'%%'
     A                                 16 71'%%'
     A                                 17 14'%%'
     A                                 17 23'PRESS "F7" TO RETURN TO THE MAIN M-
     A                                      ENU.'
     A                                 17 71'%%'
     A                                 18 14'%%'
     A                                 18 23'PRESS "F3" TO EXIT.'
     A                                 18 71'%%'
     A                                 19 14'%%'
     A                                 19 71'%%'
     A                                 20 14'%%'
     A                                 20 71'%%'
     A                                 21 14'%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%-
     A                                      %%%%%%%%%%%%%%%%%%%%%%%%%'
     A            FILLER1       28A  H
     A            Y              1A  B 14 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            FILLER2        4A  H
     A            FILLER3        2   H
     A            COMMANDLN1    79A  B 24  1DFTVAL('f7-MAIN/ RESUME f3-END OF P-
     A                                      ROGRAM                             -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FCURWS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  3 10'-----------------------------------
     A                                      -------------------------'
     A                                  4 10':'
     A                                  4 68':'
     A                                  5 10':'
     A                                  5 19'Y O U R   C U R R E N T   W O R K'
     A                                  5 53'S H E E T      :'
     A                                  6 10':'
     A                                  6 68':'
     A                                  7 10':'
     A                                  7 68':'
     A                                  8 10':'
     A                                  8 35'N U M B E R'
     A                                  8 68':'
     A                                  9 10':'
     A                                  9 68':'
     A                                 10 10':'
     A                                 10 68':'
     A                                 11 10':'
     A                                 11 39'I S'
     A                                 11 68':'
     A                                 12 10':'
     A                                 12 68':'
     A                                 13 10':'
     A                                 13 68':'
     A                                 14 10':'
     A                                 14 68':'
     A                                 15 10':'
     A                                 15 68':'
     A                                 16 10':'
     A                                 16 68':'
     A                                 17 10':'
     A                                 17 68':'
     A                                 18 10':'
     A                                 18 20'PRESS ENTER, OR "F3" TO EXIT THIS'
     A                                 18 54'PROGRAM.      :'
     A                                 19 10':'
     A                                 19 68':'
     A                                 20 10'-----------------------------------
     A                                      -------------------------'
     A            WSNM           4A  B 14 38DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f7-MAIN RESUME f3-EXIT PROG-
     A                                      RAM                                -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FDUIN
     A*%%TS  SD  20021203  125930  A257947     REL-V5R1M0  5722-WDS
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      PUTOVR
     A                                  3 10'-----------------------------------
     A                                      -----------------------------'
     A                                  4 10':'
     A                                  4 72':'
     A                                  5 10':'
     A                                  5 18'FREEZING/UNFREEZING CODES DUE TO B-
     A                                      E INVENTORIED'
     A                                  5 72':'
     A                                  6 10':'
     A                                  6 72':'
     A                                  7 10'-----------------------------------
     A                                      -----------------------------'
     A                                 10 14'TO CONTINUE PROCESSING, TYPE A "Y"-
     A                                       AND PRESS ENTER:'
     A            FILLER1       28A  H
     A            Y              1A  B 10 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A                                 13 14'OPTIONAL:'
     A                                      DSPATR(UL)
     A                                 15 14'MAXIMUM NUMBER OF CODES TO FREEZE:'
     A            NUMCODES       4Y 0B 15 50DSPATR(UL)
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                      RANGE(0 9999)
     A                                      EDTCDE(Z)
     A            FILLER2        2   H
     A                                 19 22'PRESS "F7" TO RETURN TO THE MAIN M-
     A                                      ENU.'
     A                                 20 22'PRESS "F3" TO EXIT THE PROGRAM.'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f7-MAIN/ RESUME f3-EXIT PRO-
     A                                      GRAM                               -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FINVWS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 28'CREATE INVENTORY WORKSHEET'
     A                                  3  2'CHOOSE AN OPTION TO'
     A                                  3 27'(A) FREEZE    THE CODE.   ENTER A'
     A                                  3 61'OR B.'
     A                                  4 27'(B) UNFREEZE'
     A                                  6  2'NOW PRESS THE APPROPRIATE NUMBER T-
     A                                      O CHOOSE THE TYPE OF WORKSHEET'
     A                                  7  2'YOU WOULD LIKE:'
     A                                  8  9'1) SINGLE CODES'
     A                                  8 48'----------------------'
     A                                  9  9'2) A RANGE OF CODES'
     A                                  9 48':  CURRENT WORKSHEET :'
     A                                 10  9'3) A RANGE OF BIN LOCATIONS'
     A                                 10 48':'
     A                                 10 56'NUMBER'
     A                                 10 69':'
     A                                 11  9'4) A RANGE OF ACCOUNTING CLASSES'
     A                                 11 48':'
     A                                 11 69':'
     A                                 12  9'5) ALL CODES'
     A                                 12 48':   HIT f3 TO EXIT   :'
     A                                 13  9'6) ALL CODES DUE TO BE INVENTORIED'
     A                                 13 48'----------------------'
     A                                 14  9'7) A RANGE OF HIGH-USAGE AREAS'
     A                                 16  9'ENTER A SORT KEY FOR THE INVENTORY'
     A                                 16 48'(0) NO SORT'
     A                                 17 48'(1) SORT BY CODE'
     A                                 18 48'(2) SORT BY BIN LOC.'
     A                                 19  1'-----------------------------------
     A                                      -----------  (3) SORT BY CLASS'
     A                                 20  1'. ** NOTE:  IF YOU CHOOSE THE OPTI-
     A                                      ON TO     .  (4) SORT BY LAST INVEN-
     A                                      TORY DATE'
     A                                 21  1'. UNFREEZE CODES A WORKSHEET IS NO-
     A                                      T CREATED .  (5) SORT BY H-U AREA'
     A                                 22  1'-----------------------------------
     A                                      -----------  (6) SORT BY KEYWORD/MO-
     A                                      DIFIER'
     A            A              1A  B  3 22DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            B              1A  B  7 18DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            WSNM           4A  B 11 57DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 16 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-END PROGRAM             -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FRANGE
     A*%%TS  SD  20021203  125249  A257947     REL-V5R1M0  5722-WDS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 22'CREATE INVENTORY WORKSHEET'
     A                                  3 27'RANGE OF VALUES'
     A                                  6  9'Enter a range of corporate codes,'
     A                                  6 43'bin locations, accounting'
     A                                  7  9'classes, or high usage areas to ap-
     A                                      pear on the report.'
     A                                  9  9'Press f3 to return to main menu.'
     A                                 11  9'LOWEST'
     A                                 11 52'HIGHEST'
     A            LOW           12A  B 12  9DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            HIGH          12A  B 12 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                 15  9'OPTIONAL:'
     A                                      DSPATR(UL)
     A                                 17 14'SELECT FOR CLASS'
     A            CLAS           4A  B 17 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            FILLER1        1A  H
     A            FILLER2        4A  H
     A                                 17 38'ONLY'
     A                                 19 14'CODES WITH NO ACTIVITY IN'
     A            MONTHS         2Y 0B 19 41DSPATR(UL)
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                      RANGE(0 99)
     A                                      EDTCDE(Z)
     A                                 19 45'MONTHS'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-END                     -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FSINGLE
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 24'FREEZE/UNFREEZE SINGLE CODES'
     A                                  2  8'-----------------------------------
     A                                      -----------------------------'
     A                                  3  8':ENTER EACH CODE IN THE GRID BELOW-
     A                                      .  IF YOU WANT MORE THAN 10 :'
     A                                  4  8':CODES, SIMPLY PRESS "ENTER" AFTER'
     A                                  4 43'THE TENTH CODE AND A NEW   :'
     A                                  5  8':GRID WILL APPEAR.'
     A                                  5 70':'
     A                                  6  8':'
     A                                  6 70':'
     A                                  7  8':TO RETURN TO THE MAIN MENU PRESS'
     A                                  7 42'"F7" AND TO EXIT THE PROGRAM:'
     A                                  8  8':PRESS "F3".'
     A                                  8 70':'
     A                                  9  8'-----------------------------------
     A                                      -----------------------------'
     A                                 11 32'1. '
     A                                 12 32'2. '
     A                                 13 32'3. '
     A                                 14 32'4. '
     A                                 15 32'5. '
     A                                 16 32'6. '
     A                                 17 32'7. '
     A                                 18 32'8. '
     A                                 19 32'9. '
     A                                 20 31'10. '
     A            CODE1          7A  B 11 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            CODE2          7A  B 12 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            CODE3          7A  B 13 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            CODE4          7A  B 14 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            CODE5          7A  B 15 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            CODE6          7A  B 16 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            CODE7          7A  B 17 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            CODE8          7A  B 18 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            CODE9          7A  B 19 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            CODE10         7A  B 20 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f7-MAIN/ RESUME f3-EXIT PRO-
     A                                      GRAM                               -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
