     A*%%TS  SD  19931102  140554  T001575     REL-V2R2M0  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      INDARA
     A          R ALSTSFL                   SFL
     A*%%TS  SD  19931102  140554  T001575     REL-V2R2M0  5738-PW1
     A                                      CHGINPDFT
     A            OPT            1A  B  5  2DSPATR(UL)
     A                                      DSPATR(HI)
     A            ACTION         2A  B  5  5DSPATR(PR)
     A            RUNDT         10A  B  5  9DSPATR(PR)
     A            ACTDT         10A  B  5 22DSPATR(PR)
     A            STR_REG        5A  B  5 35DSPATR(PR)
     A            END_REG        5A  B  5 43DSPATR(PR)
     A            TOT_AMT       14A  B  5 51DSPATR(PR)
     A            TOT_REG        5A  B  5 68DSPATR(PR)
     A            SEQ            5A  B  5 75DSPATR(PR)
     A            STR_RECNUM     9S 0H
     A            END_RECNUM     9S 0H
     A          R ALSTSFLCTL                SFLCTL(ALSTSFL)
     A*%%TS  SD  19931102  140554  T001575     REL-V2R2M0  5738-PW1
     A                                      CHGINPDFT
     A                                      SFLSIZ(4000)
     A                                      SFLPAG(0017)
     A                                      SFLCSRRRN(&RELRCD)
     A                                      CA03(03 'EXIT')
     A                                      CF04(04 'PRINT')
     A                                      OVERLAY
     A                                      PUTOVR
     A  70                                  SFLDSP
     A  71                                  SFLDSPCTL
     A  72                                  SFLCLR
     A  73                                  SFLEND(*MORE)
     A N73                                  ROLLUP(75)
     A            RELRCD         5S 0H
     A            DSPREC         4S 0H      SFLRCDNBR(CURSOR)
     A                                  4  2'X'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  4  5'AC'
     A                                      DSPATR(UL)
     A                                  3  9'   RUN    '
     A                                  3 22' ACTIVITY '
     A                                  3 35'START'
     A                                  3 43' END '
     A                                  3 68'TOTAL'
     A                                  4  9'   DATE   '
     A                                      DSPATR(UL)
     A                                  4 22'   DATE   '
     A                                      DSPATR(UL)
     A                                  4 35' REG '
     A                                      DSPATR(UL)
     A                                  4 43' REG '
     A                                      DSPATR(UL)
     A                                  4 68' REG '
     A                                      DSPATR(UL)
     A                                  1 25'INVOICE GENERATION SUMMARY REPORTS'
     A                                      DSPATR(UL)
     A                                  4 51'   DOLLARS    '
     A                                      DSPATR(UL)
     A                                  3 51'    TOTAL     '
     A                                  3 75' SEQ '
     A                                  4 75' NUM '
     A                                      DSPATR(UL)
     A          R ALSTFKEY
     A                                      CHGINPDFT
     A  99                                  PUTOVR
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A                                 23  2'F1=         '
     A                                 23 15'2=       '
     A                                 23 28'3=EXIT'
     A                                 23 41'4=PRINT     '
     A                                 23 55'5=       '
     A                                 23 69'6=          '
     A                                 24  2'F7=         '
     A                                 24 15'8=          '
     A                                 24 28'9=        '
     A                                 24 40'10=         '
     A                                 24 54'11=          '
     A                                 24 68'12=         '
