     A*%%TS  SD  19990614  141018  A257947     REL-V4R2M0  5769-PW1
     A*  91/04/03  13:16:55    A171523     REL-R03M00  5728-PW1
     A*            16:00:19    T881S28     VINVOICE.HPTO38.CME
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A          R FINV01
     A                                      PUTOVR
     A                                  1 23'I N V O I C E   P R O C E S S I N'
     A                                  1 57'G'
     A                                  1 74'INV-1'
     A                                  2 20'-----------------------------------
     A                                      -------'
     A                                  2 73'-------'
     A                                 11 10'ENTER THE  PURCHASE ORDER  AND  PR-
     A                                      ESS  "ENTER"'
     A            PO             7A  B 11 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            RLS            3Y 0B 11 69DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-MODIFY INVOICE f2-INVOIC-
     A                                      E INQUIRY f3-EXIT END PGM          -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FINV02
     A*  89/02/27  09:41:17    A034675     REL-R01M02  5728-PW1
     A                                      PUTOVR
     A                                  1 23'I N V O I C E   P R O C E S S I N'
     A                                  1 57'G'
     A                                  1 74'INV-2'
     A                                  2 20'-----------------------------------
     A                                      -------'
     A                                  2 73'-------'
     A                                  3  1'PO NUMBER'
     A                                  3 28'REQ FOR DEPT'
     A                                  3 50'BUDGET NUMBER'
     A                                  4  1'PO DATE'
     A                                  4 28'ITEM COUNT'
     A                                  4 50'BUDGET AMOUNT'
     A                                  5  1'BUYER'
     A                                  5 50'APPROVED INVOICE'
     A                                  6  1'REQ NUMBER'
     A                                  6 58'PAYMENTS'
     A                                  7  1'ADDTL INFO'
     A                                  7 50'OPEN BUDGET AMT.'
     A                                  8  1'CPW TAKEN'
     A                                  8 50'PO TYPE'
     A                                  9  1'CPW PAYED'
     A                                  9 50'CURRENCY CODE'
     A                                 10  1'CPW BAL.'
     A                                 11  1'STANDARD INSTRUCTIONS'
     A                                 11 49'¦'
     A                                 12  1'COMMENTS:'
     A                                 15  3'REMIT TO:'
     A                                 19  3'ORDER FROM:'
     A            PO             7A  B  3 13DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  3 21DSPATR(PR)
     A                                      OVRDTA
     A            REQFD          6A  B  3 42DSPATR(PR)
     A                                      OVRDTA
     A            BUDGETNUMB    12A  B  3 67DSPATR(PR)
     A                                      OVRDTA
     A            PDATE          8A  B  4 13DSPATR(PR)
     A                                      OVRDTA
     A            NIPO           4A  B  4 42DSPATR(PR)
     A                                      OVRDTA
     A            BUDGETAT      11A  B  4 68DSPATR(PR)
     A                                      OVRDTA
     A            BUYER         16A  B  5 13DSPATR(PR)
     A                                      OVRDTA
     A            REQNUM        12A  B  6 13DSPATR(PR)
     A                                      OVRDTA
     A            INVPAY        11A  B  6 68DSPATR(PR)
     A                                      OVRDTA
     A            ADDTLINFO     16A  B  7 13DSPATR(PR)
     A                                      OVRDTA
     A            OPENBDGT      12A  B  7 67DSPATR(PR)
     A                                      OVRDTA
     A            CPWDEDUCT     14A  B  8 13DSPATR(PR)
     A                                      OVRDTA
     A            POTYPE        14A  B  8 59DSPATR(PR)
     A                                      OVRDTA
     A            CPWPAYED      14A  B  9 13DSPATR(PR)
     A                                      OVRDTA
     A            CC             2A  B  9 65DSPATR(PR)
     A                                      OVRDTA
     A            CURCODEDES    12A  B  9 68DSPATR(PR)
     A                                      OVRDTA
     A            CPWBALANCE    15A  B 10 12DSPATR(PR)
     A                                      OVRDTA
     A            S1             3A  B 11 24DSPATR(PR)
     A                                      OVRDTA
     A            S2             3A  B 11 28DSPATR(PR)
     A                                      OVRDTA
     A            S3             3A  B 11 32DSPATR(PR)
     A                                      OVRDTA
     A            S4             3A  B 11 36DSPATR(PR)
     A                                      OVRDTA
     A            S5             3A  B 11 40DSPATR(PR)
     A                                      OVRDTA
     A            S6             3A  B 11 44DSPATR(PR)
     A                                      OVRDTA
     A            S7             3A  B 11 52DSPATR(PR)
     A                                      OVRDTA
     A            S8             3A  B 11 56DSPATR(PR)
     A                                      OVRDTA
     A            S9             3A  B 11 60DSPATR(PR)
     A                                      OVRDTA
     A            S10            3A  B 11 64DSPATR(PR)
     A                                      OVRDTA
     A            S11            3A  B 11 68DSPATR(PR)
     A                                      OVRDTA
     A            S12            3A  B 11 72DSPATR(PR)
     A                                      OVRDTA
     A            COMMENT1      79A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMENT2      79A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            RVENCDE        7A  B 15 18DSPATR(PR)
     A                                      OVRDTA
     A            RI             3A  B 15 26DSPATR(PR)
     A                                      OVRDTA
     A            RVENNAME      44A  B 15 34DSPATR(PR)
     A                                      OVRDTA
     A            RVENADDR01    44A  B 16 34DSPATR(PR)
     A                                      OVRDTA
     A            RVENADDR02    44A  B 17 34DSPATR(PR)
     A                                      OVRDTA
     A            RVENADDR03    44A  B 18 34DSPATR(PR)
     A                                      OVRDTA
     A            OVENCDE        7A  B 19 18DSPATR(PR)
     A                                      OVRDTA
     A            OI             3A  B 19 26DSPATR(PR)
     A                                      OVRDTA
     A            OVENNAME      44A  B 19 34DSPATR(PR)
     A                                      OVRDTA
     A            OVENADDR01    44A  B 20 34DSPATR(PR)
     A                                      OVRDTA
     A            OVENADDR02    44A  B 21 34DSPATR(PR)
     A                                      OVRDTA
     A            OVENADDR03    44A  B 22 34DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 23  1DFTVAL('ENTER-TO CONTINUE f1-PO INQ-
     A                                       f2-PO"S BY VENDOR f3-NEXT INVOICE -
     A                                      f4-OVERRID VENDOR')
     A                                      DSPATR(PR)
     A  97                                  OVRDTA
     A            COMMANDLN2    79A  B 24  1DFTVAL('f5-ADD/SEE COMMENTS f6-RCVR-
     A                                       INQUIRY')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FINV02A
     A                                      PUTOVR
     A                                  1 18'INVOICE PROCESSING - ADDITIONAL CO-
     A                                      MMENTS'
     A                                  1 74'INV-2A'
     A                                  2 15'-----------------------------------
     A                                      ------------'
     A                                  2 73'--------'
     A                                 17 12'FOR ADDITIONAL COMMENTS, KEY  "X"'
     A                                 22  1'PRESS  "ENTER"  TO PROCESS'
     A            COM01         79A  B  6  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            COM02         79A  B  7  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            COM03         79A  B  8  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COM04         79A  B  9  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            COM05         79A  B 10  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            COM06         79A  B 11  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            COM07         79A  B 12  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            COM08         79A  B 13  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            COM09         79A  B 14  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            COM10         79A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            X              1A  B 17 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-PREV SCREEN             -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FINV02B
     A*%%TS  SD  19990614  141018  A257947     REL-V4R2M0  5769-PW1
     A                                      PUTOVR
     A                                  1 23'I N V O I C E   P R O C E S S I N'
     A                                  1 57'G'
     A                                  1 74'INV-2B'
     A                                  2 20'-----------------------------------
     A                                      -------'
     A                                  2 73'--------'
     A                                  4 22'***  PO NUMBER ==>'
     A                                  4 56'***'
     A                                  7  1'***  OLD VENDOR ==>'
     A                                  8  6'(REMIT TO)'
     A                                 12  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                 14  1'***   KEY THE CORRECT   VENDOR COD-
     A                                      E   AND   PRESS   "ENTER"'
     A                                 17  1'***  NEW VENDOR ==>'
     A                                 17 30'-000'
     A                                 18  6'(REMIT TO)'
     A            PO             7A  B  4 43DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  4 51DSPATR(PR)
     A                                      OVRDTA
     A            OVENCDE        7A  B  7 22DSPATR(PR)
     A                                      OVRDTA
     A            OID            3A  B  7 30DSPATR(PR)
     A                                      OVRDTA
     A            OVENNAME      44A  B  7 36DSPATR(PR)
     A                                      OVRDTA
     A            OVENADDR01    44A  B  8 36DSPATR(PR)
     A                                      OVRDTA
     A            OVENADDR02    44A  B  9 36DSPATR(PR)
     A                                      OVRDTA
     A            OVENADDR03    44A  B 10 36DSPATR(PR)
     A                                      OVRDTA
     A            CVENCDE        7A  B 17 22DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            CVENNAME      44A  B 17 36DSPATR(PR)
     A                                      OVRDTA
     A            CVENADDR01    44A  B 18 36DSPATR(PR)
     A                                      OVRDTA
     A            CVENADDR02    44A  B 19 36DSPATR(PR)
     A                                      OVRDTA
     A            CVENADDR03    44A  B 20 36DSPATR(PR)
     A                                      OVRDTA
     A            COMLINE       78A  B 22  2DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-PREV SCREEN             -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FINV02BD
     A                                      PUTOVR
     A                                  1 23'I N V O I C E   P R O C E S S I N'
     A                                  1 57'G'
     A                                  1 74'INV-2B'
     A                                  2 20'-----------------------------------
     A                                      -------'
     A                                  2 73'--------'
     A                                  4 22'***  PO NUMBER ==>'
     A                                  4 56'***'
     A                                  7  1'***  OLD VENDOR ==>'
     A                                  8  6'(REMIT TO)'
     A                                 12  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                 14  1'***   KEY THE CORRECT   VENDOR COD-
     A                                      E   AND   PRESS   "ENTER"'
     A                                 17  1'***  NEW VENDOR ==>'
     A                                 17 30'-000'
     A                                 18  6'(REMIT TO)'
     A            PO             7A  B  4 43DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  4 51DSPATR(PR)
     A                                      OVRDTA
     A            OVENCDE        7A  B  7 22DSPATR(PR)
     A                                      OVRDTA
     A            OID            3A  B  7 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            OVENNAME      44A  B  7 36DSPATR(PR)
     A                                      OVRDTA
     A            OVENADDR01    44A  B  8 36DSPATR(PR)
     A                                      OVRDTA
     A            OVENADDR02    44A  B  9 36DSPATR(PR)
     A                                      OVRDTA
     A            OVENADDR03    44A  B 10 36DSPATR(PR)
     A                                      OVRDTA
     A            CVENCDE        7A  B 17 22DSPATR(PR)
     A                                      OVRDTA
     A            CVENNAME      44A  B 17 36DSPATR(PR)
     A                                      OVRDTA
     A            CVENADDR01    44A  B 18 36DSPATR(PR)
     A                                      OVRDTA
     A            CVENADDR02    44A  B 19 36DSPATR(PR)
     A                                      OVRDTA
     A            CVENADDR03    44A  B 20 36DSPATR(PR)
     A                                      OVRDTA
     A            COMLINE       78A  B 22  2DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f6-TRY AGAIN f3-PREV SCREEN-
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A*  91/01/16  15:39:18    A171523     REL-R03M00  5728-PW1
     A          R FINV03
     A*%%TS  SD  19960507  145404  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                  1 23'I N V O I C E   P R O C E S S I N'
     A                                  1 57'G'
     A                                  1 74'INV-3'
     A                                  2 20'-----------------------------------
     A                                      -------'
     A                                  2 73'-------'
     A                                  3  8'***  PO NUMBER ==>'
     A                                  3 42'***     CURRENCY CODE'
     A                                  5 14'INVOICE NUMBER'
     A                                  5 50'INVOICE DATE'
     A                                  7 10'C/E'
     A                                  7 19'INVOICE AMOUNT'
     A                                  7 51'LEDGER ACCOUNT'
     A                                  9 10'CHARGE AN "IT" (NO CHECK CREATED)'
     A                                  9 51'TAX CODE'
     A                                  9 64'(OVERIDE PO'
     A                                 10 65'ITEM TAX CODES)'
     A                                 11 10'PO TERMS'
     A                                 11 51'INVOICE TERMS'
     A                                 11 69'(OPT)'
     A                                 13  3'INVOICE DESCRIPTION'
     A                                 14  3'¦'
     A                                 14 55'PO ITEM COUNT'
     A                                 14 78'¦'
     A                                 15  3'¦  ENTER  PO ITEM NUMBER(S)  OR  "-
     A                                      ALL"  IN THE FIRST ITEM BOX'
     A                                 15 78'¦'
     A                                 16  3'¦'
     A                                 16 78'¦'
     A                                 17  3'¦'
     A                                 17 78'¦'
     A                                 18  3'¦'
     A                                 18 78'¦'
     A                                 19  3'¦_________________________________-
     A                                      ___________________________________-
     A                                      ______¦'
     A                                 21  6'***  KEY  INVOICE DATA  AND  PO IT-
     A                                      EM NUMBER(S), THEN PRESS  "ENTER"'
     A                                 21 75'***'
     A            PO             7A  B  3 29DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  3 37DSPATR(PR)
     A                                      OVRDTA
     A            CC             2A  B  3 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            CURCODEDES    12A  B  3 68DSPATR(PR)
     A                                      OVRDTA
     A            INVNUM        14A  B  5 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            IDATE          6A  B  5 64DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            C              1A  B  7 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            TINVAMT       13Y 2B  7 35EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            CEACCTG        9A  B  7 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            I              1A  B  9 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A            TX             2A  B  9 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A            PT             2A  B 11 20DSPATR(PR)
     A                                      OVRDTA
     A            TERMSDESCR    23A  B 11 24DSPATR(PR)
     A                                      OVRDTA
     A            IT             2A  B 11 66DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            INVDESC       55A  B 13 24DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            PICT           4A  B 14 69DSPATR(PR)
     A                                      OVRDTA
     A            I001           4Y 0B 16  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            I002           4Y 0B 16 12DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            I003           4Y 0B 16 18DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            I004           4Y 0B 16 24DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            I005           4Y 0B 16 30DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            I006           4Y 0B 16 36DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            I007           4Y 0B 16 42DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            I008           4Y 0B 16 48DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            I009           4Y 0B 16 54DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            I010           4Y 0B 16 60DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            I011           4Y 0B 16 66DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            I012           4Y 0B 16 72DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            I013           4Y 0B 18  6DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            I014           4Y 0B 18 12DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            I015           4Y 0B 18 18DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            I016           4Y 0B 18 24DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            I017           4Y 0B 18 30DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            I018           4Y 0B 18 36DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            I019           4Y 0B 18 42DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            I020           4Y 0B 18 48DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            I021           4Y 0B 18 54DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            I022           4Y 0B 18 60DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            I023           4Y 0B 18 66DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            I024           4Y 0B 18 72DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-TERMS DEFINED f2-OVERRID-
     A                                      E DATE CHK f3-NEXT f4-HOLD f5-CONTI-
     A                                      NUE')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FINV03A
     A*  91/01/16  15:39:18    A171523     REL-R03M00  5728-PW1
     A                                      PUTOVR
     A                                  1 23'I N V O I C E   P R O C E S S I N'
     A                                  1 57'G'
     A                                  1 73'INV-3A'
     A                                  2 20'-----------------------------------
     A                                      -------'
     A                                  2 72'-------'
     A                                  3 29'TERMS OF PAYMENT'
     A                                  5  4'PERCENT'
     A                                  5 46'DUE DATE'
     A                                  6  3'----------'
     A                                  6 28'-----------------------------------
     A                                      -----------------'
     A                                  8  4'1 - NET'
     A                                  8 28'A - AT ONCE'
     A                                  8 57'B - 10 DAYS'
     A                                  9  4'2 - 1/2 %'
     A                                  9 28'C - 15 DAYS'
     A                                  9 57'D - 20 DAYS'
     A                                 10  4'3 - 1 %'
     A                                 10 28'E - 30 DAYS'
     A                                 10 57'F - 60 DAYS'
     A                                 11  4'4 - 2 %'
     A                                 11 28'G - 90 DAYS'
     A                                 11 57'H - 10 TH PROX'
     A                                 12  4'5 - 3 %'
     A                                 12 28'I - 15 TH PROX'
     A                                 12 57'J - 20 TH PROX'
     A                                 13  4'6 - 5 %'
     A                                 13 28'K - 25 TH PROX'
     A                                 13 57'L - 10 TH & 25 TH PROX'
     A                                 14 28'M - 15 TH PROX & 30 TH PROX  N - C-
     A                                      ASH/ORDER'
     A                                 15 28'O - 7 DAYS'
     A                                 15 57'P - CONTRA'
     A                                 16 28'Q - 120 DAYS'
     A                                 16 57'S - 150 DAYS'
     A                                 17 28'T - 180 DAYS'
     A                                 17 57'U - 22 DAYS'
     A                                 18 28'V - 45 DAYS'
     A                                 18 57'W - 25 DAYS'
     A                                 19 28'Y - 20 TH PROX + 30 DAYS'
     A                                 19 57'Z - ????'
     A                                 21  6'EXAMPLE "1E" - NET 30 DAYS'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-PREVIOUS SCREEN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FINV04
     A*  89/03/14  16:29:30    A034675     REL-R01M02  5728-PW1
     A                                      PUTOVR
     A                                  1 23'I N V O I C E   P R O C E S S I N'
     A                                  1 57'G'
     A                                  1 74'INV-4'
     A                                  2 20'-----------------------------------
     A                                      -------'
     A                                  2 73'-------'
     A                                  3  7'PO #'
     A                                  3 28'INVOICE #'
     A                                  3 57'REGISTER #'
     A                                  4  1'ITEM   CORP CODE    UNPAID QUANTIT-
     A                                      Y PO UM    PO UNIT PRICE   EXTENDED-
     A                                       PRICE'
     A                                  5  1'DESCRIPTION **********************-
     A                                      ***********************************-
     A                                      **********'
     A                                  7  2'**  FROM INVOICE ==>'
     A                                  8 30'TAX CODE'
     A                                  9 19'MEMO QUANTITY INDICATOR (NOTE: DOE-
     A                                      S NOT UPDATE QUANTITY PAID)'
     A                                 15  4'HOLD EXPLANATION (OPT)'
     A                                 15 38'PRIME   SUB   SUB-D   ADDL DATA'
     A                                 15 72'PERCENT'
     A                                 16 31'PO ==>'
     A                                 22  4'***  IF THE ABOVE INFORMATION IS C-
     A                                      ORRECT,  PRESS  "ENTER"  TO CONTINU-
     A                                      E  ***'
     A            PO             7A  B  3 13DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  3 21DSPATR(PR)
     A                                      OVRDTA
     A            INVNUM        14A  B  3 39DSPATR(PR)
     A                                      OVRDTA
     A            RNUM           5A  B  3 69DSPATR(PR HI BL)
     A                                      OVRDTA
     A            ITEM           4A  B  6  1DSPATR(PR)
     A                                      OVRDTA
     A            CRPCODE        7A  B  6  8DSPATR(PR)
     A                                      OVRDTA
     A            UNPDQTY       14A  B  6 22DSPATR(PR)
     A                                      OVRDTA
     A            PU             2A  B  6 38DSPATR(PR)
     A                                      OVRDTA
     A            PUPRICE       17A  B  6 42DSPATR(PR)
     A                                      OVRDTA
     A            PEXT          15A  B  6 61DSPATR(PR)
     A                                      OVRDTA
     A            P              1A  B  6 78DSPATR(PR)
     A                                      OVRDTA
     A            IQTYPD        12Y 4B  7 23EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  67                                  DSPATR(RI)
     A  67                                  DSPATR(PC)
     A            IU             2A  B  7 38DSPATR(PR)
     A                                      OVRDTA
     A            IUPRICE       15Y 4B  7 43EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  70                                  DSPATR(RI)
     A  70                                  DSPATR(PC)
     A            IEXT          13Y 2B  7 62EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  79                                  DSPATR(RI)
     A  79                                  DSPATR(PC)
     A            I              1A  B  7 78DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  95                                  DSPATR(RI)
     A  95                                  DSPATR(PC)
     A            TX             2A  B  8 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  97                                  DSPATR(RI)
     A  97                                  DSPATR(PC)
     A            M              1A  B  9 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  96                                  DSPATR(RI)
     A  96                                  DSPATR(PC)
     A            DESCLINE01    79A  B 10  1DSPATR(PR)
     A                                      OVRDTA
     A            DESCLINE02    79A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            DESCLINE03    79A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            DESCLINE04    79A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            HOLDVERB      20A  B 16  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  98                                  DSPATR(RI)
     A  98                                  DSPATR(PC)
     A            PR1            3A  B 16 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            S1             3A  B 16 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            SD1            4A  B 16 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            AD1            6A  B 16 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            PC1            5Y 2B 16 73EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            PR2            3A  B 17 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            S2             3A  B 17 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            SD2            4A  B 17 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            AD2            6A  B 17 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            PC2            5Y 2B 17 73EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            PR3            3A  B 18 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            S3             3A  B 18 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A            SD3            4A  B 18 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            AD3            6A  B 18 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            PC3            5Y 2B 18 73EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            PR4            3A  B 19 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  82                                  DSPATR(RI)
     A  82                                  DSPATR(PC)
     A            S4             3A  B 19 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  83                                  DSPATR(RI)
     A  83                                  DSPATR(PC)
     A            SD4            4A  B 19 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  84                                  DSPATR(RI)
     A  84                                  DSPATR(PC)
     A            AD4            6A  B 19 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  85                                  DSPATR(RI)
     A  85                                  DSPATR(PC)
     A            PC4            5Y 2B 19 73EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  86                                  DSPATR(RI)
     A  86                                  DSPATR(PC)
     A            PR5            3A  B 20 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  88                                  DSPATR(RI)
     A  88                                  DSPATR(PC)
     A            S5             3A  B 20 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  89                                  DSPATR(RI)
     A  89                                  DSPATR(PC)
     A            SD5            4A  B 20 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  90                                  DSPATR(RI)
     A  90                                  DSPATR(PC)
     A            AD5            6A  B 20 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  91                                  DSPATR(RI)
     A  91                                  DSPATR(PC)
     A            PC5            5Y 2B 20 73EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  92                                  DSPATR(RI)
     A  92                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DSPATR(PR)
     A  98                                  OVRDTA
     A                                      DFTVAL('f1-CALC VALUES f3-ITEM EXIT-
     A                                       f4-HOLD ITEM f5-SKIP ITEM  f6-RCVR-
     A                                       INQ')
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FINV05
     A                                      PUTOVR
     A                                  1 23'I N V O I C E   P R O C E S S I N'
     A                                  1 57'G'
     A                                  1 74'INV-5'
     A                                  2 20'-----------------------------------
     A                                      -------'
     A                                  2 73'-------'
     A                                  4  7'PO #'
     A                                  4 28'INVOICE #'
     A                                  4 57'REGISTER #'
     A                                  6 16'PO MATERIAL EXTENSION ......... '
     A                                  8 16'INVOICE MATERIAL EXTENSION .... '
     A                                 10 16'EXTENSION DIFFERENCE .......... '
     A                                 12  1'**********************************-
     A                                      *********      ********************-
     A                                      **********'
     A                                 13  1'*'
     A                                 13 43'*      *'
                                       13 79'*'
     A                                 14  1'*  ENTER:   '
     A                                 14 43'*      *  ENTER: "H" TO HOLD   '
                                       14 79'*'
     A                                 15  1'*'
     A                                 15 43'*  OR  *'
                                       15 79'*'
     A                                 16  1'*  "P"  TO PAY  PO UNITS AND AMOUN-
     A                                      T'
     A                                 16 43'*      *  HOLD EXPLANATION (OPT)'
                                       16 79'*'
     A                                 17  1'*  "I"  TO PAY  INVOICE UNITS AND'
     A                                 17 35'AMOUNT  *      *'
                                       17 79'*'
     A                                 18  1'**********************************-
     A                                      *********      ********************-
     A                                      **********'
     A                                 20  1'PRESS "ENTER" TO CONTINUE'
     A            PO             7A  B  4 13DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  4 21DSPATR(PR)
     A                                      OVRDTA
     A            INVNUM        14A  B  4 39DSPATR(PR)
     A                                      OVRDTA
     A            RNUM           5A  B  4 69DSPATR(PR HI BL)
     A                                      OVRDTA
     A            PMATEXT       15A  B  6 49DSPATR(PR)
     A                                      OVRDTA
     A            IMATEXT       15A  B  8 49DSPATR(PR)
     A                                      OVRDTA
     A            EXTDIFF       15A  B 10 49DSPATR(PR)
     A                                      OVRDTA
     A            P              1A  B 14 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            P2             1A  B 14 75DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            HOLDVERB      20A  B 17 55DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FINV06
     A*  91/04/03  13:16:55    A171523     REL-R03M00  5728-PW1
     A                                      PUTOVR
     A                                  1 23'I N V O I C E   P R O C E S S I N'
     A                                  1 57'G'
     A                                  1 74'INV-6'
     A                                  2 20'-----------------------------------
     A                                      -------'
     A                                  2 73'-------'
     A                                  4  7'PO #'
     A            PO             7A  B  4 13DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  4 21DSPATR(PR)
     A                                      OVRDTA
     A                                  4 28'INVOICE #'
     A            INVNUM        14A  B  4 39DSPATR(PR)
     A                                      OVRDTA
     A                                  4 57'REGISTER #'
     A            RNUM           5A  B  4 69DSPATR(PR)
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A                                      OVRDTA
     A                                  6 12'MATERIAL EXTENSION'
     A            MATEXT        15A  B  6 32DSPATR(PR)
     A                                      OVRDTA
     A                                  8  2'INCLUDE ANY:  FREIGHT'
     A            VFRT          13Y 2B  8 33EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            D              1A  B  8 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A                                  8 54'FOB'
     A            FOB           20A  B  8 59DSPATR(PR)
     A                                      OVRDTA
     A                                  9 16'TAX'
     A            VTAX          13Y 2B  9 33EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            E              1A  B  9 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A                                  9 54'TAX CODE'
     A            TC             2A  B  9 64DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A                                 10 16'CONTAINERS'
     A            VCTNRS        13Y 2B 10 33EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            F              1A  B 10 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A                                 10 54'CURRENCY CODE'
     A            CC             2A  B 10 69DSPATR(PR)
     A                                      OVRDTA
     A                                 11 16'INSURANCE'
     A            VINS          13Y 2B 11 33EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            G              1A  B 11 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            CURCODEDES    12A  B 11 69DSPATR(PR)
     A                                      OVRDTA
     A                                 12 16'OTHER'
     A            VOTHER        13Y 2B 12 33EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            H              1A  B 12 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            GSTHEADER     10A  B 13 16DSPATR(PR)
     A N34                                  DSPATR(ND)
     A            GSTAMOUNT     12Y 2B 13 34EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A N34                                  DSPATR(PR ND)
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            GSTSIGN        1A  B 13 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A N34                                  DSPATR(PR ND)
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A                                 14 35'-----------------'
     A                                 16  5'CALCULATED INVOICE AMOUNT'
     A            CINVAMT       15A  B 16 32DSPATR(PR)
     A                                      OVRDTA
     A                                 18  3'AMOUNT ENTERED FROM INVOICE'
     A            EINVAMT       15A  B 18 32DSPATR(PR)
     A                                      OVRDTA
     A                                 18 51'C/E'
     A            C              1A  B 18 56DSPATR(PR)
     A                                      OVRDTA
     A                                 18 59'CE ACCTG'
     A            CEACCTG        9A  B 18 69DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                 20  9'HOLD OPTION FREE VERBAGE'
     A            HOLDVERBAG    20A  B 20 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A                                 22  1'PRESS  "ENTER"  TO CONTINUE'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-CALC VALUES f2-CALC TAX -
     A                                      ON FRT. f4-HOLD INVOICE f3-INVOICE -
     A                                      COMPLETE')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FINV07
     A                                      PUTOVR
     A                                  1 23'I N V O I C E   P R O C E S S I N'
     A                                  1 57'G'
     A                                  1 75'INV-7'
     A                                  2 20'-----------------------------------
     A                                      -------'
     A                                  2 74'-------'
     A                                  3  7'PO #'
     A                                  3 28'INVOICE #'
     A                                  3 57'REGISTER #'
     A                                  5  9'* AMOUNT ENTERED FROM INVOICE'
     A                                  5 59'C/E'
     A                                  6  1'C/E DEDUCTIONS:  (6) EXTENSION ERR-
     A                                      OR'
     A                                  7 18'(7) UNIT PRICE ERROR'
     A                                  8 18'(8) CORRECTION OTHER'
     A                                 10 11'* CALCULATED INVOICE AMOUNT'
     A                                 11 18'(3) FREIGHT'
     A                                 12 18'(4) INSURANCE'
     A                                 13 18'(5) TAX'
     A                                 14 18'(9) CASH DISCOUNT'
     A                                 15  1'CONTRACTOR"S PAYMENT WITHHELD (C.P-
     A                                      .W.)'
     A                                 17 13'C/E  '
     A                                 17 22'OTHER C/E'
     A                                 17 61'C/E ACCTG'
     A                                 19 18'* NET DUE VENDOR'
     A                                 21 12'HOLD OPTION FREE VERBAGE'
     A                                 23  1'PRESS "ENTER" TO CONTINUE'
     A            PO             7A  B  3 13DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  3 21DSPATR(PR)
     A                                      OVRDTA
     A            INVNUM        14A  B  3 39DSPATR(PR)
     A                                      OVRDTA
     A            RNUM           5A  B  3 69DSPATR(PR HI BL)
     A                                      OVRDTA
     A            OINVAMT       15A  B  5 40DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  5 63DSPATR(PR)
     A                                      OVRDTA
     A            CEACCT         9A  B  5 66DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(PC)
     A            DEXTERR       14A  B  6 41DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B  6 57DSPATR(PR)
     A                                      OVRDTA
     A            DPRCERR       14A  B  7 41DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B  7 57DSPATR(PR)
     A                                      OVRDTA
     A            DOTHER        14A  B  8 41DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B  8 57DSPATR(PR)
     A                                      OVRDTA
     A            CINVAMT       15A  B 10 40DSPATR(PR)
     A                                      OVRDTA
     A            DFRT          13Y02B 11 41EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            D              1A  B 11 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            DINS          13Y02B 12 41EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            E              1A  B 12 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            DTAX          13Y02B 13 41EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            F              1A  B 13 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            DDSCNT        13Y02B 14 41EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            J              1A  B 14 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            TM             2A  B 14 62DSPATR(PR)
     A                                      OVRDTA
     A            DCPW          13Y02B 15 41EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            L              1A  B 15 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            CPW            4A  B 15 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            O              1A  B 17 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A            DCEOTHER      13Y02B 17 41EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A            K              1A  B 17 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A            CEOACCT        9A  B 17 71DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A            NDV           15A  B 19 40DSPATR(PR)
     A                                      OVRDTA
     A            HOLDVERBAG    20A  B 21 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-CALC VALUES f4-HOLD INVO-
     A                                      ICE f3-INVOICE COMPLETE            -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FINV07A
     A                                      PUTOVR
     A                                  1 23'I N V O I C E   P R O C E S S I N'
     A                                  1 57'G'
     A                                  1 75'INV-7'
     A                                  2 20'-----------------------------------
     A                                      -------'
     A                                  2 74'-------'
     A                                  3  7'PO #'
     A                                  3 28'INVOICE #'
     A                                  3 57'REGISTER #'
     A                                  5  9'* AMOUNT ENTERED FROM INVOICE'
     A                                  5 59'C/E'
     A                                  6  1'C/E DEDUCTIONS:  (6) EXTENSION ERR-
     A                                      OR'
     A                                  7 18'(7) UNIT PRICE ERROR'
     A                                  8 18'(8) CORRECTION OTHER'
     A                                 10 11'* CALCULATED INVOICE AMOUNT'
     A                                 11 18'(3) FREIGHT'
     A                                 12 18'(4) INSURANCE'
     A                                 13 18'(5) TAX'
     A                                 14 18'(9) CASH DISCOUNT'
     A                                 15  1'CONTRACTOR"S PAYMENT WITHHELD (C.P-
     A                                      .W.)'
     A                                 17 13'C/E  '
     A                                 17 22'OTHER C/E'
     A                                 17 61'C/E ACCTG'
     A                                 19 18'* NET DUE VENDOR'
     A                                 21 12'HOLD OPTION FREE VERBAGE'
     A                                 23  1'PRESS "ENTER" TO CONTINUE'
     A            PO             7A  B  3 13DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  3 21DSPATR(PR)
     A                                      OVRDTA
     A            INVNUM        14A  B  3 39DSPATR(PR)
     A                                      OVRDTA
     A            RNUM           5A  B  3 69DSPATR(PR HI BL)
     A                                      OVRDTA
     A            OINVAMT       15A  B  5 40DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  5 63DSPATR(PR)
     A                                      OVRDTA
     A            CEACCT         9A  B  5 66DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(PC)
     A            DEXTERR       14A  B  6 41DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B  6 57DSPATR(PR)
     A                                      OVRDTA
     A            DPRCERR       14A  B  7 41DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B  7 57DSPATR(PR)
     A                                      OVRDTA
     A            DOTHER        14A  B  8 41DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B  8 57DSPATR(PR)
     A                                      OVRDTA
     A            CINVAMT       15A  B 10 40DSPATR(PR)
     A                                      OVRDTA
     A            DFRT          13Y02B 11 41EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            D              1A  B 11 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            DINS          13Y02B 12 41EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            E              1A  B 12 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            DTAX          13Y02B 13 41EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            F              1A  B 13 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            DDSCNT        13Y02B 14 41EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            J              1A  B 14 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            TM             2A  B 14 62DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A            DCPW          13Y02B 15 41EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            L              1A  B 15 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            CPW            4A  B 15 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            O              1A  B 17 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A            DCEOTHER      13Y02B 17 41EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A            K              1A  B 17 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A            CEOACCT        9A  B 17 71DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A            NDV           15A  B 19 40DSPATR(PR)
     A                                      OVRDTA
     A            HOLDVERBAG    20A  B 21 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f2-TERMS DEFINED           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FINV08
     A                                      PUTOVR
     A                                  1 23'I N V O I C E   P R O C E S S I N'
     A                                  1 57'G'
     A                                  1 74'INV-8'
     A                                  2 20'-----------------------------------
     A                                      -------'
     A                                  2 73'-------'
     A                                  4  7'PO #'
     A                                  4 28'INVOICE #'
     A                                  4 57'REGISTER #'
     A                                  6 17'NET DUE VENDOR'
     A                                  7  1'ADJUSTMENTS: CASH DISC (C/E 9)'
     A                                  8 14'CONTAINERS'
     A                                  9 14'C.P.W.'
     A                                 10 14'TOTAL COLLECT FRT '
     A                                 11 14'OTHER'
     A                                 12 14'ACCRUED TAX :'
     A                                 17 11'COST TO BE DISTRIBUTED'
     A                                 20  8'HOLD OPTION FREE VERBAGE'
     A                                 22  1'PRESS  "ENTER"  TO CONTINUE'
     A            PO             7A  B  4 13DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  4 21DSPATR(PR)
     A                                      OVRDTA
     A            INVNUM        14A  B  4 39DSPATR(PR)
     A                                      OVRDTA
     A            RNUM           5A  B  4 69DSPATR(PR HI BL)
     A                                      OVRDTA
     A            NDV           15A  B  6 35DSPATR(PR)
     A                                      OVRDTA
     A            ADSCNT        15A  B  7 35DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  7 52DSPATR(PR)
     A                                      OVRDTA
     A            ACTNRS        15A  B  8 35DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B  8 52DSPATR(PR)
     A                                      OVRDTA
     A            ACPW          15A  B  9 35DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  9 52DSPATR(PR)
     A                                      OVRDTA
     A            ATCFRT        15A  B 10 35DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 10 52DSPATR(PR)
     A                                      OVRDTA
     A            FREIGHTMSG    20A  B 10 56DSPATR(PR)
     A                                      OVRDTA
     A            AOTHER        13Y02B 11 36EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            E              1A  B 11 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            AACRTAX       13Y02B 12 36EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            D              1A  B 12 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            ATAXDESC1     15A  B 12 55DSPATR(PR)
     A                                      OVRDTA
     A            ATAXACCT1      9A  B 12 71DSPATR(PR)
     A                                      OVRDTA
     A            AACRTAX2      13Y02B 13 36EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            G              1A  B 13 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            ATAXDESC2     15A  B 13 55DSPATR(PR)
     A                                      OVRDTA
     A            ATAXACCT2      9A  B 13 71DSPATR(PR)
     A                                      OVRDTA
     A            AACRTAX3      13Y02B 14 36EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            H              1A  B 14 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            ATAXDESC3     15A  B 14 55DSPATR(PR)
     A                                      OVRDTA
     A            ATAXACCT3      9A  B 14 71DSPATR(PR)
     A                                      OVRDTA
     A            AACRTAX4      13Y02B 15 36EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            I              1A  B 15 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            ATAXDESC4     15A  B 15 55DSPATR(PR)
     A                                      OVRDTA
     A            ATAXACCT4      9A  B 15 71DSPATR(PR)
     A                                      OVRDTA
     A            DCOST         15A  B 17 35DSPATR(PR)
     A                                      OVRDTA
     A            HOLDVERBAG    20A  B 20 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-CALC VALUES f2-GDYR PAID-
     A                                       FRT f5-CALC TAX ON FRT f4-HOLD INV-
     A                                      OICE             ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FINV08A
     A                                      PUTOVR
     A                                  1 23'I N V O I C E   P R O C E S S I N'
     A                                  1 57'G'
     A                                  1 74'INV-8A'
     A                                  2 20'-----------------------------------
     A                                      -------'
     A                                  2 73'--------'
     A                                  4  7'PO #'
     A                                  4 28'INVOICE #'
     A                                  4 57'REGISTER #'
     A                                  6 25'***  GOODYEAR PAID FREIGHT  ***'
     A                                  7 29'-----------------------'
     A                                  9  9'RCVR   CARRIER CODE    PRO NUMBER'
     A                                  9 48'RAIL CAR NO'
     A                                  9 66'AMOUNT'
     A                                 10  9'----  --------------  ------------'
     A                                 10 48'-----------      --------'
     A                                 22  9'SELECT  APPROPRIATE FREIGHT  AND'
     A                                 22 43'PRESS  "ENTER"  TO CONTINUE'
     A            PO             7A  B  4 13DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  4 21DSPATR(PR)
     A                                      OVRDTA
     A            INVNUM        14A  B  4 39DSPATR(PR)
     A                                      OVRDTA
     A            RNUM           5A  B  4 69DSPATR(PR HI BL)
     A                                      OVRDTA
     A            A              1A  B 11  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            R1             3A  B 11  9DSPATR(PR)
     A                                      OVRDTA
     A            CC1            4A  B 11 19DSPATR(PR)
     A                                      OVRDTA
     A            PRO1          16A  B 11 31DSPATR(PR)
     A                                      OVRDTA
     A            CARNO1        10A  B 11 48DSPATR(PR)
     A                                      OVRDTA
     A            AMT1          13Y02B 11 61EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            G              1A  B 11 77DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B 12  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            R2             3A  B 12  9DSPATR(PR)
     A                                      OVRDTA
     A            CC2            4A  B 12 19DSPATR(PR)
     A                                      OVRDTA
     A            PRO2          16A  B 12 31DSPATR(PR)
     A                                      OVRDTA
     A            CARNO2        10A  B 12 48DSPATR(PR)
     A                                      OVRDTA
     A            AMT2          13Y02B 12 61EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            H              1A  B 12 77DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 13  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            R3             3A  B 13  9DSPATR(PR)
     A                                      OVRDTA
     A            CC3            4A  B 13 19DSPATR(PR)
     A                                      OVRDTA
     A            PRO3          16A  B 13 31DSPATR(PR)
     A                                      OVRDTA
     A            CARNO3        10A  B 13 48DSPATR(PR)
     A                                      OVRDTA
     A            AMT3          13Y02B 13 61EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            I              1A  B 13 77DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 14  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            R4             3A  B 14  9DSPATR(PR)
     A                                      OVRDTA
     A            CC4            4A  B 14 19DSPATR(PR)
     A                                      OVRDTA
     A            PRO4          16A  B 14 31DSPATR(PR)
     A                                      OVRDTA
     A            CARNO4        10A  B 14 48DSPATR(PR)
     A                                      OVRDTA
     A            AMT4          13Y02B 14 61EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            J              1A  B 14 77DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 15  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            R5             3A  B 15  9DSPATR(PR)
     A                                      OVRDTA
     A            CC5            4A  B 15 19DSPATR(PR)
     A                                      OVRDTA
     A            PRO5          16A  B 15 31DSPATR(PR)
     A                                      OVRDTA
     A            CARNO5        10A  B 15 48DSPATR(PR)
     A                                      OVRDTA
     A            AMT5          13Y02B 15 61EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            K              1A  B 15 77DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 16  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            R6             3A  B 16  9DSPATR(PR)
     A                                      OVRDTA
     A            CC6            4A  B 16 19DSPATR(PR)
     A                                      OVRDTA
     A            PRO6          16A  B 16 31DSPATR(PR)
     A                                      OVRDTA
     A            CARNO6        10A  B 16 48DSPATR(PR)
     A                                      OVRDTA
     A            AMT6          13Y02B 16 61EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A            L              1A  B 16 77DSPATR(PR)
     A                                      OVRDTA
     A            M              1A  B 17  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A            R7             3A  B 17  9DSPATR(PR)
     A                                      OVRDTA
     A            CC7            4A  B 17 19DSPATR(PR)
     A                                      OVRDTA
     A            PRO7          16A  B 17 31DSPATR(PR)
     A                                      OVRDTA
     A            CARNO7        10A  B 17 48DSPATR(PR)
     A                                      OVRDTA
     A            AMT7          13Y02B 17 61EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A            N              1A  B 17 77DSPATR(PR)
     A                                      OVRDTA
     A            O              1A  B 18  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  55                                  DSPATR(RI)
     A  55                                  DSPATR(PC)
     A            R8             3A  B 18  9DSPATR(PR)
     A                                      OVRDTA
     A            CC8            4A  B 18 19DSPATR(PR)
     A                                      OVRDTA
     A            PRO8          16A  B 18 31DSPATR(PR)
     A                                      OVRDTA
     A            CARNO8        10A  B 18 48DSPATR(PR)
     A                                      OVRDTA
     A            AMT8          13Y02B 18 61EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  59                                  DSPATR(RI)
     A  59                                  DSPATR(PC)
     A            P              1A  B 18 77DSPATR(PR)
     A                                      OVRDTA
     A            Q              1A  B 19  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A            R9             3A  B 19  9DSPATR(PR)
     A                                      OVRDTA
     A            CC9            4A  B 19 19DSPATR(PR)
     A                                      OVRDTA
     A            PRO9          16A  B 19 31DSPATR(PR)
     A                                      OVRDTA
     A            CARNO9        10A  B 19 48DSPATR(PR)
     A                                      OVRDTA
     A            AMT9          13Y02B 19 61EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  66                                  DSPATR(RI)
     A  66                                  DSPATR(PC)
     A            R              1A  B 19 77DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B 20  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  69                                  DSPATR(RI)
     A  69                                  DSPATR(PC)
     A            R10            3A  B 20  9DSPATR(PR)
     A                                      OVRDTA
     A            CC10           4A  B 20 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  70                                  DSPATR(RI)
     A  70                                  DSPATR(PC)
     A            PRO10         16A  B 20 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  71                                  DSPATR(RI)
     A  71                                  DSPATR(PC)
     A            CARNO10       10A  B 20 48DSPATR(PR)
     A                                      OVRDTA
     A            AMT10         13Y02B 20 61EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  73                                  DSPATR(RI)
     A  73                                  DSPATR(PC)
     A            T              1A  B 20 77DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f2-ADDL FREIGHT            -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FINVPBV
     A                                      PUTOVR
     A                                  1 25'PURCHASE ORDER INQUIRY BY VENDOR'
     A                                  3  7'VENDOR CODE ==>'
     A                                  3 29'***'
     A                                  3 49'***'
     A                                  4 33'---------------'
     A                                  6  7'VENDOR DATA ==>'
     A                                  9  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                 11  7'PURCHASE ORDERS ==>     '
     A                                 17  1'"f1" TO VIEW PREV PO"S'
     A                                 18  1'"f2" TO VIEW MORE PO"S'
     A                                 19  1'"f5" TO PRINT SCREEN'
     A                                 20  1'"f3" RETURN TO PREV SCREEN    '
     A                                 22  1'PLACE  "X"  IN BOX NEXT TO PURCHAS-
     A                                      E ORDER(S) TO BE REVIEWED  AND  PRE-
     A                                      SS  "ENTER"'
     A            VC             7A  B  3 35DSPATR(PR)
     A                                      OVRDTA
     A            VI             3A  B  3 43DSPATR(PR)
     A                                      OVRDTA
     A            VENDORNAME    44A  B  6 25DSPATR(PR)
     A                                      OVRDTA
     A            VENDORCSZ     44A  B  7 25DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B 11 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            PORLSE01      11A  B 11 36DSPATR(PR)
     A                                      OVRDTA
     A            INHIST01      19   B 11 50DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B 12 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            PORLSE02      11A  B 12 36DSPATR(PR)
     A                                      OVRDTA
     A            INHIST02      19   B 12 50DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 13 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            PORLSE03      11A  B 13 36DSPATR(PR)
     A                                      OVRDTA
     A            INHIST03      19   B 13 50DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 14 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            PORLSE04      11A  B 14 36DSPATR(PR)
     A                                      OVRDTA
     A            INHIST04      19   B 14 50DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 15 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            PORLSE05      11A  B 15 36DSPATR(PR)
     A                                      OVRDTA
     A            INHIST05      19   B 15 50DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 16 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            PORLSE06      11A  B 16 36DSPATR(PR)
     A                                      OVRDTA
     A            INHIST06      19   B 16 50DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 17 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            PORLSE07      11A  B 17 36DSPATR(PR)
     A                                      OVRDTA
     A            INHIST07      19   B 17 50DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 18 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            PORLSE08      11A  B 18 36DSPATR(PR)
     A                                      OVRDTA
     A            INHIST08      19   B 18 50DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 19 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            PORLSE09      11A  B 19 36DSPATR(PR)
     A                                      OVRDTA
     A            INHIST09      19   B 19 50DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            J              1A  B 20 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            PORLSE10      11A  B 20 36DSPATR(PR)
     A                                      OVRDTA
     A            INHIST10      19   B 20 50DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-PREV SCREEN             -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FINVPO
     A                                      PUTOVR
     A                                  1 19'P U R C H A S E   O R D E R   I N'
     A                                  1 53'Q U I R Y'
     A                                  2 16'-----------------------------------
     A                                      ---------------'
     A                                  8 22'PURCHASE ORDER NUMBER'
     A                                 12  1'***  OPTIONS:'
     A                                 13  1'----------------'
     A                                 16  6'ENTER   ITEM NUMBER'
     A                                 16 35'{OR}   CORP CODE'
     A                                 16 64'IF DESIRED'
     A                                 20  1'PRESS  "ENTER"  TO CONTINUE'
     A                                 22  1'PRESS  "f3" TO RETURN TO PREV SCRE-
     A                                      EN'
     A            HISTMSG       35   B  5 22DSPATR(HI)
     A                                      DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            PO             7A  B  8 46DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  8 54DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4Y 0B 16 28DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            CORPCDE        7A  B 16 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-PREV SCREEN             -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INVMOD1
     A*  89/02/20  11:29:50    A034675     REL-R01M02  5728-PW1
     A                                      PUTOVR
     A                                  1 15'I N V O I C E   P R O C E S S I N'
     A                                  1 49'G - MODIFY'
     A                                  1 74'MOD-1'
     A                                  2 12'-----------------------------------
     A                                      ----------------'
     A                                  2 72'---------'
     A                                  5 15'1)  ENTER  REGISTER NUMBER  '
     A                                  7 15'2)  ENTER  "X"  TO INDICATE THE DE-
     A                                      SIRED FUNCION'
     A                                  9 28'MODIFY HEADER FIELDS'
     A                                 11 28'PLACE INVOICE ON HOLD'
     A                                 13 28'DELETE AN EXISTING ITEM   '
     A                                 15 28'DELETE AN ENTIRE INVOICE'
     A                                 18 16'3)  PRESS  "ENTER"  TO PROCESS'
     A            REGNO          5Y 0B  5 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            A              1A  B  9 24DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            B              1A  B 11 24DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            C              1A  B 13 24DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            ITM2           4Y 0B 13 55DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            D              1A  B 15 24DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT END PGM')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A*  89/02/17  13:49:57    A034675     REL-R01M02  5728-PW1
     A          R INVMOD2
     A*%%TS  SD  19960508  091442  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                  1 15'I N V O I C E   P R O C E S S I N'
     A                                  1 49'G - MODIFY'
     A                                  1 75'MOD-2'
     A                                  2 12'-----------------------------------
     A                                      ----------------'
     A                                  2 74'-------'
     A                                  5  2'REGISTER NUMBER    PO NUMBER'
     A                                  5 36'INVOICE NUMBER    STATUS    MANIFE-
     A                                      ST NUMBER'
     A                                  8  1'INVOICE DATE    DUE DATE   TERMS'
     A                                  8 37'ENTRY DATE    MODIFY DATE    ADD I-
     A                                      D   MOD ID'
     A                                 12  2'INVOICE C/E    INV MAT"L EXT'
     A                                 12 36'PO MAT"L EXT     PAYMENT ID     VE-
     A                                      NDOR CODE'
     A                                 15  4'NET DUE VENDOR'
     A                                 15 25'DISTRIBUTED COST'
     A                                 15 48'CURRENCY CODE'
     A                                 17  1'CHARGE AN "IT" (NO CHECK CREATED)'
     A                                 19  1'INVOICE DESCRIPTION'
     A                                 21  3'KEY DESIRED CHANGES AND PRESS "ENT-
     A                                      ER" TO PROCESS'
     A            RNUM           5A  B  4  2DSPATR(PR)
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A                                      OVRDTA
     A            PO             7A  B  4 21DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  4 29DSPATR(PR)
     A                                      OVRDTA
     A            INVNUM        14A  B  4 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            S              1A  B  4 54DSPATR(PR)
     A                                      OVRDTA
     A            MFNUM          8A  B  4 64DSPATR(PR)
     A                                      OVRDTA
     A            IDATE          6A  B  7  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            DDATE          8A  B  7 17DSPATR(PR)
     A                                      OVRDTA
     A            TM             2A  B  7 28DSPATR(PR)
     A                                      OVRDTA
     A            EDATE          8A  B  7 37DSPATR(PR)
     A                                      OVRDTA
     A            MDATE          8A  B  7 51DSPATR(PR)
     A                                      OVRDTA
     A            ACLK           4A  B  7 66DSPATR(PR)
     A                                      OVRDTA
     A            MCLK           4A  B  7 75DSPATR(PR)
     A                                      OVRDTA
     A            TERMSDESCR    23A  B  9 24DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 11  2DSPATR(PR)
     A                                      OVRDTA
     A            IMATEXT       15A  B 11 15DSPATR(PR)
     A                                      OVRDTA
     A            PMATEXT       15A  B 11 33DSPATR(PR)
     A                                      OVRDTA
     A            P              1A  B 11 53DSPATR(PR)
     A                                      OVRDTA
     A            VENCODE        7A  B 11 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            VC             3A  B 11 76DSPATR(PR)
     A                                      OVRDTA
     A            NETDUEVEN     15A  B 14  3DSPATR(PR)
     A                                      OVRDTA
     A            DISTCOST      15A  B 14 26DSPATR(PR)
     A                                      OVRDTA
     A            CUR            2A  B 14 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            CURDESC       12A  B 14 51DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 17 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            INVDESC       55A  B 19 22DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-TERMS DEFINED f2-OVERRID-
     A                                      E DATE CHK f6-REFRESH SCREEN f3-MAI-
     A                                      N MENU')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INVMOD3
     A*%%TS  SD  19960508  091442  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                  1 15'I N V O I C E   P R O C E S S I N'
     A                                  1 49'G - MODIFY'
     A                                  1 75'MOD-3'
     A                                  2 12'-----------------------------------
     A                                      ----------------'
     A                                  2 74'-------'
     A                                  3 18'***   I N V O I C E   H O L D   **-
     A                                      *'
     A                                  6  2'REGISTER NUMBER    PO NUMBER'
     A                                  6 36'INVOICE NUMBER    STATUS    MANIFE-
     A                                      ST NUMBER'
     A                                  9  1'INVOICE DATE    DUE DATE   TERMS'
     A                                  9 37'ENTRY DATE    MODIFY DATE    ADD I-
     A                                      D   MOD ID'
     A                                 13  2'INVOICE C/E   C/E AMOUNT'
     A                                 13 34'C/E ACCOUNT    INV MAT"L EXT'
     A                                 13 68'PO MAT"L EXT'
     A                                 16  7'PAYMENT ID      VENDOR CODE      N-
     A                                      ET DUE VENDOR    DISTRIBUTED COST'
     A                                 18  3'CHARGE AN "IT" (NO CHECK CREATED)'
     A                                 18 45'CURRENCY CODE'
     A                                 21  4'VERIFY INVOICE AND PRESS "ENTER" T-
     A                                      O PLACE INVOICE ON HOLD'
     A                                 22  4'PRESS "f3" TO RETURN TO MAIN MENU'
     A                                 22 38'WITHOUT PLACING INVOICE ON HOLD'
     A            RNUM           5A  B  5  2DSPATR(PR)
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A                                      OVRDTA
     A            PO             7A  B  5 21DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  5 29DSPATR(PR)
     A                                      OVRDTA
     A            INVNUM        14A  B  5 36DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B  5 54DSPATR(PR)
     A                                      OVRDTA
     A            MFNUM          8A  B  5 64DSPATR(PR)
     A                                      OVRDTA
     A            IDATE          8A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            DDATE          8A  B  8 17DSPATR(PR)
     A                                      OVRDTA
     A            TM             2A  B  8 29DSPATR(PR)
     A                                      OVRDTA
     A            EDATE          8A  B  8 38DSPATR(PR)
     A                                      OVRDTA
     A            MDATE          8A  B  8 52DSPATR(PR)
     A                                      OVRDTA
     A            ACLK           4A  B  8 67DSPATR(PR)
     A                                      OVRDTA
     A            MCLK           4A  B  8 76DSPATR(PR)
     A                                      OVRDTA
     A            TERMSDESCR    23A  B 10 24DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 12  2DSPATR(PR)
     A                                      OVRDTA
     A            CEAMT         15A  B 12 16DSPATR(PR)
     A                                      OVRDTA
     A            CEACCT         9A  B 12 34DSPATR(PR)
     A                                      OVRDTA
     A            IMATEXT       15A  B 12 47DSPATR(PR)
     A                                      OVRDTA
     A            PMATEXT       15A  B 12 65DSPATR(PR)
     A                                      OVRDTA
     A            P              1A  B 15 10DSPATR(PR)
     A                                      OVRDTA
     A            VENCODE        7A  B 15 23DSPATR(PR)
     A                                      OVRDTA
     A            VC             3A  B 15 31DSPATR(PR)
     A                                      OVRDTA
     A            NETDUEVEN     15A  B 15 39DSPATR(PR)
     A                                      OVRDTA
     A            DISTCOST      15A  B 15 59DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 18 39DSPATR(PR)
     A                                      OVRDTA
     A            CUR            2A  B 18 61DSPATR(PR)
     A                                      OVRDTA
     A            CURDESC       12A  B 18 64DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-MAIN MENU               -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INVMOD4
     A                                      PUTOVR
     A                                  1 15'I N V O I C E   P R O C E S S I N'
     A                                  1 49'G - ITEM DELETE'
     A                                  1 74'MOD-4'
     A                                  2 13'-----------------------------------
     A                                      --------------'
     A                                  2 73'-------'
     A                                  3  7'PO #'
     A                                  3 28'INVOICE #'
     A                                  3 57'REGISTER #'
     A                                  5  1'ITEM   CORP CODE'
     A                                  5 25'QUANTITY PAID  UM      UNIT PRICE'
     A                                  5 65'EXTENDED PRICE'
     A                                  6  1'DESCRIPTION **********************-
     A                                      ***********************************-
     A                                      **********'
     A                                  7 17'PO ==>'
     A                                  8 12'INVOICE ==>'
     A                                 15 18'PRIME   SUB   SUB-D   ADDL DATA'
     A                                 15 52'PERCENT'
     A                                 16 11'PO ==>'
     A                                 22  3'VERIFY CORRECT ITEM AND PRESS "ENT-
     A                                      ER" TO DELETE ITEM'
     A            PO             7A  B  3 13DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  3 21DSPATR(PR)
     A                                      OVRDTA
     A            INVNUM        14A  B  3 39DSPATR(PR)
     A                                      OVRDTA
     A            RNUM           5A  B  3 69DSPATR(PR HI BL)
     A                                      OVRDTA
     A            ITEM           4A  B  7  1DSPATR(PR)
     A                                      OVRDTA
     A            CRPCODE        7A  B  7  8DSPATR(PR)
     A                                      OVRDTA
     A            UNPDQTY       14A  B  7 24DSPATR(PR)
     A                                      OVRDTA
     A            PU             2A  B  7 40DSPATR(PR)
     A                                      OVRDTA
     A            PUPRICE       17A  B  7 44DSPATR(PR)
     A                                      OVRDTA
     A            PEXT          17A  B  7 63DSPATR(PR)
     A                                      OVRDTA
     A            IQTYPD        14A  B  8 24DSPATR(PR)
     A                                      OVRDTA
     A            IU             2A  B  8 40DSPATR(PR)
     A                                      OVRDTA
     A            IUPRICE       17A  B  8 44DSPATR(PR)
     A                                      OVRDTA
     A            IEXT          17A  B  8 63DSPATR(PR)
     A                                      OVRDTA
     A            MEMOMSGLIN    70A  B  9  6DSPATR(PR)
     A                                      OVRDTA
     A            DESCLINE01    79A  B 10  1DSPATR(PR)
     A                                      OVRDTA
     A            DESCLINE02    79A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            DESCLINE03    79A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            DESCLINE04    79A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            PR1            3A  B 16 19DSPATR(PR)
     A                                      OVRDTA
     A            S1             3A  B 16 26DSPATR(PR)
     A                                      OVRDTA
     A            SD1            4A  B 16 32DSPATR(PR)
     A                                      OVRDTA
     A            AD1            6A  B 16 40DSPATR(PR)
     A                                      OVRDTA
     A            PC1            6A  B 16 53DSPATR(PR)
     A                                      OVRDTA
     A            PR2            3A  B 17 19DSPATR(PR)
     A                                      OVRDTA
     A            S2             3A  B 17 26DSPATR(PR)
     A                                      OVRDTA
     A            SD2            4A  B 17 32DSPATR(PR)
     A                                      OVRDTA
     A            AD2            6A  B 17 40DSPATR(PR)
     A                                      OVRDTA
     A            PC2            6A  B 17 53DSPATR(PR)
     A                                      OVRDTA
     A            PR3            3A  B 18 19DSPATR(PR)
     A                                      OVRDTA
     A            S3             3A  B 18 26DSPATR(PR)
     A                                      OVRDTA
     A            SD3            4A  B 18 32DSPATR(PR)
     A                                      OVRDTA
     A            AD3            6A  B 18 40DSPATR(PR)
     A                                      OVRDTA
     A            PC3            6A  B 18 53DSPATR(PR)
     A                                      OVRDTA
     A            PR4            3A  B 19 19DSPATR(PR)
     A                                      OVRDTA
     A            S4             3A  B 19 26DSPATR(PR)
     A                                      OVRDTA
     A            SD4            4A  B 19 32DSPATR(PR)
     A                                      OVRDTA
     A            AD4            6A  B 19 40DSPATR(PR)
     A                                      OVRDTA
     A            PC4            6A  B 19 53DSPATR(PR)
     A                                      OVRDTA
     A            PR5            3A  B 20 19DSPATR(PR)
     A                                      OVRDTA
     A            S5             3A  B 20 26DSPATR(PR)
     A                                      OVRDTA
     A            SD5            4A  B 20 32DSPATR(PR)
     A                                      OVRDTA
     A            AD5            6A  B 20 40DSPATR(PR)
     A                                      OVRDTA
     A            PC5            6A  B 20 53DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-MAIN MENU               -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INVMOD5
     A*%%TS  SD  19960508  091442  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                  1 15'I N V O I C E   P R O C E S S I N'
     A                                  1 49'G - MODIFY'
     A                                  1 75'MOD-5'
     A                                  2 12'-----------------------------------
     A                                      ----------------'
     A                                  2 74'-------'
     A                                  3 18'***   I N V O I C E   D E L E T E'
     A                                  3 54'***'
     A                                  6  2'REGISTER NUMBER    PO NUMBER'
     A                                  6 36'INVOICE NUMBER    STATUS    MANIFE-
     A                                      ST NUMBER'
     A                                  9  1'INVOICE DATE    DUE DATE   TERMS'
     A                                  9 37'ENTRY DATE    MODIFY DATE    ADD I-
     A                                      D   MOD ID'
     A                                 13  2'INVOICE C/E     C/E AMOUNT    C/E'
     A                                 13 36'ACCOUNT    INV MAT"L EXT'
     A                                 13 67'PO MAT"L EXT'
     A                                 16  7'PAYMENT ID      VENDOR CODE      N-
     A                                      ET DUE VENDOR    DISTRIBUTED COST'
     A                                 18  3'CHARGE AN "IT" (NO CHECK CREATED)'
     A                                 18 45'CURRENCY CODE'
     A                                 21  4'VERIFY INVOICE AND PRESS "ENTER" T-
     A                                      O DELETE INVOICE'
     A                                 22  4'PRESS "f3" TO RETURN TO MAIN MENU'
     A                                 22 38'WITHOUT DELETING THE INVOICE'
     A            RNUM           5A  B  5  2DSPATR(PR)
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A                                      OVRDTA
     A            PO             7A  B  5 21DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  5 29DSPATR(PR)
     A                                      OVRDTA
     A            INVNUM        14A  B  5 36DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B  5 54DSPATR(PR)
     A                                      OVRDTA
     A            MFNUM          8A  B  5 64DSPATR(PR)
     A                                      OVRDTA
     A            IDATE          8A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            DDATE          8A  B  8 17DSPATR(PR)
     A                                      OVRDTA
     A            TM             2A  B  8 29DSPATR(PR)
     A                                      OVRDTA
     A            EDATE          8A  B  8 38DSPATR(PR)
     A                                      OVRDTA
     A            MDATE          8A  B  8 52DSPATR(PR)
     A                                      OVRDTA
     A            ACLK           4A  B  8 67DSPATR(PR)
     A                                      OVRDTA
     A            MCLK           4A  B  8 76DSPATR(PR)
     A                                      OVRDTA
     A            TERMSDESCR    23A  B 10 24DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 12  2DSPATR(PR)
     A                                      OVRDTA
     A            CEAMT         15A  B 12 15DSPATR(PR)
     A                                      OVRDTA
     A            CEACCT         9A  B 12 32DSPATR(PR)
     A                                      OVRDTA
     A            IMATEXT       15A  B 12 45DSPATR(PR)
     A                                      OVRDTA
     A            PMATEXT       15A  B 12 64DSPATR(PR)
     A                                      OVRDTA
     A            P              1A  B 15 10DSPATR(PR)
     A                                      OVRDTA
     A            VENCODE        7A  B 15 23DSPATR(PR)
     A                                      OVRDTA
     A            VC             3A  B 15 31DSPATR(PR)
     A                                      OVRDTA
     A            NETDUEVEN     15A  B 15 39DSPATR(PR)
     A                                      OVRDTA
     A            DISTCOST      15A  B 15 59DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 18 39DSPATR(PR)
     A                                      OVRDTA
     A            CUR            2A  B 18 61DSPATR(PR)
     A                                      OVRDTA
     A            CURDESC       12A  B 18 64DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-MAIN MENU               -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
