     A*  89/02/06  15:58:09    A034675     REL-R01M02  5728-PW1
     A*            18:50:18    T881S28     VINVPSWD.HPTO38.CME
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A          R INVPSWD1
     A*  89/02/06  15:36:08    A034675     REL-R01M02  5728-PW1
     A                                      CA01(01)
     A                                      CA02(02)
     A                                      CA03(03)
     A                                      CA04(04)
     A                                      CA05(05)
     A                                      CA06(06)
     A                                      CA07(07)
     A                                      CA08(08)
     A                                      PUTOVR
     A                                  2  6'I N V O I C E   P R O C E S S I N'
     A                                  2 40'G - PASSWORD MAINTENANCE'
     A                                  2 67'INVPSWD-1'
     A                                  7 21'PASSWORD MAINTENANCE PROGRAM FUNCT-
     A                                      IONS'
     A                                 10 10'       f1   -  ADD A NEW ID AND PA-
     A                                      SSWORD ENTRY'
     A                                 12 10'       f2   -  CHANGE AN EXISTING'
     A                                 12 44'PASSWORD ENTRY'
     A                                 14 10'       f3   -  EXIT PROGRAM      '
     A                                 16 10'       f4   -  INQUIRE ABOUT AN EX-
     A                                      ISTING PASSWORD ENTRY      '
     A                                 18 10'       f5   -  DELETE AN EXISTING'
     A                                 18 44'PASSWORD ENTRY'
     A            FLD001         1   B  5  3
     A  01                                  OVRATR
     A            COMMANDLN1    79A  O 24  1
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INVPSWD2
     A*  89/02/06  15:58:09    A034675     REL-R01M02  5728-PW1
     A                                      CA01(01)
     A                                      CA02(02)
     A                                      CA03(03)
     A                                      CA04(04)
     A                                      CA05(05)
     A                                      CA06(06)
     A                                      CA07(07)
     A                                      CA08(08)
     A                                      PUTOVR
     A                                  2  2'I N V O I C E   P R O C E S S I N'
     A                                  2 36'G - PASSWORD MAINTENANCE'
     A                                  2 71'INVPSWD-2'
     A                                  6 13'¦----------------------------------
     A                                      --------------¦'
     A                                  7 13'¦  PROVIDE THE EMPLOYEE ID  AND  P-
     A                                      RESS "ENTER"  ¦'
     A                                  8 13'¦----------------------------------
     A                                      --------------¦'
     A                                  9 24'¦'
     A                                  9 50'¦'
     A                                 10 24'¦   EMPLOYEE ID'
     A                                 10 50'¦'
     A                                 11 24'¦'
     A                                 11 50'¦'
     A                                 12 24'¦-------------------------¦'
     A            EMID           4A  B 10 42DSPATR(UL)
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INVPSWD3
     A*  89/02/06  15:58:09    A034675     REL-R01M02  5728-PW1
     A                                      CA01(01)
     A                                      CA02(02)
     A                                      CA03(03)
     A                                      CA04(04)
     A                                      CA05(05)
     A                                      CA06(06)
     A                                      CA07(07)
     A                                      CA08(08)
     A                                      PUTOVR
     A                                  2  2'I N V O I C E   P R O C E S S I N'
     A                                  2 36'G - PASSWORD ADD'
     A                                  2 71'INVPSWD-A'
     A                                  6  9'¦----------------------------------
     A                                      ------------------------¦'
     A                                  7  9'¦  PROVIDE THE FOLLOWING INFORMATI-
     A                                      ON  AND  PRESS "ENTER"  ¦'
     A                                  8  9'¦----------------------------------
     A                                      ------------------------¦'
     A                                  9 18'¦'
     A                                  9 59'¦'
     A                                 10 18'¦    EMPLOYEE ID'
     A                                 10 59'¦'
     A                                 11 18'¦'
     A                                 11 59'¦'
     A                                 12 18'¦    EMPLOYEE PASSWORD'
     A                                 12 59'¦'
     A                                 13 18'¦'
     A                                 13 59'¦'
     A                                 14 18'¦    LENGTH OF VALIDITY'
     A                                 14 49'(IN DAYS) ¦'
     A                                 15 18'¦'
     A                                 15 59'¦'
     A                                 16 18'¦    AUTHORIZATION ID'
     A                                 16 59'¦'
     A                                 17 18'¦'
     A                                 17 59'¦'
     A                                 18 18'¦----------------------------------
     A                                      -------¦'
     A            EMID           4A  B 10 37DSPATR(UL)
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                      OVRDTA
     A            EMPSWD         8A  B 12 43DSPATR(UL)
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                      OVRDTA
     A            LV             2Y 0B 14 44DSPATR(UL)
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                      OVRDTA
     A            AUTH           4A  B 16 42DSPATR(UL)
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INVPSWD4
     A*  89/02/06  15:58:09    A034675     REL-R01M02  5728-PW1
     A                                      CA01(01)
     A                                      CA02(02)
     A                                      CA03(03)
     A                                      CA04(04)
     A                                      CA05(05)
     A                                      CA06(06)
     A                                      CA07(07)
     A                                      CA08(08)
     A                                      PUTOVR
     A                                  2  2'I N V O I C E   P R O C E S S I N'
     A                                  2 36'G - PASSWORD CHANGE'
     A                                  2 71'INVPSWD-C'
     A                                  6  9'¦----------------------------------
     A                                      ------------------------¦'
     A                                  7  9'¦  PROVIDE THE FOLLOWING INFORMATI-
     A                                      ON  AND  PRESS "ENTER"  ¦'
     A                                  8  9'¦----------------------------------
     A                                      ------------------------¦'
     A                                  9 17'¦'
     A                                  9 59'¦'
     A                                 10 17'¦   EMPLOYEE ID'
     A                                 10 59'¦'
     A                                 11 17'¦'
     A                                 11 59'¦'
     A                                 12 17'¦   EMPLOYEE CURRENT PASSWORD'
     A                                 12 59'¦'
     A                                 13 17'¦'
     A                                 13 59'¦'
     A                                 14 17'¦   EMPLOYEE NEW PASSWORD'
     A                                 14 59'¦'
     A                                 15 17'¦'
     A                                 15 59'¦'
     A                                 16 17'¦   LENGTH OF VALIDITY'
     A                                 16 47'(IN DAYS)   ¦'
     A                                 17 17'¦'
     A                                 17 59'¦'
     A                                 18 17'¦   AUTHORIZATION ID'
     A                                 18 59'¦'
     A                                 19 17'¦'
     A                                 19 59'¦'
     A                                 20 17'¦----------------------------------
     A                                      --------¦'
     A            EMID           4A  B 10 35DSPATR(PR)
     A                                      OVRDTA
     A            ECPSWD         8A  B 12 49DSPATR(PR)
     A                                      OVRDTA
     A            ENPSWD         8A  B 14 45DSPATR(UL)
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                      OVRDTA
     A            LV             2Y 0B 16 42DSPATR(UL)
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A                                      OVRDTA
     A            AUTH           4A  B 18 40DSPATR(UL)
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INVPSWD5
     A*  89/02/06  15:58:09    A034675     REL-R01M02  5728-PW1
     A                                      CA01(01)
     A                                      CA02(02)
     A                                      CA03(03)
     A                                      CA04(04)
     A                                      CA05(05)
     A                                      CA06(06)
     A                                      CA07(07)
     A                                      CA08(08)
     A                                      PUTOVR
     A                                  2  2'I N V O I C E   P R O C E S S I N'
     A                                  2 36'G - PASSWORD DELETE'
     A                                  2 71'INVPSWD-D'
     A                                  6  9'¦----------------------------------
     A                                      ------------------------¦'
     A                                  7  9'¦  PROVIDE THE FOLLOWING INFORMATI-
     A                                      ON  AND  PRESS "ENTER"  ¦'
     A                                  8  9'¦----------------------------------
     A                                      ------------------------¦'
     A                                  9 21'¦'
     A                                  9 55'¦'
     A                                 10 21'¦   EMPLOYEE ID'
     A                                 10 55'¦'
     A                                 11 21'¦'
     A                                 11 55'¦'
     A                                 12 21'¦   EMPLOYEE PASSWORD'
     A                                 12 55'¦'
     A                                 13 21'¦'
     A                                 13 55'¦'
     A                                 14 21'¦   AUTHORIZATION ID'
     A                                 14 55'¦'
     A                                 15 21'¦'
     A                                 15 55'¦'
     A                                 16 21'¦----------------------------------
     A                                      ¦'
     A            EMID           4A  B 10 39DSPATR(PR)
     A                                      OVRDTA
     A            EMPSWD         8A  B 12 45DSPATR(PR)
     A                                      OVRDTA
     A            AUTH           4A  B 14 44DSPATR(UL)
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INVPSWD6
     A*  89/02/06  15:58:09    A034675     REL-R01M02  5728-PW1
     A                                      CA01(01)
     A                                      CA02(02)
     A                                      CA03(03)
     A                                      CA04(04)
     A                                      CA05(05)
     A                                      CA06(06)
     A                                      CA07(07)
     A                                      CA08(08)
     A                                      PUTOVR
     A                                  2  2'I N V O I C E   P R O C E S S I N'
     A                                  2 36'G - PASSWORD INQUIRY'
     A                                  2 71'INVPSWD-I'
     A                                  6 10'¦----------------------------------
     A                                      -------------------------¦'
     A                                  7 10'¦'
     A                                  7 69'¦'
     A                                  8 10'¦    EMPLOYEE ID'
     A                                  8 69'¦'
     A                                  9 10'¦'
     A                                  9 69'¦'
     A                                 10 10'¦    EMPLOYEE CURRENT PASSWORD'
     A                                 10 69'¦'
     A                                 11 10'¦'
     A                                 11 69'¦'
     A                                 12 10'¦    DATE ADDED'
     A                                 12 69'¦'
     A                                 13 10'¦'
     A                                 13 69'¦'
     A                                 14 10'¦    DATE CHANGED'
     A                                 14 69'¦'
     A                                 15 10'¦'
     A                                 15 69'¦'
     A                                 16 10'¦    DATE OF LAST ACTIVITY FOR THI-
     A                                      S PASSWORD'
     A                                 16 69'¦'
     A                                 17 10'¦'
     A                                 17 69'¦'
     A                                 18 10'¦    LAST FUNCTION FOR THIS PASSWO-
     A                                      RD'
     A                                 18 69'¦'
     A                                 19 10'¦'
     A                                 19 69'¦'
     A                                 20 10'¦    LENGTH OF VALIDITY'
     A                                 20 41'(IN DAYS)'
     A                                 20 69'¦'
     A                                 21 10'¦'
     A                                 21 69'¦'
     A                                 22 10'¦----------------------------------
     A                                      -------------------------¦'
     A            EMID           4   O  8 29
     A            ECPSWD         8   O 10 43
     A            ADATE          8A  O 12 28
     A            CDATE          8A  O 14 30
     A            LADATE         8A  O 16 57
     A            F              1A  O 18 49
     A            LV             2A  O 20 36
     A            COMMANDLN1    79A  O 24  1
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
