     A*  89/01/19  12:14:35    T881S03     REL-R01M02  5728-PW1
     A*            19:07:37    T881S28     VJPMAINT.HPTO38.CME
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A                                      CA03(03 'End program')
     A          R FJPMAIN1
     A*  89/01/17  10:34:52    T881S03     REL-R01M02  5728-PW1
     A                                      PUTOVR
     A  98                                  INVITE
     A                                  6 11'INPUT W/O"S JOBPLAN TO BE COPIED'
     A            WOIN6          6   B  6 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            WOINYR         1   B  6 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            WOINRE         3   B  6 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                  7 11'INPUT JOBPLAN SEQUENCE TO BE COPIE-
     A                                      D'
     A            WOINSQ         3A  B  7 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                  9 11'INPUT W/O JOBPLAN IS TO BE COPIED'
     A                                  9 45'TO'
     A            WOUT6          6   B  9 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            WOUTYR         1   B  9 59DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            WOUTRE         3   B  9 61DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A                                 10 11'INPUT JOBPLAN SEQUENCE TO BE COPIE-
     A                                      D TO'
     A            B              3A  B 10 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A                                 13  3'N.B. -  If the jobplan sequence to'
     A                                 13 38'be copied is left blank, the entir-
     A                                      e'
     A                                 14 11'jobplan for the w/o will be copied-
     A                                      . If a sequence is entered'
     A                                 15 11'in the jobplan sequence to be copi-
     A                                      ed, only that sequence will'
     A                                 16 11'be copied to the new w/o. If a job-
     A                                      plan sequence to be copied to'
     A                                 17 11'is input, the jobplan sequence to'
     A                                 17 45'be copied will be copied to'
     A                                 18 11'the jobplan to be copied to as the'
     A                                 18 46'new sequence.'
     A                                 21 19'DEPRESS F3 TO EXIT THE SCREEN'
     A            COMMANDLN1    79A  O 24  1OVRDTA
     A  99        ERRMSG        79   M      OVRDTA
     A          R FJPMAIN2
     A*  89/01/19  11:29:23    T881S03     REL-R01M02  5728-PW1
     A                                      PUTOVR
     A  98                                  INVITE
     A                                  8  8'INPUT W/O# FOR JOBPLAN YOU WISH TO'
     A                                  8 43'DELETE'
     A            WODEL6         6A  B  8 58DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            WODELY         1A  B  8 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            WODELR         3A  B  8 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                 10  8'INPUT JOBPLAN SEQUENCE OF W/O# YOU'
     A                                 10 43'WISH DELETED'
     A            WOR            3A  B 10 58DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            NOOP          13   H
     A                                 15  8'N.B. -  If no jobplan sequence is'
     A                                 15 42'entered, the entire jobplan'
     A                                 16 16'for the w/o will be deleted. If a'
     A                                 16 50'jobplan sequence is'
     A                                 17 16'entered, only that sequence will b-
     A                                      e deleted.'
     A                                 21 22'DEPRESS F3 TO EXIT THIS SCREEN'
     A            COMMANDLN1    79A  O 24  1OVRDTA
     A  99        ERRMSG        79   M      OVRDTA
     A          R FJPMSELF
     A*  88/12/20  09:14:34    T881S03     REL-R01M02  5728-PW1
     A                                      CF01(01 'Copy a jobplan')
     A                                      CF02(02 'Delete a jobplan')
     A                                      PUTOVR
     A                                  8 17'CHOOSE THE FUNCTION YOU WOULD LIKE'
     A                                  8 52'TO EXECUTE'
     A                                 11 14'F1  -  COPY   AN EXISTING JOBPLAN -
     A                                      (FROM ONE W/O TO ANOTHER)'
     A                                 13 14'F2  -  DELETE AN EXISTING JOBPLAN'
     A                                 16 17'F3  -  EXIT THE PROGRAM'
     A            COMMANDLN1    79A  O 24  1OVRDTA
     A  99        ERRMSG        79   M      OVRDTA
