     A*%%TS  DD  20021029  150646  QUSER       REL-V5.1    iSeries WDT
     A*%%FD Screen for DBMAINT program (TMASTER)
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A                                      CA03
     A          R FHIERTYP1
     A*%%TS  DD  19931119  073523  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                  1 24'----------------------------------'
     A                                  2 24'. C O P Y    S U B S Y S T E M S .'
     A                                  3 24'----------------------------------'
     A                                  5  8'-----------------------------------
     A                                      -------------------------------'
     A                                  6  8':COPY OLD TYPE NUMBER'
     A                                  6 39'TO NEW TYPE NUMBER'
     A                                  6 67'     :'
     A                                  7  8':'
     A                                  7 72':'
     A                                  8  8':KEY IN 4 DIGIT SUBSYSTEM(S) FOR (-
     A                                      1) OR (2) - KEY IN "A" FOR (3):'
     A                                  9  8'-----------------------------------
     A                                      -------------------------------'
     A                                 12  3'(1) ONE LEVEL     OLD'
     A                                 12 33'COPIES NEXT LEVEL OF SUBSYSTEMS ..-
     A                                      ............'
     A                                 13 26'TO     FOR EXAMPLE : 5100 MEANS CO-
     A                                      PY 5110  5140  5170'
     A                                 14 21'NEW'
     A                                 14 63'5120  5150  5180'
     A                                 15 12'(Defaults to OLD)'
     A                                 15 63'5130  5160  5190'
     A                                 17  3'(2) LOWER LEVELS  OLD'
     A                                 17 33'COPIES ALL LOWER LEVEL SUBSYSTEMS'
     A                                 17 67'............'
     A                                 18 26'TO     FOR EXAMPLE : 5100 MEANS CO-
     A                                      PY ALL ENTRIES THAT'
     A                                 19 21'NEW'
     A                                 19 47'BRANCH FROM 5100'
     A                                 20 12'(Defaults to OLD)'
     A                                 22  3'(3) ALL LEVELS'
     A                                 22 33'COPIES ALL SUBSYSTEMS ............-
     A                                      ............'
     A            TYPE1          8A  B  6 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            TYPE2          8A  B  6 58DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            NUM1           4A  B 12 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            NUM3           4A  B 14 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            NUM2           4A  B 17 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            NUM4           4A  B 19 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            A              1A  B 22 28DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-HELP f3-END PROGRAM     -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FHIERTYP2
     A*%%TS  DD  19931119  073523  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                  1  2'-----'
     A                                  2  1': 1 :'
     A                                  2 28'Copy Subsystem Help Screen'
     A                                  3  1'-----'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1'This program copies a certain leve-
     A                                      l (next lower level of subsystems),-
     A                                       all lower'
     A                                  7  1'levels of a specific subsystem , o-
     A                                      r all the subsystems. The program'
     A                                  7 69'performs'
     A                                  8  1'only 1 of these copies at a time.'
     A                                  8 35'It copies from one type number to'
     A                                  8 69'another as'
     A                                  9  1'well as copying entries within the'
     A                                  9 36'same type number.'
     A                                 11  1'For example  .....................-
     A                                      ...................................-
     A                                      ...'
     A                                 12 14'. Copy 31225000_1500   to   325050-
     A                                      00_1500 - option 1 or 2 .'
     A                                 13 14'.      31225000_8400   to   325050-
     A                                      00_2350 - option 1      .'
     A                                 14 14'.      31225000_7000   to   312250-
     A                                      00_8000 - option 1 or 2 .'
     A                                 15 14'.      31225000'
     A                                 15 37'to   32311000      - option 3'
     A                                 15 72'.'
     A                                 16 14'..................................-
     A                                      .........................'
     A                                 18  1'The program will not copy subsyste-
     A                                      ms to an equipment type number wher-
     A                                      e the sub '
     A                                 19  1'systems already exist. If this is'
     A                                 19 35'attempted the program will display'
     A                                 19 70'a message'
     A                                 20  1'and disallow the copy.'
     A                                 22  1'To copy all the subsystems the new'
     A                                 22 36'type number must not exist at all'
     A                                 22 70'within the'
     A                                 23  1'subsystem file.'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-NEXT PAGE f3-EXIT       -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FHIERTYP3
     A*%%TS  DD  19931119  073523  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                  1  2'-----'
     A                                  2  1': 2 :'
     A                                  2 28'Copy Subsystem Help Screen'
     A                                  3  1'-----'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1'To use copy option 1 or 2 first le-
     A                                      vel subsystems must exist for the'
     A                                  6 69'type number'
     A                                  7  1'that will receive the copies.'
     A                                  9  1'To copy the next lower level subsy-
     A                                      stems of a specific subsystem (opti-
     A                                      ons 1 & 2)'
     A                                 10  1'for example the 2500 level (which'
     A                                 10 35'would include 2510 thru 2590) ...'
     A                                 10 69'the parent'
     A                                 11  1'entry (from which all these entrie-
     A                                      s branch from) must exist for the'
     A                                 11 69'new type'
     A                                 12  1'number. In this case that entry is'
     A                                 12 36'2500.'
     A                                 14  1'For all three options both type nu-
     A                                      mbers are required (same or differe-
     A                                      nt).'
     A                                 16  1'For copy option 1, the old subsyst-
     A                                      em is required. The new subsystem'
     A                                 16 69'defaults'
     A                                 17  1'to the old if left blank. You can'
     A                                 17 35'copy the next lower level subsyste-
     A                                      ms for any'
     A                                 18  1'specific subsystem of a type numbe-
     A                                      r to any other subsystem of a type'
     A                                 18 70'number.'
     A                                 20  1'For copy option 2, the old subsyst-
     A                                      em is required. The new subsystem'
     A                                 20 69'defaults'
     A                                 21  1'to the old if left blank. This opt-
     A                                      ion allows you to copy all entries'
     A                                 21 70'branching'
     A                                 22  1'from a particular entry. The old e-
     A                                      ntry and the new entry must have th-
     A                                      e same num'
     A                                 23  1'ber of "0"s. For example copy ....-
     A                                      .. 1500 to 8700   9000 to 1000   35-
     A                                      60 to 5550'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-NEXT PAGE f3-EXIT       -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FHIERTYP4
     A*%%TS  DD  19931119  073523  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A  98                                  INVITE
     A                                  4 10'-----------------------------------
     A                                      ---------------------------'
     A                                  5 10':'
     A                                  5 70':'
     A                                  6 10':'
     A                                  6 21'C O P Y    W A S    S U C C E S S'
     A                                  6 55'F U L'
     A                                  6 70':'
     A                                  7 10':'
     A                                  7 70':'
     A                                  8 10'-----------------------------------
     A                                      ---------------------------'
     A            FIELD1        61A  B 10 10DSPATR(PR)
     A                                      OVRDTA
     A            FIELD2        61A  B 11 10DSPATR(PR)
     A                                      OVRDTA
     A            FIELD3        61A  B 12 10DSPATR(PR)
     A                                      OVRDTA
     A            FIELD4        61A  B 13 10DSPATR(PR)
     A                                      OVRDTA
     A            FIELD5        61A  B 14 10DSPATR(PR)
     A                                      OVRDTA
     A            FIELD6        61A  B 15 10DSPATR(PR)
     A                                      OVRDTA
     A            FIELD7        61A  B 16 10DSPATR(PR)
     A                                      OVRDTA
     A            FIELD8        61A  B 17 10DSPATR(PR)
     A                                      OVRDTA
     A            FIELD9        61A  B 18 10DSPATR(PR)
     A                                      OVRDTA
     A            FIELD0        61A  B 19 10DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R MAIN_MENU
     A*%%TS  DD  19970204  114811  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A                                      CF10
     A                                  1  2'TMASTER'
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                  2 16'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = ='
     A                                      DSPATR(HI)
     A                                  3 18'M A S T E R   F I L E   M A I N T -
     A                                      E N A N C E'
     A                                      DSPATR(HI)
     A                                  4 16'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = ='
     A                                      DSPATR(HI)
     A                                  7 22'f1  -  CRAFT FILE'
     A                                  8 22'f2  -  CREW FILE'
     A                                  9 22'f3  -  >>> Exit Program <<<'
     A                                 10 22'f4  -  EQUIPMENT FILE'
     A                                 11 22'f5  -  >>>  Not Used  <<<'
     A                                 12 22'f6  -  ZONE AND PLANTWIDE CRAFT PR-
     A                                      INTERS'
     A                                 13 22'f7  -  LOCAL PROCESSING FILE'
     A                                 14 22'f8  -  SHIFT STRUCTURE FILE'
     A                                 15 22'f9  -  SUBSYSTEM FILE'
     A                                 16 21'f10  -  ZONE PRIORITY FILE'
     A                                 21 15'PRESS APPROPRIATE FUNCTION KEY TO -
     A                                      SELECT OPTION'
     A                                      DSPATR(HI)
     A            COMMANDLN1    79A  B 24  1DFTVAL('  PRESS FUNCTION KEY TO CON-
     A                                      TINUE                        F3 - E-
     A                                      XIT PROGRAM      ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R MASS_MENU
     A*%%TS  DD  19970204  114811  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                  1  2'TMASTER'
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                  2 16'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = ='
     A                                      DSPATR(HI)
     A                                  3 18'M A S T E R   F I L E   M A I N T -
     A                                      E N A N C E'
     A                                      DSPATR(HI)
     A                                  4 16'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = ='
     A                                      DSPATR(HI)
     A                                  7 10'f1  -  CHANGE ALL RECORDS TO NEW L-
     A                                      OCAL EQUIPMENT NUMBER'
     A                                  8 10'f2  -  CHANGE RIME NUMBERS FOR USE-
     A                                      R-SPECIFIED TYPE NUMBERS'
     A                                 21 15'PRESS APPROPRIATE FUNCTION KEY TO -
     A                                      SELECT OPTION'
     A                                      DSPATR(HI)
     A            COMMANDLN1    79A  B 24  1DFTVAL('F3 - EXIT PROGRAM')
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R LOCALSW
     A*%%TS  DD  20021029  150646  QUSER       REL-V5.1    iSeries WDT
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  9'L O C A L   P R O C E S S I N G   -
     A                                      F I L E   M A I N T E N A N C E'
     A                                      DSPATR(HI)
     A                                  3  9'PLANT IDENTIFICATION CODE :'
     A            PLNT           4A  B  3 37DSPATR(UL)
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  3 55'PLANT DATE FLAG :'
     A            DATEFLAG       1A  B  3 73DSPATR(UL)
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  5  9'PLANT SWITCHES :'
     A                                  6  9'A'
     A                                      DSPATR(HI)
     A            SWITCHA        1A  B  6 11DSPATR(UL)
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  6 14'REQUIRE PERSONNEL PASSWORDS TO SEN-
     A                                      D MESSAGES TO CC NUMBERS'
     A                                  7  9'B'
     A                                      DSPATR(HI)
     A            SWITCHB        1A  B  7 11DSPATR(UL)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  7 14'REQUIRE PERSONNEL PASSWORDS TO IP -
     A                                      / CW IN CRAFTSMAN FUNCTIONS'
     A                                  8  9'C'
     A                                      DSPATR(HI)
     A            SWITCHC        1A  B  8 11DSPATR(UL)
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  8 14'ACTIVATE MULTIPLE  IP  ON WORK ORD-
     A                                      ERS  IN CRAFTSMAN FUNCTIONS'
     A                                  9  9'D'
     A                                      DSPATR(HI)
     A            SWITCHD        1A  B  9 11DSPATR(UL)
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  9 14'CHANGE WO INQUIRY IN CRAFTSMAN FUN-
     A                                      CTIONS TO Q1 PROGRAM    '
     A                                 10  9'E'
     A                                      DSPATR(HI)
     A            SWITCHE        1A  B 10 11DSPATR(UL)
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 10 14'ALLOW MULTIPLE ITEM STOREROOM WITH-
     A                                      DRAWALS                 '
     A                                 11  9'F'
     A                                      DSPATR(HI)
     A            SWITCHF        1A  B 11 11DSPATR(UL)
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 11 14'ALLOW CRAFTSMAN WORKSHEET TO PRINT-
     A                                       IN CRAFTSMAN FUNCTIONS '
     A                                 12  9'G'
     A                                      DSPATR(HI)
     A            SWITCHG        1A  B 12 11DSPATR(UL)
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 12 14'ALLOW REQUISITIONS TO BE CUT AGAIN-
     A                                      ST A VERBAL W/O         '
     A                                 13  9'H'
     A                                      DSPATR(HI)
     A            SWITCHH        1A  B 13 11DSPATR(UL)
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 13 14'ACTIVATE 3 MINUTE SCREEN REFRESH I-
     A                                      N WO QUEUE BACKLOG INQUIRY'
     A                                 14  9'I'
     A                                      DSPATR(HI)
     A            SWITCHI        1A  B 14 11DSPATR(UL)
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 14 14'TURN ON FLAG FOR ASBESTOS INDICATO-
     A                                      R IN VERBAL WORKORDERS'
     A                                 15  9'J'
     A                                      DSPATR(HI)
     A            SWITCHJ        1A  B 15 11DSPATR(UL)
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 15 14'INCLUDE ''PR'' STATUS WORKORDERS I-
     A                                      N PM QUEUE BACKLOG INQUIRY'
     A                                 16  9'K'
     A                                      DSPATR(HI)
     A            SWITCHK        1A  B 16 11DSPATR(UL)
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 16 14'IGNORE ESTIMATE FLAG LOGIC FOR THE-
     A                                       DISPLAY PROGRAMS          '
     A                                 17  9'L'
     A                                      DSPATR(HI)
     A            SWITCHL        1A  B 17 11DSPATR(UL)
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 17 14'DISPLAY 24 HOUR EQUIPMENT HISTORY -
     A                                      AT VERBAL IP               '
     A                                 18  9'M'
     A                                      DSPATR(HI)
     A            SWITCHM        1A  B 18 11DSPATR(UL)
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 18 14'REQUIRE PERSONAL PASSWORDS TO MODI-
     A                                      FY WORK ORDERS             '
     A                                 19  9'N'
     A                                      DSPATR(HI)
     A            SWITCHN        1A  B 19 11DSPATR(UL)
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 20  9'P'
     A                                      DSPATR(HI)
     A            SWITCHP        1A  B 20 11DSPATR(UL)
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 20 14'NOT USED  --  AVAILABLE           -
     A                                                              '
     A                                 22  9'PLACE AN'
     A                                 22 18'O'
     A                                      DSPATR(HI)
     A                                 22 20'BESIDE THE SWITCH YOU WISH TO TURN-
     A                                       ON, SPACE TO TURN OFF'
     A                                 23  9'PRESS Enter TO AFFECT CHANGES'
     A            COMMANDLIN    79A  B 24  1DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A                                 19 14'MAKE COMMENTS OPTIONAL WHEN LV''IN-
     A                                      G A WORKORDER'
     A*%%GP SCREEN1    01
     A          R SCREEN8
     A*%%TS  SD  19920528  151850  A193138     REL-V2R1M0  5738-PW1
     A                                      CF01(01 'list')
     A                                      CF02(02 'edit')
     A                                      CF04(04 'update and verify delete')
     A                                      CF05(05 'copy')
     A                                      PUTOVR
     A                                  1 15'S U B S Y S T E M   F I L E   M A -
     A                                      I N T E N A N C E'
     A                                      DSPATR(HI)
     A                                  3  2'PRESS f1 TO LIST'
     A                                  4  8'f2 TO EDIT   SUBSYSTEM'
     A            SUBSYS         4A  B  4 32CHGINPDFT(CS UL)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  4 37'TYPE NUMBER'
     A            TYPENUM        8A  B  4 50CHGINPDFT(CS UL)
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  5  8'f4 TO UPDATE TYPE NUMBER'
     A            TYPENUM1       8A  B  5 34DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  6  8'f5 TO COPY SUBSYSTEMS'
     A                                  8  2'SUBSYSTEM'
     A                                  8 17'DESCRIPTION'
     A            SUB0           4A  B  9  2DSPATR(PR)
     A                                      OVRDTA
     A            DESC0         50A  B  9 17CHGINPDFT(CS UL LC)
     A                                      OVRDTA
     A            SUB1           4A  B 11  2DSPATR(PR)
     A                                      OVRDTA
     A            DESC1         50A  B 11 17CHGINPDFT(CS UL LC)
     A                                      OVRDTA
     A            SUB2           4A  B 12  2DSPATR(PR)
     A                                      OVRDTA
     A            DESC2         50A  B 12 17CHGINPDFT(CS UL LC)
     A                                      OVRDTA
     A            SUB3           4A  B 13  2DSPATR(PR)
     A                                      OVRDTA
     A            DESC3         50A  B 13 17CHGINPDFT(CS UL LC)
     A                                      OVRDTA
     A            SUB4           4A  B 14  2DSPATR(PR)
     A                                      OVRDTA
     A            DESC4         50A  B 14 17CHGINPDFT(CS UL LC)
     A                                      OVRDTA
     A            SUB5           4A  B 15  2DSPATR(PR)
     A                                      OVRDTA
     A            DESC5         50A  B 15 17CHGINPDFT(CS UL LC)
     A                                      OVRDTA
     A            SUB6           4A  B 16  2DSPATR(PR)
     A                                      OVRDTA
     A            DESC6         50A  B 16 17CHGINPDFT(CS UL LC)
     A                                      OVRDTA
     A            SUB7           4A  B 17  2DSPATR(PR)
     A                                      OVRDTA
     A            DESC7         50A  B 17 17CHGINPDFT(CS UL LC)
     A                                      OVRDTA
     A            SUB8           4A  B 18  2DSPATR(PR)
     A                                      OVRDTA
     A            DESC8         50A  B 18 17CHGINPDFT(CS UL LC)
     A                                      OVRDTA
     A            SUB9           4A  B 19  2DSPATR(PR)
     A                                      OVRDTA
     A            DESC9         50A  B 19 17CHGINPDFT(CS UL LC)
     A                                      OVRDTA
     A                                 21  2'Leave the DESCRIPTION blank to del-
     A                                      ete the SUBSYSTEM'
     A                                 22  2'Delete all lower level SUBSYSTEMS'
     A            L              1A  B 22 36CHGINPDFT(CS UL LC)
     A                                      OVRDTA
     A                                 23  2'Delete linked SPARE PARTS'
     A            S              1A  B 23 28CHGINPDFT(CS UL LC)
     A                                      OVRDTA
     A  99        ERRMSG        79   M      OVRDTA
     A            VERIFYMSG     76   O 24  2DSPATR(BL)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A          R CFTADD
     A*%%TS  DD  19970305  143344  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2 20'C R A F T   F I L E   M A I N T E -
     A                                      N A N C E'
     A                                  4 33'ADD NEW CRAFT'
     A                                      DSPATR(HI)
     A                                  5  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  7  4'ENTER DATA AND PRESS THE ''ENTER''-
     A                                       KEY:'
     A                                      DSPATR(HI)
     A                                  9 23'NEW CRAFT:'
     A            CRAFT          2A  B  9 36DSPATR(PR)
     A                                      OVRDTA
     A                                  9 42'CRAFT FLAG:'
     A            FLAG           1A  B  9 56DSPATR(UL)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 11  4'CRAFT FLAG must be one of the foll-
     A                                      owing:'
     A                                 13  5'''Blank'' - Normal Craft assigned -
     A                                      by Zone'
     A                                 15  7'''1''   - Craft assigned Plantwide-
     A                                      , Workorder will print on Craft pri-
     A                                      nter'
     A                                 17  7'''2''   - Craft assigned Plantwide-
     A                                      , Workorder will NOT print'
     A                                 19 13'-'
     A                                 21  7'''4''   - Special Craft, Workorder-
     A                                      s will NOT be placed in Open-WO-Que-
     A                                      ue'
     A            COMMANDLN1    79A  B 24  1DFTVAL('    F1 - RETURN TO MENU    -
     A                                                        F3/F8 - EXIT PROG-
     A                                      RAM              ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R CFTCHANGE
     A*%%TS  DD  19970305  143344  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2 20'C R A F T   F I L E   M A I N T E -
     A                                      N A N C E'
     A                                  4 29'MODIFY EXISTING CRAFT'
     A                                      DSPATR(HI)
     A                                  5  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  7  2'CHANGE DATA AND PRESS THE ''ENTER'-
     A                                      ' KEY:'
     A                                      DSPATR(HI)
     A                                  9 22'NEW CRAFT:'
     A            CRAFT          2A  B  9 35DSPATR(PR)
     A                                      OVRDTA
     A                                  9 42'CRAFT FLAG:'
     A            FLAG           1A  B  9 56DSPATR(UL)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 11  4'CRAFT FLAG must be one of the foll-
     A                                      owing:'
     A                                 13  5'''Blank'' - Normal Craft assigned -
     A                                      by Zone'
     A                                 15  7'''1''   - Craft assigned Plantwide-
     A                                      , Workorder will print on Craft pri-
     A                                      nter'
     A                                 17  7'''2''   - Craft assigned Plantwide-
     A                                      , Workorder will NOT print'
     A                                 19 13'-'
     A                                 21  7'''4''   - Special Craft, Workorder-
     A                                      s will NOT be placed in Open-WO-Que-
     A                                      ue'
     A            COMMANDLN1    79A  B 24  1DFTVAL('    F1 - RETURN TO MENU    -
     A                                                        F3/F8 - EXIT PROG-
     A                                      RAM              ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R CFTDELETE
     A*%%TS  DD  19970128  070928  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  3'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2 21'C R A F T   F I L E   M A I N T E -
     A                                      N A N C E'
     A                                  4 30'DELETE EXISTING CRAFT'
     A                                      DSPATR(HI)
     A                                  5  3'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  7  2'IF THIS IS THE CRAFT TO BE DELETED-
     A                                      , PRESS THE ''f4'' KEY:'
     A                                      DSPATR(HI)
     A                                 10 22'CRAFT:'
     A            CRAFT          2A  B 10 31DSPATR(PR)
     A                                      OVRDTA
     A                                 10 38'CRAFT FLAG:'
     A            FLAG           1A  B 10 52DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('    F1 - RETURN TO MENU    -
     A                                      F4 - DELETE RECORD SHOWN    F3/F8 E-
     A                                      XIT PROGRAM      ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R CFTDISP
     A*%%TS  DD  19970128  070928  T881S32     REL-V3R1M0  5763-CD1
     A                                      SFL
     A            CRAFT          2A  B  6  6DSPATR(PR)
     A            FLAG           1A  B  6 13DSPATR(PR)
     A          R CFT
     A*%%TS  DD  19970128  070928  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A                                      CF10
     A                                      CF11
     A                                      CF12
     A                                      SFLCTL(CFTDISP)
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(80)
     A                                      SFLLIN(7)
     A                                      PUTOVR
     A                                      OVERLAY
     A  75                                  SFLDSP
     A  76                                  SFLDSPCTL
     A  77                                  SFLCLR
     A N74                                  SFLEND(*MORE)
     A                                  2 26'M M I S   C R A F T   L I S T'
     A                                  4  5'CRAFT  FLAG    CRAFT  FLAG    CRAF-
     A                                      T  FLAG    CRAFT  FLAG    CRAFT  FL-
     A                                      AG'
     A                                  5  5'-----  ----    -----  ----    -----
     A                                      -  ----    -----  ----    -----  ---
     A                                      --'
     A          R CFTMENU
     A*%%TS  DD  19970306  145927  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2 14'M M I S   C R A F T   F I L E   M -
     A                                      A I N T E N A N C E'
     A                                  3  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  5 19'PRESS:'
     A                                  5 45'(PRESS "f9" TO REFRESH SCREEN)'
     A                                  7 22'f1  -  TO ADD NEW CRAFT'
     A            CFTADD         2A  B  7 46OVRDTA
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A  02 03 04                            DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                  9 22'f2  -  TO MODIFY EXISTING CRAFT'
     A            CFTCHG         2A  B  9 54OVRDTA
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A  01 03 04                            DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                 11 22'f3  -  TO EXIT PROGRAM'
     A                                 13 22'f4  -  TO DELETE CRAFT'
     A            CFTDEL         2A  B 13 46OVRDTA
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A  01 02 04                            DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                 15 22'f5  -  TO VIEW CRAFT LIST STARTING-
     A                                       AT'
     A            CFTDISP        2A  B 15 60OVRDTA
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A  01 02 03                            DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                 15 64'(Blank for ALL)'
     A                                 17 22'f6  -    >>>  Not Used  <<<'
     A                                 19 22'f7  -  HELP'
     A                                 21 22'f8  -  TO EXIT PROGRAM'
     A            MSGFLD        76A  B 23  3OVRDTA
     A                                      DSPATR(PR)
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                        F3/F8 - EXIT PROG-
     A                                      RAM              ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R CFTHELP
     A*%%TS  DD  19970306  113321  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2  7'C R A F T   F I L E   M A I N T E -
     A                                      N A N C E   H E L P   S C R E E N'
     A                                  3  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  5  3'PRESS:'
     A                                  5 45'(PRESS "f9" TO REFRESH SCREEN)'
     A                                  6  5'f1  -  TO ADD NEW CRAFT'
     A            CFTADD         2A  B  6 30OVRDTA
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A  02 03 04                            DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                  6 35'Enter new Craft and press the ''f1-
     A                                      '' key to'
     A                                  7 14'create a new record.'
     A                                  8  5'f2  -  TO MODIFY EXISTING CRAFT'
     A            EQPCHG         2A  B  8 37OVRDTA
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A  02 03 04                            DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                  8 42'Enter an existing Craft and press'
     A                                  9 14'the ''f2'' key to modify the recor-
     A                                      d.'
     A                                 10  5'f3  -  TO EXIT PROGRAM'
     A                                 11  5'f4  -  TO DELETE CRAFT'
     A            CFTDEL         2A  B 11 28OVRDTA
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A  02 03 04                            DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                 11 33'Enter an existing Craft and press -
     A                                      the ''f4'''
     A                                 12 14'key to delete the Craft from the f-
     A                                      ile.'
     A                                 13  6'NOTE:  Only deletes Craft record, -
     A                                      NOT associated records in other'
     A                                 14 13'datasets; for example, Workorders -
     A                                      linked to deleted Crafts.'
     A                                 15  5'f5  -  TO VIEW CRAFT LIST STARTING-
     A                                       AT'
     A            CFTDISP        2A  B 15 43OVRDTA
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A  02 03 04                            DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                 15 48'Enter a Craft or letter and'
     A                                 16 14'press the ''f5'' key to display th-
     A                                      e Craft List starting at your'
     A                                 17 14'entry.  Blank entry displays ALL r-
     A                                      ecords in the file.'
     A                                 18  5'f6  -  >>>  Not Used  <<<'
     A                                 19  5'f7  -  THIS SCREEN - It is not nec-
     A                                      essary to return to initial screen,'
     A                                 20 14'enter input data here and press th-
     A                                      e appropriate function key.'
     A                                 21  5'f8  -  TO EXIT PROGRAM'
     A                                 22  5'f9  -  REFRESH Screen'
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                        F3/F8 - EXIT PROG-
     A                                      RAM              ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R CREWADD
     A*%%TS  DD  19970128  141758  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2 21'C R E W   F I L E   M A I N T E N -
     A                                      A N C E'
     A                                  4 35'ADD NEW CREW'
     A                                      DSPATR(HI)
     A                                  5  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  8  4'PRESS THE ''ENTER'' KEY TO ADD THI-
     A                                      S CREW:'
     A                                      DSPATR(HI)
     A                                 11 34'NEW CREW:'
     A            CREW           1A  B 11 45DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('    F1 - RETURN TO MENU    -
     A                                                        F3/F8 - EXIT PROG-
     A                                      RAM              ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R CREWDELETE
     A*%%TS  DD  19970128  141758  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  3'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2 22'C R E W   F I L E   M A I N T E N -
     A                                      A N C E'
     A                                  4 30'DELETE EXISTING CREW'
     A                                      DSPATR(HI)
     A                                  5  3'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  7  2'IF THIS IS THE CREW TO BE DELETED,-
     A                                       PRESS THE ''f4'' KEY:'
     A                                      DSPATR(HI)
     A                                 10 34'CREW:'
     A            CREW           1A  B 10 41DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('    F1 - RETURN TO MENU    -
     A                                      F4 - DELETE RECORD SHOWN    F3/F8 E-
     A                                      XIT PROGRAM      ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R CREWDISP
     A*%%TS  DD  19970128  141758  T881S32     REL-V3R1M0  5763-CD1
     A                                      SFL
     A            CREW           1A  B  6 39DSPATR(PR)
     A          R CREW
     A*%%TS  DD  19970128  141758  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A                                      CF10
     A                                      CF11
     A                                      CF12
     A                                      SFLCTL(CREWDISP)
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(16)
     A                                      PUTOVR
     A                                      OVERLAY
     A  75                                  SFLDSP
     A  76                                  SFLDSPCTL
     A  77                                  SFLCLR
     A N74                                  SFLEND(*MORE)
     A                                  2 27'M M I S   C R E W   L I S T'
     A                                  4 38'CREW'
     A                                  5 38'----'
     A          R CREWMENU
     A*%%TS  DD  19970306  145927  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2 15'M M I S   C R E W   F I L E   M A -
     A                                      I N T E N A N C E'
     A                                  3  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  5 23'PRESS:'
     A                                  5 45'(PRESS "f9" TO REFRESH SCREEN)'
     A                                  7 25'f1  -  TO ADD NEW CREW '
     A            CREWADD        1A  B  7 49OVRDTA
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A  02 03 04                            DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                  9 25'f2  -  >>>  Not Used  <<<'
     A                                 11 25'f3  -  TO EXIT PROGRAM'
     A                                 13 25'f4  -  TO DELETE CREW '
     A            CREWDEL        1A  B 13 48OVRDTA
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A  01 02 04                            DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                 15 25'f5  -  TO VIEW CREW LIST'
     A                                 17 25'f6  -  >>>  Not Used  <<<'
     A                                 19 25'f7  -  HELP'
     A                                 21 25'f8  -  TO EXIT PROGRAM'
     A            MSGFLD        76A  B 23  3OVRDTA
     A                                      DSPATR(PR)
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                        F3/F8 - EXIT PROG-
     A                                      RAM              ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R CREWHELP
     A*%%TS  DD  19970306  113321  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2  8'C R E W   F I L E   M A I N T E N -
     A                                      A N C E   H E L P   S C R E E N'
     A                                  3  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  5  3'PRESS:'
     A                                  5 45'(PRESS "f9" TO REFRESH SCREEN)'
     A                                  6  5'f1  -  TO ADD NEW CREW'
     A            CREWADD        1A  B  6 29OVRDTA
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A  02 03 04                            DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                  6 34'Enter new Crew and press the ''f1'-
     A                                      ' key to'
     A                                  7 34'write a new record.'
     A                                  8  5'f2  -  >>>  Not Used  <<<'
     A                                  9  5'f3  -  TO EXIT PROGRAM'
     A                                 10  5'f4  -  TO DELETE CREW '
     A            CREWDEL        1A  B 10 29OVRDTA
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A  02 03 04                            DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                 10 33'Enter an existing Crew and press t-
     A                                      he ''f4'''
     A                                 11 33'key to delete the Crew from the fi-
     A                                      le.'
     A                                 12  5'f5  -  TO VIEW CREW  LIST'
     A                                 12 33'Press the ''f5'' key to display th-
     A                                      e Crew list.'
     A                                 13  5'f6  -  >>>  Not Used  <<<'
     A                                 14  5'f7  -  THIS SCREEN - It is not nec-
     A                                      essary to return to initial screen,'
     A                                 15 14'enter input data here and press th-
     A                                      e appropriate function key.'
     A                                 16  5'f8  -  TO EXIT PROGRAM'
     A                                 17  5'f9  -  REFRESH Screen'
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                        F3/F8 - EXIT PROG-
     A                                      RAM              ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EQPADD
     A*%%TS  DD  19970311  112042  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2 16'E Q U I P M E N T   F I L E   M A -
     A                                      I N T E N A N C E'
     A                                  4 29'ADD NEW EQUIPMENT NUMBER'
     A                                      DSPATR(HI)
     A                                  5  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  7  5'ENTER DATA AND PRESS ''ENTER'' OR -
     A                                      PRESS THE ''f4'' KEY TO START REPEA-
     A                                      T MODE:'
     A                                      DSPATR(HI)
     A                                 10  5'NUMBER'
     A            ENUMBER        6A  B 10 12OVRDTA
     A                                      DSPATR(PR)
     A                                 10 19'TYPE'
     A            ETYPE          8A  B 10 24DSPATR(UL)
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 10 33'DEPT'
     A            DEPT           4A  B 10 38DSPATR(UL)
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 10 43'ZONE'
     A            ZONE           4A  B 10 48DSPATR(UL)
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 10 53'LOCATION'
     A            LOCATION       8A  B 10 62DSPATR(UL)
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 10 72'RIME'
     A            RIME           1A  B 10 77DSPATR(UL)
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 12  5'EXPCLASS'
     A            EXPCLASS       8A  B 12 14DSPATR(UL)
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 12 23'DOWN COST PER HOUR'
     A            DOWNCOST       6A  B 12 42DSPATR(UL)
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 12 49'SAFETY EQP'
     A            SAFETYFLG      1A  B 12 60DSPATR(UL)
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A                                      VALUES('X' ' ')
     A                                      OVRDTA
     A                                      OVRATR
     A                                 12 63'ASBESTOS WRN'
     A            ASBWRN         2A  B 12 76DSPATR(UL)
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 14  5'LOCAL NAME / DESC'
     A            LOCALNAME     50A  B 14 28DSPATR(UL)
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 16  5'CORPORATE NAME / DESC'
     A            CORPNAME      49A  B 16 28DSPATR(UL)
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 18  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                 20  5'Press the ''f4'' key to Add multip-
     A                                      le pieces of equipment without clea-
     A                                      ring'
     A                                 21  5'the screen between ADD''s.'
     A            MSGFLD        76A  B 23  3OVRDTA
     A                                      DSPATR(PR)
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A            COMMANDLN1    79A  B 24  1DFTVAL('    F1 - RETURN TO MENU    -
     A                                                        F3/F8 - EXIT PROG-
     A                                      RAM              ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EQPADD1
     A*%%TS  DD  19970311  112042  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2 16'E Q U I P M E N T   F I L E   M A -
     A                                      I N T E N A N C E'
     A                                  4 29'ADD NEW EQUIPMENT NUMBER'
     A                                      DSPATR(HI)
     A                                  5  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  7  5'ENTER DATA AND PRESS ''ENTER'' OR -
     A                                      PRESS THE ''f4'' KEY TO START REPEA-
     A                                      T MODE:'
     A                                      DSPATR(HI)
     A                                 10  5'NUMBER'
     A            ENUMBER        6A  B 10 12DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                 10 19'TYPE'
     A            ETYPE          8A  B 10 24DSPATR(UL)
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 10 33'DEPT'
     A            DEPT           4A  B 10 38DSPATR(UL)
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 10 43'ZONE'
     A            ZONE           4A  B 10 48DSPATR(UL)
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 10 53'LOCATION'
     A            LOCATION       8A  B 10 62DSPATR(UL)
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 10 72'RIME'
     A            RIME           1A  B 10 77DSPATR(UL)
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 12  5'EXPCLASS'
     A            EXPCLASS       8A  B 12 14DSPATR(UL)
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 12 23'DOWN COST PER HOUR'
     A            DOWNCOST       6A  B 12 42DSPATR(UL)
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 12 49'SAFETY EQP'
     A            SAFETYFLG      1A  B 12 60DSPATR(UL)
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A                                      VALUES('X' ' ')
     A                                      OVRDTA
     A                                      OVRATR
     A                                 12 63'ASBESTOS WRN'
     A            ASBWRN         2A  B 12 76DSPATR(UL)
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 14  5'LOCAL NAME / DESC'
     A            LOCALNAME     50A  B 14 28DSPATR(UL)
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 16  5'CORPORATE NAME / DESC'
     A            CORPNAME      49A  B 16 28DSPATR(UL)
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 18  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                 20  5'Press the ''f4'' key to Add multip-
     A                                      le pieces of equipment without clea-
     A                                      ring'
     A                                 21  5'the screen between ADD''s.'
     A            MSGFLD        76A  B 23  3OVRDTA
     A                                      DSPATR(PR)
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A            COMMANDLN1    79A  B 24  1DFTVAL('    F1 - RETURN TO MENU    -
     A                                                        F3/F8 - EXIT PROG-
     A                                      RAM              ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EQPREPT
     A*%%TS  DD  19970311  132336  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2 16'E Q U I P M E N T   F I L E   M A -
     A                                      I N T E N A N C E'
     A                                  4 28'ADD NEW EQUIPMENT NUMBERS'
     A                                      DSPATR(HI)
     A                                  5  2'= = = = = = = = = = = = = ='
     A                                  5 30'>>>  REPEAT MODE  <<<'
     A                                  5 52'= = = = = = = = = = = = = ='
     A                                  7  5'ENTER DATA AND PRESS ''ENTER'' KEY-
     A                                      , SCREEN WILL RETAIN DATA FOR NEXT -
     A                                      ENTRY:'
     A                                      DSPATR(HI)
     A                                  9  5'NUMBER'
     A            ENUMBER        6A  B  9 12OVRDTA
     A N40                                  DSPATR(PR)
     A  01 40                               DSPATR(PC)
     A  01 40                               DSPATR(RI)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                  9 19'TYPE'
     A            ETYPE          8A  B  9 24DSPATR(UL)
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  9 33'DEPT'
     A            DEPT           4A  B  9 38DSPATR(UL)
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  9 43'ZONE'
     A            ZONE           4A  B  9 48DSPATR(UL)
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  9 53'LOCATION'
     A            LOCATION       8A  B  9 62DSPATR(UL)
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  9 72'RIME'
     A            RIME           1A  B  9 77DSPATR(UL)
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 11  5'EXPCLASS'
     A            EXPCLASS       8A  B 11 14DSPATR(UL)
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 11 23'DOWN COST PER HOUR'
     A            DOWNCOST       6A  B 11 42DSPATR(UL)
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 11 49'SAFETY EQP'
     A            SAFETYFLG      1A  B 11 60DSPATR(UL)
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A                                      VALUES('X' ' ')
     A                                      OVRDTA
     A                                      OVRATR
     A                                 11 63'ASBESTOS WRN'
     A            ASBWRN         2A  B 11 76DSPATR(UL)
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 13  5'LOCAL NAME / DESC'
     A            LOCALNAME     50A  B 13 28DSPATR(UL)
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 15  5'CORPORATE NAME / DESC'
     A            CORPNAME      49A  B 15 28DSPATR(UL)
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 17  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                 21 16'Press ''f1'' to end REPEAT MODE an-
     A                                      d return to Menu.'
     A            MSGFLD        76A  B 23  3OVRDTA
     A                                      DSPATR(PR)
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A            COMMANDLN1    79A  B 24  1DFTVAL('    F1 - RETURN TO MENU    -
     A                                                        F3/F8 - EXIT PROG-
     A                                      RAM              ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EQPCHANGE
     A*%%TS  DD  19970311  112042  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2 16'E Q U I P M E N T   F I L E   M A -
     A                                      I N T E N A N C E'
     A                                  4 23'MODIFY EXISTING EQUIPMENT NUMBER'
     A                                      DSPATR(HI)
     A                                  5  3'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  7  2'CHANGE DATA AND PRESS THE ''ENTER'-
     A                                      ' KEY:'
     A                                      DSPATR(HI)
     A                                  9  4'NUMBER'
     A            ENUMBER        6A  B  9 11DSPATR(PR)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A                                  9 18'TYPE'
     A            ETYPE          8A  B  9 23DSPATR(UL)
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  9 32'DEPT'
     A            DEPT           4A  B  9 37DSPATR(UL)
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  9 42'ZONE'
     A            ZONE           4A  B  9 47DSPATR(UL)
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  9 52'LOCATION'
     A            LOCATION       8A  B  9 61DSPATR(UL)
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  9 71'RIME'
     A            RIME           1A  B  9 76DSPATR(UL)
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 11  4'EXPCLASS'
     A            EXPCLASS       8A  B 11 13DSPATR(UL)
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 11 22'DOWN COST PER HOUR'
     A            DOWNCOST       6A  B 11 41DSPATR(UL)
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 11 48'SAFETY EQP'
     A            SAFETYFLG      1A  B 11 59DSPATR(UL)
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A                                      VALUES('X' ' ')
     A                                      OVRDTA
     A                                      OVRATR
     A                                 11 62'ASBESTOS WRN'
     A            ASBWRN         2A  B 11 75DSPATR(UL)
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 13  4'LOCAL NAME / DESC'
     A            LOCALNAME     50A  B 13 27DSPATR(UL)
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 15  4'CORPORATE NAME / DESC'
     A            CORPNAME      49A  B 15 27DSPATR(UL)
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            MSGFLD        76A  B 23  3OVRDTA
     A                                      DSPATR(PR)
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A            COMMANDLN1    79A  B 24  1DFTVAL('    F1 - RETURN TO MENU  F6-
     A                                       - SWITCH TO ADD MODE  F3/F8 - EXIT-
     A                                       PROGRAM         ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EQPMASSCHG
     A*%%TS  DD  19970311  112042  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2 16'E Q U I P M E N T   F I L E   M A -
     A                                      I N T E N A N C E'
     A                                  4  8'MASS CHANGE ALL OCCURRANCES OF EXI-
     A                                      STING EQUIPMENT TO NEW EQUIPMENT'
     A                                      DSPATR(HI)
     A                                  5  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  7  4'ENTER EXISTING EQUIPMENT NUMBER TO-
     A                                       BE CHANGED:'
     A            EQPOLD         6A  B  7 52OVRDTA
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                  9 17'TYPE'
     A            ETYPE          8A  B  9 22OVRDTA
     A                                      DSPATR(PR)
     A                                  9 31'DEPT'
     A            DEPT           4A  B  9 36OVRDTA
     A                                      DSPATR(PR)
     A                                  9 41'ZONE'
     A            ZONE           4A  B  9 46OVRDTA
     A                                      DSPATR(PR)
     A                                  9 51'LOCATION'
     A            LOCATION       8A  B  9 60OVRDTA
     A                                      DSPATR(PR)
     A                                  9 70'RIME'
     A            RIME           1A  B  9 75OVRDTA
     A                                      DSPATR(PR)
     A                                 11  3'EXPCLASS'
     A            EXPCLASS       8A  B 11 12OVRDTA
     A                                      DSPATR(PR)
     A                                 11 21'DOWN COST PER HOUR'
     A            DOWNCOST       6A  B 11 40OVRDTA
     A                                      DSPATR(PR)
     A                                 11 47'SAFETY EQP'
     A            SAFETYFLG      1A  B 11 58OVRDTA
     A                                      DSPATR(PR)
     A                                 11 61'ASBESTOS WRN'
     A            ASBWRN         2A  B 11 74DSPATR(PR)
     A                                      OVRDTA
     A                                 13  3'LOCAL NAME / DESC'
     A            LOCALNAME     50A  B 13 26OVRDTA
     A                                      DSPATR(PR)
     A                                 15  3'CORPORATE NAME / DESC'
     A            CORPNAME      49A  B 15 26OVRDTA
     A                                      DSPATR(PR)
     A                                 18  3'AND NEW EQUIPMENT NUMBER TO CHANGE-
     A                                       TO:'
     A            EQPNEW         6A  B 18 43OVRDTA
     A                                      DSPATR(UL)
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                      OVRATR
     A                                 18 51'AND PRESS THE ''ENTER'' KEY.'
     A            CHGMSG        76A  B 22  2OVRDTA
     A                                      DSPATR(PR)
     A                                      DSPATR(HI)
     A            COMMANDLN1    79A  B 24  1DFTVAL('    F1 - RETURN TO MENU    -
     A                                                        F3/F8 - EXIT PROG-
     A                                      RAM              ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EQPDELETE
     A*%%TS  DD  19970311  112042  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2 16'E Q U I P M E N T   F I L E   M A -
     A                                      I N T E N A N C E'
     A                                  4 23'DELETE EXISTING EQUIPMENT NUMBER'
     A                                      DSPATR(HI)
     A                                  5  3'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  7  2'IF THIS IS THE EQUIPMENT TO BE DEL-
     A                                      ETED, PRESS THE ''f4'' KEY:'
     A                                      DSPATR(HI)
     A                                  9  4'NUMBER'
     A            ENUMBER        6A  B  9 11DSPATR(PR)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A                                  9 18'TYPE'
     A            ETYPE          8A  B  9 23OVRDTA
     A                                      DSPATR(PR)
     A                                  9 32'DEPT'
     A            DEPT           4A  B  9 37OVRDTA
     A                                      DSPATR(PR)
     A                                  9 42'ZONE'
     A            ZONE           4A  B  9 47OVRDTA
     A                                      DSPATR(PR)
     A                                  9 52'LOCATION'
     A            LOCATION       8A  B  9 61OVRDTA
     A                                      DSPATR(PR)
     A                                  9 71'RIME'
     A            RIME           1A  B  9 76OVRDTA
     A                                      DSPATR(PR)
     A                                 11  4'EXPCLASS'
     A            EXPCLASS       8A  B 11 13OVRDTA
     A                                      DSPATR(PR)
     A                                 11 22'DOWN COST PER HOUR'
     A            DOWNCOST       6A  B 11 41OVRDTA
     A                                      DSPATR(PR)
     A                                 11 48'SAFETY EQP'
     A            SAFETYFLG      1A  B 11 59OVRDTA
     A                                      DSPATR(PR)
     A                                 11 62'ASBESTOS WRN'
     A            ASBWRN         2A  B 11 75DSPATR(PR)
     A                                      OVRDTA
     A                                 13  4'LOCAL NAME / DESC'
     A            LOCALNAME     50A  B 13 27OVRDTA
     A                                      DSPATR(PR)
     A                                 15  4'CORPORATE NAME / DESC'
     A            CORPNAME      49A  B 15 27OVRDTA
     A                                      DSPATR(PR)
     A            COMMANDLN1    79A  B 24  1DFTVAL('    F1 - RETURN TO MENU    -
     A                                      F4 - DELETE RECORD SHOWN    F3/F8 E-
     A                                      XIT PROGRAM      ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EQPDISP
     A*%%TS  DD  19970311  112042  T881S32     REL-V3R1M0  5763-CD1
     A                                      SFL
     A            EQPNUM         6A  B  4  2DSPATR(PR)
     A            EQPTYPE        8A  B  4  9DSPATR(PR)
     A            EQPDEPT        4A  B  4 18DSPATR(PR)
     A            EQPZONE        4A  B  4 23DSPATR(PR)
     A            EQPLOCATN      8A  B  4 28DSPATR(PR)
     A            EQPRIME        1A  B  4 38DSPATR(PR)
     A            EQPEXPCLS      8A  B  4 40DSPATR(PR)
     A            EQPDWNCST      6A  B  4 49DSPATR(PR)
     A            EQPDESC       24A  B  4 56DSPATR(PR)
     A          R EQP
     A*%%TS  DD  19970311  112042  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A                                      CF10
     A                                      CF11
     A                                      CF12
     A                                      SFLCTL(EQPDISP)
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(19)
     A                                      PUTOVR
     A                                      OVERLAY
     A  75                                  SFLDSP
     A  76                                  SFLDSPCTL
     A  77                                  SFLCLR
     A N74                                  SFLEND(*MORE)
     A                                  1 21'M M I S   E Q U I P M E N T   L I -
     A                                      S T'
     A                                  2  2'NUMBER TYPE     DEPT ZONE LOCATION-
     A                                       RM EXPCLASS DWNCST LOCAL NAME / DE-
     A                                      SC.'
     A                                  3  2'------ -------- ---- ---- ---------
     A                                       -- -------- ------ ----------------
     A                                      ---------'
     A          R EQPMENU
     A*%%TS  DD  19970306  145927  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2  9'L O C A L   E Q U I P M E N T   F -
     A                                      I L E   M A I N T E N A N C E'
     A                                  3  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  5  6'PRESS:'
     A                                  5 45'(PRESS "f9" TO REFRESH SCREEN)'
     A                                  7  8'f1  -  TO ADD NEW LOCAL EQUIPMENT -
     A                                      NUMBER'
     A            EQPADD         6A  B  7 49OVRDTA
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A  02 03 04                            DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                  9  8'f2  -  TO MODIFY EXISTING LOCAL EQ-
     A                                      UIPMENT NUMBER'
     A            EQPCHG         6A  B  9 57OVRDTA
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A  01 03 04                            DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                 11  8'f3  -  TO EXIT PROGRAM'
     A                                 13  8'f4  -  TO DELETE LOCAL EQUIPMENT N-
     A                                      UMBER'
     A            EQPDEL         6A  B 13 48OVRDTA
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A  01 02 04                            DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                 15  8'f5  -  TO VIEW LOCAL EQUIPMENT LIS-
     A                                      T STARTING AT'
     A            EQPDISP        6A  B 15 56OVRDTA
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A  01 02 03                            DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                 15 63'(Blank for ALL)'
     A                                 17  8'f6  -  MAKE MASS CHANGES TO THE LO-
     A                                      CAL EQUIPMENT FILE'
     A                                 19  8'f7  -  HELP'
     A                                 21  8'f8  -  TO EXIT PROGRAM'
     A            MSGFLD        78A  B 23  2OVRDTA
     A                                      DSPATR(PR)
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                        F3/F8 - EXIT PROG-
     A                                      RAM              ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EQPHELP
     A*%%TS  DD  19970306  113321  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2  3'E Q U I P M E N T   F I L E   M A -
     A                                      I N T E N A N C E   H E L P   S C R-
     A                                       E E N'
     A                                  3  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  4  2'PRESS:'
     A                                  4 45'(PRESS "f9" TO REFRESH SCREEN)'
     A                                  5  3'f1  -  TO ADD NEW LOCAL EQUIPMENT -
     A                                      NUMBER'
     A            EQPADD         6A  B  5 44OVRDTA
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A  02 03 04                            DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                  5 52'Enter new local equipment'
     A                                  6 12'number and press the ''f1'' key to-
     A                                       enter a new piece of equipment.'
     A                                  7  3'f2  -  TO MODIFY EXISTING LOCAL EQ-
     A                                      UIPMENT NUMBER'
     A            EQPCHG         6A  B  7 52OVRDTA
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A  02 03 04                            DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                  7 60'Enter an existing'
     A                                  8 12'local equipment number and press t-
     A                                      he ''f2'' key to modify the record.'
     A                                  9  3'f3  -  TO EXIT PROGRAM'
     A                                 10  3'f4  -  TO DELETE LOCAL EQUIPMENT N-
     A                                      UMBER'
     A            EQPDEL         6A  B 10 43OVRDTA
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A  02 03 04                            DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                 10 51'Enter an existing equipment'
     A                                 11 12'number and press the ''f4'' key to-
     A                                       delete the piece of equipment.'
     A                                 12  4'NOTE:  Only deletes equipment reco-
     A                                      rd, NOT associated records in other'
     A                                 13 11'datasets; for example, Workorders -
     A                                      for deleted equipment.'
     A                                 14  3'f5  -  TO VIEW LOCAL EQUIPMENT LIS-
     A                                      T STARTING AT'
     A            EQPDISP        6A  B 14 51OVRDTA
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A  02 03 04                            DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                 14 59'Enter an equipment'
     A                                 15 12'number or partial number and press-
     A                                       the ''f5'' key to display'
     A                                 16 12'equipment list starting at your en-
     A                                      try.  Blank entry displays'
     A                                 17 12'ALL records in file.'
     A                                 18  3'f6  -  TO CHANGE ALL RECORDS TO NE-
     A                                      W LOCAL EQUIPMENT NUMBER'
     A                                 18 63'Press the ''f6'''
     A                                 19 12'key to enter an existing equipment-
     A                                       number and a new number to'
     A                                 20 12'change ALL records in the database-
     A                                       linked to the old number.'
     A                                 21  3'f7  -  THIS SCREEN - Enter input d-
     A                                      ata on this screen and press key de-
     A                                      sired.'
     A                                 22  3'f8  -  TO EXIT PROGRAM'
     A                                 23  3'f9  -  REFRESH Screen'
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                        F3/F8 - EXIT PROG-
     A                                      RAM              ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EQPHMNU
     A*%%TS  DD  19970312  072312  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2  9'L O C A L   E Q U I P M E N T   F -
     A                                      I L E   M A I N T E N A N C E'
     A                                  3  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  4 31'> HELP  FUNCTIONS <'
     A                                      DSPATR(HI)
     A                                  6 14'PRESS LISTED FUNCTION KEY FOR HELP-
     A                                       FOR FIELD DESIRED:'
     A                                  8  6'TYPE:'
     A                                  8 27'f1  -'
     A                                  8 34'Corporate Type Number.'
     A                                 10  6'ZONE:'
     A                                 10 27'f2  -'
     A                                 10 34'Local Zone in which equipment is l-
     A                                      ocated.'
     A                                 12  6'RIME:'
     A                                 12 27'f3  -'
     A                                 12 34'Equipment RIME Number.'
     A                                 14  6'EXPCLASS:'
     A                                 14 27'f4  -'
     A                                 14 34'Valid charge number.'
     A                                 16  6'DOWN COST PER HOUR:'
     A                                 16 27'f5  -'
     A                                 16 34'Relative cost of lost production.'
     A                                 18  6'SAFETY EQP:'
     A                                 18 27'f6  -'
     A                                 18 34'Flag for Safety Contact system.  (-
     A                                      Obsolete)'
     A                                 20  6'ASBESTOS WRN:'
     A                                 20 27'f7  -'
     A                                 20 34'Possible Asbestos hazard.'
     A                                 22  6'NAMES:'
     A                                 22 27'f8  -'
     A                                 22 34'Local and Corporate descriptions.'
     A            COMMANDLN1    79A  B 24  1DFTVAL('                    PRESS "-
     A                                      ENTER" KEY RETURN TO INPUT SCREEN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EQPHTYP
     A*%%TS  DD  19970311  132336  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2  9'L O C A L   E Q U I P M E N T   F -
     A                                      I L E   M A I N T E N A N C E'
     A                                  3  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  5 29'CORPORATE TYPE NUMBER'
     A                                      DSPATR(HI)
     A            COMMANDLN1    79A  B 24  1DFTVAL('        PRESS "ENTER" KEY O-
     A                                      R ANY FUNCTION KEY TO RETURN TO HEL-
     A                                      P SCREEN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EQPHZON
     A*%%TS  DD  19970311  132336  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2  9'L O C A L   E Q U I P M E N T   F -
     A                                      I L E   M A I N T E N A N C E'
     A                                  3  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  4 27'EQUIPMENT MAINTENANCE ZONE'
     A                                      DSPATR(HI)
     A            COMMANDLN1    79A  B 24  1DFTVAL('        PRESS "ENTER" KEY O-
     A                                      R ANY FUNCTION KEY TO RETURN TO HEL-
     A                                      P SCREEN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EQPHRIM
     A*%%TS  DD  19970311  100046  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2  9'L O C A L   E Q U I P M E N T   F -
     A                                      I L E   M A I N T E N A N C E'
     A                                  3  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  4 29'EQUIPMENT RIME NUMBER'
     A                                      DSPATR(HI)
     A                                  6 22'9 - Shutdown Entire Plant'
     A                                  8 22'8 - Shutdown Entire Department'
     A                                  9  3'-----------------------------------
     A                                      ------------------------------------
     A                                      ---'
     A                                 10  3'{'
     A                                 10 22'7 - Reduce Output of Entire Depart-
     A                                      ment'
     A                                 10 74'}'
     A                                 11  3'{'
     A                                 11  7'MAJORITY OF'
     A                                 11 74'}'
     A                                 12  3'{'
     A                                 12 22'6 - Reduce Output of Portion of De-
     A                                      partment'
     A                                 12 74'}'
     A                                 13  3'{'
     A                                 13  7'PRODUCTION'
     A                                 13 74'}'
     A                                 14  3'{'
     A                                 14 22'5 - Reduce Support to Department'
     A                                 14 74'}'
     A                                 15  3'{'
     A                                 15  7'EQUIPMENT'
     A                                 15 74'}'
     A                                 16  3'{'
     A                                 16 22'4 - Reduce Flexibility or Convenie-
     A                                      nce'
     A                                 16 74'}'
     A                                 17  3'-----------------------------------
     A                                      ------------------------------------
     A                                      ---'
     A                                 18 22'3 - Spare or Standby Equipment'
     A                                 20 22'2 - Facilities Necessary for Produ-
     A                                      ction'
     A                                 22 22'1 - Offices'
     A            COMMANDLN1    79A  B 24  1DFTVAL('        PRESS "ENTER" KEY O-
     A                                      R ANY FUNCTION KEY TO RETURN TO HEL-
     A                                      P SCREEN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EQPHEXP
     A*%%TS  DD  19970311  132336  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2  9'L O C A L   E Q U I P M E N T   F -
     A                                      I L E   M A I N T E N A N C E'
     A                                  3  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  5 23'MAINTENANCE CHARGE EXPENSE CLASS'
     A                                      DSPATR(HI)
     A            COMMANDLN1    79A  B 24  1DFTVAL('        PRESS "ENTER" KEY O-
     A                                      R ANY FUNCTION KEY TO RETURN TO HEL-
     A                                      P SCREEN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EQPHCST
     A*%%TS  DD  19970311  132336  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2  9'L O C A L   E Q U I P M E N T   F -
     A                                      I L E   M A I N T E N A N C E'
     A                                  3  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  5 25'EQUIPMENT-DOWN COST PER HOUR'
     A                                      DSPATR(HI)
     A            COMMANDLN1    79A  B 24  1DFTVAL('        PRESS "ENTER" KEY O-
     A                                      R ANY FUNCTION KEY TO RETURN TO HEL-
     A                                      P SCREEN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EQPHSAF
     A*%%TS  DD  19970311  132336  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2  9'L O C A L   E Q U I P M E N T   F -
     A                                      I L E   M A I N T E N A N C E'
     A                                  3  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  5 21'EQUIPMENT FLAG FOR SAFETY CONTACT -
     A                                      SYSTEM'
     A                                      DSPATR(HI)
     A            COMMANDLN1    79A  B 24  1DFTVAL('        PRESS "ENTER" KEY O-
     A                                      R ANY FUNCTION KEY TO RETURN TO HEL-
     A                                      P SCREEN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EQPHASB
     A*%%TS  DD  19970311  132336  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2  9'L O C A L   E Q U I P M E N T   F -
     A                                      I L E   M A I N T E N A N C E'
     A                                  3  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  5 25'ASBESTOS WARNING MESSAGE FLAG'
     A                                      DSPATR(HI)
     A            COMMANDLN1    79A  B 24  1DFTVAL('        PRESS "ENTER" KEY O-
     A                                      R ANY FUNCTION KEY TO RETURN TO HEL-
     A                                      P SCREEN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EQPHDES
     A*%%TS  DD  19970311  132336  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2  9'L O C A L   E Q U I P M E N T   F -
     A                                      I L E   M A I N T E N A N C E'
     A                                  3  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  5 18'LOCAL AND CORPORATE EQUIPMENT DESC-
     A                                      RIPTIONS'
     A                                      DSPATR(HI)
     A            COMMANDLN1    79A  B 24  1DFTVAL('        PRESS "ENTER" KEY O-
     A                                      R ANY FUNCTION KEY TO RETURN TO HEL-
     A                                      P SCREEN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FMCHGRIMS
     A*%%TS  DD  19970203  082512  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  7 24'ENTER THE EQUIPMENT TYPE NUMBER'
     A                                  8 24'THAT YOU WISH TO CHANGE ALL TYPE'
     A                                  9 24'          NUMBERS FOR '
     A            TYPENU         8A  B 10 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                 12 24'AND THE RIME NUMBER YOU WANT TO'
     A                                 13 24'     SET THE EQUIPMENT TO'
     A            RIMENU         1A  B 14 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R ZNPADD
     A*%%TS  DD  19970203  082512  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2 11'Z O N E / P R I O R I T Y   F I L -
     A                                      E   M A I N T E N A N C E'
     A                                  4 33'ADD NEW ZONE'
     A                                      DSPATR(HI)
     A                                  5  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  8  4'PRESS THE "ENTER" KEY TO CREATE TH-
     A                                      E RECORD SHOWN BELOW:'
     A                                      DSPATR(HI)
     A                                 11 22'NEW ZONE:'
     A            ZONE           4A  B 11 33DSPATR(PR)
     A                                      OVRDTA
     A                                 11 44'PRIORITY:'
     A            PRIORITY       1A  B 11 55OVRDTA
     A                                      DSPATR(PR)
     A            COMMANDLN1    79A  B 24  1DFTVAL('    F1 - RETURN TO MENU    -
     A                                                                  F3/F8 E-
     A                                      XIT PROGRAM      ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R ZNPDELETE
     A*%%TS  DD  19970203  082512  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  3'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2 12'Z O N E / P R I O R I T Y   F I L -
     A                                      E   M A I N T E N A N C E'
     A                                  4 26'DELETE EXISTING ZONE/PRIORITY'
     A                                      DSPATR(HI)
     A                                  5  3'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  7  2'IF THIS IS THE ZONE/PRIORITY TO BE-
     A                                       DELETED, PRESS THE ''f4'' KEY:'
     A                                      DSPATR(HI)
     A                                 10 25'ZONE:'
     A            ZONE           4A  B 10 32DSPATR(PR)
     A                                      OVRDTA
     A                                 10 43'PRIORITY:'
     A            PRIORITY       1A  B 10 54DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('    F1 - RETURN TO MENU    -
     A                                      F4 - DELETE RECORD SHOWN    F3/F8 E-
     A                                      XIT PROGRAM      ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R ZNPDISP
     A*%%TS  DD  19970203  082512  T881S32     REL-V3R1M0  5763-CD1
     A                                      SFL
     A            ZONE           4A  B  6  6DSPATR(PR)
     A                                  6 11'/'
     A            PRTY           1A  B  6 13DSPATR(PR)
     A          R ZNP
     A*%%TS  DD  19970203  082512  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A                                      CF10
     A                                      CF11
     A                                      CF12
     A                                      SFLCTL(ZNPDISP)
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(80)
     A                                      SFLLIN(7)
     A                                      PUTOVR
     A                                      OVERLAY
     A  75                                  SFLDSP
     A  76                                  SFLDSPCTL
     A  77                                  SFLCLR
     A N74                                  SFLEND(*MORE)
     A                                  2 19'M M I S   Z O N E / P R I O R I T -
     A                                      Y   L I S T'
     A                                  4  4'ZONE/PRIORITY  ZONE/PRIORITY  ZONE-
     A                                      /PRIORITY  ZONE/PRIORITY  ZONE/PRIO-
     A                                      RITY'
     A                                  5  4'-------------  -------------  -----
     A                                      ---------  -------------  ----------
     A                                      ----'
     A          R ZNPMENU
     A*%%TS  DD  19970306  145927  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2  6'M M I S   Z O N E / P R I O R I T -
     A                                      Y   F I L E   M A I N T E N A N C E'
     A                                  3  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  5 19'PRESS:'
     A                                  5 45'(PRESS "f9" TO REFRESH SCREEN)'
     A                                  7 22'f1  -  TO ADD NEW ZONE/PRIORITY'
     A            ZONEADD        4A  B  7 54OVRDTA
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A  03 04                               DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                  7 59'/'
     A            PRIADD         1A  B  7 61OVRDTA
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A  03 04                               DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                  9 22'f2  -    >>>  Not Used  <<<'
     A                                 11 22'f3  -  TO EXIT PROGRAM'
     A                                 13 22'f4  -  TO DELETE ZONE/PRIORITY'
     A            ZONEDEL        4A  B 13 53OVRDTA
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A  01 02                               DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                 13 58'/'
     A            PRIDEL         1A  B 13 60OVRDTA
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A  01 02                               DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                 15 22'f5  -  TO VIEW ZONE/PRIORITY LIST'
     A                                 17 22'f6  -    >>>  Not Used  <<<'
     A                                 19 22'f7  -  HELP'
     A                                 21 22'f8  -  TO EXIT PROGRAM'
     A            MSGFLD        76A  B 23  3OVRDTA
     A                                      DSPATR(PR)
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                        F3/F8 - EXIT PROG-
     A                                      RAM              ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R ZNPHELP
     A*%%TS  DD  19970306  113321  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2  6'M M I S   Z O N E / P R I O R I T -
     A                                      Y   F I L E   M A I N T E N A N C E'
     A                                  3  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  4  3'PRESS:'
     A                                  4 45'(PRESS "f9" TO REFRESH SCREEN)'
     A                                  6  5'f1  -  TO ADD NEW ZONE/PRIORITY'
     A            ZONEADD        4A  B  6 37OVRDTA
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A  03 04                               DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                  6 42'/'
     A            PRIADD         1A  B  6 44OVRDTA
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A  03 04                               DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                  6 47'Enter a new Zone/Priority and'
     A                                  7 47'press the ''f1'' key to verify.'
     A                                  8  5'f2  -  >>>  Not Used  <<<'
     A                                  9  5'f3  -  TO EXIT PROGRAM'
     A                                 10  5'f4  -  TO DELETE ZONE/PRIORITY'
     A            ZONEDEL        4A  B 10 36OVRDTA
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A  01 02                               DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                 10 41'/'
     A            PRIDEL         1A  B 10 43OVRDTA
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A  01 02                               DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                 10 47'Enter an existing Zone/Priority'
     A                                 11 47'and press the ''f4 ley to verify.'
     A                                 13  5'f5  -  TO VIEW ZONE/PRIORITY LIST'
     A                                 13 47'Press the ''f5'' key to display'
     A                                 14 47'the Zone/Priority file.'
     A                                 15  5'f6  -  >>>  Not Used  <<<'
     A                                 17  5'f7  -  ADDITIONAL HELP ABOUT PRIOR-
     A                                      ITY     It is not necessary to retu-
     A                                      rn'
     A                                 18 12'(Press f7 for more HELP)'
     A                                 18 47'to initial screen, enter input'
     A                                 19 47'data on this screen and press'
     A                                 20 47'the appropriate function key.'
     A                                 21  5'f8  -  TO EXIT PROGRAM'
     A                                 22  5'f9  -  REFRESH Screen'
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                        F3/F8 - EXIT PROG-
     A                                      RAM              ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R ZNPAHLP1
     A*%%TS  DD  19970306  140142  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2  6'M M I S   Z O N E / P R I O R I T -
     A                                      Y   F I L E   M A I N T E N A N C E'
     A                                  3  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  5 33'ZONE PRIORITY'
     A                                      DSPATR(HI)
     A                                  7 11'Any valid Zone entry must be loade-
     A                                      d into the Zone-Priority'
     A                                  9 11'file once for each valid Priority.-
     A                                        For example, if you are'
     A                                 11 11'creating a new Zone called "Z1", y-
     A                                      ou must enter five records'
     A                                 13 11'in order to validate all five prio-
     A                                      rities:'
     A                                 15 32'ZONE / PRIORITY'
     A                                 16 32'---------------'
     A                                 17 33'Z1  /    1'
     A                                 18 33'Z1  /    2'
     A                                 19 33'Z1  /    3'
     A                                 20 33'Z1  /    4'
     A                                 21 33'Z1  /    5'
     A                                 23  3'Press ''ENTER'' key for additional-
     A                                       HELP, ''f3'' or ''f8'' key to retu-
     A                                      rn to Menu.'
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                        F3/F8 - EXIT PROG-
     A                                      RAM              ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R ZNPAHLP2
     A*%%TS  DD  19970306  140142  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2  6'M M I S   Z O N E / P R I O R I T -
     A                                      Y   F I L E   M A I N T E N A N C E'
     A                                  3  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  4 23'WORKORDER PRIORITY/PRIORITY FACTOR'
     A                                      DSPATR(HI)
     A                                  6  6'WORKORDER'
     A                                  6 51'PRIORITY'
     A                                  6 63'PM WORKORDER'
     A                                  7  6'PRIORITY:     SIGNIFICANCE OF WORK-
     A                                      ORDER:     FACTOR*'
     A                                  7 63'PRIORITY FACTOR'
     A                                  8  6'---------'
     A                                  8 20'--------------------------'
     A                                  8 51'--------'
     A                                  8 63'---------------'
     A                                  9  9'1'
     A                                  9 22'SAFETY OR BREAKDOWN**'
     A                                  9 54'9'
     A                                  9 70'5'
     A                                 11  9'2'
     A                                 11 22'PENDING BREAKDOWN**'
     A                                 11 54'6'
     A                                 11 70'4'
     A                                 13  9'3'
     A                                 13 22'ROUTINE OR FILL-IN WORK'
     A                                 13 54'4'
     A                                 13 70'3'
     A                                 15  9'4'
     A                                 15 20'--\   LOW SIGNIFICANCE,'
     A                                 15 54'2'
     A                                 15 70'2'
     A                                 16 23'>  USUALLY PLANNED OR'
     A                                 17  9'5'
     A                                 17 20'--/   PM WORKORDERS'
     A                                 17 54'1'
     A                                 17 70'1'
     A                                 18  2'-----------------------------------
     A                                      ------------------------------------
     A                                      --------'
     A                                 19  3'*Priority Factor is the number whi-
     A                                      ch is multiplied times the equipmen-
     A                                      t RIME'
     A                                 20  4'number to obtain the Q-Factor (rel-
     A                                      ative priority) for the WO-Open-Que-
     A                                      ue.'
     A                                 21  4'EXAMPLE:  Workoder Priority = 2, E-
     A                                      quipment RIME = 6, Q-Factor = 6 x 6-
     A                                       = 36.'
     A                                 22  2'**Breakdown is Equipment "Out-of-P-
     A                                      roduction" or "Out-of-Service".'
     A                                 23  4'Press ''ENTER'' key for additional-
     A                                       HELP, ''f3'' or ''f8'' key to retu-
     A                                      rn to Menu.'
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                        F3/F8 - EXIT PROG-
     A                                      RAM              ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R ZNSADD
     A*%%TS  DD  19970130  085138  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2 19'Z O N E / S H I F T   M A I N T E -
     A                                      N A N C E'
     A                                  4 28'ADD NEW ZONE/SHIFT RECORD'
     A                                      DSPATR(HI)
     A                                  5  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  7  2'ENTER DATA AND PRESS THE ''ENTER''-
     A                                       KEY:'
     A                                      DSPATR(HI)
     A                                  9 39'ZONE:'
     A            ZONE           4A  B  9 46DSPATR(PR)
     A                                      OVRDTA
     A                                 11 19'NUMBER OF SHIFTS PER DAY:'
     A            CODE           1A  B 11 46DSPATR(UL)
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 11 56'Must be 2, 3, or 4.'
     A                                 13 18'FIRST SHIFT STARTING TIME:'
     A            SHFIFT1        4A  B 13 46DSPATR(UL)
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 13 56'Enter times in 24 hour'
     A                                 14 56'time: ie;  4:30 pm is'
     A                                 15 17'SECOND SHIFT STARTING TIME:'
     A            SHIFT2         4A  B 15 46DSPATR(UL)
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 15 56'entered as "1630".'
     A                                 16 56'Midnight may be entered'
     A                                 17 18'THIRD SHIFT STARTING TIME:'
     A            SHIFT3         4A  B 17 46DSPATR(UL)
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 17 56'as either "0000" or'
     A                                 18 56'"2400" but will be'
     A                                 19 17'FOURTH SHIFT STARTING TIME:'
     A            SHIFT4         4A  B 19 46DSPATR(UL)
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 19 56'changed to "0000".'
     A            COMMANDLN1    79A  B 24  1DFTVAL('    F1 - RETURN TO MENU    -
     A                                                        F3/F8 - EXIT PROG-
     A                                      RAM              ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R ZNSCHANGE
     A*%%TS  DD  19970130  085138  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2 19'Z O N E / S H I F T   M A I N T E -
     A                                      N A N C E'
     A                                  4 24'MODIFY EXISTING ZONE/SHIFT RECORD'
     A                                      DSPATR(HI)
     A                                  5  3'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  7  2'CHANGE DATA AND PRESS THE ''ENTER'-
     A                                      ' KEY:'
     A                                      DSPATR(HI)
     A                                  9 39'ZONE:'
     A            ZONE           4A  B  9 46DSPATR(PR)
     A                                      OVRDTA
     A                                 11 19'NUMBER OF SHIFTS PER DAY:'
     A            CODE           1A  B 11 46DSPATR(UL)
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 11 56'Must be 2, 3, or 4.'
     A                                 13 18'FIRST SHIFT STARTING TIME:'
     A            SHFIFT1        4A  B 13 46DSPATR(UL)
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 13 56'Enter times in 24 hour'
     A                                 14 56'time: ie;  4:30 pm is'
     A                                 15 17'SECOND SHIFT STARTING TIME:'
     A            SHIFT2         4A  B 15 46DSPATR(UL)
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 15 56'entered as "1630".'
     A                                 16 56'Midnight may be entered'
     A                                 17 18'THIRD SHIFT STARTING TIME:'
     A            SHIFT3         4A  B 17 46DSPATR(UL)
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 17 56'as either "0000" or'
     A                                 18 56'"2400" but will be'
     A                                 19 17'FOURTH SHIFT STARTING TIME:'
     A            SHIFT4         4A  B 19 46DSPATR(UL)
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 19 56'changed to "0000".'
     A            COMMANDLN1    79A  B 24  1DFTVAL('    F1 - RETURN TO MENU    -
     A                                                        F3/F8 - EXIT PROG-
     A                                      RAM              ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R ZNSDELETE
     A*%%TS  DD  19970130  085138  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2 19'Z O N E / S H I F T   M A I N T E -
     A                                      N A N C E'
     A                                  4 24'DELETE EXISTING ZONE/SHIFT RECORD'
     A                                      DSPATR(HI)
     A                                  5  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  7  2'IF THIS IS THE ZONE/SHIFT TO BE DE-
     A                                      LETED, PRESS THE ''f4'' KEY:'
     A                                      DSPATR(HI)
     A                                  9 39'ZONE:'
     A            ZONE           4A  B  9 46OVRDTA
     A                                      DSPATR(PR)
     A                                 11 19'NUMBER OF SHIFTS PER DAY:'
     A            CODE           1A  B 11 46OVRDTA
     A                                      DSPATR(PR)
     A                                 13 18'FIRST SHIFT STARTING TIME:'
     A            SHFIFT1        4A  B 13 46OVRDTA
     A                                      DSPATR(PR)
     A                                 15 17'SECOND SHIFT STARTING TIME:'
     A            SHIFT2         4A  B 15 46OVRDTA
     A                                      DSPATR(PR)
     A                                 17 18'THIRD SHIFT STARTING TIME:'
     A            SHIFT3         4A  B 17 46OVRDTA
     A                                      DSPATR(PR)
     A                                 19 17'FOURTH SHIFT STARTING TIME:'
     A            SHIFT4         4A  B 19 46OVRDTA
     A                                      DSPATR(PR)
     A            COMMANDLN1    79A  B 24  1DFTVAL('    F1 - RETURN TO MENU    -
     A                                      F4 - DELETE RECORD SHOWN    F3/F8 E-
     A                                      XIT PROGRAM      ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R ZNSDISP
     A*%%TS  DD  19970130  085138  T881S32     REL-V3R1M0  5763-CD1
     A                                      SFL
     A            ZONE           4A  B  6  3DSPATR(PR)
     A            CODE           1A  B  6  9DSPATR(PR)
     A            SHFIFT1        4A  B  6 14DSPATR(PR)
     A            SHIFT2         4A  B  6 21DSPATR(PR)
     A            SHIFT3         4A  B  6 28DSPATR(PR)
     A            SHIFT4         4A  B  6 35DSPATR(PR)
     A          R ZNS
     A*%%TS  DD  19970130  085138  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A                                      CF10
     A                                      CF11
     A                                      CF12
     A                                      SFLCTL(ZNSDISP)
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(18)
     A                                      SFLLIN(4)
     A                                      PUTOVR
     A                                      OVERLAY
     A  75                                  SFLDSP
     A  76                                  SFLDSPCTL
     A  77                                  SFLCLR
     A N74                                  SFLEND(*MORE)
     A                                  2 22'Z O N E / S H I F T   F I L E   L -
     A                                      I S T'
     A                                  4  2' ZONE QTY   FRST   SCND   THRD   F-
     A                                      RTH    ZONE QTY   FRST   SCND   THR-
     A                                      D   FRTH'
     A                                  5  3'---- ---   ----   ----   ----   ---
     A                                      --    ---- ---   ----   ----   -----
     A                                         ----'
     A          R ZNSMENU
     A*%%TS  DD  19970306  145927  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2 19'Z O N E / S H I F T   M A I N T E -
     A                                      N A N C E'
     A                                  3  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  5 15'PRESS:'
     A                                  5 45'(PRESS "f9" TO REFRESH SCREEN)'
     A                                  7 18'f1  -  TO ADD NEW ZONE/SHIFT RECOR-
     A                                      D'
     A            ZONEADD        4A  B  7 54OVRDTA
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A  02 03                               DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                  9 18'f2  -  TO MODIFY EXISTING ZONE/SHI-
     A                                      FT RECORD'
     A            ZONECHG        4A  B  9 62OVRDTA
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A  01 03                               DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                 11 18'f3  -  TO EXIT PROGRAM'
     A                                 13 18'f4  -  TO DELETE ZONE/SHIFT RECORD'
     A            ZONEDEL        4A  B 13 53OVRDTA
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A  01 02                               DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                 15 18'f5  -  TO VIEW ZONE/SHIFT RECORDS'
     A                                 17 18'f6  -    >>>  Not Used  <<<'
     A                                 19 18'f7  -  HELP'
     A                                 21 18'f8  -  TO EXIT PROGRAM'
     A            MSGFLD        76A  B 23  3OVRDTA
     A                                      DSPATR(PR)
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                        F3/F8 - EXIT PROG-
     A                                      RAM              ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R ZNSHELP
     A*%%TS  DD  19970129  080527  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2  7'Z O N E / S H I F T   M A I N T E -
     A                                      N A N C E   H E L P   S C R E E N'
     A                                  3  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  4  4'PRESS:'
     A                                  4 45'(PRESS "f9" TO REFRESH SCREEN)'
     A                                  5  5'f1  -  TO ADD NEW ZONE/SHIFT RECOR-
     A                                      D'
     A            ZONEADD        4A  B  5 41OVRDTA
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A  02 03                               DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                  5 48'Enter new Zone and press the'
     A                                  6 48'''f1'' key to enter a new record.'
     A                                  8  5'f2  -  TO MODIFY EXISTING EQUIPMEN-
     A                                      T NUMBER'
     A            ZONECHG        4A  B  8 48OVRDTA
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A  02 03                               DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                  8 55'Enter an existing Zone'
     A                                  9 35'and press the ''f2'' key to modify-
     A                                       the record.'
     A                                 11  5'f3  -  TO EXIT PROGRAM'
     A                                 13  5'f4  -  TO DELETE ZONE/SHIFT RECORD'
     A            ZONEDEL        4A  B 13 40OVRDTA
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A  02 03                               DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A                                 13 47'Enter an existing Zone and press'
     A                                 14 45'the ''f4'' key to delete the recor-
     A                                      d.'
     A                                 16  5'f5  -  TO VIEW ZONE/SHIFT RECORDS'
     A                                 16 41'Press the ''f5'' key to display th-
     A                                      e'
     A                                 17 41'Zone/Shift records.'
     A                                 19  5'f6  -    >>>  Not Used  <<<'
     A                                 21  5'f7  -  HELP'
     A                                 21 18'Press ''f7'' to display this scree-
     A                                      n.'
     A                                 23  5'f8  -  TO EXIT PROGRAM'
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                        F3/F8 - EXIT PROG-
     A                                      RAM              ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R ENDSUBF
     A*%%TS  DD  19970306  143026  T881S32     REL-V3R1M0  5763-CD1
     A                                 24 13'PRESS "ENTER" KEY OR ANY FUNCTION -
     A                                      KEY TO RETURN TO MENU'
