     A*%%TS  DD  19941103  133201  T881S32     REL-V2R3M0  5738-CD1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A  97                                  INVITE
     A                                      HELP
     A                                      PRINT
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A          R IMESSAGE
     A*%%TS  DD  19941103  133201  T881S32     REL-V2R3M0  5738-CD1
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  2 15'==================================-
     A                                      ==============='
     A                                  3 15':     S E N D   M E S S A G E   S -
     A                                      C R E E N     :'
     A                                  4 15'==================================-
     A                                      ==============='
     A                                  5  5'DATE:'
     A            D              8A  B  5 12ALIAS(S_D)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  5 63'TIME:'
     A            T              4A  B  5 70ALIAS(S_T)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  6  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  7  3'MESSAGE TO:  CLOCK CARD OR DIST. L-
     A                                      IST -'
     A            CC             6A  B  7 43ALIAS(S_CC)
     A                                      DSPATR(UL)
     A  05                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  7 52'OR WORK ORDER -'
     A            WO            10A  B  7 68ALIAS(S_WO)
     A                                      DSPATR(UL)
     A  06                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  8  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  9  3'MESSAGE FROM:'
     A            FROM           4A  B  9 18ALIAS(S_FROM)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            SO            28A  B  9 26ALIAS(S_SO)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                 10  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 11  3'MESSAGE:'
     A            F1            70A  B 12  6ALIAS(S_F1)
     A                                      DSPATR(UL)
     A  07                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            F2            70A  B 13  6ALIAS(S_F2)
     A                                      DSPATR(UL)
     A  08                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            F3            70A  B 14  6ALIAS(S_F3)
     A                                      DSPATR(UL)
     A  09                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            F4            70A  B 15  6ALIAS(S_F4)
     A                                      DSPATR(UL)
     A  10                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            F5            70A  B 16  6ALIAS(S_F5)
     A                                      DSPATR(UL)
     A  11                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 17  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 18 15'PRINT MESSAGE AT RECEIVER''s ZONE -
     A                                      PRINTER:'
     A            P              1A  B 18 58ALIAS(S_P)
     A                                      DSPATR(UL)
     A  12                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 19  2'Any character will cause a copy to-
     A                                       be printed at the zone printer.  M-
     A                                      essages'
     A                                 20  2'to Clock Card numbers which are pr-
     A                                      inted are NOT saved in the database-
     A                                       and will'
     A                                 21  2'NOT appear on the receiver''s term-
     A                                      inal.  Workorder messages which are-
     A                                       printed,'
     A                                 22  2'will print on the zone printer of -
     A                                      the workorder zone and WILL be save-
     A                                      d.'
     A                                 23  2'Dist. List messages will be sent t-
     A                                      o Clock Card members only, NO ZONE -
     A                                      or CRAFT.'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F1=RETURN TO MENU   F7=CLEAR M-
     A                                      ESSAGE    F3=EXIT PROGRAM')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R IMESSTWO
     A*%%TS  DD  19941103  133201  T881S32     REL-V2R3M0  5738-CD1
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  2 15'==================================-
     A                                      ==============='
     A                                  3 15':     S E N D   M E S S A G E   S -
     A                                      C R E E N     :'
     A                                  4 15'==================================-
     A                                      ==============='
     A                                  5  5'DATE:'
     A            D              8A  B  5 12ALIAS(S_D)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  5 63'TIME:'
     A            T              4A  B  5 70ALIAS(S_T)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  6  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  7  3'MESSAGE TO:  CLOCK CARD OR DIST. L-
     A                                      IST -'
     A            CC             6A  B  7 43ALIAS(S_CC)
     A                                      DSPATR(UL)
     A  05                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  7 52'OR WORK ORDER -'
     A            WO            10A  B  7 68ALIAS(S_WO)
     A                                      DSPATR(UL)
     A  06                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  8  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  9  3'MESSAGE FROM:'
     A            FROM           4A  B  9 18ALIAS(S_FROM)
     A                                      DSPATR(UL)
     A  03                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            SO            28A  B  9 26ALIAS(S_SO)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                 10  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 11  3'MESSAGE:'
     A            F1            70A  B 12  6ALIAS(S_F1)
     A                                      DSPATR(UL)
     A  07                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            F2            70A  B 13  6ALIAS(S_F2)
     A                                      DSPATR(UL)
     A  08                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            F3            70A  B 14  6ALIAS(S_F3)
     A                                      DSPATR(UL)
     A  09                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            F4            70A  B 15  6ALIAS(S_F4)
     A                                      DSPATR(UL)
     A  10                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            F5            70A  B 16  6ALIAS(S_F5)
     A                                      DSPATR(UL)
     A  11                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 17  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 18 15'PRINT MESSAGE AT RECEIVER''s ZONE -
     A                                      PRINTER:'
     A            P              1A  B 18 58ALIAS(S_P)
     A                                      DSPATR(UL)
     A  12                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 19  2'Any character will cause a copy to-
     A                                       be printed at the zone printer.  M-
     A                                      essages'
     A                                 20  2'to Clock Card numbers which are pr-
     A                                      inted are NOT saved in the database-
     A                                       and will'
     A                                 21  2'NOT appear on the receiver''s term-
     A                                      inal.  Workorder messages which are-
     A                                       printed,'
     A                                 22  2'will print on the zone printer of -
     A                                      the workorder zone and WILL be save-
     A                                      d.'
     A                                 23  2'Dist. List messages will be sent t-
     A                                      o Clock Card members only, NO ZONE -
     A                                      or CRAFT.'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F1=RETURN TO MENU   F7=CLEAR M-
     A                                      ESSAGE    F3=EXIT PROGRAM')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R OMSGCC
     A*%%TS  DD  19941103  070737  T881S32     REL-V2R3M0  5738-CD1
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1 10'==================================-
     A                                      ============================='
     A                                  2 10':     D I S P L A Y   C L O C K   -
     A                                      C A R D   M E S S A G E     :'
     A                                  3 10'==================================-
     A                                      ============================='
     A                                  4  5'MESSAGE SENT ON:                  -
     A                                                             AT'
     A                                  5  5'DATE:'
     A            D              8A  B  5 12ALIAS(S_D)
     A                                      DSPATR(UL PR)
     A                                      OVRDTA
     A                                  5 62'TIME:'
     A            T              4A  B  5 69ALIAS(S_T)
     A                                      DSPATR(UL PR)
     A                                      OVRDTA
     A                                  6  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  7  3'MESSAGE TO:    CLOCK CARD -'
     A            CC             4A  B  7 31ALIAS(S_CC)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            DUMMY         10A  B  7 62ALIAS(S_DUMMY)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  8  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  9  3'MESSAGE FROM:'
     A            FROM           4A  B  9 18ALIAS(S_FROM)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            SO            28A  B  9 26ALIAS(S_SO)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                 10  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 11  3'MESSAGE:'
     A            F1            70A  B 12  6ALIAS(S_F1)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            F2            70A  B 13  6ALIAS(S_F2)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            F3            70A  B 14  6ALIAS(S_F3)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            F4            70A  B 15  6ALIAS(S_F4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            F5            70A  B 16  6ALIAS(S_F5)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                 17  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 18 17'PRINT MESSAGE AT YOUR ASSIGNED ZON-
     A                                      E PRINTER:'
     A            P              1A  B 18 64ALIAS(S_P)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 19 22'Enter any character to print messa-
     A                                      ge.'
     A                                 20  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 21  3'NOTE:  This message will be automa-
     A                                      tically deleted'
     A            DDATE          8A  B 21 53ALIAS(S_DDATE)
     A                                      DSPATR(BL PR)
     A                                      OVRDTA
     A                                 21 64'The message may'
     A                                 22 10'be saved up to two weeks by enteri-
     A                                      ng a new Delete Date:'
     A            DMMDATE        2A  B 22 67ALIAS(S_DMMDATE)
     A                                      DSPATR(UL BL)
     A  27                                  DSPATR(PC)
     A                                      OVRDTA
     A            DDDDATE        2A  B 22 70ALIAS(S_DDDDATE)
     A                                      DSPATR(UL BL)
     A  29                                  DSPATR(PC)
     A                                      OVRDTA
     A            DYYDATE        2A  B 22 73ALIAS(S_DYYDATE)
     A                                      DSPATR(UL BL)
     A  30                                  DSPATR(PC)
     A                                      OVRDTA
     A                                 23  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F1=RETURN TO MENU   F3=EXIT PR-
     A                                      OGRAM')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R OMSGWO
     A*%%TS  DD  19941103  070737  T881S32     REL-V2R3M0  5738-CD1
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1 11'==================================-
     A                                      ==========================='
     A                                  2 11':     D I S P L A Y   W O R K O R -
     A                                      D E R   M E S S A G E     :'
     A                                  3 11'==================================-
     A                                      ==========================='
     A                                  4  5'MESSAGE SENT ON:                  -
     A                                                             AT'
     A                                  5  5'DATE:'
     A            D              8A  B  5 12ALIAS(S_D)
     A                                      DSPATR(UL PR)
     A                                      OVRDTA
     A                                  5 62'TIME:'
     A            T              4A  B  5 69ALIAS(S_T)
     A                                      DSPATR(UL PR)
     A                                      OVRDTA
     A            DUMMY          4A  B  5 75ALIAS(S_DUMMY)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  6  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  7  3'MESSAGE TO:    WORKORDER -'
     A            WO            10A  B  7 30ALIAS(S_WO)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  8  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  9  3'MESSAGE FROM:'
     A            FROM           4A  B  9 18ALIAS(S_FROM)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            SO            28A  B  9 26ALIAS(S_SO)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                 10  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 11  3'MESSAGE:'
     A            F1            70A  B 12  6ALIAS(S_F1)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            F2            70A  B 13  6ALIAS(S_F2)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            F3            70A  B 14  6ALIAS(S_F3)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            F4            70A  B 15  6ALIAS(S_F4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            F5            70A  B 16  6ALIAS(S_F5)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                 17  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                 18 21'PRINT MESSAGE AT WORKORDER ZONE PR-
     A                                      INTER:'
     A            P              1A  B 18 64ALIAS(S_P)
     A                                      DSPATR(UL PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 19 20'Enter any character to print messa-
     A                                      ge.'
     A            DUMMY1         8A  B 19 60ALIAS(S_DUMMY1)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            DUMMY2         8A  B 19 70ALIAS(S_DUMMY2)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                 20  1'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F1=RETURN TO MENU   F3=EXIT PR-
     A                                      OGRAM')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R ONEWSMSG
     A*%%TS  DD  19941103  070737  T881S32     REL-V2R3M0  5738-CD1
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1 25'============================='
     A                                  2 25':  C U R R E N T   N E W S  :'
     A                                  3 25'============================='
     A                                  5 21'DATE:'
     A            D              8A  B  5 28ALIAS(S_D)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  5 48'TIME:'
     A            T              4A  B  5 55ALIAS(S_T)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            FROM           4A  B  6 38ALIAS(S_FROM)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            SO            28A  B  6 46ALIAS(S_SO)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            CC             4A  B  7 61ALIAS(S_CC)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            WO            10A  B  7 67ALIAS(S_WO)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                  9  5'NEWS MESSAGE:'
     A            F1            70A  B 11  5ALIAS(S_F1)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            F2            70A  B 12  5ALIAS(S_F2)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            F3            70A  B 13  5ALIAS(S_F3)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            F4            70A  B 14  5ALIAS(S_F4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            F5            70A  B 15  5ALIAS(S_F5)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            P              1A  B 21 76ALIAS(S_P)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                 23  1'F1=RETURN TO MENU   F3=EXIT PROGRA-
     A                                      M'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R MSGEXEC
     A*%%TS  DD  19941103  070737  T881S32     REL-V2R3M0  5738-CD1
     A                                      PUTOVR
     A                                  1 18'-----------------------------------
     A                                      -------'
     A                                  2 18':   M E S S A G E   F U N C T I O'
     A                                  2 52'N S   :'
     A                                  3 18'-----------------------------------
     A                                      -------'
     A                                  4  6'Enter Your Personal Identification'
     A                                  4 41'Code'
     A                                  4 51'and Press "ENTER" Key'
     A                                  5  8'-----------------------------------
     A                                      ---------------------------'
     A                                  6  8'.  Identification Code:'
     A                                  6 43'Name:'
     A                                  6 68'.'
     A                                  7  8'-----------------------------------
     A                                      ---------------------------'
     A                                  8 13'PRESS:'
     A                                  9 21'f1   Return to Menu'
     A                                 11 21'f2   Write Message to WO or Clock'
     A                                 11 55'Card'
     A                                 13 21'f3   Exit Program'
     A                                 15 21'f4   View Current News Items'
     A                                 17 21'f5      ***  No Function  ***'
     A                                 19 21'f6      ***  No Function  ***'
     A                                 21 21'f7      ***  No Function  ***'
     A                                 23 21'f8   Receive Messages'
     A            CNUM           4A  B  4 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI PC)
     A            CCNM           4A  B  6 33DSPATR(PR)
     A                                      OVRDTA
     A            NAME          16A  B  6 50DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A*%%CP+999CRTDSPF
     A*%%CP+    FILE(MCTST/ZMESSAGE)
     A*%%CP+    SRCFILE(MCTST/QDDSSRC)
     A*%%CP+    SRCMBR(ZMESSAGE)
     A*%%CP+    TEXT(*SRCMBRTXT)
     A*%%CP     RSTDSP(*YES)
