     A*  88/11/18  15:57:29    T881S29     REL-R01M00  5728-PW1
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A                                      CA03(03 'end of program')
     A          R SCREEN1
     A*  88/11/18  15:57:29    T881S29     REL-R01M00  5728-PW1
     A                                      CF04(04 'start listing')
     A                                      CF05(05 'continue listing')
     A                                      CF06(06 'add a message')
     A                                      CF07(07 'modify a message')
     A                                      PUTOVR
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 29'MESSAGE FILE MAINTENANCE'
     A                                      DSPATR(HI)
     A                                  1 73TIME
     A                                  3  8'PRESS f4 TO LIST MESSAGES STARTING-
     A                                       FROM'
     A            MSGTXTI       20A  B  3 52CHGINPDFT(CS UL)
     A  10                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  ERRMSG('INVALID MESSAGE TEXT - OR --
     A                                       END OF MESSAGE LISTING')
     A                                  4  8'PRESS f5 TO CONTINUE MESSAGE LISTI-
     A                                      NG'
     A                                  6  8'PRESS f6 TO ADD THE FOLLOWING MESS-
     A                                      AGE'
     A                                  6 52'LAST MESSAGE ADDED -'
     A            MSGNONEW       5Y 0B  6 73EDTCDE(Z)
     A                                      DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            MSGTXTNEW     79A  B  8  2CHGINPDFT(CS UL)
     A                                      OVRDTA
     A  40                                  DSPATR(PC)
     A  40                                  DSPATR(RI)
     A                                 10  8'PRESS f7 TO MODIFY MESSAGE NUMBER'
     A            MODMSGNUM      5Y 0B 10 42CHGINPDFT(CS UL)
     A                                      CHECK(RZ)
     A                                      EDTCDE(Z)
     A  20                                  DSPATR(PC)
     A  40                                  DSPATR(PR)
     A                                      OVRATR
     A                                      OVRDTA
     A  20                                  ERRMSG('INVALID MESSAGE NUMBER')
     A                                 12 33'MESSAGE  LISTING'
     A                                      DSPATR(HI)
     A            MSGNO1         5Y 0B 14  3EDTCDE(Z)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            MSGTXT1       72A  B 14  9DSPATR(PR)
     A                                      OVRDTA
     A            MSGNO2         5Y 0B 15  3EDTCDE(Z)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            MSGTXT2       72A  B 15  9DSPATR(PR)
     A                                      OVRDTA
     A            MSGNO3         5Y 0B 16  3EDTCDE(Z)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            MSGTXT3       72A  B 16  9DSPATR(PR)
     A                                      OVRDTA
     A            MSGNO4         5Y 0B 17  3EDTCDE(Z)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            MSGTXT4       72A  B 17  9DSPATR(PR)
     A                                      OVRDTA
     A            MSGNO5         5Y 0B 18  3EDTCDE(Z)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            MSGTXT5       72A  B 18  9DSPATR(PR)
     A                                      OVRDTA
     A            MSGNO6         5Y 0B 19  3EDTCDE(Z)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            MSGTXT6       72A  B 19  9DSPATR(PR)
     A                                      OVRDTA
     A            MSGNO7         5Y 0B 20  3EDTCDE(Z)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            MSGTXT7       72A  B 20  9DSPATR(PR)
     A                                      OVRDTA
     A            MSGNO8         5Y 0B 21  3EDTCDE(Z)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            MSGTXT8       72A  B 21  9DSPATR(PR)
     A                                      OVRDTA
     A            MSGNO9         5Y 0B 22  3EDTCDE(Z)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            MSGTXT9       72A  B 22  9DSPATR(PR)
     A                                      OVRDTA
     A            MSGNO10        5Y 0B 23  3CHGINPDFT
     A                                      EDTCDE(Z)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            MSGTXT10      72A  B 23  9DSPATR(PR)
     A                                      OVRDTA
     A  10
     AO 20
     AO 30        ERRMSG        79   M      OVRDTA
     A                                 13  2'Number'
     A                                      DSPATR(HI)
     A                                 13  9'Message'
     A                                      DSPATR(HI)
