     A*%%TS  SD  19960425  084620  A257947     REL-V3R1M0  5763-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A          R MISCSCRN
     A*%%TS  SD  19960425  084620  A257947     REL-V3R1M0  5763-PW1
     A                                      CA03(03 'Exit')
     A                                      PUTOVR
     A                                  2 19'M I S C E L L A N E O U S   A C T -
     A                                      I V I T Y'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  2 76'MM1'
     A            CODEIN         7A  B  4  3
     A N20                                  DSPATR(HI)
     A  20                                  DSPATR(UL)
     A  20                                  DSPATR(PC)
     A N20                                  DSPATR(PR)
     A  30                                  DSPATR(RI)
     A                                      OVRDTA
     A                                      OVRATR
     A            PROMPT        45A  B  4 12DSPATR(PR)
     A                                      OVRDTA
     A                                  6  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  7  3'CODE'
     A                                  7 13'KEYWORD'
     A                                  7 33'ADJECTIVE'
     A                                  7 62'UM'
     A            CODEOUT        7A  B  8  3DSPATR(PR)
     A                                      OVRDTA
     A            KEYWORD       46A  B  8 13DSPATR(PR)
     A                                      OVRDTA
     A            UM             2A  B  8 62DSPATR(PR)
     A                                      OVRDTA
     A                                  9  3'DESC'
     A            DESC          70A  B  9  9DSPATR(PR)
     A                                      OVRDTA
     A                                 11  3'DOC #'
     A            DOCNUM        10A  B 11 10
     A N20                                  DSPATR(UL)
     A  21                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(PR)
     A                                 11 23'TOTAL VALUE FOR THIS TRANSACTION'
     A            VALUE         15Y 4B 11 57
     A  28                                  DSPATR(RI)
     A N20                                  DSPATR(UL)
     A  28                                  DSPATR(PC)
     A  20                                  DSPATR(PR)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A            BOX            1X  B 13  4
     A N20                                  DSPATR(UL)
     A  20                                  DSPATR(PR)
     A                                      VALUES('X' ' ')
     A                                      OVRDTA
     A                                      OVRATR
     A                                 13  7'<-- PLACE AN X IN THIS BOX TO DECR-
     A                                      EASE QTY, LEAVE BLANK TO INCREASE Q-
     A                                      TY'
     A                                 15 15'LOCATION......QUANTITY'
     A                                 15 44'LOCATION......QUANTITY'
     A            LOC1          12A  B 16 15DSPATR(PR)
     A                                      OVRDTA
     A            QTY1           8Y 0B 16 29
     A  22                                  DSPATR(RI)
     A N20                                  DSPATR(UL)
     A  22                                  DSPATR(PC)
     A  20                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      OVRATR
     A            LOC2          12A  B 16 44DSPATR(PR)
     A                                      OVRDTA
     A            QTY2           8Y 0B 16 58
     A  23                                  DSPATR(RI)
     A N20                                  DSPATR(UL)
     A  23                                  DSPATR(PC)
     A  20                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      OVRATR
     A            LOC3          12A  B 17 15DSPATR(PR)
     A                                      OVRDTA
     A            QTY3           8Y 0B 17 29
     A  24                                  DSPATR(RI)
     A N20                                  DSPATR(UL)
     A  24                                  DSPATR(PC)
     A  20                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      OVRATR
     A            LOC4          12A  B 17 44DSPATR(PR)
     A                                      OVRDTA
     A            QTY4           8Y 0B 17 58
     A  25                                  DSPATR(RI)
     A N20                                  DSPATR(UL)
     A  25                                  DSPATR(PC)
     A  20                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      OVRATR
     A            LOC5          12A  B 18 15DSPATR(PR)
     A                                      OVRDTA
     A            QTY5           8Y 0B 18 29
     A  26                                  DSPATR(RI)
     A N20                                  DSPATR(UL)
     A  26                                  DSPATR(PC)
     A  20                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      OVRATR
     A            LOC6          12A  B 18 44DSPATR(PR)
     A                                      OVRDTA
     A            QTY6           8Y 0B 18 58
     A  27                                  DSPATR(RI)
     A N20                                  DSPATR(UL)
     A  27                                  DSPATR(PC)
     A  20                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                      OVRATR
     A                                 20  3'COMMENT FOR PRINTOUT'
     A            COMMENT       55A  B 20 24
     A N20                                  DSPATR(UL)
     A  20                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 22  3'DISBURSEMENT INSTRUCTION'
     A            DISBINSTR     30A  B 22 29DSPATR(PR)
     A                                      OVRDTA
     A                                 23  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                 24  3'F3=EXIT'
     A  60        MSGLINE       78   M      OVRDTA
