     A                                      DSPSIZ(24 80 *DS3)
     A                                      INDARA
     A                                      PRINT
     A                                      CHGINPDFT
     A          R MSG                       PUTOVR
     A                                      CF03
     A                                 10 20'MESSAGE NUMBER:'
     A            MSGID          5Y 0B 10 37DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A                                      OVRATR
     A            MSGNO          5A  B 22 10DSPATR(PR)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A                                      OVRATR
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN TO MENU f3-EXIT P-
     A                                      ROGRAM                             -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
