     A*%%TS  DD  20030612  105224  QUSER       REL-V5.1    iSeries WDT
     A*%%FD Screens for Miscellaneous Processing Programs
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A                                      CA03(03 'END PROGRAM')
     A          R FAPPRVWO
     A*%%TS  DD  19950201  112341  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A  98                                  INVITE
     A                                  1 22'W O R K   O R D E R   A P P R O V'
     A                                  1 56'A L S'
     A                                 22  5'ENTER WORK ORDERS TO BE APPROVED A-
     A                                      ND PRESS THE "ENTER" KEY, F3 TO EXI-
     A                                      T'
     A            WONUMA         6A  B  4 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            WONUMA7        1A  B  4 23DSPATR(UL)
     A                                      OVRDTA
     A            WONUMAR        3A  B  4 25DSPATR(UL)
     A                                      OVRDTA
     A            WONUMB         6A  B  4 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            WONUMB7        1A  B  4 43DSPATR(UL)
     A                                      OVRDTA
     A            WONUMBR        3A  B  4 45DSPATR(UL)
     A                                      OVRDTA
     A            WONUMC         6A  B  4 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            WONUMC7        1A  B  4 63DSPATR(UL)
     A                                      OVRDTA
     A            WONUMCR        3A  B  4 65DSPATR(UL)
     A                                      OVRDTA
     A            WONUMD         6A  B  6 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            WONUMD7        1A  B  6 23DSPATR(UL)
     A                                      OVRDTA
     A            WONUMDR        3A  B  6 25DSPATR(UL)
     A                                      OVRDTA
     A            WONUME         6A  B  6 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            WONUME7        1A  B  6 43DSPATR(UL)
     A                                      OVRDTA
     A            WONUMER        3A  B  6 45DSPATR(UL)
     A                                      OVRDTA
     A            WONUMF         6A  B  6 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            WONUMF7        1A  B  6 63DSPATR(UL)
     A                                      OVRDTA
     A            WONUMFR        3A  B  6 65DSPATR(UL)
     A                                      OVRDTA
     A            WONUMG         6A  B  8 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            WONUMG7        1A  B  8 23DSPATR(UL)
     A                                      OVRDTA
     A            WONUMGR        3A  B  8 25DSPATR(UL)
     A                                      OVRDTA
     A            WONUMH         6A  B  8 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            WONUMH7        1A  B  8 43DSPATR(UL)
     A                                      OVRDTA
     A            WONUMHR        3A  B  8 45DSPATR(UL)
     A                                      OVRDTA
     A            WONUMI         6A  B  8 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            WONUMI7        1A  B  8 63DSPATR(UL)
     A                                      OVRDTA
     A            WONUMIR        3A  B  8 65DSPATR(UL)
     A                                      OVRDTA
     A            WONUMJ         6A  B 10 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            WONUMJ7        1A  B 10 23DSPATR(UL)
     A                                      OVRDTA
     A            WONUMJR        3A  B 10 25DSPATR(UL)
     A                                      OVRDTA
     A            WONUMK         6A  B 10 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            WONUMK7        1A  B 10 43DSPATR(UL)
     A                                      OVRDTA
     A            WONUMKR        3A  B 10 45DSPATR(UL)
     A                                      OVRDTA
     A            WONUML         6A  B 10 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            WONUML7        1A  B 10 63DSPATR(UL)
     A                                      OVRDTA
     A            WONUMLR        3A  B 10 65DSPATR(UL)
     A                                      OVRDTA
     A            WONUMM         6A  B 12 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            WONUMM7        1A  B 12 23DSPATR(UL)
     A                                      OVRDTA
     A            WONUMMR        3A  B 12 25DSPATR(UL)
     A                                      OVRDTA
     A            WONUMN         6A  B 12 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            WONUMN7        1A  B 12 43DSPATR(UL)
     A                                      OVRDTA
     A            WONUMNR        3A  B 12 45DSPATR(UL)
     A                                      OVRDTA
     A            WONUMO         6A  B 12 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            WONUMO7        1A  B 12 63DSPATR(UL)
     A                                      OVRDTA
     A            WONUMOR        3A  B 12 65DSPATR(UL)
     A                                      OVRDTA
     A            WONUMP         6A  B 14 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            WONUMP7        1A  B 14 23DSPATR(UL)
     A                                      OVRDTA
     A            WONUMPR        3A  B 14 25DSPATR(UL)
     A                                      OVRDTA
     A            WONUMQ         6A  B 14 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            WONUMQ7        1A  B 14 43DSPATR(UL)
     A                                      OVRDTA
     A            WONUMQR        3A  B 14 45DSPATR(UL)
     A                                      OVRDTA
     A            WONUMR         6A  B 14 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            WONUMR7        1A  B 14 63DSPATR(UL)
     A                                      OVRDTA
     A            WONUMRR        3A  B 14 65DSPATR(UL)
     A                                      OVRDTA
     A            WONUMS         6A  B 16 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            WONUMS7        1A  B 16 23DSPATR(UL)
     A                                      OVRDTA
     A            WONUMSR        3A  B 16 25DSPATR(UL)
     A                                      OVRDTA
     A            WONUMT         6A  B 16 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            WONUMT7        1A  B 16 43DSPATR(UL)
     A                                      OVRDTA
     A            WONUMTR        3A  B 16 45DSPATR(UL)
     A                                      OVRDTA
     A            WONUMU         6A  B 16 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            WONUMU7        1A  B 16 63DSPATR(UL)
     A                                      OVRDTA
     A            WONUMUR        3A  B 16 65DSPATR(UL)
     A                                      OVRDTA
     A            WONUMV         6A  B 18 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            WONUMV7        1A  B 18 23DSPATR(UL)
     A                                      OVRDTA
     A            WONUMVR        3A  B 18 25DSPATR(UL)
     A                                      OVRDTA
     A            WONUMW         6A  B 18 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            WONUMW7        1A  B 18 43DSPATR(UL)
     A                                      OVRDTA
     A            WONUMWR        3A  B 18 45DSPATR(UL)
     A                                      OVRDTA
     A            WONUMX         6A  B 18 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            WONUMX7        1A  B 18 63DSPATR(UL)
     A                                      OVRDTA
     A            WONUMXR        3A  B 18 65DSPATR(UL)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FCHGSEQ
     A*%%TS  SD  19890215  142447  T881S29     REL-R01M02  5728-PW1
     A                                      PUTOVR
     A                                  2 20'M M I S   H I S T O R Y   R E T R -
     A                                      I E V E'
     A                                      DSPATR(HI)
     A                                  6  7'Enter the sequence number you wish-
     A                                       to retrieve and change'
     A            HSEQUENCE      4A  B  6 65CHGINPDFT(CS UL)
     A                                      CHECK(RZ)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A  99        ERRMSG        79   M      OVRDTA
     A          R FCHGWOEQ
     A*%%TS  DD  19950201  112341  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A  98                                  INVITE
     A                                  1  2'THIS SCREEN IS A ONE-TIME W/O ENTR-
     A                                      Y SCREEN FOR DANVILLE ZONE STRUCTUR-
     A                                      E CHANGE'
     A                                 22 17'ENTER W/O NUMBERS AND DEPRESS "ENT-
     A                                      ER" KEY'
     A            WONUMA        10A  B  3 14DSPATR(UL)
     A            WOA           10A  B  3 34DSPATR(PR)
     A            B             10A  B  3 54DSPATR(UL)
     A            WONUMC        10A  B  5 14DSPATR(UL)
     A            WOC           10A  B  5 34DSPATR(PR)
     A            D             10A  B  5 54DSPATR(UL)
     A            WONUME        10A  B  7 14DSPATR(UL)
     A            WOE           10A  B  7 34DSPATR(PR)
     A            F             10A  B  7 54DSPATR(UL)
     A            WONUMG        10A  B  9 14DSPATR(UL)
     A            WOG           10A  B  9 34DSPATR(PR)
     A            H             10A  B  9 54DSPATR(UL)
     A            WONUMI        10A  B 11 14DSPATR(UL)
     A            WOI           10A  B 11 34DSPATR(PR)
     A            J             10A  B 11 54DSPATR(UL)
     A            WONUMK        10A  B 13 14DSPATR(UL)
     A            WOK           10A  B 13 34DSPATR(PR)
     A            L             10A  B 13 54DSPATR(UL)
     A            WONUMM        10A  B 15 14DSPATR(UL)
     A            WOM           10A  B 15 34DSPATR(PR)
     A            N             10A  B 15 54DSPATR(UL)
     A            WONUMO        10A  B 17 14DSPATR(UL)
     A            WOO           10A  B 17 34DSPATR(PR)
     A            P             10A  B 17 54DSPATR(UL)
     A            WONUMQ        10A  B 19 14DSPATR(UL)
     A            WOQ           10A  B 19 34DSPATR(PR)
     A            COMMANDLN     79A  O 24  1OVRDTA
     A  99        MESSAGELN     79   M      OVRDTA
     A          R FCOPYRQ1
     A*%%TS  DD  19950201  131820  T881S32     REL-V3R1M0  5763-CD1
     A                                      CF01
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  3DATE
     A                                      EDTCDE(Y)
     A                                      DSPATR(HI)
     A                                  1 19'Duplication of Work Order Requisit-
     A                                      ions'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  3 15'Input'
     A                                  3 21'W/O NUMBER'
     A                                      DSPATR(HI)
     A                                  3 32'to be'
     A                                  3 38'COPIED :'
     A                                      DSPATR(HI)
     A            WOIN6          6A  B  3 48CHGINPDFT(CS UL)
     A  10                                  DSPATR(PC)
     A  10                                  DSPATR(RI)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(PR)
     A            WOIN1          1A  B  3 55CHGINPDFT(CS UL)
     A  10                                  DSPATR(RI)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(PR)
     A            WOIN3          3A  B  3 57DSPATR(CS)
     A                                      DSPATR(UL)
     A  10                                  DSPATR(RI)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(PR)
     A                                  5 12'Input'
     A                                  5 18'W/O Number'
     A                                      DSPATR(HI)
     A                                  5 29'to be'
     A                                  5 35'COPIED TO :'
     A                                      DSPATR(HI)
     A            WOUT6          6A  B  5 48CHGINPDFT(CS UL)
     A  11                                  DSPATR(PC)
     A  11                                  DSPATR(RI)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(PR)
     A            WOUT1          1A  B  5 55CHGINPDFT(CS UL)
     A  11                                  DSPATR(RI)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(PR)
     A            WOUT3          3A  B  5 57CHGINPDFT(CS UL)
     A  11                                  DSPATR(RI)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(PR)
     A                                  7  4'Input'
     A                                  7 10'ITEM-NO'
     A                                      DSPATR(HI)
     A                                  7 18'to be'
     A                                  7 24'COPIED'
     A                                      DSPATR(HI)
     A                                  7 31'to W/O Number :'
     A            ITEMNO         2A  B  7 48CHGINPDFT(CS UL)
     A                                      OVRDTA
     A  12                                  DSPATR(PC)
     A  12                                  DSPATR(RI)
     A                                      OVRATR
     A  27                                  DSPATR(PR)
     A                                 10  6'ITEM-NO'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                 10 16'REQ-NO'
     A                                      DSPATR(UL)
     A                                 10 31'ITEM-NO'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                 10 41'REQ-NO'
     A                                      DSPATR(UL)
     A                                 10 57'ITEM-NO'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                 10 67'REQ-NO'
     A                                      DSPATR(UL)
     A            FLD001         2A  B 12  9OVRDTA
     A                                      DSPATR(PR)
     A            FLD002        10A  B 12 16OVRDTA
     A                                      DSPATR(PR)
     A            FLD003         2A  B 12 34OVRDTA
     A                                      DSPATR(PR)
     A            FLD004        10A  B 12 41OVRDTA
     A                                      DSPATR(PR)
     A            FLD005         2A  B 12 60OVRDTA
     A                                      DSPATR(PR)
     A            FLD006        10A  B 12 67OVRDTA
     A                                      DSPATR(PR)
     A            FLD007         2A  B 14  9OVRDTA
     A                                      DSPATR(PR)
     A            FLD008        10A  B 14 16OVRDTA
     A                                      DSPATR(PR)
     A            FLD009         2A  B 14 34OVRDTA
     A                                      DSPATR(PR)
     A            FLD010        10A  B 14 41OVRDTA
     A                                      DSPATR(PR)
     A            FLD011         2A  B 14 60OVRDTA
     A                                      DSPATR(PR)
     A            FLD012        10A  B 14 67OVRDTA
     A                                      DSPATR(PR)
     A            FLD013         2A  B 16  9OVRDTA
     A                                      DSPATR(PR)
     A            FLD014        10A  B 16 16OVRDTA
     A                                      DSPATR(PR)
     A            FLD015         2A  B 16 34OVRDTA
     A                                      DSPATR(PR)
     A            FLD016        10A  B 16 41OVRDTA
     A                                      DSPATR(PR)
     A            FLD017         2A  B 16 60OVRDTA
     A                                      DSPATR(PR)
     A            FLD018        10A  B 16 67OVRDTA
     A                                      DSPATR(PR)
     A            FLD019         2A  B 18  9OVRDTA
     A                                      DSPATR(PR)
     A            FLD020        10A  B 18 16OVRDTA
     A                                      DSPATR(PR)
     A            FLD021         2A  B 18 34OVRDTA
     A                                      DSPATR(PR)
     A            FLD022        10A  B 18 41OVRDTA
     A                                      DSPATR(PR)
     A            FLD023         2A  B 18 60OVRDTA
     A                                      DSPATR(PR)
     A            FLD024        10A  B 18 67OVRDTA
     A                                      DSPATR(PR)
     A            FUNCLI        79A  B 22  3DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    74A  O 24  1OVRDTA
     A                                      DSPATR(HI)
     A            CMDRESPONS     1A  B 24 76OVRDTA
     A  97                                  DSPATR(UL)
     A  97                                  DSPATR(CS)
     A  97                                  DSPATR(PC)
     A  97                                  DSPATR(HI)
     A  97                                  DSPATR(BL)
     A N97                                  DSPATR(PR)
     A  97                                  CHECK(ME)
     A                                      VALUES('Y' 'N')
     A                                      OVRATR
     A  99        ERRMSG        79   M      OVRDTA
     A          R FDBMVIEW
     A*%%TS  DD  19950201  112341  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A  98                                  INVITE
     A                                  8 23'ENTER WORK ORDER TO BE DISPLAYED'
     A                                 15 28'AND PRESS "ENTER" KEY'
     A            WOV6           6A  B 11 33DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            WOVYR          1A  B 11 40DSPATR(UL)
     A            WPVREM         3A  B 11 42DSPATR(UL)
     A            COMMANDLN     79A  O 24  1OVRDTA
     A  99        MESSAGELN     79   M      OVRDTA
     A          R FDELRESV
     A*%%TS  DD  19950201  112341  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                 10 19'INPUT THE WORK ORDER AND THE CSIS'
     A                                 10 53'CODE THAT'
     A                                 12 25'YOU NEED TO UNRESERVE PARTS FOR'
     A                                 20 28'DEPRESS F3 TO EXIT PROGRAM'
     A            WO6            6A  B 14 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            WOY            1A  B 14 37DSPATR(UL)
     A            WOR            3A  B 14 39DSPATR(UL)
     A            WOL            8A  B 14 44DSPATR(UL)
     A            COMMANDLN     79A  O 24  1OVRDTA
     A  99        MESSAGELN     79   M      OVRDTA
     A          R FDELWOS
     A*%%TS  DD  19950201  112341  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A  98                                  INVITE
     A                                  1  2'THIS FORM IS DESIGNED TO ALLOW YOU-
     A                                       TO ENTER A 10-DIGIT WORK ORDER NUM-
     A                                      BER THAT'
     A                                  2  1'WAS INCORRECTLY ENTERED INTO THE C-
     A                                      ORPORATE ENGINEERING DATABASE AND'
     A                                  2 69'NEEDS TO BE'
     A                                  3  1'DELETED - PROGRAM WILL TERMINATE I-
     A                                      F WORK ORDER FIELD IS LEFT BLANK'
     A            WONUMA         6A  B  5  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            WONUMA7        1A  B  5  8DSPATR(UL)
     A                                      OVRDTA
     A            WONUMAR        3A  B  5 10DSPATR(UL)
     A                                      OVRDTA
     A            WONUMB         6A  B  7  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            WONUMB7        1A  B  7  8DSPATR(UL)
     A                                      OVRDTA
     A            WONUMBR        3A  B  7 10DSPATR(UL)
     A                                      OVRDTA
     A            WONUMC         6A  B  9  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            WONUMC7        1A  B  9  8DSPATR(UL)
     A                                      OVRDTA
     A            WONUMCR        3A  B  9 10DSPATR(UL)
     A                                      OVRDTA
     A            WONUMD         6A  B 11  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            WONUMD7        1A  B 11  8DSPATR(UL)
     A                                      OVRDTA
     A            WONUMDR        3A  B 11 10DSPATR(UL)
     A                                      OVRDTA
     A            WONUME         6A  B 13  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            WONUME7        1A  B 13  8DSPATR(UL)
     A                                      OVRDTA
     A            WONUMER        3A  B 13 10DSPATR(UL)
     A                                      OVRDTA
     A            WONUMF         6A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            WONUMF7        1A  B 15  8DSPATR(UL)
     A                                      OVRDTA
     A            WONUMFR        3A  B 15 10DSPATR(UL)
     A                                      OVRDTA
     A            WONUMG         6A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            WONUMG7        1A  B 17  8DSPATR(UL)
     A                                      OVRDTA
     A            WONUMGR        3A  B 17 10DSPATR(UL)
     A                                      OVRDTA
     A            WONUMH         6A  B 19  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            WONUMH7        1A  B 19  8DSPATR(UL)
     A                                      OVRDTA
     A            WONUMHR        3A  B 19 10DSPATR(UL)
     A                                      OVRDTA
     A                                 22 16'ENTER DATA AND PRESS "ENTER" KEY E-
     A                                      LSE F3 TO EXIT'
     A            COMMANDLN     79A  O 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FDISPLAB
     A*%%TS  SD  19890123  123448  T881S03     REL-R01M02  5728-PW1
     A                                      PUTOVR
     A                                      CF02
     A                                      CF04
     A  98                                  INVITE
     A                                  1 25'W O R K   O R D E R'
     A                                  1 60'DATE'
     A                                  2 22'L A B O R   D I S P L A Y'
     A                                  3  1'W/O NUM'
     A                                  5  1'CR REQ:'
     A                                  6  1'MEN E :'
     A                                  7  1'MEN A :'
     A                                  8  1'HRS E '
     A                                  9  1'HRS A '
     A                                 10 52'TOTAL COST'
     A                                 11  2'ITM  NAME'
     A                                 11 24'CRFT SFT STDATE  STTM  CODATE  COT-
     A                                      M    HRS'
     A                                 11 76'COST'
     A            CURRENTD       8A  B  1 65DSPATR(PR)
     A                                      OVRDTA
     A            CURRENTT       5A  B  1 75DSPATR(PR)
     A                                      OVRDTA
     A            WOL7           7A  B  3  9DSPATR(PR)
     A                                      OVRDTA
     A            WOLREST        3A  B  3 17DSPATR(PR)
     A                                      OVRDTA
     A            LLCFTA         2A  B  5 12DSPATR(PR)
     A                                      OVRDTA
     A            LLCFTB         2A  B  5 18DSPATR(PR)
     A                                      OVRDTA
     A            LLCFT1         2A  B  5 24DSPATR(PR)
     A                                      OVRDTA
     A            LLCFT2         2A  B  5 30DSPATR(PR)
     A                                      OVRDTA
     A            LLCFT3         2A  B  5 36DSPATR(PR)
     A                                      OVRDTA
     A            LLCFT4         2A  B  5 42DSPATR(PR)
     A                                      OVRDTA
     A            LLCFT5         2A  B  5 48DSPATR(PR)
     A                                      OVRDTA
     A            LLCFT6         2A  B  5 54DSPATR(PR)
     A                                      OVRDTA
     A            LLCFT7         2A  B  5 60DSPATR(PR)
     A                                      OVRDTA
     A            LLCFT8         2A  B  5 66DSPATR(PR)
     A                                      OVRDTA
     A            LLCFT9         2A  B  5 72DSPATR(PR)
     A                                      OVRDTA
     A            LLCFT0         2A  B  5 78DSPATR(PR)
     A                                      OVRDTA
     A            LMNESTA        2A  B  6 12DSPATR(PR)
     A                                      OVRDTA
     A            LMNESTB        2A  B  6 18DSPATR(PR)
     A                                      OVRDTA
     A            LMNEST1        2A  B  6 24DSPATR(PR)
     A                                      OVRDTA
     A            LMNEST2        2A  B  6 30DSPATR(PR)
     A                                      OVRDTA
     A            LMNEST3        2A  B  6 36DSPATR(PR)
     A                                      OVRDTA
     A            LMNEST4        2A  B  6 42DSPATR(PR)
     A                                      OVRDTA
     A            LMNEST5        2A  B  6 48DSPATR(PR)
     A                                      OVRDTA
     A            LMNEST6        2A  B  6 54DSPATR(PR)
     A                                      OVRDTA
     A            LMNEST7        2A  B  6 60DSPATR(PR)
     A                                      OVRDTA
     A            LMNEST8        2A  B  6 66DSPATR(PR)
     A                                      OVRDTA
     A            LMNEST9        2A  B  6 72DSPATR(PR)
     A                                      OVRDTA
     A            LMNEST0        2A  B  6 78DSPATR(PR)
     A                                      OVRDTA
     A            LMENACA        2A  B  7 12DSPATR(PR)
     A                                      OVRDTA
     A            LMENACB        2A  B  7 18DSPATR(PR)
     A                                      OVRDTA
     A            LMENAC1        2A  B  7 24DSPATR(PR)
     A                                      OVRDTA
     A            LMENAC2        2A  B  7 30DSPATR(PR)
     A                                      OVRDTA
     A            LMENAC3        2A  B  7 36DSPATR(PR)
     A                                      OVRDTA
     A            LMENAC4        2A  B  7 42DSPATR(PR)
     A                                      OVRDTA
     A            LMENAC5        2A  B  7 48DSPATR(PR)
     A                                      OVRDTA
     A            LMENAC6        2A  B  7 54DSPATR(PR)
     A                                      OVRDTA
     A            LMENAC7        2A  B  7 60DSPATR(PR)
     A                                      OVRDTA
     A            LMENAC8        2A  B  7 66DSPATR(PR)
     A                                      OVRDTA
     A            LMENAC9        2A  B  7 72DSPATR(PR)
     A                                      OVRDTA
     A            LMENAC0        2A  B  7 78DSPATR(PR)
     A                                      OVRDTA
     A            LHRSESA       72A  B  8  8DSPATR(PR)
     A                                      OVRDTA
     A            LHRSES1       72A  B  9  8DSPATR(PR)
     A                                      OVRDTA
     A            LHRSES3       17A  B 10 63DSPATR(PR)
     A                                      OVRDTA
     A            LHRSES5       79A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            LHRSES7       79A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            LHRSES9       79A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            LHRSASA       79A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            LHRSAC1       79A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            LHRSAC3       79A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            LHRSAC5       79A  B 18  1DSPATR(PR)
     A                                      OVRDTA
     A            LHRSAC7       79A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            LHRSAC9       79A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            LLTOTCST      79A  B 21  1DSPATR(PR)
     A                                      OVRDTA
     A            LDATALIN2     79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FEQPLIST
     A*%%TS  DD  19950201  112341  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                  4 24'E Q U I P M E N T   L I S T I N G'
     A                                  5 24'- - - - - - - - -   - - - - - - -'
     A                                  7 25'SPECIFY SORT KEY:'
     A                                  9 30'EQUIPMENT NUMBER'
     A                                 11 32'EQUIPMENT TYPE'
     A                                 14 24'FOR BREAKDOWN BY MAINTENANCE ZONE'
     A                                 16 24'FOR SPECIFIC ZONE ONLY,ENTER ZONE'
     A            E              1A  B  9 47DSPATR(UL)
     A            T              1A  B 11 47DSPATR(UL)
     A            Z              1A  B 14 61DSPATR(UL)
     A            ZONE           4A  B 16 58DSPATR(UL)
     A            MESSAGE1      79A  B 23  1DSPATR(PR)
     A          R FJBRETV1
     A*%%TS  DD  19950201  112341  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                  5  8'ENTER THE GENERIC JOBPLAN NAMES YO-
     A                                      U WOULD LIKE TO HAVE COPIED'
     A                                  7 23'AND DEPRESS THE "ENTER" KEY'
     A                                  9 23'DEPRESS "F3" TO EXIT PROGRAM'
     A            GJPNAME1      10A  B 11 31DSPATR(UL)
     A                                      OVRDTA
     A            GJPNAME2      10A  B 13 31DSPATR(UL)
     A                                      OVRDTA
     A            GJPNAME3      10A  B 15 31DSPATR(UL)
     A                                      OVRDTA
     A            GJPNAME4      10A  B 17 31DSPATR(UL)
     A                                      OVRDTA
     A            GJPNAME5      10A  B 19 31DSPATR(UL)
     A                                      OVRDTA
     A            COMMANDLN1    79   B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FLOADLBR
     A*%%TS  DD  19950201  135536  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A  98                                  INVITE
     A                                  1 12'W O R K   O R D E R   L A B O R'
     A                                  1 46'I N P U T'
     A            HD             2A  B  1 63DSPATR(PR)
     A            HM             2A  B  1 66DSPATR(PR)
     A            HY             2A  B  1 69DSPATR(PR)
     A            HH             2A  B  1 73DSPATR(PR)
     A            HI             2A  B  1 76DSPATR(PR)
     A                                  3  7'DATE:'
     A            DM             2A  B  3 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            DD             2A  B  3 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            DY             2A  B  3 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A                                  3 35'SHIFT:'
     A            S              1A  B  3 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A                                  5  7'EMPLOYEE CC#:'
     A            ECC            4A  B  5 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A                                  5 35'EMPLOYEE NAME:'
     A            ENAM          16A  B  5 50DSPATR(PR)
     A                                      OVRDTA
     A                                  5 68'CRAFT:'
     A            CR             2A  B  5 75DSPATR(PR)
     A                                      OVRDTA
     A                                  7  7'W/O NUM:'
     A            WOA            6A  B  7 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            WO7A           1A  B  7 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            WORA           3A  B  7 25DSPATR(UL)
     A                                      OVRDTA
     A                                  7 35'TIME ON'
     A            TON1           4A  B  7 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A                                  7 50'TIME OFF'
     A            TOF1           4A  B  7 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A                                  8  7'W/O NUM:'
     A            WOB            6A  B  8 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            WO7B           1A  B  8 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            WORB           3A  B  8 25DSPATR(UL)
     A                                      OVRDTA
     A                                  8 35'TIME ON'
     A            TON2           4A  B  8 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A                                  8 50'TIME OFF'
     A            TOF2           4A  B  8 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                  9  7'W/O NUM:'
     A            WOC            6A  B  9 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            WO7C           1A  B  9 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            WORC           3A  B  9 25DSPATR(UL)
     A                                      OVRDTA
     A                                  9 35'TIME ON'
     A            TON3           4A  B  9 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A                                  9 50'TIME OFF'
     A            TOF3           4A  B  9 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A                                 10  7'W/O NUM:'
     A            WOD            6A  B 10 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            WO7D           1A  B 10 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            WORD           3A  B 10 25DSPATR(UL)
     A                                      OVRDTA
     A                                 10 35'TIME ON'
     A            TON4           4A  B 10 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A                                 10 50'TIME OFF'
     A            TOF4           4A  B 10 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A                                 11  7'W/O NUM:'
     A            WOE            6A  B 11 16DSPATR(UL)
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A                                      OVRDTA
     A            WO7E           1A  B 11 23DSPATR(UL)
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A                                      OVRDTA
     A            WORE           3A  B 11 25DSPATR(UL)
     A                                      OVRDTA
     A                                 11 35'TIME ON'
     A            TON5           4A  B 11 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                 11 50'TIME OFF'
     A            TOF5           4A  B 11 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A                                 12  7'W/O NUM:'
     A            WOF            6A  B 12 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            WO7F           1A  B 12 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            WORF           3A  B 12 25DSPATR(UL)
     A                                      OVRDTA
     A                                 12 35'TIME ON'
     A            TON6           4A  B 12 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A                                 12 50'TIME OFF'
     A            TOF6           4A  B 12 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A                                 13  7'W/O NUM:'
     A            WOG            6A  B 13 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            WO7G           1A  B 13 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            WORG           3A  B 13 25DSPATR(UL)
     A                                      OVRDTA
     A                                 13 35'TIME ON'
     A            TON7           4A  B 13 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A                                 13 50'TIME OFF'
     A            TOF7           4A  B 13 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A                                 14  7'W/O NUM:'
     A            WOH            6A  B 14 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            WO7H           1A  B 14 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A            WORH           3A  B 14 25DSPATR(UL)
     A                                      OVRDTA
     A                                 14 35'TIME ON'
     A            TON8           4A  B 14 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A                                 14 50'TIME OFF'
     A            TOF8           4A  B 14 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A                                 15  7'W/O NUM:'
     A            WOI            6A  B 15 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A            WO7I           1A  B 15 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A            WORI           3A  B 15 25DSPATR(UL)
     A                                      OVRDTA
     A                                 15 35'TIME ON'
     A            TON9           4A  B 15 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(PC)
     A                                 15 50'TIME OFF'
     A            TOF9           4A  B 15 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A                                 16  7'W/O NUM:'
     A            WOJ            6A  B 16 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A            WOR7J          1A  B 16 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A            WORJ           3A  B 16 25DSPATR(UL)
     A                                      OVRDTA
     A                                 16 35'TIME ON'
     A            TON0           4A  B 16 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A                                 16 50'TIME OFF'
     A            TOF0           4A  B 16 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A                                 19  1'ENTER ALL W/O"S THAT THE EMPLOYEE'
     A                                 19 35'WORKED ON AND PRESS THE "ENTER" KE-
     A                                      Y'
     A                                 20  1'IF THE EMPLOYEE WORKED ON MORE THA-
     A                                      N 10 W/O"S FILL IN THE SCREEN AND'
     A                                 20 69'PRESS THE'
     A                                 21  1'"ENTER" KEY - THE 10 ENTRIES WILL'
     A                                 21 35'BE PROCESSED AND THE SCREEN WILL B-
     A                                      E RESET TO'
     A                                 22  1'HANDLE 10 MORE NEW ENTRIES'
     A                                 23  1'PRESS F3 TO EXIT THE PROGRAM'
     A            COMMANDLN1    79   B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FOFFBASC
     A*%%TS  DD  19950201  135536  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF02
     A                                      CF06
     A  98                                  INVITE
     A                                  1 29'W O R K   O R D E R'
     A                                  3  1'W/O NUM:'
     A            WO7           10A  B  3 10DSPATR(PR)
     A                                      OVRDTA
     A                                  3 27'W/O STATUS:'
     A            WS             2A  B  3 39DSPATR(PR)
     A                                      OVRDTA
     A                                  3 55'DATE REQD:'
     A            RM             2A  B  3 66DSPATR(PR)
     A                                      OVRDTA
     A            RD             2A  B  3 69DSPATR(PR)
     A                                      OVRDTA
     A            RY             2A  B  3 72DSPATR(PR)
     A                                      OVRDTA
     A            RH             2A  B  3 75DSPATR(PR)
     A                                      OVRDTA
     A            RI             2A  B  3 78DSPATR(PR)
     A                                      OVRDTA
     A                                  4  1'APPROVAL CODE:'
     A            A              1A  B  4 16DSPATR(PR)
     A                                      OVRDTA
     A                                  4 27'REQUESTER:'
     A            REQUESTER     16A  B  4 38DSPATR(PR)
     A                                      OVRDTA
     A                                  4 55'EQUIP NUM:'
     A            EQPNUM         6A  B  4 66DSPATR(PR)
     A                                      OVRDTA
     A                                  5  1'EQUIP NAME:'
     A            EQUIPNAME     50A  B  5 13DSPATR(PR)
     A                                      OVRDTA
     A            TYPE           8A  B  5 66DSPATR(PR)
     A                                      OVRDTA
     A                                  6  1'DEPT:'
     A            DEPT           4A  B  6  7DSPATR(PR)
     A                                      OVRDTA
     A                                  6 20'MAINT ZONE:'
     A            ZONE           4A  B  6 32DSPATR(PR)
     A                                      OVRDTA
     A                                  6 40'LOCATION:'
     A            LOCATION       8A  B  6 50DSPATR(PR)
     A                                      OVRDTA
     A                                  6 60'PRIORITY:'
     A            P              1A  B  6 70DSPATR(PR)
     A                                      OVRDTA
     A                                  7  1'EQUIPMENT DOWN:'
     A            D              1A  B  7 17DSPATR(PR)
     A                                      OVRDTA
     A                                  7 20'CRAFT REQT:'
     A            C1             2A  B  7 32DSPATR(PR)
     A                                      OVRDTA
     A            C2             2A  B  7 35DSPATR(PR)
     A                                      OVRDTA
     A            C3             2A  B  7 38DSPATR(PR)
     A                                      OVRDTA
     A                                  7 60'EXP CLASS:'
     A            EXPCLASS       8A  B  7 71DSPATR(PR)
     A                                      OVRDTA
     A                                  8  1'DESCRIPTION:'
     A            DESCR1        30A  B  8 14DSPATR(PR)
     A                                      OVRDTA
     A                                  9  1'ADD"L INFO :'
     A            ADDL1         66A  B  9 14DSPATR(PR)
     A                                      OVRDTA
     A            ADDL2         66A  B 10 14DSPATR(PR)
     A                                      OVRDTA
     A                                 11  1'CRAFTSMEN  :'
     A            CRF1           4A  B 11 14DSPATR(PR)
     A                                      OVRDTA
     A            CRF2           4A  B 11 19DSPATR(PR)
     A                                      OVRDTA
     A            CRF3           4A  B 11 24DSPATR(PR)
     A                                      OVRDTA
     A            CRF4           4A  B 11 29DSPATR(PR)
     A                                      OVRDTA
     A            CRF5           4A  B 11 34DSPATR(PR)
     A                                      OVRDTA
     A                                 11 55'TIME STRT:'
     A            SM             2A  B 11 66DSPATR(PR)
     A                                      OVRDTA
     A            SD             2A  B 11 69DSPATR(PR)
     A                                      OVRDTA
     A            SY             2A  B 11 72DSPATR(PR)
     A                                      OVRDTA
     A            SH             2A  B 11 75DSPATR(PR)
     A                                      OVRDTA
     A            SI             2A  B 11 78DSPATR(PR)
     A                                      OVRDTA
     A                                 12  1'FAILURE CODE:'
     A            FC             2A  B 12 15DSPATR(PR)
     A                                      OVRDTA
     A            FC4            4A  B 12 18DSPATR(PR)
     A                                      OVRDTA
     A                                 12 55'TIME COMP:'
     A            CM             2A  B 12 66DSPATR(PR)
     A                                      OVRDTA
     A            CD             2A  B 12 69DSPATR(PR)
     A                                      OVRDTA
     A            CY             2A  B 12 72DSPATR(PR)
     A                                      OVRDTA
     A            CH             2A  B 12 75DSPATR(PR)
     A                                      OVRDTA
     A            CI             2A  B 12 78DSPATR(PR)
     A                                      OVRDTA
     A                                 22  2'DEPRESS APPROPRIATE FUNCTION KEY'
     A            COMMANDLN1    79   B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FOFFCRF2
     A*%%TS  DD  19950201  135536  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A  98                                  INVITE
     A                                  1 57'DATE:'
     A            DI             2A  B  1 64DSPATR(PR)
     A            MI             2A  B  1 67DSPATR(PR)
     A            YI             2A  B  1 70DSPATR(PR)
     A            HI             2A  B  1 74DSPATR(PR)
     A            MN             2A  B  1 77DSPATR(PR)
     A                                  6  6'CC #  ='
     A            CCNO           4A  B  6 14DSPATR(PR)
     A                                  7  6'NAME  ='
     A            CCNAME        16A  B  7 14DSPATR(PR)
     A                                  8  6'CRAFT ='
     A            CR             2A  B  8 14DSPATR(PR)
     A                                  9  6'ZONE  ='
     A            ZONE           4A  B  9 14DSPATR(PR)
     A                                 10  6'DEPT  ='
     A            DEPT           4A  B 10 14DSPATR(PR)
     A                                 12  1'STARTED WORK ORDER'
     A            WOS           10A  B 12 25DSPATR(PR)
     A                                 12 36'AT'
     A            SM             2A  B 12 39DSPATR(PR)
     A            SD             2A  B 12 42DSPATR(PR)
     A            SY             2A  B 12 45DSPATR(PR)
     A            SH             2A  B 12 49DSPATR(PR)
     A            ST             2A  B 12 52DSPATR(PR)
     A                                 13  1'LAST WORK ORDER WORKED'
     A            WOWORKED      10A  B 13 25DSPATR(PR)
     A                                 21  1'DEPRESS F1 TO CHECK ANOTHER CC #'
     A                                 22  1'DEPRESS F3 TO END PROGRAM'
     A            COMMANDLN1    79   B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FOFFCRFT
     A*%%TS  DD  19950201  135536  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                  7  7'ENTER THE CRAFTSMAN"S NUMBER'
     A                                  9 18'THEN DEPRESS THE "ENTER" KEY'
     A            CCNO           4A  B 11 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                 22  7'DEPRESS F3 TO END PROGRAM'
     A            COMMANDLN1    79   O 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FOFFHIST
     A*%%TS  DD  19950201  112341  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF02
     A                                      CF04
     A                                      CF06
     A  98                                  INVITE
     A                                  1  6'W O R K   O R D E R   S T A T U S'
     A                                  1 42'H I S T O R Y     DATE:'
     A                                  4  2'W/O NUM:'
     A                                  4 35'W/O DESC:'
     A                                 22  2'DEPRESS APPROPRIATE FUNCTION KEY'
     A            WO7           10A  B  4 11DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI1    30A  B  4 45DSPATR(PR)
     A                                      OVRDTA
     A            DATAL1        79A  B  7  1DSPATR(PR)
     A                                      OVRDTA
     A            DATAL2        79A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            DATAL3        79A  B  9  1DSPATR(PR)
     A                                      OVRDTA
     A            DATAL4        79A  B 10  1DSPATR(PR)
     A                                      OVRDTA
     A            DATAL5        79A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            DATAL6        79A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79   B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FOFFMENU
     A*%%TS  DD  19950201  112341  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                  2 10'DEPRESS'
     A                                  7 13'F2   TO CHANGE THE WORK ORDER NUMB-
     A                                      ER'
     A                                 10  9'F4   TO DISPLAY A BASIC WORK ORDER'
     A                                 12  9'F5   TO DISPLAY STATUS HISTORY FOR'
     A                                 12 44'A WORK ORDER'
     A                                 14  9'F6   TO DISPLAY LABOR USED ON A WO-
     A                                      RK ORDER'
     A                                 17 13'F3   TO END DISPLAY PROGRAM'
     A          R FOFFSTWO
     A*%%TS  SD  19960912  103215  A257947     REL-V3R6M0  5716-PW1
     A                                      CF04
     A                                      CF06
     A                                      PUTOVR
     A                                  7  3'INPUT THE WORK ORDER NUMBER FOR WH-
     A                                      ICH THE STATUS HISTORY IS TO BE DIS-
     A                                      PLAYED'
     A                                  9 19'THEN DEPRESS THE APPROPRIATE FUNCT-
     A                                      ION KEY'
     A            WO6            6A  B 11 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            WOY            1A  B 11 38DSPATR(UL)
     A                                      OVRDTA
     A            WOSUF          3A  B 11 40DSPATR(UL)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPRINTWS
     A*%%TS  DD  19950201  112341  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                  7  8'ENTER THE WORK ORDER NUMBER OF THE'
     A                                  7 43'WORK SHEET TO BE PRINTED'
     A                                  9 20'THEN DEPRESS THE ENTER KEY'
     A            P6            10A  B 11 27DSPATR(UL)
     A            COMMANDLN1    79   B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPRNTWO1
     A*%%TS  DD  19950201  112341  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                  4  7'ENTER THE WORK ORDER NUMBERS OF TH-
     A                                      E WORK ORDERS THAT YOU NEED TO HAVE'
     A                                  6 24'PRINTED AT YOUR CHARACTER PRINTER'
     A            WONUM1        10A  B  9 15DSPATR(UL)
     A            WO1           10A  B  9 29DSPATR(UL)
     A            B             10A  B  9 43DSPATR(UL)
     A            WONUM3        10A  B  9 57DSPATR(UL)
     A            WO3           10A  B 11 15DSPATR(UL)
     A            D             10A  B 11 29DSPATR(UL)
     A            WONUM5        10A  B 11 43DSPATR(UL)
     A            WO5           10A  B 11 57DSPATR(UL)
     A            F             10A  B 13 15DSPATR(UL)
     A            WONUM7        10A  B 13 29DSPATR(UL)
     A            WO7           10A  B 13 43DSPATR(UL)
     A            H             10A  B 13 57DSPATR(UL)
     A            WONUM9        10A  B 15 15DSPATR(UL)
     A            WO9           10A  B 15 29DSPATR(UL)
     A            J             10A  B 15 43DSPATR(UL)
     A            WONUMB        10A  B 15 57DSPATR(UL)
     A            WOB           10A  B 17 15DSPATR(UL)
     A            L             10A  B 17 29DSPATR(UL)
     A            WONUMD        10A  B 17 43DSPATR(UL)
     A            WOD           10A  B 17 57DSPATR(UL)
     A            COMMANDLN1    79   B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPRNTWO2
     A*%%TS  DD  19950201  112341  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                  4  7'ENTER THE WORK ORDER NUMBERS OF TH-
     A                                      E WORK ORDERS THAT YOU NEED TO HAVE'
     A                                  6 24'PRINTED AT YOUR CHARACTER PRINTER'
     A                                 20  7'PLACE AN "X" IN THIS BOX IF YOU WA-
     A                                      NT THE PRINTS TO GO TO THE ZONE'
     A                                 21  7'INSTEAD OF YOUR LOCAL CHARACTER PR-
     A                                      INTER'
     A            WONUM1        10A  B  9 15DSPATR(UL)
     A            WO1           10A  B  9 29DSPATR(UL)
     A            B             10A  B  9 43DSPATR(UL)
     A            WONUM3        10A  B  9 57DSPATR(UL)
     A            WO3           10A  B 11 15DSPATR(UL)
     A            D             10A  B 11 29DSPATR(UL)
     A            WONUM5        10A  B 11 43DSPATR(UL)
     A            WO5           10A  B 11 57DSPATR(UL)
     A            F             10A  B 13 15DSPATR(UL)
     A            WONUM7        10A  B 13 29DSPATR(UL)
     A            WO7           10A  B 13 43DSPATR(UL)
     A            H             10A  B 13 57DSPATR(UL)
     A            WONUM9        10A  B 15 15DSPATR(UL)
     A            WO9           10A  B 15 29DSPATR(UL)
     A            J             10A  B 15 43DSPATR(UL)
     A            WONUMB        10A  B 15 57DSPATR(UL)
     A            WOB           10A  B 17 15DSPATR(UL)
     A            L             10A  B 17 29DSPATR(UL)
     A            WONUMD        10A  B 17 43DSPATR(UL)
     A            WOD           10A  B 17 57DSPATR(UL)
     A            N              1A  B 21 47DSPATR(UL)
     A            COMMANDLN1    79   B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPURGE
     A*%%TS  DD  19950201  112341  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A  98                                  INVITE
     A                                  8 26'ENTER WORK ORDER TO BE DELETED '
     A                                 15 30'AND PRESS "ENTER" KEY'
     A            WOV6           6A  B 11 33DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            WOVYR          1A  B 11 40DSPATR(UL)
     A            WPVREM         3A  B 11 42DSPATR(UL)
     A            COMMANDLN     79A  O 24  1OVRDTA
     A  99        MESSAGELN     79   M      OVRDTA
     A          R FRETLAB1
     A*%%TS  DD  20030611  112828  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                  6  7'ENTER THE CRAFTSMAN"S NUMBER AND T-
     A                                      HE DATE THAT YOU WOULD LIKE TO'
     A                                  8 16'SEE WHICH WORK ORDERS THE CRAFTSMA-
     A                                      N WORKED ON'
     A                                 10 24'CLOCK CARD NO'
     A                                 12 24'DATE WORKED'
     A                                 12 47'(FORMAT:'
     A                                 12 63')'
     A                                 22  8'DEPRESS "F3" KEY TO END PROGRAM'
     A            CCNO           4A  B 10 39DSPATR(UL)
     A  08                                  DSPATR(PR)
     A                                      OVRDTA
     A            DAWORK         6A  B 12 39DSPATR(UL)
     A            FORMATL        6A  B 12 56DSPATR(PR)
     A                                      OVRDTA
     A  30        PRTDESC       28A  B 14 27DSPATR(PR)
     A            PRTNUM         2   B 15 40
     A  30                                  DSPATR(UL)
     A  31                                  DSPATR(PC)
     A  08                                  DSPATR(PR)
     A  30                                  CHECK(ME)
     A                                      OVRDTA
     A            COMMANDLN1    79   B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A*%%GP SCREEN1    01
     A          R FRETLAB2
     A*%%TS  DD  20030610  094621  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                 10 13'ENTER DATE/TIME FROM'
     A                                 10 48':'
     A                                 10 53'(FORMAT:'
     A                                 10 69')'
     A                                 12 13'ENTER DATE/TIME TO'
     A                                 12 48':'
     A                                 12 53'(FORMAT:'
     A                                 12 69')'
     A                                 14 18'ENTER SPECIFIC ZONE'
     A                                 14 46'(DEFAULT IS ALL ZONES)'
     A                                 22  8'DEPRESS "F3" KEY TO END PROGRAM'
     A            DATFRM         6A  B 10 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            TIMFRM         2A  B 10 45DSPATR(UL)
     A            TIMFRM2        2A  B 10 50DSPATR(UL)
     A            FORMTF         6A  B 10 62DSPATR(PR)
     A                                      OVRDTA
     A            DATETO         6A  B 12 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            TIMTO          2A  B 12 45DSPATR(UL)
     A            TIMTO2         2A  B 12 50DSPATR(UL)
     A            FORMTT         6A  B 12 62DSPATR(PR)
     A                                      OVRDTA
     A            SPZO           4A  B 14 38DSPATR(UL)
     A            COMMANDLN1    79   B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FRETPRNT
     A*%%TS  DD  20030609  160643  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A            DATALINE1     73A  B  2  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE2     73A  B  3  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE3     73A  B  4  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE4     73A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE5     73A  B  6  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE6     73A  B  7  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE7     73A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE8     73A  B  9  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE9     73A  B 10  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE10    73A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE11    73A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE12    73A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE13    73A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE14    73A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE15    73A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE16    73A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE17    73A  B 18  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE18    73A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE19    73A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            DATALINE20    73A  B 21  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79   B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A*%%GP UNTITLED   01
     A          R FRETSUBS
     A*%%TS  DD  19950201  112341  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                  5  8'ENTER THE EQUIPMENT TYPES THAT YOU'
     A                                  5 43'WOULD LIKE TO HAVE SUBSYSTEMS'
     A                                  7 17'RETRIEVED FOR AND DEPRESS THE "ENT-
     A                                      ER" KEY'
     A                                  9 23'DEPRESS "F3" TO EXIT PROGRAM'
     A            EQPTYPE1       8A  B 11 31DSPATR(UL)
     A                                      OVRDTA
     A            EQPTYPE2       8A  B 13 31DSPATR(UL)
     A                                      OVRDTA
     A            EQPTYPE3       8A  B 15 31DSPATR(UL)
     A                                      OVRDTA
     A            EQPTYPE4       8A  B 17 31DSPATR(UL)
     A                                      OVRDTA
     A            EQPTYPE5       8A  B 19 31DSPATR(UL)
     A                                      OVRDTA
     A            COMMANDLN1    79   B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FCHGRIME
     A*%%TS  DD  19950201  112341  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                  8  2'ENTER TYPE NUMBER YOU WISH TO CHAN-
     A                                      GE RIME VALUE'
     A                                  9  2'ENTER RIME NUMBER TO CHANGE TYPE E-
     A                                      NTRIES TO    '
     A                                 11  4'DEPRESS "ENTER" KEY TO PROCESS OR -
     A                                      F3 TO EXIT'
     A            RTYPE          8A  B  8 51DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            RRIME          2A  B  9 51DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            COMMANDLN1    79   O 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FSETZONE
     A*%%TS  DD  19950201  125226  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                  1  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A                                  3  3'REQUIRED  ENTER THE ZONE FOR WHICH-
     A                                       YOU WISH TO OBTAIN THE REPORT DATA-
     A                                      :'
     A            ZONE           4A  B  3 75DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                  4  3'INPUT:'
     A                                  5 13'NOTE:  IF ALL ZONES ARE DESIRED, T-
     A                                      YPE "ALL " IN THE INPUT FIELD.'
     A                                  7  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A                                  9  3'OPTIONAL  DEFAULT DATE AND TIME RA-
     A                                      NGE IS THE LAST FULL SHIFT BEFORE C-
     A                                      URRENT'
     A                                 10  3'INPUT:'
     A                                 11 13'TIME.  TO OVERRIDE DEFAULT, INPUT -
     A                                      DESIRED DATE AND TIME RANGE:'
     A                                 13  5'START OF RANGE:  DATE:'
     A            SM             2A  B 13 29OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                 13 32'/'
     A            SD             2A  B 13 34OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                 13 37'/'
     A            SY             2A  B 13 39OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                 13 44'TIME:'
     A            SH             2A  B 13 51OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                 13 54':'
     A            SS             2A  B 13 56OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            MDYHMS        16A  B 13 62DSPATR(PR)
     A                                 15  7'END OF RANGE:  DATE:'
     A            EM             2A  B 15 29OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A                                 15 32'/'
     A            ED             2A  B 15 34OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A                                 15 37'/'
     A            EY             2A  B 15 39OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A                                 15 44'TIME:'
     A            EH             2A  B 15 51OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                 15 54':'
     A            ES             2A  B 15 56OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            MDYHME        16A  B 15 62DSPATR(PR)
     A                                 17 11'TO RESTRICT SEARCH TO SPECIFIC CRA-
     A                                      FT DESIGNATIONS, ENTER UP TO'
     A                                 19 26'THREE CRAFTS HERE:'
     A            C1             2A  B 19 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            C2             2A  B 19 51DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            C3             2A  B 19 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A                                 21  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A                                 22 17'ENTER THE DATA ABOVE AND DEPRESS T-
     A                                      HE "ENTER" KEY.'
     A                                 23  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A            COMMANDLN1    79A  B 24  1DFTVAL('      F3 - EXIT PROGRAM    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FWOUPDAT
     A*%%TS  DD  19950201  112341  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                  9 26'INPUT WORK ORDER NUMBER'
     A                                 13 18'AND DEPRESS THE APPROPRIATE FUNCTI-
     A                                      ON KEY'
     A            WONUMB        10A  B 11 32DSPATR(UL)
     A            COMMANDLN1    79   O 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R LABRSCN1
     A*%%TS  DD  19950201  112341  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 26'------------------------------'
     A                                  3  1':'
     A                                  3 26'.'
     A                                  3 37'PLANNED'
     A                                  3 55'.'
     A                                  4  1':'
     A                                  4 26'.   WORK ORDER LABOR INPUT   .'
     A                                  5  1':'
     A                                  5 26'------------------------------'
     A                                  6  1':'
     A                                  7  1':'
     A                                  7 17'Work Order Number'
     A                                  7 53'Status Is'
     A                                  8  1':'
     A                                  9  1':'
     A                                  9 17'Date'
     A                                  9 30'Shift'
     A                                  9 38'Starts at'
     A                                  9 53'Ends at'
     A                                 10  1':'
     A                                 11  1':'
     A                                 11 18'CC Num'
     A                                 11 37'Time On'
     A                                 11 56'Time Off'
     A                                 12  1':'
     A                                 13  1':'
     A                                 14  1':'
     A                                 15  1':'
     A                                 16  1':'
     A                                 17  1':'
     A                                 18  1':'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1':'
     A                                 22 18'Enter Failure Code'
     A                                 22 46'to "CW" Work Order'
     A                                 23  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            WORKNUMBER     6A  B  7 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            WORKNUMYR      1A  B  7 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            WORKNUMSUF     3A  B  7 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            ST             2A  B  7 63DSPATR(PR)
     A            DATE           6A  B  9 22DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B  9 36DSPATR(PR)
     A                                      OVRDTA
     A            SSSS           4A  B  9 48DSPATR(PR)
     A                                      OVRDTA
     A            EEEE           4A  B  9 61DSPATR(PR)
     A                                      OVRDTA
     A            CC01           4A  B 13 19DSPATR(PR)
     A                                      OVRDTA
     A            ON01           4A  B 13 39DSPATR(PR)
     A                                      OVRDTA
     A            OFF1           4A  B 13 59DSPATR(PR)
     A                                      OVRDTA
     A            CC02           4A  B 14 19DSPATR(PR)
     A                                      OVRDTA
     A            ON02           4A  B 14 39DSPATR(PR)
     A                                      OVRDTA
     A            OFF2           4A  B 14 59DSPATR(PR)
     A                                      OVRDTA
     A            CC03           4A  B 15 19DSPATR(PR)
     A                                      OVRDTA
     A            ON03           4A  B 15 39DSPATR(PR)
     A                                      OVRDTA
     A            OFF3           4A  B 15 59DSPATR(PR)
     A                                      OVRDTA
     A            CC04           4A  B 16 19DSPATR(PR)
     A                                      OVRDTA
     A            ON04           4A  B 16 39DSPATR(PR)
     A                                      OVRDTA
     A            OFF4           4A  B 16 59DSPATR(PR)
     A                                      OVRDTA
     A            CC05           4A  B 17 19DSPATR(PR)
     A                                      OVRDTA
     A            ON05           4A  B 17 39DSPATR(PR)
     A                                      OVRDTA
     A            OFF5           4A  B 17 59DSPATR(PR)
     A                                      OVRDTA
     A            CC06           4A  B 18 19DSPATR(PR)
     A                                      OVRDTA
     A            ON06           4A  B 18 39DSPATR(PR)
     A                                      OVRDTA
     A            OFF6           4A  B 18 59DSPATR(PR)
     A                                      OVRDTA
     A            CC07           4A  B 19 19DSPATR(PR)
     A                                      OVRDTA
     A            ON07           4A  B 19 39DSPATR(PR)
     A                                      OVRDTA
     A            OFF7           4A  B 19 59DSPATR(PR)
     A                                      OVRDTA
     A            CC08           4A  B 20 19DSPATR(PR)
     A                                      OVRDTA
     A            ON08           4A  B 20 39DSPATR(PR)
     A                                      OVRDTA
     A            OFF8           4A  B 20 59DSPATR(PR)
     A                                      OVRDTA
     A            FLCODE         6A  B 22 38DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79   O 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R LABRSCN2
     A*%%TS  DD  19950201  112341  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 26'------------------------------'
     A                                  3  1':'
     A                                  3 26'.'
     A                                  3 37'PLANNED'
     A                                  3 55'.'
     A                                  4  1':'
     A                                  4 26'.   WORK ORDER LABOR INPUT   .'
     A                                  5  1':'
     A                                  5 26'------------------------------'
     A                                  6  1':'
     A                                  7  1':'
     A                                  7 17'Work Order Number'
     A                                  7 53'Status Is'
     A                                  8  1':'
     A                                  9  1':'
     A                                  9 17'Date'
     A                                  9 30'Shift'
     A                                  9 38'Starts at'
     A                                  9 53'Ends at'
     A                                 10  1':'
     A                                 11  1':'
     A                                 11 18'CC Num'
     A                                 11 37'Time On'
     A                                 11 56'Time Off'
     A                                 12  1':'
     A                                 13  1':'
     A                                 14  1':'
     A                                 15  1':'
     A                                 16  1':'
     A                                 17  1':'
     A                                 18  1':'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1':'
     A                                 22 18'Enter Failure Code'
     A                                 22 46'to "CW" Work Order'
     A                                 23  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            WORKNUMBER    10A  B  7 35DSPATR(PR)
     A                                      OVRDTA
     A            ST             2A  B  7 63DSPATR(PR)
     A                                      OVRDTA
     A            DATE           6A  B  9 22DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            S              1A  B  9 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            SSSS           4A  B  9 48DSPATR(PR)
     A                                      OVRDTA
     A            EEEE           4A  B  9 61DSPATR(PR)
     A                                      OVRDTA
     A            CC01           4A  B 13 19DSPATR(PR)
     A                                      OVRDTA
     A            ON01           4A  B 13 39DSPATR(PR)
     A                                      OVRDTA
     A            OFF1           4A  B 13 59DSPATR(PR)
     A                                      OVRDTA
     A            CC02           4A  B 14 19DSPATR(PR)
     A                                      OVRDTA
     A            ON02           4A  B 14 39DSPATR(PR)
     A                                      OVRDTA
     A            OFF2           4A  B 14 59DSPATR(PR)
     A                                      OVRDTA
     A            CC03           4A  B 15 19DSPATR(PR)
     A                                      OVRDTA
     A            ON03           4A  B 15 39DSPATR(PR)
     A                                      OVRDTA
     A            OFF3           4A  B 15 59DSPATR(PR)
     A                                      OVRDTA
     A            CC04           4A  B 16 19DSPATR(PR)
     A                                      OVRDTA
     A            ON04           4A  B 16 39DSPATR(PR)
     A                                      OVRDTA
     A            OFF4           4A  B 16 59DSPATR(PR)
     A                                      OVRDTA
     A            CC05           4A  B 17 19DSPATR(PR)
     A                                      OVRDTA
     A            ON05           4A  B 17 39DSPATR(PR)
     A                                      OVRDTA
     A            OFF5           4A  B 17 59DSPATR(PR)
     A                                      OVRDTA
     A            CC06           4A  B 18 19DSPATR(PR)
     A                                      OVRDTA
     A            ON06           4A  B 18 39DSPATR(PR)
     A                                      OVRDTA
     A            OFF6           4A  B 18 59DSPATR(PR)
     A                                      OVRDTA
     A            CC07           4A  B 19 19DSPATR(PR)
     A                                      OVRDTA
     A            ON07           4A  B 19 39DSPATR(PR)
     A                                      OVRDTA
     A            OFF7           4A  B 19 59DSPATR(PR)
     A                                      OVRDTA
     A            CC08           4A  B 20 19DSPATR(PR)
     A                                      OVRDTA
     A            ON08           4A  B 20 39DSPATR(PR)
     A                                      OVRDTA
     A            OFF8           4A  B 20 59DSPATR(PR)
     A                                      OVRDTA
     A            FLCODE         6A  B 22 38DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79   O 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R LABRSCN3
     A*%%TS  DD  19950201  112341  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A  98                                  INVITE
     A                                      CF01
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 26'------------------------------'
     A                                  3  1':'
     A                                  3 26'.'
     A                                  3 37'PLANNED'
     A                                  3 55'.'
     A                                  4  1':'
     A                                  4 26'.   WORK ORDER LABOR INPUT   .'
     A                                  5  1':'
     A                                  5 26'------------------------------'
     A                                  6  1':'
     A                                  7  1':'
     A                                  7 17'Work Order Number'
     A                                  7 53'Status Is'
     A                                  8  1':'
     A                                  9  1':'
     A                                  9 17'Date'
     A                                  9 30'Shift'
     A                                  9 38'Starts at'
     A                                  9 53'Ends at'
     A                                 10  1':'
     A                                 11  1':'
     A                                 11 18'CC Num'
     A                                 11 37'Time On'
     A                                 11 56'Time Off'
     A                                 12  1':'
     A                                 13  1':'
     A                                 14  1':'
     A                                 15  1':'
     A                                 16  1':'
     A                                 17  1':'
     A                                 18  1':'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1':'
     A                                 22 18'Enter Failure Code'
     A                                 22 46'to "CW" Work Order'
     A                                 23  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            WORKNUMBER    10A  B  7 35DSPATR(PR)
     A                                      OVRDTA
     A            ST             2A  B  7 63DSPATR(PR)
     A                                      OVRDTA
     A            DATE           6A  B  9 22DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B  9 36DSPATR(PR)
     A                                      OVRDTA
     A            SSSS           4A  B  9 48DSPATR(PR)
     A                                      OVRDTA
     A            EEEE           4A  B  9 61DSPATR(PR)
     A                                      OVRDTA
     A            CC01           4A  B 13 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            ON01           4A  B 13 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            OFF1           4A  B 13 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            CC02           4A  B 14 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            ON02           4A  B 14 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            OFF2           4A  B 14 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            CC03           4A  B 15 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            ON03           4A  B 15 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            OFF3           4A  B 15 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            CC04           4A  B 16 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            ON04           4A  B 16 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            OFF4           4A  B 16 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            CC05           4A  B 17 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            ON05           4A  B 17 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            OFF5           4A  B 17 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            CC06           4A  B 18 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            ON06           4A  B 18 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            OFF6           4A  B 18 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            CC07           4A  B 19 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            ON07           4A  B 19 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            OFF7           4A  B 19 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            CC08           4A  B 20 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            ON08           4A  B 20 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            OFF8           4A  B 20 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            FLCODE         6A  B 22 38DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79   O 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R LABRSCN4
     A*%%TS  DD  19950201  112341  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A  98                                  INVITE
     A                                      CF01
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 26'------------------------------'
     A                                  3  1':'
     A                                  3 26'.'
     A                                  3 37'PLANNED'
     A                                  3 55'.'
     A                                  4  1':'
     A                                  4 26'.   WORK ORDER LABOR INPUT   .'
     A                                  5  1':'
     A                                  5 26'------------------------------'
     A                                  6  1':'
     A                                  7  1':'
     A                                  7 17'Work Order Number'
     A                                  7 53'Status Is'
     A                                  8  1':'
     A                                  9  1':'
     A                                  9 17'Date'
     A                                  9 30'Shift'
     A                                  9 38'Starts at'
     A                                  9 53'Ends at'
     A                                 10  1':'
     A                                 11  1':'
     A                                 11 18'CC Num'
     A                                 11 37'Time On'
     A                                 11 56'Time Off'
     A                                 12  1':'
     A                                 13  1':'
     A                                 14  1':'
     A                                 15  1':'
     A                                 16  1':'
     A                                 17  1':'
     A                                 18  1':'
     A                                 19  1':'
     A                                 20  1':'
     A                                 21  1':'
     A                                 22  1':'
     A                                 22 18'Enter Failure Code'
     A                                 22 46'to "CW" Work Order'
     A                                 23  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            WORKNUMBER    10A  B  7 35DSPATR(PR)
     A                                      OVRDTA
     A            ST             2A  B  7 63DSPATR(PR)
     A                                      OVRDTA
     A            DATE           6A  B  9 22DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B  9 36DSPATR(PR)
     A                                      OVRDTA
     A            SSSS           4A  B  9 48DSPATR(PR)
     A                                      OVRDTA
     A            EEEE           4A  B  9 61DSPATR(PR)
     A                                      OVRDTA
     A            CC01           4A  B 13 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            ON01           4A  B 13 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            OFF1           4A  B 13 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            CC02           4A  B 14 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            ON02           4A  B 14 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            OFF2           4A  B 14 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            CC03           4A  B 15 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            ON03           4A  B 15 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            OFF3           4A  B 15 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            CC04           4A  B 16 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            ON04           4A  B 16 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            OFF4           4A  B 16 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            CC05           4A  B 17 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            ON05           4A  B 17 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            OFF5           4A  B 17 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            CC06           4A  B 18 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            ON06           4A  B 18 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            OFF6           4A  B 18 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            CC07           4A  B 19 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            ON07           4A  B 19 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            OFF7           4A  B 19 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            CC08           4A  B 20 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            ON08           4A  B 20 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            OFF8           4A  B 20 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            FLCODE         6A  B 22 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            COMMANDLN1    79   O 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R OFLOADLBR
     A*%%TS  DD  19950201  135536  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A  98                                  INVITE
     A                                  1 12'W O R K   O R D E R   L A B O R'
     A                                  1 46'I N P U T'
     A            HD             2A  B  1 64DSPATR(PR)
     A            HM             2A  B  1 67DSPATR(PR)
     A            HY             2A  B  1 70DSPATR(PR)
     A            HH             2A  B  1 74DSPATR(PR)
     A            HI             2A  B  1 77DSPATR(PR)
     A                                  3  7'DATE:'
     A            DM             2A  B  3 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            DD             2A  B  3 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            DY             2A  B  3 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A                                  3 35'SHIFT:'
     A            S              1A  B  3 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A                                  5  7'EMPLOYEE CC#:'
     A            ECC            4A  B  5 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A                                  5 35'EMPLOYEE NAME:'
     A            ENAM          16A  B  5 50DSPATR(PR)
     A                                      OVRDTA
     A                                  5 68'CRAFT:'
     A            CR             2A  B  5 75DSPATR(PR)
     A                                      OVRDTA
     A                                  7  7'W/O NUM:'
     A            WO7            7A  B  7 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            WOR            3A  B  7 24DSPATR(UL)
     A                                      OVRDTA
     A                                  7 35'TIME ON'
     A            TON1           4A  B  7 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A                                  7 50'TIME OFF'
     A            TOF1           4A  B  7 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A                                  8  7'W/O NUM:'
     A            WO72           7A  B  8 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            WR2            3A  B  8 24DSPATR(UL)
     A                                      OVRDTA
     A                                  8 35'TIME ON'
     A            TON2           4A  B  8 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A                                  8 50'TIME OFF'
     A            TOF2           4A  B  8 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                  9  7'W/O NUM:'
     A            WO73           7A  B  9 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            WR3            3A  B  9 24DSPATR(UL)
     A                                      OVRDTA
     A                                  9 35'TIME ON'
     A            TON3           4A  B  9 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A                                  9 50'TIME OFF'
     A            TOF3           4A  B  9 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A                                 10  7'W/O NUM:'
     A            WO74           7A  B 10 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            WR4            3A  B 10 24DSPATR(UL)
     A                                      OVRDTA
     A                                 10 35'TIME ON'
     A            TON4           4A  B 10 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A                                 10 50'TIME OFF'
     A            TOF4           4A  B 10 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A                                 11  7'W/O NUM:'
     A            WO75           7A  B 11 16DSPATR(UL)
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A                                      OVRDTA
     A            WR5            3A  B 11 24DSPATR(UL)
     A                                      OVRDTA
     A                                 11 35'TIME ON'
     A            TON5           4A  B 11 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                 11 50'TIME OFF'
     A            TOF5           4A  B 11 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A                                 12  7'W/O NUM:'
     A            WO76           7A  B 12 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            WR6            3A  B 12 24DSPATR(UL)
     A                                      OVRDTA
     A                                 12 35'TIME ON'
     A            TON6           4A  B 12 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A                                 12 50'TIME OFF'
     A            TOF6           4A  B 12 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A                                 13  7'W/O NUM:'
     A            WO77           7A  B 13 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            WR7            3A  B 13 24DSPATR(UL)
     A                                      OVRDTA
     A                                 13 35'TIME ON'
     A            TON7           4A  B 13 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A                                 13 50'TIME OFF'
     A            TOF7           4A  B 13 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A                                 14  7'W/O NUM:'
     A            WO78           7A  B 14 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            WR8            3A  B 14 24DSPATR(UL)
     A                                      OVRDTA
     A                                 14 35'TIME ON'
     A            TON8           4A  B 14 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A                                 14 50'TIME OFF'
     A            TOF8           4A  B 14 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A                                 15  7'W/O NUM:'
     A            WO79           7A  B 15 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A            WR9            3A  B 15 24DSPATR(UL)
     A                                      OVRDTA
     A                                 15 35'TIME ON'
     A            TON9           4A  B 15 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(PC)
     A                                 15 50'TIME OFF'
     A            TOF9           4A  B 15 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A                                 16  7'W/O NUM:'
     A            WO80           7A  B 16 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A            WR0            3A  B 16 24DSPATR(UL)
     A                                      OVRDTA
     A                                 16 35'TIME ON'
     A            TON0           4A  B 16 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A                                 16 50'TIME OFF'
     A            TOF0           4A  B 16 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A                                 19  1'ENTER ALL W/O"S THAT THE EMPLOYEE'
     A                                 19 35'WORKED ON AND PRESS THE "ENTER" KE-
     A                                      Y'
     A                                 20  1'IF THE EMPLOYEE WORKED ON MORE THA-
     A                                      N 10 W/O"S FILL IN THE SCREEN AND'
     A                                 20 69'PRESS THE'
     A                                 21  1'"ENTER" KEY - THE 10 ENTRIES WILL'
     A                                 21 35'BE PROCESSED AND THE SCREEN WILL B-
     A                                      E RESET TO'
     A                                 22  1'HANDLE 10 MORE NEW ENTRIES'
     A                                 23  1'PRESS F3 TO EXIT THE PROGRAM'
     A            COMMANDLN1    79   B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
