     A*%%TS  SD  19970918  151021  A257947     REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A          R PCATSFL                   SFL
     A*%%TS  SD  19970917  092635  A257947     REL-V3R7M0  5716-PW1
     A            FLD001        78A  B  7  2DSPATR(PR)
     A          R PCATSFLC                  SFLCTL(PCATSFL)
     A*%%TS  SD  19970917  140633  A257947     REL-V3R7M0  5716-PW1
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(0016)
     A                                      CA03(03 'EXIT')
     A                                      OVERLAY
     A                                      PUTOVR
     A  70                                  SFLDSP
     A  71                                  SFLDSPCTL
     A  72                                  SFLCLR
     A  73                                  SFLEND(*MORE)
     A                                  2 27'PRICE CATALOG CHANGE INQUIRY'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  4 10'EFFECT.'
     A                                  4 29'--- CURRENT ---'
     A                                  4 46'---- NEW ----'
     A                                  4 64'NET'
     A                                  4 72'APPLY'
     A                                  5  2'CODE'
     A                                  5 10'DATE'
     A                                  5 19'CATALOG #'
     A                                  5 34'PRICE'
     A                                  5 42'UM'
     A                                  5 49'PRICE'
     A                                  5 57'UM'
     A                                  5 63'CHANGE'
     A                                  5 72'DATE'
     A          R PCATREC
     A*%%TS  SD  19960205  115234  A257947     REL-V3R1M0  5763-PW1
     A                                 24  2'F3=EXIT'
     A          R PCATSCRN
     A*%%TS  SD  19970918  151021  A257947     REL-V3R7M0  5716-PW1
     A                                      CA03(03 'EXIT')
     A                                  2 27'PRICE CATALOG CHANGE INQUIRY'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  4  4'- Enter a date range, corporate co-
     A                                      de range, and/or percentage change.'
     A                                  5  9'(All are optional.)'
     A                                  6  4'- If you want to see ALL codes, le-
     A                                      ave all fields blank.'
     A                                  7  4'- To print the report, put an "X" -
     A                                      beside the last option, and enter'
     A                                  8  9'your name in the blank following.'
     A                                  9  3'==================================-
     A                                      ===================================-
     A                                      ======='
     A                                 11  5'Effective Date Range:'
     A            MD1            2A  B 11 30DSPATR(UL)
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            DM1            2A  B 11 33DSPATR(UL)
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            YY1            2A  B 11 36DSPATR(UL)
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A                                 11 41'to'
     A            MD2            2A  B 11 46DSPATR(UL)
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            DM2            2A  B 11 49DSPATR(UL)
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            YY2            2A  B 11 52DSPATR(UL)
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A                                 13  5'Corporate Code Range:'
     A            CODE1          7A  B 13 30DSPATR(UL)
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A                                 13 41'to'
     A            CODE2          7A  B 13 46DSPATR(UL)
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A                                 15  5'Change Greater than'
     A            PERCENT        2Y 0B 15 26EDTCDE(4)
     A                                      DSPATR(UL)
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                 15 29'%'
     A                                 17  3'==================================-
     A                                      ===================================-
     A                                      ======='
     A            RPTOPT         1A  B 19  5DSPATR(UL)
     A  21                                  DSPATR(RI)
     A                                      VALUES('X' ' ')
     A                                 19  8'Print Report'
     A                                 19 24'Route report to:'
     A            NAME          20A  B 19 42DSPATR(UL)
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A                                 24  5'F3=EXIT'
     A  60        MSGLINE       78   M
