     A*%%TS  SD  20021114  070747  A193138     REL-V5R1M0  5722-WDS
     A*  89/02/20  08:24:21    T881S03     REL-R01M02  5728-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A                                      CA03(03 'END PROGRAM')
     A          R FADDCODE
     A                                      PUTOVR
     A  98                                  INVITE
     A                                  2 26'-----------------------------'
     A                                  3 26':   ADD   ABSENCE   CODES   :'
     A                                  4 26'-----------------------------'
     A                                  7 39'Code'
     A                                 11 36'Description'
     A                                 17 15'Enter The Code To Be Added And Pre-
     A                                      ss The "Enter" Key'
     A                                 21 28'Press "f3" To End Program'
     A            CO             2A  B  9 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            DESC          30A  B 13 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FCODE
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                  2 18'-----------------------------------
     A                                      -------------'
     A                                  3 18': P E R S O N N E L   A B S E N C'
     A                                  3 52'E   C O D E :'
     A                                  4 18':'
     A                                  4 64':'
     A                                  5 18':'
     A                                  5 31'M A I N T E N A N C E'
     A                                  5 64':'
     A                                  6 18'-----------------------------------
     A                                      -------------'
     A                                 10 29'f1'
     A                                 10 41'List   Codes'
     A                                 12 29'f2'
     A                                 12 41'Add    Codes'
     A                                 14 29'f4'
     A                                 14 41'Delete Codes'
     A                                 16 29'f5'
     A                                 16 41'Modify Codes'
     A                                 18 29'f3'
     A                                 18 41'End  Program'
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FDELPCOD
     A                                      PUTOVR
     A  98                                  INVITE
     A                                  2 26'------------------------------'
     A                                  3 26':  DELETE   ABSENCE   CODES  :'
     A                                  4 26'------------------------------'
     A                                  7 39'Code'
     A                                 14 14'Enter The Code To Be Deleted And P-
     A                                      ress The "Enter" Key'
     A                                 18 28'Press "f3" To End Program'
     A            CO             2A  B  9 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FITEM
     A                                      PUTOVR
     A                                      CF01
     A                                      CF05
     A  98                                  INVITE
     A                                  1  3'-----------------------------------
     A                                      ------------------------------------
     A                                      --------'
     A                                  2  3': P E R S O N N E L   I T E M   D'
     A                                  2 37'E F I N I T I O N   M A I N T E N'
     A                                  2 71'A N C E :'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      --------'
     A                                  5 19'Item  1 ---->'
     A                                  7 19'Item  2 ---->'
     A                                  9 19'Item  3 ---->'
     A                                 11 19'Item  4 ---->'
     A                                 13 19'Item  5 ---->'
     A                                 15 19'Item  6 ---->'
     A                                 17 19'Item  7 ---->'
     A                                 19 19'Item  8 ---->'
     A                                 21 19'Item  9 ---->'
     A                                 23 19'Item 10 ---->'
     A            D01           30A  B  5 33DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            D02           30A  B  7 33DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            D03           30A  B  9 33DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            D04           30A  B 11 33DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            D05           30A  B 13 33DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            D06           30A  B 15 33DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            D07           30A  B 17 33DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            D08           30A  B 19 33DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            D09           30A  B 21 33DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            D010          30A  B 23 33DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FITEMHLP
     A                                      PUTOVR
     A                                  2 26'PERSONNEL ITEM DEFINITION HELP'
     A                                  4  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  5  1'-     Use the previous screen to d-
     A                                      efine the items you are going to us-
     A                                      e for     '
     A                                  6  1'-     personnel identification. Th-
     A                                      e actual values of these items will-
     A                                       be'
     A                                  7  1'-     input thru the personnel ide-
     A                                      ntification add and modify programs-
     A                                      .'
     A                                  8  1'-     Each of the ten items can ha-
     A                                      ve up to a 20 byte value. The purpo-
     A                                      se'
     A                                  9  1'-     here is to associate a 30 by-
     A                                      te definition for each item you pla-
     A                                      n to      '
     A                                 10  1'-     use.'
     A                                 11  1'-'
     A                                 12  1'-     The previous screen is to be'
     A                                 12 36'used for all item definition updat-
     A                                      es.'
     A                                 13  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FLSTCODE
     A                                      PUTOVR
     A                                      CF01
     A                                  1 15'-----------------------------------
     A                                      ------------------'
     A                                  2 15':  P E R S O N N E L   A B S E N C'
     A                                  2 50'E    C O D E S  :'
     A                                  3 15'-----------------------------------
     A                                      ------------------'
     A                                  6  4'Code Description'
     A                                  6 43'Code Description'
     A                                  7  4'---- ------------------------------
     A                                      -    ---- --------------------------
     A                                      -----'
     A                                 10  4'-----------------------------------
     A                                      -    -------------------------------
     A                                      -----'
     A                                 12  4'-----------------------------------
     A                                      -    -------------------------------
     A                                      -----'
     A                                 14  4'-----------------------------------
     A                                      -    -------------------------------
     A                                      -----'
     A                                 16  4'-----------------------------------
     A                                      -    -------------------------------
     A                                      -----'
     A                                 18  4'-----------------------------------
     A                                      -    -------------------------------
     A                                      -----'
     A                                 20  4'-----------------------------------
     A                                      -    -------------------------------
     A                                      -----'
     A                                 23 19'Press "f1" To Continue Or "f3" To'
     A                                 23 53'End Program'
     A            C1             2A  B  9  4DSPATR(PR)
     A                                      OVRDTA
     A            D1            30A  B  9  9DSPATR(PR)
     A                                      OVRDTA
     A            C2             2A  B  9 43DSPATR(PR)
     A                                      OVRDTA
     A            D2            30A  B  9 48DSPATR(PR)
     A                                      OVRDTA
     A            C3             2A  B 11  4DSPATR(PR)
     A                                      OVRDTA
     A            D3            30A  B 11  9DSPATR(PR)
     A                                      OVRDTA
     A            C4             2A  B 11 43DSPATR(PR)
     A                                      OVRDTA
     A            D4            30A  B 11 48DSPATR(PR)
     A                                      OVRDTA
     A            C5             2A  B 13  4DSPATR(PR)
     A                                      OVRDTA
     A            D5            30A  B 13  9DSPATR(PR)
     A                                      OVRDTA
     A            C6             2A  B 13 43DSPATR(PR)
     A                                      OVRDTA
     A            D6            30A  B 13 48DSPATR(PR)
     A                                      OVRDTA
     A            C7             2A  B 15  4DSPATR(PR)
     A                                      OVRDTA
     A            D7            30A  B 15  9DSPATR(PR)
     A                                      OVRDTA
     A            C8             2A  B 15 43DSPATR(PR)
     A                                      OVRDTA
     A            D8            30A  B 15 48DSPATR(PR)
     A                                      OVRDTA
     A            C9             2A  B 17  4DSPATR(PR)
     A                                      OVRDTA
     A            D9            30A  B 17  9DSPATR(PR)
     A                                      OVRDTA
     A            C0             2A  B 17 43DSPATR(PR)
     A                                      OVRDTA
     A            D0            30A  B 17 48DSPATR(PR)
     A                                      OVRDTA
     A            CA             2A  B 19  4DSPATR(PR)
     A                                      OVRDTA
     A            DA            30A  B 19  9DSPATR(PR)
     A                                      OVRDTA
     A            CB             2A  B 19 43DSPATR(PR)
     A                                      OVRDTA
     A            DB            30A  B 19 48DSPATR(PR)
     A                                      OVRDTA
     A            CC             2A  B 21  4DSPATR(PR)
     A                                      OVRDTA
     A            DC            30A  B 21  9DSPATR(PR)
     A                                      OVRDTA
     A            CD             2A  B 21 43DSPATR(PR)
     A                                      OVRDTA
     A            DD            30A  B 21 48DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FMODCODE
     A                                      PUTOVR
     A  98                                  INVITE
     A                                  2 26'-----------------------------'
     A                                  3 26': MODIFY  CODE  DESCRIPTION :'
     A                                  4 26'-----------------------------'
     A                                  7 39'Code'
     A                                 11 36'Description'
     A                                 17 21'Enter The Code And Press The "Ente-
     A                                      r" Key'
     A                                 18 30'Modify The Description'
     A                                 19 30'Press The  "Enter" Key'
     A                                 21 28'Press "f3" To End Program'
     A            CO             2A  B  9 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            DESC          30A  B 13 26DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FMODCODA
     A                                      PUTOVR
     A  98                                  INVITE
     A                                  2 26'-----------------------------'
     A                                  3 26': MODIFY  CODE  DESCRIPTION :'
     A                                  4 26'-----------------------------'
     A                                  7 39'Code'
     A                                 11 36'Description'
     A                                 17 21'Enter The Code And Press The "Ente-
     A                                      r" Key'
     A                                 18 30'Modify The Description'
     A                                 19 30'Press The  "Enter" Key'
     A                                 21 28'Press "f3" To End Program'
     A            CO             2A  B  9 40DSPATR(PR)
     A                                      OVRDTA
     A            DESC          30A  B 13 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPADD
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                  2 24'**********************************'
     A                                  3 24'*  A D D      P E R S O N N E L  *'
     A                                  4 24'**********************************'
     A                                  7 22'f1  Basic'
     A                                  7 49'Information'
     A                                  9 22'f2  Absence'
     A                                  9 49'Information'
     A                                 11 22'f4  Training & Experience  Informa-
     A                                      tion'
     A                                 13 22'f5  Identification'
     A                                 13 49'Information'
     A                                 16 20'Enter Clock Card And Press The Des-
     A                                      ired Key'
     A                                 17 20'**********************************-
     A                                      ********'
     A            CC             4A  B 19 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPADD1
     A*%%TS  SD  20021114  070747  A193138     REL-V5R1M0  5722-WDS
     A                                      PUTOVR
     A  98                                  INVITE
     A                                  2  8'**********************************-
     A                                      *********************************'
     A                                  3  8': A D D   B A S I C   C L O C K'
     A                                  3 42'C A R D   I N F O R M A T I O N :'
     A                                  4  8'**********************************-
     A                                      *********************************'
     A                                  8  3'CC    EMPLOYEE....NAME  CSD     CR-
     A                                      AFT  ZONE  DEPT  LABOR..RATE  CLASS-
     A                                         SHIFT'
     A                                  9  3'NUM'
     A                                  9 67'RATING  /CREW'
     A                                 17 21'**********************************-
     A                                      ******'
     A                                 18 21': Input Data And Press The "Enter"'
     A                                 18 56'Key :'
     A                                 19 21'**********************************-
     A                                      ******'
     A            MDORDM         6A  B  9 27DSPATR(PR)
     A                                      OVRDTA
     A            CC             4A  B 12  3DSPATR(PR)
     A                                      OVRDTA
     A            NAME          16A  B 12  9DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            CSD            6A  B 12 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            CR             2A  B 12 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            ZONE           4A  B 12 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            DEPT           4A  B 12 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            DDDDDD        10Y 4B 12 54EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            CL             2A  B 12 71DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            S              1A  B 12 77DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            C              1A  B 12 79DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A                                 14  3'USER ID: '
     A            USRID         10   B 14 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPADD2
     A                                      PUTOVR
     A  98                                  INVITE
     A                                  1 25'A D D   A B S E N C E   D A T A'
     A                                  1 73'Year'
     A                                  2 71'Screen'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A            CC             4A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            YR             2A  B  1 78DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            P              1A  B  2 79DSPATR(PR)
     A                                      OVRDTA
     A            TITLE         78A  B  4  2DSPATR(PR)
     A                                      OVRDTA
     A            A1            10A  B  5  2DSPATR(PR)
     A                                      OVRDTA
     A            A2            10A  B  5 19DSPATR(PR)
     A                                      OVRDTA
     A            A3            10A  B  5 36DSPATR(PR)
     A                                      OVRDTA
     A            A4            10A  B  5 53DSPATR(PR)
     A                                      OVRDTA
     A            A5            10A  B  5 70DSPATR(PR)
     A                                      OVRDTA
     A            A6            10A  B  7  2DSPATR(PR)
     A                                      OVRDTA
     A            A7            10A  B  7 19DSPATR(PR)
     A                                      OVRDTA
     A            A8            10A  B  7 36DSPATR(PR)
     A                                      OVRDTA
     A            A9            10A  B  7 53DSPATR(PR)
     A                                      OVRDTA
     A            A10           10A  B  7 70DSPATR(PR)
     A                                      OVRDTA
     A            A11           10A  B  9  2DSPATR(PR)
     A                                      OVRDTA
     A            A12           10A  B  9 19DSPATR(PR)
     A                                      OVRDTA
     A            A13           10A  B  9 36DSPATR(PR)
     A                                      OVRDTA
     A            A14           10A  B  9 53DSPATR(PR)
     A                                      OVRDTA
     A            A15           10A  B  9 70DSPATR(PR)
     A                                      OVRDTA
     A            A16           10A  B 11  2DSPATR(PR)
     A                                      OVRDTA
     A            A17           10A  B 11 19DSPATR(PR)
     A                                      OVRDTA
     A            A18           10A  B 11 36DSPATR(PR)
     A                                      OVRDTA
     A            A19           10A  B 11 53DSPATR(PR)
     A                                      OVRDTA
     A            A20           10A  B 11 70DSPATR(PR)
     A                                      OVRDTA
     A            A21           10A  B 13  2DSPATR(PR)
     A                                      OVRDTA
     A            A22           10A  B 13 19DSPATR(PR)
     A                                      OVRDTA
     A            A23           10A  B 13 36DSPATR(PR)
     A                                      OVRDTA
     A            A24           10A  B 13 53DSPATR(PR)
     A                                      OVRDTA
     A            A25           10A  B 13 70DSPATR(PR)
     A                                      OVRDTA
     A            A26           10A  B 15  2DSPATR(PR)
     A                                      OVRDTA
     A            A27           10A  B 15 19DSPATR(PR)
     A                                      OVRDTA
     A            A28           10A  B 15 36DSPATR(PR)
     A                                      OVRDTA
     A            A29           10A  B 15 53DSPATR(PR)
     A                                      OVRDTA
     A            A30           10A  B 15 70DSPATR(PR)
     A                                      OVRDTA
     A            A31           10A  B 17  2DSPATR(PR)
     A                                      OVRDTA
     A            A32           10A  B 17 19DSPATR(PR)
     A                                      OVRDTA
     A            A33           10A  B 17 36DSPATR(PR)
     A                                      OVRDTA
     A            A34           10A  B 17 53DSPATR(PR)
     A                                      OVRDTA
     A            A35           10A  B 17 70DSPATR(PR)
     A                                      OVRDTA
     A            A36           10A  B 19  2DSPATR(PR)
     A                                      OVRDTA
     A            A37           10A  B 19 19DSPATR(PR)
     A                                      OVRDTA
     A            A38           10A  B 19 36DSPATR(PR)
     A                                      OVRDTA
     A            A39           10A  B 19 53DSPATR(PR)
     A                                      OVRDTA
     A            A40           10A  B 19 70DSPATR(PR)
     A                                      OVRDTA
     A            A41           10A  B 21  2DSPATR(PR)
     A                                      OVRDTA
     A            A42           10A  B 21 19DSPATR(PR)
     A                                      OVRDTA
     A            A43           10A  B 21 36DSPATR(PR)
     A                                      OVRDTA
     A            A44           10A  B 21 53DSPATR(PR)
     A                                      OVRDTA
     A            A45           10A  B 21 70DSPATR(PR)
     A                                      OVRDTA
     A            A46           10A  B 23  2DSPATR(PR)
     A                                      OVRDTA
     A            A47           10A  B 23 19DSPATR(PR)
     A                                      OVRDTA
     A            A48           10A  B 23 36DSPATR(PR)
     A                                      OVRDTA
     A            A49           10A  B 23 53DSPATR(PR)
     A                                      OVRDTA
     A            A50           10A  B 23 70DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPADD2A
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF07
     A                                  1 25'A D D   A B S E N C E   D A T A'
     A                                  1 73'Year'
     A                                  2 71'Screen'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A            CC             4A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            YR             2A  B  1 78DSPATR(PR)
     A                                      OVRDTA
     A            P              1A  B  2 79DSPATR(PR)
     A                                      OVRDTA
     A            TITLE         78A  B  4  2DSPATR(PR)
     A                                      OVRDTA
     A            A1            10A  B  5  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            A2            10A  B  5 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            A3            10A  B  5 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            A4            10A  B  5 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            A5            10A  B  5 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            A6            10A  B  7  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            A7            10A  B  7 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            A8            10A  B  7 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            A9            10A  B  7 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            A10           10A  B  7 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            A11           10A  B  9  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            A12           10A  B  9 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            A13           10A  B  9 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            A14           10A  B  9 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            A15           10A  B  9 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            A16           10A  B 11  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            A17           10A  B 11 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            A18           10A  B 11 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            A19           10A  B 11 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            A20           10A  B 11 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            A21           10A  B 13  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            A22           10A  B 13 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            A23           10A  B 13 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            A24           10A  B 13 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            A25           10A  B 13 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            A26           10A  B 15  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            A27           10A  B 15 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            A28           10A  B 15 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            A29           10A  B 15 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            A30           10A  B 15 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            A31           10A  B 17  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            A32           10A  B 17 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            A33           10A  B 17 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            A34           10A  B 17 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            A35           10A  B 17 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            A36           10A  B 19  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            A37           10A  B 19 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            A38           10A  B 19 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A            A39           10A  B 19 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            A40           10A  B 19 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            A41           10A  B 21  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A            A42           10A  B 21 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A            A43           10A  B 21 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A            A44           10A  B 21 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A            A45           10A  B 21 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A            A46           10A  B 23  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(PC)
     A            A47           10A  B 23 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A            A48           10A  B 23 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A            A49           10A  B 23 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A            A50           10A  B 23 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPADD3
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A  98                                  INVITE
     A                                  1  9'A D D   T R A I N I N G   A N D'
     A                                  1 43'E X P E R I E N C E   D A T A'
     A                                  3  2'CC'
     A                                  3 71'SCREEN'
     A                                 21  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 22  1'"This screen is intended for state-
     A                                      d purposes only --- Do not use this-
     A                                       screen for'
     A                                 23  2'any other data regarding this indi-
     A                                      vidual" -GOODYEAR CORPORATE LEGAL'
     A                                 23 70'DEPARTMENT'
     A            CC             4A  B  3  5DSPATR(PR)
     A                                      OVRDTA
     A            NO             2A  B  3 78DSPATR(PR)
     A                                      OVRDTA
     A            T1            66A  B  5  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            T2            66A  B  6  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            T3            66A  B  7  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            T4            66A  B  8  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            T5            66A  B  9  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            T6            66A  B 10  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            T7            66A  B 11  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            T8            66A  B 12  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            T9            66A  B 13  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            T10           66A  B 14  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            T11           66A  B 15  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            T12           66A  B 16  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            T13           66A  B 17  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            T14           66A  B 18  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            T15           66A  B 19  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPADD3A
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A  98                                  INVITE
     A                                  1  9'A D D   T R A I N I N G   A N D'
     A                                  1 43'E X P E R I E N C E   D A T A'
     A                                  3  2'CC'
     A                                  3 71'SCREEN'
     A                                 21  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 22  1'"This screen is intended for state-
     A                                      d purposes only --- Do not use this-
     A                                       screen for'
     A                                 23  2'any other data regarding this indi-
     A                                      vidual" -GOODYEAR CORPORATE LEGAL'
     A                                 23 71'DEPARTMENT'
     A            CC             4A  B  3  5DSPATR(PR)
     A                                      OVRDTA
     A            NO             2Y 0B  3 78DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            T1            66A  B  5  8DSPATR(PR)
     A                                      OVRDTA
     A            T2            66A  B  6  8DSPATR(PR)
     A                                      OVRDTA
     A            T3            66A  B  7  8DSPATR(PR)
     A                                      OVRDTA
     A            T4            66A  B  8  8DSPATR(PR)
     A                                      OVRDTA
     A            T5            66A  B  9  8DSPATR(PR)
     A                                      OVRDTA
     A            T6            66A  B 10  8DSPATR(PR)
     A                                      OVRDTA
     A            T7            66A  B 11  8DSPATR(PR)
     A                                      OVRDTA
     A            T8            66A  B 12  8DSPATR(PR)
     A                                      OVRDTA
     A            T9            66A  B 13  8DSPATR(PR)
     A                                      OVRDTA
     A            T10           66A  B 14  8DSPATR(PR)
     A                                      OVRDTA
     A            T11           66A  B 15  8DSPATR(PR)
     A                                      OVRDTA
     A            T12           66A  B 16  8DSPATR(PR)
     A                                      OVRDTA
     A            T13           66A  B 17  8DSPATR(PR)
     A                                      OVRDTA
     A            T14           66A  B 18  8DSPATR(PR)
     A                                      OVRDTA
     A            T15           66A  B 19  8DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPADD4
     A                                      PUTOVR
     A  98                                  INVITE
     A                                      CF05
     A                                  1 19'A D D   I D E N T I F I C A T I O'
     A                                  1 53'N   D A T A'
     A                                  2  8'Item 1  is'
     A                                  4  8'Item 2  is'
     A                                  6  8'Item 3  is'
     A                                  8  8'Item 4  is'
     A                                 10  8'Item 5  is'
     A                                 12  8'Item 6  is'
     A                                 14  8'Item 7  is'
     A                                 16  8'Item 8  is'
     A                                 18  8'Item 9  is'
     A                                 20  8'Item10  is'
     A                                 21  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 22  1'"This screen is intended for state-
     A                                      d purposes only --- Do not use this-
     A                                       screen for'
     A                                 23  2'any other data regarding this indi-
     A                                      vidual" -GOODYEAR CORPORATE LEGAL'
     A                                 23 70'DEPARTMENT'
     A            CC             4A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            D1            30A  B  2 21DSPATR(PR)
     A                                      OVRDTA
     A            V1            20A  B  2 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            D2            30A  B  4 21DSPATR(PR)
     A                                      OVRDTA
     A            V2            20A  B  4 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            D3            30A  B  6 21DSPATR(PR)
     A                                      OVRDTA
     A            V3            20A  B  6 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            D4            30A  B  8 21DSPATR(PR)
     A                                      OVRDTA
     A            V4            20A  B  8 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            D5            30A  B 10 21DSPATR(PR)
     A                                      OVRDTA
     A            V5            20A  B 10 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            D6            30A  B 12 21DSPATR(PR)
     A                                      OVRDTA
     A            V6            20A  B 12 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            D7            30A  B 14 21DSPATR(PR)
     A                                      OVRDTA
     A            V7            20A  B 14 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            D8            30A  B 16 21DSPATR(PR)
     A                                      OVRDTA
     A            V8            20A  B 16 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            D9            30A  B 18 21DSPATR(PR)
     A                                      OVRDTA
     A            V9            20A  B 18 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            D10           30A  B 20 21DSPATR(PR)
     A                                      OVRDTA
     A            V10           20A  B 20 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPCHG
     A                                      PUTOVR
     A  98                                  INVITE
     A                                  2 23'-----------------------------------
     A                                      ---'
     A                                  3 23':  C H A N G E  C L O C K  C A R D'
     A                                  3 59':'
     A                                  4 23':'
     A                                  4 59':'
     A                                  5 23':'
     A                                  5 35'N U M B E R'
     A                                  5 59':'
     A                                  6 23'-----------------------------------
     A                                      ---'
     A                                  9 16'Change Old CC Number '
     A                                  9 43'" To New CC Number'
     A                                 12 20'Enter Clock Cards And Press The "E-
     A                                      nter" Key'
     A            CC01           4A  B  9 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            CC02           4A  B  9 62DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPCONSEC
     A                                      PUTOVR
     A  98                                  INVITE
     A                                  2 18'-----------------------------------
     A                                      -----------'
     A                                  3 18': C O N S E C U T I V E   D A Y'
     A                                  3 52'I N P U T :'
     A                                  4 18'-----------------------------------
     A                                      -----------'
     A                                  7 10'START DATE'
     A                                  9 10'NUMBER OF DAYS'
     A                                 11 10'ABSENCE CODE'
     A                                 13 10'HOURS'
     A                                 15 27'S   M   T   W   T   F   S'
     A                                 16 10'EXCLUDE DAYS'
     A                                 19  1'..................................-
     A                                      ...................................-
     A                                      ...........'
     A                                 21  1'Press "Enter" to load the consecut-
     A                                      ive days that you specify. View the-
     A                                       data afte'
     A                                 22  1'it is loaded to make sure it is wh-
     A                                      at you want.'
     A            DDDDDD         6A  B  7 22DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            NN             2A  B  9 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            AA             2A  B 11 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            HH             2A  B 13 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            A              1A  B 16 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            B              1A  B 16 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            C              1A  B 16 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            D              1A  B 16 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            E              1A  B 16 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            F              1A  B 16 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            G              1A  B 16 51DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPCREW
     A                                      PUTOVR
     A  98                                  INVITE
     A                                  3  5'-----------------------------------
     A                                      ------------------------------------
     A                                      --'
     A                                  4  5': C H A N G E   P E R S O N N E L'
     A                                  4 43'C R E W   A S S I G N M E N T S :'
     A                                  5  5'-----------------------------------
     A                                      ------------------------------------
     A                                      --'
     A                                  9 26'Change  Crew'
     A                                  9 41'to  Crew'
     A                                 10 26'-------------------------'
     A                                 13 15'RESTRICT THE CHANGE BASED ON THE F-
     A                                      OLLOWING CRITERIA'
     A                                 16 15'ZONE'
     A                                 16 38'DEPT'
     A                                 16 61'CRAFT'
     A            A              1A  B  9 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            B              1A  B  9 50DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            ZONE           4A  B 18 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            DEPT           4A  B 18 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            CR             2A  B 18 64DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPDEL
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A  98                                  INVITE
     A                                  2 22'-----------------------------------
     A                                      ----'
     A                                  3 22':  D E L E T E    P E R S O N N E'
     A                                  3 56'L  :'
     A                                  4 22'-----------------------------------
     A                                      ----'
     A                                  7 22'f1  All CC'
     A                                  7 49'Information'
     A                                  9 22'f2  Absence'
     A                                  9 49'Information'
     A                                 10 26'ENTER YEAR OR "AL" FOR ALL'
     A                                 12 22'f4  Training & Experience  Informa-
     A                                      tion'
     A                                 13 26'ENTER PAGE OR "AL" FOR ALL'
     A                                 15 22'f5  Identification'
     A                                 15 49'Information'
     A                                 18 20'Enter Clock Card And Press The Des-
     A                                      ired Key'
     A                                 19 20'-----------------------------------
     A                                      --------'
     A            YR             2A  B 10 58DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            PG             2A  B 13 58DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            CC             4A  B 21 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPDELABS
     A                                      PUTOVR
     A  98                                  INVITE
     A                                  2 26'------------------------------'
     A                                  3 26':  DELETE   ABSENCE   DATA   :'
     A                                  4 26'------------------------------'
     A                                  7 39'Year'
     A                                 14 14'Enter The Year To Be Deleted And P-
     A                                      ress The "Enter" Key'
     A                                 18 28'Press "f3" To End Program'
     A            YRCO           2A  B  9 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            COMMANDLN1    79A  O 24  1DSPATR(BL)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPDISP1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A  98                                  INVITE
     A                                  2 13'-----------------------------------
     A                                      ----------------------'
     A                                  3 13':  D I S P L A Y  /  M O D I F Y'
     A                                  3 49'P E R S O N N E L  :'
     A                                  4 13'-----------------------------------
     A                                      ----------------------'
     A                                  7 22'f1  Basic'
     A                                  7 49'Information'
     A                                  9 22'f2  Absence'
     A                                  9 49'Information'
     A                                 11 22'f4  Training & Experience  Informa-
     A                                      tion'
     A                                 13 22'f5  Identification'
     A                                 13 49'Information'
     A                                 16 20'Enter Clock Card And Press The Des-
     A                                      ired Key'
     A                                 17 20'-----------------------------------
     A                                      --------'
     A            CC             4A  B 19 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPDISP1A
     A                                      PUTOVR
     A                                      CF05
     A  98                                  INVITE
     A                                  2 12'-----------------------------------
     A                                      -------------------------'
     A                                  3 12': B A S I C   C L O C K   C A R D'
     A                                  3 48'I N F O R M A T I O N :'
     A                                  4 12'-----------------------------------
     A                                      -------------------------'
     A                                  8  3'CC    EMPLOYEE....NAME  CSD     CR-
     A                                      AFT  ZONE  DEPT  LABOR..RATE  CLASS-
     A                                         SHIFT'
     A                                  9  3'NUM'
     A                                  9 67'RATING  /CREW'
     A            MDORDM         6A  B  9 27DSPATR(PR)
     A                                      OVRDTA
     A            CC             4A  B 12  3DSPATR(PR)
     A                                      OVRDTA
     A            NAME          16A  B 12  9DSPATR(PR)
     A                                      OVRDTA
     A            CSD            6A  B 12 27DSPATR(PR)
     A                                      OVRDTA
     A            CR             2A  B 12 38DSPATR(PR)
     A                                      OVRDTA
     A            ZONE           4A  B 12 42DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B 12 48DSPATR(PR)
     A                                      OVRDTA
     A            DDDDDD        10Y04B 12 54EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            CL             2A  B 12 71DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B 12 77DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 12 79DSPATR(PR)
     A                                      OVRDTA
     A                                 14  3'USER ID:'
     A            USRID         10A  B 14 13DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPDISP1B
     A                                      PUTOVR
     A  98                                  INVITE
     A                                  2 12'-----------------------------------
     A                                      -------------------------'
     A                                  3 12': B A S I C   C L O C K   C A R D'
     A                                  3 48'I N F O R M A T I O N :'
     A                                  4 12'-----------------------------------
     A                                      -------------------------'
     A                                  8  3'CC    EMPLOYEE....NAME  CSD     CR-
     A                                      AFT  ZONE  DEPT  LABOR..RATE  CLASS-
     A                                         SHIFT'
     A                                  9  3'NUM'
     A                                  9 67'RATING  /CREW'
     A            MDORDM         6A  B  9 27DSPATR(PR)
     A                                      OVRDTA
     A            CC             4A  B 12  3DSPATR(PR)
     A                                      OVRDTA
     A            NAME          16A  B 12  9DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            CSD            6A  B 12 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            CR             2A  B 12 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            ZONE           4A  B 12 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            DEPT           4A  B 12 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            DDDDDD        10Y04B 12 54EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            CL             2A  B 12 71DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            S              1A  B 12 77DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            C              1A  B 12 79DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A                                 14  3'USER ID:'
     A            USRID         10A  B 14 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPDISP2
     A                                      PUTOVR
     A  98                                  INVITE
     A                                  1 17'P E R S O N N E L    A B S E N C E'
     A                                  1 55'D A T A'
     A                                  1 73'Year'
     A                                  2 71'Screen'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A            CC             4A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            YR             2A  B  1 78DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A            P              1A  B  2 79DSPATR(PR)
     A                                      OVRDTA
     A            TITLE         78A  B  4  2DSPATR(PR)
     A                                      OVRDTA
     A            A1            10A  B  5  2DSPATR(PR)
     A                                      OVRDTA
     A            A2            10A  B  5 19DSPATR(PR)
     A                                      OVRDTA
     A            A3            10A  B  5 36DSPATR(PR)
     A                                      OVRDTA
     A            A4            10A  B  5 53DSPATR(PR)
     A                                      OVRDTA
     A            A5            10A  B  5 70DSPATR(PR)
     A                                      OVRDTA
     A            A6            10A  B  7  2DSPATR(PR)
     A                                      OVRDTA
     A            A7            10A  B  7 19DSPATR(PR)
     A                                      OVRDTA
     A            A8            10A  B  7 36DSPATR(PR)
     A                                      OVRDTA
     A            A9            10A  B  7 53DSPATR(PR)
     A                                      OVRDTA
     A            A10           10A  B  7 70DSPATR(PR)
     A                                      OVRDTA
     A            A11           10A  B  9  2DSPATR(PR)
     A                                      OVRDTA
     A            A12           10A  B  9 19DSPATR(PR)
     A                                      OVRDTA
     A            A13           10A  B  9 36DSPATR(PR)
     A                                      OVRDTA
     A            A14           10A  B  9 53DSPATR(PR)
     A                                      OVRDTA
     A            A15           10A  B  9 70DSPATR(PR)
     A                                      OVRDTA
     A            A16           10A  B 11  2DSPATR(PR)
     A                                      OVRDTA
     A            A17           10A  B 11 19DSPATR(PR)
     A                                      OVRDTA
     A            A18           10A  B 11 36DSPATR(PR)
     A                                      OVRDTA
     A            A19           10A  B 11 53DSPATR(PR)
     A                                      OVRDTA
     A            A20           10A  B 11 70DSPATR(PR)
     A                                      OVRDTA
     A            A21           10A  B 13  2DSPATR(PR)
     A                                      OVRDTA
     A            A22           10A  B 13 19DSPATR(PR)
     A                                      OVRDTA
     A            A23           10A  B 13 36DSPATR(PR)
     A                                      OVRDTA
     A            A24           10A  B 13 53DSPATR(PR)
     A                                      OVRDTA
     A            A25           10A  B 13 70DSPATR(PR)
     A                                      OVRDTA
     A            A26           10A  B 15  2DSPATR(PR)
     A                                      OVRDTA
     A            A27           10A  B 15 19DSPATR(PR)
     A                                      OVRDTA
     A            A28           10A  B 15 36DSPATR(PR)
     A                                      OVRDTA
     A            A29           10A  B 15 53DSPATR(PR)
     A                                      OVRDTA
     A            A30           10A  B 15 70DSPATR(PR)
     A                                      OVRDTA
     A            A31           10A  B 17  2DSPATR(PR)
     A                                      OVRDTA
     A            A32           10A  B 17 19DSPATR(PR)
     A                                      OVRDTA
     A            A33           10A  B 17 36DSPATR(PR)
     A                                      OVRDTA
     A            A34           10A  B 17 53DSPATR(PR)
     A                                      OVRDTA
     A            A35           10A  B 17 70DSPATR(PR)
     A                                      OVRDTA
     A            A36           10A  B 19  2DSPATR(PR)
     A                                      OVRDTA
     A            A37           10A  B 19 19DSPATR(PR)
     A                                      OVRDTA
     A            A38           10A  B 19 36DSPATR(PR)
     A                                      OVRDTA
     A            A39           10A  B 19 53DSPATR(PR)
     A                                      OVRDTA
     A            A40           10A  B 19 70DSPATR(PR)
     A                                      OVRDTA
     A            A41           10A  B 21  2DSPATR(PR)
     A                                      OVRDTA
     A            A42           10A  B 21 19DSPATR(PR)
     A                                      OVRDTA
     A            A43           10A  B 21 36DSPATR(PR)
     A                                      OVRDTA
     A            A44           10A  B 21 53DSPATR(PR)
     A                                      OVRDTA
     A            A45           10A  B 21 70DSPATR(PR)
     A                                      OVRDTA
     A            A46           10A  B 23  2DSPATR(PR)
     A                                      OVRDTA
     A            A47           10A  B 23 19DSPATR(PR)
     A                                      OVRDTA
     A            A48           10A  B 23 36DSPATR(PR)
     A                                      OVRDTA
     A            A49           10A  B 23 53DSPATR(PR)
     A                                      OVRDTA
     A            A50           10A  B 23 70DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPDISP2A
     A                                      PUTOVR
     A  98                                  INVITE
     A                                      CF01
     A                                      CF02
     A                                      CF05
     A                                      CF06
     A                                  1 17'P E R S O N N E L    A B S E N C E'
     A                                  1 55'D A T A'
     A                                  1 73'Year'
     A                                  2 71'Screen'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A            CC             4A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            YR             2A  B  1 78DSPATR(PR)
     A                                      OVRDTA
     A            P              1A  B  2 79DSPATR(PR)
     A                                      OVRDTA
     A            TITLE         78A  B  4  2DSPATR(PR)
     A                                      OVRDTA
     A            A1            10A  B  5  2DSPATR(PR)
     A                                      OVRDTA
     A            A2            10A  B  5 19DSPATR(PR)
     A                                      OVRDTA
     A            A3            10A  B  5 36DSPATR(PR)
     A                                      OVRDTA
     A            A4            10A  B  5 53DSPATR(PR)
     A                                      OVRDTA
     A            A5            10A  B  5 70DSPATR(PR)
     A                                      OVRDTA
     A            A6            10A  B  7  2DSPATR(PR)
     A                                      OVRDTA
     A            A7            10A  B  7 19DSPATR(PR)
     A                                      OVRDTA
     A            A8            10A  B  7 36DSPATR(PR)
     A                                      OVRDTA
     A            A9            10A  B  7 53DSPATR(PR)
     A                                      OVRDTA
     A            A10           10A  B  7 70DSPATR(PR)
     A                                      OVRDTA
     A            A11           10A  B  9  2DSPATR(PR)
     A                                      OVRDTA
     A            A12           10A  B  9 19DSPATR(PR)
     A                                      OVRDTA
     A            A13           10A  B  9 36DSPATR(PR)
     A                                      OVRDTA
     A            A14           10A  B  9 53DSPATR(PR)
     A                                      OVRDTA
     A            A15           10A  B  9 70DSPATR(PR)
     A                                      OVRDTA
     A            A16           10A  B 11  2DSPATR(PR)
     A                                      OVRDTA
     A            A17           10A  B 11 19DSPATR(PR)
     A                                      OVRDTA
     A            A18           10A  B 11 36DSPATR(PR)
     A                                      OVRDTA
     A            A19           10A  B 11 53DSPATR(PR)
     A                                      OVRDTA
     A            A20           10A  B 11 70DSPATR(PR)
     A                                      OVRDTA
     A            A21           10A  B 13  2DSPATR(PR)
     A                                      OVRDTA
     A            A22           10A  B 13 19DSPATR(PR)
     A                                      OVRDTA
     A            A23           10A  B 13 36DSPATR(PR)
     A                                      OVRDTA
     A            A24           10A  B 13 53DSPATR(PR)
     A                                      OVRDTA
     A            A25           10A  B 13 70DSPATR(PR)
     A                                      OVRDTA
     A            A26           10A  B 15  2DSPATR(PR)
     A                                      OVRDTA
     A            A27           10A  B 15 19DSPATR(PR)
     A                                      OVRDTA
     A            A28           10A  B 15 36DSPATR(PR)
     A                                      OVRDTA
     A            A29           10A  B 15 53DSPATR(PR)
     A                                      OVRDTA
     A            A30           10A  B 15 70DSPATR(PR)
     A                                      OVRDTA
     A            A31           10A  B 17  2DSPATR(PR)
     A                                      OVRDTA
     A            A32           10A  B 17 19DSPATR(PR)
     A                                      OVRDTA
     A            A33           10A  B 17 36DSPATR(PR)
     A                                      OVRDTA
     A            A34           10A  B 17 53DSPATR(PR)
     A                                      OVRDTA
     A            A35           10A  B 17 70DSPATR(PR)
     A                                      OVRDTA
     A            A36           10A  B 19  2DSPATR(PR)
     A                                      OVRDTA
     A            A37           10A  B 19 19DSPATR(PR)
     A                                      OVRDTA
     A            A38           10A  B 19 36DSPATR(PR)
     A                                      OVRDTA
     A            A39           10A  B 19 53DSPATR(PR)
     A                                      OVRDTA
     A            A40           10A  B 19 70DSPATR(PR)
     A                                      OVRDTA
     A            A41           10A  B 21  2DSPATR(PR)
     A                                      OVRDTA
     A            A42           10A  B 21 19DSPATR(PR)
     A                                      OVRDTA
     A            A43           10A  B 21 36DSPATR(PR)
     A                                      OVRDTA
     A            A44           10A  B 21 53DSPATR(PR)
     A                                      OVRDTA
     A            A45           10A  B 21 70DSPATR(PR)
     A                                      OVRDTA
     A            A46           10A  B 23  2DSPATR(PR)
     A                                      OVRDTA
     A            A47           10A  B 23 19DSPATR(PR)
     A                                      OVRDTA
     A            A48           10A  B 23 36DSPATR(PR)
     A                                      OVRDTA
     A            A49           10A  B 23 53DSPATR(PR)
     A                                      OVRDTA
     A            A50           10A  B 23 70DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPDISP2B
     A                                      PUTOVR
     A  98                                  INVITE
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                  1 17'P E R S O N N E L    A B S E N C E'
     A                                  1 55'D A T A'
     A                                  1 73'Year'
     A                                  2 71'Screen'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A            CC             4A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            YR             2A  B  1 78DSPATR(PR)
     A                                      OVRDTA
     A            P              1A  B  2 79DSPATR(PR)
     A                                      OVRDTA
     A            TITLE         78A  B  4  2DSPATR(PR)
     A                                      OVRDTA
     A            A1            10A  B  5  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            A2            10A  B  5 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            A3            10A  B  5 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            A4            10A  B  5 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            A5            10A  B  5 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            A6            10A  B  7  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            A7            10A  B  7 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            A8            10A  B  7 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            A9            10A  B  7 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            A10           10A  B  7 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            A11           10A  B  9  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            A12           10A  B  9 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            A13           10A  B  9 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            A14           10A  B  9 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            A15           10A  B  9 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            A16           10A  B 11  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            A17           10A  B 11 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            A18           10A  B 11 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            A19           10A  B 11 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            A20           10A  B 11 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            A21           10A  B 13  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            A22           10A  B 13 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            A23           10A  B 13 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            A24           10A  B 13 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            A25           10A  B 13 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            A26           10A  B 15  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            A27           10A  B 15 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            A28           10A  B 15 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            A29           10A  B 15 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            A30           10A  B 15 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            A31           10A  B 17  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            A32           10A  B 17 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            A33           10A  B 17 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            A34           10A  B 17 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            A35           10A  B 17 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            A36           10A  B 19  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            A37           10A  B 19 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            A38           10A  B 19 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A            A39           10A  B 19 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            A40           10A  B 19 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            A41           10A  B 21  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A            A42           10A  B 21 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A            A43           10A  B 21 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A            A44           10A  B 21 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A            A45           10A  B 21 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A            A46           10A  B 23  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(PC)
     A            A47           10A  B 23 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A            A48           10A  B 23 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A            A49           10A  B 23 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A            A50           10A  B 23 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPDISP3
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF05
     A                                      CF06
     A  98                                  INVITE
     A                                  1 14'T R A I N I N G   A N D   E X P E'
     A                                  1 48'R I E N C E   D A T A'
     A                                  3  2'CC'
     A                                  3 71'SCREEN'
     A                                 21  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 22  1'"This screen is intended for state-
     A                                      d purposes only --- Do not use this-
     A                                       screen for'
     A                                 23  2'any other data regarding this indi-
     A                                      vidual" -GOODYEAR CORPORATE LEGAL'
     A                                 23 70'DEPARTMENT'
     A            CC             4A  B  3  5DSPATR(PR)
     A                                      OVRDTA
     A            NO             2A  B  3 78DSPATR(PR)
     A                                      OVRDTA
     A            T1            66A  B  5  8DSPATR(PR)
     A                                      OVRDTA
     A            T2            66A  B  6  8DSPATR(PR)
     A                                      OVRDTA
     A            T3            66A  B  7  8DSPATR(PR)
     A                                      OVRDTA
     A            T4            66A  B  8  8DSPATR(PR)
     A                                      OVRDTA
     A            T5            66A  B  9  8DSPATR(PR)
     A                                      OVRDTA
     A            T6            66A  B 10  8DSPATR(PR)
     A                                      OVRDTA
     A            T7            66A  B 11  8DSPATR(PR)
     A                                      OVRDTA
     A            T8            66A  B 12  8DSPATR(PR)
     A                                      OVRDTA
     A            T9            66A  B 13  8DSPATR(PR)
     A                                      OVRDTA
     A            T10           66A  B 14  8DSPATR(PR)
     A                                      OVRDTA
     A            T11           66A  B 15  8DSPATR(PR)
     A                                      OVRDTA
     A            T12           66A  B 16  8DSPATR(PR)
     A                                      OVRDTA
     A            T13           66A  B 17  8DSPATR(PR)
     A                                      OVRDTA
     A            T14           66A  B 18  8DSPATR(PR)
     A                                      OVRDTA
     A            T15           66A  B 19  8DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPDISP3A
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A  98                                  INVITE
     A                                  1 14'T R A I N I N G   A N D   E X P E'
     A                                  1 48'R I E N C E   D A T A'
     A                                  3  2'CC'
     A                                  3 71'SCREEN'
     A                                 21  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 22  1'"This screen is intended for state-
     A                                      d purposes only --- Do not use this-
     A                                       screen for'
     A                                 23  2'any other data regarding this indi-
     A                                      vidual" -GOODYEAR CORPORATE LEGAL'
     A                                 23 70'DEPARTMENT'
     A            CC             4A  B  3  5DSPATR(PR)
     A                                      OVRDTA
     A            NO             2A  B  3 78DSPATR(PR)
     A                                      OVRDTA
     A            T1            66A  B  5  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            T2            66A  B  6  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            T3            66A  B  7  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            T4            66A  B  8  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            T5            66A  B  9  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            T6            66A  B 10  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            T7            66A  B 11  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            T8            66A  B 12  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            T9            66A  B 13  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            T10           66A  B 14  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            T11           66A  B 15  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            T12           66A  B 16  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            T13           66A  B 17  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            T14           66A  B 18  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            T15           66A  B 19  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPDISP3B
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A  98                                  INVITE
     A                                  1 14'T R A I N I N G   A N D   E X P E'
     A                                  1 48'R I E N C E   D A T A'
     A                                  3  2'CC'
     A                                  3 71'SCREEN'
     A                                 21  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 22  1'"This screen is intended for state-
     A                                      d purposes only --- Do not use this-
     A                                       screen for'
     A                                 23  2'any other data regarding this indi-
     A                                      vidual" -GOODYEAR CORPORATE LEGAL'
     A                                 23 70'DEPARTMENT'
     A            CC             4A  B  3  5DSPATR(PR)
     A                                      OVRDTA
     A            NO             2Y 0B  3 78DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            T1            66A  B  5  8DSPATR(PR)
     A                                      OVRDTA
     A            T2            66A  B  6  8DSPATR(PR)
     A                                      OVRDTA
     A            T3            66A  B  7  8DSPATR(PR)
     A                                      OVRDTA
     A            T4            66A  B  8  8DSPATR(PR)
     A                                      OVRDTA
     A            T5            66A  B  9  8DSPATR(PR)
     A                                      OVRDTA
     A            T6            66A  B 10  8DSPATR(PR)
     A                                      OVRDTA
     A            T7            66A  B 11  8DSPATR(PR)
     A                                      OVRDTA
     A            T8            66A  B 12  8DSPATR(PR)
     A                                      OVRDTA
     A            T9            66A  B 13  8DSPATR(PR)
     A                                      OVRDTA
     A            T10           66A  B 14  8DSPATR(PR)
     A                                      OVRDTA
     A            T11           66A  B 15  8DSPATR(PR)
     A                                      OVRDTA
     A            T12           66A  B 16  8DSPATR(PR)
     A                                      OVRDTA
     A            T13           66A  B 17  8DSPATR(PR)
     A                                      OVRDTA
     A            T14           66A  B 18  8DSPATR(PR)
     A                                      OVRDTA
     A            T15           66A  B 19  8DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPDISP4
     A                                      PUTOVR
     A                                      CF05
     A                                  1 22'I D E N T I F I C A T I O N   D A'
     A                                  1 56'T A'
     A                                  2  8'Item 1  is'
     A                                  4  8'Item 2  is'
     A                                  6  8'Item 3  is'
     A                                  8  8'Item 4  is'
     A                                 10  8'Item 5  is'
     A                                 12  8'Item 6  is'
     A                                 14  8'Item 7  is'
     A                                 16  8'Item 8  is'
     A                                 18  8'Item 9  is'
     A                                 20  8'Item10  is'
     A                                 21  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 22  1'"This screen is intended for state-
     A                                      d purposes only --- Do not use this-
     A                                       screen for'
     A                                 23  2'any other data regarding this indi-
     A                                      vidual" -GOODYEAR CORPORATE LEGAL'
     A                                 23 70'DEPARTMENT'
     A            CC             4A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            D1            30A  B  2 21DSPATR(PR)
     A                                      OVRDTA
     A            V1            20A  B  2 54DSPATR(PR)
     A                                      OVRDTA
     A            D2            30A  B  4 21DSPATR(PR)
     A                                      OVRDTA
     A            V2            20A  B  4 54DSPATR(PR)
     A                                      OVRDTA
     A            D3            30A  B  6 21DSPATR(PR)
     A                                      OVRDTA
     A            V3            20A  B  6 54DSPATR(PR)
     A                                      OVRDTA
     A            D4            30A  B  8 21DSPATR(PR)
     A                                      OVRDTA
     A            V4            20A  B  8 54DSPATR(PR)
     A                                      OVRDTA
     A            D5            30A  B 10 21DSPATR(PR)
     A                                      OVRDTA
     A            V5            20A  B 10 54DSPATR(PR)
     A                                      OVRDTA
     A            D6            30A  B 12 21DSPATR(PR)
     A                                      OVRDTA
     A            V6            20A  B 12 54DSPATR(PR)
     A                                      OVRDTA
     A            D7            30A  B 14 21DSPATR(PR)
     A                                      OVRDTA
     A            V7            20A  B 14 54DSPATR(PR)
     A                                      OVRDTA
     A            D8            30A  B 16 21DSPATR(PR)
     A                                      OVRDTA
     A            V8            20A  B 16 54DSPATR(PR)
     A                                      OVRDTA
     A            D9            30A  B 18 21DSPATR(PR)
     A                                      OVRDTA
     A            V9            20A  B 18 54DSPATR(PR)
     A                                      OVRDTA
     A            D10           30A  B 20 21DSPATR(PR)
     A                                      OVRDTA
     A            V10           20A  B 20 54DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPDISP4A
     A                                      PUTOVR
     A  98                                  INVITE
     A                                      CF05
     A                                  1 22'I D E N T I F I C A T I O N   D A'
     A                                  1 56'T A'
     A                                  2  8'Item 1  is'
     A                                  4  8'Item 2  is'
     A                                  6  8'Item 3  is'
     A                                  8  8'Item 4  is'
     A                                 10  8'Item 5  is'
     A                                 12  8'Item 6  is'
     A                                 14  8'Item 7  is'
     A                                 16  8'Item 8  is'
     A                                 18  8'Item 9  is'
     A                                 20  8'Item10  is'
     A                                 21  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 22  1'"This screen is intended for state-
     A                                      d purposes only --- Do not use this-
     A                                       screen for'
     A                                 23  2'any other data regarding this indi-
     A                                      vidual" -GOODYEAR CORPORATE LEGAL'
     A                                 23 70'DEPARTMENT'
     A            CC             4A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            D1            30A  B  2 21DSPATR(PR)
     A                                      OVRDTA
     A            V1            20A  B  2 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            D2            30A  B  4 21DSPATR(PR)
     A                                      OVRDTA
     A            V2            20A  B  4 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            D3            30A  B  6 21DSPATR(PR)
     A                                      OVRDTA
     A            V3            20A  B  6 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            D4            30A  B  8 21DSPATR(PR)
     A                                      OVRDTA
     A            V4            20A  B  8 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            D5            30A  B 10 21DSPATR(PR)
     A                                      OVRDTA
     A            V5            20A  B 10 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            D6            30A  B 12 21DSPATR(PR)
     A                                      OVRDTA
     A            V6            20A  B 12 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            D7            30A  B 14 21DSPATR(PR)
     A                                      OVRDTA
     A            V7            20A  B 14 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            D8            30A  B 16 21DSPATR(PR)
     A                                      OVRDTA
     A            V8            20A  B 16 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            D9            30A  B 18 21DSPATR(PR)
     A                                      OVRDTA
     A            V9            20A  B 18 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            D10           30A  B 20 21DSPATR(PR)
     A                                      OVRDTA
     A            V10           20A  B 20 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPERRAT
     A                                      PUTOVR
     A  98                                  INVITE
     A                                  2  9'-----------------------------------
     A                                      ------------------------------'
     A                                  3  9':  C H A N G E    P E R S O N N E'
     A                                  3 43'L    L A B O R    R A T E S  :'
     A                                  4  9'-----------------------------------
     A                                      ------------------------------'
     A                                  8  8'Enter The New Labor Rate To Be Inc-
     A                                      orporated Into The Personnel File'
     A                                  9  8'-----------------------------------
     A                                      ---------------------------------'
     A                                 15 20'Restrict The Change To The Followi-
     A                                      ng Crafts'
     A                                 16 20'-----------------------------------
     A                                      ---------'
     A            DDDDDD        10Y04B 11 35EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            C1             2A  B 18 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            C2             2A  B 18 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            C3             2A  B 18 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            C4             2A  B 18 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            C5             2A  B 18 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPERSON
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 17'..................................-
     A                                      ..............'
     A                                  2 17'.'
     A                                  2 64'.'
     A                                  3 17'.'
     A                                  3 32'C R A F T S M A N'
     A                                  3 64'.'
     A                                  4 17'.'
     A                                  4 64'.'
     A                                  5 17'.      P E R S O N N E L      S Y'
     A                                  5 51'S T E M      .'
     A                                  6 17'.'
     A                                  6 64'.'
     A                                  7 17'..................................-
     A                                      ..............'
     A                                  9  9'Display / Modify a   ......'
     A                                  9 46'......  Change a Clock Card'
     A                                 10  9'Clock Card'
     A                                 10 46'. f5 .  Number'
     A                                 10 30'. f1 .'
     A                                 11 30'......'
     A                                 11 46'......'
     A                                 13  9'Add a Clock Card     ......'
     A                                 13 46'......  Inquiries / Reports'
     A                                 14 30'. f2 .'
     A                                 14 46'. f6 .'
     A                                 15 30'......'
     A                                 15 46'......'
     A                                 17  9'End Program          ......'
     A                                 17 46'......  Mass Changes'
     A                                 18 30'. f3 .'
     A                                 18 46'. f7 .'
     A                                 19 30'......'
     A                                 19 46'......'
     A                                 21  9'Delete a Clock Card  ......'
     A                                 21 46'......  Absence Codes /'
     A                                 22 30'. f4 .'
     A                                 22 46'. f8 .  Item Definitions'
     A                                 23 30'......'
     A                                 23 46'......'
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPERSON6
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                  2 15'-----------------------------------
     A                                      -------------------'
     A                                  3 15':   P E R S O N N E L    M A S S'
     A                                  3 51'C H A N G E S   :'
     A                                  4 15'-----------------------------------
     A                                      -------------------'
     A                                  7 19'f1      MASS CHANGE Labor Rate ...-
     A                                      ..........'
     A                                  9 19'f2      MASS CHANGE Zone Assignmen-
     A                                      t ........'
     A                                 11 19'f3      End Program ..............-
     A                                      ..........'
     A                                 13 19'f4      MASS CHANGE Shift ........-
     A                                      ..........'
     A                                 15 19'f5      MASS CHANGE Crew .........-
     A                                      ..........'
     A                                 17 19'f6      MASS DELETE Year of Absenc-
     A                                      e Data....'
     A                                 19 19'f7      No Function ..............-
     A                                      ..........'
     A                                 21 19'f8      No Function ..............-
     A                                      ..........'
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPERSON7
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                  2  5'-----------------------------------
     A                                      ------------------------------------
     A                                      ----'
     A                                  3  5':  A B S E N C E   C O D E S   A N'
     A                                  3 40'D   I T E M   D E F I N I T I O N'
     A                                  3 74'S  :'
     A                                  4  5'-----------------------------------
     A                                      ------------------------------------
     A                                      ----'
     A                                  7 19'f1      Absence Code Maintenance .-
     A                                      ..........'
     A                                  9 19'f2      Item Definition Maintenanc-
     A                                      e ........'
     A                                 11 19'f3      End Program ..............-
     A                                      ..........'
     A                                 13 19'f4      No Function ..............-
     A                                      ..........'
     A                                 15 19'f5      No Function ..............-
     A                                      ..........'
     A                                 17 19'f6      No Function ..............-
     A                                      ..........'
     A                                 19 19'f7      No Function ..............-
     A                                      ..........'
     A                                 21 19'f8      No Function ..............-
     A                                      ..........'
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPLIST
     A                                      PUTOVR
     A  98                                  INVITE
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 11'P E R S O N N E L   I N Q U I R I'
     A                                  2 45'E S   A N D   R E P O R T S'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  5 18'Make SORT SELECTION using the numb-
     A                                      ers 1 thru 4'
     A                                  6 18'-----------------------------------
     A                                      ------------'
     A                                  7  7'CLOCK CARD NUMBER'
     A                                  7 41'or'
     A                                  7 50'EMPLOYEE NAME'
     A                                  9  3'If the above field is selected as'
     A                                  9 37'the #1 sort no secondary sorts are'
     A                                  9 72'allowed'
     A                                 10 40'---------------------------------'
     A                                 11 40'.     Optional Restrictions     .'
     A                                 12 40'. ----------------------------- .'
     A                                 13  7'CONTINUOUS SERVICE DATE'
     A                                 13 40'. :'
     A                                 13 51'TO'
     A                                 13 70': .'
     A                                 14 40'. :'
     A                                 14 70': .'
     A                                 15  7'CRAFT'
     A                                 15 40'. :'
     A                                 15 70': .'
     A                                 16 40'. :'
     A                                 16 70': .'
     A                                 17  7'ZONE'
     A                                 17 40'. :'
     A                                 17 70': .'
     A                                 18 40'. :'
     A                                 18 70': .'
     A                                 19  7'SHIFT/CREW'
     A                                 19 40'. :'
     A                                 19 70': .'
     A                                 20 40'. ----------------------------- .'
     A                                 21 40'---------------------------------'
     A                                 22 24'Do You Want Direct Printout'
     A                                 23 10'Input Data And Press The "Enter" K-
     A                                      ey or f3 to exit program'
     A            A              1A  B  7 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            B              1A  B  7 72DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            C              1A  B 13 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            DATE01         6A  B 13 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            DATE02         6A  B 13 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            D              1A  B 15 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            C1             2A  B 15 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            C2             2A  B 15 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            C3             2A  B 15 50DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            C4             2A  B 15 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            C5             2A  B 15 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            E              1A  B 17 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            ZON1           4A  B 17 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            ZON2           4A  B 17 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            ZON3           4A  B 17 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            ZON4           4A  B 17 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            ZON5           4A  B 17 64DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            S1             2A  B 19 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            S2             2A  B 19 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            S3             2A  B 19 50DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            S4             2A  B 19 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            G              1A  B 22 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPPRNT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF06
     A                                  2  6'-----------------------------------
     A                                      ------------------------------------
     A                                      '
     A                                  3  6':'
     A                                  3 74':'
     A                                  4  6'-----------------------------------
     A                                      ------------------------------------
     A                                      '
     A            S             55A  B  3 13DSPATR(PR)
     A                                      OVRDTA
     A            A             66A  B  6  8DSPATR(PR)
     A                                      OVRDTA
     A            B             66A  B  7  8DSPATR(PR)
     A                                      OVRDTA
     A            C             66A  B  8  8DSPATR(PR)
     A                                      OVRDTA
     A            D             66A  B  9  8DSPATR(PR)
     A                                      OVRDTA
     A            E             66A  B 10  8DSPATR(PR)
     A                                      OVRDTA
     A            F             66A  B 11  8DSPATR(PR)
     A                                      OVRDTA
     A            G             66A  B 12  8DSPATR(PR)
     A                                      OVRDTA
     A            H             66A  B 13  8DSPATR(PR)
     A                                      OVRDTA
     A            I             66A  B 14  8DSPATR(PR)
     A                                      OVRDTA
     A            J             66A  B 15  8DSPATR(PR)
     A                                      OVRDTA
     A            K             66A  B 16  8DSPATR(PR)
     A                                      OVRDTA
     A            L             66A  B 17  8DSPATR(PR)
     A                                      OVRDTA
     A            M             66A  B 18  8DSPATR(PR)
     A                                      OVRDTA
     A            N             66A  B 19  8DSPATR(PR)
     A                                      OVRDTA
     A            O             66A  B 20  8DSPATR(PR)
     A                                      OVRDTA
     A            P             66A  B 21  8DSPATR(PR)
     A                                      OVRDTA
     A            Q             66A  B 22  8DSPATR(PR)
     A                                      OVRDTA
     A            R             66A  B 23  8DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPSHIFT
     A                                      PUTOVR
     A  98                                  INVITE
     A                                  3  5'-----------------------------------
     A                                      ------------------------------------
     A                                      --'
     A                                  4  5': C H A N G E   P E R S O N N E L'
     A                                  4 41'S H I F T   A S S I G N M E N T S'
     A                                  4 75':'
     A                                  5  5'-----------------------------------
     A                                      ------------------------------------
     A                                      --'
     A                                  9 26'Change Shift'
     A                                  9 41'to Shift'
     A                                 10 26'-------------------------'
     A                                 13 15'RESTRICT THE CHANGE BASED ON THE F-
     A                                      OLLOWING CRITERIA'
     A                                 16 15'ZONE'
     A                                 16 38'DEPT'
     A                                 16 61'CRAFT'
     A            A              1A  B  9 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            B              1A  B  9 50DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            ZONE           4A  B 18 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            DEPT           4A  B 18 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            CR             2A  B 18 64DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPZONE
     A                                      PUTOVR
     A  98                                  INVITE
     A                                  1  5'-----------------------------------
     A                                      ------------------------------------
     A                                      ---'
     A                                  2  5':  C H A N G E    P E R S O N N E'
     A                                  2 39'L    Z O N E    A S S I G N M E N'
     A                                  2 73'T  :'
     A                                  3  5'-----------------------------------
     A                                      ------------------------------------
     A                                      ---'
     A                                  5 18'Change The Following Clockcard Num-
     A                                      bers To This'
     A                                  9 23'N E W   Z O N E   A S S I G N M E'
     A                                  9 57'N T'
     A                                 22 23'Input Data And Press The "Enter" K-
     A                                      ey'
     A                                 23 23'-----------------------------------
     A                                      --'
     A            Z01            4A  B  7 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            C01            4A  B 12 18DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            C02            4A  B 12 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            C03            4A  B 12 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            C04            4A  B 14 18DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            C05            4A  B 14 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            C06            4A  B 14 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            C07            4A  B 16 18DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            C08            4A  B 16 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            C09            4A  B 16 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            C10            4A  B 18 18DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            C11            4A  B 18 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            C12            4A  B 18 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            C13            4A  B 20 18DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            C14            4A  B 20 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            C15            4A  B 20 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
