     A*  89/02/20  08:24:21    T881S03     REL-R01M02  5728-PW1
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A                                      CA03(03 'END PROGRAM')
     A          R FCSISEXC
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  4 28'STOREROOM FUNCTIONS'
     A                                  7 22'F1  -  STORES CODE INQUIRY'
     A                                  9 22'F2  -  STOREROOM WITHDRAWAL WORKSH-
     A                                      EET'
     A                                 11 22'F3  -  EXIT PROGRAM'
     A                                 13 22'F4  -  PURCHASE ORDER INQUIRY'
     A                                 15 22'F5  -  PURCHASE ORDER INQUIRY BY C-
     A                                      ODE'
     A                                 17 22'F6  -  REQUISITION INQUIRY'
     A                                 19 22'F7  -  MANUFACTURER"S INQUIRY'
     A                                 21 22'F8  -  KEYWORD/MODIFIER INQUIRY'
     A            COMMANDLN1    79A  O 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FENGFUNC
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                  2  8'E N G I N E E R   F U N C T I O N -
     A                                      S'
     A                                  2 46'M E N U'
     A                                  5 15'DEPRESS THE FOLLOWING KEY TO:'
     A                                  7 16'F1   -   INITIATE FUNCTIONS'
     A                                  8 16'F2   -   UPDATE FUNCTIONS'
     A                                  9 16'F3   -   EXIT PROGRAM'
     A                                 10 16'F4   -   DISPLAY A WORK ORDER'
     A                                 11 16'F5   -   STORES FUNCTIONS'
     A                                 12 16'F6   -   INQUIRY FUNCTIONS'
     A                                 13 16'F7   -   PRINT FUNCTIONS'
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FINITEXC
     A*  89/01/05  12:53:37    T881S03     REL-R01M02  5728-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                  8 24'WORK ORDER INITIATE FUNCTIONS'
     A                                 11 21'F1  -  INITIATE A SINGLE WORK ORDE-
     A                                      R'
     A                                 13 21'F2  -  CONTINUOUS WORK ORDER INITI-
     A                                      ATE'
     A                                 15 21'F3  -  EXIT PROGRAM'
     A                                 17 21'F4  -  INITIATE MASTER AND SUFFIXE-
     A                                      D WORK ORDERS'
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FINITPLN
     A*  89/01/10  16:01:53    T881S03     REL-R01M02  5728-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A  98                                  INVITE
     A                                  1 19'W O R K   O R D E R   I N I T I A'
     A                                  1 53'T I O N'
     A                                  3  2'W/O NUM'
     A                                  3 27'W/O STATUS'
     A                                  3 55'TIME RECD'
     A                                  4  2'APPROVAL CODE'
     A                                  4 27'REQUESTER'
     A                                  4 55'EQUIP NUM'
     A                                  5  2'EQUIP NAME'
     A                                  6  2'DEPT'
     A                                  6 14'MAINT ZONE'
     A                                  6 33'LOCATION '
     A                                  6 55'PRIORITY'
     A                                  6 73'RIME'
     A                                  7  2'EQUIPMENT DOWN'
     A                                  7 33'EXP CLASS'
     A                                  7 55'TIME REQD'
     A                                  8  2'DESCRIPTION'
     A                                 13  2'SPECL INSTR'
     A                                 15  2'SPECL EQUIP'
     A                                 16  2'SAFETY NOTE'
     A                                 17  2'ENGINEER'
     A                                 17 18'PLANNER'
     A                                 17 33'SCHEDULER'
     A                                 17 55'TIME SCHD'
     A                                 18  2'BUDGET NO'
     A                                 18 33'REQST NO'
     A                                 18 55'TIME STRT'
     A                                 19  2'FAILURE CODE'
     A                                 19 55'TIME COMP'
     A            WONUM          7A  B  3 10DSPATR(PR)
     A                                      OVRDTA
     A            WOR            3A  B  3 18DSPATR(PR)
     A                                      OVRDTA
     A            ST             2A  B  3 38DSPATR(PR)
     A                                      OVRDTA
     A            ENTMO          2A  B  3 65DSPATR(PR)
     A                                      OVRDTA
     A            ENTDA          2A  B  3 68DSPATR(PR)
     A                                      OVRDTA
     A            ENTYR          2A  B  3 71DSPATR(PR)
     A                                      OVRDTA
     A            ENTHR          2A  B  3 75DSPATR(PR)
     A                                      OVRDTA
     A            ENTMI          2A  B  3 78DSPATR(PR)
     A                                      OVRDTA
     A            APPRV          1A  B  4 16DSPATR(PR)
     A                                      OVRDTA
     A            REQUESTER     16A  B  4 37DSPATR(UL)
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A                                      OVRDTA
     A            EQPNU          6A  B  4 65DSPATR(UL)
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                      OVRDTA
     A            EQUIPNAME     50A  B  5 13DSPATR(PR)
     A                                      OVRDTA
     A            EQPTYPE        8A  B  5 65DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  6  7DSPATR(PR)
     A                                      OVRDTA
     A            MZON           4A  B  6 25DSPATR(PR)
     A                                      OVRDTA
     A            LOCATION       8A  B  6 43DSPATR(PR)
     A                                      OVRDTA
     A            PRTY           1A  B  6 64DSPATR(UL)
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A                                      OVRDTA
     A            RIME           2A  B  6 78DSPATR(PR)
     A                                      OVRDTA
     A            DOWNID         1A  B  7 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            EXPCLASS       8A  B  7 43DSPATR(UL)
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                      OVRDTA
     A            REQMO          2A  B  7 65DSPATR(PR)
     A                                      OVRDTA
     A            REQDA          2A  B  7 68DSPATR(PR)
     A                                      OVRDTA
     A            REQYR          2A  B  7 71DSPATR(PR)
     A                                      OVRDTA
     A            REQHR          2A  B  7 75DSPATR(PR)
     A                                      OVRDTA
     A            REQMI          2A  B  7 78DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIO    30A  B  8 14CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A                                      OVRDTA
     A            DESCRIPTI2    66A  B  9 14CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A                                      OVRDTA
     A            DESCRIPTI3    66A  B 10 14CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A                                      OVRDTA
     A            DESCRIPTI4    66A  B 11 14CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A                                      OVRDTA
     A            DESCRIPTI5    66A  B 12 14CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A                                      OVRDTA
     A            SPECLINSTR    66A  B 13 14DSPATR(UL)
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                      OVRDTA
     A            SPECLINST2    66A  B 14 14DSPATR(UL)
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A                                      OVRDTA
     A            SPECLEQUIP    66A  B 15 14DSPATR(UL)
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A                                      OVRDTA
     A            SAFETYNOTE    66A  B 16 14DSPATR(UL)
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A                                      OVRDTA
     A            ENGR           4A  B 17 11DSPATR(UL)
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A                                      OVRDTA
     A            PLNR           4A  B 17 26DSPATR(UL)
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A                                      OVRDTA
     A            SCDR           4A  B 17 43DSPATR(UL)
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A                                      OVRDTA
     A            SCHMO          2A  B 17 65DSPATR(PR)
     A                                      OVRDTA
     A            SCHDA          2A  B 17 68DSPATR(PR)
     A                                      OVRDTA
     A            SCHYR          2A  B 17 71DSPATR(PR)
     A                                      OVRDTA
     A            SCHHR          2A  B 17 75DSPATR(PR)
     A                                      OVRDTA
     A            SCHMI          2A  B 17 78DSPATR(PR)
     A                                      OVRDTA
     A            BN3            3A  B 18 12DSPATR(UL)
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A                                      OVRDTA
     A            B2             2A  B 18 16DSPATR(UL)
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A                                      OVRDTA
     A            B4             2A  B 18 19DSPATR(UL)
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A                                      OVRDTA
     A            BR3            3A  B 18 22DSPATR(UL)
     A                                      OVRATR
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A                                      OVRDTA
     A            BGTRV          2A  B 18 26DSPATR(UL)
     A                                      OVRATR
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(PC)
     A                                      OVRDTA
     A            REQUESTNO     12A  B 18 42DSPATR(UL)
     A                                      OVRATR
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A                                      OVRDTA
     A            STRMO          2A  B 18 65DSPATR(PR)
     A                                      OVRDTA
     A            STRDA          2A  B 18 68DSPATR(PR)
     A                                      OVRDTA
     A            STRYR          2A  B 18 71DSPATR(PR)
     A                                      OVRDTA
     A            STRHR          2A  B 18 75DSPATR(PR)
     A                                      OVRDTA
     A            STRMI          2A  B 18 78DSPATR(PR)
     A                                      OVRDTA
     A            FAILCO         2A  B 19 15DSPATR(PR)
     A                                      OVRDTA
     A            FREM           4A  B 19 18DSPATR(PR)
     A                                      OVRDTA
     A            ENDMO          2A  B 19 65DSPATR(PR)
     A                                      OVRDTA
     A            ENDDA          2A  B 19 68DSPATR(PR)
     A                                      OVRDTA
     A            ENDYR          2A  B 19 71DSPATR(PR)
     A                                      OVRDTA
     A            ENDHR          2A  B 19 75DSPATR(PR)
     A                                      OVRDTA
     A            ENDMI          2A  B 19 78DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELIN    79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            MGGLINETWO    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FINITPL2
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A  98                                  INVITE
     A                                  1 19'W O R K   O R D E R   I N I T I A'
     A                                  1 53'T I O N'
     A                                  3  2'W/O NUM'
     A                                  3 27'W/O STATUS'
     A                                  3 55'TIME RECD'
     A                                  4  2'APPROVAL CODE'
     A                                  4 27'REQUESTER'
     A                                  4 55'EQUIP NUM'
     A                                  5  2'EQUIP NAME'
     A                                  6  2'DEPT'
     A                                  6 14'MAINT ZONE'
     A                                  6 33'LOCATION '
     A                                  6 55'PRIORITY'
     A                                  6 73'RIME'
     A                                  7  2'EQUIPMENT DOWN'
     A                                  7 33'EXP CLASS'
     A                                  7 55'TIME REQD'
     A                                  8  2'DESCRIPTION'
     A                                 13  2'SPECL INSTR'
     A                                 15  2'SPECL EQUIP'
     A                                 16  2'SAFETY NOTE'
     A                                 17  2'ENGINEER'
     A                                 17 18'PLANNER'
     A                                 17 33'SCHEDULER'
     A                                 17 55'TIME SCHD'
     A                                 18  2'BUDGET NO'
     A                                 18 33'REQST NO'
     A                                 18 55'TIME STRT'
     A                                 19  2'FAILURE CODE'
     A                                 19 55'TIME COMP'
     A            WONUM          7A  B  3 10DSPATR(PR)
     A                                      OVRDTA
     A            WOR            3A  B  3 18DSPATR(PR)
     A                                      OVRDTA
     A            ST             2A  B  3 38DSPATR(UL)
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                      OVRDTA
     A            ENTMO          2A  B  3 65DSPATR(UL)
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                      OVRDTA
     A            ENTDA          2A  B  3 68DSPATR(UL)
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                      OVRDTA
     A            ENTYR          2A  B  3 71DSPATR(UL)
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A                                      OVRDTA
     A            ENTHR          2A  B  3 75DSPATR(UL)
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A                                      OVRDTA
     A            ENTMI          2A  B  3 78DSPATR(UL)
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A                                      OVRDTA
     A            APPRV          1A  B  4 16DSPATR(UL)
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A                                      OVRDTA
     A            REQUESTER     16A  B  4 37DSPATR(UL)
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A                                      OVRDTA
     A            EQPNU          6A  B  4 65DSPATR(UL)
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                      OVRDTA
     A            EQUIPNAME     50A  B  5 13DSPATR(PR)
     A                                      OVRDTA
     A            EQPTYPE        8A  B  5 65DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  6  7DSPATR(PR)
     A                                      OVRDTA
     A            MZON           4A  B  6 25DSPATR(PR)
     A                                      OVRDTA
     A            LOCATION       8A  B  6 43DSPATR(PR)
     A                                      OVRDTA
     A            PRTY           1A  B  6 64DSPATR(UL)
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A                                      OVRDTA
     A            RIME           2A  B  6 78DSPATR(PR)
     A                                      OVRDTA
     A            DOWNID2        1A  B  7 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            EXPCLASS       8A  B  7 43DSPATR(UL)
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                      OVRDTA
     A            REQMO          2A  B  7 65DSPATR(UL)
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A                                      OVRDTA
     A            REQDA          2A  B  7 68DSPATR(UL)
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A            REQYR          2A  B  7 71DSPATR(UL)
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A                                      OVRDTA
     A            REQHR          2A  B  7 75DSPATR(UL)
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A                                      OVRDTA
     A            REQMI          2A  B  7 78DSPATR(UL)
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A                                      OVRDTA
     A            DESCRIPTIO    30A  B  8 14CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A                                      OVRDTA
     A            DESCRIPTI2    66A  B  9 14CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A                                      OVRDTA
     A            DESCRIPTI3    66A  B 10 14CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A                                      OVRDTA
     A            DESCRIPTI4    66A  B 11 14CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A                                      OVRDTA
     A            DESCRIPTI5    66A  B 12 14CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A                                      OVRDTA
     A            SPECLINSTR    66A  B 13 14DSPATR(UL)
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                      OVRDTA
     A            SPECLINST2    66A  B 14 14DSPATR(UL)
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A                                      OVRDTA
     A            SPECLEQUIP    66A  B 15 14DSPATR(UL)
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A                                      OVRDTA
     A            SAFETYNOTE    66A  B 16 14DSPATR(UL)
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A                                      OVRDTA
     A            ENGR           4A  B 17 11DSPATR(UL)
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A                                      OVRDTA
     A            PLNR           4A  B 17 26DSPATR(UL)
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A                                      OVRDTA
     A            SCDR           4A  B 17 43DSPATR(UL)
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A                                      OVRDTA
     A            SCHMO          2A  B 17 65DSPATR(UL)
     A                                      OVRATR
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A                                      OVRDTA
     A            SCHDA          2A  B 17 68DSPATR(UL)
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A                                      OVRDTA
     A            SCHYR          2A  B 17 71DSPATR(UL)
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A                                      OVRDTA
     A            SCHHR          2A  B 17 75DSPATR(UL)
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A                                      OVRDTA
     A            SCHMI          2A  B 17 78DSPATR(UL)
     A                                      OVRATR
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A                                      OVRDTA
     A            BN3            3A  B 18 12DSPATR(UL)
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A                                      OVRDTA
     A            B2             2A  B 18 16DSPATR(UL)
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A                                      OVRDTA
     A            B4             2A  B 18 19DSPATR(UL)
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A                                      OVRDTA
     A            BR3            3A  B 18 22DSPATR(UL)
     A                                      OVRATR
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A                                      OVRDTA
     A            BGTRV          2A  B 18 26DSPATR(UL)
     A                                      OVRATR
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(PC)
     A                                      OVRDTA
     A            REQUESTNO     12A  B 18 42DSPATR(UL)
     A                                      OVRATR
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A                                      OVRDTA
     A            STRMO          2A  B 18 65DSPATR(PR)
     A                                      OVRDTA
     A            STRDA          2A  B 18 68DSPATR(PR)
     A                                      OVRDTA
     A            STRYR          2A  B 18 71DSPATR(PR)
     A                                      OVRDTA
     A            STRHR          2A  B 18 75DSPATR(PR)
     A                                      OVRDTA
     A            STRMI          2A  B 18 78DSPATR(PR)
     A                                      OVRDTA
     A            FAILCO         2A  B 19 15DSPATR(PR)
     A                                      OVRDTA
     A            FREM           4A  B 19 18DSPATR(PR)
     A                                      OVRDTA
     A            ENDMO          2A  B 19 65DSPATR(PR)
     A                                      OVRDTA
     A            ENDDA          2A  B 19 68DSPATR(PR)
     A                                      OVRDTA
     A            ENDYR          2A  B 19 71DSPATR(PR)
     A                                      OVRDTA
     A            ENDHR          2A  B 19 75DSPATR(PR)
     A                                      OVRDTA
     A            ENDMI          2A  B 19 78DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELIN    79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            MGGLINETWO    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FINITPNW
     A*  89/01/10  16:01:53    T881S03     REL-R01M02  5728-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A  98                                  INVITE
     A                                  1 19'W O R K   O R D E R   I N I T I A'
     A                                  1 53'T I O N'
     A                                  3  2'W/O NUM'
     A                                  3 27'W/O STATUS'
     A                                  3 55'TIME RECD'
     A                                  4  2'APPROVAL CODE'
     A                                  4 27'REQUESTER'
     A                                  4 55'EQUIP NUM'
     A                                  5  2'EQUIP NAME'
     A                                  6  2'DEPT'
     A                                  6 14'MAINT ZONE'
     A                                  6 33'LOCATION '
     A                                  6 55'PRIORITY'
     A                                  6 73'RIME'
     A                                  7  2'EQUIPMENT DOWN'
     A                                  7 33'EXP CLASS'
     A                                  7 55'TIME REQD'
     A                                  8  2'DESCRIPTION'
     A                                 13  2'SPECL INSTR'
     A                                 15  2'SPECL EQUIP'
     A                                 16  2'SAFETY NOTE'
     A                                 17  2'ENGINEER'
     A                                 17 18'PLANNER'
     A                                 17 33'SCHEDULER'
     A                                 17 55'TIME SCHD'
     A                                 18  2'BUDGET NO'
     A                                 18 33'REQST NO'
     A                                 18 55'TIME STRT'
     A                                 19  2'FAILURE CODE'
     A                                 19 55'TIME COMP'
     A            WONUM          7A  B  3 10DSPATR(PR)
     A                                      OVRDTA
     A            WOR            3A  B  3 18DSPATR(PR)
     A                                      OVRDTA
     A            ST             2A  B  3 38DSPATR(PR)
     A                                      OVRDTA
     A            ENTMO          2A  B  3 65DSPATR(PR)
     A                                      OVRDTA
     A            ENTDA          2A  B  3 68DSPATR(PR)
     A                                      OVRDTA
     A            ENTYR          2A  B  3 71DSPATR(PR)
     A                                      OVRDTA
     A            ENTHR          2A  B  3 75DSPATR(PR)
     A                                      OVRDTA
     A            ENTMI          2A  B  3 78DSPATR(PR)
     A                                      OVRDTA
     A            APPRV          1A  B  4 16DSPATR(PR)
     A                                      OVRDTA
     A            REQUESTER     16A  B  4 37DSPATR(UL)
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A                                      OVRDTA
     A            EQPNU          6A  B  4 65DSPATR(UL)
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                      OVRDTA
     A            EQUIPNAME     50A  B  5 13DSPATR(PR)
     A                                      OVRDTA
     A            EQPTYPE        8A  B  5 65DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  6  7DSPATR(PR)
     A                                      OVRDTA
     A            MZON           4A  B  6 25DSPATR(PR)
     A                                      OVRDTA
     A            LOCATION       8A  B  6 43DSPATR(PR)
     A                                      OVRDTA
     A            PRTY           1A  B  6 64DSPATR(UL)
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A                                      OVRDTA
     A            RIME           2A  B  6 78DSPATR(PR)
     A                                      OVRDTA
     A            DOWNIDNP       1A  B  7 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            EXPCLASS       8A  B  7 43DSPATR(UL)
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                      OVRDTA
     A            REQMO          2A  B  7 65DSPATR(PR)
     A                                      OVRDTA
     A            REQDA          2A  B  7 68DSPATR(PR)
     A                                      OVRDTA
     A            REQYR          2A  B  7 71DSPATR(PR)
     A                                      OVRDTA
     A            REQHR          2A  B  7 75DSPATR(PR)
     A                                      OVRDTA
     A            REQMI          2A  B  7 78DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIO    30A  B  8 14CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A                                      OVRDTA
     A            DESCRIPTI2    66A  B  9 14CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A                                      OVRDTA
     A            DESCRIPTI3    66A  B 10 14CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A                                      OVRDTA
     A            DESCRIPTI4    66A  B 11 14CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A                                      OVRDTA
     A            DESCRIPTI5    66A  B 12 14CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A                                      OVRDTA
     A            SPECLINSTR    66A  B 13 14DSPATR(UL)
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                      OVRDTA
     A            SPECLINST2    66A  B 14 14DSPATR(UL)
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A                                      OVRDTA
     A            SPECLEQUIP    66A  B 15 14DSPATR(UL)
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A                                      OVRDTA
     A            SAFETYNOTE    66A  B 16 14DSPATR(UL)
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A                                      OVRDTA
     A            ENGR           4A  B 17 11DSPATR(UL)
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A                                      OVRDTA
     A            PLNR           4A  B 17 26DSPATR(UL)
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A                                      OVRDTA
     A            SCDR           4A  B 17 43DSPATR(UL)
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A                                      OVRDTA
     A            SCHMO          2A  B 17 65DSPATR(PR)
     A                                      OVRDTA
     A            SCHDA          2A  B 17 68DSPATR(PR)
     A                                      OVRDTA
     A            SCHYR          2A  B 17 71DSPATR(PR)
     A                                      OVRDTA
     A            SCHHR          2A  B 17 75DSPATR(PR)
     A                                      OVRDTA
     A            SCHMI          2A  B 17 78DSPATR(PR)
     A                                      OVRDTA
     A            BN3            3A  B 18 12DSPATR(PR)
     A                                      OVRDTA
     A            B2             2A  B 18 16DSPATR(PR)
     A                                      OVRDTA
     A            B4             2A  B 18 19DSPATR(PR)
     A                                      OVRDTA
     A            BR3            3A  B 18 22DSPATR(PR)
     A                                      OVRDTA
     A            BGTRV          2A  B 18 26DSPATR(PR)
     A                                      OVRDTA
     A            REQUESTNO     12A  B 18 42DSPATR(UL)
     A                                      OVRATR
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A                                      OVRDTA
     A            STRMO          2A  B 18 65DSPATR(PR)
     A                                      OVRDTA
     A            STRDA          2A  B 18 68DSPATR(PR)
     A                                      OVRDTA
     A            STRYR          2A  B 18 71DSPATR(PR)
     A                                      OVRDTA
     A            STRHR          2A  B 18 75DSPATR(PR)
     A                                      OVRDTA
     A            STRMI          2A  B 18 78DSPATR(PR)
     A                                      OVRDTA
     A            FAILCO         2A  B 19 15DSPATR(PR)
     A                                      OVRDTA
     A            FREM           4A  B 19 18DSPATR(PR)
     A                                      OVRDTA
     A            ENDMO          2A  B 19 65DSPATR(PR)
     A                                      OVRDTA
     A            ENDDA          2A  B 19 68DSPATR(PR)
     A                                      OVRDTA
     A            ENDYR          2A  B 19 71DSPATR(PR)
     A                                      OVRDTA
     A            ENDHR          2A  B 19 75DSPATR(PR)
     A                                      OVRDTA
     A            ENDMI          2A  B 19 78DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELIN    79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            MGGLINETWO    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FMODSEL1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                  5 24'UPDATE FUNCTION SELECTIONS'
     A                                  8 19'F1  -  UPDATE A SPECIFIC WORK ORDE-
     A                                      R'
     A                                 10 19'F2  -  CONTINUOUS UPDATE OF WORK O-
     A                                      RDERS'
     A                                 12 19'F3  -  EXIT PROGRAM'
     A                                 14 19'F4  -  UPDATE WORK ORDERS TO "DW"'
     A                                 14 53'STATUS'
     A            CMDLINSEL1    79A  O 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FMODSEL2
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                  5 24'UPDATE FUNCTION SELECTIONS'
     A                                  8 19'F1  -  UPDATE A SPECIFIC WORK ORDE-
     A                                      R'
     A                                 10 19'F2  -  CONTINUOUS UPDATE OF WORK O-
     A                                      RDERS'
     A                                 12 19'F3  -  EXIT PROGRAM'
     A                                 14 19'F4  -  UPDATE WORK ORDERS TO "DW"'
     A                                 14 53'STATUS'
     A                                 16 19'F5  -  GENERATE WORKSHEET REQUISIT-
     A                                      ION PACKAGE'
     A                                 18 19'F6  -  MISCELLANEOUS UPDATE FUNCTI-
     A                                      ONS'
     A            CMDLINSEL2    79A  O 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FMUPDEXC
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                  6 21'MISCELLANEOUS UPDATE FUNCTIONS'
     A                                  9 21'F1  -  EQUIPMENT REFERENCE MAINTEN-
     A                                      ANCE'
     A                                 11 21'F2  -  DUPLICATE A WORK ORDER'
     A                                 13 21'F3  -  EXIT PROGRAM'
     A            COMMANDLN1    79A  O 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPLNFUNC
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                  2  8'P L A N N E R   F U N C T I O N S'
     A                                  2 44'M E N U'
     A                                  5 15'DEPRESS THE FOLLOWING KEY TO:'
     A                                  7 16'F1   -   INITIATE FUNCTIONS'
     A                                  8 16'F2   -   UPDATE FUNCTIONS'
     A                                  9 16'F3   -   EXIT PROGRAM'
     A                                 10 16'F4   -   DISPLAY A WORK ORDER'
     A                                 11 16'F5   -   STORES FUNCTIONS'
     A                                 12 16'F6   -   INQUIRY FUNCTIONS'
     A                                 13 16'F7   -   PRINT FUNCTIONS'
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPRINTWS
     A                                      PUTOVR
     A                                      CF01
     A  98                                  INVITE
     A                                  7  8'ENTER THE WORK ORDER NUMBER OF THE'
     A                                  7 43'WORK SHEET TO BE PRINTED'
     A                                  9 20'THEN DEPRESS THE ENTER KEY'
     A            P6             6A  B 11 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            P7             1A  B 11 34DSPATR(UL)
     A                                      OVRDTA
     A            PREST          3A  B 11 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPRNTWO1
     A                                      PUTOVR
     A                                      CF01
     A  98                                  INVITE
     A                                  4  7'ENTER THE WORK ORDER NUMBERS OF TH-
     A                                      E WORK ORDERS THAT YOU NEED TO HAVE-
     A                                      '
     A                                  6 24'PRINTED AT YOUR CHARACTER PRINTER'
     A            WONUMA         6A  B  9 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            A7             1A  B  9 22DSPATR(UL)
     A            AREST          3A  B  9 24DSPATR(UL)
     A                                      OVRDTA
     A            WONUMB         6A  B  9 29DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            B7             1A  B  9 36DSPATR(UL)
     A            BREST          3A  B  9 38DSPATR(UL)
     A                                      OVRDTA
     A            WONUMC         6A  B  9 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            C7             1A  B  9 50DSPATR(UL)
     A            CREST          3A  B  9 52DSPATR(UL)
     A                                      OVRDTA
     A            WONUMD         6A  B  9 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            D7             1A  B  9 64DSPATR(UL)
     A            DREST          3A  B  9 66DSPATR(UL)
     A                                      OVRDTA
     A            WONU2A         6A  B 11 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            A2             1A  B 11 22DSPATR(UL)
     A            A2REST         3A  B 11 24DSPATR(UL)
     A                                      OVRDTA
     A            WONUB2         6A  B 11 29DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            B2             1A  B 11 36DSPATR(UL)
     A            B2REST         3A  B 11 38DSPATR(UL)
     A                                      OVRDTA
     A            WONUC2         6A  B 11 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            C2             1A  B 11 50DSPATR(UL)
     A            C2REST         3A  B 11 52DSPATR(UL)
     A                                      OVRDTA
     A            WONU2D         6A  B 11 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            D2             1A  B 11 64DSPATR(UL)
     A            D2REST         3A  B 11 66DSPATR(UL)
     A                                      OVRDTA
     A            WONU3A         6A  B 13 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            A3             1A  B 13 22DSPATR(UL)
     A            A3REST         3A  B 13 24DSPATR(UL)
     A                                      OVRDTA
     A            WONU3B         6A  B 13 29DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            B3             1A  B 13 36DSPATR(UL)
     A            B3REST         3A  B 13 38DSPATR(UL)
     A                                      OVRDTA
     A            WONU3C         6A  B 13 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            C3             1A  B 13 50DSPATR(UL)
     A            C3REST         3A  B 13 52DSPATR(UL)
     A                                      OVRDTA
     A            WONU3D         6A  B 13 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            D3             1A  B 13 64DSPATR(UL)
     A            D3REST         3A  B 13 66DSPATR(UL)
     A                                      OVRDTA
     A            WONU4A         6A  B 15 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            A4             1A  B 15 22DSPATR(UL)
     A            A4REST         3A  B 15 24DSPATR(UL)
     A                                      OVRDTA
     A            WONU4B         6A  B 15 29DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            B4             1A  B 15 36DSPATR(UL)
     A            B4REST         3A  B 15 38DSPATR(UL)
     A                                      OVRDTA
     A            WONU4C         6A  B 15 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            C4             1A  B 15 50DSPATR(UL)
     A            C4REST         3A  B 15 52DSPATR(UL)
     A                                      OVRDTA
     A            WONU4D         6A  B 15 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            D4             1A  B 15 64DSPATR(UL)
     A            D4REST         3A  B 15 66DSPATR(UL)
     A                                      OVRDTA
     A            WONU5A         6A  B 17 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            A5             1A  B 17 22DSPATR(UL)
     A            A5REST         3A  B 17 24DSPATR(UL)
     A                                      OVRDTA
     A            WONU5B         6A  B 17 29DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            B5             1A  B 17 36DSPATR(UL)
     A            B5REST         3A  B 17 38DSPATR(UL)
     A                                      OVRDTA
     A            WONU5C         6A  B 17 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            C5             1A  B 17 50DSPATR(UL)
     A            C5REST         3A  B 17 52DSPATR(UL)
     A                                      OVRDTA
     A            WONU5D         6A  B 17 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            D5             1A  B 17 64DSPATR(UL)
     A            D5REST         3A  B 17 66DSPATR(UL)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPRNTWO2
     A                                      PUTOVR
     A                                      CF01
     A  98                                  INVITE
     A                                  4  7'ENTER THE WORK ORDER NUMBERS OF TH-
     A                                      E WORK ORDERS THAT YOU NEED TO HAVE-
     A                                      '
     A                                  6 24'PRINTED AT YOUR CHARACTER PRINTER'
     A                                 20  7'PLACE AN "X" IN THIS BOX IF YOU WA-
     A                                      NT THE PRINTS TO GO TO THE ZONE'
     A                                 21  7'INSTEAD OF YOUR LOCAL CHARACTER PR-
     A                                      INTER'
     A            WONO1Z         6A  B  9 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            Z1             1A  B  9 22DSPATR(UL)
     A            Z1REST         3A  B  9 24DSPATR(UL)
     A                                      OVRDTA
     A            WONO1Y         6A  B  9 29DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            Y1             1A  B  9 36DSPATR(UL)
     A            Y1REST         3A  B  9 38DSPATR(UL)
     A                                      OVRDTA
     A            WONO1X         6A  B  9 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            X1             1A  B  9 50DSPATR(UL)
     A            X1REST         3A  B  9 52DSPATR(UL)
     A                                      OVRDTA
     A            WONO1W         6A  B  9 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            W1             1A  B  9 64DSPATR(UL)
     A            W1REST         3A  B  9 66DSPATR(UL)
     A                                      OVRDTA
     A            WONO2Z         6A  B 11 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            Z2             1A  B 11 22DSPATR(UL)
     A            Z2REST         3A  B 11 24DSPATR(UL)
     A                                      OVRDTA
     A            WONO2Y         6A  B 11 29DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            Y2             1A  B 11 36DSPATR(UL)
     A            Y2REST         3A  B 11 38DSPATR(UL)
     A                                      OVRDTA
     A            WONO2X         6A  B 11 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            X2             1A  B 11 50DSPATR(UL)
     A            X2REST         3A  B 11 52DSPATR(UL)
     A                                      OVRDTA
     A            WONO2W         6A  B 11 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            W2             1A  B 11 64DSPATR(UL)
     A            W2REST         3A  B 11 66DSPATR(UL)
     A                                      OVRDTA
     A            WONO3Z         6A  B 13 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            Z3             1A  B 13 22DSPATR(UL)
     A            Z3REST         3A  B 13 24DSPATR(UL)
     A                                      OVRDTA
     A            WONO3Y         6A  B 13 29DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            Y3             1A  B 13 36DSPATR(UL)
     A            Y3REST         3A  B 13 38DSPATR(UL)
     A                                      OVRDTA
     A            WONO3X         6A  B 13 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            X3             1A  B 13 50DSPATR(UL)
     A            X3REST         3A  B 13 52DSPATR(UL)
     A                                      OVRDTA
     A            WONO3W         6A  B 13 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            W3             1A  B 13 64DSPATR(UL)
     A            W3REST         3A  B 13 66DSPATR(UL)
     A                                      OVRDTA
     A            WON04Z         6A  B 15 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            Z4             1A  B 15 22DSPATR(UL)
     A            Z4REST         3A  B 15 24DSPATR(UL)
     A                                      OVRDTA
     A            WONO4Y         6A  B 15 29DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            Y4             1A  B 15 36DSPATR(UL)
     A            Y4REST         3A  B 15 38DSPATR(UL)
     A                                      OVRDTA
     A            WONO4X         6A  B 15 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            X4             1A  B 15 50DSPATR(UL)
     A            X4REST         3A  B 15 52DSPATR(UL)
     A                                      OVRDTA
     A            WONO4W         6A  B 15 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            W4             1A  B 15 64DSPATR(UL)
     A            W4REST         3A  B 15 66DSPATR(UL)
     A                                      OVRDTA
     A            WONO5Z         6A  B 17 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            Z5             1A  B 17 22DSPATR(UL)
     A            Z5REST         3A  B 17 24DSPATR(UL)
     A                                      OVRDTA
     A            WONO5Y         6A  B 17 29DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            Y5             1A  B 17 36DSPATR(UL)
     A            Y5REST         3A  B 17 38DSPATR(UL)
     A                                      OVRATR
     A            WONO5X         6A  B 17 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            X5             1A  B 17 50DSPATR(UL)
     A            X5REST         3A  B 17 52DSPATR(UL)
     A                                      OVRATR
     A            WONO5W         6A  B 17 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            W5             1A  B 17 64DSPATR(UL)
     A            W5REST         3A  B 17 66DSPATR(UL)
     A                                      OVRATR
     A            N              1A  B 21 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPRTEXES
     A*  89/02/20  08:24:21    T881S03     REL-R01M02  5728-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                  6 23'WORK ORDER PRINT FUNCTIONS'
     A                                  9 18'F1   PRINT A SINGLE WORK ORDER WOR-
     A                                      KSHEET'
     A                                 11 18'F2   MULTIPLE WORK ORDER PRINTS  (-
     A                                      "WP")'
     A                                 13 18'F3   EXIT PROGRAM'
     A            COMMANDLN1    79A  O 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FUPDTEX2
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                  5 24'UPDATE FUNCTION SELECTIONS'
     A                                  8 19'F1  -  UPDATE A SPECIFIC WORK ORDE-
     A                                      R'
     A                                 10 19'F2  -  CONTINUOUS UPDATE OF WORK O-
     A                                      RDERS'
     A                                 12 19'F3  -  EXIT PROGRAM'
     A                                 14 19'F4  -  UPDATE WORK ORDERS TO "DW"'
     A                                 14 53'STATUS'
     A                                 16 19'F5  -  GENERATE WORKSHEET REQUISIT-
     A                                      ION PACKAGE'
     A            COMMANDLN1    79A  O 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FUPDTEXC
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                  5 24'UPDATE FUNCTION SELECTIONS'
     A                                  8 19'F1  -  UPDATE A SPECIFIC WORK ORDE-
     A                                      R'
     A                                 10 19'F2  -  CONTINUOUS UPDATE OF WORK O-
     A                                      RDERS'
     A                                 12 19'F3  -  EXIT PROGRAM'
     A                                 14 19'F4  -  UPDATE WORK ORDERS TO "DW"'
     A                                 14 53'STATUS'
     A            COMMANDLN1    79A  O 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
