     A                                      DSPSIZ(24 80 *DS3)
     A                                      INDARA
     A                                      PRINT
     A                                      CHGINPDFT
     A          R VPMDISPFX
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1'>>>>>>>>  S P E C I F I C   F I X'
     A                                  2 35'E D   D A T E   R E L E A S E S'
     A                                  2 69'O F  <<<<<<'
     A                                  3  1'>>>>>>>>    P R E V E N T I V E'
     A                                  3 35'M A I N T E N A N C E   L E V E L'
     A                                  3 69'S    <<<<<<'
     A                                  4  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  5  3'EQUIPMENT   WO NUMBER   LEVEL'
     A                                      DSPATR(HI)
     A                                  5 35'PRIORITY  NEXT RELEASE DATE    REP-
     A                                      EAT CYCLE'
     A                                      DSPATR(HI)
     A            E1             6A  B  6  4DSPATR(PR)
     A                                      OVRDTA
     A            N1            10A  B  6 15DSPATR(PR)
     A                                      OVRDTA
     A            R1             2A  B  6 28DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  6 38DSPATR(PR)
     A                                      OVRDTA
     A            D1             8A  B  6 50DSPATR(PR)
     A                                      OVRDTA
     A            C1            14A  B  6 66DSPATR(PR)
     A                                      OVRDTA
     A            E2             6A  B  7  4DSPATR(PR)
     A                                      OVRDTA
     A            N2            10A  B  7 15DSPATR(PR)
     A                                      OVRDTA
     A            R2             2A  B  7 28DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B  7 38DSPATR(PR)
     A                                      OVRDTA
     A            D2             8A  B  7 50DSPATR(PR)
     A                                      OVRDTA
     A            C2            14A  B  7 66DSPATR(PR)
     A                                      OVRDTA
     A            E3             6A  B  8  4DSPATR(PR)
     A                                      OVRDTA
     A            N3            10A  B  8 15DSPATR(PR)
     A                                      OVRDTA
     A            R3             2A  B  8 28DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  8 38DSPATR(PR)
     A                                      OVRDTA
     A            D3             8A  B  8 50DSPATR(PR)
     A                                      OVRDTA
     A            C3            14A  B  8 66DSPATR(PR)
     A                                      OVRDTA
     A            E4             6A  B  9  4DSPATR(PR)
     A                                      OVRDTA
     A            N4            10A  B  9 15DSPATR(PR)
     A                                      OVRDTA
     A            R4             2A  B  9 28DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B  9 38DSPATR(PR)
     A                                      OVRDTA
     A            D4             8A  B  9 50DSPATR(PR)
     A                                      OVRDTA
     A            C4            14A  B  9 66DSPATR(PR)
     A                                      OVRDTA
     A            E5             6A  B 10  4DSPATR(PR)
     A                                      OVRDTA
     A            N5            10A  B 10 15DSPATR(PR)
     A                                      OVRDTA
     A            R5             2A  B 10 28DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 10 38DSPATR(PR)
     A                                      OVRDTA
     A            D5             8A  B 10 50DSPATR(PR)
     A                                      OVRDTA
     A            C5            14A  B 10 66DSPATR(PR)
     A                                      OVRDTA
     A            E6             6A  B 11  4DSPATR(PR)
     A                                      OVRDTA
     A            N6            10A  B 11 15DSPATR(PR)
     A                                      OVRDTA
     A            R6             2A  B 11 28DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 11 38DSPATR(PR)
     A                                      OVRDTA
     A            D6             8A  B 11 50DSPATR(PR)
     A                                      OVRDTA
     A            C6            14A  B 11 66DSPATR(PR)
     A                                      OVRDTA
     A            E7             6A  B 12  4DSPATR(PR)
     A                                      OVRDTA
     A            N7            10A  B 12 15DSPATR(PR)
     A                                      OVRDTA
     A            R7             2A  B 12 28DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 12 38DSPATR(PR)
     A                                      OVRDTA
     A            D7             8A  B 12 50DSPATR(PR)
     A                                      OVRDTA
     A            C7            14A  B 12 66DSPATR(PR)
     A                                      OVRDTA
     A            E8             6A  B 13  4DSPATR(PR)
     A                                      OVRDTA
     A            N8            10A  B 13 15DSPATR(PR)
     A                                      OVRDTA
     A            R8             2A  B 13 28DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 13 38DSPATR(PR)
     A                                      OVRDTA
     A            D8             8A  B 13 50DSPATR(PR)
     A                                      OVRDTA
     A            C8            14A  B 13 66DSPATR(PR)
     A                                      OVRDTA
     A            E9             6A  B 14  4DSPATR(PR)
     A                                      OVRDTA
     A            N9            10A  B 14 15DSPATR(PR)
     A                                      OVRDTA
     A            R9             2A  B 14 28DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 14 38DSPATR(PR)
     A                                      OVRDTA
     A            D9             8A  B 14 50DSPATR(PR)
     A                                      OVRDTA
     A            C9            14A  B 14 66DSPATR(PR)
     A                                      OVRDTA
     A            E10            6A  B 15  4DSPATR(PR)
     A                                      OVRDTA
     A            N10           10A  B 15 15DSPATR(PR)
     A                                      OVRDTA
     A            R0             2A  B 15 28DSPATR(PR)
     A                                      OVRDTA
     A            J              1A  B 15 38DSPATR(PR)
     A                                      OVRDTA
     A            D10            8A  B 15 50DSPATR(PR)
     A                                      OVRDTA
     A            C10           14A  B 15 66DSPATR(PR)
     A                                      OVRDTA
     A            E11            6A  B 16  4DSPATR(PR)
     A                                      OVRDTA
     A            N11           10A  B 16 15DSPATR(PR)
     A                                      OVRDTA
     A            L1             2A  B 16 28DSPATR(PR)
     A                                      OVRDTA
     A            K              1A  B 16 38DSPATR(PR)
     A                                      OVRDTA
     A            D11            8A  B 16 50DSPATR(PR)
     A                                      OVRDTA
     A            C11           14A  B 16 66DSPATR(PR)
     A                                      OVRDTA
     A            E12            6A  B 17  4DSPATR(PR)
     A                                      OVRDTA
     A            N12           10A  B 17 15DSPATR(PR)
     A                                      OVRDTA
     A            L2             2A  B 17 28DSPATR(PR)
     A                                      OVRDTA
     A            L              1A  B 17 38DSPATR(PR)
     A                                      OVRDTA
     A            D12            8A  B 17 50DSPATR(PR)
     A                                      OVRDTA
     A            C12           14A  B 17 66DSPATR(PR)
     A                                      OVRDTA
     A            E13            6A  B 18  4DSPATR(PR)
     A                                      OVRDTA
     A            N13           10A  B 18 15DSPATR(PR)
     A                                      OVRDTA
     A            L3             2A  B 18 28DSPATR(PR)
     A                                      OVRDTA
     A            M              1A  B 18 38DSPATR(PR)
     A                                      OVRDTA
     A            D13            8A  B 18 50DSPATR(PR)
     A                                      OVRDTA
     A            C13           14A  B 18 66DSPATR(PR)
     A                                      OVRDTA
     A            E14            6A  B 19  4DSPATR(PR)
     A                                      OVRDTA
     A            N14           10A  B 19 15DSPATR(PR)
     A                                      OVRDTA
     A            L4             2A  B 19 28DSPATR(PR)
     A                                      OVRDTA
     A            O              1A  B 19 38DSPATR(PR)
     A                                      OVRDTA
     A            D14            8A  B 19 50DSPATR(PR)
     A                                      OVRDTA
     A            C14           14A  B 19 66DSPATR(PR)
     A                                      OVRDTA
     A            E15            6A  B 20  4DSPATR(PR)
     A                                      OVRDTA
     A            N15           10A  B 20 15DSPATR(PR)
     A                                      OVRDTA
     A            L5             2A  B 20 28DSPATR(PR)
     A                                      OVRDTA
     A            P              1A  B 20 38DSPATR(PR)
     A                                      OVRDTA
     A            D15            8A  B 20 50DSPATR(PR)
     A                                      OVRDTA
     A            C15           14A  B 20 66DSPATR(PR)
     A                                      OVRDTA
     A            E16            6A  B 21  4DSPATR(PR)
     A                                      OVRDTA
     A            N16           10A  B 21 15DSPATR(PR)
     A                                      OVRDTA
     A            L6             2A  B 21 28DSPATR(PR)
     A                                      OVRDTA
     A            Q              1A  B 21 38DSPATR(PR)
     A                                      OVRDTA
     A            D16            8A  B 21 50DSPATR(PR)
     A                                      OVRDTA
     A            C16           14A  B 21 66DSPATR(PR)
     A                                      OVRDTA
     A            E17            6A  B 22  4DSPATR(PR)
     A                                      OVRDTA
     A            N17           10A  B 22 15DSPATR(PR)
     A                                      OVRDTA
     A            L7             2A  B 22 28DSPATR(PR)
     A                                      OVRDTA
     A            R              1A  B 22 38DSPATR(PR)
     A                                      OVRDTA
     A            D17            8A  B 22 50DSPATR(PR)
     A                                      OVRDTA
     A            C17           14A  B 22 66DSPATR(PR)
     A                                      OVRDTA
     A            E18            6A  B 23  4DSPATR(PR)
     A                                      OVRDTA
     A            N18           10A  B 23 15DSPATR(PR)
     A                                      OVRDTA
     A            L8             2A  B 23 28DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B 23 38DSPATR(PR)
     A                                      OVRDTA
     A            D18            8A  B 23 50DSPATR(PR)
     A                                      OVRDTA
     A            C18           14A  B 23 66DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN f2-CHANGE SORT KE-
     A                                      Y f7-HELP f3/f8-EXIT PROGRAM       -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VPMEXTRACT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  2  2'>>> P R E V I E W   J O B P L A N'
     A                                  2 36'S   A N D   M A T E R I A L   P L'
     A                                  2 70'A N S  <<<'
     A                                  3  2'>>>  F O R   P R E V E N T I V E'
     A                                  3 37'M A I N T E N A N C E   M A S T E'
     A                                  3 71'R S   <<<'
     A                                  4  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  7 20'SELECT MASTER PM WORKORDER:'
     A                                 10 24'INDICATE LEVEL TO PREVIEW:'
     A                                 13  2'Enter Master PM Workorder Number a-
     A                                      nd Level desired and press the "ENT-
     A                                      ER" key.'
     A                                 15  6'NOTE:  Enter "AL" in the Level fie-
     A                                      ld to print all levels of the job'
     A                                 15 74'and'
     A                                 16 13'material plans.'
     A                                 18  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                 20 10'JOBPLAN AND MATERIAL PLAN WILL PRI-
     A                                      NT ON YOUR LOCAL PRINTER'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A            PMMAST         7A  B  7 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            SUF            3A  B  7 57DSPATR(PR)
     A                                      OVRDTA
     A            LEV            2A  B 10 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('  f3-EXIT PROGRAM')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VPMFXMENU
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  2  2'>>>>>>>  S P E C I F I C   F I X E'
     A                                  2 37'D   D A T E   R E L E A S E S   O'
     A                                  2 71'F  <<<<<<'
     A                                  3  2'>>>>>>>    P R E V E N T I V E   M'
     A                                  3 37'A I N T E N A N C E   L E V E L S'
     A                                  3 74'<<<<<<'
     A                                  4  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  6 22'ENTER EQUIPMENT NUMBER:'
     A                                  7  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  9 17'PRESS APPROPRIATE FUNCTION KEY:'
     A                                 11 26'f2  -  ADD NEW RECORD'
     A                                 13 26'f4  -  DELETE EXISTING RECORD'
     A                                 15 26'f5  -  DISPLAY EXISTING FIXED DATE'
     A                                 15 61'RECORDS'
     A                                 17 26'f8  -  CHANGE EXISTING RECORD'
     A                                 19  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                 21  4'PRESS "f1" TO RETURN TO MAIN INPUT'
     A                                 21 39'SCREEN.  PRESS "f3" TO END PROGRAM-
     A                                      .'
     A                                 23  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            EQPNUM         6A  B  6 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN f2-ADD f4-DELETE -
     A                                      f5-DISPLAY INQUIRY f8-CHANGE')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VPMSELECT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  2  2'>>>>>>>  S P E C I F I C   F I X E'
     A                                  2 37'D   D A T E   R E L E A S E S   O'
     A                                  2 71'F  <<<<<<'
     A                                  3  2'>>>>>>>    P R E V E N T I V E   M'
     A                                  3 37'A I N T E N A N C E   L E V E L S'
     A                                  3 74'<<<<<<'
     A                                  4  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  7 21'SELECT SORT FIELD FOR INQUIRY DISP-
     A                                      LAY:'
     A                                 10 30'EQUIPMENT NUMBER:'
     A                                 12 30'WORKORDER NUMBER:'
     A                                 14 26'DATE OF NEXT RELEASE:'
     A                                 17  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                 19 13'PLACE AN "X" IN ONE FIELD ABOVE AN-
     A                                      D PRESS THE "ENTER" KEY.'
     A            A              1A  B 10 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            B              1A  B 12 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            C              1A  B 14 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN f7-HELP f3/f8-EXI-
     A                                      T PROGRAM                          -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VPMSPECA
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  2  6'R E L E A S E   P M   L E V E L'
     A                                  2 40'O N   A   S P E C I F I C   D A T'
     A                                  2 74'E'
     A                                  3  1'**********************************-
     A                                      ***********************************-
     A                                      ***********'
     A                                  5 26'EQUIPMENT NUMBER:'
     A                                  7 23'PM WORKORDER NUMBER:'
     A                                  7 53'000'
     A                                  9  1'**********************************-
     A                                      ***********************************-
     A                                      ***********'
     A                                 11 27'PM LEVEL NUMBER:'
     A                                 13 24'WORKORDER PRIORITY:'
     A                                 15 22'DATE OF NEXT RELEASE:'
     A                                 17 31'REPEAT FLAG:'
     A                                 17 48'(LEAVE BLANK FOR NO REPEAT)'
     A                                 19  5'W - Weekly'
     A                                 19 17'M - Monthly'
     A                                 19 30'Q - Quarterly'
     A                                 19 45'S - Semi-Annually'
     A                                 19 64'A - Annually'
     A                                 21  1'**********************************-
     A                                      ***********************************-
     A                                      ***********'
     A                                 23 21'ENTER DATA AND PRESS THE "ENTER" K-
     A                                      EY.'
     A            EQPNUM         6A  B  5 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            PMWONO         7A  B  7 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            LV             2A  B 11 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            P              1A  B 13 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            DATEMM         2A  B 15 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            DATEDD         2A  B 15 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            DATEYY         2A  B 15 51DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            DFORMAT        8A  B 15 58DSPATR(PR)
     A                                      OVRDTA
     A            CYCLE          1A  B 17 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN f7-HELP f3/f8-EXI-
     A                                      T PROGRAM                          -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VPMSPECC
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  2  6'>>>>>>>>>>>>  C H A N G E   E X I'
     A                                  2 40'S T I N G   R E C O R D  <<<<<<<<<-
     A                                      <'
     A                                  3  6'R E L E A S E   P M   L E V E L'
     A                                  3 40'O N   A   S P E C I F I C   D A T'
     A                                  3 74'E'
     A                                  4  1'**********************************-
     A                                      ***********************************-
     A                                      ***********'
     A                                  6 26'EQUIPMENT NUMBER:'
     A                                  8 23'PM WORKORDER NUMBER:'
     A                                  8 53'000'
     A                                 10  1'**********************************-
     A                                      ***********************************-
     A                                      ***********'
     A                                 12 27'PM LEVEL NUMBER:'
     A                                 14 24'WORKORDER PRIORITY:'
     A                                 16 22'DATE OF NEXT RELEASE:'
     A                                 18 31'REPEAT FLAG:'
     A                                 18 48'(LEAVE BLANK FOR NO REPEAT)'
     A                                 19  5'W - Weekly'
     A                                 19 17'M - Monthly'
     A                                 19 30'Q - Quarterly'
     A                                 19 45'S - Semi-Annually'
     A                                 19 64'A - Annually'
     A                                 21  1'**********************************-
     A                                      ***********************************-
     A                                      ***********'
     A                                 22  8'PRESS THE "f4" KEY UNTIL THE RECOR-
     A                                      D TO BE CHANGED IS DISPLAYED,'
     A                                 23 17'THEN CHANGE DATA AND PRESS THE "EN-
     A                                      TER" KEY.'
     A            EQPNUM         6A  B  6 45DSPATR(PR)
     A                                      OVRDTA
     A            PMWONO         7A  B  8 45DSPATR(PR)
     A                                      OVRDTA
     A            LV             2A  B 12 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            P              1A  B 14 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            DATEMM         2A  B 16 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            DATEDD         2A  B 16 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            DATEYY         2A  B 16 51DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            DFORMAT        8A  B 16 58DSPATR(PR)
     A                                      OVRDTA
     A            CYCLE          1A  B 18 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN f4-NEXT RECORD f7-
     A                                      -HELP f3/f8-EXIT PROGRAM           -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VPMSPECD
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'**********************************-
     A                                      ***********************************-
     A                                      **********'
     A                                  2  6'>>>>>>>>>>>  D E L E T E   E X I S'
     A                                  2 41'T I N G   R E C O R D  <<<<<<<<<<<'
     A                                  3  6'R E L E A S E   P M   L E V E L'
     A                                  3 40'O N   A   S P E C I F I C   D A T'
     A                                  3 74'E'
     A                                  4  1'**********************************-
     A                                      ***********************************-
     A                                      ***********'
     A                                  6 26'EQUIPMENT NUMBER:'
     A                                  8 23'PM WORKORDER NUMBER:'
     A                                  8 53'000'
     A                                 10  1'**********************************-
     A                                      ***********************************-
     A                                      ***********'
     A                                 12 27'PM LEVEL NUMBER:'
     A                                 14 24'WORKORDER PRIORITY:'
     A                                 16 22'DATE OF NEXT RELEASE:'
     A                                 18 31'REPEAT FLAG:'
     A                                 20  1'**********************************-
     A                                      ***********************************-
     A                                      ***********'
     A                                 21  8'PRESS THE "f4" KEY UNTIL THE RECOR-
     A                                      D TO BE DELETED IS DISPLAYED,'
     A                                 22 16'THEN PRESS THE "ENTER" KEY TO DELE-
     A                                      TE THE RECORD.'
     A                                 23  4'PRESS THE "f1" OR "f3" KEY TO EXIT'
     A                                 23 39'THE SCREEN WITHOUT DELETING THE RE-
     A                                      CORD.'
     A            EQPNUM         6A  B  6 45DSPATR(PR)
     A                                      OVRDTA
     A            PMWONO         7A  B  8 45DSPATR(PR)
     A                                      OVRDTA
     A            LV             2A  B 12 45DSPATR(PR)
     A                                      OVRDTA
     A            P              1A  B 14 45DSPATR(PR)
     A                                      OVRDTA
     A            DATEMM         2A  B 16 45DSPATR(PR)
     A                                      OVRDTA
     A            DATEDD         2A  B 16 48DSPATR(PR)
     A                                      OVRDTA
     A            DATEYY         2A  B 16 51DSPATR(PR)
     A                                      OVRDTA
     A            CYCLE          1A  B 18 45DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-RETURN f4-NEXT RECORD f7-
     A                                      -HELP f3/f8-EXIT PROGRAM           -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
