     A*%%TS  DD  19941025  065247  T881S32     REL-V2R3M0  5738-CD1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A          R VHELP00
     A*%%TS  DD  19930825  155414  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P     I  N  F  O  R  M  A'
     A                                  2 54'T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 14'ERROR IN HELP FUNCTION OF PM FILE'
     A                                  4 48'MAINTENANCE SYSTEM'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 20'PLEASE NOTIFY THE AKRON PROGRAMMIN-
     A                                      G STAFF.'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 27'FORMS CONTROL CODE IS:'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'-----------------------------------
     A                                      ------------------------------------
     A                                      -- 000 --'
     A            FCC            4A  B 13 51DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3-RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP1
     A*%%TS  SD  19930809  105256  A193138     REL-V2R2M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 24'PM Master Schedule Maintenance'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':   This program allows the creati-
     A                                      on and maintenance of a PM Master S-
     A                                      chedule.:'
     A                                  8  2': A master schedule name is entere-
     A                                      d and the ENTER key is pressed.  If-
     A                                       the    :'
     A                                  9  2': schedule already exists, it will-
     A                                       display for modification  If it do-
     A                                      es not  :'
     A                                 10  2': exist, the program will go into -
     A                                      ADD-MODE for data entry.           -
     A                                              :'
     A                                 11  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 12  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 13  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 14  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':   Calendar Schedules may be crea-
     A                                      ted or maintained by pressing the F-
     A                                      4 key.  :'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 001 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3-RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP2
     A*%%TS  DD  19930825  155414  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 22'PM SCHEDULE MAINTENANCE DISPLAY SC-
     A                                      REEN'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':   This screen allows specific ma-
     A                                      intenance to an existing PM schedul-
     A                                      e.      :'
     A                                  7  2':'
     A                                  7 79':'
     A                                  8  2':   ADD     An "A" may be entered'
     A                                  8 36'in the transaction field to add ad-
     A                                      ditional :'
     A                                  9  2':'
     A                                  9 14'records (levels) to the schedule.'
     A                                  9 79':'
     A                                 10  2':   CHANGE  A "C" entered in the t-
     A                                      ransaction field followed by a spec-
     A                                      ific    :'
     A                                 11  2':'
     A                                 11 14'level number will open that record'
     A                                 11 49'for changing.'
     A                                 11 79':'
     A                                 12  2':   DELETE  A "D" entered in the t-
     A                                      ransaction field followed by a spec-
     A                                      ific    :'
     A                                 13  2':'
     A                                 13 14'level number will open that record'
     A                                 13 49'for deletion.'
     A                                 13 79':'
     A                                 14  2':   INSERT  An "I" entered in the'
     A                                 14 36'transaction field followed by an e-
     A                                      xisting  :'
     A                                 15  2':'
     A                                 15 14'level number will insert a new rec-
     A                                      ord at that level and move     :'
     A                                 16  2':'
     A                                 16 14'all subsequent levels one number h-
     A                                      igher.'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2': NOTE:  Changes are shown on the'
     A                                 18 36'screen but are not written to the'
     A                                 18 70'file     :'
     A                                 19  2':'
     A                                 19 11'until the "f5" key is pressed to s-
     A                                      ave the changed data.  If the'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 11'"f4" key is pressed, the existing'
     A                                 20 45'file data is written to the'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 11'screen, thus cancelling any change-
     A                                      s that have been made since the'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 11'last save.  This is how you may "U-
     A                                      ndo" changes made in error.'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 002 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3-RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP21
     A*%%TS  SD  19930809  105256  A193138     REL-V2R2M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 35'ADD MODE'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':    When in ADD-MODE, the program'
     A                                  7 37'will generate sequential levels ea-
     A                                      ch time :'
     A                                  8  2': the data is entered and the ENTE-
     A                                      R key is pressed.'
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 79':'
     A                                 10  2':    DATA:  Cycle time     - PM fr-
     A                                      equency in days'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 14'Pre-Release    - Days before sched-
     A                                      uled date that the workorder   :'
     A                                 12  2':'
     A                                 12 31'should be released to the planner'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 14'Critical Time  - Days after releas-
     A                                      e that the PM becomes critical :'
     A                                 14  2':'
     A                                 14 31'if not yet completed (input at lev-
     A                                      el 1 only)    :'
     A                                 15  2':'
     A                                 15 14'Priority'
     A                                 15 29'- Workorder priority (number 1 to'
     A                                 15 63'5)'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 14'Fixed Cycle    - Designates level'
     A                                 16 48'to be fixed rather than'
     A                                 16 79':'
     A                                 17  2':                            dynam-
     A                                      ic.  Enter Y for Fixed Cycle.      -
     A                                              :'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':    Press the "f2" key to end ADD-
     A                                      -MODE and return to the standard di-
     A                                      splay   :'
     A                                 20  2': screen.'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 021 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3-RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP211
     A*%%TS  SD  19930809  105256  A193138     REL-V2R2M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 35'ADD LEVEL'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':    An "A" in the transaction fie-
     A                                      ld followed by the a higher level'
     A                                  7 70'number,  :'
     A                                  8  2': will add one level record to the'
     A                                  8 37'end of the schedule.'
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 79':'
     A                                 10  2':    DATA:  Cycle time     - PM fr-
     A                                      equency in days'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 14'Pre-Release    - Days before sched-
     A                                      uled date that the workorder   :'
     A                                 12  2':'
     A                                 12 31'should be released to the planner'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 14'Critical Time  - Days after releas-
     A                                      e that the PM becomes critical :'
     A                                 14  2':'
     A                                 14 31'if not yet completed (input at lev-
     A                                      el 1 only)    :'
     A                                 15  2':'
     A                                 15 14'Priority'
     A                                 15 29'- Workorder priority (number 1 to'
     A                                 15 63'5)'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 14'Fixed Cycle    - Designates level'
     A                                 16 48'to be fixed rather than'
     A                                 16 79':'
     A                                 17  2':                            dynam-
     A                                      ic.  Enter Y for Fixed Cycle.      -
     A                                              :'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 211 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3-RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP22
     A*%%TS  DD  19930825  155414  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 33'INSERT LEVEL'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':    An "I" in the transaction fie-
     A                                      ld followed by an existing level nu-
     A                                      mber,   :'
     A                                  8  2': will create a new record at that'
     A                                  8 37'number, and move each higher level'
     A                                  8 72'up     :'
     A                                  9  2': one level.'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 022 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3-RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP23
     A*%%TS  DD  19930825  155414  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 33'CHANGE LEVEL'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':    A "C" in the transaction fiel-
     A                                      d followed by an existing level num-
     A                                      ber,    :'
     A                                  8  2': will open that record for modifi-
     A                                      cation.  The data will appear on th-
     A                                      e data  :'
     A                                  9  2': input line and the open fields m-
     A                                      ay be changed as desired.  When the'
     A                                  9 79':'
     A                                 10  2': "ENTER" key is pressed, the new'
     A                                 10 36'data is written to the file.'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 023 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3-RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP24
     A*%%TS  DD  19930825  155414  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 33'DELETE LEVEL'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':    A "D" in the transaction fiel-
     A                                      d followed by an existing level num-
     A                                      ber,    :'
     A                                  8  2': will open that record for deleti-
     A                                      on.  The data will appear on the da-
     A                                      ta      :'
     A                                  9  2': input line and when the "ENTER"'
     A                                  9 36'key is pressed, the record is dele-
     A                                      ted.     :'
     A                                 10  2': Any remaining levels will re-num-
     A                                      ber themselves accordingly.'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 024 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3-RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP25
     A*%%TS  SD  19930809  105256  A193138     REL-V2R2M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':                       PM SCHEDUL-
     A                                      E CHANGE WARNING SCREEN            -
     A                                              :'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2': The Workorders listed on this wa-
     A                                      rning screen will have their Schedu-
     A                                      les     :'
     A                                  8  2': Stopped and MUST be Reinitiated.-
     A                                        This warning is given to let the -
     A                                      user    :'
     A                                  9  2': know what schedules are being ef-
     A                                      fected by making a change to the Ma-
     A                                      ster    :'
     A                                 10  2': Schedule.  The user may cancel t-
     A                                      he change to the Master Schedule by-
     A                                              :'
     A                                 11  2': pressing the F3 or F8 key.  To c-
     A                                      ontinue with the change and stoppin-
     A                                      g       :'
     A                                 12  2': of the schedules, type CONTINUE -
     A                                      and press the ENTER key.  The F2 an-
     A                                      d       :'
     A                                 13  2': F4 keys may be used to page back-
     A                                      ward and forward through the list. -
     A                                              :'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 025 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3-RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP3
     A*%%TS  DD  19930825  155414  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 30'SAVE ALARM SCREEN'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':    You have changed an existing'
     A                                  7 36'PM schedule on the screen, but you'
     A                                  7 71'have    :'
     A                                  8  2': not written the changes to the f-
     A                                      ile (by pressing the "f5" save reco-
     A                                      rds     :'
     A                                  9  2': key.)'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':    If your press the "f3" key, y-
     A                                      ou will exit the program without sa-
     A                                      ving    :'
     A                                 12  2': the changes; thus leaving the sc-
     A                                      hedule as it was last saved.  This'
     A                                 12 71'will    :'
     A                                 13  2': lose any changes you have made s-
     A                                      ince the last save.'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':    If you press the "ENTER" key'
     A                                 15 36'(or any other function key) you wi-
     A                                      ll'
     A                                 15 79':'
     A                                 16  2': return to the input screen where'
     A                                 16 37'you may either save or make furthe-
     A                                      r'
     A                                 16 79':'
     A                                 17  2': changes to the PM schedule.'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 003 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3-RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP31
     A*%%TS  DD  19930825  155414  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 23'Preventive Maintenance Jobplan Edi-
     A                                      tor'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':  f1 - Generate new Jobplan or ne-
     A                                      w task on existing Jobplan.'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':  f2 - Edit existing task on Jobp-
     A                                      lan, or if task number supplied doe-
     A                                      s not   :'
     A                                 10  2':'
     A                                 10 12'exist, will generate new task.'
     A                                 10 79':'
     A                                 11  2':  f3 - Exit Screen'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':  f4 - Copy entire Jobplan named'
     A                                 13 36'on this screen to new Jobplan name-
     A                                      .'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':  f5 - Renumber Tasks on Jobplan'
     A                                 15 36'named on this screen.'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':  f6 - Delete ALL tasks of Jobpla-
     A                                      n named on this screen.'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':  f7 - HELP -  displays this pane-
     A                                      l.'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':  f8 - Exit Screen'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 031 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP314
     A*%%TS  DD  19930825  155414  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 23'Preventive Maintenance Jobplan Edi-
     A                                      tor'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':     All tasks of the Jobplan wil-
     A                                      l be copied a new Jobplan named her-
     A                                      e:      :'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':     Enter New Jobplan Name and J-
     A                                      obplan Title and press the ENTER ke-
     A                                      y.      :'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 314 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP315
     A*%%TS  DD  19930825  155414  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 23'Preventive Maintenance Jobplan Edi-
     A                                      tor'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':  All tasks of the Jobplan will b-
     A                                      e renumbered by the sequencing incr-
     A                                      ement   :'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':  indicated and starting with the'
     A                                  9 37'task number selected.'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':    EXAMPLE:'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':      A Jobplan with 4 tasks numb-
     A                                      ered 1, 2, 3, and 4, if resequenced'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':      by 5 starting with number 1-
     A                                      0 would end up with 4 tasks numbere-
     A                                      d'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':      10, 15, 20, and 25.'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':  This function allows the insert-
     A                                      ion of new tasks between existing'
     A                                 20 70'tasks.   :'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 315 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP316
     A*%%TS  DD  19930825  155414  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 23'Preventive Maintenance Jobplan Edi-
     A                                      tor'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':     All tasks of the Jobplan nam-
     A                                      ed here will be deleted if there ar-
     A                                      e'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':     no active workorders linked'
     A                                  9 36'to the Jobplan.  Workorders are co-
     A                                      nsidered :'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':     active in any status other t-
     A                                      han "FF".'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':     To confirm the deletion of t-
     A                                      he entire Jobplan, enter a "Y" in'
     A                                 14 70'the      :'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':     confirmation field and press'
     A                                 16 37'the ENTER KEY.  Entry of any other'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':     character will cancel the de-
     A                                      letion function.'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 316 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP321
     A*%%TS  DD  19930825  155414  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 23'Preventive Maintenance Jobplan Edi-
     A                                      tor'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2': f1 -'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2': f2 - Toggle to the TEXT panel -'
     A                                  9 36'will only toggle if the data suppl-
     A                                      ied      :'
     A                                 10  2':'
     A                                 10 11'passes the edit checks.  The TEXT'
     A                                 10 45'panel allows entry of task text.'
     A                                 10 79':'
     A                                 11  2': f3 - Save changes on screen and'
     A                                 11 36'edit the previous task in the task'
     A                                 11 71'list.   :'
     A                                 12  2':'
     A                                 12 11'If task displayed is the first tas-
     A                                      k in the list there is no change.'
     A                                 12 79':'
     A                                 13  2': f4 - Save changes on screen and'
     A                                 13 36'edit the next task in the task lis-
     A                                      t.  If   :'
     A                                 14  2':'
     A                                 14 11'task displayed is the last task in'
     A                                 14 46'the list, will generate new task.:'
     A                                 15  2': f5 -'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2': f6 - Displays Additional Options'
     A                                 17 37'Menu from which task displayed may'
     A                                 17 72'be     :'
     A                                 18  2':'
     A                                 18 11'copied, moved, re-sequenced, or de-
     A                                      leted.'
     A                                 18 79':'
     A                                 19  2': f7 - HELP -  displays this panel-
     A                                      .'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2': f8 - Exit EDIT mode.  Allows opt-
     A                                      ions to save changes or not if desi-
     A                                      red.    :'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 321 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP322
     A*%%TS  DD  19930825  155414  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 23'Preventive Maintenance Jobplan Edi-
     A                                      tor'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2': f1 - Toggle to the Heading panel'
     A                                  6 37'where the task header may be chang-
     A                                      ed or   :'
     A                                  7  2':'
     A                                  7 11'to get to the Additional Options M-
     A                                      enu.'
     A                                  7 79':'
     A                                  8  2': f2 - Toggle to the EDIT panel -'
     A                                  8 36'The EDIT panel allows manipulation'
     A                                  8 71'of the  :'
     A                                  9  2':'
     A                                  9 11'lines of text in the task:  copy,'
     A                                  9 45'move, insert, delete, etc.'
     A                                  9 79':'
     A                                 10  2': f3 - Save changes on screen and'
     A                                 10 36'edit the previous task in the task'
     A                                 10 71'list.   :'
     A                                 11  2':'
     A                                 11 11'If task displayed is the first tas-
     A                                      k in the list there is no change.'
     A                                 11 79':'
     A                                 12  2': f4 - Save changes on screen and'
     A                                 12 36'edit the next task in the task lis-
     A                                      t.  If   :'
     A                                 13  2':'
     A                                 13 11'task displayed is the last task in'
     A                                 13 46'the list, will generate new task.:'
     A                                 14  2': f5 - Display next 16 lines of th-
     A                                      e task text.  Note:  Last line show-
     A                                      n on    :'
     A                                 15  2':'
     A                                 15 11'screen will overlap to the next sc-
     A                                      reen at the first line.'
     A                                 15 79':'
     A                                 16  2': f6 - Display previous 16 lines o-
     A                                      f the task text.  Note:  First line-
     A                                       shown  :'
     A                                 17  2':'
     A                                 17 11'on screen will overlap to the prev-
     A                                      ious screen at the last line.'
     A                                 17 79':'
     A                                 18  2': f7 - HELP -  displays this panel-
     A                                      .'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2': f8 - Exit EDIT mode.  Allows opt-
     A                                      ions to save changes or not if desi-
     A                                      red.    :'
     A                                 21  2':   Go-to-line field:  enter task'
     A                                 21 36'text line number to be displayed;'
     A                                 21 70'also     :'
     A                                 22  2':   accepts "T" (top), "F" (first)-
     A                                      , "B" )bottom), "L" (last)'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 322 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP323
     A*%%TS  SD  19930809  105256  A193138     REL-V2R2M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 23'Preventive Maintenance Jobplan Edi-
     A                                      tor'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2': All function keys and the Go-to--
     A                                      field perform the same as the TEXT'
     A                                  6 71'panel   :'
     A                                  7  2': except that the f2 key will togg-
     A                                      le from the EDIT panel to the TEXT'
     A                                  7 71'panel.  :'
     A                                  8  2': VALID EDIT CODES:'
     A                                  8 79':'
     A                                  9  2':    A  -  Start a move or copy on'
     A                                  9 37'the line after this line'
     A                                  9 79':'
     A                                 10  2':    B  -  End a move or copy on t-
     A                                      he line before this line'
     A                                 10 79':'
     A                                 11  2':    C  -  Copy this line to the "-
     A                                      A" or "B" line'
     A                                 11 79':'
     A                                 12  2':    CC -  Mark a block of lines (-
     A                                      2 or more) to be copied to "A" or'
     A                                 12 70'"B" line :'
     A                                 13  2':    D  -  Delete this line'
     A                                 13 79':'
     A                                 14  2':    DD -  Delete a block of lines'
     A                                 14 79':'
     A                                 15  2':    M  -  Move this line to the "-
     A                                      A" or "B" line'
     A                                 15 79':'
     A                                 16  2':    MM -  Mark a block of lines (-
     A                                      2 or more) to be moved to "A" or "B-
     A                                      " line  :'
     A                                 17  2':    Ix -  Insert blank lines afte-
     A                                      r this line for addition of new dat-
     A                                      a       :'
     A                                 19  2':    II -  Insert blank lines from'
     A                                 19 37'this line to end of screen for new'
     A                                 19 72'data   :'
     A                                 20  2':    AP -  Associate a CSIS part w-
     A                                      ith this line of data'
     A                                 20 79':'
     A                                 21  2':    CP -  Change CSIS part inform-
     A                                      ation associated with this line of'
     A                                 21 71'data    :'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 323 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A                                 22  2':    DP -  Delete CSIS part inform-
     A                                      ation associated with this line of -
     A                                      data    :'
     A                                 18  2':          where x is blank (for 1-
     A                                      ) or any digit to 9.               -
     A                                              :'
     A          R VHELP324
     A*%%TS  SD  19930809  105256  A193138     REL-V2R2M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 23'Preventive Maintenance Jobplan Edi-
     A                                      tor'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':  This screen allows the associat-
     A                                      ion of a CSIS part to a specific li-
     A                                      ne of   :'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':  the task description.  Enter th-
     A                                      e CSIS Corporate Code number desire-
     A                                      d,      :'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':  enter the quantity desired, ent-
     A                                      er any descriptive remarks you wish-
     A                                       to     :'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':  appear on the Craft Worksheet,'
     A                                 13 36'and press the ENTER key.'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':  If a part was already associate-
     A                                      d with this line, the data will app-
     A                                      ear in  :'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':  the fields and may be changed a-
     A                                      s desired.  CSIS Corporate Code Inq-
     A                                      uiries  :'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':  may be accessed by Pressing the-
     A                                       F1 key.                           -
     A                                              :'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 324 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP33
     A*%%TS  DD  19930825  155414  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 23'Preventive Maintenance Jobplan Edi-
     A                                      tor'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':  f1 - COPY the task being edited'
     A                                  7 37'to a new task number in this or an-
     A                                      other   :'
     A                                  8  2':'
     A                                  8 12'Jobplan.'
     A                                  8 79':'
     A                                  9  2':  f2 - MOVE the task being edited'
     A                                  9 37'to a new task number in this or an-
     A                                      other   :'
     A                                 10  2':'
     A                                 10 12'Jobplan.'
     A                                 10 79':'
     A                                 11  2':  f3 - Return to EDIT mode.'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':  f4 - Select or change task numb-
     A                                      ering increment for task being edit-
     A                                      ed.     :'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':  f5 -'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':  f6 - Delete ALL data of task be-
     A                                      ing edited.'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':  f7 - HELP -  displays this pane-
     A                                      l.'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':  f8 - Return to EDIT mode.'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 033 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP331
     A*%%TS  DD  19930825  155414  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 23'Preventive Maintenance Jobplan Edi-
     A                                      tor'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':    COPY the task being edited to'
     A                                  7 37'a new task number in this or anoth-
     A                                      er      :'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':    Jobplan.  Enter the new task'
     A                                  9 36'number (it must not already exist)'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':    and the Jobplan Name to which'
     A                                 11 37'the task is to be copied and press'
     A                                 11 72'the    :'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':    ENTER key.  If the new Jobpla-
     A                                      n Name does not already exist, the'
     A                                 13 71'copy    :'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':    will create it and you will b-
     A                                      e asked to enter a Jobplan Title fo-
     A                                      r the   :'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':    new Jobplan.'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':    NOTE:  The existing task bein-
     A                                      g copied is not changed.'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 331 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP332
     A*%%TS  DD  19930825  155414  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 23'Preventive Maintenance Jobplan Edi-
     A                                      tor'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':    MOVE the task being edited to'
     A                                  7 37'a new task number in this or anoth-
     A                                      er      :'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':    Jobplan.  Enter the new task'
     A                                  9 36'number (it must not already exist)'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':    and the Jobplan Name to which'
     A                                 11 37'the task is to be moved and press'
     A                                 11 71'the     :'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':    ENTER key.  If the new Jobpla-
     A                                      n Name does not already exist, the'
     A                                 13 71'move    :'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':    will create it and you will b-
     A                                      e asked to enter a Jobplan Title fo-
     A                                      r the   :'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':    new Jobplan.'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':    NOTE:  The existing task bein-
     A                                      g moved will no longer exist.'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 332 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP336
     A*%%TS  DD  19930825  155414  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 23'Preventive Maintenance Jobplan Edi-
     A                                      tor'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':     The task being edited will b-
     A                                      e deleted if confirmed by the edito-
     A                                      r.      :'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':     To confirm the deletion of t-
     A                                      he task, enter a "Y" in the confirm-
     A                                      ation   :'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':     field and press the ENTER KE-
     A                                      Y.  Entry of any other character wi-
     A                                      ll      :'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':     cancel the deletion function-
     A                                      .'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 336 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP34
     A*%%TS  DD  19930825  155414  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 23'Preventive Maintenance Jobplan Edi-
     A                                      tor'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':  f1 - Display Previous task in t-
     A                                      he task list WITHOUT saving changes-
     A                                       to     :'
     A                                  7  2':'
     A                                  7 12'task displayed on this screen.'
     A                                  7 79':'
     A                                  8  2':  f2 - Display Next task in the t-
     A                                      ask list WITHOUT saving changes to'
     A                                  8 71'task    :'
     A                                  9  2':'
     A                                  9 12'displayed on this screen.'
     A                                  9 79':'
     A                                 10  2':  f3 - Go to task entered in fiel-
     A                                      d WITHOUT saving changes to current-
     A                                      task.'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':  f4 - Go to task entered in fiel-
     A                                      d and save changes to current task.'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':  f5 - Exit EDIT mode WITHOUT sav-
     A                                      ing changes to the task displayed'
     A                                 14 70'on this  :'
     A                                 15  2':'
     A                                 15 12'screen.'
     A                                 15 79':'
     A                                 16  2':  f6 - Exit EDIT mode and SAVE ch-
     A                                      anges made to task displayed on thi-
     A                                      s'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 12'screen.'
     A                                 17 79':'
     A                                 18  2':  f7 - HELP -  displays this pane-
     A                                      l.'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':  f8 -'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':  ENTER KEY - Will SAVE changes t-
     A                                      o task displayed and return to EDIT-
     A                                       mode.  :'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 034 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP4
     A*%%TS  SD  19930809  105256  A193138     REL-V2R2M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':               Preventive Mainten-
     A                                      ance Forecaster and Simulator      -
     A                                              :'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':                                 -
     A                                                                         -
     A                                              :'
     A                                  7  2':      f1 - Displays a Forecast of-
     A                                       PM Workorders to be released accor-
     A                                      ding to :'
     A                                  8  2':             the Search Criteria -
     A                                      that is Entered.                   -
     A                                              :'
     A                                  9  2':      f2 - Displays audit of PM a-
     A                                      ctivity for a piece of equipment, a-
     A                                       master :'
     A                                 10  2':             or a suffixed PM wor-
     A                                      korder.                            -
     A                                              :'
     A                                 11  2':      f3 - Return to PM Reports a-
     A                                      nd On-Line Inquiries Menu.         -
     A                                              :'
     A                                 12  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 13  2':      f4 - Simulate a Schedule fo-
     A                                      r a Master Workorder without affect-
     A                                      ing the :'
     A                                 14  2':             live Schedule.      -
     A                                                                         -
     A                                              :'
     A                                 15  2':      f5 - Displays Simulated Sch-
     A                                      edules according to the Search Crit-
     A                                      eria    :'
     A                                 16  2':             that is Entered.    -
     A                                                                         -
     A                                              :'
     A                                 17  2':      f6 - Prints Workorder Track-
     A                                      ing records for a selected workorde-
     A                                      r.      :'
     A                                 18  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 19  2':      f7 - HELP - displays this p-
     A                                      anel.                              -
     A                                              :'
     A                                 20  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 21  2':      f8 - Return to PM Reports a-
     A                                      nd On-Line Inquiries Menu.         -
     A                                              :'
     A                                 22  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 004 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3-RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP406
     A*%%TS  DD  19930825  155414  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':                EXPAND CALENDAR S-
     A                                      CREEN TO NINE MONTH DISPLAY        -
     A                                              :'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':  The f2 or f3 keys will re-displ-
     A                                      ay the screen three months up or do-
     A                                      wn from :'
     A                                  8  2':  the current display.  The f5 or-
     A                                       f6 keys will re-display the full s-
     A                                      creen   :'
     A                                  9  2':  (nine months) up or down from t-
     A                                      he current display.                -
     A                                              :'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':  On the first screen, the month--
     A                                      of-interest carried from the callin-
     A                                      g       :'
     A                                 12  2':  program will always be displaye-
     A                                      d as the center month.  On exiting -
     A                                      this    :'
     A                                 13  2':  program, the month-of-interest -
     A                                      will re-display in the calling prog-
     A                                      ram.    :'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 406 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP41
     A*%%TS  SD  19930809  105256  A193138     REL-V2R2M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':             PM Forecaster/Simula-
     A                                      tor Selection Criteria Screen      -
     A                                              :'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2': Enter the selection criteria and-
     A                                       press the ENTER key.  Any entries -
     A                                      in the  :'
     A                                  8  2':                                 -
     A                                                                         -
     A                                              :'
     A                                  9  2': fields will limit the inquiry to-
     A                                       that criteria.  If no entry is mad-
     A                                      e in    :'
     A                                 10  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 11  2': the field, it is assumed that yo-
     A                                      u want ALL to be returned.  For exa-
     A                                      mple,   :'
     A                                 12  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 13  2': if no entry was entered in the W-
     A                                      orkorder field, all workorders woul-
     A                                      d       :'
     A                                 14  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 15  2': be returned for your inquiry or -
     A                                      report.  Also, enter the sort crite-
     A                                      ria     :'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2': and if you would like to get a p-
     A                                      rinted report instead of the on-lin-
     A                                      e       :'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2': inquiry.                        -
     A                                                                         -
     A                                              :'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 041 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3-RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP42
     A*%%TS  SD  19930809  105256  A193138     REL-V2R2M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':                    PM Forecaster-
     A                                      /Simulator Report Screen           -
     A                                              :'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':    This screen displays the Fore-
     A                                      cast/Simulation for the Selection C-
     A                                      riteria :'
     A                                  8  2':                                 -
     A                                                                         -
     A                                              :'
     A                                  9  2': that you had entered on the prio-
     A                                      r screen.  Your selection criteria -
     A                                      is      :'
     A                                 10  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 11  2': displayed on the top part of the-
     A                                       screen.  The F6 and F7 keys allow -
     A                                      you to  :'
     A                                 12  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 13  2': page backward and forward throug-
     A                                      h the entries.  The F1 through F4 k-
     A                                      eys     :'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2': will change the sort criteria fo-
     A                                      r the report.  A workorder may be  -
     A                                              :'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2': displayed for any entry by placi-
     A                                      ng any character next to a Workorde-
     A                                      r       :'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2': Number and pressing ENTER.  F8 w-
     A                                      ill return you the Selection Criter-
     A                                      ia      :'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2': Screen.                         -
     A                                                                         -
     A                                              :'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 042 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3-RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP43
     A*%%TS  SD  19931004  130422  A193138     REL-V2R2M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':                         PM SCHED-
     A                                      ULE SIMULATION                     -
     A                                              :'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2': Enter the Equipment number, Mast-
     A                                      er Workorder Number and date that y-
     A                                      ou want :'
     A                                  8  2':                                 -
     A                                                                         -
     A                                              :'
     A                                  9  2': the schedule calculated and pres-
     A                                      s the ENTER key.  A Master Schedule-
     A                                       Name   :'
     A                                 10  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 11  2': may also be entered if a schedul-
     A                                      e other than the Master Workorder"s-
     A                                              :'
     A                                 12  1' :                                -
     A                                                                         -
     A                                               : '
     A                                 13  2': schedule is to be used.  If a pa-
     A                                      st date is entered, the automatic s-
     A                                      cheduler:'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2': will simulate workorder releases-
     A                                       up to the present time as though t-
     A                                      he      :'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2': schedule had been operating in t-
     A                                      he intervening period.  This Simula-
     A                                      tion    :'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2': will NOT affect the live schedul-
     A                                      e.  Simulation assumes perfect comp-
     A                                      letion. :'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 043 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3-RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP45
     A*%%TS  DD  19930825  155414  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':                  BROWSE CALENDAR-
     A                                       SCHEDULES MONTH BY MONTH          -
     A                                              :'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':  for viewing calendar schedules -
     A                                      month by month.  The workorder rele-
     A                                      ase     :'
     A                                  8  2':  level number will appear on the-
     A                                       date scheduled.  If there is a "*"-
     A                                       next   :'
     A                                  9  2':  to the level number, a pre-rele-
     A                                      ase and/or restriction has been def-
     A                                      ined    :'
     A                                 10  2':  for that release.  To view the -
     A                                      restriction, tab to the date in que-
     A                                      stion   :'
     A                                 11  2':  and type any character over the-
     A                                       "*"; then press the ENTER key.  Th-
     A                                      e       :'
     A                                 12  2':  restriction display screen will-
     A                                       then appear for that entry.  More -
     A                                      than    :'
     A                                 13  2':  one date may be requested and v-
     A                                      iewed consecutively.               -
     A                                              :'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      --  45 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP451
     A*%%TS  DD  19930825  155414  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':               BROWSE RESTRICTION-
     A                                      S ON CALENDAR SCHEDULE RECORDS     -
     A                                              :'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':  This screen will display the pr-
     A                                      e-release cycle (the number of days-
     A                                       prior  :'
     A                                  7  2':  to the schedule date that the w-
     A                                      orkorder will be created) and any  -
     A                                              : '
     A                                  8  2':  restriction which may have been-
     A                                       applied to the release.  The defau-
     A                                      lt      :'
     A                                  9  2':  release (NO restriction applied-
     A                                      ) will release any level without re-
     A                                      gard    :'
     A                                 10  2':  to any active levels already re-
     A                                      leased.  Only one restriction may b-
     A                                      e       :'
     A                                 11  2':  applied to any specific release-
     A                                       and are defined as follows:       -
     A                                              :'
     A                                 12  2':  A - If ANY other level is activ-
     A                                      e, it will be closed-incomplete and-
     A                                       this   :'
     A                                 13  2':      level will be released to r-
     A                                      eplace it.                         -
     A                                              :'
     A                                 14  2':'
     A                                 14  5'B - If ANY other level is active, -
     A                                      it will remain active and this leve-
     A                                      l    :'
     A                                 15  2':'
     A                                 15  9'will NOT be released.'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16  5'C - If there is an active level LO-
     A                                      WER that the level to be released, -
     A                                      it   :'
     A                                 17  2':'
     A                                 17  9'will be closed-incomplete'
     A                                 17 35'and this level will replace it.  I-
     A                                      f the     :'
     A                                 18  2':'
     A                                 18  9'active level is the same or higher-
     A                                      , this level will NOT be released.'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19  5'D - If the level to be released is-
     A                                       HIGHER than any active level, it w-
     A                                      ill  :'
     A                                 20  2':'
     A                                 20  9'be released, otherwise it will be -
     A                                      discarded.  The active level will'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21  9'remain active in any case.'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22  4'ACTIVE IS DEFINED AS ANY RELEASE I-
     A                                      N ''IP'' OR ''SD'' STATUS BUT NOT C-
     A                                      OMPLETED  :'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 451 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP46
     A*%%TS  DD  19930825  155414  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':      ADD, CHANGE OR DELETE CALEN-
     A                                      DAR SCHEDULE ENTRIES AND RESTRICTIO-
     A                                      NS      :'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':  Tab to the date-of-interest and-
     A                                       enter the level number to be relea-
     A                                      sed on  :'
     A                                  8  2':  that date.  If you wish to ente-
     A                                      r a pre-release cycle (the number o-
     A                                      f days  :'
     A                                  9  2':  prior to the selected schedule -
     A                                      date that the workorder is to be cr-
     A                                      eated)  :'
     A                                 10  2':  or apply a restriction on the r-
     A                                      elease, type any character in the s-
     A                                      ingle   :'
     A                                 11  2':  input field and press the ENTER-
     A                                       key.'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      --  46 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP461
     A*%%TS  DD  19930825  155414  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':  ADD, CHANGE OR DELETE PRE-RELEA-
     A                                      SE OR RESTRICTIONS ON A CALENDAR SC-
     A                                      HEDULE  :'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':  This screen allows input of the-
     A                                       pre-release cycle (the number of d-
     A                                      ays     :'
     A                                  7  2':  prior to the schedule date that-
     A                                       the workorder is to be created) an-
     A                                      d a     :'
     A                                  8  2':  restriction which may be applie-
     A                                      d to the release.  The default rele-
     A                                      ase (NO :'
     A                                  9  2':  restriction applied) will relea-
     A                                      se any level without regard to any -
     A                                      active  :'
     A                                 10  2':  level already released.  Only o-
     A                                      ne restriction may be applied to an-
     A                                      y       :'
     A                                 11  2':  specific release and are define-
     A                                      d as follows:'
     A                                 11 79':'
     A                                 12  2':  A - If ANY other level is activ-
     A                                      e, it will be closed-incomplete and-
     A                                       this   :'
     A                                 13  2':      level will be released to r-
     A                                      eplace it.                         -
     A                                              :'
     A                                 14  2':'
     A                                 14  5'B - If ANY other level is active, -
     A                                      it will remain active and this leve-
     A                                      l'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15  9'will NOT be released.'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16  5'C - If there is an active level LO-
     A                                      WER that the level to be released, -
     A                                      it'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17  9'will be closed-incomplete'
     A                                 17 35'and this level will replace it.  I-
     A                                      f the'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18  9'active level is the same or higher-
     A                                      , this level will NOT be released.'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19  5'D - If the level to be released is-
     A                                       HIGHER than any active level, it w-
     A                                      ill'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20  9'be released, otherwise it will be -
     A                                      discarded.  The active level will'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21  9'remain active in any case.'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22  4'ACTIVE IS DEFINED AS ANY RELEASE I-
     A                                      N ''IP'' OR ''SD'' STATUS BUT NOT C-
     A                                      OMPLETED '
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 461 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP47
     A*%%TS  DD  19941025  065247  T881S32     REL-V2R3M0  5738-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':        WRITE CALENDAR SCHEDULE E-
     A                                      NTRIES WITH "QUICK-BUILDER" PROGRAM-
     A                                              :'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':  Enter the dates (year must be f-
     A                                      ull 4-digit year), level numbers, a-
     A                                      nd      :'
     A                                  8  2':  Pre-Release cycles (in days) fo-
     A                                      r calendar schedules and press the -
     A                                      ''ENTER'' :'
     A                                  9  2':  key.  If a specific field is le-
     A                                      ft blank, the blank field will pick-
     A                                       up the :'
     A                                 10  2':'
     A                                 10  5'same entry from the last filled-in-
     A                                       field above it.  If you wish to se-
     A                                      e'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11  5'the empty fields, press the f4 key-
     A                                      .'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13  5'If an entry for the Workorder/Equi-
     A                                      pment combination already exists fo-
     A                                      r'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14  5'the date input, it will be replace-
     A                                      d by the new entry.'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16  5'"Quick-Builder" entries may be cha-
     A                                      nged or deleted through the regular'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17  5'Calendar scheduler program.'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      --  47 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP5
     A*%%TS  DD  19930825  155414  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 22'Preventive Maintenance Executive M-
     A                                      enu'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':  f1 - Generate and Maintain PM M-
     A                                      aster Workorders and Jobplans.'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':  f2 - Generate and Maintain PM A-
     A                                      utomatic Schedules and Fixed Date'
     A                                  9 70'releases.:'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':  f3 - Exit Program'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':  f4 - Initialize an Automatic Sc-
     A                                      hedule against a piece of Equipment-
     A                                       to     :'
     A                                 14  2':'
     A                                 14 12'start generating PM suffixed worko-
     A                                      rders.'
     A                                 14 79':'
     A                                 15  2':  f5 - Manually Release a selecte-
     A                                      d level of any PM schedule to creat-
     A                                      e an    :'
     A                                 16  2':'
     A                                 16 12'extra suffixed PM workorder outsid-
     A                                      e the automatic schedule.'
     A                                 16 79':'
     A                                 17  2':  f6 - Displays menu of PM report-
     A                                      s and Inquiries.'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':  f7 - HELP -  displays this pane-
     A                                      l.'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':  f8 - Exit Program'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 005 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP54
     A*%%TS  SD  19930809  105256  A193138     REL-V2R2M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 15'INITIATE AUTOMATIC PM SCHEDULE ON'
     A                                  4 49'PIECE OF EQUIPMENT'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':  Enter the Equipment number, Mas-
     A                                      ter Workorder Number and date that -
     A                                      you want:'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':  the schedule calculated and pre-
     A                                      ss the ENTER key.  A Master Schedul-
     A                                      e must  :'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':  have been created and the PM Ma-
     A                                      ster Workorder must be approved for-
     A                                       the    :'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':  schedule to begin.  If a past d-
     A                                      ate is entered, the automatic sched-
     A                                      uler    :'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':  will simulate workorder release-
     A                                      s up to the present time as though'
     A                                 15 71'the     :'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':  schedule had been operating in -
     A                                      the intervening period.   A list of-
     A                                       Master :'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':  Workorders may be obtained for -
     A                                      a piece of Equipment by entering th-
     A                                      e       :'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':  Equipment Number then pressing -
     A                                      the F1 key.                        -
     A                                              :'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 054 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP541
     A*%%TS  SD  19930809  105256  A193138     REL-V2R2M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':                 MASTER WORKORDER-
     A                                      S LINKED TO EQUIPMENT              -
     A                                              :'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':  This screen displays the Master-
     A                                       Workorder Numbers that are linked -
     A                                      to      :'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':  a given piece of Equipment.  Th-
     A                                      e F2 and F4 keys may be used to pag-
     A                                      e       :'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':  backward and forward through th-
     A                                      e list.  A Master Workorder Number -
     A                                      may     :'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':  be selected by placing any char-
     A                                      acter next to the workorder and pre-
     A                                      ssing   :'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':  ENTER.  To cancel the inquiry, -
     A                                      Press F3 or F8.                    -
     A                                              :'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 541 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP55
     A*%%TS  DD  19930825  155414  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 15'MANUAL RELEASE OF A SELECTED LEVEL'
     A                                  4 50'OF ANY PM SCHEDULE'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':  If a piece of equipment has an'
     A                                  7 36'automatic schedule writen against'
     A                                  7 70'it,      :'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':  (the schedule does not have to'
     A                                  9 36'be initiated) and the master worko-
     A                                      rder     :'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':  is approved, any level from the'
     A                                 11 37'Jobplan may be released through th-
     A                                      is      :'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':  program.  Enter the Equipment n-
     A                                      umber and the level desired (it doe-
     A                                      s not   :'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':  have to be a level defined in t-
     A                                      he automatic schedule) and press th-
     A                                      e'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':  ENTER key.  The next suffixed w-
     A                                      orkorder from the master will be cr-
     A                                      eated   :'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':  and will appear in the PM Queue-
     A                                      .  Manually released workorders are-
     A                                       not    :'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':  affected by the automatic sched-
     A                                      uler in any way.'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 055 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP6
     A*%%TS  SD  19930809  105256  A193138     REL-V2R2M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 15'Preventive Maintenance Reports and'
     A                                  4 50'On-Line Inquiries'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':  f1 - Displays active PM workord-
     A                                      er queue by Zone.'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':  f2 - Planners Preview to print'
     A                                  9 36'selected Jobplans by level for har-
     A                                      dcopy    :'
     A                                 10  2':'
     A                                 10 12'storage.'
     A                                 10 79':'
     A                                 11  2':  f3 - Return to Executive Menu.'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':  f4 - PM Forecaster and Simulato-
     A                                      r Functions.                       -
     A                                              :'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':  f5 - Print the Jobplan linked t-
     A                                      o a specific PM suffixed workorder.-
     A                                        This  :'
     A                                 16  2':'
     A                                 16 12'is the same printout which will pr-
     A                                      int for a craftsperson.'
     A                                 16 79':'
     A                                 17  2':  f6 - Other PM Inquiries and Rep-
     A                                      orts.                              -
     A                                              :'
     A                                 18  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 19  2':  f7 - HELP -  displays this pane-
     A                                      l.'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':  f8 - Return to Executive Menu.'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 006 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP62
     A*%%TS  DD  19930825  155414  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 28'PLANNER"S PREVIEW PROGRAM'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':  Enter the Master Jobplan Name a-
     A                                      nd the level desired (enter "AL" fo-
     A                                      r the   :'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':  entire jobplan) and enter a "Y"'
     A                                  9 37'if you wish the output to sort by'
     A                                  9 71'craft   :'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':  and press the ENTER key.  The r-
     A                                      esulting printout will include all'
     A                                 11 71'tasks   :'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':  from the level selected along w-
     A                                      ith all tasks from lower levels tha-
     A                                      t were  :'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':  not excluded by the exception f-
     A                                      lag.  The printout will allow the'
     A                                 15 70'planner  :'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':  to make certain that the select-
     A                                      ed level includes (or excludes) tho-
     A                                      se      :'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':  tasks which were designed to be'
     A                                 19 37'at that level.  The report also ca-
     A                                      lculates:'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':  the estimated labor and parts c-
     A                                      osts for the jobplan.'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 062 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP66
     A*%%TS  SD  19930809  105256  A193138     REL-V2R2M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 27'JOBPLAN NAME INQUIRY PROGRAM'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':  Enter the Jobplan Name desired'
     A                                  7 36'and press the ENTER key.  If a par-
     A                                      tial     :'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':  spelling is entered; for exampl-
     A                                      e "BB", all Jobplan Names which sta-
     A                                      rt with :'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':  the letters "BB" will display.'
     A                                 11 37'If the field is left blank, all ex-
     A                                      isting  :'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':  Jobplan Names will display.'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':  The display screen shows the Jo-
     A                                      bplan Names selected, the Jobplan'
     A                                 15 70'Titles,  :'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':  and the clock card of the Jobpl-
     A                                      an creator (owner).  To modify a jo-
     A                                      bplan'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':  title, enter M before the jobpl-
     A                                      an name.  to list Workorders for th-
     A                                      e       :'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':  jobplan enter W before the jobp-
     A                                      lan name.  Then press the ENTER key-
     A                                      .       :'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 066 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP661
     A*%%TS  SD  19930809  105256  A193138     REL-V2R2M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':                     WORKORDERS L-
     A                                      INKED TO A JOBPLAN                 -
     A                                              :'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':  This screen displays the Workor-
     A                                      ders linked to a Jobplan Name.     -
     A                                              :'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':  The screen displays the Master -
     A                                      Workorders, but the suffixes may al-
     A                                      so be   :'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':  displayed by Pressing the F1 ke-
     A                                      y.  The Suffixes may be hidden by P-
     A                                      ressing :'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':  the F6 key.  You may page backw-
     A                                      ard and forward by Pressing the F2 -
     A                                      and     :'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':  F4 keys.  The F3 or F8 key will-
     A                                       exit the Linked Workorder Inquiry.-
     A                                              :'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 066 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP67
     A*%%TS  DD  19930825  155414  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 27'JOBPLAN NAME INQUIRY PROGRAM'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':  The jobplan name chosen for tit-
     A                                      le modification is shown and the ti-
     A                                      tle'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':  field is open for input.  Chang-
     A                                      e the title to your new wording and'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':  press the "ENTER" key to save y-
     A                                      our changes.  If you wish to leave -
     A                                      the'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':  screen without saving your chan-
     A                                      ges, press the "f3" or "f8" key.'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 067 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP68
     A*%%TS  SD  19930809  105256  A193138     REL-V2R2M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':                       SCHEDULE N-
     A                                      AME INQUIRY PROGRAM                -
     A                                              :'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':  Enter the Schedule Name desired-
     A                                       and Press the ENTER key.  If a par-
     A                                      tial    :'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':  spelling is entered; for exampl-
     A                                      e "BB", all Schedule Names which st-
     A                                      art with:'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':  the letters "BB" will display.'
     A                                 11 37'If the field is left blank, all ex-
     A                                      isting  :'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':  Schedule Names will display.   -
     A                                                                         -
     A                                              :'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':  The display screen shows the Sc-
     A                                      hedule Names selected, the clock ca-
     A                                      rd of   :'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':  creator, clock card of the pers-
     A                                      on who last changed the Schedule, a-
     A                                      nd the  :'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':  date the Schedule was last chan-
     A                                      ged.  The Workorders linked to the -
     A                                      Schedule:'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':  may be listed by placing a W ne-
     A                                      xt to the Schedule and Pressing ENT-
     A                                      ER.     :'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 066 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP681
     A*%%TS  SD  19930809  105256  A193138     REL-V2R2M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':                 WORKORDERS LINKE-
     A                                      D TO A MASTER SCHEDULE             -
     A                                              :'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':  This screen displays the Workor-
     A                                      ders linked to a Master Schedule Na-
     A                                      me.     :'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':  The screen displays the Master -
     A                                      Workorders, but the suffixes may al-
     A                                      so be   :'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':  displayed by Pressing the F1 ke-
     A                                      y.  The Suffixes may be hidden by P-
     A                                      ressing :'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':  the F6 key.  You may page backw-
     A                                      ard and forward by Pressing the F2 -
     A                                      and     :'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':  F4 keys.  The F3 or F8 key will-
     A                                       exit the Linked Workorder Inquiry.-
     A                                              :'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 066 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP69
     A*%%TS  SD  19930809  105256  A193138     REL-V2R2M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':                       INITIATED -
     A                                      WORKORDER INQUIRY                  -
     A                                              :'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':  This screen will list all the M-
     A                                      aster Workorders that have been    -
     A                                              :'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':  Initiated in the system.  The F-
     A                                      2 and F4 keys will page backward an-
     A                                      d       :'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':  forward through the list.  The -
     A                                      F3 or F8 keys will return to the Ot-
     A                                      her     :'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':  PM Inquiry and Reports Menu.   -
     A                                                                         -
     A                                              :'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 069 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP7
     A*%%TS  DD  19930825  155414  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 13'Preventive Maintenance Master Work-
     A                                      order Maintenance Menu'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':  f1 - Editor program to create a-
     A                                      nd modify PM Master Jobplans.'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8 12'NOTE:  Personal Password is requir-
     A                                      ed to run editor.'
     A                                  8 79':'
     A                                  9  2':  f2 - Create a new PM Master Wor-
     A                                      korder for a specific piece of equi-
     A                                      pment.  :'
     A                                 10  2':'
     A                                 10 12'NOTE:  Master Jobplan must have be-
     A                                      en created first.'
     A                                 10 79':'
     A                                 11  2':  f3 - Return to Executive Menu.'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':  f4 - The data on a Master PM Wo-
     A                                      rkorder may be changed if there hav-
     A                                      e been  :'
     A                                 14  2':'
     A                                 14 12'no suffixed workorders created fro-
     A                                      m it.'
     A                                 14 79':'
     A                                 15  2':  f5 - Allows any workorder to be'
     A                                 15 37'displayed on the screen.'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':  f6 - Display a list of all PM m-
     A                                      aster workorders.'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':  f7 - HELP -  displays this pane-
     A                                      l.'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':  f8 - Return to Executive Menu.'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 007 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP72
     A*%%TS  SD  19930809  105256  A193138     REL-V2R2M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 13'CREATE A NEW PM MASTER WORKORDER F-
     A                                      OR A PIECE OF EQUIPMENT'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':  Enter the data indicated and pr-
     A                                      ess the ENTER key.  An un-approved'
     A                                  7 71'PM      :'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':  master workorder (suffix 000) w-
     A                                      ill be created.  The Master Jobplan-
     A                                       Name   :'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':  is required and must already ex-
     A                                      ist to be linked to the workorder.'
     A                                 11 72'If     :'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':  the Budget System Switch is tur-
     A                                      ned on, the budget number is requir-
     A                                      ed.     :'
     A                                 14  2':'
     A                                 14 79':'
     A                                 17  2':  The new master workorder number-
     A                                       will display on the screen after i-
     A                                      t has   :'
     A                                 18  2':'
     A                                 16  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 19  2':  been created.'
     A                                 20  2':'
     A                                 18 79':'
     A                                 19 79':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 072 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A                                 15  2':  The Master Schedule Name is req-
     A                                      uired and must already exist to lin-
     A                                      k it.   :'
     A          R VHELP74
     A*%%TS  DD  19930825  155414  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 22'APPROVE OR MODIFY A PM MASTER WORK-
     A                                      ORDER'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':  On the first screen, enter the'
     A                                  7 36'PM master workorder number desired'
     A                                  7 71'and     :'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':  press the ENTER key.  The worko-
     A                                      rder will display on the second scr-
     A                                      een     :'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':  and the data may be changed as'
     A                                 11 36'desired.  If the changes meet the'
     A                                 11 70'edit     :'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':  criteria, the workorder will be'
     A                                 13 37'changed.  Press the "f6" key to cl-
     A                                      ear     :'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':  the screen without changing the'
     A                                 15 37'data shown.  Workorders which have'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':  already had suffixed workorders'
     A                                 17 37'created from them cannot be modifi-
     A                                      ed.     :'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 074 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELP8
     A*%%TS  SD  19930809  105256  A193138     REL-V2R2M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':         OTHER PREVENTIVE MAINTEN-
     A                                      ANCE REPORTS AND ON-LINE INQUIRIES -
     A                                              :'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':  f1 - Displays a list of availab-
     A                                      le Master Jobplans already created -
     A                                      in the  :'
     A                                  8  2':        system.  Options to modif-
     A                                      y Jobplan titile or list Jobplan Wo-
     A                                      rkorders:'
     A                                  9  2':  f2 - Displays a list of availab-
     A                                      le Master Schedules already created-
     A                                       in the :'
     A                                 10  2':        system.  Option to list W-
     A                                      orkorders linked to a Master Schedu-
     A                                      le.     :'
     A                                 11  2':  f3 - Return to PM Reports and O-
     A                                      n-Line Inquiries Menu.             -
     A                                              :'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':  f4 - Displays a list of all Ini-
     A                                      tiated Master Workorders in the sys-
     A                                      tem.    :'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':  f5 - Send or receive personal o-
     A                                      r workorder messages.              -
     A                                              :'
     A                                 16  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 17  2':  f6 - Customize PM message flow -
     A                                      and Automatic Re-Initialize functio-
     A                                      ns.     :'
     A                                 18  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 19  2':  f7 - HELP -  displays this pane-
     A                                      l.'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':  f8 - Return to PM Reports and O-
     A                                      n-Line Inquiries Menu.             -
     A                                              :'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      -- 008 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHELPXX
     A*%%TS  DD  19930825  155414  T881S32     REL-V2R2M0  5733-073
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'H  E  L  P      I  N  F  O  R  M'
     A                                  2 52'A  T  I  O  N'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 13'HELP INSTRUCTIONS NOT YET AVAILABL-
     A                                      E FOR THIS FUNCTION.'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 23'PRESS ANY FUNCTION KEY TO CONTINUE-
     A                                      ...'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'- >>>>  HOW DO I?  PRESS f12  <<<<-
     A                                       -----------------------------------
     A                                      --  XX --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-RETURN                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A*%%CP+999CRTDSPF
     A*%%CP+    FILE(MCTST/ZPMHELPS)
     A*%%CP+    SRCFILE(MCTST/QDDSSRC)
     A*%%CP+    SRCMBR(ZPMHELPS)
     A*%%CP+    TEXT(*SRCMBRTXT)
     A*%%CP     RSTDSP(*YES)
