     A*%%TS  DD  19961105  095523  T881S32     REL-V3R1M0  5763-CD1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A          R VHDI0
     A*%%TS  DD  19961104  075745  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 33'H O W   D O   I ?'
     A                                  2 54'          '
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 79':'
     A                                  5  2':'
     A                                  5  4'RELATING TO ------:'
     A                                  5 79':'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 15'Type selection number and press th-
     A                                      e ENTER key:'
     A            HDI            2A  B 21 63DSPATR(UL)
     A                                      OVRDTA
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'--- f1 Previous Page  f2 Next Page-
     A                                       ------------------- f3/f8 Return --
     A                                      -- 000 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3/f8 - RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHDI1
     A*%%TS  DD  19961105  095523  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 33'H O W   D O   I ?'
     A                                  2 54'          '
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 79':'
     A                                  5  2':'
     A                                  5  4'RELATING TO WORKORDERS:'
     A                                  5 79':'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7  6'1.'
     A                                  7 10'View a list of initiated PM master-
     A                                       workorders.'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':'
     A                                  9  6'2.'
     A                                  9 10'View a list of ALL PM master worko-
     A                                      rders.'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11  6'3.'
     A                                 11 10'Print workorder tracking records.'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13  6'4.'
     A                                 13 10'Print a PM suffixed workorder with-
     A                                       jobplan (Craftsman''s Worksheet).'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15  6'5.'
     A                                 15 10'Change the Master Schedule name on-
     A                                       a Master PM Workorder.'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17  6'6.'
     A                                 17 10'Change PM workorders to new number-
     A                                      s at the start of the year '
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 12'without affecting existing schedul-
     A                                      es.'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20  6'7.'
     A                                 20 10'View a list of all PM master worko-
     A                                      rders for a piece of equipment.'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 15'Type selection number and press th-
     A                                      e ENTER key:'
     A            HDI            2A  B 22 63DSPATR(UL)
     A                                      OVRDTA
     A                                 22 79':'
     A                                 23  2'--- f1 Previous Page  f2 Next Page-
     A                                       ------------------- f3/f8 Return --
     A                                      -- 001 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3/f8 - RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHDI2
     A*%%TS  DD  19961104  064644  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 33'H O W   D O   I ?'
     A                                  2 54'          '
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 79':'
     A                                  5  2':'
     A                                  5  4'RELATING TO JOBPLANS:'
     A                                  5 79':'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7  5'11.'
     A                                  7 10'Create a new jobplan or edit an ex-
     A                                      isting jobplan.'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':'
     A                                  9  5'12.'
     A                                  9 10'View a list of existing jobplan na-
     A                                      mes.'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11  5'13.'
     A                                 11 10'View a list of PM workorders linke-
     A                                      d to a specific jobplan.'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 15'Type selection number and press th-
     A                                      e ENTER key:'
     A            HDI            2A  B 21 63DSPATR(UL)
     A                                      OVRDTA
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'--- f1 Previous Page  f2 Next Page-
     A                                       ------------------- f3/f8 Return --
     A                                      -- 002 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3/f8 - RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHDI3
     A*%%TS  DD  19961104  101923  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 33'H O W   D O   I ?'
     A                                  2 54'          '
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 79':'
     A                                  5  2':'
     A                                  5  4'RELATING TO SCHEDULES:'
     A                                  5 79':'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7  5'21.'
     A                                  7 10'Create or change a Master Schedule-
     A                                      .'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':'
     A                                  9  5'22.'
     A                                  9 10'View a list of all Master Schedule-
     A                                       names.'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11  5'23.'
     A                                 11 10'Display a Master Schedule.'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13  5'24.'
     A                                 13 10'View a list of all workorders link-
     A                                      ed to a specific Master Schedule.'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15  5'25.'
     A                                 15 10'Display the forecast of a specific-
     A                                       PM schedule.'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17  5'26.'
     A                                 17 10'Deactivate an active PM Schedule.'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19  5'27.'
     A                                 19 10'Simulate the forecast of a fixed o-
     A                                      r dynamic schedule.'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 15'Type selection number and press th-
     A                                      e ENTER key:'
     A            HDI            2A  B 21 63DSPATR(UL)
     A                                      OVRDTA
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'--- f1 Previous Page  f2 Next Page-
     A                                       ------------------- f3/f8 Return --
     A                                      -- 003 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3/f8 - RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHDI4
     A*%%TS  DD  19961104  064644  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 33'H O W   D O   I ?'
     A                                  2 54'          '
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2':'
     A                                  4 79':'
     A                                  5  2':'
     A                                  5  4'RELATING TO OTHER PM FUNCTIONS:'
     A                                  5 79':'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7  5'31.'
     A                                  7 10'View an audit trail of PM activity-
     A                                       for a selected PM schedule or'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8 12'piece of equipment.'
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10  5'32.'
     A                                 10 10'Customize the PM Message System to-
     A                                       your specific needs.'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12  5'33.'
     A                                 12 10'Set fixed PM schedules to Re-Initi-
     A                                      alize automatically.'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 15'Type selection number and press th-
     A                                      e ENTER key:'
     A            HDI            2A  B 21 63DSPATR(UL)
     A                                      OVRDTA
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'--- f1 Previous Page  f2 Next Page-
     A                                       ------------------- f3/f8 Return --
     A                                      -- 004 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3/f8 - RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHDIS0
     A*%%TS  DD  19961104  075745  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2  5'H O W   D O   I:'
     A                                  2 63'SELECTION:'
     A            HDI            2A  B  2 75DSPATR(PR)
     A                                      OVRDTA
     A                                  2 79':'
     A                                  3  2':'
     A                                  3 79':'
     A                                  4  2':'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6  5'Starting at the PM Program Main Me-
     A                                      nu:  PREVENTIVE MAINTENANCE MENU:'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8  7'Press:'
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'--------------  f3/f8 - Return  ---
     A                                      ------------------------------------
     A                                      -- S00 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3/f8 - RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHDIS1
     A*%%TS  DD  19961104  075745  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2  5'H O W   D O   I:'
     A                                  2 63'SELECTION:'
     A            HDI            2A  B  2 75DSPATR(PR)
     A                                      OVRDTA
     A                                  2 79':'
     A                                  3  2':'
     A                                  3 17'View a list of initiated PM master-
     A                                       workorders.'
     A                                  3 79':'
     A                                  4  2':'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6  5'Starting at the PM Program Main Me-
     A                                      nu:  PREVENTIVE MAINTENANCE MENU:'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8  7'Press:  f6  -  Printed Reports, On-
     A                                      -Line Inquiries and Custom Options '
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10  8'then:'
     A                                 10 15'f6  -  Additional PM Inquiries and-
     A                                       Reports and Custom Options '
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12  8'then:'
     A                                 12 15'f4  -  List Initiated Master Worko-
     A                                      rders '
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14  7'Enter the ZONE in which you are in-
     A                                      terested and press the ENTER key.'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16  7'A list of all initiated PM master -
     A                                      workorders for pieces of equipment'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18  7'in the ZONE selected will appear.'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'--------------  f3/f8 - Return  ---
     A                                      ------------------------------------
     A                                      -- S01 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3/f8 - RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHDIS2
     A*%%TS  DD  19961104  075745  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2  5'H O W   D O   I:'
     A                                  2 63'SELECTION:'
     A            HDI            2A  B  2 75DSPATR(PR)
     A                                      OVRDTA
     A                                  2 79':'
     A                                  3  2':'
     A                                  3 22'View a list of ALL PM master worko-
     A                                      rders'
     A                                  3 79':'
     A                                  4  2':'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6  5'Starting at the PM Program Main Me-
     A                                      nu:  PREVENTIVE MAINTENANCE MENU:'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8  7'Press:  f1  -  Maintain PM Master -
     A                                      Workorders '
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10  8'then:'
     A                                 10 15'f6  -  List PM Master Workorders '
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12  7'Select the filter items desired an-
     A                                      d press the ENTER key to produce a'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14  7'list of PM master workorders.'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16  7'The list will be sorted by equipme-
     A                                      nt number, but may be re-sorted by'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18  7'workorder number, Zone, or jobplan-
     A                                       name by pressing the appropriate'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20  7'function key.'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'--------------  f3/f8 - Return  ---
     A                                      ------------------------------------
     A                                      -- S02 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3/f8 - RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHDIS3
     A*%%TS  DD  19961104  085402  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2  5'H O W   D O   I:'
     A                                  2 63'SELECTION:'
     A            HDI            2A  B  2 75DSPATR(PR)
     A                                      OVRDTA
     A                                  2 79':'
     A                                  3  2':'
     A                                  3 23'Print workorder tracking records.'
     A                                  3 79':'
     A                                  4  2':'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6  5'Starting at the PM Program Main Me-
     A                                      nu:  PREVENTIVE MAINTENANCE MENU:'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8  7'Press:'
     A                                  8 15'f6  -  Printed Reports, On-Line In-
     A                                      quiries and Custom Options '
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10  8'then:'
     A                                 10 15'f4  -  Forecasting, Simulation, Tr-
     A                                      acking and Auditing '
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12  8'then:'
     A                                 12 15'f6  -  Workorder Tracking '
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14  6'Enter the workorder number to be t-
     A                                      racked and press the ENTER key.'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16  6'The screen will display the progra-
     A                                      m''s progress through the database'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18  6'files and the data will be printed-
     A                                       on the local printer assigned to t-
     A                                      he'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20  6'terminal used.'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'--------------  f3/f8 - Return  ---
     A                                      ------------------------------------
     A                                      -- S03 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3/f8 - RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHDIS4
     A*%%TS  DD  19961104  085402  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2  5'H O W   D O   I:'
     A                                  2 63'SELECTION:'
     A            HDI            2A  B  2 75DSPATR(PR)
     A                                      OVRDTA
     A                                  2 79':'
     A                                  3  2':'
     A                                  3  7'Print a PM suffixed workorder with-
     A                                       jobplan (Craftsman''s Worksheet).'
     A                                  3 79':'
     A                                  4  2':'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6  5'Starting at the PM Program Main Me-
     A                                      nu:  PREVENTIVE MAINTENANCE MENU:'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8  7'Press:'
     A                                  8 15'f6  -  Printed Reports, On-Line In-
     A                                      quiries and Custom Options '
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10  8'then:'
     A                                 10 15'f5  -  Print Craftsman Worksheets -
     A                                      by Workorder '
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12  7'Enter one of more workorder number-
     A                                      s and press the ENTER key.  The'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14  7'Craftsman''s Worksheets will print-
     A                                       on the printer assigned to the'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16  7'terminal used.'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'--------------  f3/f8 - Return  ---
     A                                      ------------------------------------
     A                                      -- S04 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3/f8 - RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHDIS5
     A*%%TS  DD  19961104  085402  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2  5'H O W   D O   I:'
     A                                  2 63'SELECTION:'
     A            HDI            2A  B  2 75DSPATR(PR)
     A                                      OVRDTA
     A                                  2 79':'
     A                                  3  2':'
     A                                  3 10'Change the Master Schedule name on-
     A                                       a Master PM Workorder.'
     A                                  3 79':'
     A                                  4  2':'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6  5'Starting at the PM Program Main Me-
     A                                      nu:  PREVENTIVE MAINTENANCE MENU:'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8  7'Press:'
     A                                  8 15'f1  -  Maintain PM Master Workorde-
     A                                      rs '
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10  8'then:'
     A                                 10 15'f4  -  Modify an Existing PM Maste-
     A                                      r Workorder '
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12  7'Enter the selected Master Workorde-
     A                                      r and press the ENTER key, the '
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14  7'workorder will appear on the scree-
     A                                      n.  Press the f1 key to open the'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16  7'schedule field, type in the new Ma-
     A                                      ster Schedule name and press the'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18  7'ENTER key.  If the workorder has b-
     A                                      een initiated, the active schedule'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20  7'will be deleted and the workorder -
     A                                      must be re-initiated.'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'--------------  f3/f8 - Return  ---
     A                                      ------------------------------------
     A                                      -- S05 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3/f8 - RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHDIS6
     A*%%TS  DD  19961104  085402  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2  5'H O W   D O   I:'
     A                                  2 63'SELECTION:'
     A            HDI            2A  B  2 75DSPATR(PR)
     A                                      OVRDTA
     A                                  2 79':'
     A                                  3  2':'
     A                                  3 10'Change PM workorders to new number-
     A                                      s at the start of the year'
     A                                  3 79':'
     A                                  4  2':'
     A                                  4 21'without affecting existing schedul-
     A                                      es.'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7  4'At the beginning of each calendar -
     A                                      year the workorder numbering sequen-
     A                                      ce is'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8 79':'
     A                                  9  2':'
     A                                  9  4'restarted.  If you wish your PM Ma-
     A                                      ster Workorders to reflect this cha-
     A                                      nge,'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11  4'the program TPMNEWYR may be execut-
     A                                      ed from a command line (see your lo-
     A                                      cal'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13  4'data processing staff) or automati-
     A                                      cally from the sleeper program.  Al-
     A                                      l '
     A                                 13 79':'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15  4'PM Masters will be renumbered with-
     A                                      out affecting the existing PM sched-
     A                                      ules.'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17  4'PM suffixed workorders which have -
     A                                      already been created will exist wit-
     A                                      h the'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19  4'old number, but all new suffixes w-
     A                                      ill be created under the new master'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21  4'number.'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'--------------  f3/f8 - Return  ---
     A                                      ------------------------------------
     A                                      -- S06 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3/f8 - RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHDIS7
     A*%%TS  DD  19961105  095523  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2  5'H O W   D O   I:'
     A                                  2 63'SELECTION:'
     A            HDI            2A  B  2 75DSPATR(PR)
     A                                      OVRDTA
     A                                  2 79':'
     A                                  3  2':'
     A                                  3  9'View a list of all PM master worko-
     A                                      rders for a piece of equipment.'
     A                                  3 79':'
     A                                  4  2':'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6  5'Starting at the PM Program Main Me-
     A                                      nu:  PREVENTIVE MAINTENANCE MENU:'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8  7'Press:'
     A                                  8 15'f4  -  Initiate PM Schedules '
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10  5'Type equipment number only into th-
     A                                      e equipment field and press the f1 -
     A                                      key.'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12  5'A list of all PM master workorders-
     A                                       linked to that piece of equipment -
     A                                      will'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14  5'appear along with approval code an-
     A                                      d jobplan and master schedule names-
     A                                      .'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16  5'If any character is placed before -
     A                                      a selected workorder number, the nu-
     A                                      mber'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18  5'will be displayed on the initiate -
     A                                      screen when the ENTER key is presse-
     A                                      d.'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'--------------  f3/f8 - Return  ---
     A                                      ------------------------------------
     A                                      -- S07 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3/f8 - RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHDIS11
     A*%%TS  DD  19961104  101923  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2  5'H O W   D O   I:'
     A                                  2 63'SELECTION:'
     A            HDI            2A  B  2 75DSPATR(PR)
     A                                      OVRDTA
     A                                  2 79':'
     A                                  3  2':'
     A                                  3 15'Create a new jobplan or edit an ex-
     A                                      isting jobplan.'
     A                                  3 79':'
     A                                  4  2':'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6  5'Starting at the PM Program Main Me-
     A                                      nu:  PREVENTIVE MAINTENANCE MENU:'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8  7'Press:'
     A                                  8 15'f1  -  Maintain PM Master Workorde-
     A                                      rs '
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10  8'then:'
     A                                 10 15'f1  -  PM Master Jobplan Editor (P-
     A                                      assword Required)'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12  5'You must enter your MMIS Personal -
     A                                      Password on the next screen (unless-
     A                                      '
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14  5'you have already entered it once s-
     A                                      ince you started the PM program, on-
     A                                      ly'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16  5'one time is required) and press th-
     A                                      e ENTER key.  Examine the menu on t-
     A                                      he'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18  5'next screen to create a new PM job-
     A                                      plan or to modify an existing jobpl-
     A                                      an.'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'--------------  f3/f8 - Return  ---
     A                                      ------------------------------------
     A                                      -- S11 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3/f8 - RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHDIS12
     A*%%TS  DD  19961104  101923  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2  5'H O W   D O   I:'
     A                                  2 63'SELECTION:'
     A            HDI            2A  B  2 75DSPATR(PR)
     A                                      OVRDTA
     A                                  2 79':'
     A                                  3  2':'
     A                                  3 22'View a list of existing jobplan na-
     A                                      mes.'
     A                                  3 79':'
     A                                  4  2':'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6  5'Starting at the PM Program Main Me-
     A                                      nu:  PREVENTIVE MAINTENANCE MENU:'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8  7'Press:'
     A                                  8 15'f6  -  Printed Reports, On-Line In-
     A                                      quiries and Custom Options'
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10  8'then:'
     A                                 10 15'f6  -  Additional PM Inquiries and-
     A                                       Reports and Custom Options'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12  8'then:'
     A                                 12 15'f1  -  Select and List Available J-
     A                                      obplan Names and Titles'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14  5'Press the ENTER key for a list of -
     A                                      ALL existing jobplans, or enter a n-
     A                                      ame'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16  5'or starting letters of names to ge-
     A                                      t a filtered list.  The list may al-
     A                                      so'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18  5'be filtered for jobplan owner (the-
     A                                       original creator of the jobplan).'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'--------------  f3/f8 - Return  ---
     A                                      ------------------------------------
     A                                      -- S12 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3/f8 - RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHDIS13
     A*%%TS  DD  19961104  101923  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2  5'H O W   D O   I:'
     A                                  2 63'SELECTION:'
     A            HDI            2A  B  2 75DSPATR(PR)
     A                                      OVRDTA
     A                                  2 79':'
     A                                  3  2':'
     A                                  3 11'View a list of PM workorders linke-
     A                                      d to a specific jobplan.'
     A                                  3 79':'
     A                                  4  2':'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6  5'Starting at the PM Program Main Me-
     A                                      nu:  PREVENTIVE MAINTENANCE MENU:'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8  7'Press:'
     A                                  8 15'f6  -  Printed Reports, On-Line In-
     A                                      quiries and Custom Options'
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10  8'then:'
     A                                 10 15'f6  -  Additional PM Inquiries and-
     A                                       Reports and Custom Options'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12  8'then:'
     A                                 12 15'f1  -  Select and List Available J-
     A                                      obplan Names and Titles'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14  5'Press the ENTER key for a list of -
     A                                      existing jobplans.  Tab and/or page'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16  5'down until the curser is in front -
     A                                      of the selected jobplan name, type -
     A                                      a'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18  5'"W" and press the ENTER key.  A li-
     A                                      st of master workorders linked to t-
     A                                      hat'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20  5'jobplan will appear.  Pressing the-
     A                                       f6 key will add linked suffixed'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22  5'workorders to the list.'
     A                                 22 79':'
     A                                 23  2'--------------  f3/f8 - Return  ---
     A                                      ------------------------------------
     A                                      -- S13 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3/f8 - RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHDIS21
     A*%%TS  DD  19961104  101923  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2  5'H O W   D O   I:'
     A                                  2 63'SELECTION:'
     A            HDI            2A  B  2 75DSPATR(PR)
     A                                      OVRDTA
     A                                  2 79':'
     A                                  3  2':'
     A                                  3 24'Create or change a Master Schedule-
     A                                      .'
     A                                  3 79':'
     A                                  4  2':'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6  5'Starting at the PM Program Main Me-
     A                                      nu:  PREVENTIVE MAINTENANCE MENU:'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8  7'Press:'
     A                                  8 15'f2  -  Maintain PM Master Schedule-
     A                                      s'
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10  8'then:'
     A                                 10 15'Press the "f1" Key to Maintain eit-
     A                                      her Fixed or Dynamic'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 17'Automatic Schedules'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 10'OR:'
     A                                 13 15'Press the "f4" Key to Maintain PM -
     A                                      Calendar Schedules.'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15  5'If you are creating or maintaining-
     A                                       Fixed or Dynamic schedules you mus-
     A                                      t'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17  5'enter your MMIS Personal Password -
     A                                      on the next screen (unless you have-
     A                                      '
     A                                 17 79':'
     A                                 18  2':'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19  5'already entered it once since you -
     A                                      started the PM program, only one ti-
     A                                      me'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21  5'is required) and press the ENTER k-
     A                                      ey.'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'--------------  f3/f8 - Return  ---
     A                                      ------------------------------------
     A                                      -- S21 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3/f8 - RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHDIS22
     A*%%TS  DD  19961104  103930  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2  5'H O W   D O   I:'
     A                                  2 63'SELECTION:'
     A            HDI            2A  B  2 75DSPATR(PR)
     A                                      OVRDTA
     A                                  2 79':'
     A                                  3  2':'
     A                                  3 18'View a list of all Master Schedule-
     A                                       names.'
     A                                  3 79':'
     A                                  4  2':'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6  5'Starting at the PM Program Main Me-
     A                                      nu:  PREVENTIVE MAINTENANCE MENU:'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8  7'Press:'
     A                                  8 15'f6  -  Printed Reports, On-Line In-
     A                                      quiries and Custom Options'
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10  8'then:'
     A                                 10 15'f6  -  Additional PM Inquiries and-
     A                                       Reports and Custom Options'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12  8'then:'
     A                                 12 15'f2  -  Select and List Available S-
     A                                      chedule Names'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14  5'Press the ENTER key for a list of -
     A                                      ALL existing schedules, or enter a -
     A                                      name'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16  5'or starting letters of names to ge-
     A                                      t a filtered list.  The list may al-
     A                                      so'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18  5'be filtered for the original creat-
     A                                      or of the schedule.'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'--------------  f3/f8 - Return  ---
     A                                      ------------------------------------
     A                                      -- S22 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3/f8 - RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHDIS23
     A*%%TS  DD  19961104  103930  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2  5'H O W   D O   I:'
     A                                  2 63'SELECTION:'
     A            HDI            2A  B  2 75DSPATR(PR)
     A                                      OVRDTA
     A                                  2 79':'
     A                                  3  2':'
     A                                  3 26'Display a Master Schedule.'
     A                                  3 79':'
     A                                  4  2':'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6  5'Starting at the PM Program Main Me-
     A                                      nu:  PREVENTIVE MAINTENANCE MENU:'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8  7'Press:'
     A                                  8 15'f6  -  Printed Reports, On-Line In-
     A                                      quiries and Custom Options'
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10  8'then:'
     A                                 10 15'f6  -  Additional PM Inquiries and-
     A                                       Reports and Custom Options'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12  8'then:'
     A                                 12 15'f2  -  Select and List Available S-
     A                                      chedule Names '
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14  5'Press the ENTER key for a list of -
     A                                      existing schedules.  Tab and/or pag-
     A                                      e'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16  5'down until the curser is in front -
     A                                      of the selected schedule name, type-
     A                                       a'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18  5'"D" and press the ENTER key and th-
     A                                      e master schedule will display on t-
     A                                      he'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20  5'screen.'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'--------------  f3/f8 - Return  ---
     A                                      ------------------------------------
     A                                      -- S23 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3/f8 - RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHDIS24
     A*%%TS  DD  19961104  103930  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2  5'H O W   D O   I:'
     A                                  2 63'SELECTION:'
     A            HDI            2A  B  2 75DSPATR(PR)
     A                                      OVRDTA
     A                                  2 79':'
     A                                  3  2':'
     A                                  3  7'View a list of all workorders link-
     A                                      ed to a specific Master Schedule.'
     A                                  3 79':'
     A                                  4  2':'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6  5'Starting at the PM Program Main Me-
     A                                      nu:  PREVENTIVE MAINTENANCE MENU:'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8  7'Press:'
     A                                  8 15'f6  -  Printed Reports, On-Line In-
     A                                      quiries and Custom Options'
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10  8'then:'
     A                                 10 15'f6  -  Additional PM Inquiries and-
     A                                       Reports and Custom Options'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12  8'then:'
     A                                 12 15'f2  -  Select and List Available S-
     A                                      chedule Names '
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14  5'Press the ENTER key for a list of -
     A                                      existing schedules.  Tab and/or pag-
     A                                      e'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16  5'down until the curser is in front -
     A                                      of the selected schedule name, type-
     A                                       a'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18  5'"W" and press the ENTER key.  A li-
     A                                      st of master workorders linked to t-
     A                                      hat'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20  5'schedule will appear.  Pressing th-
     A                                      e f6 key will add linked suffixed'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22  5'workorders to the list.'
     A                                 22 79':'
     A                                 23  2'--------------  f3/f8 - Return  ---
     A                                      ------------------------------------
     A                                      -- S24 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3/f8 - RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHDIS25
     A*%%TS  DD  19961104  113157  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2  5'H O W   D O   I:'
     A                                  2 63'SELECTION:'
     A            HDI            2A  B  2 75DSPATR(PR)
     A                                      OVRDTA
     A                                  2 79':'
     A                                  3  2':'
     A                                  3 18'Display the forecast of a specific-
     A                                       PM schedule.'
     A                                  3 79':'
     A                                  4  2':'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6  5'Starting at the PM Program Main Me-
     A                                      nu:  PREVENTIVE MAINTENANCE MENU:'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8  7'Press:'
     A                                  8 15'f6  -  Printed Reports, On-Line In-
     A                                      quiries and Custom Options'
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10  8'then:'
     A                                 10 15'f4  -  Forecasting, Simulation, Tr-
     A                                      acking and Auditing '
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12  8'then:'
     A                                 12 15'f1  -  Forecast a Schedule '
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14  5'Enter the selection data desired, -
     A                                      date range, Master Workorder number-
     A                                      ,'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16  5'Equipment number, Zone, etc. and p-
     A                                      ress the ENTER key.  The selected'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18  5'schedule data will appear and may -
     A                                      be browsed as desired.  Both automa-
     A                                      tic'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20  5'and calendar schedules may be view-
     A                                      ed.'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'--------------  f3/f8 - Return  ---
     A                                      ------------------------------------
     A                                      -- S25 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3/f8 - RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHDIS26
     A*%%TS  DD  19961104  113157  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2  5'H O W   D O   I:'
     A                                  2 63'SELECTION:'
     A            HDI            2A  B  2 75DSPATR(PR)
     A                                      OVRDTA
     A                                  2 79':'
     A                                  3  2':'
     A                                  3 24'Deactivate an active PM Schedule.'
     A                                  3 79':'
     A                                  4  2':'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6  5'Starting at the PM Program Main Me-
     A                                      nu:  PREVENTIVE MAINTENANCE MENU:'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8  7'Press:'
     A                                  8 15'f1  -  Maintain PM Master Workorde-
     A                                      rs'
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10  8'then:'
     A                                 10 15'f4  -  Modify an Existing PM Maste-
     A                                      r Workorder'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12  5'Enter the selected Master Workorde-
     A                                      r and press the ENTER key, the '
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14  5'workorder will appear on the scree-
     A                                      n.  Press the f1 key to open the'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16  5'schedule field, blank out the Mast-
     A                                      er Schedule name and press the ENTE-
     A                                      R'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18  5'key.  The active schedule will be -
     A                                      deleted.  Also, if a Master Schedul-
     A                                      e is'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20  5'modified, the schedules for all wo-
     A                                      rkorders linked to it will be delet-
     A                                      ed'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22  5'and must be re-initialized.'
     A                                 22 79':'
     A                                 23  2'--------------  f3/f8 - Return  ---
     A                                      ------------------------------------
     A                                      -- S26 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3/f8 - RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHDIS27
     A*%%TS  DD  19961104  113157  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2  5'H O W   D O   I:'
     A                                  2 63'SELECTION:'
     A            HDI            2A  B  2 75DSPATR(PR)
     A                                      OVRDTA
     A                                  2 79':'
     A                                  3  2':'
     A                                  3 13'Simulate the forecast of a fixed o-
     A                                      r dynamic schedule.'
     A                                  3 79':'
     A                                  4  2':'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6  5'Starting at the PM Program Main Me-
     A                                      nu:  PREVENTIVE MAINTENANCE MENU:'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8  7'Press:'
     A                                  8 15'f6  -  Printed Reports, On-Line In-
     A                                      quiries and Custom Options '
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10  8'then:'
     A                                 10 15'f4  -  Forecasting, Simulation, Tr-
     A                                      acking and Auditing'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12  8'then:'
     A                                 12 15'f4  -  Simulate a Schedule for a M-
     A                                      aster Workorder'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14  5'This program is similar to the wor-
     A                                      korder initiate function except it'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16  5'creates a temporary schedule for s-
     A                                      imulation purposes.  The simulation-
     A                                      s'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18  5'may be viewed by pressing'
     A                                 18 31'"f5  -  Review a Simulated Schedul-
     A                                      e".'
     A                                 18 70'All'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20  5'simulations will be deleted after -
     A                                      a two week period to keep the data'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22  5'files from overloading.'
     A                                 22 79':'
     A                                 23  2'--------------  f3/f8 - Return  ---
     A                                      ------------------------------------
     A                                      -- S27 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3/f8 - RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHDIS31
     A*%%TS  DD  19961104  113157  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2  5'H O W   D O   I:'
     A                                  2 63'SELECTION:'
     A            HDI            2A  B  2 75DSPATR(PR)
     A                                      OVRDTA
     A                                  2 79':'
     A                                  3  2':'
     A                                  3  8'View an audit trail of PM activity-
     A                                       for a selected PM schedule or'
     A                                  3 79':'
     A                                  4  2':'
     A                                  4 31'piece of equipment.'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6  5'Starting at the PM Program Main Me-
     A                                      nu:  PREVENTIVE MAINTENANCE MENU:'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8  7'Press:'
     A                                  8 15'f6  -  Printed Reports, On-Line In-
     A                                      quiries and Custom Options '
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10  8'then:'
     A                                 10 15'f4  -  Forecasting, Simulation, Tr-
     A                                      acking and Auditing'
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12  8'then:'
     A                                 12 15'f2  -  PM Workorder Audit Trail'
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14  5'Follow the instructions on the scr-
     A                                      een to view a list of PM activity f-
     A                                      or'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16  5'any PM schedule or piece of equipm-
     A                                      ent.  This list will include initia-
     A                                      tion'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18  5'dates for schedules if for some re-
     A                                      ason a re-initiation becomes necess-
     A                                      ary.'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22 79':'
     A                                 23  2'--------------  f3/f8 - Return  ---
     A                                      ------------------------------------
     A                                      -- S31 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3/f8 - RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHDIS32
     A*%%TS  DD  19961104  113157  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2  5'H O W   D O   I:'
     A                                  2 63'SELECTION:'
     A            HDI            2A  B  2 75DSPATR(PR)
     A                                      OVRDTA
     A                                  2 79':'
     A                                  3  2':'
     A                                  3 13'Customize the PM Message System to-
     A                                       your specific needs.'
     A                                  3 79':'
     A                                  4  2':'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6  5'Starting at the PM Program Main Me-
     A                                      nu:  PREVENTIVE MAINTENANCE MENU:'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8  7'Press:'
     A                                  8 15'f6  -  Printed Reports, On-Line In-
     A                                      quiries and Custom Options'
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10  8'then:'
     A                                 10 15'f6  -  Additional PM Inquiries and-
     A                                       Reports and Custom Options '
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12  8'then:'
     A                                 12 15'f6  -  Individual User Customizing-
     A                                       Selections '
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14  5'Select those functions for which y-
     A                                      ou wish to be notified (through MMI-
     A                                      S'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16  5'message mail) when the PM Automati-
     A                                      c Scheduler executes.  The mail wil-
     A                                      l '
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18  5'be available any time you are sign-
     A                                      ed into the PM Maintenance program -
     A                                      as'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20  5'well as through any other MMIS mai-
     A                                      l program.  Press f7 to go to the'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22  5'automatic re-initate selection scr-
     A                                      een.'
     A                                 22 79':'
     A                                 23  2'--------------  f3/f8 - Return  ---
     A                                      ------------------------------------
     A                                      -- S32 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3/f8 - RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VHDIS33
     A*%%TS  DD  19961104  113157  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2  5'H O W   D O   I:'
     A                                  2 63'SELECTION:'
     A            HDI            2A  B  2 75DSPATR(PR)
     A                                      OVRDTA
     A                                  2 79':'
     A                                  3  2':'
     A                                  3 11'Set fixed PM schedules to Re-Initi-
     A                                      alize automatically.'
     A                                  3 79':'
     A                                  4  2':'
     A                                  4 79':'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  6  2':'
     A                                  6  5'Starting at the PM Program Main Me-
     A                                      nu:  PREVENTIVE MAINTENANCE MENU:'
     A                                  6 79':'
     A                                  7  2':'
     A                                  7 79':'
     A                                  8  2':'
     A                                  8  7'Press:'
     A                                  8 15'f6  -  Printed Reports, On-Line In-
     A                                      quiries and Custom Options'
     A                                  8 79':'
     A                                  9  2':'
     A                                  9 79':'
     A                                 10  2':'
     A                                 10  8'then:'
     A                                 10 15'f6  -  Additional PM Inquiries and-
     A                                       Reports and Custom Options '
     A                                 10 79':'
     A                                 11  2':'
     A                                 11 79':'
     A                                 12  2':'
     A                                 12  8'then:'
     A                                 12 15'f6  -  Individual User Customizing-
     A                                       Selections '
     A                                 12 79':'
     A                                 13  2':'
     A                                 13 79':'
     A                                 14  2':'
     A                                 14  5'The PM message selections screen w-
     A                                      ill appear, press the f7 key to go -
     A                                      to'
     A                                 14 79':'
     A                                 15  2':'
     A                                 15 79':'
     A                                 16  2':'
     A                                 16  5'the re-initiate selection screen. -
     A                                       Select either one or two year cycl-
     A                                      es'
     A                                 16 79':'
     A                                 17  2':'
     A                                 17 79':'
     A                                 18  2':'
     A                                 18  5'and the point at which you wish re-
     A                                      -initiation to take place and press-
     A                                       the'
     A                                 18 79':'
     A                                 19  2':'
     A                                 19 79':'
     A                                 20  2':'
     A                                 20  5'ENTER key.  Pressing f7 will retur-
     A                                      n you to the message selection scre-
     A                                      en.'
     A                                 20 79':'
     A                                 21  2':'
     A                                 21 79':'
     A                                 22  2':'
     A                                 22  9'NOTE:  Automatic Re-initialization-
     A                                       is for fixed schedules only.'
     A                                 22 79':'
     A                                 23  2'--------------  f3/f8 - Return  ---
     A                                      ------------------------------------
     A                                      -- S33 --'
     A            COMMANDLN1    79A  B 24  1DFTVAL('   f3/f8 - RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A*%%CP+999CRTDSPF
     A*%%CP+    FILE(MCTST/ZPMHDI)
     A*%%CP+    SRCFILE(MCTST/QDDSSRC)
     A*%%CP+    SRCMBR(ZPMHDI)
     A*%%CP+    TEXT(*SRCMBRTXT)
     A*%%CP     RSTDSP(*YES)
