     A                                      DSPSIZ(24 80 *DS3)
     A                                      INDARA
     A                                      PRINT
     A                                      CHGINPDFT
     A          R VINITIATE
     A                                      PUTOVR
     A                                      CF03
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 79':'
     A                                  3  1':'
     A                                  3  5'-----------------------------------
     A                                      -----------------------------------'
     A                                      DSPATR(HI)
     A                                  3 79':'
     A                                  4  1':'
     A                                  4  5':  P R E V E N T I V E   M A I N T-
     A                                       E N A N C E   S C H E D U L E R  :'
     A                                      DSPATR(HI)
     A                                  4 79':'
     A                                  5  1':'
     A                                  5  5'-----------------------------------
     A                                      -----------------------------------'
     A                                      DSPATR(HI)
     A                                  5 79':'
     A                                  6  1':'
     A                                  6 79':'
     A                                  7  1':'
     A                                  7 29'INITIATE A PM SCHEDULE'
     A                                      DSPATR(HI)
     A                                  7 79':'
     A                                  8  1':'
     A                                  8 79':'
     A                                  9  1':'
     A                                  9 79':'
     A                                 10  1':'
     A                                 10 79':'
     A                                 11  1':'
     A                                 11 79':'
     A                                 12  1':'
     A                                 12 19'EQUIPMENT NUMBER TO BE INITIATED:'
     A                                 12 79':'
     A                                 13  1':'
     A                                 13 79':'
     A                                 14  1':'
     A                                 14 79':'
     A                                 15  1':'
     A                                 15  9'SCHEDULE WILL INITATE AS OF THE DA-
     A                                      TE (YY MM DD):'
     A                                 15 79':'
     A                                 16  1':'
     A                                 16 79':'
     A                                 17  1':'
     A                                 17 79':'
     A                                 18  1':'
     A                                 18 20'CHANGE DATE IF DESIRED AND PRESS E-
     A                                      NTER KEY'
     A                                 18 79':'
     A                                 19  1':'
     A                                 19 79':'
     A                                 20  1':'
     A                                 20 79':'
     A                                 21  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 22  1':'
     A                                 22 10'ENTER DATA AND PRESS THE "E-
     A                                      NTER" KEY TO INITIATE EQUIPMENT'
     A                                      DSPATR(HI)
     A                                 22 79':'
     A                                 23  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            EQUIP          6A  B 12 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            YY             2A  B 15 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            MM             2A  B 15 63DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            DD             2A  B 15 66DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('    f3-EXIT PROGRAM')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VRELEASE
     A                                      PUTOVR
     A                                      CF03
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 79':'
     A                                  3  1':'
     A                                  3  5'-----------------------------------
     A                                      -----------------------------------'
     A                                      DSPATR(HI)
     A                                  3 79':'
     A                                  4  1':'
     A                                  4  5':  P R E V E N T I V E   M A I N T-
     A                                       E N A N C E   S C H E D U L E R  :'
     A                                      DSPATR(HI)
     A                                  4 79':'
     A                                  5  1':'
     A                                  5  5'-----------------------------------
     A                                      -----------------------------------'
     A                                      DSPATR(HI)
     A                                  5 79':'
     A                                  6  1':'
     A                                  6 79':'
     A                                  7  1':'
     A                                  7 25'MANUALLY RELEASE A PM WORKORDER'
     A                                      DSPATR(HI)
     A                                  7 79':'
     A                                  8  1':'
     A                                  8 79':'
     A                                  9  1':'
     A                                  9 79':'
     A                                 10  1':'
     A                                 10 79':'
     A                                 11  1':'
     A                                 11 79':'
     A                                 12  1':'
     A                                 12 20'EQUIPMENT NUMBER TO BE RELEASED:'
     A                                 12 79':'
     A                                 13  1':'
     A                                 13 79':'
     A                                 14  1':'
     A                                 14 31'LEVEL TO BE RELEASED:'
     A                                 14 79':'
     A                                 15  1':'
     A                                 15 79':'
     A                                 16  1':'
     A                                 16 79':'
     A                                 17  1':'
     A                                 17 79':'
     A                                 18  1':'
     A                                 18 79':'
     A                                 19  1':'
     A                                 19 79':'
     A                                 20  1':'
     A                                 20 79':'
     A                                 21  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 22  1':'
     A                                 22 10'ENTER DATA AND PRESS THE "E-
     A                                      NTER" KEY TO MANUALLY RELEASE PM'
     A                                      DSPATR(HI)
     A                                 22 79':'
     A                                 23  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            EQUIP          6A  B 12 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            LEVEL          2A  B 14 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('    f3-EXIT PROGRAM')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
