     A*%%TS  SD  19930317  135608  A113573     REL-V2R2M0  5738-PW1
     A*  90/04/25  15:42:43    T000144     REL-R02M00  5728-PW1
     A*            21:29:51    T881S28     VPOBYVEN.HPTO38.CME
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A          R FINVPBV
     A*%%TS  SD  19930225  113045  A113573     REL-V2R2M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 25'PURCHASE ORDER INQUIRY BY VENDOR'
     A                                  3  7'VENDOR CODE ==>'
     A                                  3 29'***'
     A                                  3 49'***'
     A                                  4 33'---------------'
     A                                  6  7'VENDOR DATA ==>'
     A                                  9  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                 11  7'PURCHASE ORDERS ==>     '
     A                                 17  1'"f1" TO VIEW PREV PO"S'
     A                                 18  1'"f2" TO VIEW MORE PO"S'
     A                                 19  1'"f5" TO PRINT SCREEN'
     A                                 20  1'"f3" RETURN TO PREV SCREEN    '
     A                                 22  1'PLACE  "X"  IN BOX NEXT TO PURCHAS-
     A                                      E ORDER(S) TO BE REVIEWED  AND  PRE-
     A                                      SS  "ENTER"'
     A            VC             7A  B  3 35DSPATR(PR)
     A                                      OVRDTA
     A            VI             3A  B  3 43DSPATR(PR)
     A                                      OVRDTA
     A            VENDORNAME    44A  B  6 25DSPATR(PR)
     A                                      OVRDTA
     A            VENDORCSZ     44A  B  7 25DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B 11 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            PORLSE01      11A  B 11 36DSPATR(PR)
     A                                      OVRDTA
     A            INHIST01      19   B 11 50DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B 12 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            PORLSE02      11A  B 12 36DSPATR(PR)
     A                                      OVRDTA
     A            INHIST02      19   B 12 50DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 13 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            PORLSE03      11A  B 13 36DSPATR(PR)
     A                                      OVRDTA
     A            INHIST03      19   B 13 50DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 14 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            PORLSE04      11A  B 14 36DSPATR(PR)
     A                                      OVRDTA
     A            INHIST04      19   B 14 50DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 15 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            PORLSE05      11A  B 15 36DSPATR(PR)
     A                                      OVRDTA
     A            INHIST05      19   B 15 50DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 16 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            PORLSE06      11A  B 16 36DSPATR(PR)
     A                                      OVRDTA
     A            INHIST06      19   B 16 50DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 17 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            PORLSE07      11A  B 17 36DSPATR(PR)
     A                                      OVRDTA
     A            INHIST07      19   B 17 50DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 18 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            PORLSE08      11A  B 18 36DSPATR(PR)
     A                                      OVRDTA
     A            INHIST08      19   B 18 50DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 19 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            PORLSE09      11A  B 19 36DSPATR(PR)
     A                                      OVRDTA
     A            INHIST09      19   B 19 50DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            J              1A  B 20 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            PORLSE10      11A  B 20 36DSPATR(PR)
     A                                      OVRDTA
     A            INHIST10      19   B 20 50DSPATR(HI)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-PREV SCREEN             -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FINVPO
     A*%%TS  SD  19930317  135608  A113573     REL-V2R2M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 19'P U R C H A S E   O R D E R   I N'
     A                                  1 53'Q U I R Y'
     A                                  2 16'-----------------------------------
     A                                      ---------------'
     A                                  8 22'PURCHASE ORDER NUMBER'
     A                                 12  1'***  OPTIONS:'
     A                                 13  1'----------------'
     A                                 16  6'ENTER   ITEM NUMBER'
     A                                 16 35'{OR}   CORP CODE'
     A                                 16 64'IF DESIRED'
     A                                 20  1'PRESS  "ENTER"  TO CONTINUE'
     A                                 22  1'PRESS  "f3" TO RETURN TO PREV SCRE-
     A                                      EN'
     A            HISTMSG       35   B  5 22DSPATR(HI)
     A                                      DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            PO             7A  B  8 46DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  8 54DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4Y 0B 16 28DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            CORPCDE        7A  B 16 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-PREV SCREEN             -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VPOBYVEN
     A*%%TS  SD  19930317  135608  A113573     REL-V2R2M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  3  1'MQ5'
     A                                  3 17'P O   I N Q U I R Y   B Y   V E N'
     A                                  3 51'D O R   C O D E'
     A                                  4 17'**********************************-
     A                                      ***************'
     A                                  8 14'ENTER THE VENDOR CODE AND PRESS "E-
     A                                      NTER"'
     A                                 10 38'OR'
     A                                 12  7'ENTER THE VENDOR CODE AND PRESS "F-
     A                                      6" TO SEARCH THE HISTORY DATABASE'
     A                                 19 12'PRESS "F3" TO EXIT PROGRAM'
     A            ABCDEFG        7A  B  8 55DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            HIJ            3A  B  8 63DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
