     A*            21:30:41    T881S28     VPOLIVE.HPTO38.CME
     A                                      DSPSIZ(24 80 *DS3)
     A                                      INDARA
     A                                      PRINT
     A                                      CHGINPDFT
     A          R PORECALL
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  3 19'H I S T O R Y    D A T A    B A S'
     A                                  3 53'E'
     A                                  6 17'P U R C H A S E   O R D E R   R E'
     A                                  6 51'C A L L'
     A                                 11  9'*****  ENTER "PURCHASE ORDER NUMBE-
     A                                      R" TO RECALL FROM   *****'
     A                                 12 21'HISTORY DATABASE AND PRESS "ENTER"'
     A            PONUMBR        7A  B 15 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            RLS            3Y 0B 15 39DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            MESSAGEARE    79A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGEAR2    79A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
