     A*%%TS  SD  20030813  151012  Z010830     REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A          R CHATINT
     A                                      PUTOVR
     A                                      CF03
     A                                      CF06
     A                                      CF07
     A            CORPCODE       7A  B  9 38DSPATR(HI)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT  Enter to Continue')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A                                  1 20'CORPORATE CODE/CHAT NUMBER CROSS R-
     A                                      EFERENCE'
     A                                      DSPATR(HI)
     A                                  9 26'Corp Code: '
     A                                 12 12'Enter Corp Code to Cross-Reference-
     A                                       the CHAT-Number Databse'
     A                                      DSPATR(HI)
     A          R CHATQTY
     A                                      PUTOVR
     A                                      CF03
     A                                      CF06
     A                                      CF07
     A                                  1 20'VALID CHAT NUMBERS FOR CSIS CODE:'
     A                                      DSPATR(HI)
     A            CORPCODE       7A  B  1 54DSPATR(PR)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A                                  2 29'PRIMARY UNIT OF MEASURE:'
     A                                      DSPATR(HI)
     A            PRIUM          2A  B  2 54DSPATR(HI)
     A                                      DSPATR(PR)
     A                                  3 29'TRANSACTION DATE:'
     A                                      DSPATR(HI)
     A            TCDATE         8   B  3 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  5  3'CHAT QTY'
     A                                      DSPATR(HI)
     A                                  5 20'CHAT NO.'
     A                                      DSPATR(HI)
     A                                  5 31'MANUFACTURER'
     A                                      DSPATR(HI)
     A                                  6  3'TRADE NAME'
     A                                      DSPATR(HI)
     A            QTY01          8Y 0B  8  2
     A N01                                  DSPATR(PR)
     A  01                                  DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A                                      EDTCDE(Q)
     A            FLD001         6A  B  8 20DSPATR(PR)
     A                                      OVRDTA
     A            FLD002        26A  B  8 31DSPATR(PR)
     A                                      OVRDTA
     A            FLD003        79A  B  9  2DSPATR(PR)
     A                                      OVRDTA
     A            QTY02          8Y 0B 11  2
     A N02                                  DSPATR(PR)
     A  02                                  DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A                                      EDTCDE(Q)
     A            FLD004         6A  B 11 20DSPATR(PR)
     A                                      OVRDTA
     A            FLD005        26A  B 11 31DSPATR(PR)
     A                                      OVRDTA
     A            FLD006        79A  B 12  2DSPATR(PR)
     A                                      OVRDTA
     A            QTY03          8Y 0B 14  2
     A N03                                  DSPATR(PR)
     A  03                                  DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A                                      EDTCDE(Q)
     A            FLD007         6A  B 14 20DSPATR(PR)
     A                                      OVRDTA
     A            FLD008        26A  B 14 31DSPATR(PR)
     A                                      OVRDTA
     A            FLD009        79A  B 15  2DSPATR(PR)
     A                                      OVRDTA
     A            QTY04          8Y 0B 17  2
     A N04                                  DSPATR(PR)
     A  04                                  DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A                                      EDTCDE(Q)
     A            FLD010         6A  B 17 20DSPATR(PR)
     A                                      OVRDTA
     A            FLD011        26A  B 17 31DSPATR(PR)
     A                                      OVRDTA
     A            FLD012        79A  B 18  2DSPATR(PR)
     A                                      OVRDTA
     A            QTY05          8Y 0B 20  2
     A N05                                  DSPATR(PR)
     A  05                                  DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A                                      EDTCDE(Q)
     A            FLD013         6A  B 20 20DSPATR(PR)
     A                                      OVRDTA
     A            FLD014        26A  B 20 31DSPATR(PR)
     A                                      OVRDTA
     A            FLD015        79A  B 21  2DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-CANCEL  F6-PREVIOUS  F7--
     A                                      NEXT')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A                                 23  6'Enter Quantity for Chat Number(s),-
     A                                       Press Enter to Process'
     A                                      DSPATR(HI)
     A          R CHATREF
     A*%%TS  SD  19940811  093837  A193138     REL-V2R3M0  5738-PW1
     A                                      PUTOVR
     A                                      CF03
     A                                      CF06
     A                                      CF07
     A                                  1 20'VALID CHAT NUMBERS FOR CSIS CODE:'
     A                                      DSPATR(HI)
     A            CORPCODE       7A  B  1 54DSPATR(PR)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A                                  5  5'CHAT NO.'
     A                                      DSPATR(HI)
     A                                  5 16'MANUFACTURER'
     A                                      DSPATR(HI)
     A                                  6  3'TRADE NAME'
     A                                      DSPATR(HI)
     A  97        EXISTS        79A  B  3  2DSPATR(PR)
     A                                      OVRDTA
     A            SEL01          1A  B  8  2
     A N01                                  DSPATR(PR)
     A  01                                  DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A            FLD001         6A  B  8  5DSPATR(PR)
     A                                      OVRDTA
     A            FLD002        26A  B  8 16DSPATR(PR)
     A                                      OVRDTA
     A            FLD003        79A  B  9  2DSPATR(PR)
     A                                      OVRDTA
     A            SEL02          1A  B 11  2
     A N02                                  DSPATR(PR)
     A  02                                  DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A            FLD004         6A  B 11  5DSPATR(PR)
     A                                      OVRDTA
     A            FLD005        26A  B 11 16DSPATR(PR)
     A                                      OVRDTA
     A            FLD006        79A  B 12  2DSPATR(PR)
     A                                      OVRDTA
     A            SEL03          1A  B 14  2
     A N03                                  DSPATR(PR)
     A  03                                  DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A            FLD007         6A  B 14  5DSPATR(PR)
     A                                      OVRDTA
     A            FLD008        26A  B 14 16DSPATR(PR)
     A                                      OVRDTA
     A            FLD009        79A  B 15  2DSPATR(PR)
     A                                      OVRDTA
     A            SEL04          1A  B 17  2
     A N04                                  DSPATR(PR)
     A  04                                  DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A            FLD010         6A  B 17  5DSPATR(PR)
     A                                      OVRDTA
     A            FLD011        26A  B 17 16DSPATR(PR)
     A                                      OVRDTA
     A            FLD012        79A  B 18  2DSPATR(PR)
     A                                      OVRDTA
     A            SEL05          1A  B 20  2
     A N05                                  DSPATR(PR)
     A  05                                  DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A            FLD013         6A  B 20  5DSPATR(PR)
     A                                      OVRDTA
     A            FLD014        26A  B 20 16DSPATR(PR)
     A                                      OVRDTA
     A            FLD015        79A  B 21  2DSPATR(PR)
     A                                      OVRDTA
     A                                 23  3'Select ONE entry, by placing any c-
     A                                      haracter next to the desired CHAT N-
     A                                      umber'
     A                                      DSPATR(HI)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-CANCEL  F6-PREVIOUS  F7--
     A                                      NEXT')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EPOMOD2
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      RTNCSRLOC(&FMT &FLD)
     A            EDICCC         3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A                                  1 18'PURCHASE ORDER MODIFY --  HEADER D-
     A                                      ATA'
     A                                  1 76'PU2-2'
     A            EDIPOLI        6A  B  2 29DSPATR(PR)
     A                                      OVRDTA
     A                                  3  4'PO'
     A            EDIPO          7A  B  3  8DSPATR(PR)
     A                                      OVRDTA
     A            EDIREL         3A  B  3 16DSPATR(PR)
     A                                      OVRDTA
     A                                  3 28'PO DATE'
     A            EDIPODA        8A  B  3 36DSPATR(PR)
     A                                      OVRDTA
     A                                  5  1'SHIP DATE'
     A            EDISHPDA       6A  B  5 11DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                  5 22'EXP. DATE'
     A            EDIEXPDA       6A  B  5 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A                                  5 43'VENDOR CODE'
     A            EDIVENCO      10A  B  5 55DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            EDIINVLT      10A  B  5 68DSPATR(PR)
     A                                      OVRDTA
     A            EDIINVLS       1A  B  5 79DSPATR(PR)
     A                                      OVRDTA
     A            EDINOCLT      10A  B  6 68DSPATR(PR)
     A                                      OVRDTA
     A            EDINOCHK       1A  B  6 79DSPATR(PR)
     A                                      OVRDTA
     A                                  7  1'BUYER CODE'
     A            EDIBUY         4A  B  7 12DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A            EDIBUYER      15A  B  7 18DSPATR(PR)
     A                                      OVRDTA
     A                                  7 35'TYPIST'
     A            EDITYP         3A  B  7 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                  7 47'FOR DEPT'
     A            EDIFORDP       6A  B  7 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A                                  7 64'RECV DEPT'
     A            EDIRECDP       6A  B  7 74DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A                                  9  1'ADDL INFO'
     A            EDIADDLI      16A  B  9 11DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A N78                              9 54'VIA'
     A  78                              9 30'VIA (VIA CD/DS/F4 PROMPT)'
     A            EDIVIA        20A  B  9 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A                                 11  1'FOLLOWUP DT'
     A            EDIFLPDA       6A  B 11 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A                                 11 23'MODE OF TRANS'
     A            EDIMOT         2A  B 11 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  55                                  DSPATR(RI)
     A  55                                  DSPATR(PC)
     A                                 11 43'TRANS CHG METHOD'
     A            EDICHGM        2A  B 11 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  56                                  DSPATR(RI)
     A  56                                  DSPATR(PC)
     A                                 11 64'TERMS OF DEL'
     A            EDITRMOD       3A  B 11 77DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  57                                  DSPATR(RI)
     A  57                                  DSPATR(PC)
     A                                 13  1'BUDGET NO.'
     A            EDIBGTNO      12A  B 13 12DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A                                 13 25'BUDGET AMOUNT'
     A            EDIBGTAM      11Y 0B 13 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A                                 13 52'REQUISITION NO.'
     A            EDIREQNO      12A  B 13 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A N77                             15  1'FOB (FOB CODE OR VERBAGE)'
     A  77                             15  1'FOB (FOB CD/DS/F4 PROMPT)'
     A            EDIFOB        20A  B 15 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                 15 49'FREIGHT TERMS (G,P,C,U,D)'
     A            EDIF           1A  B 15 75DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A                                 16  1'TERMS'
     A            EDITM          2A  B 16  7DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            EDIDISC        5A  B 16 10DSPATR(PR)
     A                                      OVRDTA
     A            EDITMDIS      18A  B 16 16DSPATR(PR)
     A                                      OVRDTA
     A                                 16 36'CURRENCY CODE'
     A            EDICC          2A  B 16 50DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            EDICURCO      12A  B 16 53DSPATR(PR)
     A                                      OVRDTA
     A                                 16 67'IT INDIC. '
     A            EDII           1A  B 16 78DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            EDIA           1A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A                                 17  4'ALT. REMIT ADDRESS (ENTER "X")'
     A            EDIP           1A  B 17 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A                                 17 42'NON-RECEIVABLE PO (NON-CODED ONLY)'
     A                                 18  2'CONFIRMING ORDER'
     A            EDIC           1A  B 18 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A                                 18 22'CONFIRMING FREE VERBAGE'
     A            EDICONFO      34A  B 18 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A                                 19  6'STD INSTRUCTIONS (BEFORE ITEMS)'
     A                                 19 43'STD INSTRUCTIONS (AFTER ITEMS)'
     A            EDII1          3A  B 20  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            EDII2          3A  B 20 11DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            EDII3          3A  B 20 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            EDII4          3A  B 20 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            EDII5          3A  B 20 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            EDII7          3A  B 20 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            EDII8          3A  B 20 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            EDII9          3A  B 20 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A            EDII10         3A  B 20 58DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            EDII11         3A  B 20 63DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            EDII12         3A  B 20 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A            EDIR12         3A  B 20 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  54                                  DSPATR(RI)
     A  54                                  DSPATR(PC)
     A                                 21  6'RCV INSTRUCTIONS (BEFORE ITEMS)'
     A                                 21 43'RCV INSTRUCTIONS (AFTER ITEMS)'
     A            EDIR1          3A  B 22  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A            EDIR2          3A  B 22 11DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A            EDIR3          3A  B 22 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A            EDIR4          3A  B 22 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A            EDIR5          3A  B 22 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(PC)
     A            EDII6          3A  B 22 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            EDIR6          3A  B 22 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A            EDIR7          3A  B 22 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A            EDIR8          3A  B 22 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A            EDIR9          3A  B 22 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A            EDIR10         3A  B 22 58DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A            EDIR11         3A  B 22 63DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f7-REFRESH SCREEN f3-END FU-
     A                                      NCTION                             -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
DCR  A*==============================================================
DCR  A            FMT           10A  H
DCR  A            FLD           10A  H
DCR  A*==============================================================
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EPOMOD2I
     A*%%TS  SD  20030812  135235  Z010830     REL-V5R2M0  5722-WDS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      RTNCSRLOC(&FMT &FLD)
     A            EDICCC         3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A                                  1 18'PURCHASE ORDER MODIFY --  HEADER D-
     A                                      ATA'
     A                                  1 76'PU2-2'
     A            EDIPOLI        6A  B  2 29DSPATR(PR)
     A                                      OVRDTA
     A                                  3  4'PO'
     A            EDIPO          7A  B  3  8DSPATR(PR)
     A                                      OVRDTA
     A            EDIREL         3A  B  3 16DSPATR(PR)
     A                                      OVRDTA
     A                                  3 28'PO DATE'
     A            EDIPODA        8A  B  3 36DSPATR(PR)
     A                                      OVRDTA
     A                                  5  1'SHIP DATE'
     A            EDISHPDA       6A  B  5 11DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                  5 22'EXP. DATE'
     A            EDIEXPDA       6A  B  5 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A                                  5 43'VENDOR CODE'
     A            EDIVENCO      10A  B  5 55DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            EDIINVLT      10A  B  5 68DSPATR(PR)
     A                                      OVRDTA
     A            EDIINVLS       1A  B  5 79DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  58                                  DSPATR(RI)
     A  58                                  DSPATR(PC)
     A            EDINOCLT      10A  B  6 68DSPATR(PR)
     A                                      OVRDTA
     A            EDINOCHK       1A  B  6 79DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  59                                  DSPATR(RI)
     A  59                                  DSPATR(PC)
     A                                  7  1'BUYER CODE'
     A            EDIBUY         4A  B  7 12DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A            EDIBUYER      15A  B  7 18DSPATR(PR)
     A                                      OVRDTA
     A                                  7 35'TYPIST'
     A            EDITYP         3A  B  7 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                  7 47'FOR DEPT'
     A            EDIFORDP       6A  B  7 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A                                  7 64'RECV DEPT'
     A            EDIRECDP       6A  B  7 74DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A                                  9  1'ADDL INFO'
     A            EDIADDLI      16A  B  9 11DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A N78                              9 56'VIA'
     A  78                              9 34'VIA (VIA CD/DS/F4 PROMPT)'
     A            EDIVIA        20A  B  9 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A                                 11  1'FOLLOWUP DATE'
     A            EDIFLPDA       6A  B 11 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A                                 11 24'MODE OF TRANS'
     A            EDIMOT         2A  B 11 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  55                                  DSPATR(RI)
     A  55                                  DSPATR(PC)
     A                                 11 42'TRANS CHG METHOD'
     A            EDICHGM        2A  B 11 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  56                                  DSPATR(RI)
     A  56                                  DSPATR(PC)
     A                                 11 64'TERMS OF DEL'
     A            EDITRMOD       3A  B 11 77DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  57                                  DSPATR(RI)
     A  57                                  DSPATR(PC)
     A                                 13  1'BUDGET NO.'
     A            EDIBGTNO      12A  B 13 12DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A                                 13 25'BUDGET AMOUNT'
     A            EDIBGTAM      11Y 0B 13 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A                                 13 52'REQUISITION NO.'
     A            EDIREQNO      12A  B 13 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A N77                             15  1'FOB (FOB CODE OR VERBAGE)'
     A  77                             15  1'FOB (FOB CD/DS/F4 PROMPT)'
     A            EDIFOB        20A  B 15 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                 15 49'FREIGHT TERMS (G,P,C,U,D)'
     A            EDIF           1A  B 15 75DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A                                 16  1'TERMS'
     A            EDITM          2A  B 16  7DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            EDIDISC        5A  B 16 10DSPATR(PR)
     A                                      OVRDTA
     A            EDITMDIS      18A  B 16 16DSPATR(PR)
     A                                      OVRDTA
     A                                 16 36'CURRENCY CODE'
     A            EDICC          2A  B 16 50DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            EDICURCO      12A  B 16 53DSPATR(PR)
     A                                      OVRDTA
     A                                 16 67'IT INDIC. '
     A            EDII           1A  B 16 78DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            EDIA           1A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A                                 17  4'ALT. REMIT ADDRESS (ENTER "X")'
     A            EDIP           1A  B 17 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A                                 17 42'NON-RECEIVABLE PO (NON-CODED ONLY)'
     A                                 18  2'CONFIRMING ORDER'
     A            EDIC           1A  B 18 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A                                 18 22'CONFIRMING FREE VERBAGE'
     A            EDICONFO      34A  B 18 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A                                 19  6'STD INSTRUCTIONS (BEFORE ITEMS)'
     A                                 19 43'STD INSTRUCTIONS (AFTER ITEMS)'
     A            EDII1          3A  B 20  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            EDII2          3A  B 20 11DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            EDII3          3A  B 20 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            EDII4          3A  B 20 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            EDII5          3A  B 20 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            EDII6          3A  B 20 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            EDII7          3A  B 20 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            EDII8          3A  B 20 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            EDII9          3A  B 20 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A            EDII10         3A  B 20 58DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            EDII11         3A  B 20 63DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            EDII12         3A  B 20 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A                                 21  6'RCV INSTRUCTIONS (BEFORE ITEMS)'
     A                                 21 43'RCV INSTRUCTIONS (AFTER ITEMS)'
     A            EDIR1          3A  B 22  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  81                                  DSPATR(RI)
     A  81                                  DSPATR(PC)
     A            EDIR2          3A  B 22 11DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  82                                  DSPATR(RI)
     A  82                                  DSPATR(PC)
     A            EDIR3          3A  B 22 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  83                                  DSPATR(RI)
     A  83                                  DSPATR(PC)
     A            EDIR4          3A  B 22 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  84                                  DSPATR(RI)
     A  84                                  DSPATR(PC)
     A            EDIR5          3A  B 22 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  85                                  DSPATR(RI)
     A  85                                  DSPATR(PC)
     A            EDIR6          3A  B 22 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  86                                  DSPATR(RI)
     A  86                                  DSPATR(PC)
     A            EDIR7          3A  B 22 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  87                                  DSPATR(RI)
     A  87                                  DSPATR(PC)
     A            EDIR8          3A  B 22 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  88                                  DSPATR(RI)
     A  88                                  DSPATR(PC)
     A            EDIR9          3A  B 22 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  89                                  DSPATR(RI)
     A  89                                  DSPATR(PC)
     A            EDIR10         3A  B 22 58DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  90                                  DSPATR(RI)
     A  90                                  DSPATR(PC)
     A            EDIR11         3A  B 22 63DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  91                                  DSPATR(RI)
     A  91                                  DSPATR(PC)
     A            EDIR12         3A  B 22 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  92                                  DSPATR(RI)
     A  92                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f7-REFRESH SCREEN f3-END FU-
     A                                      NCTION                             -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
DCR  A*==============================================================
DCR  A            FMT           10A  H
DCR  A            FLD           10A  H
DCR  A*==============================================================
     A  99        MESSAGELN1    79   M      OVRDTA
     A*  89/01/16  12:11:25    T881S26     REL-R01M02  5728-PW1
     A          R EPURORD3
     A*%%TS  SD  20030813  151012  Z010830     REL-V5R2M0  5722-WDS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      RTNCSRLOC(&FMT &FLD)
     A            ECCC           3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A                                  1 18'PURCHASE ORDER ENTRY -- HEADER DAT-
     A                                      A'
     A                                  1 76'PU1-3'
     A            EPOLIT         6A  B  2 32DSPATR(PR)
     A                                      OVRDTA
     A                                  3  3'PO'
     A            EPONUM         7A  B  3  6DSPATR(PR)
     A                                      OVRDTA
     A            EREL           3A  B  3 14DSPATR(PR)
     A                                      OVRDTA
     A                                  5  3'SHIP DATE'
     A            ESHIPDT        6A  B  5 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                  5 26'EXPECTED DELV. DATE'
     A            EEXPDTE        6A  B  5 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A                                  7  3'BUYER CODE'
     A            EBUY           4A  B  7 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A            EBUYNAME      15A  B  7 19DSPATR(PR)
     A                                      OVRDTA
     A                                  7 36'TYPIST'
     A            ETYP           3A  B  7 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                  7 58'FOR DEPT'
     A            EFOR           6A  B  7 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A                                  9  3'ADDL INFO'
     A            EADDINFO      16A  B  9 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A N78                              9 56'VIA'
     A  78                              9 34'VIA (VIA CD/DS/F4 PROMPT)'
     A            EVIA          20A  B  9 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A                                 11  3'MODE OF TRANSPORT'
     A            EMOT           2A  B 11 22DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  55                                  DSPATR(RI)
     A  55                                  DSPATR(PC)
     A                                 11 28'TRANSPORT CHARGE METHOD'
     A            ECHGM          2A  B 11 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  56                                  DSPATR(RI)
     A  56                                  DSPATR(PC)
     A                                 11 58'TERMS OF DELIVERY'
     A            ETRMOFD        3A  B 11 77DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  58                                  DSPATR(RI)
     A  58                                  DSPATR(PC)
     A                                 13  3'BUDGE NUMBER '
     A            EBUDNO        12A  B 13 17DSPATR(PR)
     A                                      OVRDTA
     A                                 13 36'BUDGE AMOUNT '
     A            EBUDAMT       11Y 0B 13 50DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A                                      CHECK(RZ)
     A N77                             15  3'FO (ENTER FOB CODE OR VERBAGE) '
     A  77                             15  3'FOB (FOB CD/DS/F4 PROMPT .....)'
     A            EFOB          20A  B 15 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A                                 15 57'FREIGH TERMS '
     A            EF             1A  B 15 71DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A                                 15 73'(VALID'
     A                                 16 58'TERM ARE G,P,C,U,D) '
     A                                 17  3'TERMS'
     A            ETM            2A  B 17  9DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            EDISC          5A  B 17 12DSPATR(PR)
     A                                      OVRDTA
     A            ETIMOFDISC    18A  B 17 18DSPATR(PR)
     A                                      OVRDTA
     A                                 17 42'CURENCY CODE '
     A            ECC            2A  B 17 56DSPATR(PR)
     A                                      OVRDTA
     A            ECURCODE      12A  B 17 59DSPATR(PR)
     A                                      OVRDTA
     A                                 19  3'REQUISITIO NO. '
     A            EREQNUM       12A  B 19 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                 19 36'RECEIVIN DEPT. '
     A            ERCVDEP        6A  B 19 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A            EA             1A  B 21  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A                                 21  6'ALTERNAT REMIT ADDRESS '
     A                                 21 36'INVOICELES PO. '
     A            INVPO          1A  B 21 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  59                                  DSPATR(RI)
     A  59                                  DSPATR(PC)
     A                                 21 58'N-CHECK '
     A            NOCHK          1A  B 21 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-PO COMPLETE')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
DCR  A*==============================================================
DCR  A            FMT           10A  H
DCR  A            FLD           10A  H
DCR  A*==============================================================
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FMODIACC
     A*  89/03/09  15:44:59    T881S26     REL-R01M02  5728-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  7'M O D I F Y   I T E M   A C C O U'
     A                                  1 41'N T S  -  REQUIREMENT ORDERS     P-
     A                                      U2-11'
     A                                  2  7'-----------------------------------
     A                                      ----------------------------'
     A                                  4  1'PO #'
     A                                  4 14'REL'
     A                                  6  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  8  6'DEPARTMENT     EXPENSE/NW      TAX'
     A                                  8 41'CODE      PERCENT OF PRICE INCREAS-
     A                                      E'
     A                                 12  2'CHANGES ARE ALLOWED TO DEPARTMENT'
     A                                 12 36'(SUBD), EXPENSE CLASS (ADDTL DATA)-
     A                                      , TAX CODE,'
     A                                 13  2'AND PRICE FOR ALL ITEMS ON A REQUI-
     A                                      REMENT ORDER.  YOU CAN CHANGE 1, 2,-
     A                                       3, OR'
     A                                 14  2'ALL 4 OF THESE VALUES.  ALL 4 FIEL-
     A                                      DS ARE OPTIONAL AND ANY LEFT BLANK'
     A                                 14 71'WILL'
     A                                 15  2'NOT BE USED TO UPDATE THE ITEMS.'
     A                                 15 37'NOTE THIS FUNCTION IS ONLY AVAILAB-
     A                                      LE'
     A                                 16  2'FOR REQUIREMENT ORDERS.'
     A                                 18  2'ENTER YOUR DESIRED VALUES AND PRES-
     A                                      S "ENTER" TO PROCESS.'
     A            PONUM          7A  B  4  6DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  4 18DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  9  9DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            EXPCLS         6Y 0B  9 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            TX             2A  B  9 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            PCNT           4Y 0B  9 60DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A                                  9 66'%'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-END FUNCTION')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R MODPRICE
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 11'M O D I F Y   I T E M   P R I C E'
     A                                  1 46'-  REQUIREMENT ORDERS'
     A                                  1 75'PU2-10'
     A                                  2 11'-----------------------------------
     A                                      ----------------------'
     A                                  4  1'PO #'
     A                                  4 14'REL'
     A                                  7 14'QTY.'
     A                                  7 35'PRICE'
     A                                  7 55'QTY.'
     A                                  7 76'PRIC'
     A                                  8  1'ITEM CODE     UM  PRICE'
     A                                  8 37'UM   ITEM CODE     UM  PRICE'
     A                                  8 78'UM'
     A                                  9  1'---- ----     --  -----'
     A                                  9 37'--   ---- ----     --  -----'
     A                                  9 78'--'
     A            PONUM          7A  B  4  6DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  4 18DSPATR(PR)
     A                                      OVRDTA
     A            TOPMSG        40A  B  4 26DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4Y 0B  4 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            CURRENCYLI    26A  B  6 19DSPATR(PR)
     A                                      OVRDTA
     A            IT01           4A  B 10  1DSPATR(PR)
     A                                      OVRDTA
     A            CORPC01        7A  B 10  6DSPATR(PR)
     A                                      OVRDTA
     A            Q1             2A  B 10 15DSPATR(PR)
     A                                      OVRDTA
     A            WHLPRC01      15Y04B 10 19EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            P1             2A  B 10 37DSPATR(PR)
     A                                      OVRDTA
     A            IT02           4A  B 10 42DSPATR(PR)
     A                                      OVRDTA
     A            CORPC02        7A  B 10 47DSPATR(PR)
     A                                      OVRDTA
     A            Q2             2A  B 10 56DSPATR(PR)
     A                                      OVRDTA
     A            WHLPRC02      15Y04B 10 60EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            P2             2A  B 10 78DSPATR(PR)
     A                                      OVRDTA
     A            IT03           4A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            CORPC03        7A  B 11  6DSPATR(PR)
     A                                      OVRDTA
     A            Q3             2A  B 11 15DSPATR(PR)
     A                                      OVRDTA
     A            WHLPRC03      15Y04B 11 19EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            P3             2A  B 11 37DSPATR(PR)
     A                                      OVRDTA
     A            IT04           4A  B 11 42DSPATR(PR)
     A                                      OVRDTA
     A            CORPC04        7A  B 11 47DSPATR(PR)
     A                                      OVRDTA
     A            Q4             2A  B 11 56DSPATR(PR)
     A                                      OVRDTA
     A            WHLPRC04      15Y04B 11 60EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            P4             2A  B 11 78DSPATR(PR)
     A                                      OVRDTA
     A            IT05           4A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            CORPC05        7A  B 12  6DSPATR(PR)
     A                                      OVRDTA
     A            Q5             2A  B 12 15DSPATR(PR)
     A                                      OVRDTA
     A            WHLPRC05      15Y04B 12 19EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            P5             2A  B 12 37DSPATR(PR)
     A                                      OVRDTA
     A            IT06           4A  B 12 42DSPATR(PR)
     A                                      OVRDTA
     A            CORPC06        7A  B 12 47DSPATR(PR)
     A                                      OVRDTA
     A            Q6             2A  B 12 56DSPATR(PR)
     A                                      OVRDTA
     A            WHLPRC06      15Y04B 12 60EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            P6             2A  B 12 78DSPATR(PR)
     A                                      OVRDTA
     A            IT07           4A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            CORPC07        7A  B 13  6DSPATR(PR)
     A                                      OVRDTA
     A            Q7             2A  B 13 15DSPATR(PR)
     A                                      OVRDTA
     A            WHLPRC07      15Y04B 13 19EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            P7             2A  B 13 37DSPATR(PR)
     A                                      OVRDTA
     A            IT08           4A  B 13 42DSPATR(PR)
     A                                      OVRDTA
     A            CORPC08        7A  B 13 47DSPATR(PR)
     A                                      OVRDTA
     A            Q8             2A  B 13 56DSPATR(PR)
     A                                      OVRDTA
     A            WHLPRC08      15Y04B 13 60EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            P8             2A  B 13 78DSPATR(PR)
     A                                      OVRDTA
     A            IT09           4A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            CORPC09        7A  B 14  6DSPATR(PR)
     A                                      OVRDTA
     A            Q9             2A  B 14 15DSPATR(PR)
     A                                      OVRDTA
     A            WHLPRC09      15Y04B 14 19EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            P9             2A  B 14 37DSPATR(PR)
     A                                      OVRDTA
     A            IT10           4A  B 14 42DSPATR(PR)
     A                                      OVRDTA
     A            CORPC10        7A  B 14 47DSPATR(PR)
     A                                      OVRDTA
     A            QA             2A  B 14 56DSPATR(PR)
     A                                      OVRDTA
     A            WHLPRC10      15Y04B 14 60EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            PA             2A  B 14 78DSPATR(PR)
     A                                      OVRDTA
     A            IT11           4A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            CORPC11        7A  B 15  6DSPATR(PR)
     A                                      OVRDTA
     A            QB             2A  B 15 15DSPATR(PR)
     A                                      OVRDTA
     A            WHLPRC11      15Y04B 15 19EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            PB             2A  B 15 37DSPATR(PR)
     A                                      OVRDTA
     A            IT12           4A  B 15 42DSPATR(PR)
     A                                      OVRDTA
     A            CORPC12        7A  B 15 47DSPATR(PR)
     A                                      OVRDTA
     A            QC             2A  B 15 56DSPATR(PR)
     A                                      OVRDTA
     A            WHLPRC12      15Y04B 15 60EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            PC             2A  B 15 78DSPATR(PR)
     A                                      OVRDTA
     A            IT13           4A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            CORPC13        7A  B 16  6DSPATR(PR)
     A                                      OVRDTA
     A            QD             2A  B 16 15DSPATR(PR)
     A                                      OVRDTA
     A            WHLPRC13      15Y04B 16 19EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            PD             2A  B 16 37DSPATR(PR)
     A                                      OVRDTA
     A            IT14           4A  B 16 42DSPATR(PR)
     A                                      OVRDTA
     A            CORPC14        7A  B 16 47DSPATR(PR)
     A                                      OVRDTA
     A            QE             2A  B 16 56DSPATR(PR)
     A                                      OVRDTA
     A            WHLPRC14      15Y04B 16 60EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            PE             2A  B 16 78DSPATR(PR)
     A                                      OVRDTA
     A            IT15           4A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            CORPC15        7A  B 17  6DSPATR(PR)
     A                                      OVRDTA
     A            QF             2A  B 17 15DSPATR(PR)
     A                                      OVRDTA
     A            WHLPRC15      15Y04B 17 19EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            PF             2A  B 17 37DSPATR(PR)
     A                                      OVRDTA
     A            IT16           4A  B 17 42DSPATR(PR)
     A                                      OVRDTA
     A            CORPC16        7A  B 17 47DSPATR(PR)
     A                                      OVRDTA
     A            QG             2A  B 17 56DSPATR(PR)
     A                                      OVRDTA
     A            WHLPRC16      15Y04B 17 60EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            PG             2A  B 17 78DSPATR(PR)
     A                                      OVRDTA
     A            BOTTOMMSG     40A  B 21  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-END FUNCTION            -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R MODPRICE1B
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 11'M O D I F Y   I T E M   P R I C E'
     A                                  1 46'-  REQUIREMENT ORDERS'
     A                                  1 75'PU2-10'
     A                                  2 11'-----------------------------------
     A                                      ----------------------'
     A                                  4  1'PO #'
     A                                  4 14'REL'
     A                                  7 14'QTY.'
     A                                  7 35'PRICE'
     A                                  7 55'QTY.'
     A                                  7 76'PRIC'
     A                                  8  1'ITEM CODE     UM  PRICE'
     A                                  8 37'UM   ITEM CODE     UM  PRICE'
     A                                  8 78'UM'
     A                                  9  1'---- ----     --  -----'
     A                                  9 37'--   ---- ----     --  -----'
     A                                  9 78'--'
     A            PONUM          7A  B  4  6DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  4 18DSPATR(PR)
     A                                      OVRDTA
     A            TOPMSG        40A  B  4 26DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4Y 0B  4 68DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            CURRENCYLI    26A  B  6 19DSPATR(PR)
     A                                      OVRDTA
     A            IT01           4A  B 10  1DSPATR(PR)
     A                                      OVRDTA
     A            CORPC01        7A  B 10  6DSPATR(PR)
     A                                      OVRDTA
     A            Q1             2A  B 10 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            WHLPRC01      15Y04B 10 19EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            P1             2A  B 10 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            IT02           4A  B 10 42DSPATR(PR)
     A                                      OVRDTA
     A            CORPC02        7A  B 10 47DSPATR(PR)
     A                                      OVRDTA
     A            Q2             2A  B 10 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            WHLPRC02      15Y04B 10 60EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            P2             2A  B 10 78DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            IT03           4A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            CORPC03        7A  B 11  6DSPATR(PR)
     A                                      OVRDTA
     A            Q3             2A  B 11 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            WHLPRC03      15Y04B 11 19EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            P3             2A  B 11 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            IT04           4A  B 11 42DSPATR(PR)
     A                                      OVRDTA
     A            CORPC04        7A  B 11 47DSPATR(PR)
     A                                      OVRDTA
     A            Q4             2A  B 11 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            WHLPRC04      15Y04B 11 60EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            P4             2A  B 11 78DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            IT05           4A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            CORPC05        7A  B 12  6DSPATR(PR)
     A                                      OVRDTA
     A            Q5             2A  B 12 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            WHLPRC05      15Y04B 12 19EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            P5             2A  B 12 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            IT06           4A  B 12 42DSPATR(PR)
     A                                      OVRDTA
     A            CORPC06        7A  B 12 47DSPATR(PR)
     A                                      OVRDTA
     A            Q6             2A  B 12 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            WHLPRC06      15Y04B 12 60EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            P6             2A  B 12 78DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A            IT07           4A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            CORPC07        7A  B 13  6DSPATR(PR)
     A                                      OVRDTA
     A            Q7             2A  B 13 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A            WHLPRC07      15Y04B 13 19EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            P7             2A  B 13 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A            IT08           4A  B 13 42DSPATR(PR)
     A                                      OVRDTA
     A            CORPC08        7A  B 13 47DSPATR(PR)
     A                                      OVRDTA
     A            Q8             2A  B 13 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A            WHLPRC08      15Y04B 13 60EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            P8             2A  B 13 78DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A            IT09           4A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            CORPC09        7A  B 14  6DSPATR(PR)
     A                                      OVRDTA
     A            Q9             2A  B 14 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  54                                  DSPATR(RI)
     A  54                                  DSPATR(PC)
     A            WHLPRC09      15Y04B 14 19EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  55                                  DSPATR(RI)
     A  55                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            P9             2A  B 14 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  57                                  DSPATR(RI)
     A  57                                  DSPATR(PC)
     A            IT10           4A  B 14 42DSPATR(PR)
     A                                      OVRDTA
     A            CORPC10        7A  B 14 47DSPATR(PR)
     A                                      OVRDTA
     A            QA             2A  B 14 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A            WHLPRC10      15Y04B 14 60EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            PA             2A  B 14 78DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            IT11           4A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            CORPC11        7A  B 15  6DSPATR(PR)
     A                                      OVRDTA
     A            QB             2A  B 15 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  66                                  DSPATR(RI)
     A  66                                  DSPATR(PC)
     A            WHLPRC11      15Y04B 15 19EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  67                                  DSPATR(RI)
     A  67                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            PB             2A  B 15 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  69                                  DSPATR(RI)
     A  69                                  DSPATR(PC)
     A            IT12           4A  B 15 42DSPATR(PR)
     A                                      OVRDTA
     A            CORPC12        7A  B 15 47DSPATR(PR)
     A                                      OVRDTA
     A            QC             2A  B 15 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  72                                  DSPATR(RI)
     A  72                                  DSPATR(PC)
     A            WHLPRC12      15Y04B 15 60EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  73                                  DSPATR(RI)
     A  73                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            PC             2A  B 15 78DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  75                                  DSPATR(RI)
     A  75                                  DSPATR(PC)
     A            IT13           4A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            CORPC13        7A  B 16  6DSPATR(PR)
     A                                      OVRDTA
     A            QD             2A  B 16 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  78                                  DSPATR(RI)
     A  78                                  DSPATR(PC)
     A            WHLPRC13      15Y04B 16 19EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  79                                  DSPATR(RI)
     A  79                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            PD             2A  B 16 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  81                                  DSPATR(RI)
     A  81                                  DSPATR(PC)
     A            IT14           4A  B 16 42DSPATR(PR)
     A                                      OVRDTA
     A            CORPC14        7A  B 16 47DSPATR(PR)
     A                                      OVRDTA
     A            QE             2A  B 16 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  84                                  DSPATR(RI)
     A  84                                  DSPATR(PC)
     A            WHLPRC14      15Y04B 16 60EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  85                                  DSPATR(RI)
     A  85                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            PE             2A  B 16 78DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  87                                  DSPATR(RI)
     A  87                                  DSPATR(PC)
     A            IT15           4A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            CORPC15        7A  B 17  6DSPATR(PR)
     A                                      OVRDTA
     A            QF             2A  B 17 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  90                                  DSPATR(RI)
     A  90                                  DSPATR(PC)
     A            WHLPRC15      15Y04B 17 19EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  91                                  DSPATR(RI)
     A  91                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            PF             2A  B 17 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  93                                  DSPATR(RI)
     A  93                                  DSPATR(PC)
     A            IT16           4A  B 17 42DSPATR(PR)
     A                                      OVRDTA
     A            CORPC16        7A  B 17 47DSPATR(PR)
     A                                      OVRDTA
     A            QG             2A  B 17 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  96                                  DSPATR(RI)
     A  96                                  DSPATR(PC)
     A            WHLPRC16      15Y04B 17 60EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  97                                  DSPATR(RI)
     A  97                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            PG             2A  B 17 78DSPATR(UL)
     A            BOTTOMMSG     40A  B 21  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f7-CHANGE ITEM NO. f3-END F-
     A                                      UNCTION                            -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R POCDESC1
     A*  89/02/16  09:13:33    T881S26     REL-R01M02  5728-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 18'MANUFACTURER AND PART NUMBER SELEC-
     A                                      TION'
     A                                  1 76'MAN-1'
     A                                  4  1'PRIMARY DESCRIPTION:'
     A                                  9  1'SECONDARY DESCRIPTION:'
     A                                 14 10'MANUFACTURER AND PART NUMBER SELEC-
     A                                      TION'
     A                                 14 61'VALID SELECTION'
     A                                 15 62'INDICATORS:'
     A                                 16 62'"P" - PRIMARY'
     A                                 17 68'LANGUAGE'
     A                                 18 62'"S" - SECONDARY'
     A                                 19 68'LANGUAGE'
     A                                 20 62'"B" - BOTH'
     A                                 21 68'LANGUAGES'
     A            CCC            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            CODE           7A  B  2  5DSPATR(PR)
     A                                      OVRDTA
     A            KEYWORDADJ    50A  B  4 26DSPATR(PR)
     A                                      OVRDTA
     A            PDESC1        79A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            PDESC2        79A  B  6  1DSPATR(PR)
     A                                      OVRDTA
     A            PDESC3        79A  B  7  1DSPATR(PR)
     A                                      OVRDTA
     A            PDESC4        79A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            KEYWORDAD2    50A  B  9 26DSPATR(PR)
     A                                      OVRDTA
     A            SDESC1        79A  B 10  1DSPATR(PR)
     A                                      OVRDTA
     A            SDESC2        79A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            SDESC3        79A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            SDESC4        79A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B 15  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  58                                  DSPATR(RI)
     A  58                                  DSPATR(PC)
     A                                      VALUES(' ' 'P' 'S' 'B')
     A            MANUFACT1     26A  B 15  5DSPATR(PR)
     A                                      OVRDTA
     A            PD1            4A  B 15 33DSPATR(PR)
     A                                      OVRDTA
     A            PARTNO1       20A  B 15 39DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 16  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A                                      VALUES(' ' 'P' 'S' 'B')
     A            MANUFACT2     26A  B 16  5DSPATR(PR)
     A                                      OVRDTA
     A            PD2            4A  B 16 33DSPATR(PR)
     A                                      OVRDTA
     A            PARTNO2       20A  B 16 39DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 17  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  66                                  DSPATR(RI)
     A  66                                  DSPATR(PC)
     A                                      VALUES(' ' 'P' 'S' 'B')
     A            MANUFACT3     26A  B 17  5DSPATR(PR)
     A                                      OVRDTA
     A            PD3            4A  B 17 33DSPATR(PR)
     A                                      OVRDTA
     A            PARTNO3       20A  B 17 39DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 18  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  70                                  DSPATR(RI)
     A  70                                  DSPATR(PC)
     A                                      VALUES(' ' 'P' 'S' 'B')
     A            MANUFACT4     26A  B 18  5DSPATR(PR)
     A                                      OVRDTA
     A            PD4            4A  B 18 33DSPATR(PR)
     A                                      OVRDTA
     A            PARTNO4       20A  B 18 39DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 19  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  74                                  DSPATR(RI)
     A  74                                  DSPATR(PC)
     A                                      VALUES(' ' 'P' 'S' 'B')
     A            MANUFACT5     26A  B 19  5DSPATR(PR)
     A                                      OVRDTA
     A            PD5            4A  B 19 33DSPATR(PR)
     A                                      OVRDTA
     A            PARTNO5       20A  B 19 39DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 20  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  78                                  DSPATR(RI)
     A  78                                  DSPATR(PC)
     A                                      VALUES(' ' 'P' 'S' 'B')
     A            MANUFACT6     26A  B 20  5DSPATR(PR)
     A                                      OVRDTA
     A            PD6            4A  B 20 33DSPATR(PR)
     A                                      OVRDTA
     A            PARTNO6       20A  B 20 39DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 21  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  82                                  DSPATR(RI)
     A  82                                  DSPATR(PC)
     A                                      VALUES(' ' 'P' 'S' 'B')
     A            MANUFACT7     26A  B 21  5DSPATR(PR)
     A                                      OVRDTA
     A            PD7            4A  B 21 33DSPATR(PR)
     A                                      OVRDTA
     A            PARTNO7       20A  B 21 39DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 22  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  86                                  DSPATR(RI)
     A  86                                  DSPATR(PC)
     A                                      VALUES(' ' 'P' 'S' 'B')
     A            MANUFACT8     26A  B 22  5DSPATR(PR)
     A                                      OVRDTA
     A            PD8            4A  B 22 33DSPATR(PR)
     A                                      OVRDTA
     A            PARTNO8       20A  B 22 39DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-PREVIOUS SCREEN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R PODELT1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 14'P U R C H A S E    O R D E R    D'
     A                                  1 48'E L E T I O N'
     A                                  1 78'PU4'
     A                                  4  1'PURCHASE ORDER'
     A                                  6  1'REASON'
     A                                  8  6'ENTER "X" IF NO PRINT IS DESIRED'
     A                                 11  1'1) ENTER P.O. NUMBER'
     A                                 12  1'2) ENTER REASON IF DESIRED (OPTION-
     A                                      AL)'
     A                                 13  1'3) PRESS "ENTER" TO PROCESS'
     A                                 14 10'"f3" TO EXIT PROGRAM'
     A                                 16  1'NOTE: PURCHASE ORDER MUST BE COMPL-
     A                                      ETE.'
     A                                 17  7'THE DELETION OF A PURCHASE ORDER.'
     A                                 17 41'DELETES ALL OF THE CORRESPONDING'
     A                                 18 11'REQUISITIONS.'
     A                                 19  7'THE DELETE OF A REQUIREMENT ORDER'
     A                                 19 41'DELETES ONLY THE REQUIREMENT'
     A                                 20 11'ORDER ALL SHIPPING RELEASES WILL R-
     A                                      EMAIN.'
     A            CO             3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B  4 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            REL            3Y 0B  4 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            REASON        70A  B  6  9DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            X              1A  B  8  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                      VALUES('X' ' ')
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R POMOD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 17'M O D I F Y   P U R C H A S E   O'
     A                                  1 51'R D E R'
     A                                  1 76'PU2-1'
     A                                  2 17'-----------------------------------
     A                                      -------'
     A                                  4  2'1) ENTER PO#'
     A                                  4 23'REL'
     A                                  6  2'2) ENTER "X" TO INDICATE THE DESIR-
     A                                      ED FUNCTION'
     A                                  8 12'MODIFY HEADER DATA'
     A                                  9 12'ADD AN ITEM'
     A                                 10 12'MODIFY AN EXISTING ITEM'
     A                                 11 12'DELETE AN ITEM'
     A                                 12 12'CANCEL REMAINING ONORDER FOR ALL I-
     A                                      TEMS (ORDER IS NOT DELETED)'
     A                                 13 12'REPRINT ORDER'
     A                                 14 12'MODIFY REQUIREMENT ORDER ITEMS (PR-
     A                                      ICE INFORMATION)'
     A                                 15 12'MODIFY REQUIREMENT ORDER ITEMS (AC-
     A                                      COUNTING AND TAX INFORMATION)'
     A                                 19  2'3) PRESS "ENTER" TO PROCESS'
     A                                 20 11'"f2" FOR PO REPRINT'
     A                                 21 11'"f3" TO EXIT'
     A            PONUM          7A  B  4 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            REL            3Y 0B  4 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            A              1A  B  8 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            B              1A  B  9 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            C              1A  B 10 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            D              1A  B 11 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            F              1A  B 12 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            G              1A  B 13 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            I              1A  B 14 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            J              1A  B 15 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            COMMANDLN1    79A  B 24  1DFTVAL('f2-PO REPRINT f3-END PROGRA-
     A                                      M                                  -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R POMOD2
     A*%%TS  SD  20030813  145537  Z010830     REL-V5R2M0  5722-WDS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      RTNCSRLOC(&FMT &FLD)
     A            CCC            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A                                  1 18'PURCHASE ORDER MODIFY --  HEADER D-
     A                                      ATA'
     A                                  1 76'PU2-2'
     A                                  2  4'PO'
     A            PONUM          7A  B  2  8DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  2 16DSPATR(PR)
     A                                      OVRDTA
     A                                  2 28'PO DATE'
     A            PODATE         8A  B  2 36DSPATR(PR)
     A                                      OVRDTA
     A                                  4  1'SHIP DATE'
     A            SHPDTE         6A  B  4 11DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                  4 22'EXP. DATE'
     A            EXPDTE         6A  B  4 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A                                  4 43'VENDOR CODE'
     A            VENCODE       10A  B  4 55DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            INVLESSLT     10A  B  4 68DSPATR(PR)
     A                                      OVRDTA
     A            INVLESSPO      1A  B  4 79DSPATR(PR)
     A                                      OVRDTA
     A            NOCHKLIT      10A  B  5 68DSPATR(PR)
     A                                      OVRDTA
     A            NOCHK          1A  B  5 79DSPATR(PR)
     A                                      OVRDTA
     A                                  6  1'BUYER CODE'
     A            BUY            4A  B  6 12DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A            BUYER         15A  B  6 18DSPATR(PR)
     A                                      OVRDTA
     A                                  6 35'TYPIST'
     A            TYP            3A  B  6 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                  6 47'FOR DEPT'
     A            FORDEP         6A  B  6 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A                                  6 64'RECV DEPT'
     A            RECDEP         6A  B  6 74DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A                                  8  1'ADDL INFO'
     A            ADDLINFO      16A  B  8 11DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A N78                              8 56'VIA'
     A  78                              8 34'VIA (VIA CD/DS/F4 PROMPT)'
     A            VIA           20A  B  8 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A                                 10  1'FOLLOWUP DT'
     A            FLPDTE         6A  B 10 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A                                 10 24'BUD#'
     A            BUDGETNO      12A  B 10 29DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A                                 10 43'BUD AMT'
     A            BUDGTAMT      11Y 0B 10 51DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A                                 10 63'REQ#'
     A            REQNUM        12A  B 10 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A N77                             12  1'FOB (FOB CODE OR VERBAGE)'
     A  77                             12  1'FOB (FOB CD/DS/F4 PROMPT)'
     A            FOB           20A  B 12 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                 12 49'FREIGHT TERMS (G,P,C,U,D)'
     A            F              1A  B 12 75DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A                                 14  1'TERMS'
     A            TM             2A  B 14  7DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            DISC           5A  B 14 10DSPATR(PR)
     A                                      OVRDTA
     A            TIMEOFDISC    18A  B 14 16DSPATR(PR)
     A                                      OVRDTA
     A                                 14 36'CURRENCY CODE'
     A            CC             2A  B 14 50DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            CURCODE       12A  B 14 53DSPATR(PR)
     A                                      OVRDTA
     A                                 14 67'IT INDIC. '
     A            I              1A  B 14 78DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            A              1A  B 16  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A                                 16  4'ALT. REMIT ADDRESS (ENTER "X")'
     A            P              1A  B 16 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A                                 16 42'NON-RECEIVABLE PO (NON-CODED ONLY)'
     A                                 18  2'CONFIRMING ORDER'
     A            C              1A  B 18 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A                                 18 22'CONFIRMING FREE VERBAGE'
     A            CONFVERB      34A  B 18 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A                                 19  6'STD INSTRUCTIONS (BEFORE ITEMS)'
     A                                 19 43'STD INSTRUCTIONS (AFTER ITEMS)'
     A            I1             3A  B 20  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            I2             3A  B 20 11DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            I3             3A  B 20 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            I4             3A  B 20 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            I5             3A  B 20 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            I6             3A  B 20 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            I7             3A  B 20 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            I8             3A  B 20 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            I9             3A  B 20 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A            I10            3A  B 20 58DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            I11            3A  B 20 63DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            I12            3A  B 20 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A                                 21  6'RCV INSTRUCTIONS (BEFORE ITEMS)'
     A                                 21 43'RCV INSTRUCTIONS (AFTER ITEMS)'
     A            RCV1           3A  B 22  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A            RCV2           3A  B 22 11DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            RCV3           3A  B 22 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A            RCV4           3A  B 22 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            RCV5           3A  B 22 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A            RCV6           3A  B 22 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A            RCV7           3A  B 22 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  66                                  DSPATR(RI)
     A  66                                  DSPATR(PC)
     A            RCV8           3A  B 22 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  67                                  DSPATR(RI)
     A  67                                  DSPATR(PC)
     A            RCV9           3A  B 22 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  68                                  DSPATR(RI)
     A  68                                  DSPATR(PC)
     A            RCV10          3A  B 22 58DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  69                                  DSPATR(RI)
     A  69                                  DSPATR(PC)
     A            RCV11          3A  B 22 63DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  70                                  DSPATR(RI)
     A  70                                  DSPATR(PC)
     A            RCV12          3A  B 22 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  71                                  DSPATR(RI)
     A  71                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f7-REFRESH SCREEN f3-END FU-
     A                                      NCTION                             -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
DCR  A*==============================================================
DCR  A            FMT           10A  H
DCR  A            FLD           10A  H
DCR  A*==============================================================
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R POMOD2I
     A*%%TS  SD  20030812  143241  Z010830     REL-V5R2M0  5722-WDS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      RTNCSRLOC(&FMT &FLD)
     A            CCC            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A                                  1 18'PURCHASE ORDER MODIFY --  HEADER D-
     A                                      ATA'
     A                                  1 76'PU2-2'
     A                                  2  4'PO'
     A            PONUM          7A  B  2  8DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  2 16DSPATR(PR)
     A                                      OVRDTA
     A                                  2 28'PO DATE'
     A            PODATE         8A  B  2 36DSPATR(PR)
     A                                      OVRDTA
     A                                  4  1'SHIP DATE'
     A            SHPDTE         6A  B  4 11DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                  4 22'EXP. DATE'
     A            EXPDTE         6A  B  4 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A                                  4 43'VENDOR CODE'
     A            VENCODE       10A  B  4 55DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            INVLESSLT     10A  B  4 68DSPATR(PR)
     A                                      OVRDTA
     A            INVLESSPO      1A  B  4 79DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  58                                  DSPATR(RI)
     A  58                                  DSPATR(PC)
     A            NOCHKLIT      10A  B  5 68DSPATR(PR)
     A                                      OVRDTA
     A            NOCHK          1A  B  5 79DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  59                                  DSPATR(RI)
     A  59                                  DSPATR(PC)
     A                                  6  1'BUYER CODE'
     A            BUY            4A  B  6 12DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A            BUYER         15A  B  6 18DSPATR(PR)
     A                                      OVRDTA
     A                                  6 35'TYPIST'
     A            TYP            3A  B  6 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                  6 47'FOR DEPT'
     A            FORDEP         6A  B  6 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A                                  6 64'RECV DEPT'
     A            RECDEP         6A  B  6 74DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A                                  8  1'ADDL INFO'
     A            ADDLINFO      16A  B  8 11DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A N78                              8 56'VIA'
     A  78                              8 34'VIA (VIA CD/DS/F4 PROMPT)'
     A            VIA           20A  B  8 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A                                 10  1'FOLLOWUP DT'
     A            FLPDTE         6A  B 10 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A                                 10 23'BUD#'
     A            BUDGETNO      12A  B 10 28DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A                                 10 41'BUD AMT'
     A            BUDGTAMT      11Y 0B 10 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A                                 10 63'REQ#'
     A            REQNUM        12A  B 10 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A N77                             12  1'FOB (FOB CODE OR VERBAGE)'
     A  77                             12  1'FOB (FOB CD/DS/F4 PROMPT)'
     A            FOB           20A  B 12 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                 12 49'FREIGHT TERMS (G,P,C,U,D)'
     A            F              1A  B 12 75DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A                                 14  1'TERMS'
     A            TM             2A  B 14  7DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            DISC           5A  B 14 10DSPATR(PR)
     A                                      OVRDTA
     A            TIMEOFDISC    18A  B 14 16DSPATR(PR)
     A                                      OVRDTA
     A                                 14 36'CURRENCY CODE'
     A            CC             2A  B 14 50DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            CURCODE       12A  B 14 53DSPATR(PR)
     A                                      OVRDTA
     A                                 14 67'IT INDIC. '
     A            I              1A  B 14 78DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            A              1A  B 16  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A                                 16  4'ALT. REMIT ADDRESS (ENTER "X")'
     A            P              1A  B 16 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A                                 16 42'NON-RECEIVABLE PO (NON-CODED ONLY)'
     A                                 18  2'CONFIRMING ORDER'
     A            C              1A  B 18 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A                                 18 22'CONFIRMING FREE VERBAGE'
     A            CONFVERB      34A  B 18 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A                                 19  6'STD INSTRUCTIONS (BEFORE ITEMS)'
     A                                 19 43'STD INSTRUCTIONS (AFTER ITEMS)'
     A            I1             3A  B 20  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            I2             3A  B 20 11DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            I3             3A  B 20 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            I4             3A  B 20 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            I5             3A  B 20 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            I6             3A  B 20 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            I7             3A  B 20 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            I8             3A  B 20 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            I9             3A  B 20 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A            I10            3A  B 20 58DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            I11            3A  B 20 63DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            I12            3A  B 20 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A                                 21  6'RCV INSTRUCTIONS (BEFORE ITEMS)'
     A                                 21 43'RCV INSTRUCTIONS (AFTER ITEMS)'
     A            RCV1           3A  B 22  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A            RCV2           3A  B 22 11DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            RCV3           3A  B 22 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A            RCV4           3A  B 22 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            RCV5           3A  B 22 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A            RCV6           3A  B 22 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A            RCV7           3A  B 22 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  66                                  DSPATR(RI)
     A  66                                  DSPATR(PC)
     A            RCV8           3A  B 22 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  67                                  DSPATR(RI)
     A  67                                  DSPATR(PC)
     A            RCV9           3A  B 22 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  68                                  DSPATR(RI)
     A  68                                  DSPATR(PC)
     A            RCV10          3A  B 22 58DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  69                                  DSPATR(RI)
     A  69                                  DSPATR(PC)
     A            RCV11          3A  B 22 63DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  70                                  DSPATR(RI)
     A  70                                  DSPATR(PC)
     A            RCV12          3A  B 22 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  71                                  DSPATR(RI)
     A  71                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f7-REFRESH SCREEN f3-END FU-
     A                                      NCTION                             -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
DCR  A*==============================================================
DCR  A            FMT           10A  H
DCR  A            FLD           10A  H
DCR  A*==============================================================
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R POMOD4
     A*%%TS  SD  19961118  100107  A193138     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 18'PURCHASE ORDER MODIFY --  ITEMS'
     A                                  1 75'PU2-4'
     A                                  3  1'PO'
     A                                  4  3'ITEM#'
     A                                  4 18'REQUISITION'
     A                                  4 46'CODE'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  6  7'UNIT PRICE   UM'
     A                                  6 24'CHAT#'
     A                                  6 36'QUANTITY    UM  DEPT  CLASS  EXPEN-
     A                                      SE/NW'
     A                                  9 29'TAX CODE'
     A                                  9 42'SECONDARY LANGUAGE'
     A                                 10  3'MASTER STOCK'
     A                                 10 24'(FOR RAW MATERIALS)'
     A                                 10 48'QS9000 TRACKING("X")'
     A                                 11  3'STANDARD INSTRUCTIONS'
     A                                 11 48'MANUFACTURER SELECTION'
     A                                 12  3'RECEIVING INSTRUCTIONS'
     A                                 13  3'DESCRIPTION/COMMENTS  (FOR LOCAL D-
     A                                      ESC. ENTER AN "@" AS THE FIRST CHAR-
     A                                      ACTER)'
     A                                 21 21'IF ADDITIONAL DESCRIPTION IS NEEDE-
     A                                      D KEY "X"'
     A                                 22  1'PRESS "f3" TO RETURN TO SELECTION'
     A                                 22 35'SCREEN'
     A            EDILIT4        6A  B  2 29DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B  3  4DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  3 12DSPATR(PR)
     A                                      OVRDTA
     A            TOPMSG        60A  B  3 19DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4Y 0B  4  9DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            REQNUM        12A  B  4 30DSPATR(PR)
     A                                      OVRDTA
     A            CORPCDE        7A  B  4 51DSPATR(PR)
     A                                      OVRDTA
     A            PRCWHL        15Y 4B  7  2EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            UP             2A  B  7 20DSPATR(PR)
     A                                      OVRDTA
     A            CHATCODE       6A  B  7 24DSPATR(PR)
     A                                      OVRDTA
     A            QTYWHL        12Y 4B  7 33EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            UQ             2A  B  7 48DSPATR(PR)
     A                                      OVRDTA
     A            SUBD           4A  B  7 52DSPATR(PR)
     A                                      OVRDTA
     A            CLASS          3A  B  7 59DSPATR(PR)
     A                                      OVRDTA
     A            ADDLDT         6A  B  7 68DSPATR(PR)
     A                                      OVRDTA
     A            CURRENCYLI    26A  B  8  2DSPATR(PR)
     A                                      OVRDTA
     A            UNITVALLIT    11A  B  9  3DSPATR(PR)
     A                                      OVRDTA
     A            VALUE         11Y 0B  9 15DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            TX             2A  B  9 38DSPATR(PR)
     A                                      OVRDTA
     A            L              1A  B  9 61DSPATR(PR)
     A                                      OVRDTA
     A            INVLSLIT      14A  B  9 64DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            MASTSTK        7A  B 10 16DSPATR(PR)
     A                                      OVRDTA
     A            TRACKING       1   B 10 69DSPATR(PR)
     A                                      OVRDTA
     A            S1             3A  B 11 25DSPATR(PR)
     A                                      OVRDTA
     A            S2             3A  B 11 30DSPATR(PR)
     A                                      OVRDTA
     A            S3             3A  B 11 35DSPATR(PR)
     A                                      OVRDTA
     A            S4             3A  B 11 40DSPATR(PR)
     A                                      OVRDTA
     A            RCV1           3A  B 12 26DSPATR(PR)
     A                                      OVRDTA
     A            RCV2           3A  B 12 31DSPATR(PR)
     A                                      OVRDTA
     A            RCV3           3A  B 12 36DSPATR(PR)
     A                                      OVRDTA
     A            RCV4           3A  B 12 41DSPATR(PR)
     A                                      OVRDTA
     A            MANUFACTSE    26A  B 12 48DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLIN    79A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLI2    79A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLI3    79A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLI4    79A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLI5    79A  B 18  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLI6    79A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLI7    79A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 21 65DSPATR(PR)
     A                                      OVRDTA
     A            ADDLINST      34A  B 23  7DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-END FUNCTION            -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A*  91/04/30  16:16:40    T881S26     REL-R03M00  5728-PW1
     A          R POMOD4B
     A*%%TS  SD  19961118  100107  A193138     REL-V3R6M0  5716-PW1
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      PUTOVR
     A                                  1 18'PURCHASE ORDER MODIFY --  ITEMS'
     A                                  1 75'PU2-4'
     A                                  3  1'PO'
     A                                  4  3'ITEM#'
     A                                  4 18'REQUISITION'
     A                                  4 46'CODE'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  6  7'UNIT PRICE   UM'
     A                                  6 24'CHAT#'
     A                                  6 36'QUANTITY    UM  DEPT  CLASS  EXPEN-
     A                                      SE/NW'
     A                                  9 29'TAX CODE'
     A                                  9 42'SECONDARY LANGUAGE'
     A                                 10  3'MASTER STOCK'
     A                                 10 24'(FOR RAW MATERIALS)'
     A                                 10 48'QS9000 TRACKING("X")'
     A                                 11  3'STANDARD INSTRUCTIONS'
     A                                 11 48'MANUFACTURER SELECTION'
     A                                 12  3'RECEIVING INSTRUCTIONS'
     A                                 13  3'DESCRIPTION/COMMENTS  (FOR LOCAL D-
     A                                      ESC. ENTER AN "@" AS THE FIRST CHAR-
     A                                      ACTER)'
     A                                 21 21'IF ADDITIONAL DESCRIPTION IS NEEDE-
     A                                      D KEY "X"'
     A                                 22  1'PRESS "f3" TO RETURN TO SELECTION'
     A                                 22 35'SCREEN'
     A            EDILIT4B       6A  B  2 29DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B  3  4DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  3 12DSPATR(PR)
     A                                      OVRDTA
     A            TOPMSG        60A  B  3 19DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4Y 0B  4  9DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            REQNUM        12A  B  4 30DSPATR(PR)
     A                                      OVRDTA
     A            CORPCDE        7A  B  4 51DSPATR(PR)
     A                                      OVRDTA
     A            PRCWHL        15Y 4B  7  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A                                      CHECK(RZ)
     A            UP             2A  B  7 20DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            CHATCODE       6A  B  7 24DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            QTYWHL        12Y 4B  7 33EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            UQ             2A  B  7 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            SUBD           4A  B  7 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            CLASS          3A  B  7 58DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            ADDLDT         6Y 0B  7 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CURRENCYLI    26A  B  8  2DSPATR(PR)
     A                                      OVRDTA
     A            UNITVALLIT    11A  B  9  3DSPATR(PR)
     A                                      OVRDTA
     A            VALUE         11Y 0B  9 15DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            TX             2A  B  9 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            L              1A  B  9 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            INVSLIT       14A  B  9 64DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            MASTSTK        7A  B 10 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            TRACKING       1   B 10 69DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            S1             3A  B 11 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            S2             3A  B 11 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            S3             3A  B 11 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            S4             3A  B 11 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            RCV1           3A  B 12 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A            RCV2           3A  B 12 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            RCV3           3A  B 12 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A            RCV4           3A  B 12 41DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            MANUFACTSE    26A  B 12 48DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLIN    79A  B 14  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            COMMENTLI2    79A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            COMMENTLI3    79A  B 16  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            COMMENTLI4    79A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            COMMENTLI5    79A  B 18  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            COMMENTLI6    79A  B 19  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            COMMENTLI7    79A  B 20  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            C              1A  B 21 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            ADDLINST      34A  B 23  7DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f2-DESC./ MANUF. f8-SECOND -
     A                                      LANGUAGE f7-CHANGE ITEM f3-END FUNC-
     A                                      TION             ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A*  91/04/30  16:16:40    T881S26     REL-R03M00  5728-PW1
     A          R POMOD4BL
     A*%%TS  SD  19961118  100107  A193138     REL-V3R6M0  5716-PW1
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      PUTOVR
     A                                  1 18'PURCHASE ORDER MODIFY --  ITEMS'
     A                                  1 75'PU2-4'
     A                                  3  1'PO'
     A                                  4  3'ITEM#'
     A                                  4 18'REQUISITION'
     A                                  4 46'CODE'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  6  7'UNIT PRICE   UM      QUANTITY    U-
     A                                      M'
     A                                  6 44'CO   PRM  CLS   DEPT      NW/A.D.'
     A                                  9 29'TAX CODE'
     A                                  9 42'SECONDARY LANGUAGE'
     A                                 10  3'MASTER STOCK'
     A                                 10 24'(FOR RAW MATERIALS)'
     A                                 10 48'QS9000 TRACKING("X")'
     A                                 11  3'STANDARD INSTRUCTIONS'
     A                                 11 48'MANUFACTURER SELECTION'
     A                                 12  3'RECEIVING INSTRUCTIONS'
     A                                 13  3'DESCRIPTION/COMMENTS  (FOR LOCAL D-
     A                                      ESC. ENTER AN "@" AS THE FIRST CHAR-
     A                                      ACTER)'
     A                                 21 21'IF ADDITIONAL DESCRIPTION IS NEEDE-
     A                                      D KEY "X"'
     A                                 22  1'PRESS "f3" TO RETURN TO SELECTION'
     A                                 22 35'SCREEN'
     A            EDILIT4B       6A  B  2 29DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B  3  4DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  3 12DSPATR(PR)
     A                                      OVRDTA
     A            TOPMSG        60A  B  3 19DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4Y 0B  4  9DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            REQNUM        12A  B  4 30DSPATR(PR)
     A                                      OVRDTA
     A            CORPCDE        7A  B  4 51DSPATR(PR)
     A                                      OVRDTA
     A            PRCWHL        15Y 4B  7  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A                                      CHECK(RZ)
     A            UP             2A  B  7 20DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            QTYWHL        12Y 4B  7 25EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            UQ             2A  B  7 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            COMPANY        3A  B  7 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            PRIME          3A  B  7 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            CLASS          3A  B  7 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            SUBD           4A  B  7 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            ADDLDT         6Y 0B  7 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CURRENCYLI    26A  B  8  2DSPATR(PR)
     A                                      OVRDTA
     A            UNITVALLIT    11A  B  9  3DSPATR(PR)
     A                                      OVRDTA
     A            VALUE         11Y 0B  9 15DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            TX             2A  B  9 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            L              1A  B  9 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            INVSLIT       14A  B  9 64DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            MASTSTK        7A  B 10 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            TRACKING       1   B 10 69DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            S1             3A  B 11 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            S2             3A  B 11 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            S3             3A  B 11 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            S4             3A  B 11 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            RCV1           3A  B 12 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A            RCV2           3A  B 12 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            RCV3           3A  B 12 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A            RCV4           3A  B 12 41DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            MANUFACTSE    26A  B 12 48DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLIN    79A  B 14  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            COMMENTLI2    79A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            COMMENTLI3    79A  B 16  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            COMMENTLI4    79A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            COMMENTLI5    79A  B 18  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            COMMENTLI6    79A  B 19  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            COMMENTLI7    79A  B 20  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            C              1A  B 21 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            ADDLINST      34A  B 23  7DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f2-DESC./ MANUF. f8-SECOND -
     A                                      LANGUAGE f7-CHANGE ITEM f3-END FUNC-
     A                                      TION             ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A*  91/04/30  16:16:40    T881S26     REL-R03M00  5728-PW1
     A          R POMOD4BNC
     A*%%TS  SD  19961118  100107  A193138     REL-V3R6M0  5716-PW1
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      PUTOVR
     A                                  1 18'PURCHASE ORDER MODIFY --  ITEMS'
     A                                  1 75'PU2-4'
     A                                  3  1'PO'
     A                                  4  3'ITEM#'
     A                                  4 18'REQUISITION'
     A                                  4 46'CODE'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  6  7'UNIT PRICE   UM'
     A                                  6 24'CHAT#'
     A                                  6 36'QUANTITY    UM  DEPT  CLASS  EXPEN-
     A                                      SE/NW'
     A                                  9 29'TAX CODE'
     A                                  9 42'SECONDARY LANGUAGE'
     A                                 10  3'MASTER STOCK'
     A                                 10 24'(FOR RAW MATERIALS)'
     A                                 10 48'QS9000 TRACKING("X")'
     A                                 11  3'STANDARD INSTRUCTIONS'
     A                                 11 48'MANUFACTURER SELECTION'
     A                                 12  3'RECEIVING INSTRUCTIONS'
     A                                 13  3'DESCRIPTION/COMMENTS  (FOR LOCAL D-
     A                                      ESC. ENTER AN "@" AS THE FIRST CHAR-
     A                                      ACTER)'
     A                                 21 21'IF ADDITIONAL DESCRIPTION IS NEEDE-
     A                                      D KEY "X"'
     A                                 22  1'PRESS "f3" TO RETURN TO SELECTION'
     A                                 22 35'SCREEN'
     A            EDILIT4B       6A  B  2 29DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B  3  4DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  3 12DSPATR(PR)
     A                                      OVRDTA
     A            TOPMSG        60A  B  3 19DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4Y 0B  4  9DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            REQNUM        12A  B  4 30DSPATR(PR)
     A                                      OVRDTA
     A            CORPCDE        7A  B  4 51DSPATR(PR)
     A                                      OVRDTA
     A            PRCWHL        15Y 4B  7  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A                                      CHECK(RZ)
     A            UP             2A  B  7 20DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            CHATCODE       6A  B  7 24DSPATR(PR)
     A                                      OVRDTA
     A            QTYWHL        12Y 4B  7 33EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            UQ             2A  B  7 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            SUBD           4A  B  7 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            CLASS          3A  B  7 58DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            ADDLDT         6Y 0B  7 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CURRENCYLI    26A  B  8  2DSPATR(PR)
     A                                      OVRDTA
     A            UNITVALLIT    11A  B  9  3DSPATR(PR)
     A                                      OVRDTA
     A            VALUE         11Y 0B  9 15DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            TX             2A  B  9 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            L              1A  B  9 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            INVSLIT       14A  B  9 64DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            MASTSTK        7A  B 10 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            TRACKING       1   B 10 69DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            S1             3A  B 11 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            S2             3A  B 11 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            S3             3A  B 11 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            S4             3A  B 11 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            RCV1           3A  B 12 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A            RCV2           3A  B 12 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            RCV3           3A  B 12 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A            RCV4           3A  B 12 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            MANUFACTSE    26A  B 12 48DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLIN    79A  B 14  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            COMMENTLI2    79A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            COMMENTLI3    79A  B 16  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            COMMENTLI4    79A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            COMMENTLI5    79A  B 18  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            COMMENTLI6    79A  B 19  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            COMMENTLI7    79A  B 20  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            C              1A  B 21 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            ADDLINST      34A  B 23  7DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f2-DESC./ MANUF. f8-SECOND -
     A                                      LANGUAGE f7-CHANGE ITEM f3-END FUNC-
     A                                      TION             ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R POMOD4C
     A*%%TS  SD  19961118  100107  A193138     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 18'PURCHASE ORDER MODIFY --  ITEMS'
     A                                  1 75'PU2-4'
     A                                  3  1'PO'
     A                                  4  3'ITEM#'
     A                                  4 18'REQUISITION'
     A                                  4 46'CODE'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  6  7'UNIT PRICE   UM'
     A                                  6 24'CHAT#'
     A                                  6 36'QUANTITY    UM  DEPT  CLASS  EXPEN-
     A                                      SE/NW'
     A                                  9 29'TAX CODE'
     A                                  9 42'SECONDARY LANGUAGE'
     A                                 10  3'MASTER STOCK'
     A                                 10 24'(FOR RAW MATERIALS)'
     A                                 10 48'QS9000 TRACKING("X")'
     A                                 11  3'STANDARD INSTRUCTIONS'
     A                                 11 48'MANUFACTURER SELECTION'
     A                                 12  3'RECEIVING INSTRUCTIONS'
     A                                 13  3'DESCRIPTION/COMMENTS  (FOR LOCAL D-
     A                                      ESC. ENTER AN "@" AS THE FIRST CHAR-
     A                                      ACTER)'
     A                                 21 21'IF ADDITIONAL DESCRIPTION IS NEEDE-
     A                                      D KEY "X"'
     A                                 22  1'PRESS "f3" TO RETURN TO SELECTION'
     A                                 22 35'SCREEN'
     A            EDILIT4C       6A  B  2 29DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B  3  4DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  3 12DSPATR(PR)
     A                                      OVRDTA
     A            TOPMSG        60A  B  3 19DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4Y 0B  4  9DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            REQNUM        12A  B  4 30DSPATR(PR)
     A                                      OVRDTA
     A            CORPCDE        7A  B  4 51DSPATR(PR)
     A                                      OVRDTA
     A            PRCWHL        15Y 4B  7  2EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            UP             2A  B  7 20DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            CHATCODE       6A  B  7 24DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            QTYWHL        12Y 4B  7 33EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            UQ             2A  B  7 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            SUBD           4A  B  7 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            CLASS          3A  B  7 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            ADDLDT         6Y 0B  7 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CURRENCYLI    26A  B  8  2DSPATR(PR)
     A                                      OVRDTA
     A            UNITVALLIT    11A  B  9  3DSPATR(PR)
     A                                      OVRDTA
     A            VALUE         11Y 0B  9 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            TX             2A  B  9 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            L              1A  B  9 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            INVLSLIT      14A  B  9 64DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            MASTSTK        7A  B 10 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            TRACKING       1   B 10 69DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            S1             3A  B 11 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            S2             3A  B 11 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            S3             3A  B 11 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            S4             3A  B 11 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            RCV1           3A  B 12 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A            RCV2           3A  B 12 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            RCV3           3A  B 12 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A            RCV4           3A  B 12 41DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            MANUFACTSE    26A  B 12 48DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLIN    79A  B 14  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            COMMENTLI2    79A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            COMMENTLI3    79A  B 16  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            COMMENTLI4    79A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            COMMENTLI5    79A  B 18  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            COMMENTLI6    79A  B 19  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            COMMENTLI7    79A  B 20  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            C              1A  B 21 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            ADDLINST      34A  B 23  7DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f2-DESC./ MANUF. f8-SECOND -
     A                                      LANGUAGE f7-CHANGE ITEM f3-END FUNC-
     A                                      TION             ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R POMOD4CL
     A*%%TS  SD  19961118  100107  A193138     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 18'PURCHASE ORDER MODIFY --  ITEMS'
     A                                  1 75'PU2-4'
     A                                  3  1'PO'
     A                                  4  3'ITEM#'
     A                                  4 18'REQUISITION'
     A                                  4 46'CODE'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  6  7'UNIT PRICE   UM      QUANTITY    U-
     A                                      M'
     A                                  6 44'CO   PRM  CLS   DEPT      NW/A.D.'
     A                                  9 29'TAX CODE'
     A                                  9 42'SECONDARY LANGUAGE'
     A                                 10  3'MASTER STOCK'
     A                                 10 24'(FOR RAW MATERIALS)'
     A                                 10 48'QS9000 TRACKING("X")'
     A                                 11  3'STANDARD INSTRUCTIONS'
     A                                 11 48'MANUFACTURER SELECTION'
     A                                 12  3'RECEIVING INSTRUCTIONS'
     A                                 13  3'DESCRIPTION/COMMENTS  (FOR LOCAL D-
     A                                      ESC. ENTER AN "@" AS THE FIRST CHAR-
     A                                      ACTER)'
     A                                 21 21'IF ADDITIONAL DESCRIPTION IS NEEDE-
     A                                      D KEY "X"'
     A                                 22  1'PRESS "f3" TO RETURN TO SELECTION'
     A                                 22 35'SCREEN'
     A            EDILIT4C       6A  B  2 29DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B  3  4DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  3 12DSPATR(PR)
     A                                      OVRDTA
     A            TOPMSG        60A  B  3 19DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4Y 0B  4  9DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            REQNUM        12A  B  4 30DSPATR(PR)
     A                                      OVRDTA
     A            CORPCDE        7A  B  4 51DSPATR(PR)
     A                                      OVRDTA
     A            PRCWHL        15Y 4B  7  2EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            UP             2A  B  7 20DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            QTYWHL        12Y 4B  7 25EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            UQ             2A  B  7 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            COMPANY        3A  B  7 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            PRIME          3A  B  7 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            CLASS          3A  B  7 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            SUBD           4A  B  7 54DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            ADDLDT         6Y 0B  7 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CURRENCYLI    26A  B  8  2DSPATR(PR)
     A                                      OVRDTA
     A            UNITVALLIT    11A  B  9  3DSPATR(PR)
     A                                      OVRDTA
     A            VALUE         11Y 0B  9 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            TX             2A  B  9 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            L              1A  B  9 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            INVLSLIT      14A  B  9 64DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            MASTSTK        7A  B 10 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            TRACKING       1   B 10 69DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            S1             3A  B 11 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            S2             3A  B 11 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            S3             3A  B 11 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            S4             3A  B 11 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            RCV1           3A  B 12 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A            RCV2           3A  B 12 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            RCV3           3A  B 12 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A            RCV4           3A  B 12 41DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            MANUFACTSE    26A  B 12 48DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLIN    79A  B 14  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            COMMENTLI2    79A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            COMMENTLI3    79A  B 16  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            COMMENTLI4    79A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            COMMENTLI5    79A  B 18  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            COMMENTLI6    79A  B 19  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            COMMENTLI7    79A  B 20  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            C              1A  B 21 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            ADDLINST      34A  B 23  7DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f2-DESC./ MANUF. f8-SECOND -
     A                                      LANGUAGE f7-CHANGE ITEM f3-END FUNC-
     A                                      TION             ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R POMOD4CNC
     A*%%TS  SD  19961118  100107  A193138     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 18'PURCHASE ORDER MODIFY --  ITEMS'
     A                                  1 75'PU2-4'
     A                                  3  1'PO'
     A                                  4  3'ITEM#'
     A                                  4 18'REQUISITION'
     A                                  4 46'CODE'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  6  7'UNIT PRICE   UM'
     A                                  6 24'CHAT#'
     A                                  6 36'QUANTITY    UM  DEPT  CLASS  EXPEN-
     A                                      SE/NW'
     A                                  9 29'TAX CODE'
     A                                  9 42'SECONDARY LANGUAGE'
     A                                 10  3'MASTER STOCK'
     A                                 10 24'(FOR RAW MATERIALS)'
     A                                 10 48'QS9000 TRACKING("X")'
     A                                 11  3'STANDARD INSTRUCTIONS'
     A                                 11 48'MANUFACTURER SELECTION'
     A                                 12  3'RECEIVING INSTRUCTIONS'
     A                                 13  3'DESCRIPTION/COMMENTS  (FOR LOCAL D-
     A                                      ESC. ENTER AN "@" AS THE FIRST CHAR-
     A                                      ACTER)'
     A                                 21 21'IF ADDITIONAL DESCRIPTION IS NEEDE-
     A                                      D KEY "X"'
     A                                 22  1'PRESS "f3" TO RETURN TO SELECTION'
     A                                 22 35'SCREEN'
     A            EDILIT4C       6A  B  2 29DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B  3  4DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  3 12DSPATR(PR)
     A                                      OVRDTA
     A            TOPMSG        60A  B  3 19DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4Y 0B  4  9DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            REQNUM        12A  B  4 30DSPATR(PR)
     A                                      OVRDTA
     A            CORPCDE        7A  B  4 51DSPATR(PR)
     A                                      OVRDTA
     A            PRCWHL        15Y 4B  7  2EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            UP             2A  B  7 20DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            CHATCODE       6A  B  7 24DSPATR(PR)
     A                                      OVRDTA
     A            QTYWHL        12Y 4B  7 33EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            UQ             2A  B  7 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            SUBD           4A  B  7 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            CLASS          3A  B  7 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            ADDLDT         6Y 0B  7 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CURRENCYLI    26A  B  8  2DSPATR(PR)
     A                                      OVRDTA
     A            UNITVALLIT    11A  B  9  3DSPATR(PR)
     A                                      OVRDTA
     A            VALUE         11Y 0B  9 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            TX             2A  B  9 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            L              1A  B  9 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            INVLSLIT      14A  B  9 64DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            MASTSTK        7A  B 10 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            TRACKING       1   B 10 69DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            S1             3A  B 11 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            S2             3A  B 11 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            S3             3A  B 11 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            S4             3A  B 11 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            RCV1           3A  B 12 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A            RCV2           3A  B 12 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            RCV3           3A  B 12 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A            RCV4           3A  B 12 41DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            MANUFACTSE    26A  B 12 48DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLIN    79A  B 14  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            COMMENTLI2    79A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            COMMENTLI3    79A  B 16  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            COMMENTLI4    79A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            COMMENTLI5    79A  B 18  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            COMMENTLI6    79A  B 19  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            COMMENTLI7    79A  B 20  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            C              1A  B 21 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            ADDLINST      34A  B 23  7DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f2-DESC./ MANUF. f8-SECOND -
     A                                      LANGUAGE f7-CHANGE ITEM f3-END FUNC-
     A                                      TION             ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R POMOD4D
     A*%%TS  SD  19961118  100107  A193138     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 18'PURCHASE ORDER MODIFY --  ITEMS'
     A                                  1 75'PU2-4'
     A                                  3  1'PO'
     A                                  4  3'ITEM#'
     A                                  4 18'REQUISITION'
     A                                  4 46'CODE'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  6  7'UNIT PRICE   UM'
     A                                  6 24'CHAT#'
     A                                  6 36'QUANTITY    UM  DEPT  CLASS  EXPEN-
     A                                      SE/NW'
     A                                  9 29'TAX CODE'
     A                                  9 42'SECONDARY LANGUAGE'
     A                                 10  3'MASTER STOCK'
     A                                 10 24'(FOR RAW MATERIALS)'
     A                                 10 48'QS9000 TRACKING("X")'
     A                                 11  3'STANDARD INSTRUCTIONS'
     A                                 11 48'MANUFACTURER SELECTION'
     A                                 12  3'RECEIVING INSTRUCTIONS'
     A                                 13  3'DESCRIPTION/COMMENTS  (FOR LOCAL D-
     A                                      ESC. ENTER AN "@" AS THE FIRST CHAR-
     A                                      ACTER)'
     A                                 21 21'IF ADDITIONAL DESCRIPTION IS NEEDE-
     A                                      D KEY "X"'
     A                                 22  1'PRESS "f3" TO RETURN TO SELECTION'
     A                                 22 35'SCREEN'
     A            EDILIT4D       6A  B  2 29DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B  3  4DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  3 12DSPATR(PR)
     A                                      OVRDTA
     A            TOPMSG        60A  B  3 19DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4Y 0B  4  9DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            REQNUM        12A  B  4 30DSPATR(PR)
     A                                      OVRDTA
     A            CORPCDE        7A  B  4 51DSPATR(PR)
     A                                      OVRDTA
     A            PRCWHL        15Y 4B  7  2EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            UP             2A  B  7 20DSPATR(PR)
     A                                      OVRDTA
     A            CHATCODE       6A  B  7 24DSPATR(PR)
     A                                      OVRDTA
     A            QTYWHL        12Y 4B  7 33EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            UQ             2A  B  7 48DSPATR(PR)
     A                                      OVRDTA
     A            SUBD           4A  B  7 52DSPATR(PR)
     A                                      OVRDTA
     A            CLASS          3A  B  7 59DSPATR(PR)
     A                                      OVRDTA
     A            ADDLDT         6A  B  7 68DSPATR(PR)
     A                                      OVRDTA
     A            CURRENCYLI    26A  B  8  2DSPATR(PR)
     A                                      OVRDTA
     A            UNITVALLIT    11A  B  9  3DSPATR(PR)
     A                                      OVRDTA
     A            VALUE         11Y 0B  9 15DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            TX             2A  B  9 38DSPATR(PR)
     A                                      OVRDTA
     A            L              1A  B  9 61DSPATR(PR)
     A                                      OVRDTA
     A            INVLSLIT      14A  B  9 64DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            MASTSTK        7A  B 10 16DSPATR(PR)
     A                                      OVRDTA
     A            TRACKING       1   B 10 69DSPATR(PR)
     A                                      OVRDTA
     A            S1             3A  B 11 25DSPATR(PR)
     A                                      OVRDTA
     A            S2             3A  B 11 30DSPATR(PR)
     A                                      OVRDTA
     A            S3             3A  B 11 35DSPATR(PR)
     A                                      OVRDTA
     A            S4             3A  B 11 40DSPATR(PR)
     A                                      OVRDTA
     A            RCV1           3A  B 12 26DSPATR(PR)
     A                                      OVRDTA
     A            RCV2           3A  B 12 31DSPATR(PR)
     A                                      OVRDTA
     A            RCV3           3A  B 12 36DSPATR(PR)
     A                                      OVRDTA
     A            RCV4           3A  B 12 41DSPATR(PR)
     A                                      OVRDTA
     A            MANUFACTSE    26A  B 12 48DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLIN    79A  B 14  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            COMMENTLI2    79A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            COMMENTLI3    79A  B 16  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            COMMENTLI4    79A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            COMMENTLI5    79A  B 18  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            COMMENTLI6    79A  B 19  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            COMMENTLI7    79A  B 20  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            C              1A  B 21 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            ADDLINST      34A  B 23  7DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-END FUNCTION            -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R POMOD5
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 18'PURCHASE ORDER MODIFY -- DELETE IT-
     A                                      EMS'
     A                                  1 76'PU2-5'
     A                                  4  1'PO'
     A                                  6  1'ITEM#'
     A                                  6 17'REQUISITION'
     A                                  6 44'CODE'
     A                                  7  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  8  7'UNIT PRICE     UM'
     A                                  8 31'QUANTITY    UM   DEPT  CLASS   EXP-
     A                                      ENSE/NW'
     A                                 11 61'TAX CODE'
     A                                 12  3'DESCRIPTION/COMMENTS'
     A                                 21  1'PRESS "f3" TO RETURN TO SELECTION'
     A                                 21 35'SCREEN'
     A            EDILIT         6A  B  2 29DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B  4  4DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  4 12DSPATR(PR)
     A                                      OVRDTA
     A            TOPMSG        60A  B  4 19DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4Y 0B  6  7DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            REQNUM        12A  B  6 29DSPATR(PR)
     A                                      OVRDTA
     A            CORPCDE        7A  B  6 49DSPATR(PR)
     A                                      OVRDTA
     A            PRCWHL        15Y04B  9  4EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            UP             2A  B  9 22DSPATR(PR)
     A                                      OVRDTA
     A            QTYWHL        12Y04B  9 28EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            UQ             2A  B  9 43DSPATR(PR)
     A                                      OVRDTA
     A            SUBD           4A  B  9 48DSPATR(PR)
     A                                      OVRDTA
     A            CLASS          3A  B  9 55DSPATR(PR)
     A                                      OVRDTA
     A            ADDLDT         6A  B  9 64DSPATR(PR)
     A                                      OVRDTA
     A            TX             2A  B 11 70DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLIN    79A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLI2    79A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLI3    79A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLI4    79A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLI5    79A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLI6    79A  B 18  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLI7    79A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            ADDLINST      34A  B 22  7DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-END FUNCTION            -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R POMOD5B
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 18'PURCHASE ORDER MODIFY -- DELETE IT-
     A                                      EMS'
     A                                  1 76'PU2-5'
     A                                  4  1'PO'
     A                                  6  1'ITEM#'
     A                                  6 17'REQUISITION'
     A                                  6 44'CODE'
     A                                  7  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  8  7'UNIT PRICE     UM'
     A                                  8 31'QUANTITY    UM   DEPT  CLASS   EXP-
     A                                      ENSE/NW'
     A                                 11 61'TAX CODE'
     A                                 12  3'DESCRIPTION/COMMENTS'
     A                                 21  1'PRESS "f3" TO RETURN TO SELECTION'
     A                                 21 35'SCREEN'
     A            EDILIT         6A  B  2 29DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B  4  4DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  4 12DSPATR(PR)
     A                                      OVRDTA
     A            TOPMSG        60A  B  4 19DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4Y 0B  6  7DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            REQNUM        12A  B  6 29DSPATR(PR)
     A                                      OVRDTA
     A            CORPCDE        7A  B  6 49DSPATR(PR)
     A                                      OVRDTA
     A            PRCWHL        15Y04B  9  4EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            UP             2A  B  9 22DSPATR(PR)
     A                                      OVRDTA
     A            QTYWHL        12Y04B  9 28EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            UQ             2A  B  9 43DSPATR(PR)
     A                                      OVRDTA
     A            SUBD           4A  B  9 48DSPATR(PR)
     A                                      OVRDTA
     A            CLASS          3A  B  9 55DSPATR(PR)
     A                                      OVRDTA
     A            ADDLDT         6A  B  9 64DSPATR(PR)
     A                                      OVRDTA
     A            TX             2A  B 11 70DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLIN    79A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLI2    79A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLI3    79A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLI4    79A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLI5    79A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLI6    79A  B 18  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLI7    79A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            ADDLINST      34A  B 22  7DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f7-CHANGE ITEM f3-END FUNCT-
     A                                      ION                                -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R POREPRT1
     A*%%TS  SD  19960617  124928  A193138     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 16'P U R C H A S E   O R D E R   R E'
     A                                  1 50'P R I N T'
     A                                  1 76'PU3-1'
     A                                  3  1'PURCHASE ORDER NUMBER'
     A                                  3 42'REL'
     A                                  5  1'MODIFIED ORDER HEADER'
     A                                  7  1'CANCELLED ORDER HEADER'
     A                                  9  1'BATCH REPRINT OPTION'
     A                                 11  1'NO SPECIAL CHARACTER PRINT'
     A                                 13  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 14  2'YOU MAY SELECT INDIVIDUAL ITEMS OF'
     A                                 14 37'THE P.O. OR LEAVE BLANK FOR ALL IT-
     A                                      EMS.'
     A                                 15  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 16  1'1.'
     A                                 16 12'2.'
     A                                 16 22'3.'
     A                                 16 32'4.'
     A                                 16 42'5.'
     A                                 16 52'6.'
     A                                 16 62'7.'
     A                                 16 72'8.'
     A                                 18  1'9.'
     A                                 18 11'10.'
     A                                 18 21'11.'
     A                                 18 31'12.'
     A                                 18 41'13.'
     A                                 18 51'14.'
     A                                 18 61'15.'
     A                                 20  1'1) ENTER PURCHASE ORDER NUMBER'
     A                                 21  1'2) ENTER "X" IN MODIFIED OR CANCEL-
     A                                      LED HEADER BOX IF DESIRED'
     A                                 22  1'3) DEPRESS "ENTER" TO PROCESS OR "-
     A                                      f3" TO END PROGRAM'
     A            PONUM          7A  B  3 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            RLS            3Y 0B  3 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            M              1A  B  5 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            H              1A  B  7 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            B              1A  B  9 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            NOESCAPE       1   B 11 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            ITM1           4Y 0B 16  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            ITM2           4Y 0B 16 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            ITM3           4Y 0B 16 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            ITM4           4Y 0B 16 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            ITM5           4Y 0B 16 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            ITM6           4Y 0B 16 55DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            ITM7           4Y 0B 16 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            ITM8           4Y 0B 16 75DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            ITM9           4Y 0B 18  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            IT10           4Y 0B 18 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            IT11           4Y 0B 18 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            IT12           4Y 0B 18 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            IT13           4Y 0B 18 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            IT14           4Y 0B 18 55DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            IT15           4Y 0B 18 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-END PROGRAM')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A*  89/01/20  15:24:54    T881S26     REL-R01M02  5728-PW1
     A          R PURORD1
     A*%%TS  SD  19950517  083204  A229282     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 19'P U R C H A S E   O R D E R   E N'
     A                                  1 53'T R Y'
     A                                  1 76'PU1-1'
     A                                  3  6'PO#'
     A                                  3 20'BUDGET NUMBER'
     A                                  3 48'VENDOR CODE'
     A                                  4 48'CURRENCY CODE '
     A                                  5  6'RELEASE (FOR NON-CODED ONLY)'
     A                                  6  6'NON-RECEIVABLE PO (FOR NON-CODED O-
     A                                      NLY)    EXPIRATION DATE'
     A                                  7  6'REQUIREMENT ORDER'
     A                                  8  6'INTERNAL ORDER (PRINTS ON BLANK FO-
     A                                      RM)'
     A                                  9  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                 10  3'OPTIONAL'
     A                                 12  7'ENTER TEMPORARY VENDOR OR ORDER FR-
     A                                      OM VENDOR INFORMATION IF NEEDED.'
     A                                 13  7'IF VENDOR CODE IS LEFT BLANK A TEM-
     A                                      PORARY VENDOR CODE WILL BE ASSIGNED-
     A                                      .'
     A                                 15  8'VENDOR NAME'
     A                                 16 12'ADDRESS'
     A                                 17 57'ENTER "X" TO PRINT'
     A                                 18 57'ZIP/POSTAL CODE'
     A                                 19 57'BEFORE CITY'
     A                                 21  5'CITY'
     A                                 21 31'STATE  ZIP/POSTAL  PROVINCE  COUNT-
     A                                      RY'
     A            CCC            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B  3 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            BUDGETNO      12A  B  3 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A            VENCODE        7A  B  3 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A            VEN            3A  B  3 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            CC             2A  B  4 63DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A            R              1A  B  5  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            N              1A  B  6  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            EXPDAT         6A  B  6 64DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A            B              1A  B  7  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            I              1A  B  8  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            VENDORNAME    34A  B 15 20DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            VENDADDR1     34A  B 16 20DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            VENDADDR2     34A  B 17 20DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            VENDADDR3     34A  B 18 20DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            VENDADDR4     34A  B 19 20DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            Z              1A  B 19 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            VENDADDR5     34A  B 20 20DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            CITY          24A  B 22  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            ST             2A  B 22 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            ZIP            9A  B 22 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            PROV           4A  B 22 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            COUNTRY       18A  B 22 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-PO MODIFY f2-PO REPRINT -
     A                                      f5-PO INQ f4-PO DELETE f6-VENDOR HE-
     A                                      LP f7-CURR. HELP')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A*  89/01/23  14:37:25    T881S26     REL-R01M02  5728-PW1
     A          R PURORD2
     A*%%TS  SD  19961118  100107  A193138     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 19'PURCHASE ORDER ENTRY -- ITEMS'
     A                                  1 76'PU1-2'
     A                                  2 60'("NC" FOR NON-CODED)'
     A                                  3  1'PO'
     A                                  3 17'ITEM NO.'
     A                                  3 32'REQUISITION'
     A                                  3 58'OR  CODE'
     A                                  4  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  5  8'UNIT PRICE   UM   CODE'
     A                                  5 34'CHAT#'
     A                                  5 46'QUANTITY   UM  DEPT  CLASS  EXP/NW'
     A                                  8 29'TAX CODE'
     A                                  8 42'SECONDARY LANGUAGE'
     A                                  9  4'MASTER STOCK'
     A                                  9 25'(FOR RAW MATERIALS)'
     A                                  9 49'QS9000 TRACKING("X")'
     A                                 10  4'STANDARD INSTRUCTIONS'
     A                                 11  4'RECEIVING INSTRUCTIONS'
     A                                 21  3'FOR LOCAL DESCRIPTION/COMMENTS ENT-
     A                                      ER AN "@" AS THE FIRST CHARACTER OF-
     A                                       THE LINE'
     A            CCC            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            EDIPOLIT       6A  B  2 30DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B  3  4DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  3 12DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4Y 0B  3 26DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            REQNO         12A  B  3 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            CORPCOD        7A  B  3 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            PRICE11       15Y 4B  6  4EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            UNITPRICE      2A  B  6 21DSPATR(PR)
     A                                      OVRDTA
     A            STRCODE        7A  B  6 25DSPATR(PR)
     A                                      OVRDTA
     A            CHATCODE       6A  B  6 34DSPATR(PR)
     A                                      OVRDTA
     A            QTY18         12Y 4B  6 43EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            QTYUM          2A  B  6 57DSPATR(PR)
     A                                      OVRDTA
     A            SUBD           4A  B  6 61DSPATR(PR)
     A                                      OVRDTA
     A            CLASS          3A  B  6 68DSPATR(PR)
     A                                      OVRDTA
     A            ADDLDATA       6A  B  6 74DSPATR(PR)
     A                                      OVRDTA
     A            CURRENCYLI    26A  B  7  4DSPATR(PR)
     A                                      OVRDTA
     A            DISCOUNTLI    48A  B  7 31DSPATR(PR)
     A                                      OVRDTA
     A            UNITVALLIT    11A  B  8  4DSPATR(PR)
     A                                      OVRDTA
     A            VALUE         11Y 0B  8 16DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            TX             2A  B  8 38DSPATR(PR)
     A                                      OVRDTA
     A            L              1A  B  8 61DSPATR(PR)
     A                                      OVRDTA
     A            INVLSLIT      14A  B  8 64DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            INVLSPO        1A  B  8 79DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            MASTSTK        7A  B  9 17DSPATR(PR)
     A                                      OVRDTA
     A            TRACKING       1   B  9 70DSPATR(PR)
     A                                      OVRDTA
     A            MANUFACTLI    26A  B 10 49DSPATR(PR)
     A                                      OVRDTA
     A            S1             3A  B 10 27DSPATR(PR)
     A                                      OVRDTA
     A            S2             3A  B 10 32DSPATR(PR)
     A                                      OVRDTA
     A            S3             3A  B 10 37DSPATR(PR)
     A                                      OVRDTA
     A            S4             3A  B 10 42DSPATR(PR)
     A                                      OVRDTA
     A            RCV1           3A  B 11 27DSPATR(PR)
     A                                      OVRDTA
     A            RCV2           3A  B 11 32DSPATR(PR)
     A                                      OVRDTA
     A            RCV3           3A  B 11 37DSPATR(PR)
     A                                      OVRDTA
     A            RCV4           3A  B 11 42DSPATR(PR)
     A                                      OVRDTA
     A            MANUFACTSE    26A  B 11 49DSPATR(PR)
     A                                      OVRDTA
     A            DESCLIT       22A  B 12  2DSPATR(PR)
     A                                      OVRDTA
     A            MOREDESCMS    55A  B 12 25DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLIN    79A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLI2    79A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLI3    79A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLI4    79A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLI5    79A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLI6    79A  B 18  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLI7    79A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            ADDLDESCMS    60A  B 20  3DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTCON     1A  B 20 65DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTIO    60A  B 22  6DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A                                      DSPATR(PR)
     A  99        MESSAGELN1    79   M      OVRDTA
     A*  91/04/19  08:03:33    T881S26     REL-R03M00  5728-PW1
     A          R PURORD2A
     A*%%TS  SD  19961118  100107  A193138     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 19'PURCHASE ORDER ENTRY -- ITEMS'
     A                                  1 76'PU1-2'
     A                                  2 60'("NC" FOR NON-CODED)'
     A                                  3  1'PO'
     A                                  3 17'ITEM NO.'
     A                                  3 32'REQUISITION'
     A                                  3 58'OR  CODE'
     A                                  4  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  5  8'UNIT PRICE   UM   CODE'
     A                                  5 34'CHAT#'
     A                                  5 46'QUANTITY   UM  DEPT  CLASS  EXP/NW'
     A                                  8 29'TAX CODE'
     A                                  8 42'SECONDARY LANGUAGE'
     A                                  9  4'MASTER STOCK'
     A                                  9 25'(FOR RAW MATERIALS)'
     A                                  9 49'QS9000 TRACKING("X")'
     A                                 10  4'STANDARD INSTRUCTIONS'
     A                                 11  4'RECEIVING INSTRUCTIONS'
     A                                 21  3'FOR LOCAL DESCRIPTION/COMMENTS ENT-
     A                                      ER AN "@" AS THE FIRST CHARACTER OF-
     A                                       THE LINE'
     A            CCC            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            EDIPOLIT       6A  B  2 30DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B  3  4DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  3 12DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4Y 0B  3 26DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            REQNO         12A  B  3 44DSPATR(PR)
     A                                      OVRDTA
     A            CORPCOD        7A  B  3 67DSPATR(PR)
     A                                      OVRDTA
     A            PRICE11       15Y 4B  6  4EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            UNITPRICE      2A  B  6 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            STRCODE        7A  B  6 25DSPATR(PR)
     A                                      OVRDTA
     A            CHATCODE       6A  B  6 34DSPATR(PR)
     A                                      OVRDTA
     A            QTY18         12Y 4B  6 43EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            QTYUM          2A  B  6 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            SUBD           4A  B  6 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            CLASS          3A  B  6 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            ADDLDATA       6Y 0B  6 74DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CURRENCYLI    26A  B  7  4DSPATR(PR)
     A                                      OVRDTA
     A            DISCOUNTLI    48A  B  7 31DSPATR(PR)
     A                                      OVRDTA
     A            UNITVALLIT    11A  B  8  4DSPATR(PR)
     A                                      OVRDTA
     A            VALUE         11Y 0B  8 16DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            TX             2A  B  8 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            L              1A  B  8 61DSPATR(PR)
     A                                      OVRDTA
     A            INVLSLIT      14A  B  8 64DSPATR(PR)
     A                                      OVRDTA
     A            INVLSPO        1A  B  8 79DSPATR(PR)
     A                                      OVRDTA
     A            MASTSTK        7A  B  9 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A            TRACKING       1   B  9 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            MANUFACTLI    26A  B 10 49DSPATR(PR)
     A                                      OVRDTA
     A            S1             3A  B 10 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            S2             3A  B 10 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            S3             3A  B 10 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            S4             3A  B 10 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            RCV1           3A  B 11 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A            RCV2           3A  B 11 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            RCV3           3A  B 11 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A            RCV4           3A  B 11 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            MANUFACTSE    26A  B 11 49DSPATR(PR)
     A                                      OVRDTA
     A            DESCLIT       22A  B 12  2DSPATR(PR)
     A                                      OVRDTA
     A            MOREDESCMS    55A  B 12 25DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLIN    79A  B 13  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            COMMENTLI2    79A  B 14  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            COMMENTLI3    79A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            COMMENTLI4    79A  B 16  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            COMMENTLI5    79A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            COMMENTLI6    79A  B 18  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            COMMENTLI7    79A  B 19  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            ADDLDESCMS    60A  B 20  3DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTCON     1A  B 20 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            INSTRUCTIO    60A  B 22  6DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-CHANGE REQ/CODE f2-DESC.-
     A                                      / MANUF. f8-SECOND LANGUAGE f4-KEY -
     A                                      DESC.')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R PURORD2AC
     A*%%TS  SD  19961118  100107  A193138     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 19'PURCHASE ORDER ENTRY -- ITEMS'
     A                                  1 76'PU1-2'
     A                                  2 60'("NC" FOR NON-CODED)'
     A                                  3  1'PO'
     A                                  3 17'ITEM NO.'
     A                                  3 32'REQUISITION'
     A                                  3 58'OR  CODE'
     A                                  4  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  5  8'UNIT PRICE   UM   CODE'
     A                                  5 34'CHAT#'
     A                                  5 46'QUANTITY   UM  DEPT  CLASS  EXP/NW'
     A                                  8 29'TAX CODE'
     A                                  8 42'SECONDARY LANGUAGE'
     A                                  9  4'MASTER STOCK'
     A                                  9 25'(FOR RAW MATERIALS)'
     A                                  9 49'QS9000 TRACKING("X")'
     A                                 10  4'STANDARD INSTRUCTIONS'
     A                                 11  4'RECEIVING INSTRUCTIONS'
     A                                 21  3'FOR LOCAL DESCRIPTION/COMMENTS ENT-
     A                                      ER AN "@" AS THE FIRST CHARACTER OF-
     A                                       THE LINE'
     A            CCC            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            EDIPOLIT       6A  B  2 30DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B  3  4DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  3 12DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4Y 0B  3 26DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            REQNO         12A  B  3 44DSPATR(PR)
     A                                      OVRDTA
     A            CORPCOD        7A  B  3 67DSPATR(PR)
     A                                      OVRDTA
     A            PRICE11       15Y 4B  6  4EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            UNITPRICE      2A  B  6 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            STRCODE        7A  B  6 25DSPATR(PR)
     A                                      OVRDTA
     A            CHATCODE       6A  B  6 34DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            QTY18         12Y 4B  6 43EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            QTYUM          2A  B  6 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            SUBD           4A  B  6 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            CLASS          3A  B  6 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            ADDLDATA       6Y 0B  6 74DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CURRENCYLI    26A  B  7  4DSPATR(PR)
     A                                      OVRDTA
     A            DISCOUNTLI    48A  B  7 31DSPATR(PR)
     A                                      OVRDTA
     A            UNITVALLIT    11A  B  8  4DSPATR(PR)
     A                                      OVRDTA
     A            VALUE         11Y 0B  8 16DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            TX             2A  B  8 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            L              1A  B  8 61DSPATR(PR)
     A                                      OVRDTA
     A            INVLSLIT      14A  B  8 64DSPATR(PR)
     A                                      OVRDTA
     A            INVLSPO        1A  B  8 79DSPATR(PR)
     A                                      OVRDTA
     A            MASTSTK        7A  B  9 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A            TRACKING       1   B  9 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            MANUFACTLI    26A  B 10 49DSPATR(PR)
     A                                      OVRDTA
     A            S1             3A  B 10 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            S2             3A  B 10 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            S3             3A  B 10 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            S4             3A  B 10 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            RCV1           3A  B 11 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A            RCV2           3A  B 11 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            RCV3           3A  B 11 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A            RCV4           3A  B 11 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            MANUFACTSE    26A  B 11 49DSPATR(PR)
     A                                      OVRDTA
     A            DESCLIT       22A  B 12  2DSPATR(PR)
     A                                      OVRDTA
     A            MOREDESCMS    55A  B 12 25DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLIN    79A  B 13  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            COMMENTLI2    79A  B 14  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            COMMENTLI3    79A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            COMMENTLI4    79A  B 16  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            COMMENTLI5    79A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            COMMENTLI6    79A  B 18  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            COMMENTLI7    79A  B 19  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            ADDLDESCMS    60A  B 20  3DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTCON     1A  B 20 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            INSTRUCTIO    60A  B 22  6DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-CHANGE REQ/CODE f2-DESC.-
     A                                      / MANUF. f8-SECOND LANGUAGE f4-KEY -
     A                                      DESC.')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R PURORD2AI
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 19'PURCHASE ORDER ENTRY -- ITEMS'
     A                                  1 76'PU1-2'
     A                                  2 60'("NC" FOR NON-CODED)'
     A                                  3  1'PO'
     A                                  3 17'ITEM NO.'
     A                                  3 32'REQUISITION'
     A                                  3 58'OR  CODE'
     A                                  4  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  5  8'UNIT PRICE   UM   CODE'
     A                                  5 34'CHAT#'
     A                                  5 46'QUANTITY   UM  DEPT  CLASS  EXP/NW'
     A                                  8 29'TAX CODE'
     A                                  8 42'SECONDARY LANGUAGE'
     A                                  9  4'MASTER STOCK'
     A                                  9 25'(FOR RAW MATERIALS)'
     A                                  9 49'QS9000 TRACKING("X")'
     A                                 10  4'STANDARD INSTRUCTIONS'
     A                                 11  4'RECEIVING INSTRUCTIONS'
     A                                 21  3'FOR LOCAL DESCRIPTION/COMMENTS ENT-
     A                                      ER AN "@" AS THE FIRST CHARACTER OF-
     A                                       THE LINE'
     A            CCC            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            EDIPOLIT       6A  B  2 30DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B  3  4DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  3 12DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4Y 0B  3 26DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            REQNO         12A  B  3 44DSPATR(PR)
     A                                      OVRDTA
     A            CORPCOD        7A  B  3 67DSPATR(PR)
     A                                      OVRDTA
     A            PRICE11       15Y 4B  6  4EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            UNITPRICE      2A  B  6 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            STRCODE        7A  B  6 25DSPATR(PR)
     A                                      OVRDTA
     A            CHATCODE       6A  B  6 34DSPATR(PR)
     A                                      OVRDTA
     A            QTY18         12Y 4B  6 43EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            QTYUM          2A  B  6 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            SUBD           4A  B  6 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            CLASS          3A  B  6 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            ADDLDATA       6Y 0B  6 74DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CURRENCYLI    26A  B  7  4DSPATR(PR)
     A                                      OVRDTA
     A            DISCOUNTLI    48A  B  7 31DSPATR(PR)
     A                                      OVRDTA
     A            UNITVALLIT    11A  B  8  4DSPATR(PR)
     A                                      OVRDTA
     A            VALUE         11Y 0B  8 16DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            TX             2A  B  8 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            L              1A  B  8 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            INVLSLIT      14A  B  8 64DSPATR(PR)
     A                                      OVRDTA
     A            INVLSPO        1A  B  8 79DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            MASTSTK        7A  B  9 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A            TRACKING       1   B  9 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            MANUFACTLI    26A  B 10 49DSPATR(PR)
     A                                      OVRDTA
     A            S1             3A  B 10 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            S2             3A  B 10 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            S3             3A  B 10 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            S4             3A  B 10 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            RCV1           3A  B 11 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A            RCV2           3A  B 11 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            RCV3           3A  B 11 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A            RCV4           3A  B 11 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            MANUFACTSE    26A  B 11 49DSPATR(PR)
     A                                      OVRDTA
     A            DESCLIT       22A  B 12  2DSPATR(PR)
     A                                      OVRDTA
     A            MOREDESCMS    55A  B 12 25DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLIN    79A  B 13  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            COMMENTLI2    79A  B 14  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            COMMENTLI3    79A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            COMMENTLI4    79A  B 16  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            COMMENTLI5    79A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            COMMENTLI6    79A  B 18  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            COMMENTLI7    79A  B 19  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            ADDLDESCMS    60A  B 20  3DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTCON     1A  B 20 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            INSTRUCTIO    60A  B 22  6DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-CHANGE REQ/CODE f2-DESC.-
     A                                      / MANUF. f8-SECOND LANGUAGE f4-KEY -
     A                                      DESC.')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R PURORD2AL
     A*%%TS  SD  19961118  100107  A193138     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 19'PURCHASE ORDER ENTRY -- ITEMS'
     A                                  1 76'PU1-2'
     A                                  2 60'("NC" FOR NON-CODED)'
     A                                  3  1'PO'
     A                                  3 17'ITEM NO.'
     A                                  3 32'REQUISITION'
     A                                  3 58'OR  CODE'
     A                                  4  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  5  6'UNIT PRICE   UM   CODE'
     A                                  5 36'QUANTITY   UM  CO   PRM  CLS   DEP-
     A                                      T   NW/A.D.'
     A                                  8 27'TAX CODE'
     A                                  8 40'SECONDARY LANGUAGE'
     A                                  9  2'MASTER STOCK'
     A                                  9 23'(FOR RAW MATERIALS)'
     A                                  9 47'QS9000 TRACKING("X")'
     A                                 10  2'STANDARD INSTRUCTIONS'
     A                                 11  2'RECEIVING INSTRUCTIONS'
     A                                 21  3'FOR LOCAL DESCRIPTION/COMMENTS ENT-
     A                                      ER AN "@" AS THE FIRST CHARACTER OF-
     A                                       THE LINE'
     A            CCC            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            EDIPOLIT       6A  B  2 30DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B  3  4DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  3 12DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4Y 0B  3 26DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            REQNO         12A  B  3 44DSPATR(PR)
     A                                      OVRDTA
     A            CORPCOD        7A  B  3 67DSPATR(PR)
     A                                      OVRDTA
     A            PRICE11       15Y 4B  6  2EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            UNITPRICE      2A  B  6 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            STRCODE        7A  B  6 23DSPATR(PR)
     A                                      OVRDTA
     A            QTY18         12Y 4B  6 33EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            QTYUM          2A  B  6 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            COMPANY        3A  B  6 51DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A            PRIME          3A  B  6 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A            CLASS          3A  B  6 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            SUBD           4A  B  6 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            ADDLDATA       6Y 0B  6 74DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CURRENCYLI    26A  B  7  2DSPATR(PR)
     A                                      OVRDTA
     A            DISCOUNTLI    48A  B  7 29DSPATR(PR)
     A                                      OVRDTA
     A            UNITVALLIT    11A  B  8  2DSPATR(PR)
     A                                      OVRDTA
     A            VALUE         11Y 0B  8 14DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            TX             2A  B  8 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            L              1A  B  8 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            INVLSLIT      14A  B  8 62DSPATR(PR)
     A                                      OVRDTA
     A            INVLSPO        1A  B  8 77DSPATR(PR)
     A                                      OVRDTA
     A            MASTSTK        7A  B  9 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A            TRACKING       1   B  9 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            MANUFACTLI    26A  B 10 47DSPATR(PR)
     A                                      OVRDTA
     A            S1             3A  B 10 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            S2             3A  B 10 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            S3             3A  B 10 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            S4             3A  B 10 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            RCV1           3A  B 11 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A            RCV2           3A  B 11 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            RCV3           3A  B 11 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A            RCV4           3A  B 11 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            MANUFACTSE    26A  B 11 47DSPATR(PR)
     A                                      OVRDTA
     A            DESCLIT       22A  B 12  2DSPATR(PR)
     A                                      OVRDTA
     A            MOREDESCMS    55A  B 12 25DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLIN    79A  B 13  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            COMMENTLI2    79A  B 14  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            COMMENTLI3    79A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            COMMENTLI4    79A  B 16  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            COMMENTLI5    79A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            COMMENTLI6    79A  B 18  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            COMMENTLI7    79A  B 19  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            ADDLDESCMS    60A  B 20  3DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTCON     1A  B 20 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            INSTRUCTIO    60A  B 22  6DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-CHANGE REQ/CODE f2-DESC.-
     A                                      / MANUF. f8-SECOND LANGUAGE f4-KEY -
     A                                      DESC.')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R PURORD2ALI
     A*%%TS  SD  19961118  100107  A193138     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 19'PURCHASE ORDER ENTRY -- ITEMS'
     A                                  1 76'PU1-2'
     A                                  2 60'("NC" FOR NON-CODED)'
     A                                  3  1'PO'
     A                                  3 17'ITEM NO.'
     A                                  3 32'REQUISITION'
     A                                  3 58'OR  CODE'
     A                                  4  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  5  6'UNIT PRICE   UM   CODE'
     A                                  5 36'QUANTITY   UM  CO   PRM  CLS   DEP-
     A                                      T   NW/A.D.'
     A                                  8 27'TAX CODE'
     A                                  8 40'SECONDARY LANGUAGE'
     A                                  9  2'MASTER STOCK'
     A                                  9 23'(FOR RAW MATERIALS)'
     A                                  9 47'QS9000 TRACKING("X")'
     A                                 10  2'STANDARD INSTRUCTIONS'
     A                                 11  2'RECEIVING INSTRUCTIONS'
     A                                 21  3'FOR LOCAL DESCRIPTION/COMMENTS ENT-
     A                                      ER AN "@" AS THE FIRST CHARACTER OF-
     A                                       THE LINE'
     A            CCC            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            EDIPOLIT       6A  B  2 30DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B  3  4DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  3 12DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4Y 0B  3 26DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            REQNO         12A  B  3 44DSPATR(PR)
     A                                      OVRDTA
     A            CORPCOD        7A  B  3 67DSPATR(PR)
     A                                      OVRDTA
     A            PRICE11       15Y 4B  6  2EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            UNITPRICE      2A  B  6 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            STRCODE        7A  B  6 23DSPATR(PR)
     A                                      OVRDTA
     A            QTY18         12Y 4B  6 33EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            QTYUM          2A  B  6 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            COMPANY        3A  B  6 51DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A            PRIME          3A  B  6 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A            CLASS          3A  B  6 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            SUBD           4A  B  6 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            ADDLDATA       6Y 0B  6 74DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CURRENCYLI    26A  B  7  2DSPATR(PR)
     A                                      OVRDTA
     A            DISCOUNTLI    48A  B  7 29DSPATR(PR)
     A                                      OVRDTA
     A            UNITVALLIT    11A  B  8  2DSPATR(PR)
     A                                      OVRDTA
     A            VALUE         11Y 0B  8 14DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            TX             2A  B  8 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            L              1A  B  8 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            INVLSLIT      14A  B  8 62DSPATR(PR)
     A                                      OVRDTA
     A            INVLSPO        1A  B  8 77DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            MASTSTK        7A  B  9 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A            TRACKING       1   B  9 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            MANUFACTLI    26A  B 10 47DSPATR(PR)
     A                                      OVRDTA
     A            S1             3A  B 10 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            S2             3A  B 10 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            S3             3A  B 10 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            S4             3A  B 10 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            RCV1           3A  B 11 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A            RCV2           3A  B 11 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            RCV3           3A  B 11 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A            RCV4           3A  B 11 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            MANUFACTSE    26A  B 11 47DSPATR(PR)
     A                                      OVRDTA
     A            DESCLIT       22A  B 12  2DSPATR(PR)
     A                                      OVRDTA
     A            MOREDESCMS    55A  B 12 25DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLIN    79A  B 13  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            COMMENTLI2    79A  B 14  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            COMMENTLI3    79A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            COMMENTLI4    79A  B 16  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            COMMENTLI5    79A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            COMMENTLI6    79A  B 18  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            COMMENTLI7    79A  B 19  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            ADDLDESCMS    60A  B 20  3DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTCON     1A  B 20 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            INSTRUCTIO    60A  B 22  6DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-CHANGE REQ/CODE f2-DESC.-
     A                                      / MANUF. f8-SECOND LANGUAGE f4-KEY -
     A                                      DESC.')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R PURORD2B
     A*%%TS  SD  19961118  100107  A193138     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 19'PURCHASE ORDER ENTRY -- ITEMS'
     A                                  1 76'PU1-2'
     A                                  2 60'("NC" FOR NON-CODED)'
     A                                  3  1'PO'
     A                                  3 17'ITEM NO.'
     A                                  3 32'REQUISITION'
     A                                  3 58'OR  CODE'
     A                                  4  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  5  8'UNIT PRICE   UM   CODE'
     A                                  5 34'CHAT#'
     A                                  5 46'QUANTITY   UM  DEPT  CLASS  EXP/NW'
     A                                  8 29'TAX CODE'
     A                                  8 42'SECONDARY LANGUAGE'
     A                                  9  4'MASTER STOCK'
     A                                  9 25'(FOR RAW MATERIALS)'
     A                                  9 49'QS9000 TRACKING("X")'
     A                                 10  4'STANDARD INSTRUCTIONS'
     A                                 11  4'RECEIVING INSTRUCTIONS'
     A                                 21  3'FOR LOCAL DESCRIPTION/COMMENTS ENT-
     A                                      ER AN "@" AS THE FIRST CHARACTER OF-
     A                                       THE LINE'
     A            CCC            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            EDIPOLIT       6A  B  2 30DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B  3  4DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  3 12DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4Y 0B  3 26DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            REQNO         12A  B  3 44DSPATR(PR)
     A                                      OVRDTA
     A            CORPCOD        7A  B  3 67DSPATR(PR)
     A                                      OVRDTA
     A            PRICE11       15Y 4B  6  4EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            UNITPRICE      2A  B  6 21DSPATR(PR)
     A                                      OVRDTA
     A            STRCODE        7A  B  6 25DSPATR(PR)
     A                                      OVRDTA
     A            CHATCODE       6A  B  6 34DSPATR(PR)
     A                                      OVRDTA
     A            QTY18         12Y 4B  6 43EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            QTYUM          2A  B  6 57DSPATR(PR)
     A                                      OVRDTA
     A            SUBD           4A  B  6 61DSPATR(PR)
     A                                      OVRDTA
     A            CLASS          3A  B  6 68DSPATR(PR)
     A                                      OVRDTA
     A            ADDLDATA       6A  B  6 74DSPATR(PR)
     A                                      OVRDTA
     A            CURRENCYLI    26A  B  7  4DSPATR(PR)
     A                                      OVRDTA
     A            DISCOUNTLI    48A  B  7 31DSPATR(PR)
     A                                      OVRDTA
     A            UNITVALLIT    11A  B  8  4DSPATR(PR)
     A                                      OVRDTA
     A            VALUE         11Y 0B  8 16DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            TX             2A  B  8 38DSPATR(PR)
     A                                      OVRDTA
     A            L              1A  B  8 61DSPATR(PR)
     A                                      OVRDTA
     A            INVLSLIT      14A  B  8 64DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            INVLSPO        1A  B  8 79DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            MASTSTK        7A  B  9 17DSPATR(PR)
     A                                      OVRDTA
     A            TRACKING       1   B  9 70DSPATR(PR)
     A                                      OVRDTA
     A            MANUFACTLI    26A  B 10 49DSPATR(PR)
     A                                      OVRDTA
     A            S1             3A  B 10 27DSPATR(PR)
     A                                      OVRDTA
     A            S2             3A  B 10 32DSPATR(PR)
     A                                      OVRDTA
     A            S3             3A  B 10 37DSPATR(PR)
     A                                      OVRDTA
     A            S4             3A  B 10 42DSPATR(PR)
     A                                      OVRDTA
     A            RCV1           3A  B 11 27DSPATR(PR)
     A                                      OVRDTA
     A            RCV2           3A  B 11 32DSPATR(PR)
     A                                      OVRDTA
     A            RCV3           3A  B 11 37DSPATR(PR)
     A                                      OVRDTA
     A            RCV4           3A  B 11 42DSPATR(PR)
     A                                      OVRDTA
     A            MANUFACTSE    26A  B 11 49DSPATR(PR)
     A                                      OVRDTA
     A            DESCLIT       22A  B 12  2DSPATR(PR)
     A                                      OVRDTA
     A            MOREDESCMS    55A  B 12 25DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLIN    79A  B 13  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            COMMENTLI2    79A  B 14  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            COMMENTLI3    79A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            COMMENTLI4    79A  B 16  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            COMMENTLI5    79A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            COMMENTLI6    79A  B 18  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            COMMENTLI7    79A  B 19  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            ADDLDESCMS    60A  B 20  3DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTCON     1A  B 20 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            INSTRUCTIO    60A  B 22  6DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL(' ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R PURORD2BC
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 19'PURCHASE ORDER ENTRY -- ITEMS'
     A                                  1 76'PU1-2'
     A                                  2 60'("NC" FOR NON-CODED)'
     A                                  3  1'PO'
     A                                  3 17'ITEM NO.'
     A                                  3 32'REQUISITION'
     A                                  3 58'OR  CODE'
     A                                  4  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  5  8'UNIT PRICE   UM   CODE'
     A                                  5 34'CHAT#'
     A                                  5 46'QUANTITY   UM  DEPT  CLASS  EXP/NW'
     A                                  8 29'TAX CODE'
     A                                  8 42'SECONDARY LANGUAGE'
     A                                  9  4'MASTER STOCK'
     A                                  9 25'(FOR RAW MATERIALS)'
     A                                  9 49'QS9000 TRACKING("X")'
     A                                 10  4'STANDARD INSTRUCTIONS'
     A                                 21  3'FOR LOCAL DESCRIPTION/COMMENTS ENT-
     A                                      ER AN "@" AS THE FIRST CHARACTER OF-
     A                                       THE LINE'
     A            CCC            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            EDIPOLIT       6A  B  2 30DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B  3  4DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  3 12DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4Y 0B  3 26DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            REQNO         12A  B  3 44DSPATR(PR)
     A                                      OVRDTA
     A            CORPCOD        7A  B  3 67DSPATR(PR)
     A                                      OVRDTA
     A            PRICE11       15Y 4B  6  4EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            UNITPRICE      2A  B  6 21DSPATR(PR)
     A                                      OVRDTA
     A            STRCODE        7A  B  6 25DSPATR(PR)
     A                                      OVRDTA
     A            CHATCODE       6A  B  6 34DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            QTY18         12Y 4B  6 43EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            QTYUM          2A  B  6 57DSPATR(PR)
     A                                      OVRDTA
     A            SUBD           4A  B  6 61DSPATR(PR)
     A                                      OVRDTA
     A            CLASS          3A  B  6 68DSPATR(PR)
     A                                      OVRDTA
     A            ADDLDATA       6A  B  6 74DSPATR(PR)
     A                                      OVRDTA
     A            CURRENCYLI    26A  B  7  4DSPATR(PR)
     A                                      OVRDTA
     A            DISCOUNTLI    48A  B  7 31DSPATR(PR)
     A                                      OVRDTA
     A            UNITVALLIT    11A  B  8  4DSPATR(PR)
     A                                      OVRDTA
     A            VALUE         11Y 0B  8 16DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            TX             2A  B  8 38DSPATR(PR)
     A                                      OVRDTA
     A            L              1A  B  8 61DSPATR(PR)
     A                                      OVRDTA
     A            INVLSLIT      14A  B  8 64DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            INVLSPO        1A  B  8 79DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            MASTSTK        7A  B  9 17DSPATR(PR)
     A                                      OVRDTA
     A            TRACKING       1   B  9 70DSPATR(PR)
     A                                      OVRDTA
     A            MANUFACTLI    26A  B 10 49DSPATR(PR)
     A                                      OVRDTA
     A            S1             3A  B 10 27DSPATR(PR)
     A                                      OVRDTA
     A            S2             3A  B 10 32DSPATR(PR)
     A                                      OVRDTA
     A            S3             3A  B 10 37DSPATR(PR)
     A                                      OVRDTA
     A            S4             3A  B 10 42DSPATR(PR)
     A                                      OVRDTA
     A            MANUFACTSE    26A  B 11 49DSPATR(PR)
     A                                      OVRDTA
     A            DESCLIT       22A  B 12  2DSPATR(PR)
     A                                      OVRDTA
     A            MOREDESCMS    55A  B 12 25DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLIN    79A  B 13  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            COMMENTLI2    79A  B 14  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            COMMENTLI3    79A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            COMMENTLI4    79A  B 16  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            COMMENTLI5    79A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            COMMENTLI6    79A  B 18  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            COMMENTLI7    79A  B 19  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            ADDLDESCMS    60A  B 20  3DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTCON     1A  B 20 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            INSTRUCTIO    60A  B 22  6DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL(' ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A                                 11  4'RECEIVING INSTRUCTIONS'
     A            FLD001         3A  B 11 27
     A            FLD002         3A  B 11 32
     A            FLD003         3A  B 11 37
     A            FLD004         3A  B 11 42
     A          R PURORD2C
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 19'PURCHASE ORDER ENTRY -- ITEMS'
     A                                  1 76'PU1-2'
     A                                  2 60'("NC" FOR NON-CODED)'
     A                                  3  1'PO'
     A                                  3 17'ITEM NO.'
     A                                  3 32'REQUISITION'
     A                                  3 58'OR  CODE'
     A                                  4  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  5  8'UNIT PRICE   UM   CODE'
     A                                  5 34'CHAT#'
     A                                  5 46'QUANTITY   UM  DEPT  CLASS  EXP/NW'
     A                                  8 29'TAX CODE'
     A                                  8 42'SECONDARY LANGUAGE'
     A                                  8 64'INVOICELESS PO'
     A                                  9  4'MASTER STOCK'
     A                                  9 25'(FOR RAW MATERIALS)'
     A                                  9 49'QS9000 TRACKING("X")'
     A                                 10  4'STANDARD INSTRUCTIONS'
     A                                 11  4'RECEIVING INSTRUCTIONS'
     A                                 21  3'FOR LOCAL DESCRIPTION/COMMENTS ENT-
     A                                      ER AN "@" AS THE FIRST CHARACTER OF-
     A                                       THE LINE'
     A            CCC            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            EDIPOLIT       6A  B  2 30DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B  3  4DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  3 12DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4Y 0B  3 26DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            REQNO         12A  B  3 44DSPATR(PR)
     A                                      OVRDTA
     A            CORPCOD        7A  B  3 67DSPATR(PR)
     A                                      OVRDTA
     A            PRICE11       15Y 4B  6  4EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            UNITPRICE      2A  B  6 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            STRCODE        7A  B  6 25DSPATR(PR)
     A                                      OVRDTA
     A            CHATCODE       6A  B  6 34DSPATR(PR)
     A                                      OVRDTA
     A            QTY18         12Y 4B  6 43EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            QTYUM          2A  B  6 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            SUBD           4A  B  6 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            CLASS          3A  B  6 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            ADDLDATA       6Y 0B  6 74DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CURRENCYLI    26A  B  7  4DSPATR(PR)
     A                                      OVRDTA
     A            DISCOUNTLI    48A  B  7 31DSPATR(PR)
     A                                      OVRDTA
     A            UNITVALLIT    11A  B  8  4DSPATR(PR)
     A                                      OVRDTA
     A            VALUE         11Y 0B  8 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A                                      CHECK(RZ)
     A            TX             2A  B  8 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            L              1A  B  8 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            INVLSLIT      14A  B  8 64DSPATR(PR)
     A                                      OVRDTA
     A            INVLSPO        1A  B  8 79DSPATR(PR)
     A                                      OVRDTA
     A            MASTSTK        7A  B  9 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A            TRACKING       1   B  9 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            MANUFACTLI    26A  B 10 49DSPATR(PR)
     A                                      OVRDTA
     A            S1             3A  B 10 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            S2             3A  B 10 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            S3             3A  B 10 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            S4             3A  B 10 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            RCV1           3A  B 11 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A            RCV2           3A  B 11 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            RCV3           3A  B 11 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A            RCV4           3A  B 11 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            MANUFACTSE    26A  B 11 49DSPATR(PR)
     A                                      OVRDTA
     A            DESCLIT       22A  B 12  2DSPATR(PR)
     A                                      OVRDTA
     A            MOREDESCMS    55A  B 12 25DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLIN    79A  B 13  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            COMMENTLI2    79A  B 14  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            COMMENTLI3    79A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            COMMENTLI4    79A  B 16  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            COMMENTLI5    79A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            COMMENTLI6    79A  B 18  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            COMMENTLI7    79A  B 19  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            ADDLDESCMS    60A  B 20  3DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTCON     1A  B 20 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            INSTRUCTIO    60A  B 22  6DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-CHANGE REQ/CODE f2-DESC.-
     A                                      / MANUF. f8-SECOND LANGUAGE f4-KEY -
     A                                      DESC.')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R PURORD2CC
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 19'PURCHASE ORDER ENTRY -- ITEMS'
     A                                  1 76'PU1-2'
     A                                  2 60'("NC" FOR NON-CODED)'
     A                                  3  1'PO'
     A                                  3 17'ITEM NO.'
     A                                  3 32'REQUISITION'
     A                                  3 58'OR  CODE'
     A                                  4  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  5  8'UNIT PRICE   UM   CODE'
     A                                  5 34'CHAT#'
     A                                  5 46'QUANTITY   UM  DEPT  CLASS  EXP/NW'
     A                                  8 29'TAX CODE'
     A                                  8 42'SECONDARY LANGUAGE'
     A                                  8 64'INVOICELESS PO'
     A                                  9  4'MASTER STOCK'
     A                                  9 25'(FOR RAW MATERIALS)'
     A                                  9 49'QS9000 TRACKING("X")'
     A                                 10  4'STANDARD INSTRUCTIONS'
     A                                 11  4'RECEIVING INSTRUCTIONS'
     A                                 21  3'FOR LOCAL DESCRIPTION/COMMENTS ENT-
     A                                      ER AN "@" AS THE FIRST CHARACTER OF-
     A                                       THE LINE'
     A            CCC            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            EDIPOLIT       6A  B  2 30DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B  3  4DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  3 12DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4Y 0B  3 26DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            REQNO         12A  B  3 44DSPATR(PR)
     A                                      OVRDTA
     A            CORPCOD        7A  B  3 67DSPATR(PR)
     A                                      OVRDTA
     A            PRICE11       15Y 4B  6  4EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            UNITPRICE      2A  B  6 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            STRCODE        7A  B  6 25DSPATR(PR)
     A                                      OVRDTA
     A            CHATCODE       6A  B  6 34DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            QTY18         12Y 4B  6 43EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            QTYUM          2A  B  6 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            SUBD           4A  B  6 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            CLASS          3A  B  6 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            ADDLDATA       6Y 0B  6 74DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CURRENCYLI    26A  B  7  4DSPATR(PR)
     A                                      OVRDTA
     A            DISCOUNTLI    48A  B  7 31DSPATR(PR)
     A                                      OVRDTA
     A            UNITVALLIT    11A  B  8  4DSPATR(PR)
     A                                      OVRDTA
     A            VALUE         11Y 0B  8 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A                                      CHECK(RZ)
     A            TX             2A  B  8 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            L              1A  B  8 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            INVLSLIT      14A  B  8 64DSPATR(PR)
     A                                      OVRDTA
     A            INVLSPO        1A  B  8 79DSPATR(PR)
     A                                      OVRDTA
     A            MASTSTK        7A  B  9 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A            TRACKING       1   B  9 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            MANUFACTLI    26A  B 10 49DSPATR(PR)
     A                                      OVRDTA
     A            S1             3A  B 10 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            S2             3A  B 10 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            S3             3A  B 10 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            S4             3A  B 10 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            RCV1           3A  B 11 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A            RCV2           3A  B 11 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            RCV3           3A  B 11 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A            RCV4           3A  B 11 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            MANUFACTSE    26A  B 11 49DSPATR(PR)
     A                                      OVRDTA
     A            DESCLIT       22A  B 12  2DSPATR(PR)
     A                                      OVRDTA
     A            MOREDESCMS    55A  B 12 25DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLIN    79A  B 13  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            COMMENTLI2    79A  B 14  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            COMMENTLI3    79A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            COMMENTLI4    79A  B 16  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            COMMENTLI5    79A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            COMMENTLI6    79A  B 18  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            COMMENTLI7    79A  B 19  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            ADDLDESCMS    60A  B 20  3DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTCON     1A  B 20 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            INSTRUCTIO    60A  B 22  6DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-CHANGE REQ/CODE f2-DESC.-
     A                                      / MANUF. f8-SECOND LANGUAGE f4-KEY -
     A                                      DESC.')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R PURORD2CI
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 19'PURCHASE ORDER ENTRY -- ITEMS'
     A                                  1 76'PU1-2'
     A                                  2 60'("NC" FOR NON-CODED)'
     A                                  3  1'PO'
     A                                  3 17'ITEM NO.'
     A                                  3 32'REQUISITION'
     A                                  3 58'OR  CODE'
     A                                  4  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  5  8'UNIT PRICE   UM   CODE'
     A                                  5 34'CHAT#'
     A                                  5 46'QUANTITY   UM  DEPT  CLASS  EXP/NW'
     A                                  8 29'TAX CODE'
     A                                  8 42'SECONDARY LANGUAGE'
     A                                  8 64'INVOICELESS PO'
     A                                  9  4'MASTER STOCK'
     A                                  9 25'(FOR RAW MATERIALS)'
     A                                  9 49'QS9000 TRACKING("X")'
     A                                 10  4'STANDARD INSTRUCTIONS'
     A                                 11  4'RECEIVING INSTRUCTIONS'
     A                                 21  3'FOR LOCAL DESCRIPTION/COMMENTS ENT-
     A                                      ER AN "@" AS THE FIRST CHARACTER OF-
     A                                       THE LINE'
     A            CCC            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            EDIPOLIT       6A  B  2 30DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B  3  4DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  3 12DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4Y 0B  3 26DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            REQNO         12A  B  3 44DSPATR(PR)
     A                                      OVRDTA
     A            CORPCOD        7A  B  3 67DSPATR(PR)
     A                                      OVRDTA
     A            PRICE11       15Y 4B  6  4EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            UNITPRICE      2A  B  6 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            STRCODE        7A  B  6 25DSPATR(PR)
     A                                      OVRDTA
     A            CHATNO         6A  B  6 34DSPATR(PR)
     A                                      OVRDTA
     A            QTY18         12Y 4B  6 43EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            QTYUM          2A  B  6 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            SUBD           4A  B  6 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            CLASS          3A  B  6 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            ADDLDATA       6Y 0B  6 74DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CURRENCYLI    26A  B  7  4DSPATR(PR)
     A                                      OVRDTA
     A            DISCOUNTLI    48A  B  7 31DSPATR(PR)
     A                                      OVRDTA
     A            UNITVALLIT    11A  B  8  4DSPATR(PR)
     A                                      OVRDTA
     A            VALUE         11Y 0B  8 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A                                      CHECK(RZ)
     A            TX             2A  B  8 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            L              1A  B  8 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            INVLSLIT      14A  B  8 64DSPATR(PR)
     A                                      OVRDTA
     A            INVLSPO        1A  B  8 79DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            MASTSTK        7A  B  9 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A            TRACKING       1   B  9 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            MANUFACTLI    26A  B 10 49DSPATR(PR)
     A                                      OVRDTA
     A            S1             3A  B 10 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            S2             3A  B 10 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            S3             3A  B 10 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            S4             3A  B 10 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            RCV1           3A  B 11 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A            RCV2           3A  B 11 32DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            RCV3           3A  B 11 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A            RCV4           3A  B 11 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            MANUFACTSE    26A  B 11 49DSPATR(PR)
     A                                      OVRDTA
     A            DESCLIT       22A  B 12  2DSPATR(PR)
     A                                      OVRDTA
     A            MOREDESCMS    55A  B 12 25DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLIN    79A  B 13  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            COMMENTLI2    79A  B 14  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            COMMENTLI3    79A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            COMMENTLI4    79A  B 16  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            COMMENTLI5    79A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            COMMENTLI6    79A  B 18  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            COMMENTLI7    79A  B 19  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            ADDLDESCMS    60A  B 20  3DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTCON     1A  B 20 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            INSTRUCTIO    60A  B 22  6DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-CHANGE REQ/CODE f2-DESC.-
     A                                      / MANUF. f8-SECOND LANGUAGE f4-KEY -
     A                                      DESC.')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R PURORD2CL
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 19'PURCHASE ORDER ENTRY -- ITEMS'
     A                                  1 76'PU1-2'
     A                                  2 60'("NC" FOR NON-CODED)'
     A                                  3  1'PO'
     A                                  3 17'ITEM NO.'
     A                                  3 32'REQUISITION'
     A                                  3 58'OR  CODE'
     A                                  4  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  5  6'UNIT PRICE   UM   CODE'
     A                                  5 36'QUANTITY   UM  CO   PRM  CLS   DEP-
     A                                      T   NW/A.D.'
     A                                  8 27'TAX CODE'
     A                                  8 40'SECONDARY LANGUAGE'
     A                                  8 64'INVOICELESS PO'
     A                                  9  2'MASTER STOCK'
     A                                  9 23'(FOR RAW MATERIALS)'
     A                                  9 47'QS9000 TRACKING("X")'
     A                                 10  2'STANDARD INSTRUCTIONS'
     A                                 11  2'RECEIVING INSTRUCTIONS'
     A                                 21  3'FOR LOCAL DESCRIPTION/COMMENTS ENT-
     A                                      ER AN "@" AS THE FIRST CHARACTER OF-
     A                                       THE LINE'
     A            CCC            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            EDIPOLIT       6A  B  2 30DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B  3  4DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  3 12DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4Y 0B  3 26DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            REQNO         12A  B  3 44DSPATR(PR)
     A                                      OVRDTA
     A            CORPCOD        7A  B  3 67DSPATR(PR)
     A                                      OVRDTA
     A            PRICE11       15Y 4B  6  2EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            UNITPRICE      2A  B  6 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            STRCODE        7A  B  6 23DSPATR(PR)
     A                                      OVRDTA
     A            QTY18         12Y 4B  6 33EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            QTYUM          2A  B  6 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            COMPANY        3A  B  6 51DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A            PRIME          3A  B  6 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A            CLASS          3A  B  6 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            SUBD           4A  B  6 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            ADDLDATA       6Y 0B  6 74DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CURRENCYLI    26A  B  7  2DSPATR(PR)
     A                                      OVRDTA
     A            DISCOUNTLI    48A  B  7 29DSPATR(PR)
     A                                      OVRDTA
     A            UNITVALLIT    11A  B  8  2DSPATR(PR)
     A                                      OVRDTA
     A            VALUE         11Y 0B  8 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A                                      CHECK(RZ)
     A            TX             2A  B  8 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            L              1A  B  8 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            INVLSLIT      14A  B  8 62DSPATR(PR)
     A                                      OVRDTA
     A            INVLSPO        1A  B  8 77DSPATR(PR)
     A                                      OVRDTA
     A            MASTSTK        7A  B  9 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A            TRACKING       1   B  9 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            MANUFACTLI    26A  B 10 47DSPATR(PR)
     A                                      OVRDTA
     A            S1             3A  B 10 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            S2             3A  B 10 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            S3             3A  B 10 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            S4             3A  B 10 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            RCV1           3A  B 11 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A            RCV2           3A  B 11 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            RCV3           3A  B 11 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A            RCV4           3A  B 11 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            MANUFACTSE    26A  B 11 47DSPATR(PR)
     A                                      OVRDTA
     A            DESCLIT       22A  B 12  2DSPATR(PR)
     A                                      OVRDTA
     A            MOREDESCMS    55A  B 12 25DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLIN    79A  B 13  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            COMMENTLI2    79A  B 14  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            COMMENTLI3    79A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            COMMENTLI4    79A  B 16  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            COMMENTLI5    79A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            COMMENTLI6    79A  B 18  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            COMMENTLI7    79A  B 19  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            ADDLDESCMS    60A  B 20  3DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTCON     1A  B 20 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            INSTRUCTIO    60A  B 22  6DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-CHANGE REQ/CODE f2-DESC.-
     A                                      / MANUF. f8-SECOND LANGUAGE f4-KEY -
     A                                      DESC.')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R PURORD2CLI
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 19'PURCHASE ORDER ENTRY -- ITEMS'
     A                                  1 76'PU1-2'
     A                                  2 60'("NC" FOR NON-CODED)'
     A                                  3  1'PO'
     A                                  3 17'ITEM NO.'
     A                                  3 32'REQUISITION'
     A                                  3 58'OR  CODE'
     A                                  4  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  5  6'UNIT PRICE   UM   CODE'
     A                                  5 36'QUANTITY   UM  CO   PRM  CLS   DEP-
     A                                      T   NW/A.D.'
     A                                  8 27'TAX CODE'
     A                                  8 40'SECONDARY LANGUAGE'
     A                                  8 64'INVOICELESS PO'
     A                                  9  2'MASTER STOCK'
     A                                  9 23'(FOR RAW MATERIALS)'
     A                                  9 47'QS9000 TRACKING("X")'
     A                                 10  2'STANDARD INSTRUCTIONS'
     A                                 11  2'RECEIVING INSTRUCTIONS'
     A                                 21  3'FOR LOCAL DESCRIPTION/COMMENTS ENT-
     A                                      ER AN "@" AS THE FIRST CHARACTER OF-
     A                                       THE LINE'
     A            CCC            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            EDIPOLIT       6A  B  2 30DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B  3  4DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  3 12DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4Y 0B  3 26DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            REQNO         12A  B  3 44DSPATR(PR)
     A                                      OVRDTA
     A            CORPCOD        7A  B  3 67DSPATR(PR)
     A                                      OVRDTA
     A            PRICE11       15Y 4B  6  2EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            UNITPRICE      2A  B  6 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            STRCODE        7A  B  6 23DSPATR(PR)
     A                                      OVRDTA
     A            QTY18         12Y 4B  6 33EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            QTYUM          2A  B  6 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            COMPANY        3A  B  6 51DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A            PRIME          3A  B  6 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A            CLASS          3A  B  6 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            SUBD           4A  B  6 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            ADDLDATA       6Y 0B  6 74DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A            CURRENCYLI    26A  B  7  2DSPATR(PR)
     A                                      OVRDTA
     A            DISCOUNTLI    48A  B  7 29DSPATR(PR)
     A                                      OVRDTA
     A            UNITVALLIT    11A  B  8  2DSPATR(PR)
     A                                      OVRDTA
     A            VALUE         11Y 0B  8 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A                                      CHECK(RZ)
     A            TX             2A  B  8 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            L              1A  B  8 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            INVLSLIT      14A  B  8 62DSPATR(PR)
     A                                      OVRDTA
     A            INVLSPO        1A  B  8 77DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            MASTSTK        7A  B  9 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A            TRACKING       1   B  9 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            MANUFACTLI    26A  B 10 47DSPATR(PR)
     A                                      OVRDTA
     A            S1             3A  B 10 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            S2             3A  B 10 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            S3             3A  B 10 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            S4             3A  B 10 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            RCV1           3A  B 11 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A            RCV2           3A  B 11 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            RCV3           3A  B 11 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A            RCV4           3A  B 11 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            MANUFACTSE    26A  B 11 47DSPATR(PR)
     A                                      OVRDTA
     A            DESCLIT       22A  B 12  2DSPATR(PR)
     A                                      OVRDTA
     A            MOREDESCMS    55A  B 12 25DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTLIN    79A  B 13  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            COMMENTLI2    79A  B 14  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            COMMENTLI3    79A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            COMMENTLI4    79A  B 16  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            COMMENTLI5    79A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            COMMENTLI6    79A  B 18  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            COMMENTLI7    79A  B 19  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            ADDLDESCMS    60A  B 20  3DSPATR(PR)
     A                                      OVRDTA
     A            COMMENTCON     1A  B 20 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            INSTRUCTIO    60A  B 22  6DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-CHANGE REQ/CODE f2-DESC.-
     A                                      / MANUF. f8-SECOND LANGUAGE f4-KEY -
     A                                      DESC.')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R PURORD3
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      RTNCSRLOC(&FMT &FLD)
     A            CCC            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A                                  1 18'PURCHASE ORDER ENTRY -- HEADER DAT-
     A                                      A'
     A                                  1 76'PU1-3'
     A                                  3  3'PO'
     A            PONUM          7A  B  3  6DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  3 14DSPATR(PR)
     A                                      OVRDTA
     A                                  5  3'SHIP DATE'
     A            SHIPDT         6A  B  5 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                  5 26'EXPECTED DELV. DATE'
     A            EXPDTE         6A  B  5 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A                                  7  3'BUYER CODE'
     A            BUY            4A  B  7 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A            BUYERNAME     15A  B  7 19DSPATR(PR)
     A                                      OVRDTA
     A                                  7 36'TYPIST'
     A            TYP            3A  B  7 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                  7 58'FOR DEPT'
     A            FOR            6A  B  7 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A                                  9  3'ADDL INFO'
     A            ADDLINFO      16A  B  9 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A N78                              9 56'VIA'
     A  78                              9 34'VIA (VIA CD/DS/F4 PROMPT)'
     A            VIA           20A  B  9 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A                                 11  3'BUDGET NUMBER'
     A            BUDGETNO      12A  B 11 17DSPATR(PR)
     A                                      OVRDTA
     A                                 11 36'BUDGET AMOUNT'
     A            BUDGAMT       11Y 0B 11 50DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A                                      CHECK(RZ)
     A  78                             13  3'FOB (FOB CD/DS/F4 PROMPT .....)'
     A N77                             13  3'FOB (ENTER FOB CODE OR VERBAGE)'
     A  77                             13  3'FOB (FOB CD/DS/F4 PROMPT .....)'
     A            FOB           20A  B 13 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A                                 13 57'FREIGHT TERMS'
     A            F              1A  B 13 71DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A                                 13 73'(VALID'
     A                                 14 58'TERMS ARE G,P,C,U,D)'
     A                                 16  3'TERMS'
     A            TM             2A  B 16  9DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            DISC           5A  B 16 12DSPATR(PR)
     A                                      OVRDTA
     A            TIMEOFDISC    18A  B 16 18DSPATR(PR)
     A                                      OVRDTA
     A                                 16 42'CURRENCY CODE'
     A            CC             2A  B 16 56DSPATR(PR)
     A                                      OVRDTA
     A            CURCODE       12A  B 16 59DSPATR(PR)
     A                                      OVRDTA
     A                                 18  3'REQUISITION NO.'
     A            REQNUM        12A  B 18 19DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                 18 36'RECEIVING DEPT.'
     A            RCVDEP         6A  B 18 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A            A              1A  B 20  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A                                 20  6'ALTERNATE REMIT ADDRESS'
     A                                 20 36'INVOICELESS PO.'
     A            INVPO          1A  B 20 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  59                                  DSPATR(RI)
     A  59                                  DSPATR(PC)
     A                                 20 58'NO-CHECK'
     A            NOCHK          1A  B 20 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-PO COMPLETE')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
DCR  A*==============================================================
DCR  A            FMT           10A  H
DCR  A            FLD           10A  H
DCR  A*==============================================================
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R PURORD4
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 15'STANDARD INSTRUCTION AND CONFIRMIN-
     A                                      G ORDER SELECTION'
     A                                  1 75'PU1-4'
     A                                  2  4'PO'
     A                                  3  7'CONFIRMING ORDER'
     A                                  3 31'CONFIRMING ORDER FREE VERBAGE (OPT-
     A                                      IONAL)'
     A                                  5  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -'
     A                                  6  3': STD INSTRUCTIONS (BEFORE ITEMS)'
     A                                  6 38':  STD INSTRUCTIONS (AFTER ITEMS)'
     A                                  6 72':'
     A                                  7  3':'
     A                                  7 38':'
     A                                  7 72':'
     A                                  8  3': RCV INSTRUCTIONS (BEFORE ITEMS) -
     A                                       :  RCV INSTRUCTIONS (AFTER ITEMS) -
     A                                      :'
     A                                  9  3':'
     A                                  9 38':'
     A                                  9 72':'
     A                                 10  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -'
     A                                 11  2'NUMBER'
     A                                 11 12'FIRST LINE OF STANDARD INSTRUCTION-
     A                                      S (* = RCV INSTRUCTION)'
     A                                 12  2'------'
     A                                 22  1'PRESS "ENTER" TO PROCESS SELECTION-
     A                                      S'
     A            CCC            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B  2  7DSPATR(PR)
     A                                      OVRDTA
     A            REL            3A  B  2 15DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  3 24DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES(' ' 'X')
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            CONFVERB      34A  B  4 33DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            IN1            3A  B  7  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            IN2            3A  B  7 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            IN3            3A  B  7 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            IN4            3A  B  7 20DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            IN5            3A  B  7 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            IN6            3A  B  7 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            IN7            3A  B  7 41DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            IN8            3A  B  7 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            IN9            3A  B  7 51DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A            I10            3A  B  7 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A            I11            3A  B  7 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A            I12            3A  B  7 66DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A            RCV1           3A  B  9  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A            RCV2           3A  B  9 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            RCV3           3A  B  9 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A            RCV4           3A  B  9 20DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            RCV5           3A  B  9 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A            RCV6           3A  B  9 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A            RCV7           3A  B  9 41DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  66                                  DSPATR(RI)
     A  66                                  DSPATR(PC)
     A            RCV8           3A  B  9 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  67                                  DSPATR(RI)
     A  67                                  DSPATR(PC)
     A            RCV9           3A  B  9 51DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  68                                  DSPATR(RI)
     A  68                                  DSPATR(PC)
     A            RCV10          3A  B  9 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  69                                  DSPATR(RI)
     A  69                                  DSPATR(PC)
     A            RCV11          3A  B  9 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  70                                  DSPATR(RI)
     A  70                                  DSPATR(PC)
     A            RCV12          3A  B  9 66DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  71                                  DSPATR(RI)
     A  71                                  DSPATR(PC)
     A            FLD001         1   B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            S1             3A  B 13  3DSPATR(PR)
     A                                      OVRDTA
     A            STDINST1      72A  B 13  8DSPATR(PR)
     A                                      OVRDTA
     A            FLD002         1   B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            S2             3A  B 14  3DSPATR(PR)
     A                                      OVRDTA
     A            STDINST2      72A  B 14  8DSPATR(PR)
     A                                      OVRDTA
     A            FLD003         1   B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            S3             3A  B 15  3DSPATR(PR)
     A                                      OVRDTA
     A            STDINST3      72A  B 15  8DSPATR(PR)
     A                                      OVRDTA
     A            FLD004         1   B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            S4             3A  B 16  3DSPATR(PR)
     A                                      OVRDTA
     A            STDINST4      72A  B 16  8DSPATR(PR)
     A                                      OVRDTA
     A            FLD005         1   B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            S5             3A  B 17  3DSPATR(PR)
     A                                      OVRDTA
     A            STDINST5      72A  B 17  8DSPATR(PR)
     A                                      OVRDTA
     A            FLD006         1   B 18  1DSPATR(PR)
     A                                      OVRDTA
     A            S6             3A  B 18  3DSPATR(PR)
     A                                      OVRDTA
     A            STDINST6      72A  B 18  8DSPATR(PR)
     A                                      OVRDTA
     A            FLD007         1   B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            S7             3A  B 19  3DSPATR(PR)
     A                                      OVRDTA
     A            STDINST7      72A  B 19  8DSPATR(PR)
     A                                      OVRDTA
     A            FLD008         1   B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            S8             3A  B 20  3DSPATR(PR)
     A                                      OVRDTA
     A            STDINST8      72A  B 20  8DSPATR(PR)
     A                                      OVRDTA
     A            SCREENMSG     68A  B 21  6DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-INSTRUCT AFTER')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A                                 12 12'-----------------------------------
     A                                      -----------------------'
     A          R PURORD5
     A          R TRACKSFL                  SFL
     A            EXPQTY        12Y 4B  7  2
     A N01                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            EXPDATE        8A  B  7 16
     A N01                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            EARLYDAYS      4Y 0B  7 26
     A N01                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            LATEDAYS       4Y 0B  7 32
     A N01                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            CARRIER        4A  B  7 38DSPATR(PR)
     A            DLVDATE        8A  B  7 44DSPATR(PR)
     A            DLVQTY        12Y 4B  7 54DSPATR(PR)
     A                                      EDTCDE(4)
     A            RCVR           3A  B  7 69DSPATR(PR)
     A            ACTION         1A  B  7 75
     A N01                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A                                      VALUES('Y' 'N' ' ')
     A            SEQUENCE       4Y 0B  7 77DSPATR(ND)
     A                                      DSPATR(PR)
     A          R TRACKSFLC                 SFLCTL(TRACKSFL)
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(0015)
     A                                      CF03
     A                                      CA09(09 'Add Record')
     A                                      OVERLAY
     A                                      PUTOVR
     A  70                                  SFLDSP
     A  71                                  SFLDSPCTL
     A  72                                  SFLCLR
     A  73                                  SFLEND(*MORE)
     A                                  5  4'EXPECTED'
     A                                  6  4'QUANTITY'
     A                                  5 16'EXPECTED'
     A                                  6 16'DATE'
     A                                  5 26'EARLY'
     A                                  6 26'DAYS'
     A                                  5 32'LATE'
     A                                  6 32'DAYS'
     A                                  6 37'CARRIER'
     A                                  5 44'DELIVERED'
     A                                  6 46'DATE'
     A                                  5 55'DELIVERED'
     A                                  6 55'QUANTITY'
     A                                  6 68'RCVR'
     A                                  5 73'ACTION'
     A                                  6 73'(Y/N)'
     A                                  1  2'PO:'
     A            PO            13A  B  1  6DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4A  B  1 21DSPATR(PR)
     A                                      OVRDTA
     A                                  1 27'VENDOR:'
     A            VENDORNAME    44A  B  1 35DSPATR(PR)
     A                                      OVRDTA
     A                                  2  2'CORP CODE:'
     A            CORPCODE       8A  B  2 13DSPATR(PR)
     A                                      OVRDTA
     A            KWRDMOD       50A  B  3  2DSPATR(PR)
     A                                      OVRDTA
     A            DATEFMT        3A  B  6 21DSPATR(PR)
     A                                      OVRDTA
     A          R TRACKFUNC
     A                                      PUTOVR
     A            LINE1         78   B 23  2DSPATR(PR)
     A                                      OVRDTA
     A  99        MSGLINE       79   M      OVRDTA
