     A*%%TS  DD  19951017  125936  T881S32     REL-V3R1M0  5763-CD1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A  97                                  INVITE
     A                                      HELP
     A                                      PRINT
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A                                      CF10
     A                                      CF11
     A                                      CF12
     A          R VPWOQUE
     A*%%TS  DD  19951017  125936  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A          H                           HLPARA(1 1 24 80)
     A                                      HLPRCD(HELP00)
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  6'P L A N N E D   W O R K O R D E R -
     A                                        Q U E U E   F O R   Z O N E'
     A            ZONE           4A  B  2 72DSPATR(PR)
     A                                      OVRDTA
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2'QUEUE'
     A                                  4 25'LIST SORTED BY:'
     A            SORTKEY       12A  B  4 42DSPATR(PR)
     A                                      OVRDTA
     A                                  4 68'IP SD OR CW'
     A                                  5  2'FACTOR  WO NUMBER  STATUS  DESCRIP-
     A                                      TION                    EQUIP.   DA-
     A                                      TE'
     A                                  6  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A            Q01            2A  B  7  3DSPATR(PR)
     A                                      OVRDTA
     A            I01            1A  B  7  8DSPATR(UL)
     A                                      OVRDTA
     A            W01           10A  B  7 10DSPATR(PR)
     A                                      OVRDTA
     A            S01            2A  B  7 23DSPATR(PR)
     A                                      OVRDTA
     A            D01           30A  B  7 28DSPATR(PR)
     A                                      OVRDTA
     A            E01            6A  B  7 60DSPATR(PR)
     A                                      OVRDTA
     A            DT01          11A  B  7 68DSPATR(PR)
     A                                      OVRDTA
     A            Q02            2A  B  8  3DSPATR(PR)
     A                                      OVRDTA
     A            I02            1A  B  8  8DSPATR(UL)
     A                                      OVRDTA
     A            W02           10A  B  8 10DSPATR(PR)
     A                                      OVRDTA
     A            S02            2A  B  8 23DSPATR(PR)
     A                                      OVRDTA
     A            D02           30A  B  8 28DSPATR(PR)
     A                                      OVRDTA
     A            E02            6A  B  8 60DSPATR(PR)
     A                                      OVRDTA
     A            DT02          11A  B  8 68DSPATR(PR)
     A                                      OVRDTA
     A            Q03            2A  B  9  3DSPATR(PR)
     A                                      OVRDTA
     A            I03            1A  B  9  8DSPATR(UL)
     A                                      OVRDTA
     A            W03           10A  B  9 10DSPATR(PR)
     A                                      OVRDTA
     A            S03            2A  B  9 23DSPATR(PR)
     A                                      OVRDTA
     A            D03           30A  B  9 28DSPATR(PR)
     A                                      OVRDTA
     A            E03            6A  B  9 60DSPATR(PR)
     A                                      OVRDTA
     A            DT03          11A  B  9 68DSPATR(PR)
     A                                      OVRDTA
     A            Q04            2A  B 10  3DSPATR(PR)
     A                                      OVRDTA
     A            I04            1A  B 10  8DSPATR(UL)
     A                                      OVRDTA
     A            W04           10A  B 10 10DSPATR(PR)
     A                                      OVRDTA
     A            S04            2A  B 10 23DSPATR(PR)
     A                                      OVRDTA
     A            D04           30A  B 10 28DSPATR(PR)
     A                                      OVRDTA
     A            E04            6A  B 10 60DSPATR(PR)
     A                                      OVRDTA
     A            DT04          11A  B 10 68DSPATR(PR)
     A                                      OVRDTA
     A            Q05            2A  B 11  3DSPATR(PR)
     A                                      OVRDTA
     A            I05            1A  B 11  8DSPATR(UL)
     A                                      OVRDTA
     A            W05           10A  B 11 10DSPATR(PR)
     A                                      OVRDTA
     A            S05            2A  B 11 23DSPATR(PR)
     A                                      OVRDTA
     A            D05           30A  B 11 28DSPATR(PR)
     A                                      OVRDTA
     A            E05            6A  B 11 60DSPATR(PR)
     A                                      OVRDTA
     A            DT05          11A  B 11 68DSPATR(PR)
     A                                      OVRDTA
     A            Q06            2A  B 12  3DSPATR(PR)
     A                                      OVRDTA
     A            I06            1A  B 12  8DSPATR(UL)
     A                                      OVRDTA
     A            W06           10A  B 12 10DSPATR(PR)
     A                                      OVRDTA
     A            S06            2A  B 12 23DSPATR(PR)
     A                                      OVRDTA
     A            D06           30A  B 12 28DSPATR(PR)
     A                                      OVRDTA
     A            E06            6A  B 12 60DSPATR(PR)
     A                                      OVRDTA
     A            DT06          11A  B 12 68DSPATR(PR)
     A                                      OVRDTA
     A            Q07            2A  B 13  3DSPATR(PR)
     A                                      OVRDTA
     A            I07            1A  B 13  8DSPATR(UL)
     A                                      OVRDTA
     A            W07           10A  B 13 10DSPATR(PR)
     A                                      OVRDTA
     A            S07            2A  B 13 23DSPATR(PR)
     A                                      OVRDTA
     A            D07           30A  B 13 28DSPATR(PR)
     A                                      OVRDTA
     A            E07            6A  B 13 60DSPATR(PR)
     A                                      OVRDTA
     A            DT07          11A  B 13 68DSPATR(PR)
     A                                      OVRDTA
     A            Q08            2A  B 14  3DSPATR(PR)
     A                                      OVRDTA
     A            I08            1A  B 14  8DSPATR(UL)
     A                                      OVRDTA
     A            W08           10A  B 14 10DSPATR(PR)
     A                                      OVRDTA
     A            S08            2A  B 14 23DSPATR(PR)
     A                                      OVRDTA
     A            D08           30A  B 14 28DSPATR(PR)
     A                                      OVRDTA
     A            E08            6A  B 14 60DSPATR(PR)
     A                                      OVRDTA
     A            DT08          11A  B 14 68DSPATR(PR)
     A                                      OVRDTA
     A            Q09            2A  B 15  3DSPATR(PR)
     A                                      OVRDTA
     A            I09            1A  B 15  8DSPATR(UL)
     A                                      OVRDTA
     A            W09           10A  B 15 10DSPATR(PR)
     A                                      OVRDTA
     A            S09            2A  B 15 23DSPATR(PR)
     A                                      OVRDTA
     A            D09           30A  B 15 28DSPATR(PR)
     A                                      OVRDTA
     A            E09            6A  B 15 60DSPATR(PR)
     A                                      OVRDTA
     A            DT09          11A  B 15 68DSPATR(PR)
     A                                      OVRDTA
     A            Q10            2A  B 16  3DSPATR(PR)
     A                                      OVRDTA
     A            I10            1A  B 16  8DSPATR(UL)
     A                                      OVRDTA
     A            W10           10A  B 16 10DSPATR(PR)
     A                                      OVRDTA
     A            S10            2A  B 16 23DSPATR(PR)
     A                                      OVRDTA
     A            D10           30A  B 16 28DSPATR(PR)
     A                                      OVRDTA
     A            E10            6A  B 16 60DSPATR(PR)
     A                                      OVRDTA
     A            DT10          11A  B 16 68DSPATR(PR)
     A                                      OVRDTA
     A            Q11            2A  B 17  3DSPATR(PR)
     A                                      OVRDTA
     A            I11            1A  B 17  8DSPATR(UL)
     A                                      OVRDTA
     A            W11           10A  B 17 10DSPATR(PR)
     A                                      OVRDTA
     A            S11            2A  B 17 23DSPATR(PR)
     A                                      OVRDTA
     A            D11           30A  B 17 28DSPATR(PR)
     A                                      OVRDTA
     A            E11            6A  B 17 60DSPATR(PR)
     A                                      OVRDTA
     A            DT11          11A  B 17 68DSPATR(PR)
     A                                      OVRDTA
     A            Q12            2A  B 18  3DSPATR(PR)
     A                                      OVRDTA
     A            I12            1A  B 18  8DSPATR(UL)
     A                                      OVRDTA
     A            W12           10A  B 18 10DSPATR(PR)
     A                                      OVRDTA
     A            S12            2A  B 18 23DSPATR(PR)
     A                                      OVRDTA
     A            D12           30A  B 18 28DSPATR(PR)
     A                                      OVRDTA
     A            E12            6A  B 18 60DSPATR(PR)
     A                                      OVRDTA
     A            DT12          11A  B 18 68DSPATR(PR)
     A                                      OVRDTA
     A            Q13            2A  B 19  3DSPATR(PR)
     A                                      OVRDTA
     A            D13            1A  B 19  8DSPATR(UL)
     A                                      OVRDTA
     A            W13           10A  B 19 10DSPATR(PR)
     A                                      OVRDTA
     A            S13            2A  B 19 23DSPATR(PR)
     A                                      OVRDTA
     A            DC            30A  B 19 28DSPATR(PR)
     A                                      OVRDTA
     A            EC             6A  B 19 60DSPATR(PR)
     A                                      OVRDTA
     A            DT13          11A  B 19 68DSPATR(PR)
     A                                      OVRDTA
     A            Q14            2A  B 20  3DSPATR(PR)
     A                                      OVRDTA
     A            D14            1A  B 20  8DSPATR(UL)
     A                                      OVRDTA
     A            W14           10A  B 20 10DSPATR(PR)
     A                                      OVRDTA
     A            S14            2A  B 20 23DSPATR(PR)
     A                                      OVRDTA
     A            DD            30A  B 20 28DSPATR(PR)
     A                                      OVRDTA
     A            ED             6A  B 20 60DSPATR(PR)
     A                                      OVRDTA
     A            DT14          11A  B 20 68DSPATR(PR)
     A                                      OVRDTA
     A                                 21  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                 22  2'TYPE "X" BY WO, PRESS ENTER TO DIS-
     A                                      PLAY   f7-PRINT LIST   f6/ENTER - P-
     A                                      AGE AHEAD'
     A                                 23  2'f5-PAGE BACK    RE-SORT LIST:  f9--
     A                                      QF  f10-EQUIPMENT  f11-STATUS  f12--
     A                                      WORKORDER'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('F1=CHANGE SORT KEY   F3/F8-EXI-
     A                                      T               PRESS "ENTER" FOR N-
     A                                      EXT SCREEN')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VPWOQSEL
     A*%%TS  DD  19951017  125936  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A          H                           HLPRCD(HELP00)
     A                                      HLPARA(1 1 24 80)
     A                                  2  3'PLANNED WORKORDER INQUIRY SELECTIO-
     A                                      N SCREEN'
     A                                  4 18'ENTER ZONE:'
     A            ZONE           4A  B  4 31DSPATR(UL)
     A  01                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  4 38'ENTER ''ALL'' FOR ALL ZONES.'
     A                                  6  3'INCLUDE WORKORDER STATUSES:'
     A                                  6 34'(SELECT ALL DESIRED.   * IS DEFAUL-
     A                                      T)'
     A            S1             1A  B  7  5DSPATR(UL)
     A  02                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  7  7'''OO'' STATUS - OPEN ORDER'
     A            S5             1A  B  7 44DSPATR(UL)
     A                                      OVRDTA
     A                                  7 46'''HA'' STATUS - HOLD FOR APPROVAL'
     A                                  9  3'*'
     A            S2             1A  B  9  5DSPATR(UL)
     A                                      OVRDTA
     A                                  9  7'''IP'' STATUS - IN-PROGRESS'
     A            S6             1A  B  9 44DSPATR(UL)
     A                                      OVRDTA
     A                                  9 46'''HL'' STATUS - HOLD FOR LABOR'
     A                                 11  3'*'
     A            S3             1A  B 11  5DSPATR(UL)
     A                                      OVRDTA
     A                                 11  7'''SD'' STATUS - SCHEDULED'
     A            S7             1A  B 11 44DSPATR(UL)
     A                                      OVRDTA
     A                                 11 46'''HM'' STATUS - HOLD FOR MATERIAL'
     A            S4             1A  B 13  5DSPATR(UL)
     A                                      OVRDTA
     A                                 13  7'''HS'' STATUS - HOLD FOR SCHEDULIN-
     A                                      G'
     A                                 13 44'PLUS OTHER:'
     A            ST1            2A  B 13 57DSPATR(UL)
     A  03                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            ST2            2A  B 13 61DSPATR(UL)
     A  04                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            ST3            2A  B 13 65DSPATR(UL)
     A  05                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            ST4            2A  B 13 69DSPATR(UL)
     A  06                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            ST5            2A  B 13 73DSPATR(UL)
     A  07                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 15 49'INCLUDE PM WORKORDERS:'
     A            PM             1A  B 15 73DSPATR(UL)
     A                                      OVRDTA
     A                                 16  3'SORT BY:'
     A                                 16 13'(SELECT ONLY ONE)'
     A                                 16 52'PM WORKORDERS ONLY:'
     A            PMO            1A  B 16 73DSPATR(UL)
     A                                      OVRDTA
     A            SORT1          1A  B 17  5DSPATR(UL)
     A                                      OVRDTA
     A                                 17  8'QUEUE FACTOR/STATUS/WORKORDER (DEF-
     A                                      AULT)'
     A            SORT3          1A  B 18  5DSPATR(UL)
     A                                      OVRDTA
     A                                 18  8'EQUIPMENT/WORKORDER'
     A                                 18 53'=================='
     A            SORT4          1A  B 19  5DSPATR(UL)
     A                                      OVRDTA
     A                                 19  8'STATUS/QUEUE FACTOR/WORKORDER'
     A                                 19 53'SELECT OPTIONS AND'
     A            SORT2          1A  B 20  5DSPATR(UL)
     A                                      OVRDTA
     A                                 20  8'WORKORDER'
     A                                 20 53'PRESS "ENTER" KEY.'
     A                                 21 53'=================='
     A                                 22 10'ENTER ''X'' FOR SELECTIONS DESIRED-
     A                                      , LEAVE BLANK FOR NO-SELECTION.'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('     f3/f8 - EXIT PROGRAM     -
     A                                       f5 - REFRESH TO DEFAULT ENTRIES')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A*%%CP+999CRTDSPF
     A*%%CP+    FILE(MCTST/ZPWOQUE)
     A*%%CP+    SRCFILE(MCTST/QDDSSRC)
     A*%%CP+    SRCMBR(ZPWOQUE)
     A*%%CP+    TEXT(*SRCMBRTXT)
     A*%%CP     RSTDSP(*YES)
