     A                                      DSPSIZ(24 80 *DS3)
     A                                      INDARA
     A                                      PRINT
     A                                      CHGINPDFT
     A          R VPWOMAIN
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 11'W O R K O R D E R   S T A T U S'
     A                                  2 45'U P D A T E   P R O G R A M'
     A                                  2 79':'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  4  1':'
     A                                  4 79':'
     A                                  5  1':'
     A                                  5 79':'
     A                                  6  1':'
     A                                  6 79':'
     A                                  7  1':'
     A                                  7 79':'
     A                                  8  1':'
     A                                  8 79':'
     A                                  9  1':'
     A                                  9 79':'
     A                                 10  1':'
     A                                 10 79':'
     A                                 11  1':'
     A                                 11 79':'
     A                                 12  1':'
     A                                 12 79':'
     A                                 13  1':'
     A                                 13 79':'
     A                                 14  1':'
     A                                 14 79':'
     A                                 15  1':'
     A                                 15 79':'
     A                                 16  1':'
     A                                 16 79':'
     A                                 17  1':'
     A                                 17 79':'
     A                                 18  1':'
     A                                 18 79':'
     A                                 19  1':'
     A                                 19 79':'
     A                                 20  1':'
     A                                 20 79':'
     A                                 21  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 22  1':     ENTER WO NUMBERS TO CHANGE S-
     A                                      TATUS FROM '
     A                                 22 50' TO'
     A                                 22 58' AND PRESS "ENTER"'
     A                                 22 79':'
     A                                 23  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            W1            10A  B  5  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            W2            10A  B  5 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            W3            10A  B  5 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            W4            10A  B  5 51DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            W5            10A  B  5 66DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            W6            10A  B  7  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            W7            10A  B  7 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            W8            10A  B  7 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            W9            10A  B  7 51DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            W10           10A  B  7 66DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            W11           10A  B  9  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            W12           10A  B  9 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            W13           10A  B  9 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            W14           10A  B  9 51DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            W15           10A  B  9 66DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            W16           10A  B 11  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            W17           10A  B 11 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            W18           10A  B 11 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            W19           10A  B 11 51DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            W20           10A  B 11 66DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            W21           10A  B 13  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            W22           10A  B 13 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            W23           10A  B 13 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            W24           10A  B 13 51DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            W25           10A  B 13 66DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            W26           10A  B 15  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            W27           10A  B 15 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            W28           10A  B 15 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            W29           10A  B 15 51DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            W30           10A  B 15 66DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            W31           10A  B 17  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            W32           10A  B 17 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            W33           10A  B 17 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            W34           10A  B 17 51DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            W35           10A  B 17 66DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            W36           10A  B 19  6DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            W37           10A  B 19 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            W38           10A  B 19 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            W39           10A  B 19 51DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A            W40           10A  B 19 66DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            OST            2A  B 22 47DSPATR(PR)
     A                                      OVRDTA
     A            NST            2A  B 22 55DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-CHANGE STATUS f2-ERASE S-
     A                                      CREEN                f3-EXIT PROGRA-
     A                                      M                ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R VPWOSTAT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  6 11'-----------------------------------
     A                                      ----------------------'
     A                                  7 11':     M A S S   P L A N N E D   W'
     A                                  7 45'O R K O R D E R      :'
     A                                  8 11':'
     A                                  8 66':'
     A                                  9 11':'
     A                                  9 25'S T A T U S   C H A N G E'
     A                                  9 66':'
     A                                 10 11'-----------------------------------
     A                                      ----------------------'
     A                                 11 11':'
     A                                 11 66':'
     A                                 12 11':      CHANGE STATUS FROM:'
     A                                 12 43'(CURRENT STATUS)'
     A                                 12 66':'
     A                                 13 11':'
     A                                 13 66':'
     A                                 14 11':'
     A                                 14 22'TO NEXT STATUS:'
     A                                 14 43'(NEW STATUS)'
     A                                 14 66':'
     A                                 15 11':'
     A                                 15 66':'
     A                                 16 11'-----------------------------------
     A                                      ----------------------'
     A            S1             2A  B 12 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            S2             2A  B 14 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT PROGRAM            -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
