     A*%%TS  SD  19961030  142857  A193138     REL-V3R6M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A  98                                  INVITE
     A          R ADD
     A*%%TS  SD  19961030  142857  A193138     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  9'R E C E I V I N G   I N S T R U C -
     A                                      T I O N   A D D I T I O N'
     A                                  3  1'INSTRUCTION NUMBER'
     A                                  5  2'RECEIVING INSTRUCTION'
     A                                  5 37'*STOP HERE IF EXPANDED PRINT'
     A                                 11  1'IF ADDITIONAL LINES ARE NEEDED, KE-
     A                                      Y "X" AND PRESS "ENTER"'
     A                                 13  1'ENTER "E" FOR EXPANDED PRINT, "C"'
     A                                 13 35'FOR COMPRESSED PRINT'
     A                                 14  1'(DEFAULT IS REGULAR SIZED PRINT)'
     A                                 18  1'ENTER THE INSTRUCTION NUMBER THAT'
     A                                 18 35'WILL REFERENCE THIS INSTRUCTION AN-
     A                                      D THE'
     A                                 19  1'INSTRUCTION ITSELF.  THEN DEPRESS'
     A                                 19 35'"ENTER".  DEPRESS "F3" TO EXIT WIT-
     A                                      H NO'
     A                                 20  1'PROCESSING PERFORMED.'
     A            NUM            3A  B  3 20DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            FIRST1        36A  B  6  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            LAST1         36A  B  6 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            FIRST2        36A  B  7  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            LAST2         36A  B  7 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            FIRST3        36A  B  8  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            LAST3         36A  B  8 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            FIRST4        36A  B  9  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            LAST4         36A  B  9 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            X              1A  B 11 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            P              1A  B 13 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R DELETE
     A*%%TS  SD  19961030  142857  A193138     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 13'R E C E I V I N G   I N S T R U C -
     A                                      T I O N  D E L E T E'
     A                                  4  8'ENTER THE INSTRUCTION NUMBER TO DE-
     A                                      LETE AND DEPRESS "ENTER"'
     A                                 20  8'DEPRESS "f3" TO END DELETE'
     A            NUM            3A  B  4 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INQUIRE
     A*%%TS  SD  19961030  142857  A193138     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 11'R E C E I V I N G   I N S T R U C -
     A                                      T I O N   I N Q U I R Y'
     A                                  4  3'-----------------------  INSTRUCTI-
     A                                      ON'
     A                                  4 44'-------------------------------'
     A                                 22  3'DEPRESS "f7" TO SUBMIT NEXT INSTRU-
     A                                      CTION NUMBER; "f3" TO END INQUIRY'
     A            PRINT         16A  B  3  3DSPATR(PR)
     A                                      OVRDTA
     A            NUM            3A  B  4 40DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTIO    72A  B  6  3DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTI2    72A  B  7  3DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTI3    72A  B  8  3DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTI4    72A  B  9  3DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTI5    72A  B 10  3DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTI6    72A  B 11  3DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTI7    72A  B 12  3DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTI8    72A  B 13  3DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTI9    72A  B 14  3DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTIA    72A  B 15  3DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTIB    72A  B 16  3DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTIC    72A  B 17  3DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTID    72A  B 18  3DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTIE    72A  B 19  3DSPATR(PR)
     A                                      OVRDTA
     A            CONTINUE      72A  B 21  3DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R MAININQ
     A*%%TS  SD  19961030  142857  A193138     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 11'R E C E I V I N G   I N S T R U C -
     A                                      T I O N   I N Q U I R Y'
     A                                  4 13'ENTER THE INSTRUCTION NUMBER AND P-
     A                                      RESS "ENTER"'
     A            NUM            3A  B  4 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R MAINMENU
     A*%%TS  SD  19961030  142857  A193138     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 20'R E C E I V I N G   S T A N D A R -
     A                                      D'
     A                                  3 26'I N S T R U C T I O N S'
     A                                  7 21'"F1" KEY--INQUIRE RECEIVING INSTRU-
     A                                      CTIONS'
     A                                  9 21'"F2" KEY--ADD     RECEIVING INSTRU-
     A                                      CTIONS'
     A                                 11 21'"F8" KEY--MODIFY  RECEIVING INSTRU-
     A                                      CTIONS'
     A                                 13 21'"F4" KEY--DELETE  RECEIVING INSTRU-
     A                                      CTIONS'
     A                                 15 21'"F3" KEY--END PROGRAM'
     A                                 19 15'PRESS APPROPRIATE KEY TO DO DESIRE-
     A                                      D FUNCTION'
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R MODIFY
     A*%%TS  SD  19961030  142857  A193138     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  8'R E C E I V I N G   I N S T R U C -
     A                                      T I O N   M O D I F I C A T I O N'
     A                                  3 14'INSTRUCTION NUMBER'
     A                                  8  2'RECEIVING INSTRUCTION'
     A                                  8 37'*STOP HERE IF EXPANDED PRINT'
     A                                 14  1'IF ADDITIONAL LINES ARE NEEDED, KE-
     A                                      Y "X" AND PRESS "ENTER"'
     A            NUM            3A  B  3 34DSPATR(PR)
     A                                      OVRDTA
     A            PRINT         16A  B  6  1DSPATR(PR)
     A                                      OVRDTA
     A            FIRST1        36A  B  9  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            LAST1         36A  B  9 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            FIRST2        36A  B 10  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            LASTT2        36A  B 10 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            FIRST3        36A  B 11  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            LAST3         36A  B 11 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            FIRST4        36A  B 12  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            LAST4         36A  B 12 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            X              1A  B 14 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R MODIFYNUM
     A*%%TS  SD  19961030  142857  A193138     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  8'R E C E I V I N G   I N S T R U C -
     A                                      T I O N   M O D I F I C A T I O N'
     A                                  5  1'ENTER INSTRUCTION NUMBER AND PRESS'
     A                                  5 36'"ENTER"'
     A                                 21  2'DEPRESS "f3" TO END MODIFY'
     A            NUM            3A  B  5 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R DELETE2
     A*%%TS  SD  19961030  142857  A193138     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 13'R E C E I V I N G   I N S T R U C -
     A                                      T I O N  D E L E T E'
     A                                  4  8'ENTER THE INSTRUCTION NUMBER TO DE-
     A                                      LETE AND DEPRESS "ENTER"'
     A                                 20  8'DEPRESS "f3" TO END DELETE'
     A            NUM            3A  B  4 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
