     A*%%TS  SD  19950130  084033  T881S03     REL-V3R1M0  5763-PW1
     A*  89/05/03  10:54:20    T881S28     REL-R01M02  5728-PW1
     A*            13:02:39    T881S28     ZREQDESC
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT(LC)
     A                                      INDARA
     A                                      PRINT
     A*  89/05/02  10:42:16    T881S28     REL-R01M02  5728-PW1
     A          R RDSF                      SFL
     A*%%TS  SD  19950130  084033  T881S03     REL-V3R1M0  5763-PW1
     A            DESCID         2A  H
     A            DESCRIPT      78A  B  3  2DSPATR(UL)
     A*  89/05/03  10:54:20    T881S28     REL-R01M02  5728-PW1
     A          R RDSC                      SFLCTL(RDSF)
     A*%%TS  SD  19950130  084033  T881S03     REL-V3R1M0  5763-PW1
     A                                      CF03(03)
     A                                      OVERLAY
     A  75                                  SFLDSP
     A  76                                  SFLDSPCTL
     A  77                                  SFLCLR
     A N74                                  SFLEND(*MORE)
     A                                      SFLSIZ(0020)
     A                                      SFLPAG(0019)
     A                                  1 13'Requisition Full Description Inqui-
     A                                      ry / Modify'
     A                                  2  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A*  89/05/02  10:42:16    T881S28     REL-R01M02  5728-PW1
     A          R RDSF2                     SFL
     A*%%TS  SD  19950130  084033  T881S03     REL-V3R1M0  5763-PW1
     A            DESCID         2A  H
     A            DESCRIPT      78A  B  3  2DSPATR(PR)
     A          R RDSC2                     SFLCTL(RDSF2)
     A*  89/05/03  10:54:20    T881S28     REL-R01M02  5728-PW1
     A                                      SFLSIZ(20)
     A                                      SFLPAG(0019)
     A                                      CF03(03)
     A                                      OVERLAY
     A  75                                  SFLDSP
     A  76                                  SFLDSPCTL
     A  77                                  SFLCLR
     A N74                                  SFLEND
     A                                  1 13'Requisition Full Description Inqui-
     A                                      ry         '
     A                                  2  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A          R RDSB
     A*%%TS  SD  19950130  084033  T881S03     REL-V3R1M0  5763-PW1
     A                                 24  1'F3 TO END, ROLLUP, ROLLDOWN      '
