     A*%%TS  SD  19980305  124950  A193138     REL-V3R7M0  5716-PW1
     A*  90/07/30  16:09:04    A171523     REL-R02M00  5728-PW1
     A*            21:59:09    T881S28     VRMCORR.HPTO38.CME
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A          R FBLKTINQ
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 20'- - -   I T E M   S T A T U S  - -'
     A                                  1 55'-'
     A                                  1 75'MQ1-6'
     A                                  2 22'REQUIREMENTS ORDER INQUIRY SCREEN'
     A                                  3  1'CODE'
     A                                  5  5'PO NUMBER   ITEM #   UM     REQUIR-
     A                                      EMENT DATE      EXPIRATION DATE'
     A                                  6  5'---------   ------   --     -------
     A                                      ----------      ---------------'
     A                                 21  1'DEPRESS  "f1"  FOR BASIC INQUIRY F-
     A                                      IELDS      "f5"  TO PRINT THIS SCRE-
     A                                      EN'
     A                                 22 10'"f2"  FOR MORE INQUIRY FIELDS'
     A                                 22 46'"f6"  FOR RESERVATION INQUIRY'
     A                                 23 10'"f7"  TO PREPARE FOR NEXT INQUIRY'
     A                                 23 46'"f3"  TO END PROGRAM'
     A            COM            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            STRCODE        7A  B  3  6DSPATR(PR)
     A                                      OVRDTA
     A            PONUM1         7A  B  7  5DSPATR(PR)
     A                                      OVRDTA
     A            IT1            5A  B  7 17DSPATR(PR)
     A                                      OVRDTA
     A            U1             2A  B  7 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE1        8A  B  7 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE1        8A  B  7 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM2         7A  B  8  5DSPATR(PR)
     A                                      OVRDTA
     A            IT2            5A  B  8 17DSPATR(PR)
     A                                      OVRDTA
     A            U2             2A  B  8 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE2        8A  B  8 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE2        8A  B  8 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM3         7A  B  9  5DSPATR(PR)
     A                                      OVRDTA
     A            IT3            5A  B  9 17DSPATR(PR)
     A                                      OVRDTA
     A            U3             2A  B  9 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE3        8A  B  9 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE3        8A  B  9 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM4         7A  B 10  5DSPATR(PR)
     A                                      OVRDTA
     A            IT4            5A  B 10 17DSPATR(PR)
     A                                      OVRDTA
     A            U4             2A  B 10 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE4        8A  B 10 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE4        8A  B 10 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM5         7A  B 11  5DSPATR(PR)
     A                                      OVRDTA
     A            IT5            5A  B 11 17DSPATR(PR)
     A                                      OVRDTA
     A            U5             2A  B 11 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE5        8A  B 11 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE5        8A  B 11 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM6         7A  B 12  5DSPATR(PR)
     A                                      OVRDTA
     A            IT6            5A  B 12 17DSPATR(PR)
     A                                      OVRDTA
     A            U6             2A  B 12 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE6        8A  B 12 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE6        8A  B 12 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM7         7A  B 13  5DSPATR(PR)
     A                                      OVRDTA
     A            IT7            5A  B 13 17DSPATR(PR)
     A                                      OVRDTA
     A            U7             2A  B 13 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE7        8A  B 13 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE7        8A  B 13 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM8         7A  B 14  5DSPATR(PR)
     A                                      OVRDTA
     A            IT8            5A  B 14 17DSPATR(PR)
     A                                      OVRDTA
     A            U8             2A  B 14 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE8        8A  B 14 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE8        8A  B 14 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM9         7A  B 15  5DSPATR(PR)
     A                                      OVRDTA
     A            IT9            5A  B 15 17DSPATR(PR)
     A                                      OVRDTA
     A            U9             2A  B 15 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE9        8A  B 15 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE9        8A  B 15 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM10        7A  B 16  5DSPATR(PR)
     A                                      OVRDTA
     A            IT10           5A  B 16 17DSPATR(PR)
     A                                      OVRDTA
     A            U0             2A  B 16 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE10       8A  B 16 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE10       8A  B 16 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM11        7A  B 17  5DSPATR(PR)
     A                                      OVRDTA
     A            IT11           5A  B 17 17DSPATR(PR)
     A                                      OVRDTA
     A            M1             2A  B 17 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE11       8A  B 17 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE11       8A  B 17 59DSPATR(PR)
     A                                      OVRDTA
     A            MORE11MSG     69A  B 19  2DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FGETBLKT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 20'- - -   I T E M   S T A T U S  - -'
     A                                  1 55'-'
     A                                  1 75'MQ1-6'
     A                                  2 22'REQUIREMENTS ORDER INQUIRY SCREEN'
     A                                  3  1'CODE'
     A                                  5  5'PO NUMBER   ITEM #   UM     REQUIR-
     A                                      EMENT DATE      EXPIRATION DATE'
     A                                  6  5'---------   ------   --     -------
     A                                      ----------      ---------------'
     A                                 21  1'DEPRESS  "f1"  FOR BASIC INQUIRY F-
     A                                      IELDS      "f5"  TO PRINT THIS SCRE-
     A                                      EN'
     A                                 22 10'"f2"  FOR MORE INQUIRY FIELDS'
     A                                 22 46'"f6"  FOR P.O. INFO INSTRUCTIONS'
     A                                 23 10'"f7"  TO PREPARE FOR NEXT INQUIRY'
     A                                 23 46'"f3"  TO END PROGRAM'
     A            COM            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            STRCODE        7A  B  3  6DSPATR(PR)
     A                                      OVRDTA
     A            PONUM1         7A  B  7  5DSPATR(PR)
     A                                      OVRDTA
     A            IT1            5A  B  7 17DSPATR(PR)
     A                                      OVRDTA
     A            U1             2A  B  7 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE1        8A  B  7 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE1        8A  B  7 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM2         7A  B  8  5DSPATR(PR)
     A                                      OVRDTA
     A            IT2            5A  B  8 17DSPATR(PR)
     A                                      OVRDTA
     A            U2             2A  B  8 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE2        8A  B  8 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE2        8A  B  8 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM3         7A  B  9  5DSPATR(PR)
     A                                      OVRDTA
     A            IT3            5A  B  9 17DSPATR(PR)
     A                                      OVRDTA
     A            U3             2A  B  9 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE3        8A  B  9 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE3        8A  B  9 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM4         7A  B 10  5DSPATR(PR)
     A                                      OVRDTA
     A            IT4            5A  B 10 17DSPATR(PR)
     A                                      OVRDTA
     A            U4             2A  B 10 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE4        8A  B 10 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE4        8A  B 10 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM5         7A  B 11  5DSPATR(PR)
     A                                      OVRDTA
     A            IT5            5A  B 11 17DSPATR(PR)
     A                                      OVRDTA
     A            U5             2A  B 11 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE5        8A  B 11 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE5        8A  B 11 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM6         7A  B 12  5DSPATR(PR)
     A                                      OVRDTA
     A            IT6            5A  B 12 17DSPATR(PR)
     A                                      OVRDTA
     A            U6             2A  B 12 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE6        8A  B 12 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE6        8A  B 12 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM7         7A  B 13  5DSPATR(PR)
     A                                      OVRDTA
     A            IT7            5A  B 13 17DSPATR(PR)
     A                                      OVRDTA
     A            U7             2A  B 13 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE7        8A  B 13 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE7        8A  B 13 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM8         7A  B 14  5DSPATR(PR)
     A                                      OVRDTA
     A            IT8            5A  B 14 17DSPATR(PR)
     A                                      OVRDTA
     A            U8             2A  B 14 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE8        8A  B 14 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE8        8A  B 14 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM9         7A  B 15  5DSPATR(PR)
     A                                      OVRDTA
     A            IT9            5A  B 15 17DSPATR(PR)
     A                                      OVRDTA
     A            U9             2A  B 15 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE9        8A  B 15 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE9        8A  B 15 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM10        7A  B 16  5DSPATR(PR)
     A                                      OVRDTA
     A            IT10           5A  B 16 17DSPATR(PR)
     A                                      OVRDTA
     A            U0             2A  B 16 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE10       8A  B 16 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE10       8A  B 16 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM11        7A  B 17  5DSPATR(PR)
     A                                      OVRDTA
     A            IT11           5A  B 17 17DSPATR(PR)
     A                                      OVRDTA
     A            M1             2A  B 17 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE11       8A  B 17 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE11       8A  B 17 59DSPATR(PR)
     A                                      OVRDTA
     A            MORE11MSG     69A  B 19  2DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FMTLSTAT1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 19'- - -  I T E M   S T A T U S - - -'
     A                                  1 74'MQ1-1'
     A                                 23  1'DEPRESS  "f3"  TO END PROGRAM'
     A            COMP           4A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            STRCODE       12A  B  3  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            INSTRUCTLI    65A  B  3 15DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTL2    65A  B  4 15DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTL3    65A  B  5 15DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTL4    65A  B  6 15DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FMTLSTAT1B
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 20'- - -  I T E M   S T A T U S  - -'
     A                                  1 54'-'
     A                                  1 75'MQ1-1B'
     A                                  6  7'O V E R A L L   D A T A   B A S E'
     A                                  6 43'O N H A N D   I N Q U I R Y'
     A                                  8 13'P L A N T 1   P L A N T 2   P L A'
     A                                  8 47'N T 3   P L A N T 5   P L A N T 9'
     A                                  9  1'LOC. 1'
     A                                 10  1'LOC. 2'
     A                                 11  1'LOC. 3'
     A                                 12  1'LOC. 4'
     A                                 13  1'ONHAND'
     A                                 14  1'STR UM'
     A                                 15  1'REQ. ORDER'
     A                                 16  2'ITEM NO.'
     A                                 17  2'ORDER UM'
     A                                 18  2'EXP. DATE'
     A                                 21  1'PRESS: "f1" FOR PLT1, "f2" FOR PLT-
     A                                      2, "f8" FOR PLT3, "f4" FOR PLT5, "f-
     A                                      6" FOR PLT9'
     A                                 22  8'"f5" TO PRINT SCREEN, "f7" TO ENTE-
     A                                      R NEXT CODE, "f3" TO END PROGRAM'
     A            COM            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            STRCODE        7A  B  3  1DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTLI    65A  B  3 10DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTL2    65A  B  4 10DSPATR(PR)
     A                                      OVRDTA
     A            LOC1PLT1      12A  B  9 12DSPATR(PR)
     A                                      OVRDTA
     A            LOC1PLT2      12A  B  9 26DSPATR(PR)
     A                                      OVRDTA
     A            LOC1PLT3      12A  B  9 40DSPATR(PR)
     A                                      OVRDTA
     A            LOC1PLT5      12A  B  9 54DSPATR(PR)
     A                                      OVRDTA
     A            LOC1PLT9      12A  B  9 68DSPATR(PR)
     A                                      OVRDTA
     A            LOC2PLT1      12A  B 10 12DSPATR(PR)
     A                                      OVRDTA
     A            LOC2PLT2      12A  B 10 26DSPATR(PR)
     A                                      OVRDTA
     A            LOC2PLT3      12A  B 10 40DSPATR(PR)
     A                                      OVRDTA
     A            LOC2PLT5      12A  B 10 54DSPATR(PR)
     A                                      OVRDTA
     A            LOC2PLT9      12A  B 10 68DSPATR(PR)
     A                                      OVRDTA
     A            LOC3PLT1      12A  B 11 12DSPATR(PR)
     A                                      OVRDTA
     A            LOC3PLT2      12A  B 11 26DSPATR(PR)
     A                                      OVRDTA
     A            LOC3PLT3      12A  B 11 40DSPATR(PR)
     A                                      OVRDTA
     A            LOC3PLT5      12A  B 11 54DSPATR(PR)
     A                                      OVRDTA
     A            LOC3PLT9      12A  B 11 68DSPATR(PR)
     A                                      OVRDTA
     A            LOC4PLT1      12A  B 12 12DSPATR(PR)
     A                                      OVRDTA
     A            LOC4PLT2      12A  B 12 26DSPATR(PR)
     A                                      OVRDTA
     A            LOC4PLT3      12A  B 12 40DSPATR(PR)
     A                                      OVRDTA
     A            LOC4PLT5      12A  B 12 54DSPATR(PR)
     A                                      OVRDTA
     A            LOC4PLT9      12A  B 12 68DSPATR(PR)
     A                                      OVRDTA
     A            ONHDPLT1       9A  B 13 15DSPATR(PR)
     A                                      OVRDTA
     A            ONHDPLT2       9A  B 13 29DSPATR(PR)
     A                                      OVRDTA
     A            ONHDPLT3       9A  B 13 43DSPATR(PR)
     A                                      OVRDTA
     A            ONHDPLT4       9A  B 13 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  66                                  DSPATR(RI)
     A  66                                  DSPATR(PC)
     A            ONHDPLT5       9A  B 13 71DSPATR(PR)
     A                                      OVRDTA
     A            U1             2A  B 14 22DSPATR(PR)
     A                                      OVRDTA
     A            U2             2A  B 14 36DSPATR(PR)
     A                                      OVRDTA
     A            U3             2A  B 14 50DSPATR(PR)
     A                                      OVRDTA
     A            U5             2A  B 14 64DSPATR(PR)
     A                                      OVRDTA
     A            U9             2A  B 14 78DSPATR(PR)
     A                                      OVRDTA
     A            REQORD1        7A  B 15 17DSPATR(PR)
     A                                      OVRDTA
     A            REQORD2        7A  B 15 31DSPATR(PR)
     A                                      OVRDTA
     A            REQORD3        7A  B 15 45DSPATR(PR)
     A                                      OVRDTA
     A            REQORD5        7A  B 15 59DSPATR(PR)
     A                                      OVRDTA
     A            REQORD9        7A  B 15 73DSPATR(PR)
     A                                      OVRDTA
     A            ITM1           4A  B 16 20DSPATR(PR)
     A                                      OVRDTA
     A            ITM2           4A  B 16 34DSPATR(PR)
     A                                      OVRDTA
     A            ITM3           4A  B 16 48DSPATR(PR)
     A                                      OVRDTA
     A            ITM5           4A  B 16 62DSPATR(PR)
     A                                      OVRDTA
     A            ITM9           4A  B 16 76DSPATR(PR)
     A                                      OVRDTA
     A            O1             2A  B 17 22DSPATR(PR)
     A                                      OVRDTA
     A            O2             2A  B 17 36DSPATR(PR)
     A                                      OVRDTA
     A            O3             2A  B 17 50DSPATR(PR)
     A                                      OVRDTA
     A            O5             2A  B 17 64DSPATR(PR)
     A                                      OVRDTA
     A            O9             2A  B 17 78DSPATR(PR)
     A                                      OVRDTA
     A            REQDATE1       8A  B 18 14DSPATR(PR)
     A                                      OVRDTA
     A            REQDATE2       8A  B 18 28DSPATR(PR)
     A                                      OVRDTA
     A            REQDATE3       8A  B 18 42DSPATR(PR)
     A                                      OVRDTA
     A            REQDATE5       8A  B 18 56DSPATR(PR)
     A                                      OVRDTA
     A            REQDATE9       8A  B 18 70DSPATR(PR)
     A                                      OVRDTA
     A            MSGLINE11     10A  B 19 13DSPATR(PR)
     A                                      OVRDTA
     A            MSGLINE12     10A  B 19 27DSPATR(PR)
     A                                      OVRDTA
     A            MSGLINE13     10A  B 19 41DSPATR(PR)
     A                                      OVRDTA
     A            MSGLINE14     10A  B 19 55DSPATR(PR)
     A                                      OVRDTA
     A            MSGLINE15     10A  B 19 69DSPATR(PR)
     A                                      OVRDTA
     A            MSGLINE21     12A  B 20 12DSPATR(PR)
     A                                      OVRDTA
     A            MSGLINE22     12A  B 20 26DSPATR(PR)
     A                                      OVRDTA
     A            MSGLINE23     12A  B 20 40DSPATR(PR)
     A                                      OVRDTA
     A            MSGLINE24     12A  B 20 54DSPATR(PR)
     A                                      OVRDTA
     A            MSGLINE25     12A  B 20 68DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FMTLSTAT2
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 20'- - -   I T E M   S T A T U S   -'
     A                                  1 54'- -'
     A                                  1 75'MQ1-2'
     A                                  2 20'FOLLOW INSTRUCTIONS ON BOTTOM OF S-
     A                                      CREEN'
     A                                  4  1'CODE'
     A                                  4 17'LOCAL-CODE'
     A                                  4 44'CLASS'
     A                                  4 58'DEFAULT DEPT'
     A                                  9  1'UM'
     A                                  9 24'ONHAND'
     A                                  9 52'LOC1'
     A                                 10 24'RESERVED'
     A                                 10 52'LOC2'
     A                                 11 24'AVAILABLE'
     A                                 11 52'LOC3'
     A                                 12 24'ONORDER'
     A                                 12 52'LOC4'
     A                                 13  1'AVG CST'
     A                                 13 24'LAST PO'
     A                                 13 52'LOC5'
     A                                 14 18'LAST REQ#'
     A                                 14 52'LOC6'
     A                                 15  1'DISP INSTR -'
     A                                 19  1'DEPRESS  "f2"  FOR MORE INQUIRY FI-
     A                                      ELDS'
     A                                 19 47'"f5"  TO PRINT THIS SCREEN'
     A                                 20 10'"f4"  FOR FULL DESCRIPTION'
     A                                 20 47'"f6"  FOR RESERVATION INQUIRY'
     A                                 21 10'"f7"  TO PREPARE FOR NEXT INQUIRY'
     A                                 21 47'"f3"  TO END PROGRAM'
     A            COM            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            STRCODE        7A  B  4  6DSPATR(PR)
     A                                      OVRDTA
     A            LOCCODE       12A  B  4 28DSPATR(PR)
     A                                      OVRDTA
     A            CLSS           4A  B  4 50DSPATR(PR)
     A                                      OVRDTA
     A            DFTDEP         6A  B  4 71DSPATR(PR)
     A                                      OVRDTA
     A            DESC1         79A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC2         79A  B  6  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC3         79A  B  7  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC4         79A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            UM             2A  B  9  6DSPATR(PR)
     A                                      OVRDTA
     A            ALTUMCF        9A  B  9 11DSPATR(PR)
     A                                      OVRDTA
     A            ONHAND         9A  B  9 34DSPATR(PR)
     A                                      OVRDTA
     A            LOC1          12A  B  9 57DSPATR(PR)
     A                                      OVRDTA
     A            LOC1ONHAN      9A  B  9 70DSPATR(PR)
     A                                      OVRDTA
     A            UM1            3A  B 10  1DSPATR(PR)
     A                                      OVRDTA
     A            U1             2A  B 10  6DSPATR(PR)
     A                                      OVRDTA
     A            UMCF1         11A  B 10  9DSPATR(PR)
     A                                      OVRDTA
     A            RESERVED       9A  B 10 34DSPATR(PR)
     A                                      OVRDTA
     A            LOC2          12A  B 10 57DSPATR(PR)
     A                                      OVRDTA
     A            LOC2ONHAN      9A  B 10 70DSPATR(PR)
     A                                      OVRDTA
     A            UM2            3A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            U2             2A  B 11  6DSPATR(PR)
     A                                      OVRDTA
     A            UMCF2         11A  B 11  9DSPATR(PR)
     A                                      OVRDTA
     A            AVAIL          9A  B 11 34DSPATR(PR)
     A                                      OVRDTA
     A            LOC3          12A  B 11 57DSPATR(PR)
     A                                      OVRDTA
     A            LOC3ONHAN      9A  B 11 70DSPATR(PR)
     A                                      OVRDTA
     A            ONORDER        9A  B 12 34DSPATR(PR)
     A                                      OVRDTA
     A            LOC4          12A  B 12 57DSPATR(PR)
     A                                      OVRDTA
     A            LOC4ONHAN      9A  B 12 70DSPATR(PR)
     A                                      OVRDTA
     A            AVGCST        12A  B 13  9DSPATR(PR)
     A                                      OVRDTA
     A            PONUM          7A  B 13 32DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B 13 40DSPATR(PR)
     A                                      OVRDTA
     A            LOC5          12A  B 13 57DSPATR(PR)
     A                                      OVRDTA
     A            LOC5ONHAN      9A  B 13 70DSPATR(PR)
     A                                      OVRDTA
     A            REQNUM        12A  B 14 29DSPATR(PR)
     A                                      OVRDTA
     A            REQDATE        8A  B 14 43DSPATR(PR)
     A                                      OVRDTA
     A            LOC6          12A  B 14 57DSPATR(PR)
     A                                      OVRDTA
     A            LOC6ONHAN      9A  B 14 70DSPATR(PR)
     A                                      OVRDTA
     A            DISPINSTR     30A  B 15 14DSPATR(PR)
     A                                      OVRDTA
     A            DISPREPAIR    18A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            DISPSTOCK     16A  B 16 24DSPATR(PR)
     A                                      OVRDTA
     A            DISPBLKMSG    58A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FMTLSTAT3
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 20'- - -   I T E M   S T A T U S   -'
     A                                  1 54'- -'
     A                                  1 75'MQ1-3'
     A                                  2 20'FOLLOW INSTRUCTIONS ON BOTTOM OF S-
     A                                      CREEN'
     A                                  4  1'CODE'
     A                                  4 29'CLASSIFICATIONS   WD  OE  MR  OR'
     A                                  4 63'INS  RL  SO'
     A                                  5  1'UM'
     A                                  6  1'ONHAND'
     A                                  6 30'ADD TO STOCK DATE'
     A                                  6 59'ORIGINATOR'
     A                                  7  1'MAXIMUM'
     A                                  7 30'LAST ISSUE DATE'
     A                                  7 59'TO'
     A                                  8  1'REORDER'
     A                                  8 30'LAST ACTIVITY DATE'
     A                                  9  1'EXPEDITE'
     A                                  9 30'LAST PHYS INV DATE'
     A                                  9 59'CYCLE'
     A                                  9 71'DAYS'
     A                                 11  1'SOQ'
     A                                 11 23'STD COST'
     A                                 11 48'EST GDYR LT'
     A                                 11 71'DAYS'
     A                                 12  1'EOQ'
     A                                 12 23'MKT COST'
     A                                 12 48'LAST ACTUAL LT'
     A                                 12 71'DAYS'
     A                                 14  1'JA'
     A                                 14 14'FE'
     A                                 14 27'MA'
     A                                 14 40'AP'
     A                                 14 53'MA'
     A                                 14 66'JU'
     A                                 15  1'JU'
     A                                 15 14'AU'
     A                                 15 27'SE'
     A                                 15 40'OC'
     A                                 15 53'NO'
     A                                 15 66'DE'
     A                                 16  1'AVERAGE MONTHLY USAGE'
     A                                 18  2'MONTH-TO-DATE'
     A                                 18 26'LAST-12-MONTHS'
     A                                 18 51'USED YESTERDAY'
     A                                 20  1'DEPRESS  "f1"  FOR BASIC INQUIRY F-
     A                                      IELDS      "f5"  TO PRINT THIS SCRE-
     A                                      EN'
     A                                 21 10'"f4"  FOR FULL DESCRIPTION'
     A                                 21 46'"f6"  FOR RESERVATION INQUIRY'
     A                                 22 10'"f7"  TO PREPARE FOR NEXT INQUIRY'
     A                                 22 46'"f3"  TO END PROGRAM'
     A            COM            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            STRCODE        7A  B  4  6DSPATR(PR)
     A                                      OVRDTA
     A            UM             2A  B  5  6DSPATR(PR)
     A                                      OVRDTA
     A            WRITEDOWN      1A  B  5 48DSPATR(PR)
     A                                      OVRDTA
     A            ORDERENG       1A  B  5 52DSPATR(PR)
     A                                      OVRDTA
     A            MAINTREPAI     1A  B  5 56DSPATR(PR)
     A                                      OVRDTA
     A            OUTSIDEREP     1A  B  5 60DSPATR(PR)
     A                                      OVRDTA
     A            INSURANCE      1A  B  5 64DSPATR(PR)
     A                                      OVRDTA
     A            RELEASE        1A  B  5 68DSPATR(PR)
     A                                      OVRDTA
     A            STOCKOUT       1A  B  5 72DSPATR(PR)
     A                                      OVRDTA
     A            ONHAND         9A  B  6 10DSPATR(PR)
     A                                      OVRDTA
     A            ADDDATE        8A  B  6 49DSPATR(PR)
     A                                      OVRDTA
     A            ORIGINATOR    10A  B  6 70DSPATR(PR)
     A                                      OVRDTA
     A            MAX            9A  B  7 10DSPATR(PR)
     A                                      OVRDTA
     A            ISSDATE        8A  B  7 49DSPATR(PR)
     A                                      OVRDTA
     A            CHARDEPT      10A  B  7 62DSPATR(PR)
     A                                      OVRDTA
     A            REORDER        9A  B  8 10DSPATR(PR)
     A                                      OVRDTA
     A            ACTDATE        8A  B  8 49DSPATR(PR)
     A                                      OVRDTA
     A            EXPEDITE       9A  B  9 10DSPATR(PR)
     A                                      OVRDTA
     A            PHYDATE        8A  B  9 49DSPATR(PR)
     A                                      OVRDTA
     A            CYCL           5A  B  9 65DSPATR(PR)
     A                                      OVRDTA
     A            SOQ            9A  B 11 10DSPATR(PR)
     A                                      OVRDTA
     A            STDCOST       12A  B 11 32DSPATR(PR)
     A                                      OVRDTA
     A            ESLT           5A  B 11 65DSPATR(PR)
     A                                      OVRDTA
     A            EOQ            9A  B 12 10DSPATR(PR)
     A                                      OVRDTA
     A            MKTCOST       12A  B 12 32DSPATR(PR)
     A                                      OVRDTA
     A            ACLT           5A  B 12 65DSPATR(PR)
     A                                      OVRDTA
     A            JANUSAGE       9A  B 14  4DSPATR(PR)
     A                                      OVRDTA
     A            FEBUSAGE       9A  B 14 17DSPATR(PR)
     A                                      OVRDTA
     A            MARUSAGE       9A  B 14 30DSPATR(PR)
     A                                      OVRDTA
     A            APRUSAGE       9A  B 14 43DSPATR(PR)
     A                                      OVRDTA
     A            MAYUSAGE       9A  B 14 56DSPATR(PR)
     A                                      OVRDTA
     A            JUNUSAGE       9A  B 14 69DSPATR(PR)
     A                                      OVRDTA
     A            JULUSAGE       9A  B 15  4DSPATR(PR)
     A                                      OVRDTA
     A            AUGUSAGE       9A  B 15 17DSPATR(PR)
     A                                      OVRDTA
     A            SEPUSAGE       9A  B 15 30DSPATR(PR)
     A                                      OVRDTA
     A            OCTUSAGE       9A  B 15 43DSPATR(PR)
     A                                      OVRDTA
     A            NOVUSAGE       9A  B 15 56DSPATR(PR)
     A                                      OVRDTA
     A            DECUSAGE       9A  B 15 69DSPATR(PR)
     A                                      OVRDTA
     A            AVGMUSAG       9A  B 16 23DSPATR(PR)
     A                                      OVRDTA
     A            MONTODAT       9A  B 18 16DSPATR(PR)
     A                                      OVRDTA
     A            LT12MONNU      9A  B 18 41DSPATR(PR)
     A                                      OVRDTA
     A            USEDYEST       9A  B 18 66DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FMTLSTAT4
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 20'- - -   I T E M   S T A T U S   -'
     A                                  1 54'- -'
     A                                  1 75'MQ1-4'
     A                                  2 20'FOLLOW INSTRUCTIONS ON BOTTOM OF S-
     A                                      CREEN'
     A                                  4  1'CODE'
     A                                 20  1'DEPRESS  "f1"  FOR BASIC INQUIRY F-
     A                                      IELDS'
     A                                 20 48'"f2"  FOR MORE INQUIRY FIELDS'
     A                                 21 10'"f5"  TO PRINT THIS SCREEN'
     A                                 21 48'"f6"  FOR RESERVATION INQUIRY'
     A                                 22 10'"f7"  TO PREPARE FOR NEXT INQUIRY'
     A                                 22 48'"f3"  TO END PROGRAM'
     A            COM            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            STRCODE        7A  B  4  6DSPATR(PR)
     A                                      OVRDTA
     A            DESC1         79A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC2         79A  B  6  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC3         79A  B  7  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC4         79A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC5         79A  B  9  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC6         79A  B 10  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC7         79A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC8         79A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC9         79A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC10        79A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC11        79A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC12        79A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            DESCMSG       58A  B 18  6DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FMTLSTAT5
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 14'- - - INSTRUCTIONS ON OBTAINING P.-
     A                                      O. INFORMATION - - -'
     A                                  1 76'MQ1-5'
     A                                  2 22'FOLLOW INSTRUCTIONS ON BOTTOM OF S-
     A                                      CREEN'
     A                                  5  1'P.O.-RCV SLIP INQUIRY BY CODE -- (-
     A                                      SELECT KEY TO RUN PROGRAM FROM MAST-
     A                                      ER MENU)'
     A                                  7  4'USE THIS INQUIRY TO LOOK AT ALL PU-
     A                                      RCHASE ORDERS FOR ANY CORP CODE'
     A                                  8  8'(a)  DETERMINE IF ANY ITEMS ARE RE-
     A                                      CEIVED BUT NOT STORED'
     A                                  9  8'(b)  OBTAIN PURCHASE ORDER NUMBER(-
     A                                      s)'
     A                                 11  1'PURCHASE ORDER INQUIRY BY P.O. --'
     A                                 11 35'(SELECT KEY TO RUN PROGRAM FROM MA-
     A                                      STER MENU)'
     A                                 13  4'USE THIS INQUIRY TO OBTAIN INFORMA-
     A                                      TION ON P.O. HEADER AND ITEMS'
     A                                 14  8'(a)  HEADER - ACCT. DATA, DELIVER'
     A                                 14 42'TO DATA, PO DATE, SHIP DATE, EXPEC-
     A                                      TED'
     A                                 15 22'DELIVERY DATE, VENDOR DATA.'
     A                                 16  8'(b)  ITEMS  - DESCRIPTION, PRICE,'
     A                                 16 42'QUANTITIES (ORDERED,RECEIVED,STORE-
     A                                      D),'
     A                                 17 22'DATE RECIEVED, DATE STORED.'
     A                                 19  1'DEPRESS  "f1"  FOR BASIC INQUIRY F-
     A                                      IELDS     "f2"  FOR MORE INQUIRY FI-
     A                                      ELDS'
     A                                 20 10'"f4"  FOR FULL INQUIRY'
     A                                 20 45'"f5"  TO PRINT SCREEN'
     A                                 21 10'"f6"  FOR RESERVATION INQUIRY'
     A                                 21 45'"f7"  TO PREPARE FOR NEXT INQUIRY'
     A                                 22 10'"f3"  TO END PROGRAM'
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FRSRVINQ
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 19'R E S E R V A T I O N    I N Q U I'
     A                                  1 54'R Y'
     A                                  1 75'MQ1-7'
     A                                  3  1'CODE:'
     A                                  3 18'ONHAND:'
     A                                  3 38'RESERVED:'
     A                                  3 60'AVAILABLE:'
     A                                  5  4'WORKORDER'
     A                                  5 22'QUANTITY      DATE RESERVED     ST-
     A                                      AGE LOCATION    MACHINE'
     A                                 21  1'DEPRESS  "f1"  FOR BASIC INQUIRY F-
     A                                      IELDS'
     A                                 21 47'"f2"  FOR MORE INQUIRY FIELDS'
     A                                 22 10'"f4"  FOR FULL DESCRIPTION'
     A                                 22 47'"f5"  TO PRINT SCREEN'
     A                                 23 10'"f7"  TO PREPARE FOR NEXT INQUIRY'
     A                                 23 47'"f3"  TO END PROGRAM'
     A            COMPANY        3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            CORPCOD        7A  B  3  8DSPATR(PR)
     A                                      OVRDTA
     A            ONHAND         8A  B  3 27DSPATR(PR)
     A                                      OVRDTA
     A            RESERVED       8A  B  3 49DSPATR(PR)
     A                                      OVRDTA
     A            AVAILABL       8A  B  3 72DSPATR(PR)
     A                                      OVRDTA
     A            LINE1         79A  B  6  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE2         79A  B  7  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE3         79A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE4         79A  B  9  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE5         79A  B 10  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE6         79A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE7         79A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE8         79A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE9         79A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE10        79A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE11        79A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE12        79A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE13        79A  B 18  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE14        79A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            LINE15        79A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R ISSNGL
     A*  90/07/30  16:09:04    A171523     REL-R02M00  5728-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 12'-----------------------------------
     A                                      -----------------'
     A                                  2 12':  BANBURY EXPLOSION CORRECTION -'
     A                                  2 46'ISSUE MATERIAL  :'
     A                                  3 12'-----------------------------------
     A                                      -----------------'
     A                                  6  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  7  1'. CODE     KEYWORD'
     A                                  7 32'ADJECTIVE'
     A                                  7 61'UM'
     A                                  7 70'AVAIL    .'
     A                                  8  1'.'
     A                                  8 79'.'
     A                                  9  1'.'
     A                                  9 79'.'
     A                                 10  1'.'
     A                                 10 79'.'
     A                                 11  1'. EMPL'
     A                                 11 15'PROD. DATE'
     A                                 11 32'ORD. DEPT      CHARGE DEPT'
     A                                 11 65'CHARGE ACCT   .'
     A                                 12  1'.'
     A                                 12 79'.'
     A                                 13  1'.'
     A                                 13 79'.'
     A                                 14  1'.'
     A                                 14  4'LOCATION......ONHAND....WITHDREW'
     A                                 14 43'LOCATION......ONHAND....WITHDREW'
     A                                 14 79'.'
     A                                 15  1'.'
     A                                 15 79'.'
     A                                 16  1'.'
     A                                 16 79'.'
     A                                 17  1'.'
     A                                 17 79'.'
     A                                 18  1'.'
     A                                 18 79'.'
     A                                 19  1'.  DISBURSEMENT INSTRUCTION -'
     A                                 19 79'.'
     A                                 20  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            CODE          12A  B  5  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            INSTRUCTIO    62A  B  5 18DSPATR(PR)
     A                                      OVRDTA
     A            VCODE          8A  B  8  3DSPATR(PR)
     A                                      OVRDTA
     A            KWRDADJ       46A  B  8 12DSPATR(PR)
     A                                      OVRDTA
     A            UM             2A  B  8 61DSPATR(PR)
     A                                      OVRDTA
     A            AVAIL         10A  B  8 65DSPATR(PR)
     A                                      OVRDTA
     A            DESC          72A  B  9  3DSPATR(PR)
     A                                      OVRDTA
     A            EMPL           4A  B 12  3DSPATR(PR)
     A                                      OVRDTA
     A            WO            10A  B 12 15DSPATR(PR)
     A                                      OVRDTA
     A            REQ            4A  B 12 35DSPATR(PR)
     A                                      OVRDTA
     A            CHRG           4A  B 12 50DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 12 56DSPATR(PR)
     A                                      OVRDTA
     A            N              1A  B 12 59DSPATR(PR)
     A                                      OVRDTA
     A            EXP            6A  B 12 67DSPATR(PR)
     A                                      OVRDTA
     A            CN             2A  B 12 75DSPATR(PR)
     A                                      OVRDTA
     A            LOC1          12A  B 15  4DSPATR(PR)
     A                                      OVRDTA
     A            ONH1           8   B 15 18DSPATR(PR)
     A                                      OVRDTA
     A            QTY1           8A  B 15 28DSPATR(PR)
     A                                      OVRDTA
     A            LOC2          12A  B 15 43DSPATR(PR)
     A                                      OVRDTA
     A            ONH2           8   B 15 57DSPATR(PR)
     A                                      OVRDTA
     A            QTY2           8A  B 15 67DSPATR(PR)
     A                                      OVRDTA
     A            LOC3          12A  B 16  4DSPATR(PR)
     A                                      OVRDTA
     A            ONH3           8   B 16 18DSPATR(PR)
     A                                      OVRDTA
     A            QTY3           8A  B 16 28DSPATR(PR)
     A                                      OVRDTA
     A            LOC4          12A  B 16 43DSPATR(PR)
     A                                      OVRDTA
     A            ONH4           8   B 16 57DSPATR(PR)
     A                                      OVRDTA
     A            QTY4           8A  B 16 67DSPATR(PR)
     A                                      OVRDTA
     A            LOC5          12A  B 17  4DSPATR(PR)
     A                                      OVRDTA
     A            ONH5           8   B 17 18DSPATR(PR)
     A                                      OVRDTA
     A            QTY5           8A  B 17 28DSPATR(PR)
     A                                      OVRDTA
     A            LOC6          12A  B 17 43DSPATR(PR)
     A                                      OVRDTA
     A            ONH6           8   B 17 57DSPATR(PR)
     A                                      OVRDTA
     A            QTY6           8A  B 17 67DSPATR(PR)
     A                                      OVRDTA
     A            DISB          30A  B 19 31DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-END PROGRAM')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R ISSNGL2
     A*%%TS  SD  19980305  124950  A193138     REL-V3R7M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 76'MP6-1'
     A                                  6  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  7  1'CODE     KEYWORD'
     A                                  7 30'ADJECTIVE'
     A                                  7 59'UM'
     A                                  7 69'AVAIL'
     A                                  9  1'DESC'
     A                                 10 64'EXP. CLASS'
     A                                 11  2'EMPL'
     A                                 11 14'PROD. DATE'
     A                                 11 31'REQ DEPT'
     A                                 11 46'CHARGE DEPT     (CHG ACCT/NW#)'
     A                                 15  7'LOCATION......ONHAND....WITHDREW'
     A                                 15 48'LOCATION......ONHAND....WITHDREW'
     A                                 20  1'DISBURSEMENT INSTRUCTION -'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A            CODE          12A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTIO    62A  B  5 17DSPATR(PR)
     A                                      OVRDTA
     A            VCODE          8A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            KWRDADJ       46A  B  8 10DSPATR(PR)
     A                                      OVRDTA
     A            UM             2A  B  8 59DSPATR(PR)
     A                                      OVRDTA
     A            AVAIL         10A  B  8 64DSPATR(PR)
     A                                      OVRDTA
     A            DESC          72A  B  9  7DSPATR(PR)
     A                                      OVRDTA
     A            EMPL           4A  B 12  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            WO            10A  B 12 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            REQ            4A  B 12 33DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            CHRG           4A  B 12 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            C1             2A  B 12 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            EXP            6A  B 12 66DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            NN             2A  B 12 74DSPATR(PR)
     A                                      OVRDTA
     A            FRAN1          4A  B 16  2
     A N95                                  DSPATR(ND)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A            LOC1          12A  B 16  7DSPATR(PR)
     A                                      OVRDTA
     A            ONH1           8A  B 16 21DSPATR(PR)
     A                                      OVRDTA
     A            QTY1           8A  B 16 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            FRAN2          4A  B 16 43
     A N95                                  DSPATR(ND)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A            LOC2          12A  B 16 48DSPATR(PR)
     A                                      OVRDTA
     A            ONH2           8A  B 16 62DSPATR(PR)
     A                                      OVRDTA
     A            QTY2           8A  B 16 72DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            FRAN3          4A  B 17  2
     A N95                                  DSPATR(ND)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A            LOC3          12A  B 17  7DSPATR(PR)
     A                                      OVRDTA
     A            ONH3           8A  B 17 21DSPATR(PR)
     A                                      OVRDTA
     A            QTY3           8A  B 17 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            FRAN4          4A  B 17 43
     A N95                                  DSPATR(ND)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A            LOC4          12A  B 17 48DSPATR(PR)
     A                                      OVRDTA
     A            ONH4           8A  B 17 62DSPATR(PR)
     A                                      OVRDTA
     A            QTY4           8A  B 17 72DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            FRAN5          4A  B 18  2
     A N95                                  DSPATR(ND)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A            LOC5          12A  B 18  7DSPATR(PR)
     A                                      OVRDTA
     A            ONH5           8A  B 18 21DSPATR(PR)
     A                                      OVRDTA
     A            QTY5           8A  B 18 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            FRAN6          4A  B 18 43
     A N95                                  DSPATR(ND)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A            LOC6          12A  B 18 48DSPATR(PR)
     A                                      OVRDTA
     A            ONH6           8A  B 18 62DSPATR(PR)
     A                                      OVRDTA
     A            QTY6           8A  B 18 72DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            DISB          30A  B 20 28DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-ISSUES MENU f2-RETURNS M-
     A                                      ENU f3-END PROGRAM                 -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A                                 15  2'FRAN'
     A N95                                  DSPATR(ND)
     A                                      OVRATR
     A                                 15 43'FRAN'
     A N95                                  DSPATR(ND)
     A                                      OVRATR
     A                                  1 12'-----------------------------------
     A                                      -----------------'
     A                                  2 12':  BANBURY EXPLOSION CORRECTION - -
     A                                      ISSUE MATERIAL  :'
     A                                  3 12'-----------------------------------
     A                                      -----------------'
     A          R ISSNGL2_AK
     A*%%TS  SD  19980305  124950  A193138     REL-V3R7M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 76'MP6-1'
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  1'CODE     KEYWORD'
     A                                  6 30'ADJECTIVE'
     A                                  6 59'UM'
     A                                  6 69'AVAIL'
     A                                  8  1'DESC'
     A                                 10  1'EMPL   PROD. DATE   ORD. DEPT   CH-
     A                                      ARGE DEPT   CHARGE TYPE   CHARGE AC-
     A                                      CT  CNTR'
     A                                 13  7'LOCATION......ONHAND....WITHDREW'
     A                                 13 48'LOCATION......ONHAND....WITHDREW'
     A                                 18  1'DISBURSEMENT INSTRUCTION -'
     A                                 20  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 21  1'THE CHARGE TYPE FIELD MUST CONTAIN'
     A                                 21 36'ONE OF THE FOLLOWING KEYS:'
     A                                 22  3'1--R & D'
     A                                 22 23'2--ENG. EXPENSE    3--ENG REPAIR'
     A                                 22 60'4--NEW WORK'
     A                                 23  3'5--MACHINE DESIGN   BLANK--OPERATI-
     A                                      NG & PROCESS ITEMS'
     A            CODE          12A  B  4  1DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTIO    62A  B  4 17DSPATR(PR)
     A                                      OVRDTA
     A            VCODE          8A  B  7  1DSPATR(PR)
     A                                      OVRDTA
     A            KWRDADJ       46A  B  7 10DSPATR(PR)
     A                                      OVRDTA
     A            UM             2A  B  7 59DSPATR(PR)
     A                                      OVRDTA
     A            AVAIL         10A  B  7 64DSPATR(PR)
     A                                      OVRDTA
     A            DESC          72A  B  8  7DSPATR(PR)
     A                                      OVRDTA
     A            EMPL           4A  B 11  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            WO            10A  B 11  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            REQ            4A  B 11 24DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            CHRG           4A  B 11 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            C              1A  B 11 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            N              1A  B 11 58DSPATR(PR)
     A                                      OVRDTA
     A            EXP            6A  B 11 64DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            CN             2A  B 11 75DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            FRAN1          4A  B 14  2
     A N95                                  DSPATR(ND)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A            LOC1          12A  B 14  7DSPATR(PR)
     A                                      OVRDTA
     A            ONH1           8A  B 14 21DSPATR(PR)
     A                                      OVRDTA
     A            QTY1           8A  B 14 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            FRAN2          4A  B 14 43
     A N95                                  DSPATR(ND)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A            LOC2          12A  B 14 48DSPATR(PR)
     A                                      OVRDTA
     A            ONH2           8A  B 14 62DSPATR(PR)
     A                                      OVRDTA
     A            QTY2           8A  B 14 72DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            FRAN3          4A  B 15  2
     A N95                                  DSPATR(ND)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A            LOC3          12A  B 15  7DSPATR(PR)
     A                                      OVRDTA
     A            ONH3           8A  B 15 21DSPATR(PR)
     A                                      OVRDTA
     A            QTY3           8A  B 15 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            FRAN4          4A  B 15 43
     A N95                                  DSPATR(ND)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A            LOC4          12A  B 15 48DSPATR(PR)
     A                                      OVRDTA
     A            ONH4           8A  B 15 62DSPATR(PR)
     A                                      OVRDTA
     A            QTY4           8A  B 15 72DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            FRAN5          4A  B 16  2
     A N95                                  DSPATR(ND)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A            LOC5          12A  B 16  7DSPATR(PR)
     A                                      OVRDTA
     A            ONH5           8A  B 16 21DSPATR(PR)
     A                                      OVRDTA
     A            QTY5           8A  B 16 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            FRAN6          4A  B 16 43
     A N95                                  DSPATR(ND)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A            LOC6          12A  B 16 48DSPATR(PR)
     A                                      OVRDTA
     A            ONH6           8A  B 16 62DSPATR(PR)
     A                                      OVRDTA
     A            QTY6           8A  B 16 72DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            DISB          30A  B 18 28DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-ISSUES MENU f2-RETURNS M-
     A                                      ENU f3-END PROGRAM                 -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A                                 13  2'FRAN'
     A N95                                  DSPATR(ND)
     A                                      OVRATR
     A                                 13 43'FRAN'
     A N95                                  DSPATR(ND)
     A                                      OVRATR
     A                                  1 12'-----------------------------------
     A                                      -----------------'
     A                                  2 12':  BANBURY EXPLOSION CORRECTION - -
     A                                      ISSUE MATERIAL  :'
     A                                  3 12'-----------------------------------
     A                                      -----------------'
     A          R ISSNGL3
     A*  90/07/30  16:09:04    A171523     REL-R02M00  5728-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 12'-----------------------------------
     A                                      -----------------'
     A                                  2 12':  BANBURY EXPLOSION CORRECTION -'
     A                                  2 46'ISSUE MATERIAL  :'
     A                                  3 12'-----------------------------------
     A                                      -----------------'
     A                                  6  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  7  1'. CODE     KEYWORD'
     A                                  7 32'ADJECTIVE'
     A                                  7 61'UM'
     A                                  7 70'AVAIL    .'
     A                                  8  1'.'
     A                                  8 79'.'
     A                                  9  1'.'
     A                                  9 79'.'
     A                                 10  1'.'
     A                                 10 79'.'
     A                                 11  1'. EMPL'
     A                                 11 15'PROD. DATE'
     A                                 11 32'ORD. DEPT      CHARGE DEPT'
     A                                 11 65'CHARGE ACCT   .'
     A                                 12  1'.'
     A                                 12 79'.'
     A                                 13  1'.'
     A                                 13 79'.'
     A                                 14  1'.'
     A                                 14  4'LOCATION......ONHAND....WITHDREW'
     A                                 14 43'LOCATION......ONHAND....WITHDREW'
     A                                 14 79'.'
     A                                 15  1'.'
     A                                 15 79'.'
     A                                 16  1'.'
     A                                 16 79'.'
     A                                 17  1'.'
     A                                 17 79'.'
     A                                 18  1'.'
     A                                 18 79'.'
     A                                 19  1'.  DISBURSEMENT INSTRUCTION -'
     A                                 19 79'.'
     A                                 20  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            CODE          12A  B  5  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            INSTRUCTIO    62A  B  5 18DSPATR(PR)
     A                                      OVRDTA
     A            VCODE          8A  B  8  3DSPATR(PR)
     A                                      OVRDTA
     A            KWRDADJ       46A  B  8 12DSPATR(PR)
     A                                      OVRDTA
     A            UM             2A  B  8 61DSPATR(PR)
     A                                      OVRDTA
     A            AVAIL         10A  B  8 65DSPATR(PR)
     A                                      OVRDTA
     A            DESC          72A  B  9  3DSPATR(PR)
     A                                      OVRDTA
     A            EMPL           4A  B 12  3DSPATR(PR)
     A                                      OVRDTA
     A            WO            10A  B 12 15DSPATR(PR)
     A                                      OVRDTA
     A            REQ            4A  B 12 35DSPATR(PR)
     A                                      OVRDTA
     A            CHRG           4A  B 12 50DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 12 56DSPATR(PR)
     A                                      OVRDTA
     A            N              1A  B 12 59DSPATR(PR)
     A                                      OVRDTA
     A            EXP            6A  B 12 67DSPATR(PR)
     A                                      OVRDTA
     A            CN             2A  B 12 75DSPATR(PR)
     A                                      OVRDTA
     A            LOC1          12A  B 15  4DSPATR(PR)
     A                                      OVRDTA
     A            ONH1           8   B 15 18DSPATR(PR)
     A                                      OVRDTA
     A            QTY1           8A  B 15 28DSPATR(PR)
     A                                      OVRDTA
     A            LOC2          12A  B 15 43DSPATR(PR)
     A                                      OVRDTA
     A            ONH2           8   B 15 57DSPATR(PR)
     A                                      OVRDTA
     A            QTY2           8A  B 15 67DSPATR(PR)
     A                                      OVRDTA
     A            LOC3          12A  B 16  4DSPATR(PR)
     A                                      OVRDTA
     A            ONH3           8   B 16 18DSPATR(PR)
     A                                      OVRDTA
     A            QTY3           8A  B 16 28DSPATR(PR)
     A                                      OVRDTA
     A            LOC4          12A  B 16 43DSPATR(PR)
     A                                      OVRDTA
     A            ONH4           8   B 16 57DSPATR(PR)
     A                                      OVRDTA
     A            QTY4           8A  B 16 67DSPATR(PR)
     A                                      OVRDTA
     A            LOC5          12A  B 17  4DSPATR(PR)
     A                                      OVRDTA
     A            ONH5           8   B 17 18DSPATR(PR)
     A                                      OVRDTA
     A            QTY5           8A  B 17 28DSPATR(PR)
     A                                      OVRDTA
     A            LOC6          12A  B 17 43DSPATR(PR)
     A                                      OVRDTA
     A            ONH6           8   B 17 57DSPATR(PR)
     A                                      OVRDTA
     A            QTY6           8A  B 17 67DSPATR(PR)
     A                                      OVRDTA
     A            DISB          30A  B 19 31DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-END PROGRAM')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R RMCORRMAIN
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  3 20'-----------------------------------
     A                                      -----'
     A                                  4 20': ¦'
     A                                  4 56'¦ :'
     A                                  5 20': ¦  BANBURY EXPLOSION CORRECTION'
     A                                  5 56'¦ :'
     A                                  6 20': ¦'
     A                                  6 56'¦ :'
     A                                  7 20'-----------------------------------
     A                                      -----'
     A                                  8 22'¦'
     A                                  8 56'¦'
     A                                  9 22'¦    f1  To issue material'
     A                                  9 56'¦'
     A                                 10 22'¦'
     A                                 10 56'¦'
     A                                 11 22'¦    f2  To return material'
     A                                 11 56'¦'
     A                                 12 22'¦'
     A                                 12 56'¦'
     A                                 13 22'¦    f6  For material inquiry'
     A                                 13 56'¦'
     A                                 14 22'¦'
     A                                 14 56'¦'
     A                                 15 22'¦    f3  To end program'
     A                                 15 56'¦'
     A                                 16 22'¦'
     A                                 16 56'¦'
     A                                 17 22'-----------------------------------
     A                                      -'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-ISSUE f2-RETURN f6-INQUI-
     A                                      RY f3-END PROGRAM                  -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R RTSNGL
     A*  90/07/30  16:09:04    A171523     REL-R02M00  5728-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 12'-----------------------------------
     A                                      ------------------'
     A                                  2 12':  BANBURY EXPLOSION CORRECTION -'
     A                                  2 46'RETURN MATERIAL  :'
     A                                  3 12'-----------------------------------
     A                                      ------------------'
     A                                  6  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  7  1'. CODE     KEYWORD'
     A                                  7 32'ADJECTIVE'
     A                                  7 61'UM'
     A                                  7 70'AVAIL    .'
     A                                  8  1'.'
     A                                  8 79'.'
     A                                  9  1'.'
     A                                  9 79'.'
     A                                 10  1'.'
     A                                 10 79'.'
     A                                 11  1'. EMPL'
     A                                 11 15'PROD. DATE'
     A                                 11 32'ORD. DEPT      CREDIT DEPT'
     A                                 11 65'CREDIT ACCT   .'
     A                                 12  1'.'
     A                                 12 79'.'
     A                                 13  1'.'
     A                                 13 79'.'
     A                                 14  1'.'
     A                                 14  4'LOCATION......ONHAND....WITHDREW'
     A                                 14 43'LOCATION......ONHAND....WITHDREW'
     A                                 14 79'.'
     A                                 15  1'.'
     A                                 15 79'.'
     A                                 16  1'.'
     A                                 16 79'.'
     A                                 17  1'.'
     A                                 17 79'.'
     A                                 18  1'.'
     A                                 18 79'.'
     A                                 19  1'.  DISBURSEMENT INSTRUCTION -'
     A                                 19 79'.'
     A                                 20  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            CODE          12A  B  5  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            INSTRUCTIO    62A  B  5 18DSPATR(PR)
     A                                      OVRDTA
     A            VCODE          8A  B  8  3DSPATR(PR)
     A                                      OVRDTA
     A            KWRDADJ       46A  B  8 12DSPATR(PR)
     A                                      OVRDTA
     A            UM             2A  B  8 61DSPATR(PR)
     A                                      OVRDTA
     A            AVAIL         10A  B  8 65DSPATR(PR)
     A                                      OVRDTA
     A            DESC          72A  B  9  3DSPATR(PR)
     A                                      OVRDTA
     A            EMPL           4A  B 12  3DSPATR(PR)
     A                                      OVRDTA
     A            WO            10A  B 12 15DSPATR(PR)
     A                                      OVRDTA
     A            REQ            4A  B 12 35DSPATR(PR)
     A                                      OVRDTA
     A            CHRG           4A  B 12 50DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 12 56DSPATR(PR)
     A                                      OVRDTA
     A            N              1A  B 12 59DSPATR(PR)
     A                                      OVRDTA
     A            EXP            6A  B 12 67DSPATR(PR)
     A                                      OVRDTA
     A            CN             2A  B 12 75DSPATR(PR)
     A                                      OVRDTA
     A            LOC1          12A  B 15  4DSPATR(PR)
     A                                      OVRDTA
     A            ONH1           8   B 15 18DSPATR(PR)
     A                                      OVRDTA
     A            QTY1           8A  B 15 28DSPATR(PR)
     A                                      OVRDTA
     A            LOC2          12A  B 15 43DSPATR(PR)
     A                                      OVRDTA
     A            ONH2           8   B 15 57DSPATR(PR)
     A                                      OVRDTA
     A            QTY2           8A  B 15 67DSPATR(PR)
     A                                      OVRDTA
     A            LOC3          12A  B 16  4DSPATR(PR)
     A                                      OVRDTA
     A            ONH3           8   B 16 18DSPATR(PR)
     A                                      OVRDTA
     A            QTY3           8A  B 16 28DSPATR(PR)
     A                                      OVRDTA
     A            LOC4          12A  B 16 43DSPATR(PR)
     A                                      OVRDTA
     A            ONH4           8   B 16 57DSPATR(PR)
     A                                      OVRDTA
     A            QTY4           8A  B 16 67DSPATR(PR)
     A                                      OVRDTA
     A            LOC5          12A  B 17  4DSPATR(PR)
     A                                      OVRDTA
     A            ONH5           8   B 17 18DSPATR(PR)
     A                                      OVRDTA
     A            QTY5           8A  B 17 28DSPATR(PR)
     A                                      OVRDTA
     A            LOC6          12A  B 17 43DSPATR(PR)
     A                                      OVRDTA
     A            ONH6           8   B 17 57DSPATR(PR)
     A                                      OVRDTA
     A            QTY6           8A  B 17 67DSPATR(PR)
     A                                      OVRDTA
     A            DISB          30A  B 19 31DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-END PROGRAM')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R RTSNGL2
     A*%%TS  SD  19980305  124950  A193138     REL-V3R7M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 75'MP6-2'
     A                                  6  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  7  1'CODE     KEYWORD'
     A                                  7 30'ADJECTIVE'
     A                                  7 59'UM'
     A                                  7 69'AVAIL'
     A                                  9  1'DESC'
     A                                 10 64'EXP. CLASS'
     A                                 11  2'EMPL'
     A                                 11 14'PROD. DATE'
     A                                 11 31'REQ DEPT'
     A                                 11 46'CREDIT DEPT     (CHG ACCT/NW#)'
     A                                 15  2'FRAN'
     A N95                                  DSPATR(ND)
     A                                      OVRATR
     A                                 15  7'LOCATION......ONHAND....RETURNED'
     A                                 15 43'FRAN'
     A N95                                  DSPATR(ND)
     A                                      OVRATR
     A                                 15 48'LOCATION......ONHAND....RETURNED'
     A                                 20  1'DISBURSEMENT INSTRUCTION -'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A            CODE          12A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTIO    62A  B  5 17DSPATR(PR)
     A                                      OVRDTA
     A            VCODE          8A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            KWRDADJ       46A  B  8 10DSPATR(PR)
     A                                      OVRDTA
     A            UM             2A  B  8 59DSPATR(PR)
     A                                      OVRDTA
     A            AVAIL         10A  B  8 64DSPATR(PR)
     A                                      OVRDTA
     A            DESC          72A  B  9  7DSPATR(PR)
     A                                      OVRDTA
     A            EMPL           4A  B 12  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            WO            10A  B 12 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            REQ            4A  B 12 33DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            CHRG           4A  B 12 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            C1             2A  B 12 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            EXP            6A  B 12 66DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            NN             2A  B 12 74DSPATR(PR)
     A                                      OVRDTA
     A            FRAN1          4A  B 16  2
     A N95                                  DSPATR(ND)
     A                                      DSPATR(PR)
     A            LOC1          12A  B 16  7DSPATR(PR)
     A                                      OVRDTA
     A            ONH1           8A  B 16 21DSPATR(PR)
     A                                      OVRDTA
     A            QTY1           8A  B 16 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            FRAN2          4A  B 16 43
     A N95                                  DSPATR(ND)
     A                                      DSPATR(PR)
     A            LOC2          12A  B 16 48DSPATR(PR)
     A                                      OVRDTA
     A            ONH2           8A  B 16 62DSPATR(PR)
     A                                      OVRDTA
     A            QTY2           8A  B 16 72DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            FRAN3          4A  B 17  2
     A N95                                  DSPATR(ND)
     A                                      DSPATR(PR)
     A            LOC3          12A  B 17  7DSPATR(PR)
     A                                      OVRDTA
     A            ONH3           8A  B 17 21DSPATR(PR)
     A                                      OVRDTA
     A            QTY3           8A  B 17 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            FRAN4          4A  B 17 43
     A N95                                  DSPATR(ND)
     A                                      DSPATR(PR)
     A            LOC4          12A  B 17 48DSPATR(PR)
     A                                      OVRDTA
     A            ONH4           8A  B 17 62DSPATR(PR)
     A                                      OVRDTA
     A            QTY4           8A  B 17 72DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            FRAN5          4A  B 18  2
     A N95                                  DSPATR(ND)
     A                                      DSPATR(PR)
     A            LOC5          12A  B 18  7DSPATR(PR)
     A                                      OVRDTA
     A            ONH5           8A  B 18 21DSPATR(PR)
     A                                      OVRDTA
     A            QTY5           8A  B 18 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            FRAN6          4A  B 18 43
     A N95                                  DSPATR(ND)
     A                                      DSPATR(PR)
     A            LOC6          12A  B 18 48DSPATR(PR)
     A                                      OVRDTA
     A            ONH6           8A  B 18 62DSPATR(PR)
     A                                      OVRDTA
     A            QTY6           8A  B 18 72DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            DISB          30A  B 20 28DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-ISSUES MENU f2-RETURNS M-
     A                                      ENU f3-END PROGRAM                 -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A                                  1 13'-----------------------------------
     A                                      ------------------'
     A                                  2 13':  BANBURY EXPLOSION CORRECTION - -
     A                                      RETURN MATERIAL  :'
     A                                  3 13'-----------------------------------
     A                                      ------------------'
     A          R RTSNGL3
     A*%%TS  SD  19980305  124950  A193138     REL-V3R7M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 75'MP6-2'
     A                                  6  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  7  1'CODE     KEYWORD'
     A                                  7 30'ADJECTIVE'
     A                                  7 59'UM'
     A                                  7 69'AVAIL'
     A                                  9  1'DESC'
     A                                 10 64'EXP. CLASS'
     A                                 11  2'EMPL'
     A                                 11 14'PROD. DATE'
     A                                 11 31'REQ DEPT'
     A                                 11 46'CREDIT DEPT     (CHG ACCT/NW#)'
     A                                 15  2'FRAN'
     A N95                                  DSPATR(ND)
     A                                      OVRATR
     A                                 15  7'LOCATION......ONHAND....RETURNED'
     A                                 15 43'FRAN'
     A N95                                  DSPATR(ND)
     A                                      OVRATR
     A                                 15 48'LOCATION......ONHAND....RETURNED'
     A                                 20  1'DISBURSEMENT INSTRUCTION -'
     A                                 22  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A            CODE          12A  B  5  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            INSTRUCTIO    62A  B  5 17DSPATR(PR)
     A                                      OVRDTA
     A            VCODE          8A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            KWRDADJ       46A  B  8 10DSPATR(PR)
     A                                      OVRDTA
     A            UM             2A  B  8 59DSPATR(PR)
     A                                      OVRDTA
     A            AVAIL         10A  B  8 64DSPATR(PR)
     A                                      OVRDTA
     A            DESC          72A  B  9  7DSPATR(PR)
     A                                      OVRDTA
     A            EMPL           4A  B 12  2DSPATR(PR)
     A                                      OVRDTA
     A            WO            10A  B 12 14DSPATR(PR)
     A                                      OVRDTA
     A            REQ            4A  B 12 33DSPATR(PR)
     A                                      OVRDTA
     A            CHRG           4A  B 12 48DSPATR(PR)
     A                                      OVRDTA
     A            C1             2A  B 12 53DSPATR(PR)
     A                                      OVRDTA
     A            EXP            6A  B 12 66DSPATR(PR)
     A                                      OVRDTA
     A            NN             2A  B 12 74DSPATR(PR)
     A                                      OVRDTA
     A            FRAN1          4A  B 16  2
     A N95                                  DSPATR(ND)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A            LOC1          12A  B 16  7DSPATR(PR)
     A                                      OVRDTA
     A            ONH1           8A  B 16 21DSPATR(PR)
     A                                      OVRDTA
     A            QTY1           8A  B 16 31DSPATR(PR)
     A                                      OVRDTA
     A            FRAN2          4A  B 16 43
     A N95                                  DSPATR(ND)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A            LOC2          12A  B 16 48DSPATR(PR)
     A                                      OVRDTA
     A            ONH2           8A  B 16 62DSPATR(PR)
     A                                      OVRDTA
     A            QTY2           8A  B 16 72DSPATR(PR)
     A                                      OVRDTA
     A            FRAN3          4A  B 17  2
     A N95                                  DSPATR(ND)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A            LOC3          12A  B 17  7DSPATR(PR)
     A                                      OVRDTA
     A            ONH3           8A  B 17 21DSPATR(PR)
     A                                      OVRDTA
     A            QTY3           8A  B 17 31DSPATR(PR)
     A                                      OVRDTA
     A            FRAN4          4A  B 17 43
     A N95                                  DSPATR(ND)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A            LOC4          12A  B 17 48DSPATR(PR)
     A                                      OVRDTA
     A            ONH4           8A  B 17 62DSPATR(PR)
     A                                      OVRDTA
     A            QTY4           8A  B 17 72DSPATR(PR)
     A                                      OVRDTA
     A            FRAN5          4A  B 18  2
     A N95                                  DSPATR(ND)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A            LOC5          12A  B 18  7DSPATR(PR)
     A                                      OVRDTA
     A            ONH5           8A  B 18 21DSPATR(PR)
     A                                      OVRDTA
     A            QTY5           8A  B 18 31DSPATR(PR)
     A                                      OVRDTA
     A            FRAN6          4A  B 18 43
     A N95                                  DSPATR(ND)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A            LOC6          12A  B 18 48DSPATR(PR)
     A                                      OVRDTA
     A            ONH6           8A  B 18 62DSPATR(PR)
     A                                      OVRDTA
     A            QTY6           8A  B 18 72DSPATR(PR)
     A                                      OVRDTA
     A            DISB          30A  B 20 28DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-ISSUES MENU f2-RETURNS M-
     A                                      ENU f3-END PROGRAM                 -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A                                  2 12':  BANBURY EXPLOSION CORRECTION - -
     A                                      RETURN MATERIAL  :'
     A                                  1 12'-----------------------------------
     A                                      ------------------'
     A                                  3 12'-----------------------------------
     A                                      ------------------'
