     A*            11:05:13    T881S28     VRMENTRY.HPTO38.CME
     A                                      DSPSIZ(24 80 *DS3)
     A                                      INDARA
     A                                      PRINT
     A                                      CHGINPDFT
     A  98                                  INVITE
     A          R ENTRYSCR1
     A                                      PUTOVR
     A                                      CF02
     A                                      CA03
     A                                  2 12'R A W   M A T E R I A L   E N T R'
     A                                  2 46'Y   S C R E E N'
     A                                  2 71'RWM-E'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  4  2'ENTER RAW MATERIAL CODES AND THEIR'
     A                                  4 37'DAILY REQUIREMENTS BELOW.  PRESS "-
     A                                      ENTER"'
     A                                  5  2'TO CONTINUE ONTO A NEW SCREEN, "f2-
     A                                      " TO RUN INVENTORY POSITION REPORT.-
     A                                      '
     A                                  6  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  7  4'FINISHED STOCK VALUE'
     A                                  9  6'MATERIAL'
     A                                  9 21'DLY REQUIREMENT'
     A                                  9 45'MATERIAL     DLY REQUIREMENT'
     A            STOCKVAL       9Y 0B  7 28DSPATR(UL)
     A                                      CHECK(RB ME)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            MATERIAL1     12A  B 11  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            POUNDS1        8Y 0B 11 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            MATERIAL2     12A  B 11 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            POUNDS2        8Y 0B 11 62DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            MATERIAL3     12A  B 12  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            POUNDS3        8Y 0B 12 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            MATERIAL4     12A  B 12 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            POUNDS4        8Y 0B 12 62DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            MATERIAL5     12A  B 13  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            POUNDS5        8Y 0B 13 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            MATERIAL6     12A  B 13 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            POUNDS6        8Y 0B 13 62DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            MATERIAL7     12A  B 14  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            POUNDS7        8Y 0B 14 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            MATERIAL8     12A  B 14 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            POUNDS8        8Y 0B 14 62DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            MATERIAL9     12A  B 15  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            POUNDS9        8Y 0B 15 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            MATERIAL10    12A  B 15 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            POUNDS10       8Y 0B 15 62DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            MATERIAL11    12A  B 16  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            POUNDS11       8Y 0B 16 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            MATERIAL12    12A  B 16 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            POUNDS12       8Y 0B 16 62DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            MATERIAL13    12A  B 17  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            POUNDS13       8Y 0B 17 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            MATERIAL14    12A  B 17 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            POUNDS14       8Y 0B 17 62DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            MATERIAL15    12A  B 18  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            POUNDS15       8Y 0B 18 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            MATERIAL16    12A  B 18 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            POUNDS16       8Y 0B 18 62DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            MATERIAL17    12A  B 19  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            POUNDS17       8Y 0B 19 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            MATERIAL18    12A  B 19 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            POUNDS18       8Y 0B 19 62DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            MATERIAL19    12A  B 20  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            POUNDS19       8Y 0B 20 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A            MATERIAL20    12A  B 20 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            POUNDS20       8Y 0B 20 62DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            MATERIAL21    12A  B 21  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A            POUNDS21       8Y 0B 21 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A            MATERIAL22    12A  B 21 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A            POUNDS22       8Y 0B 21 62DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A            MATERIAL23    12A  B 22  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A            POUNDS23       8Y 0B 22 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(PC)
     A            MATERIAL24    12A  B 22 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A            POUNDS24       8Y 0B 22 62DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A            DUMMY          1A  B 23 79DSPATR(MDT ND PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f2-SUBMIT REPORT f3-EXIT   -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R ENTRYSCR2
     A                                      PUTOVR
     A                                      CF02
     A                                      CA03
     A                                  2 12'R A W   M A T E R I A L   E N T R'
     A                                  2 46'Y   S C R E E N'
     A                                  2 71'RWM-E'
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  4  2'ENTER RAW MATERIAL CODES AND THEIR'
     A                                  4 37'DAILY REQUIREMENTS BELOW.  PRESS "-
     A                                      ENTER"'
     A                                  5  2'TO CONTINUE ONTO A NEW SCREEN, "f2-
     A                                      " TO RUN INVENTORY POSITION REPORT.-
     A                                      '
     A                                  6  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  7  4'FINISHED STOCK VALUE'
     A                                  9  6'MATERIAL'
     A                                  9 21'DLY REQUIREMENT'
     A                                  9 45'MATERIAL     DLY REQUIREMENT'
     A            STOCKVAL       9Y 0B  7 28DSPATR(PR)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A            MATERIAL1     12A  B 11  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02
     AO 97 96                               DSPATR(PC)
     A            POUNDS1        8Y 0B 11 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            MATERIAL2     12A  B 11 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            POUNDS2        8Y 0B 11 62DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            MATERIAL3     12A  B 12  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            POUNDS3        8Y 0B 12 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            MATERIAL4     12A  B 12 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            POUNDS4        8Y 0B 12 62DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            MATERIAL5     12A  B 13  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            POUNDS5        8Y 0B 13 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            MATERIAL6     12A  B 13 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            POUNDS6        8Y 0B 13 62DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            MATERIAL7     12A  B 14  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            POUNDS7        8Y 0B 14 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            MATERIAL8     12A  B 14 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            POUNDS8        8Y 0B 14 62DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            MATERIAL9     12A  B 15  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            POUNDS9        8Y 0B 15 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            MATERIAL10    12A  B 15 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            POUNDS10       8Y 0B 15 62DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            MATERIAL11    12A  B 16  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            POUNDS11       8Y 0B 16 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            MATERIAL12    12A  B 16 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            POUNDS12       8Y 0B 16 62DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            MATERIAL13    12A  B 17  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            POUNDS13       8Y 0B 17 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            MATERIAL14    12A  B 17 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            POUNDS14       8Y 0B 17 62DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            MATERIAL15    12A  B 18  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            POUNDS15       8Y 0B 18 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            MATERIAL16    12A  B 18 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            POUNDS16       8Y 0B 18 62DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            MATERIAL17    12A  B 19  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            POUNDS17       8Y 0B 19 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            MATERIAL18    12A  B 19 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            POUNDS18       8Y 0B 19 62DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            MATERIAL19    12A  B 20  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            POUNDS19       8Y 0B 20 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A            MATERIAL20    12A  B 20 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            POUNDS20       8Y 0B 20 62DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            MATERIAL21    12A  B 21  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A            POUNDS21       8Y 0B 21 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A            MATERIAL22    12A  B 21 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A            POUNDS22       8Y 0B 21 62DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A            MATERIAL23    12A  B 22  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A            POUNDS23       8Y 0B 22 25DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(PC)
     A            MATERIAL24    12A  B 22 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A            POUNDS24       8Y 0B 22 62DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A            DUMMY          1A  B 23 79DSPATR(MDT ND PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f2-SUBMIT REPORT f3-EXIT   -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R RMACTIVE
     A                                      PUTOVR
     A                                      CA03
     A                                  4  5'-----------------------------------
     A                                      ---------------------------------'
     A                                  5  5':'
     A                                  5 71':'
     A                                  6  5':  R A W   M A T E R I A L   I N V'
     A                                  6 40'E N T O R Y   P O S I T I O N  :'
     A                                  7  5':'
     A                                  7 71':'
     A                                  8  5':'
     A                                  8 31'R E P O R T'
     A                                  8 71':'
     A                                  9  5':'
     A                                  9 71':'
     A                                 10  5'-----------------------------------
     A                                      ---------------------------------'
     A                                 13  7'****'
     A                                 13 65'****'
     A                                 14  7'****'
     A                                 14 18'PROGRAM IS PRESENTLY BEING ACCESSE-
     A                                      D BY'
     A                                 14 65'****'
     A                                 15  7'****'
     A                                 15 18'ANOTHER USER OR PROCESS'
     A                                 15 65'****'
     A                                 16  7'****'
     A                                 16 65'****'
     A                                 17  7'****'
     A                                 17 18'PRESS "f3" TO EXIT'
     A                                 17 65'****'
     A                                 18  7'****'
     A                                 18 65'****'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
