     A*%%TS  SD  19991206  152333  A257947     REL-V4R2M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A          R RMSFL                     SFL
     A*%%TS  SD  19991116  123854  A257947     REL-V4R2M0  5769-PW1
     A            FLD001        78A  B  4  2DSPATR(PR)
     A          R RMSFLC                    SFLCTL(RMSFL)
     A*%%TS  SD  19991206  152333  A257947     REL-V4R2M0  5769-PW1
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(0019)
     A                                      CA03(03 'EXIT')
     A                                      OVERLAY
     A                                      PUTOVR
     A  70                                  SFLDSP
     A  71                                  SFLDSPCTL
     A  72                                  SFLCLR
     A  73                                  SFLEND(*MORE)
     A                                  1 30'RAW MATERIAL INVENTORY'
     A                                      DSPATR(HI)
     A                                  3  2'MATERIAL    POUNDS'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  3 22'MATERIAL    POUNDS'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  3 42'MATERIAL    POUNDS'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  3 62'MATERIAL    POUNDS'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A          R RMREC
     A*%%TS  SD  19991116  123854  A257947     REL-V4R2M0  5769-PW1
     A                                 24  2'F3=EXIT'
     A          R RMSCRN
     A*%%TS  SD  19991116  143910  A257947     REL-V4R2M0  5769-PW1
     A                                      PUTOVR
     A                                      CA03(03 'EXIT')
     A                                  3 30'RAW MATERIAL INVENTORY'
     A                                      DSPATR(HI)
     A                                  6 13'ENTER ONE TO EIGHT CHARACTERS OF D-
     A                                      ESIRED STARTING POINT.'
     A                                  8 16'LEAVE BLANK TO START AT THE BEGINN-
     A                                      ING OF THE LIST.'
     A            MATLNAME       8A  B 11 37DSPATR(UL)
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                 14 25'LAST UPDATE:'
     A            DATE           8A  B 14 39DSPATR(PR)
     A                                      OVRDTA
     A            TIME           8A  B 14 49DSPATR(PR)
     A                                      OVRDTA
     A                                 24  5'F3=EXIT'
     A  60        MSGLINE       78   M
