     A*%%TS  SD  20031106  151705  Z010830     REL-V5R2M0  5722-WDS
     A*****************************************************************
     A** FILE NAME  :  ZRSNCDPF
     A**
     A** DESCRIPTION:  DISPLAY FILE FOR CATALOG SELECTION
     A**
     A** AUTHOR     :  DAN RAUCH - EXLTECH, LLC
     A** CREATED    :  09-25-2003
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT(HI UL)
     A                                      INDARA
     A                                      CF03
     A**===============================================================
     A**=== HEADING LINE
     A**===============================================================
     A          R H01
     A                                  1  3'Date:'
     A                                  1  9DATE
     A                                      EDTCDE(Y)
     A                                  1 26'Reason Code Selection Screen'
     A                                      DSPATR(HI)
     A                                  1 65'Time:'
     A                                  1 71TIME
     A            VERSION       10   O  2 65
     A**===============================================================
     A**=== SUBFILE
     A**===============================================================
     A          R SFL01                     SFL
     A  86                                  SFLNXTCHG
     A            SEL            1A  B 10  3
     A            RCODE          4A  O 10  7
     A            RDESC         65A  O 10 13
     A**===============================================================
     A**=== CONTROL RECORD
     A**===============================================================
     A          R CTL01                     SFLCTL(SFL01)
     A*%%TS  SD  20031106  151705  Z010830     REL-V5R2M0  5722-WDS
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(0010)
     A                                      OVERLAY
     A  85                                  SFLDSP
     A  84                                  SFLCLR
     A                                      SFLDSPCTL
     A  83                                  SFLEND(*MORE)
     A                                      CF04
     A            CRRN           4S 0H      SFLRCDNBR(CURSOR *TOP)
     A            CREC          10A  H
     A            CFLD          10A  H
     A                                  4  6'You have selected an item which is-
     A                                       NOT the lowest price item in the'
     A                                      COLOR(RED)
     A                                  5  6'AribaBuyer Catalog -OR- you have a-
     A                                      ttempted to bypass the AribaBuyer'
     A                                      COLOR(RED)
     A                                  6  6'process. Select the appropriate Re-
     A                                      ason Code below.'
     A                                      COLOR(RED)
     A                                  8  2'(X)'
     A                                  9  2'Sel'
     A                                      DSPATR(UL)
     A                                  9  7'Code'
     A                                      DSPATR(UL)
     A                                  9 13'Description                       -
     A                                                                     '
     A                                      DSPATR(UL)
     A**===============================================================
     A**=== PROCESSES MESSAGE LINE - SFL
     A**===============================================================
     A          R B01
     A                                      OVERLAY
     A            MSSG          78A  O 22  2
     A  99                                  DSPATR(RI)
     A  99                                  COLOR(RED)
     A N99                                  DSPATR(HI)
     A                                 23  2'F3-Exit'
     A                                      DSPATR(BL)
     A                                      COLOR(BLU)
