     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A          R VRTVZONE
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A                                  2  2':                                 -
     A                                                                         -
     A                                              :'
     A                                  3  2':                                 -
     A                                                                         -
     A                                              :'
     A                                  4  2':              EEEEEE   NNN   NN  -
     A                                       TTTTTT   EEEEEE   RRRRR           -
     A                                              :'
     A                                  5  2':              EE       NNNN  NN  -
     A                                         TT     EE       RR  RR          -
     A                                              :'
     A                                  6  2':              EEEE     NN NN NN  -
     A                                         TT     EEEE     RRRRR           -
     A                                              :'
     A                                  7  2':              EE       NN  NNNN  -
     A                                         TT     EE       RR RR           -
     A                                              :'
     A                                  8  2':              EEEEEE   NN   NNN  -
     A                                         TT     EEEEEE   RR  RR          -
     A                                              :'
     A                                  9  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 10  2':                  ZZZZZZ    OOOOO-
     A                                          NNN   NN   EEEEEE              -
     A                                              :'
     A                                 11  2':                     ZZ    OO   O-
     A                                      O   NNNN  NN   EE                  -
     A                                              :'
     A                                 12  2':                    ZZ     OO   O-
     A                                      O   NN NN NN   EEEE                -
     A                                              :'
     A                                 13  2':                   ZZ      OO   O-
     A                                      O   NN  NNNN   EE                  -
     A                                              :'
     A                                 14  2':                  ZZZZZZ    OOOOO-
     A                                          NN   NNN   EEEEEE              -
     A                                              :'
     A                                 15  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 16  2':               ==================-
     A                                      ========================           -
     A                                              :'
     A                                 17  2':               :                 -
     A                                                             :           -
     A                                              :'
     A                                 18  2':               :'
     A            ZONE           4A  B 18 37ALIAS(S_ZONE)
     A                                      DSPATR(UL)
     A  01                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 18 59':                   :'
     A                                 19  2':               :                 -
     A                                                             :           -
     A                                              :'
     A                                 20  2':               ==================-
     A                                      ========================           -
     A                                              :'
     A                                 21  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 22  2':           PRESS THE ''f4'' KEY T-
     A                                      O SELECT FROM VALID ZONE LIST      -
     A                                                :'
     A                                 23  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('  F3=RETURN TO MENU')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R ZONES
     A                                      SFL
     A            SEL            1A  B  4  4DSPATR(UL)
     A            ZONE           4A  B  4  7DSPATR(PR)
     A          R ZONELIST
     A                                      SFLCTL(ZONES)
     A                                      OVERLAY
     A  75                                  SFLDSP
     A  76                                  SFLDSPCTL
     A  77                                  SFLCLR
     A N74                                  SFLEND(*MORE)
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(126)
     A                                      SFLLIN(4)
     A                                  1  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A                                  2 23'V A L I D   Z O N E   L I S T'
     A                                  3  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A          R ZONECMD
     A                                 23 15'PLACE AN X BESIDE CHOICE AND PRESS-
     A                                       THE ENTER KEY'
     A                                      DSPATR(HI)
