     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A          R EQUIPS
     A                                      SFL
     A            SEL            1A  B  4  3DSPATR(UL)
     A            EQUIP          6A  B  4  6DSPATR(PR)
     A          R EQPLIST
     A                                      SFLCTL(EQUIPS)
     A                                      OVERLAY
     A  75                                  SFLDSP
     A  76                                  SFLDSPCTL
     A  77                                  SFLCLR
     A N74                                  SFLEND(*MORE)
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(108)
     A                                      SFLLIN(4)
     A                                  1  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A                                  2 23'V A L I D   E Q U I P M E N T'
     A                                  3  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A          R EQPCMD
     A                                 23 15'PLACE AN X BESIDE CHOICE AND PRESS-
     A                                       THE ENTER KEY'
     A                                      DSPATR(HI)
     A          R EQPDISP
     A  98                                  INVITE
     A                                      PUTOVR
     A                                  1  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                  2 31'E Q U I P M E N T'
     A                                  3  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A                                 10  5'NUMBER'
     A            ENUMBER        6A  B 10 12OVRDTA
     A                                      DSPATR(PR)
     A                                 10 19'TYPE'
     A            ETYPE          8A  B 10 24DSPATR(PR)
     A                                      OVRDTA
     A                                 10 33'DEPT'
     A            DEPT           4A  B 10 38DSPATR(PR)
     A                                      OVRDTA
     A                                 10 43'ZONE'
     A            ZONE           4A  B 10 48DSPATR(PR)
     A                                      OVRDTA
     A                                 10 53'LOCATION'
     A            LOCATION       8A  B 10 62DSPATR(PR)
     A                                      OVRDTA
     A                                 10 72'RIME'
     A            RIME           1A  B 10 77DSPATR(PR)
     A                                      OVRDTA
     A                                 12  5'EXPCLASS'
     A            EXPCLASS       8A  B 12 14DSPATR(PR)
     A                                      OVRDTA
     A                                 12 23'DOWN COST PER HOUR'
     A            DOWNCOST       6A  B 12 42DSPATR(PR)
     A                                      OVRDTA
     A                                 12 49'SAFETY EQP'
     A            SAFETYFLG      1A  B 12 60DSPATR(PR)
     A                                      OVRDTA
     A                                 12 63'ASBESTOS WRN'
     A            ASBWRN         2A  B 12 76DSPATR(PR)
     A                                      OVRDTA
     A                                 14  5'LOCAL NAME / DESC'
     A            LOCALNAME     50A  B 14 28DSPATR(PR)
     A                                      OVRDTA
     A                                 16  5'CORPORATE NAME / DESC'
     A            CORPNAME      49A  B 16 28DSPATR(PR)
     A                                      OVRDTA
     A                                 18  2'= = = = = = = = = = = = = = = = = -
     A                                      = = = = = = = = = = = = = = = = = =-
     A                                       = = = ='
     A            COMMANDLN1    79A  B 24  1
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
