     A*%%TS  DD  19940711  144853  T881S32     REL-V2R3M0  5738-CD1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      INDARA
     A                                      INVITE
     A                                      PRINT
     A                                      CHGINPDFT
     A          R INITSAF
     A*%%TS  DD  19940509  130524  T881S32     REL-V2R3M0  5738-CD1
     A                                      PUTOVR
     A                                      CF03
     A                                  2  5'S A F E T Y  C O N T A C T'
     A                                  2 35'ENTER YOUR BADGE NUMBER:'
     A            CCNUM          4A  B  2 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(PC)
     A  08                                  DSPATR(PR)
     A                                  2 67'(OPTIONAL)'
     A                                  4  4'WHERE WAS CONTACT MADE:'
     A            WHERE          2A  B  4 29DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI PC)
     A  08                                  DSPATR(PR)
     A            F01            4A  B  6  5DSPATR(PR)
     A            S01           18A  B  6 10DSPATR(PR)
     A            F02            4A  B  6 30DSPATR(PR)
     A            S02           18A  B  6 35DSPATR(PR)
     A            F03            4A  B  6 55DSPATR(PR)
     A            S03           18A  B  6 60DSPATR(PR)
     A            F04            4A  B  7  5DSPATR(PR)
     A            S04           18A  B  7 10DSPATR(PR)
     A            F05            4A  B  7 30DSPATR(PR)
     A            S05           18A  B  7 35DSPATR(PR)
     A            F06            4A  B  7 55DSPATR(PR)
     A            S06           18A  B  7 60DSPATR(PR)
     A            F07            4A  B  8  5DSPATR(PR)
     A            S07           18A  B  8 10DSPATR(PR)
     A            F08            4A  B  8 30DSPATR(PR)
     A            S08           18A  B  8 35DSPATR(PR)
     A            F09            4A  B  8 55DSPATR(PR)
     A            S09           18A  B  8 60DSPATR(PR)
     A            F10            4A  B  9  5DSPATR(PR)
     A            S10           18A  B  9 10DSPATR(PR)
     A            F11            4A  B  9 30DSPATR(PR)
     A            S11           18A  B  9 35DSPATR(PR)
     A            F12            4A  B  9 55DSPATR(PR)
     A            S12           18A  B  9 60DSPATR(PR)
     A            F13            4A  B 10  5DSPATR(PR)
     A            S13           18A  B 10 10DSPATR(PR)
     A            F14            4A  B 10 30DSPATR(PR)
     A            S14           18A  B 10 35DSPATR(PR)
     A            F15            4A  B 10 55DSPATR(PR)
     A            S15           18A  B 10 60DSPATR(PR)
     A            F16            4A  B 11  5DSPATR(PR)
     A            S16           18A  B 11 10DSPATR(PR)
     A            F17            4A  B 11 30DSPATR(PR)
     A            S17           18A  B 11 35DSPATR(PR)
     A            F18            4A  B 11 55DSPATR(PR)
     A            S18           18A  B 11 60DSPATR(PR)
     A                                 13  4'WHAT TYPE OF CONTACT WAS MADE:'
     A            TYPE           1A  B 13 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI PC)
     A  08                                  DSPATR(PR)
     A            LAWMSG        18A  B 13 52DSPATR(PR)
     A                                      OVRDTA
     A            LAWMLT         1A  B 13 72
     A N53                                  DSPATR(PR)
     A  53 09                               DSPATR(UL)
     A  09                                  DSPATR(PC)
     A                                      OVRATR
     A                                      OVRDTA
     A                                 15  5' 1 - POSITIVE CONTACT'
     A                                 15 30' 3 - UNSAFE CONDITION'
     A                                 15 53'(CONDITION CORRECTED)'
     A                                 16  5' 2 - AT-RISK BEHAVIOR'
     A                                 16 30' 4 - UNSAFE CONDITION'
     A                                 16 53'(MAINTENANCE REQUIRED)'
     A            EQPMSG        23A  B 17  8DSPATR(PR)
     A                                      OVRDTA
     A            EQUIP          6A  B 17 33
     A N08                                  DSPATR(PR)
     A  04 05                               DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            CFTMSG        21A  B 17 46DSPATR(PR)
     A                                      OVRDTA
     A            CRAFT          2A  B 17 69
     A N08                                  DSPATR(PR)
     A  04 05                               DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 18  4'DESCRIPTION OF CONTACT:'
     A                                 18 29'(Enter what you observed and what -
     A                                      action you took)'
     A            DESCA         66A  B 19  6DSPATR(UL)
     A  06                                  DSPATR(RI PC)
     A  08                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A            DESCB         66A  B 20  6DSPATR(UL)
     A  06                                  DSPATR(RI)
     A  08                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A            MSG           50A  B 22 14DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('      f3-EXIT PROGRAM      -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INITLOAD
     A*%%TS  DD  19940317  082944  T881S32     REL-V2R3M0  5738-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF03
     A                                      CF05
     A                                      CF07
     A                                      CF09
     A                                  2  3'S  A  F  E  T  Y   C  O  N  T  A  -
     A                                      C  T  S'
     A                                  2 55'CONTACT LOCATIONS - ZONE'
     A                                  3  3'==================================-
     A                                      ===================================-
     A                                      ======='
     A                                  4  3'Enter Safety Contact locations fro-
     A                                      m the top'
     A                                  4 49' 1 -'
     A            S01           18A  B  4 54DSPATR(UL)
     A                                      OVRDTA
     A                                  4 73'-'
     A            Z01            4A  B  4 75DSPATR(UL)
     A  01                                  DSPATR(RI PC)
     A                                      OVRATR
     A                                      OVRDTA
     A                                  5  3'down in the order you wish them to-
     A                                       appear on'
     A                                  5 49' 2 -'
     A            S02           18A  B  5 54DSPATR(UL)
     A                                      OVRDTA
     A                                  5 73'-'
     A            Z02            4A  B  5 75DSPATR(UL)
     A  02                                  DSPATR(RI PC)
     A                                      OVRATR
     A                                      OVRDTA
     A                                  6  3'the Initiate Screen.  If you wish -
     A                                      to view'
     A                                  6 49' 3 -'
     A            S03           18A  B  6 54DSPATR(UL)
     A                                      OVRDTA
     A                                  6 73'-'
     A            Z03            4A  B  6 75DSPATR(UL)
     A  03                                  DSPATR(RI PC)
     A                                      OVRATR
     A                                      OVRDTA
     A                                  7  3'Safety Contact data sorted by plan-
     A                                      t Zone, '
     A                                  7 49' 4 -'
     A            S04           18A  B  7 54DSPATR(UL)
     A                                      OVRDTA
     A                                  7 73'-'
     A            Z04            4A  B  7 75DSPATR(UL)
     A  04                                  DSPATR(RI PC)
     A                                      OVRATR
     A                                      OVRDTA
     A                                  8  3'enter the Zone to be associated wi-
     A                                      th each'
     A                                  8 49' 5 -'
     A            S05           18A  B  8 54DSPATR(UL)
     A                                      OVRDTA
     A                                  8 73'-'
     A            Z05            4A  B  8 75DSPATR(UL)
     A  05                                  DSPATR(RI PC)
     A                                      OVRATR
     A                                      OVRDTA
     A                                  9  3'location next to the entry.  Two o-
     A                                      r more'
     A                                  9 49' 6 -'
     A            S06           18A  B  9 54DSPATR(UL)
     A                                      OVRDTA
     A                                  9 73'-'
     A            Z06            4A  B  9 75DSPATR(UL)
     A  06                                  DSPATR(RI PC)
     A                                      OVRATR
     A                                      OVRDTA
     A                                 10  3'entries may be associated with the-
     A                                       same Zone'
     A                                 10 49' 7 -'
     A            S07           18A  B 10 54DSPATR(UL)
     A                                      OVRDTA
     A                                 10 73'-'
     A            Z07            4A  B 10 75DSPATR(UL)
     A  07                                  DSPATR(RI PC)
     A                                      OVRATR
     A                                      OVRDTA
     A                                 11  3'if desired.  From 1 to 18 location-
     A                                      s may be'
     A                                 11 49' 8 -'
     A            S08           18A  B 11 54DSPATR(UL)
     A                                      OVRDTA
     A                                 11 73'-'
     A            Z08            4A  B 11 75DSPATR(UL)
     A  08                                  DSPATR(RI PC)
     A                                      OVRATR
     A                                      OVRDTA
     A                                 12  3'entered and unused locations will -
     A                                      not appear.'
     A                                 12 49' 9 -'
     A            S09           18A  B 12 54DSPATR(UL)
     A                                      OVRDTA
     A                                 12 73'-'
     A            Z09            4A  B 12 75DSPATR(UL)
     A  09                                  DSPATR(RI PC)
     A                                      OVRATR
     A                                      OVRDTA
     A                                 13  3'Existing data will be shown in the-
     A                                       fields,'
     A                                 13 49'10 -'
     A            S10           18A  B 13 54DSPATR(UL)
     A                                      OVRDTA
     A                                 13 73'-'
     A            Z10            4A  B 13 75DSPATR(UL)
     A  10                                  DSPATR(RI PC)
     A                                      OVRATR
     A                                      OVRDTA
     A                                 14  3'make any additions or changes and -
     A                                      press ENTER'
     A                                 14 49'11 -'
     A            S11           18A  B 14 54DSPATR(UL)
     A                                      OVRDTA
     A                                 14 73'-'
     A            Z11            4A  B 14 75DSPATR(UL)
     A  11                                  DSPATR(RI PC)
     A                                      OVRATR
     A                                      OVRDTA
     A                                 15  3'to save your changes.  Press f1 to-
     A                                       RESET the'
     A                                 15 49'12 -'
     A            S12           18A  B 15 54DSPATR(UL)
     A                                      OVRDTA
     A                                 15 73'-'
     A            Z12            4A  B 15 75DSPATR(UL)
     A  12                                  DSPATR(RI PC)
     A                                      OVRATR
     A                                      OVRDTA
     A                                 16  3'screen to the last saved data.  Pr-
     A                                      ess f5 to'
     A                                 16 49'13 -'
     A            S13           18A  B 16 54DSPATR(UL)
     A                                      OVRDTA
     A                                 16 73'-'
     A            Z13            4A  B 16 75DSPATR(UL)
     A  13                                  DSPATR(RI PC)
     A                                      OVRATR
     A                                      OVRDTA
     A                                 17  3'RESTORE the DATABASE data erasing -
     A                                      ALL your'
     A                                 17 49'14 -'
     A            S14           18A  B 17 54DSPATR(UL)
     A                                      OVRDTA
     A                                 17 73'-'
     A            Z14            4A  B 17 75DSPATR(UL)
     A  14                                  DSPATR(RI PC)
     A                                      OVRATR
     A                                      OVRDTA
     A                                 18  3'changes. Press f7 to PREVIEW your -
     A                                      entries on'
     A                                 18 49'15 -'
     A            S15           18A  B 18 54DSPATR(UL)
     A                                      OVRDTA
     A                                 18 73'-'
     A            Z15            4A  B 18 75DSPATR(UL)
     A  15                                  DSPATR(RI PC)
     A                                      OVRATR
     A                                      OVRDTA
     A                                 19  3'the Initiate Screen.  If you wish -
     A                                      to skip an'
     A                                 19 49'16 -'
     A            S16           18A  B 19 54DSPATR(UL)
     A                                      OVRDTA
     A                                 19 73'-'
     A            Z16            4A  B 19 75DSPATR(UL)
     A  16                                  DSPATR(RI PC)
     A                                      OVRATR
     A                                      OVRDTA
     A                                 20  3'entry number, enter the word "SKIP-
     A                                      " for that'
     A                                 20 49'17 -'
     A            S17           18A  B 20 54DSPATR(UL)
     A                                      OVRDTA
     A                                 20 73'-'
     A            Z17            4A  B 20 75DSPATR(UL)
     A  17                                  DSPATR(RI PC)
     A                                      OVRATR
     A                                      OVRDTA
     A                                 21  3'location.  That number will appear-
     A                                      , but will'
     A                                 21 49'18 -'
     A            S18           18A  B 21 54DSPATR(UL)
     A                                      OVRDTA
     A                                 21 73'-'
     A            Z18            4A  B 21 75DSPATR(UL)
     A  18                                  DSPATR(RI PC)
     A                                      OVRATR
     A                                      OVRDTA
     A                                 22  3'be blank on the Initiate Screen.  -
     A                                      Press f9 to enter a DEFAULT CRAFT v-
     A                                      alue.'
     A                                 23  3'Press f3 to EXIT the program and w-
     A                                      rite the screen data to the DATABAS-
     A                                      E.'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1 - RESET   f3 - EXIT   f5-
     A                                       - RESTORE   f7 - PREVIEW   f9 - DE-
     A                                      FAULT CRAFT')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INITVIEW
     A*%%TS  DD  19940308  112105  T881S32     REL-V2R3M0  5738-CD1
     A                                      PUTOVR
     A                                      CF03
     A                                  2  5'S A F E T Y  C O N T A C T'
     A                                  2 35'ENTER YOUR BADGE NUMBER:  ____  (O-
     A                                      PTIONAL)'
     A                                  4  4'WHERE WAS CONTACT MADE:  __'
     A            F01            4A  B  6  5DSPATR(PR)
     A                                      OVRDTA
     A            S01           18A  B  6 10DSPATR(PR)
     A                                      OVRDTA
     A            F02            4A  B  6 30DSPATR(PR)
     A                                      OVRDTA
     A            S02           18A  B  6 35DSPATR(PR)
     A                                      OVRDTA
     A            F03            4A  B  6 55DSPATR(PR)
     A                                      OVRDTA
     A            S03           18A  B  6 60DSPATR(PR)
     A                                      OVRDTA
     A            F04            4A  B  7  5DSPATR(PR)
     A                                      OVRDTA
     A            S04           18A  B  7 10DSPATR(PR)
     A                                      OVRDTA
     A            F05            4A  B  7 30DSPATR(PR)
     A                                      OVRDTA
     A            S05           18A  B  7 35DSPATR(PR)
     A                                      OVRDTA
     A            F06            4A  B  7 55DSPATR(PR)
     A                                      OVRDTA
     A            S06           18A  B  7 60DSPATR(PR)
     A                                      OVRDTA
     A            F07            4A  B  8  5DSPATR(PR)
     A                                      OVRDTA
     A            S07           18A  B  8 10DSPATR(PR)
     A                                      OVRDTA
     A            F08            4A  B  8 30DSPATR(PR)
     A                                      OVRDTA
     A            S08           18A  B  8 35DSPATR(PR)
     A                                      OVRDTA
     A            F09            4A  B  8 55DSPATR(PR)
     A                                      OVRDTA
     A            S09           18A  B  8 60DSPATR(PR)
     A                                      OVRDTA
     A            F10            4A  B  9  5DSPATR(PR)
     A                                      OVRDTA
     A            S10           18A  B  9 10DSPATR(PR)
     A                                      OVRDTA
     A            F11            4A  B  9 30DSPATR(PR)
     A                                      OVRDTA
     A            S11           18A  B  9 35DSPATR(PR)
     A                                      OVRDTA
     A            F12            4A  B  9 55DSPATR(PR)
     A                                      OVRDTA
     A            S12           18A  B  9 60DSPATR(PR)
     A                                      OVRDTA
     A            F13            4A  B 10  5DSPATR(PR)
     A                                      OVRDTA
     A            S13           18A  B 10 10DSPATR(PR)
     A                                      OVRDTA
     A            F14            4A  B 10 30DSPATR(PR)
     A                                      OVRDTA
     A            S14           18A  B 10 35DSPATR(PR)
     A                                      OVRDTA
     A            F15            4A  B 10 55DSPATR(PR)
     A                                      OVRDTA
     A            S15           18A  B 10 60DSPATR(PR)
     A                                      OVRDTA
     A            F16            4A  B 11  5DSPATR(PR)
     A                                      OVRDTA
     A            S16           18A  B 11 10DSPATR(PR)
     A                                      OVRDTA
     A            F17            4A  B 11 30DSPATR(PR)
     A                                      OVRDTA
     A            S17           18A  B 11 35DSPATR(PR)
     A                                      OVRDTA
     A            F18            4A  B 11 55DSPATR(PR)
     A                                      OVRDTA
     A            S18           18A  B 11 60DSPATR(PR)
     A                                      OVRDTA
     A                                 13  4'WHAT TYPE OF CONTACT WAS MADE:  _'
     A                                 15  5' 1 - POSITIVE CONTACT'
     A                                 15 30' 3 - UNSAFE CONDITION'
     A                                 15 53'(CONDITION CORRECTED)'
     A                                 16  5' 2 - AT-RISK BEHAVIOR'
     A                                 16 30' 4 - UNSAFE CONDITION'
     A                                 16 53'(MAINTENANCE REQUIRED)'
     A                                 18  4'DESCRIPTION OF CONTACT:'
     A                                 18 29'(Enter what you observed and what -
     A                                      action you took)'
     A                                 19  6'__________________________________-
     A                                      ________________________________'
     A                                 20  6'__________________________________-
     A                                      ________________________________'
     A                                 22 16'PRESS f3 TO RETURN TO THE LOCATION-
     A                                       INPUT SCREEN'
     A            COMMANDLN1    79A  B 24  1DFTVAL('      f3-EXIT PROGRAM      -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R DFTCRAFT
     A*%%TS  DD  19940314  135821  T881S32     REL-V2R3M0  5738-CD1
     A                                      PUTOVR
     A                                      CF03
     A                                  2 16'E N T E R   D E F A U L T   C R A -
     A                                      F T   V A L U E'
     A                                  3 15'==================================-
     A                                      ================='
     A                                  5  7'If a Type 4 Safety Contact, UNSAFE-
     A                                       CONDITION (Maintenance Required),'
     A                                  7  7'is initiated; the system will auto-
     A                                      matically create an MMIS Breakdown'
     A                                  9  7'Workorder for the repair.  In orde-
     A                                      r to produce these workorders, the'
     A                                 11  7'EQUIPMENT NUMBER to be repaired mu-
     A                                      st be entered as well as the CRAFT'
     A                                 13  7'required to make the repair.  If y-
     A                                      ou wish to use a default CRAFT for'
     A                                 15  7'these workorders, enter the value -
     A                                      here to avoid typing it each time.'
     A                                 17  7'Enter a valid CRAFT for your plant-
     A                                       and press the ''ENTER'' key.  If a'
     A                                 19  7'DEFAULT CRAFT has already been ent-
     A                                      ered, it will appear in the field.'
     A                                 21 12'>>>'
     A                                 21 17'DEFAULT CRAFT FOR SAFETY CONTACT W-
     A                                      ORKORDERS:'
     A            DFTCFT         2A  B 21 63DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  01                                  DSPATR(RI PC)
     A                                 21 67'<<<'
     A            COMMANDLN1    79A  B 24  1DFTVAL('       f3 - EXIT SCREEN  (R-
     A                                      ETURN)')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R SYSTEMSW
     A*%%TS  DD  19940509  070633  T881S32     REL-V2R3M0  5738-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF03
     A                                      CF05
     A                                  1 20'S A F E T Y   C O N T A C T   S Y -
     A                                      S T E M'
     A                                  3  5'YOUR SAFETY CONTACT LOCATIONS WILL-
     A                                       LOOK LIKE THIS ON THE INITIATE SCR-
     A                                      EEN:'
     A            F01            4A  B  5  5DSPATR(PR)
     A                                      OVRDTA
     A            S01           18A  B  5 10DSPATR(PR)
     A                                      OVRDTA
     A            F02            4A  B  5 30DSPATR(PR)
     A                                      OVRDTA
     A            S02           18A  B  5 35DSPATR(PR)
     A                                      OVRDTA
     A            F03            4A  B  5 55DSPATR(PR)
     A                                      OVRDTA
     A            S03           18A  B  5 60DSPATR(PR)
     A                                      OVRDTA
     A            F04            4A  B  6  5DSPATR(PR)
     A                                      OVRDTA
     A            S04           18A  B  6 10DSPATR(PR)
     A                                      OVRDTA
     A            F05            4A  B  6 30DSPATR(PR)
     A                                      OVRDTA
     A            S05           18A  B  6 35DSPATR(PR)
     A                                      OVRDTA
     A            F06            4A  B  6 55DSPATR(PR)
     A                                      OVRDTA
     A            S06           18A  B  6 60DSPATR(PR)
     A                                      OVRDTA
     A            F07            4A  B  7  5DSPATR(PR)
     A                                      OVRDTA
     A            S07           18A  B  7 10DSPATR(PR)
     A                                      OVRDTA
     A            F08            4A  B  7 30DSPATR(PR)
     A                                      OVRDTA
     A            S08           18A  B  7 35DSPATR(PR)
     A                                      OVRDTA
     A            F09            4A  B  7 55DSPATR(PR)
     A                                      OVRDTA
     A            S09           18A  B  7 60DSPATR(PR)
     A                                      OVRDTA
     A            F10            4A  B  8  5DSPATR(PR)
     A                                      OVRDTA
     A            S10           18A  B  8 10DSPATR(PR)
     A                                      OVRDTA
     A            F11            4A  B  8 30DSPATR(PR)
     A                                      OVRDTA
     A            S11           18A  B  8 35DSPATR(PR)
     A                                      OVRDTA
     A            F12            4A  B  8 55DSPATR(PR)
     A                                      OVRDTA
     A            S12           18A  B  8 60DSPATR(PR)
     A                                      OVRDTA
     A            F13            4A  B  9  5DSPATR(PR)
     A                                      OVRDTA
     A            S13           18A  B  9 10DSPATR(PR)
     A                                      OVRDTA
     A            F14            4A  B  9 30DSPATR(PR)
     A                                      OVRDTA
     A            S14           18A  B  9 35DSPATR(PR)
     A                                      OVRDTA
     A            F15            4A  B  9 55DSPATR(PR)
     A                                      OVRDTA
     A            S15           18A  B  9 60DSPATR(PR)
     A                                      OVRDTA
     A            F16            4A  B 10  5DSPATR(PR)
     A                                      OVRDTA
     A            S16           18A  B 10 10DSPATR(PR)
     A                                      OVRDTA
     A            F17            4A  B 10 30DSPATR(PR)
     A                                      OVRDTA
     A            S17           18A  B 10 35DSPATR(PR)
     A                                      OVRDTA
     A            F18            4A  B 10 55DSPATR(PR)
     A                                      OVRDTA
     A            S18           18A  B 10 60DSPATR(PR)
     A                                      OVRDTA
     A                                 13  4'To activate the Safety Contact Sys-
     A                                      tem, the letters "ON" must appear i-
     A                                      n the'
     A                                 14  4'following field.  If "ON" already -
     A                                      appears in the field, the system ha-
     A                                      s been'
     A                                 15  4'activated and may turned "OFF" by -
     A                                      entering spaces in the field.  Ente-
     A                                      r'
     A                                 16  4'SPACES or "ON" and press the ENTER-
     A                                       key:'
     A            SWITCH         2A  B 16 45DSPATR(RI UL)
     A                                      OVRDTA
     A                                 16 49'Press f3 to EXIT the program'
     A                                 17  4'and save your input.  Press f1 to -
     A                                      return to the location input screen-
     A                                      .'
     A                                 19  4'All Safety Contact records will be-
     A                                       purged'
     A            DFLTCYC        2A  B 19 46DSPATR(PR)
     A                                      OVRDTA
     A                                 19 49'days after creation.  Press'
     A                                 20  4'the f5 key to change the purge-cyc-
     A                                      le time.'
     A                                 22 22'THE SAFETY CONTACT SYSTEM IS'
     A            ONOFF          3A  B 22 51DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('      f3-EXIT PROGRAM      -
     A                                      f1-RETURN TO INPUT SCREEN      f5-S-
     A                                      ET PURGE CYCLE   ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R DELCYCLE
     A*%%TS  DD  19940509  070633  T881S32     REL-V2R3M0  5738-CD1
     A                                      PUTOVR
     A                                      CF03
     A                                  2 20'S A F E T Y   C O N T A C T   S Y -
     A                                      S T E M'
     A                                  4  6'SELECT THE NUMBER OF DAYS YOU WISH-
     A                                       TO SAVE YOUR SAFETY CONTACT RECORD-
     A                                      S:'
     A            CYCLE1         1A  B  6 34DSPATR(UL)
     A                                      OVRDTA
     A                                  6 36'-'
     A                                  6 38'30 DAYS'
     A            CYCLE2         1A  B  8 34DSPATR(UL)
     A                                      OVRDTA
     A                                  8 38'45 DAYS'
     A                                  8 47'(Default)'
     A            CYCLE3         1A  B 10 34DSPATR(UL)
     A                                      OVRDTA
     A                                 10 36'-'
     A                                 10 38'60 DAYS'
     A            CYCLE4         1A  B 12 34DSPATR(UL)
     A                                      OVRDTA
     A                                 12 36'-'
     A                                 12 38'90 DAYS'
     A                                 14  6'Place a character in front of the -
     A                                      cycle time you select and press the'
     A                                 16  6'''ENTER'' key.  When Safety Contac-
     A                                      t records are created, they are dat-
     A                                      e'
     A                                 18  6'stamped.  Each record will be purg-
     A                                      ed from the file the number of days'
     A                                 20 25'selected after they were created.'
     A                                 22  7'SAFETY CONTACT RECORDS WILL BE PUR-
     A                                      GED'
     A            CYCLE          2A  B 22 45DSPATR(PR)
     A                                      OVRDTA
     A                                 22 48'DAYS AFTER THEY ARE CREATED.'
     A            COMMANDLN1    79A  B 24  1DFTVAL('      f3-EXIT PROGRAM      -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R SELPRINT
     A*%%TS  DD  19940628  091558  T881S32     REL-V2R3M0  5738-CD1
     A                                      PUTOVR
     A                                      CF03
     A                                  2 17'* * * * * * * * * * * * * * * * * -
     A                                      * * * * * * * *'
     A                                  3 17'*'
     A                                  3 65'*'
     A                                  4 17'*'
     A                                  4 21'S A F E T Y   C O N T A C T   S Y -
     A                                      S T E M'
     A                                  4 65'*'
     A                                  5 17'*'
     A                                  5 65'*'
     A                                  6 17'* * * * * * * * * * * * * * * * * -
     A                                      * * * * * * * *'
     A                                  8  8'Enter Starting DATE:'
     A            STMON          2A  B  8 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(PC RI)
     A                                  8 33'/'
     A            STDAY          2A  B  8 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(PC RI)
     A                                  8 38'/'
     A            STYEAR         4A  B  8 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(PC RI)
     A                                  8 51'(MM/DD/YYYY - Required)'
     A                                 11 10'Enter Ending DATE:'
     A            ENDMON         2A  B 11 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(PC RI)
     A                                 11 33'/'
     A            ENDDAY         2A  B 11 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(PC RI)
     A                                 11 38'/'
     A            ENDYEAR        4A  B 11 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(PC RI)
     A                                 11 51'(MM/DD/YYYY - Optional)'
     A                                 14 17'Enter ZONE:'
     A            ZONE           4A  B 14 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(PC RI)
     A                                 14 37'(Blank field is ALL Zones - Option-
     A                                      al)'
     A                                 16 15'Enter any character to print Summa-
     A                                      ry Report only:'
     A            REPORT         1A  B 16 66DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(PC RI)
     A                                 18  5'Enter Start Date or Date Range to -
     A                                      be printed.  If only a single Zone -
     A                                      is'
     A                                 20 11'desired, enter the Zone of interes-
     A                                      t and press the ENTER key.'
     A            COMMANDLN1    79A  B 24  1DFTVAL('      f3-EXIT PROGRAM      -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R SELSHOW
     A*%%TS  DD  19940711  144853  T881S32     REL-V2R3M0  5738-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF03
     A                                      CF05
     A                                  2 20'S A F E T Y   C O N T A C T   S Y -
     A                                      S T E M'
     A                                  4 11'ENTER YOUR SAFETY CONTACT LOCATION-
     A                                       AND PRESS THE ''ENTER'' KEY:'
     A            F01            4A  B  6  5DSPATR(PR)
     A                                      OVRDTA
     A            S01           18A  B  6 10DSPATR(PR)
     A                                      OVRDTA
     A            F02            4A  B  6 30DSPATR(PR)
     A                                      OVRDTA
     A            S02           18A  B  6 35DSPATR(PR)
     A                                      OVRDTA
     A            F03            4A  B  6 55DSPATR(PR)
     A                                      OVRDTA
     A            S03           18A  B  6 60DSPATR(PR)
     A                                      OVRDTA
     A            F04            4A  B  7  5DSPATR(PR)
     A                                      OVRDTA
     A            S04           18A  B  7 10DSPATR(PR)
     A                                      OVRDTA
     A            F05            4A  B  7 30DSPATR(PR)
     A                                      OVRDTA
     A            S05           18A  B  7 35DSPATR(PR)
     A                                      OVRDTA
     A            F06            4A  B  7 55DSPATR(PR)
     A                                      OVRDTA
     A            S06           18A  B  7 60DSPATR(PR)
     A                                      OVRDTA
     A            F07            4A  B  8  5DSPATR(PR)
     A                                      OVRDTA
     A            S07           18A  B  8 10DSPATR(PR)
     A                                      OVRDTA
     A            F08            4A  B  8 30DSPATR(PR)
     A                                      OVRDTA
     A            S08           18A  B  8 35DSPATR(PR)
     A                                      OVRDTA
     A            F09            4A  B  8 55DSPATR(PR)
     A                                      OVRDTA
     A            S09           18A  B  8 60DSPATR(PR)
     A                                      OVRDTA
     A            F10            4A  B  9  5DSPATR(PR)
     A                                      OVRDTA
     A            S10           18A  B  9 10DSPATR(PR)
     A                                      OVRDTA
     A            F11            4A  B  9 30DSPATR(PR)
     A                                      OVRDTA
     A            S11           18A  B  9 35DSPATR(PR)
     A                                      OVRDTA
     A            F12            4A  B  9 55DSPATR(PR)
     A                                      OVRDTA
     A            S12           18A  B  9 60DSPATR(PR)
     A                                      OVRDTA
     A            F13            4A  B 10  5DSPATR(PR)
     A                                      OVRDTA
     A            S13           18A  B 10 10DSPATR(PR)
     A                                      OVRDTA
     A            F14            4A  B 10 30DSPATR(PR)
     A                                      OVRDTA
     A            S14           18A  B 10 35DSPATR(PR)
     A                                      OVRDTA
     A            F15            4A  B 10 55DSPATR(PR)
     A                                      OVRDTA
     A            S15           18A  B 10 60DSPATR(PR)
     A                                      OVRDTA
     A            F16            4A  B 11  5DSPATR(PR)
     A                                      OVRDTA
     A            S16           18A  B 11 10DSPATR(PR)
     A                                      OVRDTA
     A            F17            4A  B 11 30DSPATR(PR)
     A                                      OVRDTA
     A            S17           18A  B 11 35DSPATR(PR)
     A                                      OVRDTA
     A            F18            4A  B 11 55DSPATR(PR)
     A                                      OVRDTA
     A            S18           18A  B 11 60DSPATR(PR)
     A                                      OVRDTA
     A                                 14 18'Display Safety Contacts for Locati-
     A                                      on:'
     A            SAFCON         2A  B 14 57
     A                                      DSPATR(UL)
     A  01                                  DSPATR(RI PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 17 10'Inquiry will display everything or-
     A                                      iginated TODAY:'
     A            CURDATE       10A  B 17 61OVRDTA
     A                                      DSPATR(PR)
     A                                 19  4'To display records originated TODA-
     A                                      Y by a single person, enter Clock C-
     A                                      ard:'
     A                                 21 28'Clock Card Number:'
     A            CCBUF          4A  B 21 48
     A  02                                  DSPATR(RI PC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A            COMMANDLN1    79A  B 24  1DFTVAL('             f3-EXIT PROGRA-
     A                                      M     ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R SCSHOWSAV
     A*%%TS  DD  19940711  144853  T881S32     REL-V2R3M0  5738-CD1
     A                                      PUTOVR
     A                                      CF03
     A                                  1 21'S A F E T Y   C O N T A C T   S Y -
     A                                      S T E M'
     A                                  2  2'Records originated in Location'
     A            LOCBUF        18A  B  2 33
     A                                  2 52'on'
     A            MMBUF         10A  B  2 55
     A            SHIFTBUF      14A  B  2 66
     A                                  3  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A            LIN01         78A  B  4  2DSPATR(PR)
     A                                      OVRDTA
     A            LIN02         78A  B  5  2DSPATR(PR)
     A                                      OVRDTA
     A            LIN03         78A  B  6  2DSPATR(PR)
     A                                      OVRDTA
     A            LIN04         78A  B  7  2DSPATR(PR)
     A                                      OVRDTA
     A            LIN05         78A  B  8  2DSPATR(PR)
     A                                      OVRDTA
     A            LIN06         78A  B  9  2DSPATR(PR)
     A                                      OVRDTA
     A            LIN07         78A  B 10  2DSPATR(PR)
     A                                      OVRDTA
     A            LIN08         78A  B 11  2DSPATR(PR)
     A                                      OVRDTA
     A            LIN09         78A  B 12  2DSPATR(PR)
     A                                      OVRDTA
     A            LIN10         78A  B 13  2DSPATR(PR)
     A                                      OVRDTA
     A            LIN11         78A  B 14  2DSPATR(PR)
     A                                      OVRDTA
     A            LIN12         78A  B 15  2DSPATR(PR)
     A                                      OVRDTA
     A            LIN13         78A  B 16  2DSPATR(PR)
     A                                      OVRDTA
     A            LIN14         78A  B 17  2DSPATR(PR)
     A                                      OVRDTA
     A            LIN15         78A  B 18  2DSPATR(PR)
     A                                      OVRDTA
     A            LIN16         78A  B 19  2DSPATR(PR)
     A                                      OVRDTA
     A            LIN17         78A  B 20  2DSPATR(PR)
     A                                      OVRDTA
     A            LIN18         78A  B 21  2DSPATR(PR)
     A                                      OVRDTA
     A            LIN19         78A  B 22  2DSPATR(PR)
     A                                      OVRDTA
     A            LIN20         78A  B 23  2DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('      f3-EXIT PROGRAM      -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R RDSF                      SFL
     A            DLINE         78A  B  4  2DSPATR(PR)
     A          R SCSHOW                    SFLCTL(RDSF)
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(20)
     A                                      CF03
     A                                      CF08
     A                                      OVERLAY
     A N74                                  SFLEND
     A  75                                  SFLDSP
     A  76                                  SFLDSPCTL
     A  77                                  SFLCLR
     A                                  1 21'S A F E T Y   C O N T A C T   S Y -
     A                                      S T E M'
     A                                  2  2'Records originated in Location'
     A            LOCBUF        18A  B  2 33
     A                                  2 52'on'
     A            DATBUF        10A  B  2 55
     A            CCBUF         14A  B  2 66
     A                                  3  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A          R RDSB
     A                                 24 10'PRESS ENTER TO END DISPLAY'
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A*%%CP+999CRTDSPF
     A*%%CP+    FILE(MCPRD0/ZSCSYSTEM)
     A*%%CP+    SRCFILE(MCPRD0/QDDSSRC)
     A*%%CP+    SRCMBR(ZSCSYSTEM)
     A*%%CP+    TEXT(*SRCMBRTXT)
     A*%%CP     RSTDSP(*YES)
