     A*****************************************************************
     A**                D I S P L A Y   F I L E
     A*****************************************************************
     A** FILE NAME  :  ZSEADPXIQ
     A**
     A** DESCRIPTION:  ONLINE REQ APPROVAL REQ EXPLODE DEPARTMENTS RPT
     A**
     A** AUTHOR     :  DAN RAUCH - EXLTECH, LLC
     A** CREATED    :  MAR 9, 2005
     A**
     A** FORMATS    :  EADEPTIQ
     A**
     A*****************************************************************
     A** COPIED FROM ZCSISINQ
     A*****************************************************************
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A          R EADPTXIQ
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 11'EXPLOSION DEPARTMENT RECORDS'
     A                                  3  1'EXPLODE DEPT    DEPARTMENTS TO EXP-
     A                                      LODE TO'
     A            DEPLINE1      79A  B  4  1DSPATR(PR)
     A                                      OVRDTA
     A            DEPLINE2      79A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            DEPLINE3      79A  B  6  1DSPATR(PR)
     A                                      OVRDTA
     A            DEPLINE4      79A  B  7  1DSPATR(PR)
     A                                      OVRDTA
     A            DEPLINE5      79A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            DEPLINE6      79A  B  9  1DSPATR(PR)
     A                                      OVRDTA
     A            DEPLINE7      79A  B 10  1DSPATR(PR)
     A                                      OVRDTA
     A            DEPLINE8      79A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            DEPLINE9      79A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            DEPLINEA      79A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            DEPLINEB      79A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            DEPLINEC      79A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            DEPLINED      79A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            DEPLINEE      79A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            DEPLINEF      79A  B 18  1DSPATR(PR)
     A                                      OVRDTA
     A            DEPLINEG      79A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('F1-START OVER F2-NEXT SCREE-
     A                                      N F3-END INQUIRY                   -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
