     A*****************************************************************
     A**                D I S P L A Y   F I L E
     A*****************************************************************
     A** FILE NAME  :  ZSEARETRN
     A**
     A** DESCRIPTION:  ONLINE REQ APPROVALS- RETURN A REQ SUBPROGRAM
     A**
     A** AUTHOR     :  DAN RAUCH - EXLTECH, LLC
     A** CREATED    :  MAR 9, 2005
     A**
     A** FORMATS    :  EARETRN
     A**
     A*****************************************************************
     A** COPIED FROM ZCSISINQ
     A*****************************************************************
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A          R FEARETRN
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 15'R E T U R N   A   R E Q U I S I T'
     A                                  1 49'I O N'
     A                                  3 10'YOUR EMPLOYEE ID NUMBER: '
     A                                  5 10'REASON FOR RETURN:'
     A                                  8  7'LEVEL  I/O  QUEUED     APPROVED  E-
     A                                      MPL   EMPL NAME'
     A                                 22  1'TYPE REASON FOR RETURN, AND PUT AN'
     A                                 22 36'"X" NEXT TO LEVEL TO RETURN TO, OR'
     A                                 22 71'HIT "f3"'
     A                                 23  1'TO EXIT WITHOUT RETURNING REQUISIT-
     A                                      ION.'
     A            EMPL           4A  B  3 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            REASON1       36A  B  5 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            REASON2       36A  B  6 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            A              1A  B  9  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            L1             2A  B  9  8DSPATR(PR)
     A                                      OVRDTA
     A            M              1A  B  9 15DSPATR(PR)
     A                                      OVRDTA
     A            QUEUED01       8A  B  9 19DSPATR(PR)
     A                                      OVRDTA
     A            APPRVD01       8A  B  9 30DSPATR(PR)
     A                                      OVRDTA
     A            EM01           4A  B  9 40DSPATR(PR)
     A                                      OVRDTA
     A            NAME01        16A  B  9 47DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B 10  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            L2             2A  B 10  8DSPATR(PR)
     A                                      OVRDTA
     A            N              1A  B 10 15DSPATR(PR)
     A                                      OVRDTA
     A            QUEUED02       8A  B 10 19DSPATR(PR)
     A                                      OVRDTA
     A            APPRVD02       8A  B 10 30DSPATR(PR)
     A                                      OVRDTA
     A            EM02           4A  B 10 40DSPATR(PR)
     A                                      OVRDTA
     A            NAME02        16A  B 10 47DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 11  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            L3             2A  B 11  8DSPATR(PR)
     A                                      OVRDTA
     A            O              1A  B 11 15DSPATR(PR)
     A                                      OVRDTA
     A            QUEUED03       8A  B 11 19DSPATR(PR)
     A                                      OVRDTA
     A            APPRVD03       8A  B 11 30DSPATR(PR)
     A                                      OVRDTA
     A            EM03           4A  B 11 40DSPATR(PR)
     A                                      OVRDTA
     A            NAME03        16A  B 11 47DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 12  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            L4             2A  B 12  8DSPATR(PR)
     A                                      OVRDTA
     A            P              1A  B 12 15DSPATR(PR)
     A                                      OVRDTA
     A            QUEUED04       8A  B 12 19DSPATR(PR)
     A                                      OVRDTA
     A            APPRVD04       8A  B 12 30DSPATR(PR)
     A                                      OVRDTA
     A            EM04           4A  B 12 40DSPATR(PR)
     A                                      OVRDTA
     A            NAME04        16A  B 12 47DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 13  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            L5             2A  B 13  8DSPATR(PR)
     A                                      OVRDTA
     A            Q              1A  B 13 15DSPATR(PR)
     A                                      OVRDTA
     A            QUEUED05       8A  B 13 19DSPATR(PR)
     A                                      OVRDTA
     A            APPRVD05       8A  B 13 30DSPATR(PR)
     A                                      OVRDTA
     A            EM05           4A  B 13 40DSPATR(PR)
     A                                      OVRDTA
     A            NAME05        16A  B 13 47DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 14  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A            L6             2A  B 14  8DSPATR(PR)
     A                                      OVRDTA
     A            R              1A  B 14 15DSPATR(PR)
     A                                      OVRDTA
     A            QUEUED06       8A  B 14 19DSPATR(PR)
     A                                      OVRDTA
     A            APPRVD06       8A  B 14 30DSPATR(PR)
     A                                      OVRDTA
     A            EM06           4A  B 14 40DSPATR(PR)
     A                                      OVRDTA
     A            NAME06        16A  B 14 47DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 15  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A            L7             2A  B 15  8DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B 15 15DSPATR(PR)
     A                                      OVRDTA
     A            QUEUED07       8A  B 15 19DSPATR(PR)
     A                                      OVRDTA
     A            APPRVD07       8A  B 15 30DSPATR(PR)
     A                                      OVRDTA
     A            EM07           4A  B 15 40DSPATR(PR)
     A                                      OVRDTA
     A            NAME07        16A  B 15 47DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 16  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A            L8             2A  B 16  8DSPATR(PR)
     A                                      OVRDTA
     A            T              1A  B 16 15DSPATR(PR)
     A                                      OVRDTA
     A            QUEUED08       8A  B 16 19DSPATR(PR)
     A                                      OVRDTA
     A            APPRVD08       8A  B 16 30DSPATR(PR)
     A                                      OVRDTA
     A            EM08           4A  B 16 40DSPATR(PR)
     A                                      OVRDTA
     A            NAME08        16A  B 16 47DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 17  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A            L9             2A  B 17  8DSPATR(PR)
     A                                      OVRDTA
     A            U              1A  B 17 15DSPATR(PR)
     A                                      OVRDTA
     A            QUEUED09       8A  B 17 19DSPATR(PR)
     A                                      OVRDTA
     A            APPRVD09       8A  B 17 30DSPATR(PR)
     A                                      OVRDTA
     A            EM09           4A  B 17 40DSPATR(PR)
     A                                      OVRDTA
     A            NAME09        16A  B 17 47DSPATR(PR)
     A                                      OVRDTA
     A            J              1A  B 18  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  67                                  DSPATR(RI)
     A  67                                  DSPATR(PC)
     A            L0             2A  B 18  8DSPATR(PR)
     A                                      OVRDTA
     A            V              1A  B 18 15DSPATR(PR)
     A                                      OVRDTA
     A            QUEUED10       8A  B 18 19DSPATR(PR)
     A                                      OVRDTA
     A            APPRVD10       8A  B 18 30DSPATR(PR)
     A                                      OVRDTA
     A            EM10           4A  B 18 40DSPATR(PR)
     A                                      OVRDTA
     A            NAME10        16A  B 18 47DSPATR(PR)
     A                                      OVRDTA
     A            K              1A  B 19  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  74                                  DSPATR(RI)
     A  74                                  DSPATR(PC)
     A            M1             2A  B 19  8DSPATR(PR)
     A                                      OVRDTA
     A            W              1A  B 19 15DSPATR(PR)
     A                                      OVRDTA
     A            QUEUED11       8A  B 19 19DSPATR(PR)
     A                                      OVRDTA
     A            APPRVD11       8A  B 19 30DSPATR(PR)
     A                                      OVRDTA
     A            EM11           4A  B 19 40DSPATR(PR)
     A                                      OVRDTA
     A            NAME11        16A  B 19 47DSPATR(PR)
     A                                      OVRDTA
     A            L              1A  B 20  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  81                                  DSPATR(RI)
     A  81                                  DSPATR(PC)
     A            M2             2A  B 20  8DSPATR(PR)
     A                                      OVRDTA
     A            X              1A  B 20 15DSPATR(PR)
     A                                      OVRDTA
     A            QUEUED12       8A  B 20 19DSPATR(PR)
     A                                      OVRDTA
     A            APPRVD12       8A  B 20 30DSPATR(PR)
     A                                      OVRDTA
     A            EM12           4A  B 20 40DSPATR(PR)
     A                                      OVRDTA
     A            NAME12        16A  B 20 47DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-  END    PROGRAM        -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
