     A*****************************************************************
     A**                D I S P L A Y   F I L E
     A*****************************************************************
     A** FILE NAME  :  ZSEAUSEIQ
     A**
     A** DESCRIPTION:  ONLINE REQ APPROVAL - USER INQUIRY
     A**
     A** AUTHOR     :  DAN RAUCH - EXLTECH, LLC
     A** CREATED    :  MAR 9, 2005
     A**
     A** FORMATS    :  EAUSERINQ
     A**
     A*****************************************************************
     A** COPIED FROM ZCSISINQ
     A*****************************************************************
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A          R EAUSERINQ
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 20'REQUISITION APPROVAL - USER INQUIR-
     A                                      Y'
     A                                  3  5'ID    LEVEL  NAME'
     A                                  3 37'LEVEL DESCRIPTION'
     A                                  3 74'ACTIVE?'
     A            P              1A  B  4  2DSPATR(UL)
     A            ID1            4A  B  4  5DSPATR(PR)
     A                                      OVRDTA
     A            L1             2A  B  4 12DSPATR(PR)
     A                                      OVRDTA
     A            NAME1         16A  B  4 18DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESC1    36A  B  4 37DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B  4 76DSPATR(PR)
     A                                      OVRDTA
     A            Q              1A  B  5  2DSPATR(UL)
     A            ID2            4A  B  5  5DSPATR(PR)
     A                                      OVRDTA
     A            L2             2A  B  5 12DSPATR(PR)
     A                                      OVRDTA
     A            NAME2         16A  B  5 18DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESC2    36A  B  5 37DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B  5 76DSPATR(PR)
     A                                      OVRDTA
     A            R              1A  B  6  2DSPATR(UL)
     A            ID3            4A  B  6  5DSPATR(PR)
     A                                      OVRDTA
     A            L3             2A  B  6 12DSPATR(PR)
     A                                      OVRDTA
     A            NAME3         16A  B  6 18DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESC3    36A  B  6 37DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B  6 76DSPATR(PR)
     A                                      OVRDTA
     A            S              1A  B  7  2DSPATR(UL)
     A            ID4            4A  B  7  5DSPATR(PR)
     A                                      OVRDTA
     A            L4             2A  B  7 12DSPATR(PR)
     A                                      OVRDTA
     A            NAME4         16A  B  7 18DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESC4    36A  B  7 37DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B  7 76DSPATR(PR)
     A                                      OVRDTA
     A            T              1A  B  8  2DSPATR(UL)
     A            ID5            4A  B  8  5DSPATR(PR)
     A                                      OVRDTA
     A            L5             2A  B  8 12DSPATR(PR)
     A                                      OVRDTA
     A            NAME5         16A  B  8 18DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESC5    36A  B  8 37DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B  8 76DSPATR(PR)
     A                                      OVRDTA
     A            U              1A  B  9  2DSPATR(UL)
     A            ID6            4A  B  9  5DSPATR(PR)
     A                                      OVRDTA
     A            L6             2A  B  9 12DSPATR(PR)
     A                                      OVRDTA
     A            NAME6         16A  B  9 18DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESC6    36A  B  9 37DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B  9 76DSPATR(PR)
     A                                      OVRDTA
     A            V              1A  B 10  2DSPATR(UL)
     A            ID7            4A  B 10  5DSPATR(PR)
     A                                      OVRDTA
     A            L7             2A  B 10 12DSPATR(PR)
     A                                      OVRDTA
     A            NAME7         16A  B 10 18DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESC7    36A  B 10 37DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 10 76DSPATR(PR)
     A                                      OVRDTA
     A            W              1A  B 11  2DSPATR(UL)
     A            ID8            4A  B 11  5DSPATR(PR)
     A                                      OVRDTA
     A            L8             2A  B 11 12DSPATR(PR)
     A                                      OVRDTA
     A            NAME8         16A  B 11 18DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESC8    36A  B 11 37DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 11 76DSPATR(PR)
     A                                      OVRDTA
     A            X              1A  B 12  2DSPATR(UL)
     A            ID9            4A  B 12  5DSPATR(PR)
     A                                      OVRDTA
     A            L9             2A  B 12 12DSPATR(PR)
     A                                      OVRDTA
     A            NAME9         16A  B 12 18DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESC9    36A  B 12 37DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 12 76DSPATR(PR)
     A                                      OVRDTA
     A            Y              1A  B 13  2DSPATR(UL)
     A            ID10           4A  B 13  5DSPATR(PR)
     A                                      OVRDTA
     A            L0             2A  B 13 12DSPATR(PR)
     A                                      OVRDTA
     A            NAME10        16A  B 13 18DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESCA    36A  B 13 37DSPATR(PR)
     A                                      OVRDTA
     A            J              1A  B 13 76DSPATR(PR)
     A                                      OVRDTA
     A            Z              1A  B 14  2DSPATR(UL)
     A            ID11           4A  B 14  5DSPATR(PR)
     A                                      OVRDTA
     A            M1             2A  B 14 12DSPATR(PR)
     A                                      OVRDTA
     A            NAME11        16A  B 14 18DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESCB    36A  B 14 37DSPATR(PR)
     A                                      OVRDTA
     A            K              1A  B 14 76DSPATR(PR)
     A                                      OVRDTA
     A            A1             1A  B 15  2DSPATR(UL)
     A            ID12           4A  B 15  5DSPATR(PR)
     A                                      OVRDTA
     A            M2             2A  B 15 12DSPATR(PR)
     A                                      OVRDTA
     A            NAME12        16A  B 15 18DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESCC    36A  B 15 37DSPATR(PR)
     A                                      OVRDTA
     A            L              1A  B 15 76DSPATR(PR)
     A                                      OVRDTA
     A            B2             1A  B 16  2DSPATR(UL)
     A            ID13           4A  B 16  5DSPATR(PR)
     A                                      OVRDTA
     A            M3             2A  B 16 12DSPATR(PR)
     A                                      OVRDTA
     A            NAME13        16A  B 16 18DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESCD    36A  B 16 37DSPATR(PR)
     A                                      OVRDTA
     A            M              1A  B 16 76DSPATR(PR)
     A                                      OVRDTA
     A            ENTERC         1A  B 17  2DSPATR(UL)
     A            ID14           4A  B 17  5DSPATR(PR)
     A                                      OVRDTA
     A            M4             2A  B 17 12DSPATR(PR)
     A                                      OVRDTA
     A            NAME14        16A  B 17 18DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESCE    36A  B 17 37DSPATR(PR)
     A                                      OVRDTA
     A            N              1A  B 17 76DSPATR(PR)
     A                                      OVRDTA
     A            C2             1A  B 18  2DSPATR(UL)
     A            ID15           4A  B 18  5DSPATR(PR)
     A                                      OVRDTA
     A            M5             2A  B 18 12DSPATR(PR)
     A                                      OVRDTA
     A            NAME15        16A  B 18 18DSPATR(PR)
     A                                      OVRDTA
     A            LEVELDESCF    36A  B 18 37DSPATR(PR)
     A                                      OVRDTA
     A            O              1A  B 18 76DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('F1-START OVER F2-NEXT SCREE-
     A                                      N F3-END INQUIRY                   -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
