     A*****************************************************************
     A**                D I S P L A Y   F I L E
     A*****************************************************************
     A** FILE NAME  :  ZSEAAPPIQ
     A**
     A** DESCRIPTION:  ONLINE REQ APPROVAL DISPLAY FILE
     A**
     A** AUTHOR     :  DAN RAUCH - EXLTECH, LLC
     A** CREATED    :  MAR 9, 2005
     A**
     A** FORMATS    :  FPOINQR     FPOINQD
     A**
     A*****************************************************************
     A** COPIED FROM ZCSISINQ
     A*****************************************************************
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A          R EAAPPINQ
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 17'REQUISITION APPROVAL STATUS INQUIR-
     A                                      Y'
     A                                  3  1'REQ NUMBER   REQ DATE   CORP CODE'
     A                                  3 37'QUANTITY UM   ESTIMATED PRICE   DA-
     A                                      TE WANTED'
     A                                  6 69'PRINTER #'
     A                                  7 28'PATH'
     A                                  7 43'APPROVALS LEFT'
     A                                  9  1'RETURNED BY:'
     A                                  9 20'REASON:'
     A                                 11  1'LV I QUE-DATE APP-DATE ID   NAME'
     A                                 11 46'COMMENTS'
     A            REQNUM        10A  B  4  1DSPATR(PR)
     A                                      OVRDTA
     A            REQDATE        8A  B  4 14DSPATR(PR)
     A                                      OVRDTA
     A            CORPCOD        8A  B  4 25DSPATR(PR)
     A                                      OVRDTA
     A            QTY            8A  B  4 37DSPATR(PR)
     A                                      OVRDTA
     A            UM             2A  B  4 46DSPATR(PR)
     A                                      OVRDTA
     A            ESTIMATEDP    15Y 4B  4 51EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            DATEWANT       8A  B  4 69DSPATR(PR)
     A                                      OVRDTA
     A            REQTYPE       59A  B  6  1DSPATR(PR)
     A                                      OVRDTA
     A            HOLDSTATUS    24A  B  7  1DSPATR(PR)
     A                                      OVRDTA
     A            PHT            3A  B  7 33DSPATR(PR)
     A                                      OVRDTA
     A            AL             2A  B  7 58DSPATR(PR)
     A                                      OVRDTA
     A            PRINTER        2A  B  7 72
     A  50                                  DSPATR(UL)
     A                                      OVRDTA
     A            RETB           4A  B  9 14DSPATR(PR)
     A                                      OVRDTA
     A            REASON1       36A  B  9 28DSPATR(PR)
     A                                      OVRDTA
     A            REASON2       36A  B 10 28DSPATR(PR)
     A                                      OVRDTA
     A            L1             2A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B 12  4DSPATR(PR)
     A                                      OVRDTA
     A            DATE1          8A  B 12  6DSPATR(PR)
     A                                      OVRDTA
     A            ADATE1         8A  B 12 15DSPATR(PR)
     A                                      OVRDTA
     A            ID1            4A  B 12 24DSPATR(PR)
     A                                      OVRDTA
     A            NAME1         16A  B 12 29DSPATR(PR)
     A                                      OVRDTA
     A            COMMENT1      33A  B 12 46DSPATR(PR)
     A                                      OVRDTA
     A            L2             2A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B 13  4DSPATR(PR)
     A                                      OVRDTA
     A            DATE2          8A  B 13  6DSPATR(PR)
     A                                      OVRDTA
     A            ADATE2         8A  B 13 15DSPATR(PR)
     A                                      OVRDTA
     A            ID2            4A  B 13 24DSPATR(PR)
     A                                      OVRDTA
     A            NAME2         16A  B 13 29DSPATR(PR)
     A                                      OVRDTA
     A            COMMENT2      33A  B 13 46DSPATR(PR)
     A                                      OVRDTA
     A            L3             2A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 14  4DSPATR(PR)
     A                                      OVRDTA
     A            DATE3          8A  B 14  6DSPATR(PR)
     A                                      OVRDTA
     A            ADATE3         8A  B 14 15DSPATR(PR)
     A                                      OVRDTA
     A            ID3            4A  B 14 24DSPATR(PR)
     A                                      OVRDTA
     A            NAME3         16A  B 14 29DSPATR(PR)
     A                                      OVRDTA
     A            COMMENT3      33A  B 14 46DSPATR(PR)
     A                                      OVRDTA
     A            L4             2A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 15  4DSPATR(PR)
     A                                      OVRDTA
     A            DATE4          8A  B 15  6DSPATR(PR)
     A                                      OVRDTA
     A            ADATE4         8A  B 15 15DSPATR(PR)
     A                                      OVRDTA
     A            ID4            4A  B 15 24DSPATR(PR)
     A                                      OVRDTA
     A            NAME4         16A  B 15 29DSPATR(PR)
     A                                      OVRDTA
     A            COMMENT4      33A  B 15 46DSPATR(PR)
     A                                      OVRDTA
     A            L5             2A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 16  4DSPATR(PR)
     A                                      OVRDTA
     A            DATE5          8A  B 16  6DSPATR(PR)
     A                                      OVRDTA
     A            ADATE5         8A  B 16 15DSPATR(PR)
     A                                      OVRDTA
     A            ID5            4A  B 16 24DSPATR(PR)
     A                                      OVRDTA
     A            NAME5         16A  B 16 29DSPATR(PR)
     A                                      OVRDTA
     A            COMMENT5      33A  B 16 46DSPATR(PR)
     A                                      OVRDTA
     A            L6             2A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 17  4DSPATR(PR)
     A                                      OVRDTA
     A            DATE6          8A  B 17  6DSPATR(PR)
     A                                      OVRDTA
     A            ADATE6         8A  B 17 15DSPATR(PR)
     A                                      OVRDTA
     A            ID6            4A  B 17 24DSPATR(PR)
     A                                      OVRDTA
     A            NAME6         16A  B 17 29DSPATR(PR)
     A                                      OVRDTA
     A            COMMENT6      33A  B 17 46DSPATR(PR)
     A                                      OVRDTA
     A            L7             2A  B 18  1DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 18  4DSPATR(PR)
     A                                      OVRDTA
     A            DATE7          8A  B 18  6DSPATR(PR)
     A                                      OVRDTA
     A            ADATE7         8A  B 18 15DSPATR(PR)
     A                                      OVRDTA
     A            ID7            4A  B 18 24DSPATR(PR)
     A                                      OVRDTA
     A            NAME7         16A  B 18 29DSPATR(PR)
     A                                      OVRDTA
     A            COMMENT7      33A  B 18 46DSPATR(PR)
     A                                      OVRDTA
     A            L8             2A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            H              1A  B 19  4DSPATR(PR)
     A                                      OVRDTA
     A            DATE8          8A  B 19  6DSPATR(PR)
     A                                      OVRDTA
     A            ADATE8         8A  B 19 15DSPATR(PR)
     A                                      OVRDTA
     A            ID8            4A  B 19 24DSPATR(PR)
     A                                      OVRDTA
     A            NAME8         16A  B 19 29DSPATR(PR)
     A                                      OVRDTA
     A            COMMENT8      33A  B 19 46DSPATR(PR)
     A                                      OVRDTA
     A            L9             2A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            I              1A  B 20  4DSPATR(PR)
     A                                      OVRDTA
     A            DATE9          8A  B 20  6DSPATR(PR)
     A                                      OVRDTA
     A            ADATE9         8A  B 20 15DSPATR(PR)
     A                                      OVRDTA
     A            ID9            4A  B 20 24DSPATR(PR)
     A                                      OVRDTA
     A            NAME9         16A  B 20 29DSPATR(PR)
     A                                      OVRDTA
     A            COMMENT9      33A  B 20 46DSPATR(PR)
     A                                      OVRDTA
     A            LA             2A  B 21  1DSPATR(PR)
     A                                      OVRDTA
     A            J              1A  B 21  4DSPATR(PR)
     A                                      OVRDTA
     A            DATE10         8A  B 21  6DSPATR(PR)
     A                                      OVRDTA
     A            ADATE10        8A  B 21 15DSPATR(PR)
     A                                      OVRDTA
     A            ID10           4A  B 21 24DSPATR(PR)
     A                                      OVRDTA
     A            NAME10        16A  B 21 29DSPATR(PR)
     A                                      OVRDTA
     A            COMMENT10     33A  B 21 46DSPATR(PR)
     A                                      OVRDTA
     A            LB             2A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            K              1A  B 22  4DSPATR(PR)
     A                                      OVRDTA
     A            DATE11         8A  B 22  6DSPATR(PR)
     A                                      OVRDTA
     A            ADATE11        8A  B 22 15DSPATR(PR)
     A                                      OVRDTA
     A            ID11           4A  B 22 24DSPATR(PR)
     A                                      OVRDTA
     A            NAME11        16A  B 22 29DSPATR(PR)
     A                                      OVRDTA
     A            COMMENT11     33A  B 22 46DSPATR(PR)
     A                                      OVRDTA
     A            LC             2A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            L              1A  B 23  4DSPATR(PR)
     A                                      OVRDTA
     A            DATE12         8A  B 23  6DSPATR(PR)
     A                                      OVRDTA
     A            ADATE12        8A  B 23 15DSPATR(PR)
     A                                      OVRDTA
     A            ID12           4A  B 23 24DSPATR(PR)
     A                                      OVRDTA
     A            NAME12        16A  B 23 29DSPATR(PR)
     A                                      OVRDTA
     A            COMMENT12     33A  B 23 46DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('F1-HELP F2-PATH DEF INQ F3--
     A                                      EXIT F5-QUICK PRNT F6-USER INQ F7-L-
     A                                      EVEL F8-PATHS INQ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
