     A*****************************************************************
     A**                D I S P L A Y   F I L E
     A*****************************************************************
     A** FILE NAME  :  ZSMCRAFT
     A**
     A** DESCRIPTION:  DISPLAY FILE FOR CRAFT SELECTION PGM
     A**
     A** AUTHOR     :  DAN RAUCH - EXLTECH, LLC
     A** CREATED    :  APR 20, 2005
     A**
     A** FORMATS    :  SFL01  CTL01 H01 B01S
     A*****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A                                      CF03
     A          R H01
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 26'M M I S   C R A F T   L I S T'
     A                                  1 71TIME
     A**********************************************************
     A*** SFL **************************************************
     A**********************************************************
     A          R SFL01                     SFL
     A            SEL1           1A  B  7  3DSPATR(UL)
     A  61                                  DSPATR(ND PR)
     A            SFCRAFT1       2A  O  7  6
     A            SFFLAG1        2A  O  7  9
     A            SFDESC1       12A  O  7 13
     A            SEL2           1A  B  7 30DSPATR(UL)
     A  62                                  DSPATR(ND PR)
     A            SFCRAFT2       2A  O  7 33
     A            SFFLAG2        2A  O  7 36
     A            SFDESC2       12A  O  7 40
     A            SEL3           1A  B  7 57DSPATR(UL)
     A  63                                  DSPATR(ND PR)
     A            SFCRAFT3       2A  O  7 60
     A            SFFLAG3        2A  O  7 63
     A            SFDESC3       12A  O  7 67
     A**********************************************************
     A*** SFLCTL ***********************************************
     A**********************************************************
     A          R CTL01                     SFLCTL(SFL01)
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(0016)
     A                                      CF01
     A                                      CF02
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A                                      CF10
     A                                      CF11
     A                                      CF12
     A                                      PUTOVR
     A                                      OVERLAY
     A  85                                  SFLDSP
     A                                      SFLDSPCTL
     A  84                                  SFLCLR
     A                                      ROLLUP(91)
     A            CRRN           4S 0H      SFLRCDNBR(CURSOR *TOP)
     A            CREC          10A  H
     A            CFLD          10A  H
     A                                  3  2'Position to Craft:'
     A            CCRAFT         2A  B  3 21DSPATR(UL)
     A                                      DSPATR(HI)
     A N60                              3 26'Select which CRAFT field to update-
     A                                       with 1,2 or 3'
     A                                      DSPATR(HI RI)
     A                                  5  6'Craft'
     A                                  5 33'Craft'
     A                                  5 60'Craft'
     A N60                              6  2'Sel'
     A                                      DSPATR(UL)
     A                                  6  6'/Flag'
     A                                      DSPATR(UL)
     A                                  6 13'Description '
     A                                      DSPATR(UL)
     A N60                              6 29'Sel'
     A                                      DSPATR(UL)
     A                                  6 33'/Flag'
     A                                      DSPATR(UL)
     A                                  6 40'Description '
     A                                      DSPATR(UL)
     A N60                              6 56'Sel'
     A                                      DSPATR(UL)
     A                                  6 60'/Flag'
     A                                      DSPATR(UL)
     A                                  6 67'Description '
     A                                      DSPATR(UL)
     A          R B01S
     A                                      OVERLAY
     A            MSSG          65   O 23  2
     A                                      DSPATR(HI)
     A                                 24  2'F3-Exit'
     A                                      DSPATR(BL)
     A                                      COLOR(BLU)
     A  85        PGMSG         10   O 23 69
     A  85                                  DSPATR(RI HI)
     A  85                                  COLOR(YLW)
