     A*****************************************************************
     A**                D I S P L A Y   F I L E
     A*****************************************************************
     A** FILE NAME  :  ZSMTALLDB
     A**
     A** DESCRIPTION:  MATERIAL STATUS OVERALL DATABASE INQUIRY SUBPGM
     A**
     A** AUTHOR     :  DAN RAUCH - EXLTECH, LLC
     A** CREATED    :  MAR 9, 2005
     A**
     A** FORMATS    :  FMTLSTAT1B
     A**
     A*****************************************************************
     A** COPIED FROM ZCSISINQ
     A*****************************************************************
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A          R FMTLSTAT1B
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 20'- - -  I T E M   S T A T U S  - -'
     A                                  1 54'-'
     A                                  1 75'MQ1-1B'
     A                                  7  7'O V E R A L L   D A T A   B A S E'
     A                                  7 43'O N H A N D   I N Q U I R Y'
     A                                  9  3'PLANT     LOC 1'
     A                                  9 27'LOC2'
     A                                  9 39'ONHAND   STR   REQ.    ITEM ORDER'
     A                                  9 74'EXP.'
     A                                 10 49'UM   ORDER    NO.  UM    DATE'
     A                                 22  7'ENTER AN "X" IN FRONT OF THE DESIR-
     A                                      ED PLANT FOR MORE INFORMATION OR'
     A                                 23  4'PRESS  "f5" TO PRINT SCREEN, "f7"'
     A                                 23 38'TO ENTER NEXT CODE, "f3" TO END PR-
     A                                      OGRAM'
     A            COM            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            STRCODE        7A  B  3  1DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTLI    65A  B  3 10DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTL2    65A  B  4 10DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B 12  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  67                                  DSPATR(RI)
     A  67                                  DSPATR(PC)
     A            DES1           4A  B 12  4DSPATR(PR)
     A                                      OVRDTA
     A            LOC1PLT1      12A  B 12 10DSPATR(PR)
     A                                      OVRDTA
     A            LOC2PLT1      12A  B 12 24DSPATR(PR)
     A                                      OVRDTA
     A            ONHDPLT1       9A  B 12 38DSPATR(PR)
     A                                      OVRDTA
     A            U1             2A  B 12 49DSPATR(PR)
     A                                      OVRDTA
     A            REQORD1        7A  B 12 53DSPATR(PR)
     A                                      OVRDTA
     A            ITM1           4A  B 12 62DSPATR(PR)
     A                                      OVRDTA
     A            O1             2A  B 12 68DSPATR(PR)
     A                                      OVRDTA
     A            REQDATE1       8A  B 12 72DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B 13  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  69                                  DSPATR(RI)
     A  69                                  DSPATR(PC)
     A            DES2           4A  B 13  4DSPATR(PR)
     A                                      OVRDTA
     A            LOC1PLT2      12A  B 13 10DSPATR(PR)
     A                                      OVRDTA
     A            LOC2PLT2      12A  B 13 24DSPATR(PR)
     A                                      OVRDTA
     A            OHNDPLT2       9A  B 13 38DSPATR(PR)
     A                                      OVRDTA
     A            U2             2A  B 13 49DSPATR(PR)
     A                                      OVRDTA
     A            REQORD2        7A  B 13 53DSPATR(PR)
     A                                      OVRDTA
     A            ITM2           4A  B 13 62DSPATR(PR)
     A                                      OVRDTA
     A            O2             2A  B 13 68DSPATR(PR)
     A                                      OVRDTA
     A            REQDATE2       8A  B 13 72DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 14  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  72                                  DSPATR(RI)
     A  72                                  DSPATR(PC)
     A            DES3           4A  B 14  4DSPATR(PR)
     A                                      OVRDTA
     A            LOC1PLT3      12A  B 14 10DSPATR(PR)
     A                                      OVRDTA
     A            LOC2PLT3      12A  B 14 24DSPATR(PR)
     A                                      OVRDTA
     A            OHNDPLT3       9A  B 14 38DSPATR(PR)
     A                                      OVRDTA
     A            U3             2A  B 14 49DSPATR(PR)
     A                                      OVRDTA
     A            REQORD3        7A  B 14 53DSPATR(PR)
     A                                      OVRDTA
     A            ITM3           4A  B 14 62DSPATR(PR)
     A                                      OVRDTA
     A            O3             2A  B 14 68DSPATR(PR)
     A                                      OVRDTA
     A            REQDATE3       8A  B 14 72DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  74                                  DSPATR(RI)
     A  74                                  DSPATR(PC)
     A            DES4           4A  B 15  4DSPATR(PR)
     A                                      OVRDTA
     A            LOC1PLT4      12A  B 15 10DSPATR(PR)
     A                                      OVRDTA
     A            LOC2PLT4      12A  B 15 24DSPATR(PR)
     A                                      OVRDTA
     A            OHNDPLT4       9A  B 15 38DSPATR(PR)
     A                                      OVRDTA
     A            U4             2A  B 15 49DSPATR(PR)
     A                                      OVRDTA
     A            REQORD4        7A  B 15 53DSPATR(PR)
     A                                      OVRDTA
     A            ITM4           4A  B 15 62DSPATR(PR)
     A                                      OVRDTA
     A            O4             2A  B 15 68DSPATR(PR)
     A                                      OVRDTA
     A            REQDATE4       8A  B 15 72DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 16  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  83                                  DSPATR(RI)
     A  83                                  DSPATR(PC)
     A            DES5           4A  B 16  4DSPATR(PR)
     A                                      OVRDTA
     A            LOC1PLT5      12A  B 16 10DSPATR(PR)
     A                                      OVRDTA
     A            LOC2PLT5      12A  B 16 24DSPATR(PR)
     A                                      OVRDTA
     A            ONHDPLT5       9A  B 16 38DSPATR(PR)
     A                                      OVRDTA
     A            U5             2A  B 16 49DSPATR(PR)
     A                                      OVRDTA
     A            REQORD5        7A  B 16 53DSPATR(PR)
     A                                      OVRDTA
     A            ITM5           4A  B 16 62DSPATR(PR)
     A                                      OVRDTA
     A            O5             2A  B 16 68DSPATR(PR)
     A                                      OVRDTA
     A            REQDATE5       8A  B 16 72DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  85                                  DSPATR(RI)
     A  85                                  DSPATR(PC)
     A            DES6           4A  B 17  4DSPATR(PR)
     A                                      OVRDTA
     A            LOC1PLT9      12A  B 17 10DSPATR(PR)
     A                                      OVRDTA
     A            LOC2PLT9      12A  B 17 24DSPATR(PR)
     A                                      OVRDTA
     A            ONHDPLT9       9A  B 17 38DSPATR(PR)
     A                                      OVRDTA
     A            U9             2A  B 17 49DSPATR(PR)
     A                                      OVRDTA
     A            REQORD9        7A  B 17 53DSPATR(PR)
     A                                      OVRDTA
     A            ITM9           4A  B 17 62DSPATR(PR)
     A                                      OVRDTA
     A            O9             2A  B 17 68DSPATR(PR)
     A                                      OVRDTA
     A            REQDATE9       8A  B 17 72DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 18  1DSPATR(UL)
     A            DES7           4A  B 18  4DSPATR(PR)
     A                                      OVRDTA
     A            LOC1MIXCTR    12A  B 18 10DSPATR(PR)
     A                                      OVRDTA
     A            LOC2MIXCTR    12A  B 18 24DSPATR(PR)
     A                                      OVRDTA
     A            ONHDPLTM       9A  B 18 38DSPATR(PR)
     A                                      OVRDTA
     A            UM             2A  B 18 49DSPATR(PR)
     A                                      OVRDTA
     A            REQORDM        7A  B 18 53DSPATR(PR)
     A                                      OVRDTA
     A            ITMM           4A  B 18 62DSPATR(PR)
     A                                      OVRDTA
     A            OM             2A  B 18 68DSPATR(PR)
     A                                      OVRDTA
     A            REQDATEM       8A  B 18 72DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f7-NEXT CODE f3-EXIT PROGRA-
     A                                      M                                  -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
