     A*****************************************************************
     A**                D I S P L A Y   F I L E
     A*****************************************************************
     A** FILE NAME  :  ZSPOINQHH
     A**
     A** DESCRIPTION:  PO INQUIRY HDR DATA - HISTORY DATA BASE
     A**
     A** AUTHOR     :  DAN RAUCH - EXLTECH, LLC
     A** CREATED    :  MAR 9, 2005
     A**
     A** FORMATS    : FPOINQH  FPOINQHL EFPOINQH EFPOINQHL  FPOINQHB
     A**              INQVEND
     A**
     A*****************************************************************
     A** COPIED FROM ZCSISINQ
     A*****************************************************************
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A          R FPOINQH
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 16'PURCHASE ORDER HEADER INQUIRY - PA-
     A                                      GE 1'
     A                                  3 29'***'
     A                                  3 49'***'
     A                                  4 33'---------------'
     A                                  6  2'PO DATE'
     A                                  6 16'REQ NUMBER'
     A                                  6 53'REC DEPT      FOR DEPT'
     A                                  9  2'SHIP DATE     EXPECT DATE      BUD-
     A                                      GET NUMBER     BUDGET AMT     ADDIT-
     A                                      IONAL INFO'
     A                                 12  1'F.O.B.'
     A                                 12 27'VIA'
     A                                 12 53'TERMS'
     A                                 15  1'VENDOR CODE'
     A                                 15 35'CO.   PRIME   CLASS  DEPARTMENT  E-
     A                                      XPENSE/NW'
     A                                 17  1'VENDOR'
     A                                 17 55'BUYER'
     A                                 20  1'PRESS:  "f1"  TO SEE PURCHASE ORDE-
     A                                      R HEADER - PAGE 2'
     A                                 21  1'------  "f2"  TO SEE PURCHASE ORDE-
     A                                      R ITEMS'
     A            CCD            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            HISTDBLIT     20A  B  1 57DSPATR(PR)
     A                                      OVRDTA
     A            PO             7A  B  3 35DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  3 43DSPATR(PR)
     A                                      OVRDTA
     A            PODATE         8A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            REQNUM        12A  B  5 16DSPATR(PR)
     A                                      OVRDTA
     A            RDEPT          6A  B  5 53DSPATR(PR)
     A                                      OVRDTA
     A            FDEPT          6A  B  5 67DSPATR(PR)
     A                                      OVRDTA
     A            SHIPDATE       8A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            EXPDATE        8A  B  8 15DSPATR(PR)
     A                                      OVRDTA
     A            BUDGETNUM     12A  B  8 32DSPATR(PR)
     A                                      OVRDTA
     A            BUDGETAMT     11A  B  8 49DSPATR(PR)
     A                                      OVRDTA
     A            ADDLINFO      16A  B  8 65DSPATR(PR)
     A                                      OVRDTA
     A            FOB           20A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            VIA           20A  B 11 27DSPATR(PR)
     A                                      OVRDTA
     A            TM             2A  B 11 53DSPATR(PR)
     A                                      OVRDTA
     A            DISC           5A  B 11 56DSPATR(PR)
     A                                      OVRDTA
     A            TIMEOFDISC    18A  B 11 62DSPATR(PR)
     A                                      OVRDTA
     A            VENDORCODE    11A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            COMPANY        3A  B 14 35DSPATR(PR)
     A                                      OVRDTA
     A            PRIME          3A  B 14 42DSPATR(PR)
     A                                      OVRDTA
     A            SUB            3A  B 14 50DSPATR(PR)
     A                                      OVRDTA
     A            SUBDETL        4A  B 14 58DSPATR(PR)
     A                                      OVRDTA
     A            ADDLDT         6A  B 14 70DSPATR(PR)
     A                                      OVRDTA
     A            VENDORNAME    44A  B 17 10DSPATR(PR)
     A                                      OVRDTA
     A            BUYER         18A  B 17 63DSPATR(PR)
     A                                      OVRDTA
     A            VENDORCSZ     44A  B 18 10DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 23  1DSPATR(PR)
     A  98                                  OVRDTA
     A            COMMANDLN2    79A  B 24  1DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EFPOINQH
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 16'PURCHASE ORDER HEADER INQUIRY - PA-
     A                                      GE 1'
     A                                  3 29'***'
     A                                  3 49'***'
     A                                  4 33'---------------'
     A                                  6  2'PO DATE'
     A                                  6 16'REQ NUMBER'
     A                                  6 53'REC DEPT      FOR DEPT'
     A                                  9  2'SHIP DATE     EXPECT DATE      BUD-
     A                                      GET NUMBER     BUDGET AMT     ADDIT-
     A                                      IONAL INFO'
     A                                 12  1'F.O.B.'
     A                                 12 27'VIA'
     A                                 12 53'TERMS'
     A                                 15  1'TRANSPORTATION MODE '
     A                                 15 27'PAYMENT METHOD  '
     A                                 15 53'DELIVERY TERMS  '
     A                                 18  1'VENDOR CODE'
     A                                 18 35'CO.   PRIME   CLASS  DEPARTMENT  E-
     A                                      XPENSE/NW'
     A                                 20  1'VENDOR'
     A                                 20 55'BUYER'
     A            CCD            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            HISTDBLIT     20A  B  1 57DSPATR(PR)
     A                                      OVRDTA
     A            PO             7A  B  3 35DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  3 43DSPATR(PR)
     A                                      OVRDTA
     A            PODATE         8A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            REQNUM        12A  B  5 16DSPATR(PR)
     A                                      OVRDTA
     A            RDEPT          6A  B  5 53DSPATR(PR)
     A                                      OVRDTA
     A            FDEPT          6A  B  5 67DSPATR(PR)
     A                                      OVRDTA
     A            SHIPDATE       8A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            EXPDATE        8A  B  8 15DSPATR(PR)
     A                                      OVRDTA
     A            BUDGETNUM     12A  B  8 32DSPATR(PR)
     A                                      OVRDTA
     A            BUDGETAMT     11A  B  8 49DSPATR(PR)
     A                                      OVRDTA
     A            ADDLINFO      16A  B  8 65DSPATR(PR)
     A                                      OVRDTA
     A            FOB           20A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            VIA           20A  B 11 27DSPATR(PR)
     A                                      OVRDTA
     A            TM             2A  B 11 53DSPATR(PR)
     A                                      OVRDTA
     A            DISC           5A  B 11 56DSPATR(PR)
     A                                      OVRDTA
     A            TIMEOFDISC    18A  B 12 62DSPATR(PR)
     A                                      OVRDTA
     A            TMODE          2A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            TMODESC       20A  B 14  4DSPATR(PR)
     A                                      OVRDTA
     A            TRCHGPAY       2A  B 14 27DSPATR(PR)
     A                                      OVRDTA
     A            TRCPDESC      20A  B 14 30DSPATR(PR)
     A                                      OVRDTA
     A            TMTERMS        3A  B 14 53DSPATR(PR)
     A                                      OVRDTA
     A            TRTDESC       20A  B 14 57DSPATR(PR)
     A                                      OVRDTA
     A            VENDORCODE    11A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            COMPANY        3A  B 17 35DSPATR(PR)
     A                                      OVRDTA
     A            PRIME          3A  B 17 42DSPATR(PR)
     A                                      OVRDTA
     A            SUB            3A  B 17 50DSPATR(PR)
     A                                      OVRDTA
     A            SUBDETL        4A  B 17 58DSPATR(PR)
     A                                      OVRDTA
     A            ADDLDT         6A  B 17 70DSPATR(PR)
     A                                      OVRDTA
     A            VENDORNAME    44A  B 20 10DSPATR(PR)
     A                                      OVRDTA
     A            BUYER         18A  B 20 63DSPATR(PR)
     A                                      OVRDTA
     A            VENDORCSZ     44A  B 21 10DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 23  1DSPATR(PR)
     A  98                                  OVRDTA
     A            COMMANDLN2    79A  B 24  1DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EFPOINQHL
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 16'PURCHASE ORDER HEADER INQUIRY - PA-
     A                                      GE 1'
     A                                  3 29'***'
     A                                  3 49'***'
     A                                  4 33'---------------'
     A                                  6  2'PO DATE'
     A                                  6 16'REQ NUMBER'
     A                                  6 53'REC DEPT      FOR DEPT'
     A                                  9  2'SHIP DATE     EXPECT DATE      BUD-
     A                                      GET NUMBER     BUDGET AMT     ADDIT-
     A                                      IONAL INFO'
     A                                 12  1'F.O.B.'
     A                                 12 27'VIA'
     A                                 12 53'TERMS'
     A                                 15  1'TRANSPORTATION MODE '
     A                                 15 27'PAYMENT METHOD  '
     A                                 15 53'DELIVERY TERMS  '
     A                                 18  1'VENDOR CODE'
     A                                 20  1'VENDOR'
     A                                 20 55'BUYER'
     A            CCD            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            HISTDBLIT     20A  B  1 57DSPATR(PR)
     A                                      OVRDTA
     A            PO             7A  B  3 35DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  3 43DSPATR(PR)
     A                                      OVRDTA
     A            PODATE         8A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            REQNUM        12A  B  5 16DSPATR(PR)
     A                                      OVRDTA
     A            RDEPT          6A  B  5 53DSPATR(PR)
     A                                      OVRDTA
     A            FDEPT          6A  B  5 67DSPATR(PR)
     A                                      OVRDTA
     A            SHIPDATE       8A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            EXPDATE        8A  B  8 15DSPATR(PR)
     A                                      OVRDTA
     A            BUDGETNUM     12A  B  8 32DSPATR(PR)
     A                                      OVRDTA
     A            BUDGETAMT     11A  B  8 49DSPATR(PR)
     A                                      OVRDTA
     A            ADDLINFO      16A  B  8 65DSPATR(PR)
     A                                      OVRDTA
     A            FOB           20A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            VIA           20A  B 11 27DSPATR(PR)
     A                                      OVRDTA
     A            TM             2A  B 11 53DSPATR(PR)
     A                                      OVRDTA
     A            DISC           5A  B 11 56DSPATR(PR)
     A                                      OVRDTA
     A            TIMEOFDISC    18A  B 12 62DSPATR(PR)
     A                                      OVRDTA
     A            TMODE          2A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            TMODESC       20A  B 14  4DSPATR(PR)
     A                                      OVRDTA
     A            TRCHGPAY       2A  B 14 27DSPATR(PR)
     A                                      OVRDTA
     A            TRCPDESC      20A  B 14 30DSPATR(PR)
     A                                      OVRDTA
     A            TMTERMS        3A  B 14 53DSPATR(PR)
     A                                      OVRDTA
     A            TRTDESC       20A  B 14 57DSPATR(PR)
     A                                      OVRDTA
     A            VENDORCODE    11A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            VENDORNAME    44A  B 20 10DSPATR(PR)
     A                                      OVRDTA
     A            BUYER         18A  B 20 63DSPATR(PR)
     A                                      OVRDTA
     A            VENDORCSZ     44A  B 21 10DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 23  1DSPATR(PR)
     A  98                                  OVRDTA
     A            COMMANDLN2    79A  B 24  1DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FPOINQHB
     A*%%TS  SD  20031021  143657  A257947     REL-V5R2M0  5722-WDS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 18'PURCHASE ORDER HEADER INQUIRY - PA-
     A                                      GE 2'
     A                                  3 29'***'
     A                                  3 49'***'
     A                                  4 33'---------------'
     A                                  6  4'PO TYPE'
     A                                  6 23'PO DELETION   LAST PAYMENT     CUR-
     A                                      RENCY'
     A                                  6 72'FREIGHT'
     A                                  7 26'DATE'
     A                                  7 38'DATE (YYMM)'
     A                                  7 56'CODE'
     A                                  7 73'TERMS'
     A                                 10 31'CONFIRMING ORDER FREE VERBAGE'
     A                                 13  3'STD INSTRUCTIONS (BEFORE ITEMS)'
     A                                 13 41'STD INSTRUCTIONS (AFTER ITEMS)'
     A                                 14  3'LAST FOLLOWUP DATE'
     A                                 14 34'NO. OF FOLLOWUPS'
     A                                 16 23'BUDGET AMOUNT'
     A                                 16 54'CPW TAKEN'
     A                                 17  3'ALT. REMIT ADDRESS  APPROVED INVOI-
     A                                      CE'
     A                                 17 54'CPW PAYED'
     A                                 18 31'PAYMENTS'
     A                                 18 54'CPW BAL.'
     A                                 19 23'OPEN BUDGET AMT.'
     A                                 20  1'PRESS:  "f1"  TO SEE PURCHASE ORDE-
     A                                      R HEADER - PAGE 1'
     A                                 21  1'------  "f2"  TO SEE PURCHASE ORDE-
     A                                      R ITEMS'
     A            CCD            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            HISTDBLIT     20A  B  1 59DSPATR(PR)
     A                                      OVRDTA
     A            PO             7A  B  3 35DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  3 43DSPATR(PR)
     A                                      OVRDTA
     A            POTYPE        16A  B  5  3DSPATR(PR)
     A                                      OVRDTA
     A            DELDATE        8A  B  5 24DSPATR(PR)
     A                                      OVRDTA
     A            LTPY           4A  B  5 40DSPATR(PR)
     A                                      OVRDTA
     A            CC             2A  B  5 54DSPATR(PR)
     A                                      OVRDTA
     A            CURCODE       12A  B  5 57DSPATR(PR)
     A                                      OVRDTA
     A            FRTTERMS       1A  B  5 75DSPATR(PR)
     A                                      OVRDTA
     A            CONFIRMLIT    20A  B  9  3DSPATR(PR)
     A                                      OVRDTA
     A            CONFIRMVER    34A  B  9 31DSPATR(PR)
     A                                      OVRDTA
     A            S1             3A  B 12  3DSPATR(PR)
     A                                      OVRDTA
     A            S2             3A  B 12  8DSPATR(PR)
     A                                      OVRDTA
     A            S3             3A  B 12 13DSPATR(PR)
     A                                      OVRDTA
     A            S4             3A  B 12 18DSPATR(PR)
     A                                      OVRDTA
     A            S5             3A  B 12 23DSPATR(PR)
     A                                      OVRDTA
     A            S6             3A  B 12 28DSPATR(PR)
     A                                      OVRDTA
     A            S7             3A  B 12 41DSPATR(PR)
     A                                      OVRDTA
     A            S8             3A  B 12 46DSPATR(PR)
     A                                      OVRDTA
     A            S9             3A  B 12 51DSPATR(PR)
     A                                      OVRDTA
     A            S10            3A  B 12 56DSPATR(PR)
     A                                      OVRDTA
     A            S11            3A  B 12 61DSPATR(PR)
     A                                      OVRDTA
     A            S12            3A  B 12 66DSPATR(PR)
     A                                      OVRDTA
     A            FLWPDATE       8A  B 14 23DSPATR(PR)
     A                                      OVRDTA
     A            NF             2A  B 14 52DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B 16  9DSPATR(PR)
     A                                      OVRDTA
     A            BUDGETAT      11A  B 16 41DSPATR(PR)
     A                                      OVRDTA
     A            CPWDEDUCT     13A  B 16 64DSPATR(PR)
     A                                      OVRDTA
     A            CPWPAYED      13A  B 17 64DSPATR(PR)
     A                                      OVRDTA
     A            INVPAY        11A  B 18 41DSPATR(PR)
     A                                      OVRDTA
     A            CPWBALANCE    14A  B 18 63DSPATR(PR)
     A                                      OVRDTA
     A            OPENBDGT      12A  B 19 40DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 23  1DSPATR(PR)
     A            COMMANDLN2    79A  B 24  1DSPATR(PR)
     A            INDICMSG      20A  B 21 55DSPATR(PR)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R INQVEND
     A*%%TS  SD  19980203  162911  A257947     REL-V3R7M0  5716-PW1
     A                                      PUTOVR
     A                                      CF03
     A                                      CF07
     A            TITLE         35A  B  1 21DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTIO    75A  B  3  1DSPATR(PR)
     A                                      OVRDTA
     A                                  4  1'CODE:'
     A            VENDORCOD     10A  B  4 11DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A                                  5  1'NAME:'
     A            NAME          44A  B  5 11DSPATR(PR)
     A                                      OVRDTA
     A                                  6  1'ADDRESS:'
     A            ADDRESS       44A  B  6 11DSPATR(PR)
     A                                      OVRDTA
     A            ADD2          44A  B  7 11DSPATR(PR)
     A                                      OVRDTA
     A            ADD3          44A  B  8 11DSPATR(PR)
     A                                      OVRDTA
     A            ADD4          44A  B  9 11DSPATR(PR)
     A                                      OVRDTA
     A                                  8 65'"X" MEANS THAT'
     A            ADD5          44A  B 10 11DSPATR(PR)
     A                                      OVRDTA
     A                                  9 65'ZIP/POSTAL CODE'
     A            ADD6          44A  B 11 11DSPATR(PR)
     A                                      OVRDTA
     A                                 10 65'WILL BE PRINTED'
     A                                 11 65'BEFORE CITY'
     A                                 12  1'CITY:'
     A            CITY          24A  B 12 11DSPATR(PR)
     A                                      OVRDTA
     A                                 12 36'STATE:'
     A            ST             2A  B 12 44DSPATR(PR)
     A                                      OVRDTA
     A                                 12 48'ZIP:'
     A            ZIPCODE        9A  B 12 54DSPATR(PR)
     A                                      OVRDTA
     A            X              1A  B 12 71DSPATR(PR)
     A                                      OVRDTA
     A                                 13  1'PROVINCE:'
     A            PROV           4A  B 13 11DSPATR(PR)
     A                                      OVRDTA
     A                                 13 17'COUNTRY:'
     A            COUNTRY       18A  B 13 27DSPATR(PR)
     A                                      OVRDTA
     A                                 13 47'CURRENCY CODE:'
     A            CC             2A  B 13 63DSPATR(PR)
     A                                      OVRDTA
     A            CURRENCY      12A  B 13 67DSPATR(PR)
     A                                      OVRDTA
     A                                 14  1'CONTACT:'
     A            CONTACT       34A  B 14 11DSPATR(PR)
     A                                      OVRDTA
     A                                 14 49'FAX:'
     A            FAX           24A  B 14 55DSPATR(PR)
     A                                      OVRDTA
     A                                      CHECK(LC)
     A                                 15  1'NOTE1:'
     A            NOTE1         44A  B 15 11DSPATR(PR)
     A                                      OVRDTA
     A                                 15 61'TELEX:'
     A            TELEX         10A  B 15 69DSPATR(PR)
     A                                      OVRDTA
     A                                 16  1'NOTE2:'
     A            NOTE2         44A  B 16 11DSPATR(PR)
     A                                      OVRDTA
     A                                 16 61'PHONE:'
     A            PHONE         10A  B 16 69DSPATR(PR)
     A                                      OVRDTA
     A                                 17  1'F.O.B.:'
     A            FOB           20A  B 17 10DSPATR(PR)
     A                                      OVRDTA
     A                                 17 33' PAYMENT TERMS:'
     A            TERMS          2A  B 17 50DSPATR(PR)
     A                                      OVRDTA
     A                                 17 56'MINIMUM ORDER:'
     A            MINM           4A  B 17 72DSPATR(PR)
     A                                      OVRDTA
     A                                 18  1'INVOICELESS VENDOR (Y/N):'
     A            INVLESSIND     1A  B 18 27DSPATR(PR)
     A                                      OVRDTA
     A                                 18 36'EDI VENDOR (Y/N):'
     A            E              1A  B 18 54DSPATR(PR)
     A                                      OVRDTA
     A                                 19  1'EDI DOLLAR MAX:'
     A            DOLLM          7A  B 19 17DSPATR(PR)
     A                                      OVRDTA
     A                                 19 36'EDI STANDARD:'
     A            A              1A  B 19 50DSPATR(PR)
     A                                      OVRDTA
     A                                 19 53'(1-EDIFACT  2-ASCX12)'
     A                                 20  1'GOODYEAR CODE:'
     A            GOODYEARCO    17A  B 20 16DSPATR(PR)
     A                                      OVRDTA
     A                                 20 36'TRADING PARTNER ID:'
     A            TRADINGPID    16A  B 20 56DSPATR(PR)
     A                                      OVRDTA
     A                                 21  1'EDI STATUS IND:'
     A            EDISTATIND     1A  B 21 17DSPATR(PR)
     A                                      OVRDTA
     A                                 21 20'(0-NO SEND, 1-SEND AND PRINT, 2-SE-
     A                                      ND ONLY)'
     A                                 22  1'EXCLUDE CODED DESCRIPTION ON RELEA-
     A                                      SES (Y/N):'
     A            EXCODESW       1A  B 22 46DSPATR(PR)
     A                                      OVRDTA
     A                                 23  1'STD. INSTRUCTIONS:'
     A            INSTR1         3A  B 23 20DSPATR(PR)
     A                                      OVRDTA
     A            ITEM1          1A  B 23 24DSPATR(PR)
     A                                      OVRDTA
     A            INSTR2         3A  B 23 27DSPATR(PR)
     A                                      OVRDTA
     A            ITEM2          1A  B 23 31DSPATR(PR)
     A                                      OVRDTA
     A            INSTR3         3A  B 23 34DSPATR(PR)
     A                                      OVRDTA
     A            ITEM3          1A  B 23 38DSPATR(PR)
     A                                      OVRDTA
     A            INSTR4         3A  B 23 41DSPATR(PR)
     A                                      OVRDTA
     A            ITEM4          1A  B 23 45DSPATR(PR)
     A                                      OVRDTA
     A                                 23 48'(B-PRINT BEFORE ITEMS;A-AFTER)'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT f7-CLEAR SCREEN')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
