     A*****************************************************************
     A**                D I S P L A Y   F I L E
     A*****************************************************************
     A** FILE NAME  :  ZSPOINQIH
     A**
     A** DESCRIPTION:  PO INQUIRY ITEM DATA - HISTORY DATA BASE
     A**
     A** AUTHOR     :  DAN RAUCH - EXLTECH, LLC
     A** CREATED    :  MAR 9, 2005
     A**
     A** FORMATS    :  FPOINQSI
     A**
     A*****************************************************************
     A** COPIED FROM ZCSISINQ
     A*****************************************************************
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A          R FPOINQSI
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 24'PURCHASE ORDER ITEM INQUIRY'
     A                                  3  1'ITEM  CODE'
     A                                  3 24'***'
     A                                  3 44'***    TAX CODE   LANGUAGE INDIC.'
     A                                  4 28'---------------'
     A                                  6  1'****** PRICE ****** **************-
     A                                      * QUANTITIES *****************  ***-
     A                                      *DATES***'
     A                                  7  6'AMOUNT      UM   ORDERED     UM  D-
     A                                      ELIVERED'
     A                                  7 55'STORED'
     A                                  7 69'DLVR  STOR'
     A                                 21  1'PRESS:  "f1"  TO SEE PURCHASE ORDE-
     A                                      R HEADER'
     A  01                             21 50'"f5" TO SEE QS9000 TRACKING'
     A                                 22  1'------  "f3"  TO RETURN TO THE REQ-
     A                                      UEST SCREEN'
     A            CCD            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            HISTDBLIT     20A  B  1 57DSPATR(PR)
     A                                      OVRDTA
     A            PO             7A  B  3 30DSPATR(PR)
     A                                      OVRDTA
     A            RLS            3A  B  3 38DSPATR(PR)
     A                                      OVRDTA
     A            ITEM           4A  B  4  1DSPATR(PR)
     A                                      OVRDTA
     A            CORPCODE       7A  B  4  7DSPATR(PR)
     A                                      OVRDTA
     A            TX             2A  B  4 54DSPATR(PR)
     A                                      OVRDTA
     A            LANGTYPE      10A  B  4 64DSPATR(PR)
     A                                      OVRDTA
     A            MASTSTKLIT    12A  B  5  7DSPATR(PR)
     A                                      OVRDTA
     A            MASTSTK        7A  B  5 20DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE01    79A  B  9  1DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE02    79A  B 10  1DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE03    79A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE04    79A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE05    79A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE06    79A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE07    79A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE08    79A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            ITEMLINE09    79A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            MSGLINE01     79A  B 19  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-PO HEADER f3-REQUEST SCR-
     A                                      EEN                                -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
