     A*%%TS  SD  20040601  153919  A257947     REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A          R MAIN
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 19'P L A N T   S E T U P   M A I N   -
     A                                      M E N U  '
     A                                      DSPATR(HI)
     A                                  3 27'SOFTWARE VERSION:'
     A            VER            6A  B  3 47DSPATR(PR)
     A            CSIS           1A  B  7 26DSPATR(UL)
     A                                      DSPATR(PC)
     A                                  7 30'CSIS Setup Menu'
     A            MMIS           1A  B  9 26DSPATR(UL)
     A                                  9 30'MMIS Setup Menu'
     A            CSAS           1A  B 11 26DSPATR(UL)
     A                                 11 30'CSAS Setup Menu'
     A            REQ            1A  B 13 26DSPATR(UL)
     A                                 13 30'Requisition Setup Menu'
     A            GEN            1A  B 15 26DSPATR(UL)
     A                                 15 30'General CSIS/MMIS Setup Menu'
     A                                 21  6' ***  PLACE AN X IN FRONT OF THE D-
     A                                      ESIRED TOPIC AND PRESS ENTER  ***  -
     A                                       '
     A                                 21 77' '
     A                                 22 31'OR PRESS F3 TO EXIT'
     A                                  3  3TIME
     A                                  2 74'MAIN'
     A            COMMANDLN1    79A  O 24  1DFTVAL('                           -
     A                                             ')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A                                  5  3'-----------------------------------
     A                                      ------------------------------------
     A                                      ------'
     A          R CSISMAIN
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 25'C S I S   S E T U P   M E N U'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A            PURCH          1A  B  6 30DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      OVRDTA
     A            RCVG           1A  B  8 30DSPATR(UL)
     A                                      OVRDTA
     A                                  8 35'Receiving'
     A            INV            1A  B 10 30DSPATR(UL)
     A                                      OVRDTA
     A                                 10 35'Invoicing'
     A            MATLC          1A  B 12 30DSPATR(UL)
     A                                      OVRDTA
     A                                 12 35'Materials Control'
     A            STRM           1A  B 14 30DSPATR(UL)
     A                                      OVRDTA
     A            USROPT         1A  B 16 30DSPATR(UL)
     A                                      OVRDTA
     A                                 14 35'Storeroom'
     A                                 21  9'*** PLACE AN X IN FRONT OF THE DES-
     A                                      IRED TOPIC AND PRESS ENTER ***'
     A                                 22 22'OR PRESS F3 TO RETURN TO THE MAIN -
     A                                      MENU'
     A                                  4  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  2 71'CSISMAIN'
     A                                  6 35'Purchasing'
     A            COMMANDLN1    79A  O 24  1DFTVAL('                           -
     A                                             ')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A                                 16 35'CSIS User Options'
     A          R MMISMAIN
     A*%%TS  SD  19950922  102051  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 26'M M I S   S E T U P   M E N U'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 71'MMISMAIN'
     A                                  8 35'Preventive Maintenance'
     A                                 10 35'MMIS User Options'
     A                                  4  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A            PM             1A  B  8 30DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      OVRDTA
     A            GEN            1A  B 10 30DSPATR(UL)
     A                                      OVRDTA
     A                                 21  9'*** PLACE AN X IN FRONT OF THE DES-
     A                                      IRED TOPIC AND PRESS ENTER ***'
     A                                 22 22'OR PRESS F3 TO RETURN TO THE MAIN -
     A                                      MENU'
     A            COMMANDLN1    79A  O 24  1
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A          R REQMAIN
     A*%%TS  SD  19950922  102051  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A            REQHOLD        1A  B  7 28DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      OVRDTA
     A            GEN            1A  B  9 28DSPATR(UL)
     A                                      OVRDTA
     A                                  2 19'R E Q U I S I T I O N   S E T U P -
     A                                        M E N U'
     A                                      DSPATR(HI)
     A                                  4  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  2 72'REQMAIN'
     A                                  7 33'Requisition Hold Statuses'
     A                                  9 33'Requisition User Options'
     A                                 21  9'*** PLACE AN X IN FRONT OF THE DES-
     A                                      IRED TOPIC AND PRESS ENTER ***'
     A                                 22 22'OR PRESS F3 TO RETURN TO THE MAIN -
     A                                      MENU'
     A            COMMANDLN1    79A  O 24  1
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A          R SETUPMAIN
     A*%%TS  SD  19961111  155219  A257947     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A            PLTINFO        1A  B  8 28DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      OVRDTA
     A            DISVAL         1A  B 10 28DSPATR(UL)
     A                                      OVRDTA
     A            USROPT         1A  B 12 28DSPATR(UL)
     A                                      OVRDTA
     A                                 21  9'*** PLACE AN X IN FRONT OF THE DES-
     A                                      IRED TOPIC AND PRESS ENTER ***'
     A                                 22 22'OR PRESS F3 TO RETURN TO THE MAIN -
     A                                      MENU'
     A                                  4  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  8 33'Plant Information'
     A                                 10 33'System Display Values'
     A                                 12 33'General User Options'
     A                                  2 18'G E N E R A L   C S I S / M M I S -
     A                                        S E T U P'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 70'SETUPMAIN'
     A            COMMANDLN1    79A  O 24  1
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A          R PURCH1
     A*%%TS  SD  19950926  154708  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 26'P U R C H A S I N G   M E N U'
     A                                      DSPATR(HI)
     A                                  2 72'PURCH1'
     A                                  4  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A            A              1A  B  6  3DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      OVRDTA
     A                                  6  6'Buyer Information'
     A            B              1A  B  6 28DSPATR(UL)
     A                                      OVRDTA
     A                                  6 31'Currency Codes'
     A            C              1A  B  6 53DSPATR(UL)
     A                                      OVRDTA
     A                                  6 56'EDI Questions'
     A            D              1A  B  8  3DSPATR(UL)
     A                                      OVRDTA
     A                                  8  6'FOB Codes'
     A            E              1A  B  8 28DSPATR(UL)
     A                                      OVRDTA
     A                                  8 31'Payment Terms'
     A            F              1A  B  8 53DSPATR(UL)
     A                                      OVRDTA
     A                                  8 56'Tax Districts'
     A            G              1A  B 10  3DSPATR(UL)
     A                                      OVRDTA
     A                                 10  6'Units of Measure'
     A            H              1A  B 10 28DSPATR(UL)
     A                                      OVRDTA
     A                                 10 31'Quote Information'
     A            I              1A  B 10 53DSPATR(UL)
     A                                      OVRDTA
     A                                 10 56'Standard Instructions'
     A            J              1A  B 12  3
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                 12  6'ISO-9000 Question'
     A            K              1A  B 12 28DSPATR(UL)
     A                                      OVRDTA
     A                                 12 31'Ship Date Questions'
     A            L              1A  B 12 53DSPATR(UL)
     A                                      OVRDTA
     A                                 12 56'Purchasing User Options'
     A            M              1A  B 14  3DSPATR(UL)
     A                                      OVRDTA
     A                                 14  6'Purchase Order'
     A                                 15  8'Deletion Questions'
     A            N              1A  B 14 28DSPATR(UL)
     A                                      OVRDTA
     A                                 14 31'Standard Followup'
     A                                 15 33'Instructions'
     A            O              1A  B 14 53DSPATR(UL)
     A                                      OVRDTA
     A                                 14 56'Terms of Delivery/'
     A                                 15 58'Transport'
     A                                 21  9'*** PLACE AN X IN FRONT OF THE DES-
     A                                      IRED TOPIC AND PRESS ENTER ***'
     A                                 22 20'OR PRESS F3 TO RETURN TO THE PREVI-
     A                                      OUS MENU'
     A            COMMANDLN1    79A  O 24  1
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A          R STOR1
     A*%%TS  SD  19970414  144539  A193138     REL-V3R7M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 27'S T O R E R O O M   M E N U'
     A                                      DSPATR(HI)
     A                                  2 74'STOR1'
     A                                  4  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A            STRDPT         1A  B  7 28DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      OVRDTA
     A            MULTSTR        1A  B  9 28DSPATR(UL)
     A                                      OVRDTA
     A            STRPRT         1A  B 11 28DSPATR(UL)
     A                                      OVRDTA
     A            MULPRT         1A  B 13 28DSPATR(UL)
     A                                      OVRDTA
     A            USROPT         1A  B 15 28DSPATR(UL)
     A                                      OVRDTA
     A            FRAN           1   B 17 28DSPATR(UL)
     A                                      OVRDTA
     A                                 21  9'*** PLACE AN X IN FRONT OF THE DES-
     A                                      IRED TOPIC AND PRESS ENTER ***'
     A                                  7 32'Storeroom Departments'
     A                                  9 32'Multiple Storeroom Options'
     A                                 11 32'Storeroom Print Options'
     A                                 15 32'Storeroom User Options'
     A                                 17 32'Storeroom Franchisers'
     A            COMMANDLN1    79A  O 24  1DFTVAL('                           -
     A                                              ')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A                                 22 20'OR PRESS F3 TO RETURN TO THE PREVI-
     A                                      OUS MENU'
     A                                 13 32'Multiple Storeroom Printers'
     A          R RECV1
     A*%%TS  SD  19950927  103054  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 27'R E C E I V I N G   M E N U'
     A                                      DSPATR(HI)
     A                                  2 74'RECV1'
     A                                  4  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A            DOCKINFO       1A  B  8 30DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      OVRDTA
     A                                  8 34'Dock Information'
     A            DOCKPRN        1   B 10 30DSPATR(UL)
     A                                      OVRDTA
     A                                 10 34'Dock Printers'
     A            USROPT         1A  B 12 30DSPATR(UL)
     A                                      OVRDTA
     A                                 12 34'Receiving User Options'
     A                                 21  9'** PLACE AN X IN FRONT OF THE DESI-
     A                                      RED TOPIC AND PRESS ENTER ***'
     A                                 22 20'OR PRESS F3 TO RETURN TO THE PREVI-
     A                                      OUS MENU'
     A            COMMANDLN1    79A  O 24  1DFTVAL('                           -
     A                                             ')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A          R PLTINFO
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A            COM            3A  B  5 19DSPATR(UL)
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            PRI            3A  B  5 43DSPATR(UL)
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            TERR           4A  B  5 73DSPATR(UL)
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMPANYNAM    35A  B  8 27DSPATR(UL)
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            PLANTNAME     35A  B  9 27DSPATR(UL)
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            ADDRESS1      35A  B 10 27DSPATR(UL)
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            ADDRESS2      35A  B 11 27DSPATR(UL)
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            SHIPPINGLO    29A  B 12 27DSPATR(UL)
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            PLANTFAX      20A  B 14 27DSPATR(UL)
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            PLANTTLX      20A  B 15 27DSPATR(UL)
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            ALTCOMPANY    35A  B 18 27DSPATR(UL)
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            ALTPLANTNA    35A  B 19 27DSPATR(UL)
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            ALTADDRESS    35A  B 20 27DSPATR(UL)
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            ALTADDRES2    35A  B 21 27DSPATR(UL)
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            COMMANDLN1    79A  O 24  1DFTVAL('                           -
     A                                              ')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A                                  1  3DATE
     A                                      EDTCDE(Y)
     A                                  1 72'PLTINFO'
     A                                  2  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  3  3'Input data and press Enter:'
     A                                  5  6'Plant Code:'
     A                                  5 35'Prime:'
     A                                  5 61'Territory:'
     A                                  8 12'Company Name:'
     A                                  9 14'Plant Name:'
     A                                 10 17'Address:'
     A                                 12  6'Receiving Location:'
     A                                 13 10'Verbage'
     A                                 14  6'Purchase Dept. Fax:'
     A                                 15 12'Telex Number:'
     A                                 18 12'Company Name:'
     A                                 19 14'Plant Name:'
     A                                 20 17'Address:'
     A                                 17 25'ALTERNATE PURCHASE ORDER ADDRESS'
     A                                  7 30'PURCHASE ORDER ADDRESS'
     A                                 23  3'F3-EXIT'
     A                                  1 24'P L A N T   I N F O R M A T I O N'
     A                                      DSPATR(HI)
     A          R EDIQUES
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 28'E D I   Q U E S T I O N S'
     A                                      DSPATR(HI)
     A                                  2 72'EDIQUES'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  5  4'Input data and press the Enter key-
     A                                      :'
     A            E              1A  B  7  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                  7  7'(Y/N)'
     A                                  7 14'Is your plant using electronic dat-
     A                                      a interchange (EDI) for'
     A                                  8 14'purchasing?'
     A            F              1A  B 10  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                 10  7'(Y/N)'
     A                                 10 14'Will you transmit requirement/blan-
     A                                      ket orders via EDI?'
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('  F3-EXIT                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R ISOQUES
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A            ISO1           1A  B  7  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('  F3-EXIT                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A                                  7  8'(Y/N)'
     A                                  7 15'Will users review purchase orders -
     A                                      prior to printing/faxing?'
     A                                  2 29'I S O   Q U E S T I O N'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 72'ISOQUES'
     A                                  5  4'Input data and press the Enter key-
     A                                      :'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A          R EUNMEAS
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                 18 17'M O D I F Y   A   D E S C R I P T'
     A                                 18 51'I O N   O N L Y'
     A                                  2 72'EUNMEAS'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                 16  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  2 25'U N I T S   O F   M E A S U R E'
     A                                      DSPATR(HI)
     A                                  4 21'A D D   U N I T S   O F   M E A S -
     A                                      U R E'
     A                                  6 14'UNIT OF MEASURE'
     A                                      DSPATR(UL)
     A                                  6 36'EDI EQUIVALENT'
     A                                      DSPATR(UL)
     A                                  6 56'DESCRIPTION'
     A                                      DSPATR(UL)
     A                                 23  3'INPUT DATA ABOVE AND PRESS ENTER'
     A            U1             2A  B  8 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            ED1            3A  B  8 41DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            DESCRIPTIO    12A  B  8 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            U2             2A  B 10 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            ED2            3A  B 10 41DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            DESCRIPTI2    12A  B 10 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            U3             2A  B 12 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            ED3            3A  B 12 41DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            DESCRIPTI3    12A  B 12 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            U4             2A  B 14 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            ED4            3A  B 14 41DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            DESCRIPTI4    12A  B 14 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            U5             2A  B 20 21DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            ED5            3A  B 20 41DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI5    12A  B 20 56DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('  F1-HELP  F3-EXIT         -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A          R EUNMEASM
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  6 15'UNIT OF MEASURE      EDI EQUIVALEN-
     A                                      T      DESCRIPTION'
     A                                 18 17'M O D I F Y   A   D E S C R I P T'
     A                                 18 51'I O N   O N L Y'
     A            U1             2A  B  8 21DSPATR(PR)
     A                                      OVRDTA
     A            ED1            3A  B  8 41DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIO    12A  B  8 56DSPATR(PR)
     A                                      OVRDTA
     A            U2             2A  B 10 21DSPATR(PR)
     A                                      OVRDTA
     A            ED2            3A  B 10 41DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI2    12A  B 10 56DSPATR(PR)
     A                                      OVRDTA
     A            U3             2A  B 12 21DSPATR(PR)
     A                                      OVRDTA
     A            ED3            3A  B 12 41DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI3    12A  B 12 56DSPATR(PR)
     A                                      OVRDTA
     A            U4             2A  B 14 21DSPATR(PR)
     A                                      OVRDTA
     A            ED4            3A  B 14 41DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI4    12A  B 14 56DSPATR(PR)
     A                                      OVRDTA
     A            U5             2A  B 20 21DSPATR(PR)
     A                                      OVRDTA
     A            ED5            3A  B 20 41DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            DESCRIPTI5    12A  B 20 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('  F3-EXIT                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 71'EUNMEASM'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  2 25'U N I T S   O F   M E A S U R E'
     A                                      DSPATR(HI)
     A                                 16  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  4 21'A D D   U N I T S   O F   M E A S -
     A                                      U R E'
     A                                 23  3'INPUT DATA ABOVE AND PRESS ENTER'
     A          R UNMEAS
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  6 22'UNIT OF MEASURE'
     A                                  6 47'DESCRIPTION'
     A                                 18 17'M O D I F Y   A   D E S C R I P T'
     A                                 18 51'I O N   O N L Y'
     A            U1             2A  B  8 27DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            DESCRIPTIO    12A  B  8 47DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            U2             2A  B 10 27DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            DESCRIPTI2    12A  B 10 47DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            U3             2A  B 12 27DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            DESCRIPTI3    12A  B 12 47DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            U4             2A  B 14 27DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            DESCRIPTI4    12A  B 14 47DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            U5             2A  B 20 27DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            DESCRIPTI5    12A  B 20 47DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1DFTVAL('  F3-EXIT                  -
     A                                                                         -
     A                                                       ')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  2 73'UNMEAS'
     A                                  2 25'U N I T S   O F   M E A S U R E'
     A                                      DSPATR(HI)
     A                                  4 21'A D D   U N I T S   O F   M E A S -
     A                                      U R E'
     A                                 16  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                 23  3'INPUT DATA ABOVE AND PRESS ENTER'
     A          R UNMEASM
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 72'UNMEASM'
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 25'U N I T S   O F   M E A S U R E'
     A                                      DSPATR(HI)
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  4 21'A D D   U N I T S   O F   M E A S -
     A                                      U R E'
     A                                 16  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                 23  3'INPUT DATA ABOVE AND PRESS ENTER'
     A                                  6 22'UNIT OF MEASURE'
     A                                  6 47'DESCRIPTION'
     A                                 18 17'M O D I F Y   A   D E S C R I P T'
     A                                 18 51'I O N   O N L Y'
     A            U1             2A  B  8 27DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIO    12A  B  8 47DSPATR(PR)
     A                                      OVRDTA
     A            U2             2A  B 10 27DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI2    12A  B 10 47DSPATR(PR)
     A                                      OVRDTA
     A            U3             2A  B 12 27DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI3    12A  B 12 47DSPATR(PR)
     A                                      OVRDTA
     A            U4             2A  B 14 27DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI4    12A  B 14 47DSPATR(PR)
     A                                      OVRDTA
     A            U5             2A  B 20 27DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI5    12A  B 20 47DSPATR(UL)
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            COMMANDLN1    79A  O 24  1DFTVAL('  F3-EXIT                  -
     A                                                                         -
     A                                                       ')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A          R HELPUM1
     A*%%TS  SD  19950928  110351  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 21'E D I   U N I T S   O F   M E A S -
     A                                      U R E'
     A                                      DSPATR(HI)
     A                                  4  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  5 33'Units of Measure'
     A                                  7  4'CODE'
     A                                      DSPATR(UL)
     A                                  7 10'DESCRIPTION'
     A                                      DSPATR(UL)
     A                                  7 22'EDI'
     A                                      DSPATR(UL)
     A                                  7 30'CODE'
     A                                      DSPATR(UL)
     A                                  7 36'DESCRIPTION'
     A                                      DSPATR(UL)
     A                                  7 48'EDI'
     A                                      DSPATR(UL)
     A                                  7 56'CODE'
     A                                      DSPATR(UL)
     A                                  7 62'DESCRIPTION'
     A                                      DSPATR(UL)
     A                                  7 74'EDI'
     A                                      DSPATR(UL)
     A                                  3 35'HELP SCREEN'
     A                                      DSPATR(HI)
     A                                  9  1'     C   Hundred     CEN'
     A                                  9 32'M   Thousand    MIL      BF   Boar-
     A                                      d Feet  BFT   '
     A                                 10  1'    BG   Bag'
     A                                 10 22'BG'
     A                                 10 31'BL   Bale'
     A                                 10 48'BA'
     A                                 10 57'BR   Barrel      BAL   '
     A                                 11  1'    BT   Bottle      BO'
     A                                 11 31'BX   Box'
     A                                 11 48'BOX      CF   Cubic Feet  FTQ   '
     A                                 12  1'    CN   Can'
     A                                 12 22'CN'
     A                                 12 31'CS   Case'
     A                                 12 48'CA'
     A                                 12 57'CT   Carton      CT    '
     A                                 13  1'    CW   Hundred Wt. CWA      DR'
     A                                 13 36'Drum'
     A                                 13 48'DR'
     A                                 13 57'DZ   Dozen'
     A                                 13 74'DZN   '
     A                                 14  1'    FT   Feet'
     A                                 14 22'FOT      GL   Gallon      GLI'
     A                                 14 57'GM   Gram'
     A                                 14 74'GRM   '
     A                                 15  1'    GR   Gross'
     A                                 15 22'GRO      HR   Hour'
     A                                 15 48'HUR      IN   Inch'
     A                                 15 74'INH   '
     A                                 16  1'    KG   Kilogram    KGM      KM'
     A                                 16 36'Kilometer   KMT      KT   KIT'
     A                                 16 74'KT    '
     A                                 17  1'    LB   Pound'
     A                                 17 22'LBR      LI   Litre'
     A                                 17 48'LTR      LT   Lot'
     A                                 17 74'LO    '
     A                                 18  1'    ME   Meter'
     A                                 18 22'MTR      ML   Milliliter  MLT'
     A                                 18 57'MM   Millimeter  MMT   '
     A                                 19  1'    MO   Month'
     A                                 19 22'MON      PA   Pallet      PL'
     A                                 19 57'PC   Piece'
     A                                 19 74'PCE   '
     A                                 20  1'    PD   Pads'
     A                                 20 22'PD'
     A                                 20 31'PK   Package     PK'
     A                                 20 57'PL   Pail'
     A                                 20 74'PA    '
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('  F1-NEXT SCREEN   F3-EXIT -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R HELPUM2
     A*%%TS  SD  19950928  110351  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 21'E D I   U N I T S   O F   M E A S -
     A                                      U R E'
     A                                      DSPATR(HI)
     A                                  4  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  5 33'Units of Measure'
     A                                  3 35'HELP SCREEN'
     A                                      DSPATR(HI)
     A                                  7  4'CODE'
     A                                      DSPATR(UL)
     A                                  7 10'DESCRIPTION'
     A                                      DSPATR(UL)
     A                                  7 22'EDI'
     A                                      DSPATR(UL)
     A                                  7 30'CODE'
     A                                      DSPATR(UL)
     A                                  7 36'DESCRIPTION'
     A                                      DSPATR(UL)
     A                                  7 48'EDI'
     A                                      DSPATR(UL)
     A                                  7 56'CODE'
     A                                      DSPATR(UL)
     A                                  7 62'DESCRIPTION'
     A                                      DSPATR(UL)
     A                                  7 74'EDI'
     A                                      DSPATR(UL)
     A                                  9  1'    PT   Pint'
     A                                  9 22'PTI      QT   Quart'
     A                                  9 48'QTI      RL   Roll'
     A                                  9 74'RL    '
     A                                 10  1'    RM   Ream'
     A                                 10 22'RM'
     A                                 10 31'SF   Sq. Feet    FTR      SH   She-
     A                                      et'
     A                                 10 74'SH    '
     A                                 11  1'    SM   Sq. Meter   MTK      ST'
     A                                 11 36'SET'
     A                                 11 48'SET      SY   Sq. Yard    YDK   '
     A                                 12  1'    TN   Ton'
     A                                 12 22'TNE      YD   Yard'
     A                                 12 48'YRD      YR   Year'
     A                                 12 74'ANN   '
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('  F3-EXIT                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R STNDINST
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A            SHIPPING1     72A  B  8  4DSPATR(UL)
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            SHIPPING2     72A  B  9  4DSPATR(UL)
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            SHIPPING3     72A  B 10  4DSPATR(UL)
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            SHIPPING4     72A  B 11  4DSPATR(UL)
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            ZBILL1        72A  B 15  4DSPATR(UL)
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            ZBILL2        72A  B 16  4DSPATR(UL)
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            ZBILL3        72A  B 17  4DSPATR(UL)
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            ZBILL4        72A  B 18  4DSPATR(UL)
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            COMMANDLN1    79A  O 24  1DFTVAL('  F3-EXIT                  -
     A                                                                         -
     A                                                       ')
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 71'STNDINST'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  2 20'S T A N D A R D   I N S T R U C T -
     A                                      I O N S'
     A                                      DSPATR(HI)
     A                                 13  4'ZBILL Standard Instructions:'
     A                                  6  4'Shipping Standard Instructions (wi-
     A                                      ll appear on shipping release print-
     A                                      outs):'
     A                                  4  4'Input data below and press Enter:'
     A          R QUOTINFO
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 24'Q U O T E   I N F O R M A T I O N'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 71'QUOTINFO'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  4  3'Input data below and press the Ent-
     A                                      er key:'
     A                                  6  3'Quote Heading:'
     A                                  9  3'Secondary Quote Heading:'
     A                                 12  3'Alternate Quotation Return Address-
     A                                      :'
     A                                 17  3'Standard Instructions to Vendor fo-
     A                                      r Quotation Sheet Completion:'
     A            HEADING1      72A  B  7  5DSPATR(UL)
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            HEADING       45A  B 10 16DSPATR(UL)
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            ADDRESS1      60A  B 13 11DSPATR(UL)
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            ADDRESS2      60A  B 14 11DSPATR(UL)
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            ADDRESS3      60A  B 15 11DSPATR(UL)
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            LINE1         72A  B 18  5DSPATR(UL)
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            LINE2         72A  B 19  5DSPATR(UL)
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            LINE3         72A  B 20  5DSPATR(UL)
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            LINE4         72A  B 21  5DSPATR(UL)
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            LINE5         72A  B 22  5DSPATR(UL)
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            COMMANDLN1    79A  O 24  1DFTVAL('  F3-EXIT                  -
     A                                                                         -
     A                                                       ')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A          R QUOTINF2
     A*%%TS  SD  19970228  082505  A229282     REL-V3R7M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 26'Q U O T E   I N F O R M A T I O N'
     A                                  3  3'ALTERNATE INSTRUCTION TO VENDOR - -
     A                                      NUMBER (1):'
     A                                 10  3'ALTERNATE INSTRUCTION TO VENDOR - -
     A                                      NUMBER (2):'
     A                                 17  3'ALTERNATE INSTRUCTION TO VENDOR - -
     A                                      NUMBER (3):'
     A            LINE01        72A  B  4  5DSPATR(UL)
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            LINE02        72A  B  5  5DSPATR(UL)
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            LINE03        72A  B  6  5DSPATR(UL)
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            LINE04        72A  B  7  5DSPATR(UL)
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            LINE05        72A  B  8  5DSPATR(UL)
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            LINE06        72A  B 11  5DSPATR(UL)
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            LINE07        72A  B 12  5DSPATR(UL)
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            LINE08        72A  B 13  5DSPATR(UL)
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            LINE09        72A  B 14  5DSPATR(UL)
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            LINE10        72A  B 15  5DSPATR(UL)
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            LINE11        72A  B 18  5DSPATR(UL)
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            LINE12        72A  B 19  5DSPATR(UL)
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            LINE13        72A  B 20  5DSPATR(UL)
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            LINE14        72A  B 21  5DSPATR(UL)
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            LINE15        72A  B 22  5DSPATR(UL)
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            MSGLINE       79A  B 24  1DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A          R FLLOWUP
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 18'P U R C H A S E   O R D E R   F O -
     A                                      L L O W U P'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  2 72'FLLOWUP'
     A                                  5  4'Enter data below and press the Ent-
     A                                      er key:'
     A                                  7 17'STANDARD INSTRUCTIONS FOR PRINTING-
     A                                       OF FOLLOWUPS'
     A                                 14  8'character box preceding every stan-
     A                                      dard instruction selected.'
     A                                 16 12'"A" denotes print instruction AFTE-
     A                                      R the items.'
     A                                 17 12'"B" denotes print instruction BEFO-
     A                                      RE the items.'
     A                                 19  8'The default is "B" -- print instru-
     A                                      ction BEFORE the items.'
     A                                 13  8'your followups but can be overridd-
     A                                      en.  Enter "A" or "B" in the 1'
     A                                 12  8'The standard instructions chosen h-
     A                                      ere will be used when printing'
     A            A              1A  B  9 31DSPATR(UL)
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                      VALUES('B' 'A' ' ')
     A            S1             3A  B  9 33DSPATR(UL)
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            B              1A  B  9 38DSPATR(UL)
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                      VALUES('B' 'A' ' ')
     A            S2             3A  B  9 40DSPATR(UL)
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            C              1A  B  9 45DSPATR(UL)
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A                                      VALUES('B' 'A' ' ')
     A            S3             3A  B  9 47DSPATR(UL)
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMMANDLN1    79A  O 24  1DFTVAL('  F3-EXIT                  -
     A                                                                         -
     A                                                       ')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A          R BUYRCODE
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 30'B U Y E R   C O D E S'
     A                                      DSPATR(HI)
     A                                  9  7'CODE'
     A                                  9 14'BUYER NAME'
     A                                  9 33'PHONE NUMBER'
     A                                  9 61'DOLLAR LIMIT'
     A                                 17  7'CODE'
     A                                 17 14'BUYER NAME'
     A                                 17 33'PHONE NUMBER'
     A                                 17 61'DOLLAR LIMIT'
     A            CODE           4A  B 11  7DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            BUYERNAME     16A  B 11 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            PHONENUMBE    25A  B 11 33DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            DOLLARLIM      8A  B 11 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            MCDE           4A  B 19  7DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            MBUYERNAME    16A  B 19 14DSPATR(PR)
     A                                      OVRDTA
     A            MPHONENUMB    25A  B 19 33DSPATR(PR)
     A                                      OVRDTA
     A            MDOLLARLIM     8A  B 19 61DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('  F3-EXIT                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 71'BUYRCODE'
     A                                 13  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  7 25'A D D   A   B U Y E R   C O D E'
     A                                 15 22'M O D I F Y   A   B U Y E R   N A -
     A                                      M E'
     A                                  5  4'Input data below and press the Ent-
     A                                      er key:'
     A          R BUYRCODEM
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 30'B U Y E R   C O D E S'
     A                                      DSPATR(HI)
     A                                  9  7'CODE'
     A                                  9 14'BUYER NAME'
     A                                  9 33'PHONE NUMBER'
     A                                  9 61'DOLLAR LIMIT'
     A                                 17  7'CODE'
     A                                 17 14'BUYER NAME'
     A                                 17 33'PHONE NUMBER'
     A                                 17 61'DOLLAR LIMIT'
     A            CODE           4A  B 11  7DSPATR(PR)
     A                                      OVRDTA
     A            BUYERNAME     16A  B 11 14DSPATR(PR)
     A                                      OVRDTA
     A            PHONENUMBE    25A  B 11 33DSPATR(PR)
     A                                      OVRDTA
     A            DLOOARLIM      8A  B 11 61DSPATR(PR)
     A                                      OVRDTA
     A            MCDE           4A  B 19  7DSPATR(PR)
     A                                      OVRDTA
     A            MBUYERNAME    16A  B 19 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            MPHONENUMB    25A  B 19 33DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            MDOLLARLIM     8A  B 19 61DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('  F3-EXIT                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 70'BUYRCODEM'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  5  4'Input data below and press the Ent-
     A                                      er key:'
     A                                 13  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  7 25'A D D   A   B U Y E R   C O D E'
     A                                 15 22'M O D I F Y   A   B U Y E R   N A -
     A                                      M E'
     A          R FOBCODES
     A*%%TS  SD  19951027  092607  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 71'FOBCODES'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  2 32'F O B   C O D E S'
     A                                      DSPATR(HI)
     A                                  4 28'A D D   F O B   C O D E S'
     A                                 18 25'D E L E T E   F O B   C O D E S'
     A                                  6 21'FOB CODES'
     A                                  6 48'DESCRIPTION'
     A            F1             2A  B  8 24DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            DESCRIPTIO    20A  B  8 44DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            F2             2A  B 10 24DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            DESCRIPTI2    20A  B 10 44DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            F3             2A  B 12 24DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            DESCRIPTI3    20A  B 12 44DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            F4             2A  B 16 24DSPATR(UL)
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            DESCRIPTI4    20A  B 16 44DSPATR(PR)
     A                                      OVRDTA
     A            F5             2A  B 20 24DSPATR(UL)
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            DESCRIPTI5    20A  B 20 44DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELI1    79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1DFTVAL('  F3-EXIT')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A                                 14 23'M O D I F Y   D E S C R I P T I O -
     A                                      N'
     A                                 14  3'-------------------'
     A                                 14 59'--------------------'
     A                                 18  3'---------------------'
     A                                 18 57'----------------------'
     A          R FOBCODESD
     A*%%TS  SD  19951027  092607  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 70'FOBCODESD'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  2 32'F O B   C O D E S'
     A                                      DSPATR(HI)
     A                                  4 28'A D D   F O B   C O D E S'
     A                                 18 25'D E L E T E   F O B   C O D E S'
     A                                  6 21'FOB CODES'
     A                                  6 48'DESCRIPTION'
     A            F1             2A  B  8 24DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIO    20A  B  8 44DSPATR(PR)
     A                                      OVRDTA
     A            F2             2A  B 10 24DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI2    20A  B 10 44DSPATR(PR)
     A                                      OVRDTA
     A            F3             2A  B 12 24DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI3    20A  B 12 44DSPATR(PR)
     A                                      OVRDTA
     A            F4             2A  B 16 24DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI4    20A  B 16 44DSPATR(PR)
     A                                      OVRDTA
     A            F5             2A  B 20 24DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI5    20A  B 20 44DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELI1    79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1DFTVAL('  F3-EXIT')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A                                 14 23'M O D I F Y   D E S C R I P T I O -
     A                                      N'
     A                                 14  3'-------------------'
     A                                 14 59'--------------------'
     A                                 18  3'---------------------'
     A                                 18 57'----------------------'
     A          R FOBCODESM
     A*%%TS  SD  19951027  092607  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  6 21'FOB CODES'
     A                                  6 48'DESCRIPTION'
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 70'FOBCODESD'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  2 32'F O B   C O D E S'
     A                                      DSPATR(HI)
     A                                  4 28'A D D   F O B   C O D E S'
     A                                 18 25'D E L E T E   F O B   C O D E S'
     A            F1             2A  B  8 24DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIO    20A  B  8 44DSPATR(PR)
     A                                      OVRDTA
     A            F2             2A  B 10 24DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI2    20A  B 10 44DSPATR(PR)
     A                                      OVRDTA
     A            F3             2A  B 12 24DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI3    20A  B 12 44DSPATR(PR)
     A                                      OVRDTA
     A            F4             2A  B 16 24DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI4    20A  B 16 44DSPATR(UL)
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            F5             2A  B 20 24DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI5    20A  B 20 44DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELI1    79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1DFTVAL('  F3-EXIT')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A                                 14 23'M O D I F Y   D E S C R I P T I O -
     A                                      N'
     A                                 14  3'-------------------'
     A                                 14 59'--------------------'
     A                                 18  3'---------------------'
     A                                 18 57'----------------------'
     A          R TAXDISTR
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A            TAXDISTRIC    15A  B 10 27DSPATR(UL)
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            TAXACCT1       9Y 0B 10 51DSPATR(UL)
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            TAXDISTRI2    15A  B 11 27DSPATR(UL)
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            TAXACCT2       9Y 0B 11 51DSPATR(UL)
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            TAXDISTRI3    15A  B 12 27DSPATR(UL)
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            TAXACCT3       9Y 0B 12 51DSPATR(UL)
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            TAXDISTRI4    15A  B 13 27DSPATR(UL)
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            TAXACCT4       9Y 0B 13 51DSPATR(UL)
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            COMMANDLN1    79A  O 24  1DFT('  F3-EXIT')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A                                  2 28'T A X   D I S T R I C T S'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 71'TAXDISTR'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  5  4'Input data below and press the Ent-
     A                                      er key:'
     A                                  8  6'TAX DISTRICTS:'
     A                                  8 30'District'
     A                                      DSPATR(UL)
     A                                  8 51'Account'
     A                                      DSPATR(UL)
     A          R PODELT
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 18'P U R C H A S E   O R D E R   D E -
     A                                      L E T I O N'
     A                                      DSPATR(HI)
     A                                  3 30'I N F O R M A T I O N'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 73'PODELT'
     A                                  4  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  5  4'Input data below and press the Ent-
     A                                      er key:'
     A                                  8  9'(01-08)'
     A                                  8 18'Enter the number of months that pu-
     A                                      rchase orders should be'
     A                                  9 18'kept in the CSIS database once the-
     A                                       purchase order has been'
     A                                 10 18'completed (between 01 and 08 month-
     A                                      s).'
     A                                 12  9'(18-36)'
     A                                 12 18'Enter the number of months that pu-
     A                                      rchase orders should be'
     A                                 13 18'kept in the history database befor-
     A                                      e being moved to tape'
     A                                 14 18'(between 18 and 36 months).'
     A                                 16  9'Enter "Y" if using the invoice pro-
     A                                      cessing system provided'
     A                                 16 67'by CSIS.'
     A            PO             2Y 0B  8  5DSPATR(UL)
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                      RANGE(1 8)
     A            HD             2Y 0B 12  5DSPATR(UL)
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A                                      RANGE(18 36)
     A            Y              1A  B 16  5DSPATR(UL)
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                      VALUES('Y' ' ')
     A            COMMANDLN1    79A  O 24  1DFTVAL('  F3-EXIT')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M
     A  99                                  OVRDTA
     A          R CURRMENU
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A            COMMANDLN1    79A  O 24  1DFTVAL('                           -
     A                                             ')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A                                  2 23'C U R R E N C Y   C O D E   M E N -
     A                                      U'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  5  4'Press the appropriate function key-
     A                                       to continue:'
     A                                  8 23'F1  -->  Add Currency Codes'
     A                                 10 23'F2  -->  Exchange Rate Question'
     A                                 12 23'F3  -->  Exit'
     A                                 14 23'F4  -->  Add/Delete Exchange Rates'
     A                                 16 23'F5  -->  Modify Exchange Rate Tabl-
     A                                      e'
     A                                  2 71'CURRMENU'
     A          R CURRENCY
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A            CC             2A  B  9 46DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            DESCRIPTIO    12A  B 11 46DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            MESSAGELI1    79A  B 21  1DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELI2    79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1
     A  98                                  OVRDTA
     A                                      DFTVAL('  F1-CURRENCY CODE LIST   F-
     A                                      3-EXIT')
     A  99        MESSAGELIN    79   M      OVRDTA
     A                                  2 27'C U R R E N C Y   C O D E S'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 71'CURRENCY'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  9 28'Currency Code:'
     A                                 11 30'Description:'
     A                                  6 32'ADD A CURRENCY CODE'
     A          R ECURRENCY
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A            CC             2A  B  8 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            DESCRIPTIO    12A  B 10 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            EDI            3A  B 12 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            MESSAGELIN    79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELI2    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('  F1-HELP SCREEN   F3-EXIT -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A                                  2 27'C U R R E N C Y   C O D E S'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 70'ECURRENCY'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  5 31'ADD A CURRENCY CODE'
     A                                  8 28'Currency Code:'
     A                                 10 30'Description:'
     A                                 12 27'EDI Equivalent:'
     A          R EXCHANGE
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A            Y              1A  B  6  4DSPATR(UL)
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A            CO             2A  B  9  4DSPATR(UL)
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            MSGLINE       79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1
     A  98                                  OVRDTA
     A                                      DFTVAL('  F1-CURRENCY CODE LIST   F-
     A                                      3-EXIT')
     A  99        MESSAGELIN    79   M      OVRDTA
     A                                  2 19'E X C H A N G E   R A T E   Q U E -
     A                                      S T I O N'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 71'EXCHANGE'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  6  7'(Y/N)'
     A                                  6 14'Should PO transactions for account-
     A                                      ing and budget amounts be'
     A                                  7 14'converted to the local currency?'
     A                                  9 14'Enter your local currency code.'
     A          R EXCHANGEM
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  6 27'='
     A                                  7 27'='
     A                                  8 27'='
     A                                  9 27'='
     A                                 10 27'='
     A                                 11 27'='
     A                                 12 27'='
     A                                 13 27'='
     A                                 14 27'='
     A                                 15 27'='
     A                                 16 27'='
     A                                 17 27'='
     A                                 18 27'='
     A                                 19 27'='
     A                                 20 27'='
     A            ON1            3A  B  6  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIO    12A  B  6 14DSPATR(PR)
     A                                      OVRDTA
     A            RATE1         12Y 7B  6 29DSPATR(UL)
     A                                      DSPATR(RI)
     A                                      DSPATR(PC)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A            C1             2A  B  6 44DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPTI    12A  B  6 48DSPATR(PR)
     A                                      OVRDTA
     A            REFDA1         6A  B  6 65DSPATR(PR)
     A                                      OVRDTA
     A            ON2            3A  B  7  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI2    12A  B  7 14DSPATR(PR)
     A                                      OVRDTA
     A            RATE2         12Y 7B  7 29DSPATR(UL)
     A                                      DSPATR(RI)
     A                                      DSPATR(PC)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A            C2             2A  B  7 44DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPT2    12A  B  7 48DSPATR(PR)
     A                                      OVRDTA
     A            REFDA2         6A  B  7 65DSPATR(PR)
     A                                      OVRDTA
     A            ON3            3A  B  8  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI3    12A  B  8 14DSPATR(PR)
     A                                      OVRDTA
     A            RATE3         12Y 7B  8 29DSPATR(UL)
     A                                      DSPATR(RI)
     A                                      DSPATR(PC)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A            C3             2A  B  8 44DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPT3    12A  B  8 48DSPATR(PR)
     A                                      OVRDTA
     A            REFDA3         6A  B  8 65DSPATR(PR)
     A                                      OVRDTA
     A            ON4            3A  B  9  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI4    12A  B  9 14DSPATR(PR)
     A                                      OVRDTA
     A            RATE4         12Y 7B  9 29DSPATR(UL)
     A                                      DSPATR(RI)
     A                                      DSPATR(PC)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A            C4             2A  B  9 44DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPT4    12A  B  9 48DSPATR(PR)
     A                                      OVRDTA
     A            REFDA4         6A  B  9 65DSPATR(PR)
     A                                      OVRDTA
     A            ON5            3A  B 10  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI5    12A  B 10 14DSPATR(PR)
     A                                      OVRDTA
     A            RATE5         12Y 7B 10 29DSPATR(UL)
     A                                      DSPATR(RI)
     A                                      DSPATR(PC)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A            C5             2A  B 10 44DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPT5    12A  B 10 48DSPATR(PR)
     A                                      OVRDTA
     A            REFDA5         6A  B 10 65DSPATR(PR)
     A                                      OVRDTA
     A            ON6            3A  B 11  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI6    12A  B 11 14DSPATR(PR)
     A                                      OVRDTA
     A            RATE6         12Y 7B 11 29DSPATR(UL)
     A                                      DSPATR(RI)
     A                                      DSPATR(PC)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A            C6             2A  B 11 44DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPT6    12A  B 11 48DSPATR(PR)
     A                                      OVRDTA
     A            REFDA6         6A  B 11 65DSPATR(PR)
     A                                      OVRDTA
     A            ON7            3A  B 12  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI7    12A  B 12 14DSPATR(PR)
     A                                      OVRDTA
     A            RATE7         12Y 7B 12 29DSPATR(UL)
     A                                      DSPATR(RI)
     A                                      DSPATR(PC)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A            C7             2A  B 12 44DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPT7    12A  B 12 48DSPATR(PR)
     A                                      OVRDTA
     A            REFDA7         6A  B 12 65DSPATR(PR)
     A                                      OVRDTA
     A            ON8            3A  B 13  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI8    12A  B 13 14DSPATR(PR)
     A                                      OVRDTA
     A            RATE8         12Y 7B 13 29DSPATR(UL)
     A                                      DSPATR(RI)
     A                                      DSPATR(PC)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A            C8             2A  B 13 44DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPT8    12A  B 13 48DSPATR(PR)
     A                                      OVRDTA
     A            REFDA8         6A  B 13 65DSPATR(PR)
     A                                      OVRDTA
     A            ON9            3A  B 14  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTI9    12A  B 14 14DSPATR(PR)
     A                                      OVRDTA
     A            RATE9         12Y 7B 14 29DSPATR(UL)
     A                                      DSPATR(RI)
     A                                      DSPATR(PC)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A            C9             2A  B 14 44DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPT9    12A  B 14 48DSPATR(PR)
     A                                      OVRDTA
     A            REFDA9         6A  B 14 65DSPATR(PR)
     A                                      OVRDTA
     A            O10            3A  B 15  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIA    12A  B 15 14DSPATR(PR)
     A                                      OVRDTA
     A            RATE10        12Y 7B 15 29DSPATR(UL)
     A                                      DSPATR(RI)
     A                                      DSPATR(PC)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A            D0             2A  B 15 44DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPTN    12A  B 15 48DSPATR(PR)
     A                                      OVRDTA
     A            REFD10         6A  B 15 65DSPATR(PR)
     A                                      OVRDTA
     A            O11            3A  B 16  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIB    12A  B 16 14DSPATR(PR)
     A                                      OVRDTA
     A            RATE11        12Y 7B 16 29DSPATR(UL)
     A                                      DSPATR(RI)
     A                                      DSPATR(PC)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A            D1             2A  B 16 44DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPTA    12A  B 16 48DSPATR(PR)
     A                                      OVRDTA
     A            REFD11         6A  B 16 65DSPATR(PR)
     A                                      OVRDTA
     A            O12            3A  B 17  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIC    12A  B 17 14DSPATR(PR)
     A                                      OVRDTA
     A            RATE12        12Y 7B 17 29DSPATR(UL)
     A                                      DSPATR(RI)
     A                                      DSPATR(PC)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A            D2             2A  B 17 44DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPTB    12A  B 17 48DSPATR(PR)
     A                                      OVRDTA
     A            REFD12         6A  B 17 65DSPATR(PR)
     A                                      OVRDTA
     A            O13            3A  B 18  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTID    12A  B 18 14DSPATR(PR)
     A                                      OVRDTA
     A            RATE13        12Y 7B 18 29DSPATR(UL)
     A                                      DSPATR(RI)
     A                                      DSPATR(PC)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A            D3             2A  B 18 44DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPTC    12A  B 18 48DSPATR(PR)
     A                                      OVRDTA
     A            REFD13         6A  B 18 65DSPATR(PR)
     A                                      OVRDTA
     A            O14            3A  B 19  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIE    12A  B 19 14DSPATR(PR)
     A                                      OVRDTA
     A            RATE14        12Y 7B 19 29DSPATR(UL)
     A                                      DSPATR(RI)
     A                                      DSPATR(PC)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A            D4             2A  B 19 44DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPTD    12A  B 19 48DSPATR(PR)
     A                                      OVRDTA
     A            REFD14         6A  B 19 65DSPATR(PR)
     A                                      OVRDTA
     A            O15            3A  B 20  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIF    12A  B 20 14DSPATR(PR)
     A                                      OVRDTA
     A            RATE15        12Y 7B 20 29DSPATR(UL)
     A                                      DSPATR(RI)
     A                                      DSPATR(PC)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A            D5             2A  B 20 44DSPATR(PR)
     A                                      OVRDTA
     A            FDESCRIPTE    12A  B 20 48DSPATR(PR)
     A                                      OVRDTA
     A            REFD15         6A  B 20 65DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGE1      79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1
     A  98                                  OVRDTA
     A                                      DFTVAL('  F1-NEXT SCREEN     F3-EXI-
     A                                      T')
     A  99        MESSAGELIN    79   M      OVRDTA
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 70'EXCHANGEM'
     A                                  2 22'E X C H A N G E   R A T E   T A B -
     A                                      L E'
     A                                      DSPATR(HI)
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  4  9'Local Currency'
     A                                      DSPATR(UL)
     A                                  4 44'Foreign Currency'
     A                                      DSPATR(UL)
     A          R EXCHANGES
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 70'EXCHANGES'
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 28'E X C H A N G E   R A T E '
     A                                      DSPATR(HI)
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  5 33'ADD/DELETE ONLY'
     A                                  9 18'Enter foreign currency code:'
     A                                 12 14'One unit local currency = ????????-
     A                                        foreign currency'
     A                                 14 33'='
     A                                 14 14'One'
     A            CO             2A  B  9 49DSPATR(UL)
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            DESCRIPTIO    12A  B 14 19DSPATR(PR)
     A                                      OVRDTA
     A            RATE          12Y 7B 14 35DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            FDESCRIPTI    12A  B 14 50DSPATR(PR)
     A                                      OVRDTA
     A            REFDAT         6A  B 14 64DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELI1    79A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1
     A  98                                  OVRDTA
     A                                      DFTVAL('  F1-CURRENCY CODE LIST  F3-
     A                                      -EXIT')
     A  99        MESSAGELIN    79   M      OVRDTA
     A          R EXCHANGES2
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 69'EXCHANGES2'
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 28'E X C H A N G E   R A T E '
     A                                      DSPATR(HI)
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  5 33'ADD/DELETE ONLY'
     A                                  9 18'Enter foreign currency code:'
     A                                 12 14'One unit local currency = ????????-
     A                                        foreign currency'
     A                                 14 33'='
     A                                 14 14'One'
     A            CO             2A  B  9 49DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIO    12A  B 14 19DSPATR(PR)
     A                                      OVRDTA
     A            RATE          12Y 7B 14 35DSPATR(UL)
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            FDESCRIPTI    12A  B 14 50DSPATR(PR)
     A                                      OVRDTA
     A            REFDAT         6A  B 14 64DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELI1    79A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1
     A  98                                  OVRDTA
     A                                      DFTVAL('  F3-EXIT    F7-DELETE CODE-
     A                                      ')
     A  99        MESSAGELIN    79   M      OVRDTA
     A          R TRANMENU
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 23'T E R M S   O F   T R A N S P O R -
     A                                      T'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 70'TRANSMENU'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  5  4'Press the appropriate function key-
     A                                       to continue:'
     A                                  7 28'F1 -->  Terms of Transport'
     A                                  9 28'F2 -->  Modes of Transport'
     A                                 11 28'F3 -->  Exit'
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                             ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R TRANADD
     A*%%TS  SD  19951019  143703  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 23'T E R M S   O F   T R A N S P O R -
     A                                      T'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 72'TRANADD'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  8  3'Transportation Payment Method:'
     A                                 10 15'Terms of Delivery:'
     A            TP             2A  B  8 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            TPDEF         39A  B  8 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            TOD            3A  B 10 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            TODDEF        39A  B 10 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('  F1-HELP PAY METHOD   F2-H-
     A                                      ELP TERMS OF DELIVERY   F3-EXIT    -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A                                  6 34'Code'
     A                                      DSPATR(UL)
     A                                  6 40'Description'
     A                                      DSPATR(UL)
     A          R HELP7
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF03
     A                                  2 22'E D I   T R A N S P O R T   T E R -
     A                                      M S'
     A                                      DSPATR(HI)
     A                                  3 35'HELP SCREEN'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 74'HELP7'
     A                                  4  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  8  3'Code'
     A                                      DSPATR(UL)
     A                                  8  9'Definition'
     A                                      DSPATR(UL)
     A                                  8 41'Code'
     A                                      DSPATR(UL)
     A                                  8 47'Definition'
     A                                      DSPATR(UL)
     A                                  6 26'TRANSPORTATION PAYMENT METHOD'
     A                                 10  1'   CA   Advance Collect'
     A                                 10 42'CC   Collect        '
     A                                 11  1'   CF   Collect Freight'
     A                                 11 42'DF   Defined by Buyer and Seller'
     A                                 12  1'   FO   FOB Port of Call'
     A                                 12 42'IC   Info Copy, No Payment Due'
     A                                 13  1'   MX   Mixed'
     A                                 13 42'NC   Service Frt. No Pay Due'
     A                                 14  1'   NS   Not Specified'
     A                                 14 42'PA   Advance Prepaid'
     A                                 15  1'   PB   Cust. Pickup/Backhaul'
     A                                 15 42'PC   Prepaid but Chgd. to Cust.'
     A                                 16  1'   PO   Prepaid Only'
     A                                 16 42'PU   Pickup'
     A                                 17  1'   RC   Ret. Container Frt. to Cus-
     A                                      t'
     A                                 17 42'RF   Ret. Container Frt. Free'
     A                                 18  1'   RS   Ret. Container Frt. to Sup-
     A                                      p'
     A                                 18 42'TP   Third Party'
     A                                 19  1'   WC   Weight Condition'
     A                                 19 42'ZZ   Mutually Defined'
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('  F3-EXIT                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R HELP8
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF03
     A                                  2 22'E D I   T R A N S P O R T   T E R -
     A                                      M S'
     A                                      DSPATR(HI)
     A                                  3 35'HELP SCREEN'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 74'HELP8'
     A                                  4  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  6  2'Code'
     A                                      DSPATR(UL)
     A                                  6  8'Definition'
     A                                      DSPATR(UL)
     A                                  6 46'Code'
     A                                      DSPATR(UL)
     A                                  6 52'Definition'
     A                                      DSPATR(UL)
     A                                  8  1'  CAF  Cost & Freight To Destinati-
     A                                      on'
     A                                  8 47'FCT  Freight Carriage &'
     A                                  9  1'  CAI  Cost & Insurance To Named D-
     A                                      estination'
     A                                  9 52'Insurance Paid To'
     A                                 10  1'  CIF  Cost, Insurance Freight To'
     A                                 10 35'Named Dest. FOA  FOB Airport - Nam-
     A                                      ed'
     A                                 11  1'  CIP  Freight, Carriage, Insuranc-
     A                                      e To Dest.'
     A                                 11 52'Airport of Departure'
     A                                 12  1'  DAF  Delivery at Frontier - Name-
     A                                      d Place     FOB  Free on Board - Na-
     A                                      med Port'
     A                                 13  1'  DCP  Freight, Carriage Paid To D-
     A                                      estination'
     A                                 13 52'On Shipment'
     A                                 14  1'  DDP  Delivered Duty Paid To Dest-
     A                                      ination     FOR  Free on Rail - Nam-
     A                                      ed'
     A                                 15  1'  EXQ  EX QUAY - Duty Paid, Named -
     A                                      Port'
     A                                 15 52'Departure Point (D.P)'
     A                                 16  1'  EXS  EX SHIP - Named Port of Des-
     A                                      tination    FOS  Free On Board Stow-
     A                                      ed Named'
     A                                 17  1'  EXW  EX WORKS'
     A                                 17 52'Port of Shipment'
     A                                 18  1'  FAS  Free Alongside Ship - Named'
     A                                 18 36'Port'
     A                                 18 47'FOT  Free On Truck - Named D.P.'
     A                                 19  1'  FCA  Free Carrier - Named Port'
     A                                 19 47'FPC  Free In Pipeline Connection'
     A                                 20  1'  FCI  Freight Carriage and Insura-
     A                                      nce Paid To FPC  Named Place.'
     A                                 21  1'  FCP  Freight Carriage and Paid T-
     A                                      o'
     A                                 21 47'ZZZ  Mutually Defined'
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('  F3-EXIT                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R TRANMODE
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 23'M O D E S   O F   T R A N S P O R -
     A                                      T'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 71'TRANMODE'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                 13  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                 17  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  4 19'A D D   M O D E S   O F   T R A N'
     A                                  4 53'S P O R T'
     A                                  6 22'M O D E S'
     A                                  6 38'D E S C R I P T I O N'
     A                                 14 19'C H A N G E   D E S C R I P T I O'
     A                                 14 53'N   O N L Y'
     A                                 18 18'D E L E T E   M O D E   O F   T R'
     A                                 18 52'A N S P O R T'
     A            M1             2A  B  8 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            DESC1         20A  B  8 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            M2             2A  B 10 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            DESC2         20A  B 10 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            M3             2A  B 12 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            DESC3         20A  B 12 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            M5             2A  B 16 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            DESC4         20A  B 16 38DSPATR(UL)
     A                                      OVRDTA
     A            M6             2A  B 20 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            DESC5         20A  B 20 38DSPATR(UL)
     A                                      OVRDTA
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('  F1-HELP   F3-EXIT        -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R HELP10
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 22'E D I   T R A N S P O R T   M O D -
     A                                      E S'
     A                                      DSPATR(HI)
     A                                  3 35'HELP SCREEN'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 73'HELP10'
     A                                  4  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  8  2'Code'
     A                                      DSPATR(UL)
     A                                  8  8'Definition'
     A                                      DSPATR(UL)
     A                                  8 30'Code'
     A                                      DSPATR(UL)
     A                                  8 36'Definition'
     A                                      DSPATR(UL)
     A                                  8 60'Code'
     A                                      DSPATR(UL)
     A                                  8 66'Definition'
     A                                      DSPATR(UL)
     A                                  6 31'TRANSPORTATION MODES'
     A                                 10  1'  10   Maritime'
     A                                 10 31'20   Rail                     30'
     A                                 10 66'Road'
     A                                 11  1'  40   Air'
     A                                 11 31'50   Mail'
     A                                 11 61'60   Multimodal'
     A                                 12  1'  70   Fixed      '
     A                                 12 31'80   Inland Waterway'
     A                                 12 61'B    Barge'
     A                                 13  1'  BP   Book Postal'
     A                                 13 31'BU   Bus'
     A                                 13 61'C    Consolidated'
     A                                 14  1'  CE   Customer Pick/Exp.'
     A                                 14 31'D    Parcel Post'
     A                                 14 61'E    Exped. Truck'
     A                                 15  1'  H    Customer Pickup'
     A                                 15 31'I    Irreg. Carr.'
     A                                 15 61'K    Backhaul'
     A                                 16  1'  L    Contact Carr.'
     A                                 16 31'LT   LTL'
     A                                 16 61'M    Comm. Carr. '
     A                                 17  1'  N    Private Vessel         O'
     A                                 17 36'Contain. Ocean'
     A                                 17 61'P    Pipeline    '
     A                                 18  1'  PC   Priv. Carr.'
     A                                 18 31'PT   Pooled Truck             Q '
     A                                 18 66'Conv. Ocean'
     A                                 19  1'  S    Ocean'
     A                                 19 31'SR   Supplier Truck'
     A                                 19 61'SS   Steamship'
     A                                 20  1'  T    Best Way'
     A                                 20 31'TC   Cab (Taxi)'
     A                                 20 61'U    Priv. Parcel'
     A                                 21  1'  VE   Vessel'
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('  F3-EXIT                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EPAYTERMCD
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 24'E D I   P A Y M E N T   T E R M S'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 69'EPAYTERMCD'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  7  1'    ENTER 2 DIGIT EDI PAYMENT CODE'
     A                                  9  1'    1. PAYMENT TERMS TYPE ... : pl-
     A                                      ease enter payment type code .....'
     A                                 11  1'    2. PAYMENT TIME REFERENCE : pl-
     A                                      ease enter payment type reference'
     A                                 13  1'    3. TIME RELATION ........ : pl-
     A                                      ease enter time relation code ....'
     A                                 15  1'    4. TYPE OF PERIOD ....... : pl-
     A                                      ease enter type of period code ...'
     A                                 17  1'    5. NUMBER OF PERIODS .... : pl-
     A                                      ease enter the number of periods .'
     A                                 18  1'                              : (i-
     A                                      f prox and 2nd period required)'
     A                                 19  1'    6. PERCENTAGE ........... : pl-
     A                                      ease enter the discount rate .....'
     A                                 21  1'    7. PAYMENT NET DAYS ..... : pl-
     A                                      ease enter payment net days ......'
     A            MODE          35A  B  4 23DSPATR(PR)
     A                                      OVRDTA
     A            PC             2A  B  7 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            PT             2A  B  9 72DSPATR(PR)
     A                                      OVRDTA
     A            TRF            3A  B 11 72DSPATR(PR)
     A                                      OVRDTA
     A            TR             2A  B 13 72DSPATR(PR)
     A                                      OVRDTA
     A            TOP            3A  B 15 72DSPATR(PR)
     A                                      OVRDTA
     A            NOP            3A  B 17 72DSPATR(PR)
     A                                      OVRDTA
     A            NP2            3A  B 18 72DSPATR(PR)
     A                                      OVRDTA
     A            PE             2A  B 19 72DSPATR(PR)
     A                                      OVRDTA
     A            CNT            3A  B 19 75DSPATR(PR)
     A                                      OVRDTA
     A            PND            3A  B 21 72DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('  F3-EXIT                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EPAYTERMS
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 28'P A Y M E N T   T E R M S'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 70'EPAYTERMS'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  5  6'Press the appropriate function key-
     A                                       to continue:'
     A                                  8 28'F1  -->  Help Screen'
     A                                 10 28'F2  -->  Add Payment Terms'
     A                                 12 28'F3  -->  Exit'
     A                                 14 28'F4  -->  Delete Payment Terms'
     A                                 16 28'F5  -->  Modify Payment Terms'
     A                                 18 28'F6  -->  EDI Payment Terms'
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                             ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EPAYTERMSA
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 24'E D I   P A Y M E N T   T E R M S'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 69'EPAYTERMSA'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  7  1'    ENTER 2 DIGIT EDI PAYMENT CODE'
     A                                  9  1'    1. PAYMENT TERMS TYPE ... : pl-
     A                                      ease enter payment type code .....'
     A                                 11  1'    2. PAYMENT TIME REFERENCE : pl-
     A                                      ease enter payment type reference'
     A                                 13  1'    3. TIME RELATION ........ : pl-
     A                                      ease enter time relation code ....'
     A                                 15  1'    4. TYPE OF PERIOD ....... : pl-
     A                                      ease enter type of period code ...'
     A                                 17  1'    5. NUMBER OF PERIODS .... : pl-
     A                                      ease enter the number of periods .'
     A                                 18  1'                              : (i-
     A                                      f prox and 2nd period required)'
     A                                 19  1'    6. PERCENTAGE ........... : pl-
     A                                      ease enter the discount rate .....'
     A                                 21  1'    7. PAYMENT NET DAYS ..... : pl-
     A                                      ease enter payment net days ......'
     A            MODE          35A  B  4 23DSPATR(PR)
     A                                      OVRDTA
     A            PC             2A  B  7 38DSPATR(PR)
     A                                      OVRDTA
     A            PT             2A  B  9 72DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            TRF            3A  B 11 72DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            TR             2Y 0B 13 72DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            TOP            3A  B 15 72DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            NOP            3Y 0B 17 72DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            NP2            3Y 0B 18 72DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            PE             2Y 0B 19 72DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            CNT            3A  B 19 75DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            PND            3Y 0B 21 72DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('  F1-HELP SCREEN   F3-EXIT -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EPAYTERMSD
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 24'E D I   P A Y M E N T   T E R M S'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 69'EPAYTERMSD'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  7  1'    ENTER 2 DIGIT EDI PAYMENT CODE'
     A                                  9  1'    1. PAYMENT TERMS TYPE ... : pl-
     A                                      ease enter payment type code .....'
     A                                 11  1'    2. PAYMENT TIME REFERENCE : pl-
     A                                      ease enter payment type reference'
     A                                 13  1'    3. TIME RELATION ........ : pl-
     A                                      ease enter time relation code ....'
     A                                 15  1'    4. TYPE OF PERIOD ....... : pl-
     A                                      ease enter type of period code ...'
     A                                 17  1'    5. NUMBER OF PERIODS .... : pl-
     A                                      ease enter the number of periods .'
     A                                 18  1'                              : (i-
     A                                      f prox and 2nd period required)'
     A                                 19  1'    6. PERCENTAGE ........... : pl-
     A                                      ease enter the discount rate .....'
     A                                 21  1'    7. PAYMENT NET DAYS ..... : pl-
     A                                      ease enter payment net days ......'
     A            MODE          35A  B  4 23DSPATR(PR)
     A                                      OVRDTA
     A            PC             2A  B  7 38DSPATR(PR)
     A                                      OVRDTA
     A            PT             2A  B  9 72DSPATR(PR)
     A                                      OVRDTA
     A            TRF            3A  B 11 72DSPATR(PR)
     A                                      OVRDTA
     A            TR             2A  B 13 72DSPATR(PR)
     A                                      OVRDTA
     A            TOP            3A  B 15 72DSPATR(PR)
     A                                      OVRDTA
     A            NOP            3A  B 17 72DSPATR(PR)
     A                                      OVRDTA
     A            NP2            3A  B 18 72DSPATR(PR)
     A                                      OVRDTA
     A            PE             2A  B 19 72DSPATR(PR)
     A                                      OVRDTA
     A            CNT            3A  B 19 75DSPATR(PR)
     A                                      OVRDTA
     A            PND            3A  B 21 72DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('  F2-DELETE RECORD  F3-EXIT-
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EPAYTERMSM
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 24'E D I   P A Y M E N T   T E R M S'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 69'EPAYTERMSM'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  5  8'Press the appropriate function key-
     A                                       to continue:'
     A                                  9 26'F1  -->  Help Screen'
     A                                 11 26'F2  -->  Add EDI Payment Terms'
     A                                 13 26'F3  -->  Exit'
     A                                 15 26'F4  -->  Modify EDI Payment Terms'
     A                                 17 26'F5  -->  Delete EDI Payment Terms'
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                              ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R PAYTERMS
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 28'P A Y M E N T   T E R M S'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 71'PAYTERMS'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  5  7'Press the appropriate function key-
     A                                       to continue:'
     A                                  9 28'F1  -->  Help Screen'
     A                                 11 28'F2  -->  Add Payment Terms'
     A                                 13 28'F3  -->  Exit'
     A                                 15 28'F4  -->  Delete Payment Terms'
     A                                 17 28'F5  -->  Modify Payment Terms'
     A            COMMANDLN1    79A  O 24  1
     A  98                                  OVRDTA
     A                                      DFTVAL('                           -
     A                                                     ')
     A  99        MESSAGELIN    79   M      OVRDTA
     A          R PAYTERMSA
     A*%%TS  SD  19951027  083908  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 28'P A Y M E N T   T E R M S'
     A                                      DSPATR(HI)
     A                                  2 70'PAYTERMSA'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  7 33'DISCOUNT AMOUNT'
     A                                  9 13'Code'
     A                                  9 30'Description'
     A                                  9 57'Numeric Value'
     A            C              1A  B 11 14DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            DESCR          5A  B 11 33DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            NN             5Y 5B 11 60DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A                                 12 57'(EX. 5% = .05000)'
     A                                 15 24'TIME FRAME OF DISCOUNT (DUE DATE)'
     A                                 17 61'Multiple'
     A                                 18  8'Code'
     A                                 18 19'Description'
     A                                 18 37'Days/Prox'
     A                                 18 49'Flag'
     A                                 18 57'Days/Prox'
     A                                 18 68'Flag'
     A            O              1A  B 20  9DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            DESCRIPTIO    18A  B 20 15DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            DP1            3Y 0B 20 40DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            F              1A  B 20 50DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            DP2            3Y 0B 20 60DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            L              1A  B 20 69DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            MESSAGELI1    79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1DFTVAL('  F3-EXIT')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A                                  7  3'-----------------------------'
     A                                 15  3'--------------------'
     A                                  7 49'------------------------------'
     A                                 15 58'---------------------'
     A                                  5 24'A D D   P A Y M E N T   T E R M S'
     A          R PAYTERMSD
     A*%%TS  SD  19951027  083908  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 28'P A Y M E N T   T E R M S'
     A                                      DSPATR(HI)
     A                                  2 70'PAYTERMSD'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  7 33'DISCOUNT AMOUNT'
     A                                  9 13'Code'
     A                                  9 30'Description'
     A                                  9 57'Numeric Value'
     A            C              1A  B 11 14DSPATR(UL)
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            DESCR          5A  B 11 33DSPATR(PR)
     A                                      OVRDTA
     A            NN             5Y 5B 11 60EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                 15 24'TIME FRAME OF DISCOUNT (DUE DATE)'
     A                                 17 61'Multiple'
     A                                 18  8'Code'
     A                                 18 19'Description'
     A                                 18 37'Days/Prox'
     A                                 18 49'Flag'
     A                                 18 57'Days/Prox'
     A                                 18 68'Flag'
     A            O              1A  B 20  9DSPATR(UL)
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            DESCRIPTIO    18A  B 20 15DSPATR(PR)
     A                                      OVRDTA
     A            DP1            3Y 0B 20 40DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            F              1A  B 20 50DSPATR(PR)
     A                                      OVRDTA
     A            DP2            3Y 0B 20 60DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            L              1A  B 20 69DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELI1    79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1DFTVAL('  F3-EXIT')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A                                  5 21'D E L E T E   P A Y M E N T   T E -
     A                                      R M S'
     A                                  7  3'-----------------------------'
     A                                  7 49'------------------------------'
     A                                 15  3'--------------------'
     A                                 15 58'---------------------'
     A          R PAYTERMSDX
     A*%%TS  SD  19951027  083908  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 28'P A Y M E N T   T E R M S'
     A                                      DSPATR(HI)
     A                                  2 69'PAYTERMSDX'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  7 33'DISCOUNT AMOUNT'
     A                                  9 13'Code'
     A                                  9 30'Description'
     A                                  9 57'Numeric Value'
     A            C              1A  B 11 14DSPATR(PR)
     A                                      OVRDTA
     A            DESCR          5A  B 11 33DSPATR(PR)
     A            NN             5Y 5B 11 60EDTCDE(4)
     A                                      DSPATR(PR)
     A                                 15 24'TIME FRAME OF DISCOUNT (DUE DATE)'
     A                                 17 61'Multiple'
     A                                 18  8'Code'
     A                                 18 19'Description'
     A                                 18 37'Days/Prox'
     A                                 18 49'Flag'
     A                                 18 57'Days/Prox'
     A                                 18 68'Flag'
     A            O              1A  B 20  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIO    18A  B 20 15DSPATR(PR)
     A            DP1            3Y 0B 20 40DSPATR(PR)
     A                                      EDTCDE(4)
     A            F              1A  B 20 50DSPATR(PR)
     A            DP2            3Y 0B 20 60DSPATR(PR)
     A                                      EDTCDE(4)
     A            L              1A  B 20 69DSPATR(PR)
     A            MESSAGELI1    79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1DFTVAL('  F3-EXIT')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A                                  5 21'D E L E T E   P A Y M E N T   T E -
     A                                      R M S'
     A                                  7  3'-----------------------------'
     A                                  7 49'------------------------------'
     A                                 15  3'--------------------'
     A                                 15 58'---------------------'
     A          R PAYTERMSM
     A*%%TS  SD  19951027  083908  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 28'P A Y M E N T   T E R M S'
     A                                      DSPATR(HI)
     A                                  2 70'PAYTERMSM'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  7 33'DISCOUNT AMOUNT'
     A                                  9 13'Code'
     A                                  9 30'Description'
     A                                  9 57'Numeric Value'
     A            C              1A  B 11 14DSPATR(UL)
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            DESCR          5A  B 11 33DSPATR(PR)
     A                                      OVRDTA
     A            NN             5Y 5B 11 60EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                 15 24'TIME FRAME OF DISCOUNT (DUE DATE)'
     A                                 17 61'Multiple'
     A                                 18  8'Code'
     A                                 18 19'Description'
     A                                 18 37'Days/Prox'
     A                                 18 49'Flag'
     A                                 18 57'Days/Prox'
     A                                 18 68'Flag'
     A            O              1A  B 20  9DSPATR(UL)
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            DESCRIPTIO    18A  B 20 15DSPATR(PR)
     A                                      OVRDTA
     A            DP1            3Y 0B 20 40DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            F              1A  B 20 50DSPATR(PR)
     A                                      OVRDTA
     A            DP2            3Y 0B 20 60DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            L              1A  B 20 69DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELI1    79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1DFTVAL('  F3-EXIT')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A                                  5 21'M O D I F Y   P A Y M E N T   T E -
     A                                      R M S'
     A                                  7  3'-----------------------------'
     A                                  7 49'------------------------------'
     A                                 15  3'--------------------'
     A                                 15 58'---------------------'
     A          R PAYTERMSMX
     A*%%TS  SD  19951027  083908  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 28'P A Y M E N T   T E R M S'
     A                                      DSPATR(HI)
     A                                  2 69'PAYTERMSMX'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  7 33'DISCOUNT AMOUNT'
     A                                  9 13'Code'
     A                                  9 30'Description'
     A                                  9 57'Numeric Value'
     A            C              1A  B 11 14DSPATR(PR)
     A                                      OVRDTA
     A            DESCR          5A  B 11 33DSPATR(UL)
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            NN             5Y 5B 11 60EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A                                 12 57'(EX. 5% = .05000)'
     A                                 15 24'TIME FRAME OF DISCOUNT (DUE DATE)'
     A                                 17 61'Multiple'
     A                                 18  8'Code'
     A                                 18 19'Description'
     A                                 18 37'Days/Prox'
     A                                 18 49'Flag'
     A                                 18 57'Days/Prox'
     A                                 18 68'Flag'
     A            O              1A  B 20  9DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIO    18A  B 20 15DSPATR(UL)
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            DP1            3Y 0B 20 40DSPATR(UL)
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            F              1A  B 20 50DSPATR(UL)
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            DP2            3Y 0B 20 60DSPATR(UL)
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            L              1A  B 20 69DSPATR(UL)
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            MESSAGELI1    79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1DFTVAL('  F3-EXIT')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A                                  5 21'M O D I F Y   P A Y M E N T   T E -
     A                                      R M S'
     A                                  7  3'-----------------------------'
     A                                  7 49'------------------------------'
     A                                 15  3'--------------------'
     A                                 15 58'---------------------'
     A          R HELP2
     A*%%TS  SD  19951027  083908  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 28'P A Y M E N T   T E R M S'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 74'HELP2'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                 13  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                 23  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  4  1'  EXAMPLE:  (1)  1% DISCOUNT NET 3-
     A                                      0 DAYS    (2)   PROX 15TH & 25TH'
     A                                 11  1'  (1)'
     A                                 11 14'1'
     A                                 11 32'1 %   DISCOUNT'
     A                                 12  1'  (2)'
     A                                 12 14'2'
     A                                 12 32'NO    DISCOUNT'
     A                                 14 15'T I M E   F R A M E   O F  D I S C'
     A                                 14 50'O U N T (DUE DATE)'
     A                                 21  1'  (1)    A'
     A                                 21 19'NET 30 DAYS'
     A                                 21 39'30'
     A                                 21 51'D'
     A                                 22  1'  (2)    B'
     A                                 22 19'PROX 15TH & 25TH    15'
     A                                 22 51'P'
     A                                 22 64'25'
     A                                 22 74'P     '
     A            COMMANDLN1    79A  B 24  1DFTVAL('  F3-EXIT                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A                                  8 13'Code'
     A                                      DSPATR(UL)
     A                                  8 33'Description'
     A                                      DSPATR(UL)
     A                                  8 57'Numeric Value'
     A                                      DSPATR(UL)
     A                                  9 54'(5 decimal places)'
     A                                 11 60'.01000'
     A                                 12 60'.00000'
     A                                 16 19'Description'
     A                                      DSPATR(UL)
     A                                 16  8'Code'
     A                                      DSPATR(UL)
     A                                 16 36'Days/Prox'
     A                                      DSPATR(UL)
     A                                 16 49'Flag'
     A                                      DSPATR(UL)
     A                                 15 62'Multiple'
     A                                 16 59'Days/Prox'
     A                                      DSPATR(UL)
     A                                 16 71'Flag'
     A                                      DSPATR(UL)
     A                                 17 36'(3 digits)'
     A                                 18 48'Days = D'
     A                                 17 59'(If Flag = P, then'
     A                                 18 60'another date can'
     A                                 19 62'be selected)'
     A                                 17 47'(Prox = P'
     A                                 19 48'N/A  = N)'
     A                                  9 31'(free verbage)'
     A                                  9  7'(user-assigned)'
     A                                 17  3'(user-assign)'
     A                                 17 18'(free verbage)'
     A                                  5  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  6 26'D I S C O U N T   A M O U N T'
     A          R HELP6
     A*%%TS  SD  19951002  154958  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF03
     A                                  2 24'E D I   P A Y M E N T   T E R M S'
     A                                      DSPATR(HI)
     A                                  3 35'HELP SCREEN'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 74'HELP6'
     A                                  4  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  7  1'    ENTER 2 DIGIT EDI PAYMENT CODE'
     A                                  7 36'  1D'
     A                                 10  1'    1. PAYMENT TERMS TYPE ... : pl-
     A                                      ease enter payment type code .....'
     A                                 10 70'  01'
     A                                 12  1'    2. PAYMENT TIME REFERENCE : pl-
     A                                      ease enter payment type reference'
     A                                 12 70': 05'
     A                                 14  1'    3. TIME RELATION ........ : pl-
     A                                      ease enter time relation code ....'
     A                                 14 70'  03'
     A                                 16  1'    4. TYPE OF PERIOD ....... : pl-
     A                                      ease enter type of period code ...'
     A                                 16 70'  D'
     A                                 18  1'    5. NUMBER OF PERIODS .... : pl-
     A                                      ease enter the number of periods .'
     A                                 18 70'  60'
     A                                 20  1'    6. PERCENTAGE ........... : pl-
     A                                      ease enter the discount rate .....'
     A                                 20 70'  00.00'
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('  F3-EXIT                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R SHIPQUES
     A*%%TS  SD  19970806  090001  A257947     REL-V3R7M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A            SHIP1          1A  B  8 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(PR)
     A            SHIP2          2Y 0B 10 43
     A  20                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A  20                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(3)
     A  30                                  DSPATR(PR)
     A            SHIP3          1A  B 15 13DSPATR(UL)
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A  22                                  DSPATR(PR)
     A            SHIP4          1A  B 16 13DSPATR(UL)
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  22                                  DSPATR(PR)
     A            SHIP5          2Y 0B 17 55
     A  21                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A  21                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(3)
     A  22                                  DSPATR(PR)
     A            CHGMSG        50A  B 19  9OVRDTA
     A                                      OVRATR
     A N22                                  DSPATR(ND)
     A                                      DSPATR(PR)
     A            SHIP6          1A  B 20 46
     A N22                                  DSPATR(ND)
     A  22                                  DSPATR(UL)
     A  22                                  DSPATR(PC)
     A N22                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  7  4'Should a default value for ship ti-
     A                                      me (Est. Lead Time) be used when ne-
     A                                      w'
     A                                  8  7'codes are added to the database (Y-
     A                                      /N)?'
     A                                 10  4'If yes, how many days should be us-
     A                                      ed?'
     A                                 13  4'Place an "X" by one of the followi-
     A                                      ng options if you want to change th-
     A                                      e'
     A                                 20  9'*** Continue with the change (Y/N)-
     A                                      ?'
     A N22                                  DSPATR(ND)
     A                                      OVRATR
     A                                 20 56'***'
     A N22                                  DSPATR(ND)
     A                                      OVRATR
     A            MESSAGELIN    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('F3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A                                 14  4'Ship time of existing corporate co-
     A                                      des in the database:'
     A                                 15 16'Change codes with a ship time of z-
     A                                      ero'
     A                                 16 16'Change ALL codes'
     A                                 17  4'How many days should be used to ch-
     A                                      ange ship time?'
     A                                  2 22'S H I P   T I M E   Q U E S T I O -
     A                                      N S'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 71'SHIPQUES'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A*  90/01/30  11:30:49    A034675     REL-R01M02  5728-PW1
     A          R STRMDEPT
     A*%%TS  SD  19951006  093931  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 71'STRMDEPT'
     A                                  2 20'S T O R E R O O M   D E P A R T M -
     A                                      E N T S'
     A                                      DSPATR(HI)
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  8 18'Department 1:'
     A                                 10 18'Department 2:'
     A                                 12 18'Department 3:'
     A                                 14 18'Department 4:'
     A                                 16 18'Department 5:'
     A                                 18 18'Department 6:'
     A                                 20 17'Are spaces a valid department numb-
     A                                      er (Y or N):'
     A                                  6 49'Last Date Modified'
     A            DPT1           4A  B  8 37DSPATR(UL)
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                      COMP(NE ' ')
     A            DATE1          6A  B  8 56DSPATR(PR)
     A                                      OVRDTA
     A            DPT2           4A  B 10 37DSPATR(UL)
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            DATE2          6A  B 10 56DSPATR(PR)
     A                                      OVRDTA
     A            DPT3           4A  B 12 37DSPATR(UL)
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            DATE3          6A  B 12 56DSPATR(PR)
     A                                      OVRDTA
     A            DPT4           4A  B 14 37DSPATR(UL)
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            DATE4          6A  B 14 56DSPATR(PR)
     A                                      OVRDTA
     A            DPT5           4A  B 16 37DSPATR(UL)
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            DATE5          6A  B 16 56DSPATR(PR)
     A                                      OVRDTA
     A            DPT6           4A  B 18 37DSPATR(UL)
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            DATE6          6A  B 18 56DSPATR(PR)
     A                                      OVRDTA
     A            X              1A  B 20 65DSPATR(UL)
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A            MESSAGELI1    79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1DFTVAL('  F3-EXIT')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A          R MULTSTR
     A*%%TS  SD  19951003  110830  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 15'M U L T I P L E   S T O R E R O O -
     A                                      M   O P T I O N S'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 72'MULTSTR'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  7  8'(Y/N)'
     A                                  7 15'Is this a multiple storeroom plant-
     A                                      ?  (multiple storerooms within'
     A                                  8 15'a single database)'
     A                                  5  4'Input data below and press Enter:'
     A                                 10  8'(Y/N)'
     A                                 10 15'If multiple storeroom, if a code h-
     A                                      as no bin prefixes (A-, B-,'
     A                                 11 15'etc.), is it considered a single s-
     A                                      toreroom code (default to'
     A                                 12 15'the main storeroom)?'
     A            M              1A  B  7  5DSPATR(UL)
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            S              1A  B 10  5DSPATR(UL)
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            COMMANDLN1    79A  O 24  1DFTVAL('  F3-EXIT')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A          R MULTPRNT
     A*%%TS  SD  19951011  083827  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 71'MULTPRNT'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  5  4'Input data below and press Enter:'
     A                                  7  5'If multiple storeroom, enter the p-
     A                                      rinter numbers for applicable'
     A                                  8  5'storerooms:'
     A                                 10 22'Printer'
     A                                 11 22'Number'
     A                                      DSPATR(UL)
     A                                 11  9'Storeroom'
     A                                      DSPATR(UL)
     A                                 13 34'NOTE:  For multiple storeroom, sin-
     A                                      gle'
     A                                 14 41'DB plants, the bins are prefixed'
     A                                 15 41'with the storeroom code:'
     A                                 16 45'A -- Storeroom A'
     A                                 17 45'B -- Storeroom B'
     A                                 18 41'etc, up to 6 bin locations.'
     A            A              2A  B 13 12DSPATR(UL)
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            P1             2Y 0B 13 24DSPATR(UL)
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            B              2A  B 14 12DSPATR(UL)
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            P2             2Y 0B 14 24DSPATR(UL)
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            C              2A  B 15 12DSPATR(UL)
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            P3             2Y 0B 15 24DSPATR(UL)
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            D              2A  B 16 12DSPATR(UL)
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            P4             2A  B 16 24DSPATR(UL)
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            E              2A  B 17 12DSPATR(UL)
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            P5             2Y 0B 17 24DSPATR(UL)
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            F              2A  B 18 12DSPATR(UL)
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            P6             2Y 0B 18 24DSPATR(UL)
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            COMMANDLN1    79A  O 24  1DFTVAL('  F3-EXIT')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A                                  2 27'MULTIPLE STOREROOM PRINTERS'
     A                                      DSPATR(HI)
     A*  90/01/30  13:48:39    A034675     REL-R01M02  5728-PW1
     A          R CLSDATE
     A*%%TS  SD  19951006  082254  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A            YY             2Y 0B  7 44DSPATR(UL)
     A                                      EDTCDE(3)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A                                      RANGE(0 99)
     A            MM             2Y 0B  7 47DSPATR(UL)
     A                                      EDTCDE(3)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A                                      RANGE(1 12)
     A            DD             2Y 0B  7 50DSPATR(UL)
     A                                      EDTCDE(3)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A                                      RANGE(1 31)
     A            HH             2Y 0B  9 44DSPATR(UL)
     A                                      EDTCDE(3)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A                                      RANGE(0 24)
     A            MS             2Y 0B  9 47DSPATR(UL)
     A                                      EDTCDE(3)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A                                      RANGE(0 60)
     A            SS             2Y 0B  9 50DSPATR(UL)
     A                                      EDTCDE(3)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A                                      RANGE(0 60)
     A            MSGLINE1      79A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('  F3-EXIT')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 72'CLSDATE'
     A                                  2 24'M O N T H   E N D   C L O S I N G'
     A                                      DSPATR(HI)
     A                                  3 28'D A T E   A N D   T I M E'
     A                                      DSPATR(HI)
     A                                  4  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  7 12'Current Month''s Closing Date:'
     A                                  9 12'Current Month''s Closing Time:'
     A                                  7 55'in YY/MM/DD format'
     A                                  9 55'in military time'
     A                                 11 14'Example:  8:00 AM is 08:00:00'
     A                                 12 24'8:15 PM is 20:15:00'
     A*  90/01/30  14:05:30    A034675     REL-R01M02  5728-PW1
     A          R CURRMTH
     A*%%TS  SD  19951006  082254  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A            MM             2Y 0B  7 51DSPATR(UL)
     A                                      EDTCDE(3)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A                                      RANGE(1 12)
     A            YY             2Y 0B  9 51DSPATR(UL)
     A                                      EDTCDE(3)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A                                      RANGE(0 99)
     A            MSGLINE1      79A  B 18  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('  F3-EXIT')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 72'CURRMTH'
     A                                  2 17'C U R R E N T   A C C O U N T I N -
     A                                      G   M O N T H'
     A                                      DSPATR(HI)
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  7 23'Current Accounting Month:'
     A                                  9 24'Current Accounting Year:'
     A          R ITDEPT
     A*%%TS  SD  19951006  082254  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A            DPT1           4A  B  7 29DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            DPT2           4A  B  7 41DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            MSGLINE1      78A  B 17  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('  F3-EXIT                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A                                  2 73'ITDEPT'
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 15'I N T E R N A L   O R D E R   D E -
     A                                      P A R T M E N T S'
     A                                      DSPATR(HI)
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                 10  7'Any raw material issued out of the-
     A                                       storeroom charging either of the'
     A                                 11  8'above internal order departments w-
     A                                      ill have their issued quantities'
     A                                 12 13'deducted from usage figures for LI-
     A                                      FO reporting purposes.'
     A          R CSASMAIN
     A*%%TS  SD  19951005  133213  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 26'C S A S   S E T U P   M E N U'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                 13 44'CSAS User Options'
     A                                 21  9'*** PLACE AN X IN FRONT OF THE DES-
     A                                      IRED TOPIC AND PRESS ENTER ***'
     A                                 22 22'OR PRESS F3 TO RETURN TO THE MAIN -
     A                                      MENU'
     A                                  2 71'CSASMAIN'
     A                                  6  9'Write Down Classes'
     A                                  8  9'Storeroom Department'
     A                                 13  9'Internal Order Departments'
     A                                  6 44'Month-end Closing Date and Time'
     A                                  8 44'Current Accounting Month'
     A                                 10 44'Storeroom Adjustment Account'
     A                                 11 12'Departments'
     A                                 10  9'Raw Material Variance'
     A            W              1A  B  6  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            S              1A  B  8  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            V              1A  B 10  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            I              1A  B 13  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            C              1A  B  6 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            A              1A  B  8 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            J              1A  B 10 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            USEROPT        1   B 13 40
     A  23                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A  23                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R RAWMATL
     A*%%TS  SD  19951006  082254  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 20'R A W   M A T E R I A L   V A R I -
     A                                      A N C E'
     A                                      DSPATR(HI)
     A                                  2 72'RAWMATL'
     A                                  3 30'D E P A R T M E N T S'
     A                                      DSPATR(HI)
     A                                  4  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  6  5'Input data below and press the Ent-
     A                                      er key:'
     A                                  8 45'Last Date Modified'
     A                                 10 20'Rubber:'
     A            DPT1           4A  B 10 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            DATE1          6A  B 10 52DSPATR(PR)
     A                                      OVRDTA
     A                                 11 20'Fabric:'
     A            DPT2           4A  B 11 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            DATE2          6A  B 11 52DSPATR(PR)
     A                                      OVRDTA
     A                                 12 17'All Other:'
     A            DPT3           4A  B 12 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            DATE3          6A  B 12 52DSPATR(PR)
     A                                      OVRDTA
     A            MSGLINE1      78A  B 18  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('  F3-EXIT')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A*  90/01/30  11:30:49    A034675     REL-R01M02  5728-PW1
     A          R STRMADJ
     A*%%TS  SD  19951006  082254  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 21'S T O R E R O O M   A D J U S T M -
     A                                      E N T'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  2 72'STRMADJ'
     A                                  5  6'Input data below and press the Ent-
     A                                      er key:'
     A                                  9 25'Account Number:'
     A            ACCTNO         6Y 0B  9 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                      CHECK(ME)
     A            MSGLINE1      79A  B 18  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DSPATR(PR)
     A  98                                  OVRDTA
     A                                      DFTVAL('  ENTER-SAVE   F3-EXIT ')
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R CSASDPT
     A*%%TS  SD  19951006  082254  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 21'S T O R E R O O M   D E P A R T M -
     A                                      E N T'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 72'CSASDPT'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  5  6'Input data below and press the Ent-
     A                                      er key:'
     A                                  9 28'DEPARTMENT :'
     A            DPT1           4A  B  9 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                      CHECK(ME)
     A            MSGLINE1      79A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DSPATR(PR)
     A  98                                  OVRDTA
     A                                      DFTVAL('  F3-EXIT')
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R CSASDPT2
     A*%%TS  SD  19951006  082254  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 21'S T O R E R O O M   D E P A R T M -
     A                                      E N T'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 71'CSASDPT2'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  5  7'Input data below and press the Ent-
     A                                      er key:'
     A                                  9 28'DEPARTMENT :'
     A            DPT1           4A  B  9 42DSPATR(PR)
     A                                      OVRDTA
     A            MSGLINE1      79A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('  F3-EXIT')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A*  90/01/30  10:15:27    A034675     REL-R01M02  5728-PW1
     A          R WDCLASS
     A*%%TS  SD  19951027  131233  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 23'W R I T E   D O W N   C L A S S E -
     A                                      S'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 72'WDCLASS'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  4  5'Below are the write down classes p-
     A                                      resently defined to your system:'
     A                                  5  5'(Note:  Only items with these clas-
     A                                      ses are eligible for write down.)'
     A                                  8  7'Last date modified:'
     A                                 10 18'Write Down Class'
     A                                      DSPATR(UL)
     A                                 10 40'Function'
     A                                      DSPATR(UL)
     A                                 10 52'(A = Add   D = Delete)'
     A                                 20  9'Enter write down classes to be add-
     A                                      ed or deleted above along with'
     A                                 21 16'an "A" or "D" in the corresponding-
     A                                       function area.'
     A            CL1            3A  B  7  7DSPATR(PR)
     A                                      OVRDTA
     A            CL2            3A  B  7 14DSPATR(PR)
     A                                      OVRDTA
     A            CL3            3A  B  7 21DSPATR(PR)
     A                                      OVRDTA
     A            CL4            3A  B  7 28DSPATR(PR)
     A                                      OVRDTA
     A            CL5            3A  B  7 35DSPATR(PR)
     A                                      OVRDTA
     A            CL6            3A  B  7 42DSPATR(PR)
     A                                      OVRDTA
     A            CL7            3A  B  7 49DSPATR(PR)
     A                                      OVRDTA
     A            CL8            3A  B  7 56DSPATR(PR)
     A                                      OVRDTA
     A            CL9            3A  B  7 63DSPATR(PR)
     A                                      OVRDTA
     A            CL0            3A  B  7 70DSPATR(PR)
     A                                      OVRDTA
     A            DATMOD         6A  B  8 30DSPATR(PR)
     A                                      OVRDTA
     A            CM1            3A  B 12 24DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            A              1A  B 12 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A                                      VALUES(' ' 'A' 'D')
     A            CM2            3A  B 14 24DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            B              1A  B 14 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A                                      VALUES(' ' 'A' 'D')
     A            CM3            3A  B 16 24DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            C              1A  B 16 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A                                      VALUES(' ' 'A' 'D')
     A            CM4            3A  B 18 24DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            D              1A  B 18 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                      VALUES(' ' 'A' 'D')
     A            MSGLINE1      79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DSPATR(PR)
     A  98                                  OVRDTA
     A                                      DFTVAL('  F3-EXIT')
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R SYSVAL
     A*%%TS  SD  19951006  130711  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A            PR1            3A  B  6 28DSPATR(UL)
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A                                      VALUES('001' '002' '005' '007' '008-
     A                                      ' '009' '011' '012')
     A            PR2            3A  B  6 50DSPATR(UL)
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A                                      VALUES('001' '002' '005' '007' '008-
     A                                      ' '009' '011' '012')
     A            X              1A  B 12  9DSPATR(UL)
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            Y              1A  B  9  9DSPATR(UL)
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            MESSAGELI1    79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1DFT('  F1-HELP   F3-EXIT')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A                                  2 20'S Y S T E M   D I S P L A Y   V A -
     A                                      L U E S'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 73'SYSVAL'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                 12 14'Place an "X" in the box if you wou-
     A                                      ld like'
     A                                 13 14'99.999,99 format instead of 99,999-
     A                                      .99 format.'
     A                                  9 14'Place an "X" in the box if you wou-
     A                                      ld like DMY format.'
     A                                  5  6'Primary and Secondary Languages:  -
     A                                      (Press F1 for Help)'
     A                                  6 18'Primary:'
     A                                  6 38'Secondary:'
     A                                  8  6'European Date Format:'
     A                                 11  6'European Decimal Format (,):'
     A          R HELP
     A*%%TS  SD  19951006  124214  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A            COMMANDLN1    79A  B 24  1DFTVAL('  F3-EXIT                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A                                  2 20'L A N G U A G E   O P T I O N S   -
     A                                      H E L P'
     A                                      DSPATR(HI)
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  6  6'language chosen against these lang-
     A                                      uages defined for individual plants-
     A                                      .'
     A                                  7  6'When the user enters an invalid la-
     A                                      nguage, the catalog programs defaul-
     A                                      t'
     A                                  8  8'to the primary language.  Second a-
     A                                      nd third languages are optional.'
     A                                  5  9'The code catalogs program has lang-
     A                                      uage options and validates the'
     A                                 10 31'VALID LANGUAGES ARE:'
     A                                      DSPATR(UL)
     A                                 12 32'001   American'
     A                                 13 32'002   Canadian-French'
     A                                 14 32'005   English'
     A                                 15 32'007   French'
     A                                 16 32'008   German'
     A                                 17 32'009   Italian'
     A                                 18 32'011   Portuguese'
     A                                 19 32'012   Spanish'
     A          R HOLDSTA
     A*%%TS  SD  19951006  134721  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                 10 26'CODE'
     A                                 10 43'DESCRIPTION'
     A                                 18 26'CODE'
     A                                 18 42'DESCRIPTION'
     A            ACODE          2A  B 12 27DSPATR(UL)
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A                                      OVRDTA
     A            DESCRIPT      10A  B 12 44DSPATR(UL)
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A                                      OVRDTA
     A            MCODE          2A  B 20 27DSPATR(UL)
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A                                      OVRDTA
     A            DESCRIPT2     10A  B 20 43DSPATR(PR)
     A                                      OVRDTA
     A            MESSAGELI1    79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1DFT('  F1-HELP   F3-EXIT')
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A                                  2 16'R E Q U I S I T I O N   H O L D   -
     A                                      S T A T U S E S'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 72'HOLDSTA'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  5 12'Requisition hold statuses for requ-
     A                                      isitions placed on hold'
     A                                  6 23'in Materials Control and Purchasin-
     A                                      g.'
     A                                 16 21'--- MODIFY A REQUISITION HOLD STAT-
     A                                      US ---'
     A                                  8 22'--- ADD A REQUISITION HOLD STATUS -
     A                                      ---'
     A          R HOLDSTM
     A*%%TS  SD  19951006  134721  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                 10 26'CODE'
     A                                 10 43'DESCRIPTION'
     A                                 18 26'CODE'
     A                                 18 42'DESCRIPTION'
     A            ACODE          2A  B 12 27DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPT      10A  B 12 44DSPATR(PR)
     A                                      OVRDTA
     A            MCODE          2A  B 20 27DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPT2     10A  B 20 43DSPATR(UL)
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A                                      CHECK(ME)
     A            MESSAGELI1    79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1DFT('  F1-HELP   F3-EXIT')
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A                                  2 16'R E Q U I S I T I O N   H O L D   -
     A                                      S T A T U S E S'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 72'HOLDSTM'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  5 12'Requisition hold statuses for requ-
     A                                      isitions placed on hold'
     A                                  6 23'in Materials Control and Purchasin-
     A                                      g.'
     A                                  8 22'--- ADD A REQUISITION HOLD STATUS -
     A                                      ---'
     A                                 16 21'--- MODIFY A REQUISITION HOLD STAT-
     A                                      US ---'
     A          R HELP3
     A*%%TS  SD  19951006  135948  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A            COMMANDLN1    79A  B 24  1DFTVAL('  F3-EXIT                  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A                                  2 16'R E Q U I S I T I O N   H O L D   -
     A                                      S T A T U S E S'
     A                                      DSPATR(HI)
     A                                  3 35'HELP SCREEN'
     A                                      DSPATR(HI)
     A                                  4  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  6  9'The following requisition hold sta-
     A                                      tuses are initialized in your'
     A                                  7  8'system.  These can be modified or -
     A                                      deleted at your discretion.  The'
     A                                  8  7'requisition hold statuses are used-
     A                                       for requisitions that are placed'
     A                                  9 19'on hold in Materials Control or Pu-
     A                                      rchasing.'
     A                                 11 32'CODE'
     A                                 11 42'DESCRIPTION'
     A                                 13 33'MC       Mtl. Ctl.'
     A                                 14 33'QU       Quote'
     A                                 15 33'BD       Purchasing'
     A                                 16 33'EA       Eng. Appr.               -
     A                                                                         -
     A                                                '
     A                                 17 33'RQ'
     A                                 17 42'Min.'
     A                                 17 47'Req.'
     A                                 18 33'MR       Maint. Rep.'
     A                                 19 33'DR       Drawing'
     A          R STROPT1
     A*%%TS  SD  20030710  111639  A257947     REL-V5R2M0  5722-WDS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 19'S T O R E R O O M   U S E R   O P -
     A                                      T I O N S'
     A                                      DSPATR(HI)
     A                                  2 72'STROPT1'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A            A1             1A  B  5  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21
     AO 97 96                               DSPATR(PC)
     A                                  5  6'(Y/N)'
     A                                  5 13'Should bin physical quantities be -
     A                                      shown when physical inventory'
     A                                  6 13'worksheets are prepared?'
     A            C1             1A  B  8  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A                                  8  6'(Y/N)'
     A                                  8 13'Should user passwords (personnel v-
     A                                      erification) be required for'
     A                                  9 13'remote worksheets?'
     A            D1             1A  B 11  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A                                 11  6'(Y/N)'
     A                                 11 13'Should employee ID always be valid-
     A                                      ated on remote worksheets,'
     A                                 12 13'even if no workorder?'
     A            E1             1A  B 14  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A                                 14  6'(Y/N)'
     A                                 14 13'Should employee ID always be valid-
     A                                      ated on storeroom issues, even'
     A                                 15 13'if no workorder?'
     A            G1             1A  B 17  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A                                 17  6'(Y/N)'
     A                                 17 13'Should return with value on raw ma-
     A                                      terials be allowed?'
     A            ST5            1A  B 19  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A                                 19  6'(Y/N)'
     A                                 19 13'Should ST5 be shown on the STR Sto-
     A                                      res Master Menu?'
     A            SR             1A  B 21  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A                                 21  6'(Y/N)'
     A                                 21 13'Should different users be required-
     A                                       to receive (RD) and store (SR)'
     A                                 22 13'material?'
     A            COMMANDLN1    79A  B 24  1DFTVAL('  ENTER-NEXT PAGE   F3-EXIT-
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R STROPT2
     A*%%TS  SD  19951010  144215  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 72'STROPT2'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  5  6'(Y/N)'
     A                                  5 13'Should direct charge department fr-
     A                                      om MP1 be used to override'
     A                                  6 13'stores withdrawal data?'
     A                                  8  6'(Y/N)'
     A                                  8 13'Does WO expense class override the-
     A                                       entered expense class on'
     A                                  9 13'stores withdrawals?'
     A                                 11  6'(Y/N)'
     A                                 11 13'Does WO expense class override the-
     A                                       default expense class from'
     A                                 12 13'MP1 for stores withdrawals?'
     A                                 14  6'(Y/N)'
     A                                 14 13'Does entered expense class overrid-
     A                                      e the default expense class'
     A                                 15 13'from MP1 for stores withdrawals?'
     A                                 17  6'(Y/N)'
     A                                 17 13'Should upper unit limit be used fo-
     A                                      r storeroom returns?'
     A                                 18 13'If yes, enter the upper unit limit-
     A                                       for storeroom return:'
     A                                 20  6'(Y/N)'
     A                                 20 13'Should upper monetary value limit -
     A                                      be used for storeroom returns?'
     A                                 21 13'If yes, enter the upper monetary v-
     A                                      alue limit for storeroom'
     A                                 22 13'return:'
     A            A              1A  B  5  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A            B              1A  B  8  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A            C              1A  B 11  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A            D              1A  B 14  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A            E              1A  B 17  3DSPATR(UL)
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            F              4Y 0B 18 71DSPATR(UL)
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(3)
     A            G              1A  B 20  3DSPATR(UL)
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A            H              8Y 0B 22 22DSPATR(UL)
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A                                      EDTCDE(3)
     A            COMMANDLN1    79A  B 24  1DFTVAL('  ENTER-NEXT PAGE   F3-EXIT-
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A                                  2 25'STOREROOM USER OPTIONS -- PAGE 2'
     A                                      DSPATR(HI)
     A          R STRPRT
     A*%%TS  SD  19951010  153140  A257947     REL-V3R1M0  5763-PW1
     A                                      TEXT('STOREROOM PRINT OPTIONS')
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 18'S T O R E R O O M   P R I N T   O -
     A                                      P T I O N S'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 73'STRPRT'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  5  6'(Y/N)'
     A                                  5 13'Print single issue storeroom withd-
     A                                      rawals?'
     A                                  7 13'Number of pages to advance after a-
     A                                       single issue printout.'
     A                                  7  6'(0-9)'
     A                                  9  6'(Y/N)'
     A                                  9 13'Print multiple issue storeroom wit-
     A                                      hdrawals?'
     A                                 11  6'(0-9)'
     A                                 11 13'Maximum number of storeroom items -
     A                                      to allow on a page.'
     A                                 13  6'(0-9)'
     A                                 13 13'Number of pages to advance after a-
     A                                       worksheet with <= maximum items.'
     A                                 15  6'(0-9)'
     A                                 15 13'Number of pages to advance after a-
     A                                       worksheet with > maximum items.'
     A            PRTSNGL        1A  B  5  3DSPATR(UL)
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A            PGADV          1Y 0B  7  3DSPATR(UL)
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            PRTMULT        1A  B  9  3DSPATR(UL)
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A            NUMITEM        1Y 0B 11  3DSPATR(UL)
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            PGAVDLE        1Y 0B 13  3DSPATR(UL)
     A                                      OVRATR
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A            PGAVDGT        1Y 0B 15  3DSPATR(UL)
     A                                      OVRATR
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A            MESSAGELI1    79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('  F3-EXIT                  -
     A                                                                         -
     A                                                       ')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A          R STROPT3
     A*%%TS  SD  19970812  141747  A193138     REL-V3R7M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 25'STOREROOM USER OPTIONS -- PAGE 3'
     A                                      DSPATR(HI)
     A                                  2 72'STROPT3'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A            R              1A  B  5  3DSPATR(UL)
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A                                  5  6'(Y/N)'
     A                                  5 13'Are raw material batch withdrawals-
     A                                       from ASPICS enabled?  If so,'
     A                                  6 13'enter the charge data for raw batc-
     A                                      h withdrawal transactions:'
     A                                  7 21'Charge Dept'
     A                                  7 37'Req Dept'
     A                                  7 50'Exp Class'
     A            CHRG           6A  B  8 23DSPATR(UL)
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            REQ            4A  B  8 39DSPATR(UL)
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            EXP            6Y 0B  8 52DSPATR(UL)
     A                                      OVRATR
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A                                 10 13'Note:  If you leave Charge Dept or-
     A                                       Exp Class blank, the default'
     A                                 11 13'of the raw material code (from MP1-
     A                                      ) will be used in automatic'
     A                                 12 13'raw batch withdrawals.'
     A            Q              1A  B 14  3DSPATR(UL)
     A                                      OVRDTA
     A            EXTSYS         1A  B 17  3DSPATR(UL)
     A                                      OVRDTA
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A            EXTSYSAUTO     1A  B 19  3DSPATR(UL)
     A                                      OVRDTA
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A                                 14  6'(Y/N)'
     A                                 14 13'If storeroom Exp Class (from MP1) -
     A                                      is not blank, override above'
     A                                 15 13'Exp Class?'
     A            MESSAGELI1    79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1DFT('  ENTER-SAVE   F3-EXIT')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A                                 17  6'(Y/N)'
     A                                 17 13'Do storeroom receipts interface wi-
     A                                      th an external system?'
     A                                 19  6'(Y/N)'
     A                                 19 13'If storeroom receipts interface wi-
     A                                      th an external system,'
     A                                 20 13'are ALL materials received automat-
     A                                      ically stored?'
     A          R DOCKINFO
     A*%%TS  SD  19951013  095842  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  3DATE
     A                                      EDTCDE(Y)
     A                                  1 25'D O C K   I N F O R M A T I O N'
     A                                      DSPATR(HI)
     A                                  1 71'DOCKINFO'
     A                                  2  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  3  4'Overshipment values for dock recei-
     A                                      pts:'
     A                                  4 27'Coded:'
     A            X1             2Y 0B  4 35DSPATR(UL)
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                  4 38'%'
     A                                  4 41'(Kelly plants will always be 10%)'
     A                                  5 24'Noncoded:'
     A            X2             2A  B  5 35DSPATR(UL)
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                  5 38'%'
     A                                  5 41'(For raw materials)'
     A                                  6 13'Coded Raw Materials:'
     A            X3             2Y 0B  6 35DSPATR(UL)
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                  6 38'%'
     A                                  8  4'Raw materials major group designat-
     A                                      ors:     (Not applicable to Kelly p-
     A                                      lants)'
     A                                  9  4'Enter first two digits of major gr-
     A                                      oup that will designate raw materia-
     A                                      ls.'
     A            G1             2Y 0B 10 26DSPATR(UL)
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            G2             2Y 0B 10 30DSPATR(UL)
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            G3             2Y 0B 10 34DSPATR(UL)
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            G4             2Y 0B 10 38DSPATR(UL)
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            G5             2Y 0B 10 42DSPATR(UL)
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            G6             2Y 0B 10 46DSPATR(UL)
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A                                 12  4'Enter "Y" beside each raw material-
     A                                       group that should be automatically'
     A                                 13  4'stored when received (applicable t-
     A                                      o groups 26, 27, 28 and 29 only).'
     A                                 14 21'26'
     A            A              1A  B 14 25DSPATR(UL)
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                 14 31'27'
     A            B              1A  B 14 35DSPATR(UL)
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A                                 14 41'28'
     A            C              1A  B 14 45DSPATR(UL)
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A                                 14 50'29'
     A            D              1A  B 14 54DSPATR(UL)
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            Q              1A  B 16  4DSPATR(UL)
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                 16  7'(Y/N)'
     A                                 16 14'Require tally number for natural r-
     A                                      ubber receipts?  If yes, force'
     A                                 17 14'tally entry for class:'
     A            CLS            3Y 0B 17 38DSPATR(UL)
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A                                 19  4'Batch Dock:  (Kelly plants only)'
     A            BCHLOCK        1A  B 20  4DSPATR(UL)
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                 20  7'(Y/N)'
     A                                 20 14'Lock online dock receipts and corr-
     A                                      ections?'
     A            BCHPRINT       1A  B 21  4DSPATR(UL)
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                 21  7'(Y/N)'
     A                                 21 14'Print report of batch dock receipt-
     A                                      s?'
     A            MSGLINE       79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1DFTVAL('  F3-EXIT')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A          R INV1
     A*%%TS  SD  20040601  153919  A257947     REL-V5R2M0  5722-WDS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 19'I N V O I C I N G   U S E R   O P -
     A                                      T I O N S'
     A                                      DSPATR(HI)
     A                                  2 75'INV1'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A            D3             1A  B  5  3DSPATR(UL)
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                  5  6'(Y/N)'
     A                                  5 13'For invoicing users:  Should prepa-
     A                                      ys be allowed on AP1?'
     A            I3             1A  B  7  3DSPATR(UL)
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A                                      VALUES('B' 'A')
     A                                  7  6'(B/A)'
     A                                  7 13'Should tax be calculated on total -
     A                                      invoice amount before or after'
     A                                  8 13'discount?'
     A            E3             1A  B 10  3DSPATR(UL)
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                 10  6'(Y/N)'
     A                                 10 13'Is automatic generation of invoice-
     A                                      s (invoiceless) to be performed?'
     A            J3             1A  B 12  3DSPATR(UL)
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A                                      RANGE('0' '7')
     A                                 12  6'(0-7)'
     A                                 12 13'How many days after receipt of mat-
     A                                      erial should automatic invoice'
     A                                 13 13'generation occur?  Note:  Invoice -
     A                                      date will be date of receipt.'
     A            AP9            1A  B 15  3DSPATR(UL)
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                 15  6'(Y/N)'
     A                                 15 13'Are updates allowed on the AP9 scr-
     A                                      een?'
     A                                 17 13'For invoice difference report, sho-
     A                                      w invoices that are:'
     A            PCTABOVE       2Y 0B 18 13DSPATR(UL)
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A                                      RANGE(0 99)
     A                                      EDTCDE(Z)
     A                                 18 16'% above PO price'
     A                                 18 34'-OR-'
     A            DLRSABOVE      4Y 0B 18 40DSPATR(UL)
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A                                      RANGE(0 9999)
     A                                      EDTCDE(Z)
     A                                 18 45'dollars above PO price'
     A            MSGLINE       79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1DFTVAL('  ENTER-SAVE   F3-EXIT')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A          R CSASOPT1
     A*%%TS  SD  19951020  130203  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  7  8'(Y/N)'
     A                                  9  8'(Y/N)'
     A                                  2 24'C S A S   U S E R   O P T I O N S'
     A                                      DSPATR(HI)
     A                                  2 71'CSASOPT1'
     A                                  7 15'Is CSAS being utilized for this pl-
     A                                      ant?'
     A                                  9 15'Should plant be allowed to change -
     A                                      average cost on the MP1'
     A                                 10 15'transaction?'
     A                                 12 15'How many shifts are in one day?'
     A                                 12  8'(2-3)'
     A                                  5  3'Input data below and press the Ent-
     A                                      er key:'
     A            A1             1A  B  7  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21
     AO 97 96                               DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A            C1             1A  B  9  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A            D1             1A  B 12  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A                                      VALUES('2' '3')
     A            COMMANDLN1    79A  B 24  1DFTVAL('  ENTER-SAVE   F3-EXIT     -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R PUROPT1
     A*%%TS  SD  19951020  130203  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 18'P U R C H A S I N G   U S E R   O -
     A                                      P T I O N S'
     A                                      DSPATR(HI)
     A                                  2 72'PUROPT1'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A            A3             1A  B  5  3DSPATR(UL)
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                  5  6'(Y/N)'
     A                                  5 13'Should buyer and typist be carried-
     A                                       over from PO to PO during'
     A                                  6 13'PO entry on PU1-3?'
     A            B3             1A  B  8  3DSPATR(UL)
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A                                      VALUES('L' 'R')
     A                                  8  6'(L/R)'
     A                                  8 13'Should seller address appear on th-
     A                                      e left or right side of the'
     A                                  9 13'PO printout?'
     A            C3             1A  B 11  3DSPATR(UL)
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                 11  6'(Y/N)'
     A                                 11 13'Should currency code be required d-
     A                                      uring PO entry on PU1-1?'
     A            D3             1A  B 13  3DSPATR(UL)
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                 13  6'(Y/N)'
     A                                 13 13'Should materials control be able t-
     A                                      o cancel remaining onorder for'
     A                                 14 13'all types of POs, not only ITs?'
     A            E3             1A  B 16  3DSPATR(UL)
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                 16  6'(Y/N)'
     A                                 16 13'Should a cost comparison be perfor-
     A                                      med between market cost and PO'
     A                                 17 13'cost during PO entry?  If yes, ent-
     A                                      er the percentage variance to'
     A                                 18 13'be flagged during PO entry:'
     A            F3             3Y 0B 18 42DSPATR(UL)
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A                                      RANGE(0 999)
     A                                      EDTCDE(Z)
     A                                 18 46'%'
     A            G3             1A  B 20  3DSPATR(UL)
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                 20  6'(Y/N)'
     A                                 20 13'Should all manufacturers, not just-
     A                                       selected ones, be shown on'
     A                                 21 13'requisitions?'
     A            COMMANDLN1    79   O 24  1
     A  98                                  OVRDTA
     A                                      DFTVAL('  ENTER-NEXT PAGE   F3-EXIT-
     A                                      ')
     A  99        MESSAGELIN    79   M      OVRDTA
     A          R PUROPT2
     A*%%TS  SD  19970402  084554  A257947     REL-V3R7M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 24'PURCHASING USER OPTIONS -- PAGE 2'
     A                                      DSPATR(HI)
     A                                  2 72'PUROPT2'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A            VER            1A  B  5  3DSPATR(UL)
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                  5  6'(Y/N)'
     A                                  5 13'Should additional data always be v-
     A                                      erified on POs and REQs?'
     A            DBQUES         1A  B  7  3DSPATR(UL)
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                  7  6'(Y/N)'
     A                                  7 13'Should completed POs remain in liv-
     A                                      e database until new work is'
     A                                  8 13'deleted?'
     A            COPRIME        1A  B 10  3DSPATR(UL)
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                 10  6'(Y/N)'
     A                                 10 13'Should company and prime be entere-
     A                                      d for purchase order items?'
     A            CHAT           1A  B 12  3DSPATR(UL)
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                 12  6'(Y/N)'
     A                                 12 13'Should CHAT reference numbers be r-
     A                                      equired at PO creation?'
     A            SHIPREL        2D  B 14  3DSPATR(UL)
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A                                      RANGE('01' '12')
     A                                 14  6'(1-12)'
     A                                 14 13'How many months should shipping re-
     A                                      lease audit records be kept?'
     A                                 16  3'If a vendor code is to be substitu-
     A                                      ted for LOADPO, enter it:'
     A            LOADPO        10A  B 16 64DSPATR(UL)
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A                                 18  3'Enter ordering costs (used to calc-
     A                                      ulate EOQ):'
     A            OC             6A  B 18 50DSPATR(UL)
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                      RANGE('000000' '999999')
     A            POPRINT        1A  B 20  3DSPATR(UL)
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                 20  6'(Y/N)'
     A                                 20 13'Use special character print on pur-
     A                                      chase order printouts?'
     A            POERR          1A  B 22  3DSPATR(UL)
     A                                      OVRATR
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                 22  6'(Y/N)'
     A                                 22 13'Write errors from BXLOADPO job to -
     A                                      hold file for re-processing (ATM)?'
     A            COMMANDLN1    79A  O 24  1DFTVAL('  ENTER-SAVE   F3-EXIT')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A          R PUROPT3
     A*%%TS  SD  20031001  161759  A257947     REL-V5R2M0  5722-WDS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 24'PURCHASING USER OPTIONS -- PAGE 3'
     A                                      DSPATR(HI)
     A                                  2 72'PUROPT3'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A            RELOPT         1A  B  5  3DSPATR(UL)
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                  5  6'(Y/N)'
     A                                  5 13'Should the PS2 function verify tha-
     A                                      t the shipping releases'
     A                                  6 13'processed meet the minimum order v-
     A                                      alue for the vendor?'
     A            NUMDAYS        2D  B  8  3DSPATR(UL)
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A                                  8 13'If Yes, how many days should a rel-
     A                                      ease remain in the batch'
     A                                  9 13'file before an error message is pr-
     A                                      inted?'
     A                                 11  3'Type the ISO procedure number whic-
     A                                      h is to appear on the On-Time Deliv-
     A                                      ery'
     A                                 12  3'Tracking report:'
     A            PROCNUM       15A  B 12 21DSPATR(UL)
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            DELETESW       1A  B 14  3DSPATR(UL)
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                 14  6'(Y/N)'
     A                                 14 13'Allow the delete of the last PO it-
     A                                      em from the item delete screen?'
     A            COMMANDLN1    79A  O 24  1DFTVAL('  ENTER-SAVE   F3-EXIT')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A          R RCVOPT1
     A*%%TS  SD  19961108  113427  A257947     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 19'R E C E I V I N G   U S E R   O P -
     A                                      T I O N S'
     A                                      DSPATR(HI)
     A                                  2 72'RCVOPT1'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A            CAPITEM        1A  B  5  3DSPATR(UL)
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                  5  6'(Y/N)'
     A                                  5 13'Should capital item receipts (addi-
     A                                      tional data greater than 10,000)'
     A                                  6 13'print on an additional printer?  I-
     A                                      f yes, enter the spooler number'
     A                                  7 13'of the additional printer:'
     A            SPOOL          2Y 0B  7 41DSPATR(UL)
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            RS326          1A  B  9  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                  9  6'(Y/N)'
     A                                  9 13'Should a receiving slip T/C 326 be-
     A                                       generated for each receiving'
     A                                 10 13'slip item?'
     A            CHAT           1A  B 12  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                 12  6'(Y/N)'
     A                                 12 13'Should CHAT reference numbers be r-
     A                                      equired at purchase order'
     A                                 13 13'creation?'
     A                                 15  6'(Y/N)'
     A                                 15 13'Should receiving slips use special-
     A                                       print (compressed, etc.)?'
     A            SPECPRNT       1A  B 15  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A            COMMANDLN1    79A  B 24  1DFTVAL('  ENTER-SAVE   F3-EXIT     -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R CSISOPT1
     A*%%TS  SD  19951024  142706  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 24'C S I S   U S E R   O P T I O N S'
     A                                      DSPATR(HI)
     A                                  2 71'CSISOPT1'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  5 32'Spooler'
     A                                  6 32'Number'
     A                                      DSPATR(UL)
     A                                  8 20'PO Printer:'
     A            P1             2Y 0B  8 34DSPATR(UL)
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A                                  8 39'PO Printer --> MPE Spooled (Y/N)?:'
     A            S              1A  B  8 75DSPATR(UL)
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                  9 19'REQ Printer:'
     A            P2             2Y 0B  9 34DSPATR(UL)
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A                                  9 50'--> HP Printer  (Y/N)?:'
     A            P              1A  B  9 75DSPATR(UL)
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                 10  9'Storeroom REQ Printer:'
     A            P2A            2Y 0B 10 34DSPATR(UL)
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A                                 11 14'Quote Printer #1:'
     A            P3             2Y 0B 11 34DSPATR(UL)
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A                                 11 39'(character printer)'
     A                                 12 14'Quote Printer #2:'
     A            P3A            2Y 0B 12 34DSPATR(UL)
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A                                 12 39'(character printer)'
     A                                 13 14'Quote Printer #3:'
     A            P3B            2Y 0B 13 34DSPATR(UL)
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A                                 13 39'(line printer)'
     A                                 14  7'Internal Order Printers:'
     A            P4             2Y 0B 14 34DSPATR(UL)
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            P5             2Y 0B 15 34DSPATR(UL)
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A                                 16 13'Storeroom Printer:'
     A            P6             2Y 0B 16 34DSPATR(UL)
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A                                 17 10'Raw Material Printer:'
     A            P7             2Y 0B 17 34DSPATR(UL)
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                 14 39'("00" if not used)'
     A                                 18  6'Shipping Release Printer:'
     A            P8             2Y 0B 18 34DSPATR(UL)
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A                                 19 12'Special PO Printer:'
     A            P9             2Y 0B 19 34DSPATR(UL)
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A                                 19 39'PO monetary amount:'
     A            PDOLLR         6A  B 19 60DSPATR(UL)
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            MESSAGELI1    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79   O 24  1
     A  98                                  OVRDTA
     A                                      DFTVAL('  ENTER-NEXT PAGE   F3-EXIT-
     A                                      ')
     A  99        MESSAGELIN    79   M      OVRDTA
     A          R CSISOPT2
     A*%%TS  SD  19961115  085401  A257947     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 27'CSIS USER OPTIONS -- PAGE 2'
     A                                      DSPATR(HI)
     A                                  2 71'CSISOPT2'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A            Q              1A  B  5  3DSPATR(UL)
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                  5  6'(Y/N)'
     A                                  5 13'Should the requisition releases be-
     A                                       printed?'
     A            X              1A  B  7  3DSPATR(UL)
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A                                      VALUES('L' 'P' ' ')
     A                                  7  6'(L/P)'
     A                                  7 13'If yes, should the releases print -
     A                                      on a local or PO printer?'
     A                                  8 15'(L = Local Printer   P = PO Printe-
     A                                      r)'
     A            Z              1A  B 10  3DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                 10  6'(Y/N)'
     A                                 10 13'Should regular print be used on al-
     A                                      l reports (no ASCII print'
     A                                 11 13'characters)?'
     A            MESSAGELI1    79A  B 23  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1
     A  98                                  OVRDTA
     A                                      DFTVAL('  ENTER-SAVE   F3-EXIT')
     A  99        MESSAGELIN    79   M      OVRDTA
     A          R SETOPT1
     A*%%TS  SD  19951025  085314  A257947     REL-V3R1M0  5763-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 21'G E N E R A L   U S E R   O P T I -
     A                                      O N S'
     A                                      DSPATR(HI)
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 72'SETOPT1'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  4  3'Input data below and press Enter:'
     A                                  6  6'(Y/N)'
     A                                  6 13'Should batch corporate code delete-
     A                                      s through Akron update be'
     A                                  7 13'allowed?'
     A                                  9  6'(Y/N)'
     A                                  9 13'Are TC999 (onhand inventory for co-
     A                                      des with current day activity)'
     A                                 10 13'transactions to be created through-
     A                                       job BCUTOFF?'
     A            N              1A  B  6  3DSPATR(UL)
     A                                      OVRATR
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            C              1A  B  9  3DSPATR(UL)
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A            COMMANDLN1    79A  O 24  1DFTVAL('  ENTER-SAVE   F3-EXIT')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A          R MATLC1
     A*%%TS  SD  19961115  095205  A257947     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 73'MATLC1'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A            AV             1A  B  5  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                  5  6'(Y/N)'
     A                                  5 13'Should plant be allowed to change -
     A                                      average cost on the MP1'
     A                                  6 13'transaction?'
     A                                  8  3'Ordering costs:'
     A            OC             6A  B  8 20DSPATR(UL)
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                      RANGE('000000' '999999')
     A                                  8 29'(Used to calculate EOQ)'
     A                                 10  3'Carrying costs:'
     A            CC             2Y 0B 10 20DSPATR(UL)
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                      RANGE(0 99)
     A                                 10 23'%'
     A                                 10 29'(As a percentage of unit cost)'
     A            MSGLINE       79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1DFTVAL('  ENTER-SAVE   F3-EXIT')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A                                  2 16'M A T E R I A L S   C O N T R O L -
     A                                        O P T I O N S'
     A                                      DSPATR(HI)
     A          R REQ1
     A*%%TS  SD  19980106  153446  A257947     REL-V3R7M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 19'R E Q U I S I T I O N   U S E R   -
     A                                      O P T I O N S'
     A                                      DSPATR(HI)
     A                                  2 75'REQ1'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A            D3             1A  B  5  3DSPATR(UL)
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                  5  6'(Y/N)'
     A                                  5 13'Should the currency code be displa-
     A                                      yed on the requisition create'
     A                                  6 13'and approval screens?'
     A            D4             1A  B  8  3DSPATR(UL)
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                  8  6'(Y/N)'
     A                                  8 13'Load default values in accounting -
     A                                      fields when creating non-stores'
     A                                  9 13'requisitions?'
     A            D5             1A  B 11  3DSPATR(UL)
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                 11  6'(Y/N)'
     A                                 11 13'Carry direct charge dept/expense c-
     A                                      lass from MP1 when creating coded'
     A                                 12 13'requisitions?'
     A            REQUSERID      1A  B 14  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                 14  6'(Y/N)  Require userid on requisiti-
     A                                      on create to notify at dock receipt-
     A                                      ?'
     A            REQDELT        1A  B 16  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                 16  6'(Y/N)  Delete requisitions returne-
     A                                      d to originator?'
     A            REQMNTH        2Y 0B 17 31DSPATR(UL)
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A                                 17 13'Delete reqs after'
     A                                 17 34'months.'
     A                                 19  6'(Y/N)  Are requisitions to be pass-
     A                                      ed on to Synergy R/3?              -
     A                                       '
     A            SYNREQ         1A  B 19  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A            MSGLINE       79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1DFTVAL('  ENTER-SAVE   F3-EXIT')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A          R REQ2
     A*%%TS  SD  20020612  112855  A257947     REL-V5R1M0  5722-WDS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 19'R E Q U I S I T I O N   U S E R   -
     A                                      O P T I O N S'
     A                                      DSPATR(HI)
     A                                  2 75'REQ1'
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A            D3             1A  B  5  3DSPATR(UL)
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                  5  6'(Y/N)'
     A                                  5 13'Should final approver be used inst-
     A                                      ead of first approver on '
     A                                  6 13'checkbook calculations?'
     A            D4             1A  B  8  3DSPATR(UL)
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                  8  6'(Y/N)'
     A                                  8 13'Should plant be allowed to overrid-
     A                                      e expense class for     '
     A                                  9 13'authorization-flagged storeroom re-
     A                                      qs?'
     A                                 10 13'Use Expense Class'
     A            EXP            6A  B 10 31DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            E3             1A  B 12  3DSPATR(UL)
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A                                      VALUES('Y' 'N')
     A                                 12  6'(Y/N)'
     A                                 12 13'Should a cost comparison be perfor-
     A                                      med between requisition'
     A                                 13 13'budget amount and PO cost during P-
     A                                      O entry for M-reqs?  If yes,'
     A                                 14 13'enter the percentage variance to b-
     A                                      e flagged during PO entry:'
     A            F3             3Y 0B 15 13DSPATR(UL)
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A                                      RANGE(0 999)
     A                                      EDTCDE(Z)
     A                                 15 17'%'
     A            MSGLINE       79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1DFTVAL('  ENTER-SAVE   F3-EXIT')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
     A*         R STRMDEPT
     A          R STRCFRAN
     A*%%TS  SD  19970414  144539  A193138     REL-V3R7M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3DATE
     A                                      EDTCDE(Y)
     A                                  2 71'STRCFRAN'
     A                                  2 20'S T O R E R O O M   F R A N C H I -
     A                                      S E R S'
     A                                      DSPATR(HI)
     A                                  3  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  7 12'Franchise ID'
     A                                  7 31'Franchise Name'
     A                                  7 52'Vendor Code'
     A            ID01           1   B  9 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            NAME01         4   B  9 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            CODE01        10   B  9 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            ID02           1   B 10 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            NAME02         4   B 10 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            CODE02        10   B 10 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            ID03           1   B 11 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            NAME03         4   B 11 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            CODE03        10   B 11 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            ID04           1   B 12 17DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            NAME04         4   B 12 36DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            CODE04        10   B 12 52DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            MESSAGELI1    79A  B 22  1DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  O 24  1DFTVAL('  F3-EXIT')
     A  98                                  OVRDTA
     A  99        MESSAGELIN    79   M      OVRDTA
