     A*            22:36:31    T881S28     VSTRMBAL.HPTO38.CME
     A                                      DSPSIZ(24 80 *DS3)
     A                                      INDARA
     A                                      PRINT
     A                                      CHGINPDFT
     A          R STRMBAL1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 12'-----------------------------------
     A                                      -------------------'
     A                                  1 73'SR20-1'
     A                                  2 12':    CORPORATE STORES ACCOUNTING S-
     A                                      YSTEM - (CSAS)    :'
     A                                  3 12':      MONTH END BALANCE DOLLAR WR-
     A                                      ITEOFF (SR20)     :'
     A                                  4 12'-----------------------------------
     A                                      -------------------'
     A                                  6  2'THIS SCREEN WILL LAUNCH A JOB THAT'
     A                                  6 37'WILL PERFORM THE MONTH END BALANCE'
     A                                  7  2'DOLLAR WRITEOFF PROCEDURE.  THIS P-
     A                                      ROCEDURE FINDS ALL ITEMS WITH A DOL-
     A                                      LAR'
     A                                  8  2'BALANCE BUT NO UNITS AND WRITES OF-
     A                                      F THE AMOUNT.  YOU SHOULD LAUNCH TH-
     A                                      IS'
     A                                  9  2'PROCEDURE AFTER AVERAGE COST (SR11-
     A                                      ) IS DONE BUT BEFORE THE LIFO REPOR-
     A                                      T (SR13)'
     A                                 11  1'DATE AND TIME OF LATEST CSIS TRANS-
     A                                      ACTION PROCESSED'
     A                                 13  1'LAST ACCOUNTS PAYABLE MANIFEST PRO-
     A                                      CESSED BY CSAS'
     A                                 15  1'DATE OF CURRENT MONTH END CUTOFF F-
     A                                      OR CSAS'
     A                                 17  1'AVERAGE COST FOR RAW MATERIALS (SR-
     A                                      11) PROCESSING IS......'
     A                                 18  1'MONTH END BALANCE DOLLARS WRITEOFF'
     A                                 18 36'(SR20) PROCESSING IS..'
     A                                 19  1'RAW MATERIAL LIFO REPORT (SR13) PR-
     A                                      OCESSING IS............'
     A                                 21  1'PRESS: "f1" TO PROCEED WITH THE BA-
     A                                      LANCE DOLLAR WRITEOFF'
     A                                 22  8'"f3" TO EXIT THE SCREEN, NO JOB LA-
     A                                      UNCHED (NO PROCESSING DONE)'
     A            CCC            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            DATE1          8A  B 11 56DSPATR(PR)
     A                                      OVRDTA
     A            TIME1          8A  B 11 67DSPATR(PR)
     A                                      OVRDTA
     A            MN1            3A  B 13 56DSPATR(PR)
     A                                      OVRDTA
     A            DATE2          8A  B 15 56DSPATR(PR)
     A                                      OVRDTA
     A            COMPMSG       15A  B 17 60DSPATR(PR)
     A                                      OVRDTA
     A            COMPMSG2      15A  B 18 60DSPATR(PR)
     A                                      OVRDTA
     A            COMPMSG3      15A  B 19 60DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-BALANCE WRITEOFF f3-EXIT-
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
