     A*%%TS  SD  19930630  150101  T001575     REL-V2R2M0  5738-PW1
     A*            22:36:00    T881S28     VSTRMAVG.HPTO38.CME
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A          R STRMAVG1
     A*%%TS  SD  19930630  150101  T001575     REL-V2R2M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 11'-----------------------------------
     A                                      -----------------------      SAR11--
     A                                      1'
     A                                  2 11':      CORPORATE STORES ACCOUNTING'
     A                                  2 46'SYSTEM - (CSAS)      :'
     A                                  3 11':    CALCULATE AVERAGE COST FOR RA-
     A                                      W MATERIALS (SR11)    :'
     A                                  4 11'-----------------------------------
     A                                      -----------------------'
     A                                  6  4'THIS SCREEN WILL LAUNCH A JOB THAT'
     A                                  6 39'WILL CALCULATE A NEW AVERAGE COST'
     A                                  6 73'FOR'
     A                                  7  4'RAW MATERIALS (PROCESS ITEMS).  TH-
     A                                      IS PROCEDURE IS PART OF THE MONTH'
     A                                  7 72'END'
     A                                  8  4'CLOSING PROCEDURE.  BEFORE LAUNCHI-
     A                                      NG THIS JOB BE SURE YOU HAVE PROCES-
     A                                      SED'
     A                                  9  4'ALL CSIS TRANSACTIONS AND ACCOUNTS'
     A                                  9 39'PAYABLE MANIFESTS FOR THE MONTH.'
     A                                 11  2'DATE AND TIME OF LATEST CSIS TRANS-
     A                                      ACTION PROCESSED'
     A            CCC            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            DATE1          8A  B 11 56DSPATR(PR)
     A                                      OVRDTA
     A            TIME1          8A  B 11 67DSPATR(PR)
     A                                      OVRDTA
     A                                 13  2'LAST ACCOUNTS PAYABLE MANIFEST PRO-
     A                                      CESSED BY CSAS'
     A            MN1            3A  B 13 56DSPATR(PR)
     A                                      OVRDTA
     A                                 15  2'DATE OF MONTH END CUTOFF FOR CSAS'
     A            DATE2          8A  B 15 56DSPATR(PR)
     A                                      OVRDTA
     A                                 17  2'STATUS OF LATEST A/P MANIFEST PROC-
     A                                      ESSED BY CSIS'
     A            MN2            3A  B 17 56DSPATR(PR)
     A                                      OVRDTA
     A                                 17 62'STATUS:'
     A            STAT           4A  B 17 70DSPATR(PR)
     A                                      OVRDTA
     A            FRTMSG        49   B 19  2DSPATR(PR)
     A                                      OVRDTA
     A            DATE3          8   B 19 56DSPATR(PR)
     A                                      OVRDTA
     A            TIME3          8   B 19 67DSPATR(PR)
     A                                      OVRDTA
     A                                 21  1'PRESS: "f1" TO LAUNCH THE JOB TO C-
     A                                      ALCULATE AVERAGE COST FOR RAW MATER-
     A                                      IALS'
     A                                 22  8'"f3" TO EXIT THE SCREEN, NO JOB LA-
     A                                      UNCHED (NO PROCESSING DONE)'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-CALC. AVG COST f3-EXIT  -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
