     A*****************************************************************
     A**                D I S P L A Y   F I L E
     A*****************************************************************
     A** FILE NAME  :  ZSVENHELP
     A**
     A** DESCRIPTION:  VENDOR HELP FOR PURCHASING
     A**
     A** AUTHOR     :  DAN RAUCH - EXLTECH, LLC
     A** CREATED    :  MAR 9, 2005
     A**
     A** FORMATS    :  INQVEN
     A**
     A*****************************************************************
     A** COPIED FROM ZCSISINQ
     A*****************************************************************
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A          R INQVEND
     A                                      PUTOVR
     A                                      CF03
     A                                      CF07
     A            TITLE         35A  B  1 21DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTIO    75A  B  3  1DSPATR(PR)
     A                                      OVRDTA
     A                                  4  1'CODE:'
     A            VENDORCOD     10A  B  4 11DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A                                  5  1'NAME:'
     A            NAME          44A  B  5 11DSPATR(PR)
     A                                      OVRDTA
     A                                  6  1'ADDRESS:'
     A            ADDRESS       44A  B  6 11DSPATR(PR)
     A                                      OVRDTA
     A            ADD2          44A  B  7 11DSPATR(PR)
     A                                      OVRDTA
     A            ADD3          44A  B  8 11DSPATR(PR)
     A                                      OVRDTA
     A            ADD4          44A  B  9 11DSPATR(PR)
     A                                      OVRDTA
     A                                  8 65'"X" MEANS THAT'
     A            ADD5          44A  B 10 11DSPATR(PR)
     A                                      OVRDTA
     A                                  9 65'ZIP/POSTAL CODE'
     A            ADD6          44A  B 11 11DSPATR(PR)
     A                                      OVRDTA
     A                                 10 65'WILL BE PRINTED'
     A                                 11 65'BEFORE CITY'
     A                                 12  1'CITY:'
     A            CITY          24A  B 12 11DSPATR(PR)
     A                                      OVRDTA
     A                                 12 36'STATE:'
     A            ST             2A  B 12 44DSPATR(PR)
     A                                      OVRDTA
     A                                 12 48'ZIP:'
     A            ZIPCODE        9A  B 12 54DSPATR(PR)
     A                                      OVRDTA
     A            X              1A  B 12 71DSPATR(PR)
     A                                      OVRDTA
     A                                 13  1'PROVINCE:'
     A            PROV           4A  B 13 11DSPATR(PR)
     A                                      OVRDTA
     A                                 13 17'COUNTRY:'
     A            COUNTRY       18A  B 13 27DSPATR(PR)
     A                                      OVRDTA
     A                                 13 47'CURRENCY CODE:'
     A            CC             2A  B 13 63DSPATR(PR)
     A                                      OVRDTA
     A            CURRENCY      12A  B 13 67DSPATR(PR)
     A                                      OVRDTA
     A                                 14  1'CONTACT:'
     A            CONTACT       34A  B 14 11DSPATR(PR)
     A                                      OVRDTA
     A                                 14 49'FAX:'
     A            FAX           24A  B 14 55DSPATR(PR)
     A                                      OVRDTA
     A                                      CHECK(LC)
     A                                 15  1'NOTE1:'
     A            NOTE1         44A  B 15 11DSPATR(PR)
     A                                      OVRDTA
     A                                 15 61'TELEX:'
     A            TELEX         10A  B 15 69DSPATR(PR)
     A                                      OVRDTA
     A                                 16  1'NOTE2:'
     A            NOTE2         44A  B 16 11DSPATR(PR)
     A                                      OVRDTA
     A                                 16 61'PHONE:'
     A            PHONE         10A  B 16 69DSPATR(PR)
     A                                      OVRDTA
     A                                 17  1'F.O.B.:'
     A            FOB           20A  B 17 10DSPATR(PR)
     A                                      OVRDTA
     A                                 17 33' PAYMENT TERMS:'
     A            TERMS          2A  B 17 50DSPATR(PR)
     A                                      OVRDTA
     A                                 17 56'MINIMUM ORDER:'
     A            MINM           4A  B 17 72DSPATR(PR)
     A                                      OVRDTA
     A                                 18  1'INVOICELESS VENDOR (Y/N):'
     A            INVLESSIND     1A  B 18 27DSPATR(PR)
     A                                      OVRDTA
     A                                 18 36'EDI VENDOR (Y/N):'
     A            E              1A  B 18 54DSPATR(PR)
     A                                      OVRDTA
     A                                 19  1'EDI DOLLAR MAX:'
     A            DOLLM          7A  B 19 17DSPATR(PR)
     A                                      OVRDTA
     A                                 19 36'EDI STANDARD:'
     A            A              1A  B 19 50DSPATR(PR)
     A                                      OVRDTA
     A                                 19 53'(1-EDIFACT  2-ASCX12)'
     A                                 20  1'GOODYEAR CODE:'
     A            GOODYEARCO    17A  B 20 16DSPATR(PR)
     A                                      OVRDTA
     A                                 20 36'TRADING PARTNER ID:'
     A            TRADINGPID    16A  B 20 56DSPATR(PR)
     A                                      OVRDTA
     A                                 21  1'EDI STATUS IND:'
     A            EDISTATIND     1A  B 21 17DSPATR(PR)
     A                                      OVRDTA
     A                                 21 20'(0-NO SEND, 1-SEND AND PRINT, 2-SE-
     A                                      ND ONLY)'
     A                                 22  1'EXCLUDE CODED DESCRIPTION ON RELEA-
     A                                      SES (Y/N):'
     A            EXCODESW       1A  B 22 46DSPATR(PR)
     A                                      OVRDTA
     A                                 23  1'STD. INSTRUCTIONS:'
     A            INSTR1         3A  B 23 20DSPATR(PR)
     A                                      OVRDTA
     A            ITEM1          1A  B 23 24DSPATR(PR)
     A                                      OVRDTA
     A            INSTR2         3A  B 23 27DSPATR(PR)
     A                                      OVRDTA
     A            ITEM2          1A  B 23 31DSPATR(PR)
     A                                      OVRDTA
     A            INSTR3         3A  B 23 34DSPATR(PR)
     A                                      OVRDTA
     A            ITEM3          1A  B 23 38DSPATR(PR)
     A                                      OVRDTA
     A            INSTR4         3A  B 23 41DSPATR(PR)
     A                                      OVRDTA
     A            ITEM4          1A  B 23 45DSPATR(PR)
     A                                      OVRDTA
     A                                 23 48'(B-PRINT BEFORE ITEMS;A-AFTER)'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT f7-CLEAR SCREEN')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
