     A*%%TS  SD  19970128  075949  A193138     REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      CF03(03 'Exit')
     A                                      INDARA
     A          R SELECTION
     A                                      PUTOVR
     A*%%TS  SD  19970124  063146  A193138     REL-V3R7M0  5716-PW1
     A                                  5 27'SELECT CSIS/MMIS DATABASE'
     A                                      DSPATR(HI)
     A                                  8 13'SYSTEM'
     A                                      DSPATR(HI)
     A                                  8 25'DESCRIPTION'
     A                                      DSPATR(HI)
     A            SEL1           1   B  9 10OVRDTA
     A                                      OVRATR
     A N01                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            SYS1          10   B  9 13OVRDTA
     A                                      DSPATR(PR)
     A            DESC1         50   B  9 25OVRDTA
     A                                      DSPATR(PR)
     A            SEL2           1   B 10 10OVRDTA
     A                                      OVRATR
     A N02                                  DSPATR(UL)
     A  02                                  DSPATR(PR)
     A            SYS2          10   B 10 13OVRDTA
     A                                      DSPATR(PR)
     A            DESC2         50   B 10 25OVRDTA
     A                                      DSPATR(PR)
     A            SEL3           1   B 11 10OVRDTA
     A                                      OVRATR
     A N03                                  DSPATR(UL)
     A  03                                  DSPATR(PR)
     A            SYS3          10   B 11 13OVRDTA
     A                                      DSPATR(PR)
     A            DESC3         50   B 11 25OVRDTA
     A                                      DSPATR(PR)
     A            SEL4           1   B 12 10OVRDTA
     A                                      OVRATR
     A N04                                  DSPATR(UL)
     A  04                                  DSPATR(PR)
     A            SYS4          10   B 12 13OVRDTA
     A                                      DSPATR(PR)
     A            DESC4         50   B 12 25OVRDTA
     A                                      DSPATR(PR)
     A            SEL5           1   B 13 10OVRDTA
     A                                      OVRATR
     A N05                                  DSPATR(UL)
     A  05                                  DSPATR(PR)
     A            SYS5          10   B 13 13OVRDTA
     A                                      DSPATR(PR)
     A            DESC5         50   B 13 25OVRDTA
     A                                      DSPATR(PR)
     A            SEL6           1   B 14 10OVRDTA
     A                                      OVRATR
     A N06                                  DSPATR(UL)
     A  06                                  DSPATR(PR)
     A            SYS6          10   B 14 13OVRDTA
     A                                      DSPATR(PR)
     A            DESC6         50   B 14 25OVRDTA
     A                                      DSPATR(PR)
     A            SEL7           1   B 15 10OVRDTA
     A                                      OVRATR
     A N07                                  DSPATR(UL)
     A  07                                  DSPATR(PR)
     A            SYS7          10   B 15 13OVRDTA
     A                                      DSPATR(PR)
     A            DESC7         50   B 15 25OVRDTA
     A                                      DSPATR(PR)
     A            SEL8           1   B 16 10OVRDTA
     A                                      OVRATR
     A N08                                  DSPATR(UL)
     A  08                                  DSPATR(PR)
     A            SYS8          10   B 16 13OVRDTA
     A                                      DSPATR(PR)
     A            DESC8         50   B 16 25OVRDTA
     A                                      DSPATR(PR)
     A            SEL9           1   B 17 10OVRDTA
     A                                      OVRATR
     A N09                                  DSPATR(UL)
     A  09                                  DSPATR(PR)
     A            SYS9          10   B 17 13OVRDTA
     A                                      DSPATR(PR)
     A            DESC9         50   B 17 25OVRDTA
     A                                      DSPATR(PR)
     A            SEL10          1   B 18 10OVRDTA
     A                                      OVRATR
     A N09                                  DSPATR(UL)
     A  09                                  DSPATR(PR)
     A            SYS10         10   B 18 13OVRDTA
     A                                      DSPATR(PR)
     A            DESC10        50   B 18 25OVRDTA
     A                                      DSPATR(PR)
     A                                 23 32'CMD3 TO EXIT'
     A          R STATUS
     A*%%TS  SD  19970128  075949  A193138     REL-V3R7M0  5716-PW1
     A                                      PUTOVR
     A                                  5 27'SELECT CSIS/MMIS SYSTEM'
     A                                      OVRATR
     A                                      DSPATR(HI)
     A                                 10 21'CLOSING FILES FOR SYSTEM'
     A                                      OVRATR
     A  01                                  DSPATR(HI)
     A            CLOSESYS      10   O 10 46
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(HI)
     A                                 12 21'OPENING FILES FOR SYSTEM'
     A                                      OVRATR
     A  02                                  DSPATR(HI)
     A            OPENSYS       10   O 12 46
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(HI)
     A                                 15 31'Please Wait...'
