     A*  89/03/09  16:25:06    T000144     REL-R01M02  5728-PW1
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A          R TALLYINQ
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 16'-----------------------------------
     A                                      ----------'
     A                                  2 16':  RECEIVING SLIP INQUIRY BY TALLY'
     A                                  2 51'NUMBER  :'
     A                                  3 16'-----------------------------------
     A                                      ----------'
     A                                  4  9'RECEIVING SLIPS ARE SHOWN IN ORDER'
     A                                  4 44'OF THE MOST RECENT FIRST.'
     A                                  6 26'ENTER TALLY NUMBER:'
     A                                  8  5'"X"'
     A                                  8 15'RECEIVER      CORPORATE CODE'
     A                                  9  5'---    --------------   -----------
     A                                      -----'
     A            TALY           4A  B  6 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A*         **** SUBFILE RECORD ***
                R RDSF                      SFL
     A            A              1A  B 10  6DSPATR(UL)
     A            PO1           14A  B 10 12DSPATR(PR)
     A            CODE1          7A  B 10 32DSPATR(PR)
                  ITEM1          4A  H
     A          R RDSC                      SFLCTL(RDSF)
     A                                      CF03(03)
     A                                      OVERLAY
     A  75                                  SFLDSP
     A  76                                  SFLDSPCTL
        77                                  SFLCLR
       N74                                  SFLEND
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(0010)
     A                                  1 16'-----------------------------------
     A                                      ----------'
     A                                  2 16':  RECEIVING SLIP INQUIRY BY TALLY'
     A                                  2 51'NUMBER  :'
     A                                  3 16'-----------------------------------
     A                                      ----------'
     A                                  4  9'RECEIVING SLIPS ARE SHOWN IN ORDER'
     A                                  4 44'OF THE MOST RECENT FIRST.'
     A                                  6 26'ENTER TALLY NUMBER:'
     A                                  8  5'"X"'
     A                                  8 15'RECEIVER      CORPORATE CODE'
     A                                  9  5'---    --------------   -----------
     A                                      -----'
     A            TALY           4A  B  6 47DSPATR(PR)
     A          R RDSB
     A                                 21  1'ENTER "X" BY AS MANY RECEIVERS AS '
     A                                 21 36'YOU WISH TO REVIEW.               '
