     A*****************************************************************
     A**                D I S P L A Y   F I L E
     A*****************************************************************
     A** FILE NAME  :  ZTBLKINQ2
     A**
     A** DESCRIPTION:  BLANKET INQUIRIES
     A**
     A** AUTHOR     :  DAN RAUCH - EXLTECH, LLC
     A** CREATED    :  MAR 9, 2005
     A**
     A** FORMATS    :  FBLKTINQ
     A**
     A*****************************************************************
     A** COPIED FROM ZCSISINQ
     A*****************************************************************
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A          R FBLKTINQ
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 20'- - -   I T E M   S T A T U S  - -'
     A                                  1 55'-'
     A                                  1 75'MQ1-6'
     A                                  2 22'REQUIREMENTS ORDER INQUIRY SCREEN'
     A                                  3  1'CODE'
     A                                  5  5'PO NUMBER   ITEM #   UM     REQUIR-
     A                                      EMENT DATE      EXPIRATION DATE'
     A                                  6  5'---------   ------   --     -------
     A                                      ----------      ---------------'
     A                                 21  1'  PRESS  "f1"  FOR BASIC INQUIRY F-
     A                                      IELDS'
     A                                 22 10'"f2"  FOR MORE INQUIRY FIELDS'
     A                                 22 46'"f6"  FOR RESERVATION INQUIRY'
     A                                 23 10'"f7"  FOR NEXT INQUIRY'
     A                                 23 46'"f3"  TO END PROGRAM'
     A            COM            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            STRCODE        7A  B  3  6DSPATR(PR)
     A                                      OVRDTA
     A            PONUM1         7A  B  7  5DSPATR(PR)
     A                                      OVRDTA
     A            IT1            5A  B  7 17DSPATR(PR)
     A                                      OVRDTA
     A            U1             2A  B  7 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE1        8A  B  7 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE1        8A  B  7 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM2         7A  B  8  5DSPATR(PR)
     A                                      OVRDTA
     A            IT2            5A  B  8 17DSPATR(PR)
     A                                      OVRDTA
     A            U2             2A  B  8 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE2        8A  B  8 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE2        8A  B  8 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM3         7A  B  9  5DSPATR(PR)
     A                                      OVRDTA
     A            IT3            5A  B  9 17DSPATR(PR)
     A                                      OVRDTA
     A            U3             2A  B  9 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE3        8A  B  9 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE3        8A  B  9 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM4         7A  B 10  5DSPATR(PR)
     A                                      OVRDTA
     A            IT4            5A  B 10 17DSPATR(PR)
     A                                      OVRDTA
     A            U4             2A  B 10 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE4        8A  B 10 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE4        8A  B 10 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM5         7A  B 11  5DSPATR(PR)
     A                                      OVRDTA
     A            IT5            5A  B 11 17DSPATR(PR)
     A                                      OVRDTA
     A            U5             2A  B 11 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE5        8A  B 11 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE5        8A  B 11 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM6         7A  B 12  5DSPATR(PR)
     A                                      OVRDTA
     A            IT6            5A  B 12 17DSPATR(PR)
     A                                      OVRDTA
     A            U6             2A  B 12 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE6        8A  B 12 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE6        8A  B 12 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM7         7A  B 13  5DSPATR(PR)
     A                                      OVRDTA
     A            IT7            5A  B 13 17DSPATR(PR)
     A                                      OVRDTA
     A            U7             2A  B 13 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE7        8A  B 13 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE7        8A  B 13 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM8         7A  B 14  5DSPATR(PR)
     A                                      OVRDTA
     A            IT8            5A  B 14 17DSPATR(PR)
     A                                      OVRDTA
     A            U8             2A  B 14 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE8        8A  B 14 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE8        8A  B 14 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM9         7A  B 15  5DSPATR(PR)
     A                                      OVRDTA
     A            IT9            5A  B 15 17DSPATR(PR)
     A                                      OVRDTA
     A            U9             2A  B 15 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE9        8A  B 15 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE9        8A  B 15 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM10        7A  B 16  5DSPATR(PR)
     A                                      OVRDTA
     A            IT10           5A  B 16 17DSPATR(PR)
     A                                      OVRDTA
     A            U0             2A  B 16 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE10       8A  B 16 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE10       8A  B 16 59DSPATR(PR)
     A                                      OVRDTA
     A            PONUM11        7A  B 17  5DSPATR(PR)
     A                                      OVRDTA
     A            IT11           5A  B 17 17DSPATR(PR)
     A                                      OVRDTA
     A            M1             2A  B 17 26DSPATR(PR)
     A                                      OVRDTA
     A            REQDTE11       8A  B 17 37DSPATR(PR)
     A                                      OVRDTA
     A            EXPDTE11       8A  B 17 59DSPATR(PR)
     A                                      OVRDTA
     A            MORE11MSG     69A  B 19  2DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
