     A*****************************************************************
     A**                D I S P L A Y   F I L E
     A*****************************************************************
     A** FILE NAME  :  ZTEAUNAVA
     A**
     A** DESCRIPTION:  STAND ALONE REQ QUEUE CHANGE PROGRAM
     A**
     A** AUTHOR     :  DAN RAUCH - EXLTECH, LLC
     A** CREATED    :  MAR 9, 2005
     A**
     A** FORMATS    :  FEAUNAVA
     A**
     A*****************************************************************
     A** COPIED FROM ZCSISINQ
     A*****************************************************************
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A          R FEAUNAVA
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 13'REQUSITION APPROVAL SYSTEM - UNAVA-
     A                                      ILABILITY'
     A                                  3  1'This screen is used when an approv-
     A                                      er goes inactive: on vacation, trav-
     A                                      elling,'
     A                                  4  1'etc.'
     A                                  6  1'Enter employee ID of person who wi-
     A                                      ll be unavailable for approving'
     A                                  9  1'Enter employee ID of person who wi-
     A                                      ll be the alternate for approving'
     A                                 12  1'If you don"t know the employee ID,'
     A                                 12 36'use f7 for employee inquiry.'
     A                                 14  1'Note: If no alternate is specified-
     A                                       and the F3 key is pressed, the ID '
     A                                 15  1'of the person who is unavailable w-
     A                                      ill remain in the active state and '
     A                                 16  1'requisitions will continue to queu-
     A                                      e to that ID. The old ID will '
     A                                 17  1'automatically be re-activated when-
     A                                       the user signs back into the '
     A                                 18  1'approval program.'
     A            EMPL           4A  B  7 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            EMPLA          4A  B 10 27DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-CANCEL INACTIVE F7-EMPLO-
     A                                      YEE INQUIRY                        -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
