     A*****************************************************************
     A**                D I S P L A Y   F I L E
     A*****************************************************************
     A** FILE NAME  :  ZTMTLSTAT
     A**
     A** DESCRIPTION:  DISPLAY FILE FOR MATERIAL STATUS INQUIRY
     A**
     A** AUTHOR     :  DAN RAUCH - EXLTECH, LLC
     A** CREATED    :  MAR 9, 2005
     A**
     A** FORMATS    :  FMTLSTAT1   FMTLSTAT2   FMTLSTAT3   FMTLSTAT3S
     A**               FMTLSTAT4
     A*****************************************************************
     A** COPIED FROM ZCSISINQ
     A*****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A          R FMTLSTAT1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 19'- - -  I T E M   S T A T U S - - -'
     A                                  1 74'MQ1-1'
     A                                 23  1'  PRESS  "f3"  TO END PROGRAM'
     A            COMP           4A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            STRCODE       12A  B  3  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            INSTRUCTLI    65A  B  3 15DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTL2    65A  B  4 15DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTL3    65A  B  5 15DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTL4    65A  B  6 15DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FMTLSTAT1B
     A*%%TS  DD  20021108  125012  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 20'- - -  I T E M   S T A T U S  - -'
     A                                  1 54'-'
     A                                  1 75'MQ1-1B'
     A                                  7  7'O V E R A L L   D A T A   B A S E'
     A                                  7 43'O N H A N D   I N Q U I R Y'
     A                                  9  3'PLANT     LOC 1'
     A                                  9 27'LOC2'
     A                                  9 39'ONHAND   STR   REQ.    ITEM ORDER'
     A                                  9 74'EXP.'
     A                                 10 49'UM   ORDER    NO.  UM    DATE'
     A                                 22  7'ENTER AN "X" IN FRONT OF THE DESIR-
     A                                      ED PLANT FOR MORE INFORMATION OR'
     A                                 23  4'PRESS  "f5" TO PRINT SCREEN, "f7"'
     A                                 23 38'TO ENTER NEXT CODE, "f3" TO END PR-
     A                                      OGRAM'
     A            COM            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            STRCODE        7A  B  3  1DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTLI    65A  B  3 10DSPATR(PR)
     A                                      OVRDTA
     A            INSTRUCTL2    65A  B  4 10DSPATR(PR)
     A                                      OVRDTA
     A            A              1A  B 12  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  67                                  DSPATR(RI)
     A  67                                  DSPATR(PC)
     A            DES1           4A  B 12  4DSPATR(PR)
     A                                      OVRDTA
     A            LOC1PLT1      12A  B 12 10DSPATR(PR)
     A                                      OVRDTA
     A            LOC2PLT1      12A  B 12 24DSPATR(PR)
     A                                      OVRDTA
     A            ONHDPLT1       9A  B 12 38DSPATR(PR)
     A                                      OVRDTA
     A            U1             2A  B 12 49DSPATR(PR)
     A                                      OVRDTA
     A            REQORD1        7A  B 12 53DSPATR(PR)
     A                                      OVRDTA
     A            ITM1           4A  B 12 62DSPATR(PR)
     A                                      OVRDTA
     A            O1             2A  B 12 68DSPATR(PR)
     A                                      OVRDTA
     A            REQDATE1       8A  B 12 72DSPATR(PR)
     A                                      OVRDTA
     A            B              1A  B 13  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  69                                  DSPATR(RI)
     A  69                                  DSPATR(PC)
     A            DES2           4A  B 13  4DSPATR(PR)
     A                                      OVRDTA
     A            LOC1PLT2      12A  B 13 10DSPATR(PR)
     A                                      OVRDTA
     A            LOC2PLT2      12A  B 13 24DSPATR(PR)
     A                                      OVRDTA
     A            OHNDPLT2       9A  B 13 38DSPATR(PR)
     A                                      OVRDTA
     A            U2             2A  B 13 49DSPATR(PR)
     A                                      OVRDTA
     A            REQORD2        7A  B 13 53DSPATR(PR)
     A                                      OVRDTA
     A            ITM2           4A  B 13 62DSPATR(PR)
     A                                      OVRDTA
     A            O2             2A  B 13 68DSPATR(PR)
     A                                      OVRDTA
     A            REQDATE2       8A  B 13 72DSPATR(PR)
     A                                      OVRDTA
     A            C              1A  B 14  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  72                                  DSPATR(RI)
     A  72                                  DSPATR(PC)
     A            DES3           4A  B 14  4DSPATR(PR)
     A                                      OVRDTA
     A            LOC1PLT3      12A  B 14 10DSPATR(PR)
     A                                      OVRDTA
     A            LOC2PLT3      12A  B 14 24DSPATR(PR)
     A                                      OVRDTA
     A            OHNDPLT3       9A  B 14 38DSPATR(PR)
     A                                      OVRDTA
     A            U3             2A  B 14 49DSPATR(PR)
     A                                      OVRDTA
     A            REQORD3        7A  B 14 53DSPATR(PR)
     A                                      OVRDTA
     A            ITM3           4A  B 14 62DSPATR(PR)
     A                                      OVRDTA
     A            O3             2A  B 14 68DSPATR(PR)
     A                                      OVRDTA
     A            REQDATE3       8A  B 14 72DSPATR(PR)
     A                                      OVRDTA
     A            D              1A  B 15  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  74                                  DSPATR(RI)
     A  74                                  DSPATR(PC)
     A            DES4           4A  B 15  4DSPATR(PR)
     A                                      OVRDTA
     A            LOC1PLT4      12A  B 15 10DSPATR(PR)
     A                                      OVRDTA
     A            LOC2PLT4      12A  B 15 24DSPATR(PR)
     A                                      OVRDTA
     A            OHNDPLT4       9A  B 15 38DSPATR(PR)
     A                                      OVRDTA
     A            U4             2A  B 15 49DSPATR(PR)
     A                                      OVRDTA
     A            REQORD4        7A  B 15 53DSPATR(PR)
     A                                      OVRDTA
     A            ITM4           4A  B 15 62DSPATR(PR)
     A                                      OVRDTA
     A            O4             2A  B 15 68DSPATR(PR)
     A                                      OVRDTA
     A            REQDATE4       8A  B 15 72DSPATR(PR)
     A                                      OVRDTA
     A            E              1A  B 16  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  83                                  DSPATR(RI)
     A  83                                  DSPATR(PC)
     A            DES5           4A  B 16  4DSPATR(PR)
     A                                      OVRDTA
     A            LOC1PLT5      12A  B 16 10DSPATR(PR)
     A                                      OVRDTA
     A            LOC2PLT5      12A  B 16 24DSPATR(PR)
     A                                      OVRDTA
     A            ONHDPLT5       9A  B 16 38DSPATR(PR)
     A                                      OVRDTA
     A            U5             2A  B 16 49DSPATR(PR)
     A                                      OVRDTA
     A            REQORD5        7A  B 16 53DSPATR(PR)
     A                                      OVRDTA
     A            ITM5           4A  B 16 62DSPATR(PR)
     A                                      OVRDTA
     A            O5             2A  B 16 68DSPATR(PR)
     A                                      OVRDTA
     A            REQDATE5       8A  B 16 72DSPATR(PR)
     A                                      OVRDTA
     A            F              1A  B 17  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  85                                  DSPATR(RI)
     A  85                                  DSPATR(PC)
     A            DES6           4A  B 17  4DSPATR(PR)
     A                                      OVRDTA
     A            LOC1PLT9      12A  B 17 10DSPATR(PR)
     A                                      OVRDTA
     A            LOC2PLT9      12A  B 17 24DSPATR(PR)
     A                                      OVRDTA
     A            ONHDPLT9       9A  B 17 38DSPATR(PR)
     A                                      OVRDTA
     A            U9             2A  B 17 49DSPATR(PR)
     A                                      OVRDTA
     A            REQORD9        7A  B 17 53DSPATR(PR)
     A                                      OVRDTA
     A            ITM9           4A  B 17 62DSPATR(PR)
     A                                      OVRDTA
     A            O9             2A  B 17 68DSPATR(PR)
     A                                      OVRDTA
     A            REQDATE9       8A  B 17 72DSPATR(PR)
     A                                      OVRDTA
     A            G              1A  B 18  1DSPATR(UL)
     A            DES7           4A  B 18  4DSPATR(PR)
     A                                      OVRDTA
     A            LOC1MIXCTR    12A  B 18 10DSPATR(PR)
     A                                      OVRDTA
     A            LOC2MIXCTR    12A  B 18 24DSPATR(PR)
     A                                      OVRDTA
     A            ONHDPLTM       9A  B 18 38DSPATR(PR)
     A                                      OVRDTA
     A            UM             2A  B 18 49DSPATR(PR)
     A                                      OVRDTA
     A            REQORDM        7A  B 18 53DSPATR(PR)
     A                                      OVRDTA
     A            ITMM           4A  B 18 62DSPATR(PR)
     A                                      OVRDTA
     A            OM             2A  B 18 68DSPATR(PR)
     A                                      OVRDTA
     A            REQDATEM       8A  B 18 72DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f7-NEXT CODE f3-EXIT PROGRA-
     A                                      M                                  -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A*****************************************************************
     A** DCR01     11/13/2003     ADDED ARIBA BUYER FLAG          *****
     A*****************************************************************
     A          R FMTLSTAT2
     A*%%TS  SD  20040812  083111  A257947     REL-V5R2M0  5722-WDS
     A N90                                  CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A N90                                  CF05
     A N90                                  CF06
     A                                      CF07
     A N90                                  CF08
     A                                      PUTOVR
     A            COM            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A                                  1 20'- - -   I T E M   S T A T U S   -'
     A                                  1 54'- -'
     A                                  1 75'MQ1-2'
     A                                  2 66'TECH. BULLETIN'
     A                                      DSPATR(BL)
     A N91                                  DSPATR(ND)
     A            CODEISFROZ    34A  B  3 23DSPATR(PR)
     A                                      OVRDTA
     A                                  4  1'CODE'
     A            STRCODE        7A  B  4  6DSPATR(PR)
     A                                      OVRDTA
     A                                  4 17' PREV-CODE'
     A            LOCCODE       12A  B  4 28DSPATR(PR)
     A                                      OVRDTA
     A                                  4 44'CLASS'
     A            CLSS           4A  B  4 50DSPATR(PR)
     A                                      OVRDTA
     A                                  4 58'DEFAULT DEPT'
     A            DFTDEP         6A  B  4 71DSPATR(PR)
     A                                      OVRDTA
     A            DESC1         79A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC2         79A  B  6  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC3         79A  B  7  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC4         79A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A                                  9  1'UM'
     A            UM             2A  B  9  6DSPATR(PR)
     A                                      OVRDTA
     A            ALTUMCF        9A  B  9 11DSPATR(PR)
     A                                      OVRDTA
     A                                  9 25'ONHAND'
     A            ONHAND         9A  B  9 35DSPATR(PR)
     A                                      OVRDTA
     A                                  9 53'LOC1'
     A            LOC1          12A  B  9 58DSPATR(PR)
     A                                      OVRDTA
     A            LOC1ONHAN      9A  B  9 71DSPATR(PR)
     A                                      OVRDTA
     A            UM1            3A  B 10  1DSPATR(PR)
     A                                      OVRDTA
     A            U1             2A  B 10  6DSPATR(PR)
     A                                      OVRDTA
     A            UMCF1         11A  B 10  9DSPATR(PR)
     A                                      OVRDTA
     A                                 10 25'RESERVED'
     A  80                                  DSPATR(ND)
     A            RESERVED       9A  B 10 35DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                 10 53'LOC2'
     A            LOC2          12A  B 10 58DSPATR(PR)
     A                                      OVRDTA
     A            LOC2ONHAN      9A  B 10 71DSPATR(PR)
     A                                      OVRDTA
     A            UM2            3A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            U2             2A  B 11  6DSPATR(PR)
     A                                      OVRDTA
     A            UMCF2         11A  B 11  9DSPATR(PR)
     A                                      OVRDTA
     A                                 11 25'AVAILABLE'
     A  80                                  DSPATR(ND)
     A            AVAIL          9A  B 11 35DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                 11 53'LOC3'
     A            LOC3          12A  B 11 58DSPATR(PR)
     A                                      OVRDTA
     A            LOC3ONHAN      9A  B 11 71DSPATR(PR)
     A                                      OVRDTA
     A                                 12 25'STR ONORD'
     A  80                                  DSPATR(ND)
     A            ONORDER        9A  B 12 35DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                 12 53'LOC4'
     A            LOC4          12A  B 12 58DSPATR(PR)
     A                                      OVRDTA
     A            LOC4ONHAN      9A  B 12 71DSPATR(PR)
     A                                      OVRDTA
     A                                 13 25'DIR ONORD'
     A  80                                  DSPATR(ND)
     A            DONORDER       9A  B 13 35DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                 13 53'LOC5'
     A            LOC5          12A  B 13 58DSPATR(PR)
     A                                      OVRDTA
     A            LOC5ONHAN      9A  B 13 71DSPATR(PR)
     A                                      OVRDTA
     A                                 14  1'ARIBA BUYER ITEM:'
     A  80                                  DSPATR(ND)
     A            ARIBAFLG       1A  B 14 19DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                 14 25'TOTAL ONR'
     A  80                                  DSPATR(ND)
     A            TONORDER       9A  B 14 35DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                 14 53'LOC6'
     A            LOC6          12A  B 14 58DSPATR(PR)
     A                                      OVRDTA
     A            LOC6ONHAN      9A  B 14 71DSPATR(PR)
     A                                      OVRDTA
     A                                 15 25'ON DOCK'
     A  80                                  DSPATR(ND)
     A            ONDOCK         9A  B 15 35DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                 16  1'AV CST'
     A  90                                  DSPATR(ND)
     A            AVGCST        16A  B 16  8DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 16 25'LAST PO'
     A  90                                  DSPATR(ND)
     A            PONUM          7A  B 16 33DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(HI)
     A  90                                  DSPATR(ND)
     A            RLS            3A  B 16 41DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(HI)
     A  90                                  DSPATR(ND)
     A                                 16 47'LAST BUYER'
     A  90                                  DSPATR(ND)
     A            BUYER         15A  B 16 58DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 17 19'LAST REQ#'
     A  90                                  DSPATR(ND)
     A            REQNUM        12A  B 17 30DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A            REQDATE        8A  B 17 44DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 18  1'DISP INSTR -'
     A            DISPINSTR     30A  B 18 14DSPATR(PR)
     A                                      OVRDTA
     A                                 18 53'HIGH USAGE AREAS'
     A            DISPREPAIR    18A  B 19  1DSPATR(PR)
     A                                      DSPATR(BL)
     A                                      OVRDTA
     A            DISPSTOCK     16A  B 19 24DSPATR(PR)
     A                                      OVRDTA
     A            H1             2A  B 19 53DSPATR(PR)
     A                                      OVRDTA
     A            H2             2A  B 19 56DSPATR(PR)
     A                                      OVRDTA
     A            H3             2A  B 19 59DSPATR(PR)
     A                                      OVRDTA
     A            H4             2A  B 19 62DSPATR(PR)
     A                                      OVRDTA
     A            H5             2A  B 19 65DSPATR(PR)
     A                                      OVRDTA
     A            H6             2A  B 19 68DSPATR(PR)
     A                                      OVRDTA
     A            DISPBLKMSG    58A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 21  1'  PRESS  "f2"  FOR MORE INQUIRY FI-
     A                                      ELDS'
     A                                 21 47'"f5"  FOR LAST PO INQUIRY'
     A  90                                  DSPATR(ND)
     A                                 22 10'"f4"  FOR FULL DESCRIPTION'
     A                                 22 47'"f6"  FOR RESERVATION INQUIRY'
     A  90                                  DSPATR(ND)
     A                                 23 10'"f7"  FOR NEXT INQUIRY'
     A                                 23 47'"f3"  TO END PROGRAM'
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FMTLSTAT3
     A*%%TS  SD  20020509  140601  A257947     REL-V5R1M0  5722-WDS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A N90                                  CF05
     A N90                                  CF06
     A                                      CF07
     A N90                                  CF08
     A            COM            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A                                  1 20'- - -   I T E M   S T A T U S   -'
     A                                  1 54'- -'
     A                                  1 75'MQ1-3'
     A                                  2 66'TECH. BULLETIN'
     A                                      DSPATR(BL)
     A N91                                  DSPATR(ND)
     A            CODEISFROZ    34A  B  3 23DSPATR(PR)
     A                                      OVRDTA
     A                                  4  1'CODE'
     A            STRCODE        7A  B  4  6DSPATR(PR)
     A                                      OVRDTA
     A                                  4 17'CLASSIFICATIONS   WD  OE  MR  OR'
     A                                  4 51'INS  IMP  SO  CO  SA  RW  OV'
     A                                  5  1'UM'
     A            UM             2A  B  5  6DSPATR(PR)
     A                                      OVRDTA
     A            WRITEDOWN      1A  B  5 36DSPATR(PR)
     A                                      OVRDTA
     A            ORDERENG       1A  B  5 40DSPATR(PR)
     A                                      OVRDTA
     A            MAINTREPAI     1A  B  5 44DSPATR(PR)
     A                                      OVRDTA
     A            OUTSIDEREP     1A  B  5 48DSPATR(PR)
     A                                      OVRDTA
     A            INSURANCE      1A  B  5 52DSPATR(PR)
     A                                      OVRDTA
     A            RELEASE        1A  B  5 57DSPATR(PR)
     A                                      OVRDTA
     A            STOCKOUT       1A  B  5 62DSPATR(PR)
     A                                      OVRDTA
     A            CONSIGNMEN     1A  B  5 66DSPATR(PR)
     A                                      OVRDTA
     A            SA             1A  B  5 70DSPATR(PR)
     A                                      OVRDTA
     A            RW             1A  B  5 74DSPATR(PR)
     A                                      OVRDTA
     A            OV             1A  B  5 78DSPATR(PR)
     A                                      OVRDTA
     A                                  6  1'ONHAND'
     A            ONHAND         9A  B  6 10DSPATR(PR)
     A                                      OVRDTA
     A                                  6 23'ADD TO STOCK DATE'
     A            ADDDATE        8A  B  6 42DSPATR(PR)
     A                                      OVRDTA
     A                                  6 51'ORIGINATOR'
     A            ORIGINATOR    10A  B  6 62DSPATR(PR)
     A                                      OVRDTA
     A                                  7  1'MAXIMUM'
     A            MAX            9A  B  7 10DSPATR(PR)
     A                                      OVRDTA
     A                                  7 23'LAST ISSUE DATE'
     A            ISSDATE        8A  B  7 42DSPATR(PR)
     A                                      OVRDTA
     A                                  7 51'TO EMPL'
     A            EMPL           4A  B  7 59DSPATR(PR)
     A                                      OVRDTA
     A                                  7 64'DEPT'
     A            CHARDEPT      10A  B  7 69DSPATR(PR)
     A                                      OVRDTA
     A                                  8  1'REORDER'
     A            REORDER        9A  B  8 10DSPATR(PR)
     A                                      OVRDTA
     A                                  8 23'LAST ACTIVITY DATE'
     A            ACTDATE        8A  B  8 42DSPATR(PR)
     A                                      OVRDTA
     A            EMPLNAME      16A  B  8 59DSPATR(PR)
     A                                      OVRDTA
     A                                  9  1'EXPEDITE'
     A            EXPEDITE       9A  B  9 10DSPATR(PR)
     A                                      OVRDTA
     A                                  9 23'LAST PHYS INV DATE'
     A            PHYDATE        8A  B  9 42DSPATR(PR)
     A                                      OVRDTA
     A                                  9 51'CYCLE'
     A            CYCL           5A  B  9 57DSPATR(PR)
     A                                      OVRDTA
     A                                  9 63'DAYS'
     A                                 11  1'SOQ'
     A            SOQ            9A  B 11  6DSPATR(PR)
     A                                      OVRDTA
     A                                 11 19'STD COST'
     A  90                                  DSPATR(ND)
     A            STDCOST       16A  B 11 28DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 11 48'EST GDYR LT'
     A  90                                  DSPATR(ND)
     A            ESLT           5A  B 11 65DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 11 71'DAYS'
     A  90                                  DSPATR(ND)
     A                                 12  1'EOQ'
     A            EOQ            9A  B 12  6DSPATR(PR)
     A                                      OVRDTA
     A                                 12 19'MKT COST'
     A  90                                  DSPATR(ND)
     A            MKTCOST       16A  B 12 28DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 12 48'OUT. REP. COST'
     A  90                                  DSPATR(ND)
     A            OUTREPCOST    16A  B 12 63DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 13  1'LAST ACTUAL LEADTIMES'
     A  90                                  DSPATR(ND)
     A            ACLT           5A  B 13 23DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 13 29'DAYS'
     A  90                                  DSPATR(ND)
     A            ACLT2          5A  B 13 35DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 13 41'DAYS'
     A  90                                  DSPATR(ND)
     A            ACLT3          5A  B 13 47DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 13 53'DAYS'
     A  90                                  DSPATR(ND)
     A                                 15  1'JA'
     A  90                                  DSPATR(ND)
     A            USAGELIT      60A  B 14  1DSPATR(PR)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A            JANUSAGE       9A  B 15  4DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 15 14'FE'
     A  90                                  DSPATR(ND)
     A            FEBUSAGE       9A  B 15 17DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 15 27'MA'
     A  90                                  DSPATR(ND)
     A            MARUSAGE       9A  B 15 30DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 15 40'AP'
     A  90                                  DSPATR(ND)
     A            APRUSAGE       9A  B 15 43DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 15 53'MA'
     A  90                                  DSPATR(ND)
     A            MAYUSAGE       9A  B 15 56DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 15 66'JU'
     A  90                                  DSPATR(ND)
     A            JUNUSAGE       9A  B 15 69DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 16  1'JU'
     A  90                                  DSPATR(ND)
     A            JULUSAGE       9A  B 16  4DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 16 14'AU'
     A  90                                  DSPATR(ND)
     A            AUGUSAGE       9A  B 16 17DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 16 27'SE'
     A  90                                  DSPATR(ND)
     A            SEPUSAGE       9A  B 16 30DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 16 40'OC'
     A  90                                  DSPATR(ND)
     A            OCTUSAGE       9A  B 16 43DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 16 53'NO'
     A  90                                  DSPATR(ND)
     A            NOVUSAGE       9A  B 16 56DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 16 66'DE'
     A  90                                  DSPATR(ND)
     A            DECUSAGE       9A  B 16 69DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 17  1'USAGE:'
     A  90                                  DSPATR(ND)
     A                                 17 21'AVERAGE MONTHLY USAGE'
     A  90                                  DSPATR(ND)
     A            AVGMUSAG       9A  B 17 43DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 18  3'MONTH-TO-DATE'
     A  90                                  DSPATR(ND)
     A            MONTODAT       9A  B 18 17DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 18 28'LAST-12-MONTHS'
     A  90                                  DSPATR(ND)
     A            LST12MONU      9A  B 18 43DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 18 55'USED YESTERDAY'
     A  90                                  DSPATR(ND)
     A            USEDYEST       9A  B 18 70DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 19  1'RECEIPTS:'
     A  90                                  DSPATR(ND)
     A                                 20  3'MONTH-TO-DATE'
     A  90                                  DSPATR(ND)
     A            RMONTODAT      9A  B 20 17DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 20 28'LAST-12-MONTHS'
     A  90                                  DSPATR(ND)
     A            LST12MONR      9A  B 20 43DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 20 55'RECD YESTERDAY'
     A  90                                  DSPATR(ND)
     A            RECDYEST       9A  B 20 70DSPATR(PR)
     A                                      OVRDTA
     A  90                                  DSPATR(ND)
     A                                 21  1'  PRESS  "f1"  FOR BASIC INQUIRY F-
     A                                      IELDS'
     A                                 21 46'"f5"  FOR LAST PO INQUIRY'
     A  90                                  DSPATR(ND)
     A                                 22 10'"f4"  FOR FULL DESCRIPTION'
     A                                 22 46'"f6"  FOR RESERVATION INQUIRY'
     A  90                                  DSPATR(ND)
     A                                 23 10'"f7"  FOR NEXT INQUIRY'
     A                                 23 46'"f3"  TO END PROGRAM'
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FMTLSTAT3S
     A*%%TS  SD  20040812  114500  A257947     REL-V5R2M0  5722-WDS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF07
     A            COM            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A                                  1 20'- - -   I T E M   S T A T U S   -'
     A                                  1 54'- -'
     A                                  1 75'MQ1-3'
     A                                  2 66'TECH. BULLETIN'
     A                                      DSPATR(BL)
     A N91                                  DSPATR(ND)
     A            CODEISFROZ    34A  B  3 23DSPATR(PR)
     A                                      OVRDTA
     A                                  4  1'CODE'
     A            STRCODE        7A  B  4  6DSPATR(PR)
     A                                      OVRDTA
     A                                  4 17'CLASSIFICATIONS   WD  OE  MR  OR'
     A                                  4 51'INS  IMP  SO  CO  SA  RW  OV'
     A                                  5  1'UM'
     A            UM             2A  B  5  6DSPATR(PR)
     A                                      OVRDTA
     A            WRITEDOWN      1A  B  5 36DSPATR(PR)
     A                                      OVRDTA
     A            ORDERENG       1A  B  5 40DSPATR(PR)
     A                                      OVRDTA
     A            MAINTREPAI     1A  B  5 44DSPATR(PR)
     A                                      OVRDTA
     A            OUTSIDEREP     1A  B  5 48DSPATR(PR)
     A                                      OVRDTA
     A            INSURANCE      1A  B  5 52DSPATR(PR)
     A                                      OVRDTA
     A            RELEASE        1A  B  5 57DSPATR(PR)
     A                                      OVRDTA
     A            STOCKOUT       1A  B  5 62DSPATR(PR)
     A                                      OVRDTA
     A            CONSIGNMEN     1A  B  5 66DSPATR(PR)
     A                                      OVRDTA
     A            SA             1A  B  5 70DSPATR(PR)
     A                                      OVRDTA
     A            RW             1A  B  5 74DSPATR(PR)
     A                                      OVRDTA
     A            OV             1A  B  5 78DSPATR(PR)
     A                                      OVRDTA
     A                                  6  1'ONHAND'
     A            ONHAND         9A  B  6 10DSPATR(PR)
     A                                      OVRDTA
     A                                  6 23'ADD TO STOCK DATE'
     A            ADDDATE        8A  B  6 42DSPATR(PR)
     A                                      OVRDTA
     A                                  6 51'ORIGINATOR'
     A  80                                  DSPATR(ND)
     A            ORIGINATOR    10A  B  6 62DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                  7  1'MAXIMUM'
     A  80                                  DSPATR(ND)
     A            MAX            9A  B  7 10DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                  7 23'LAST ISSUE DATE'
     A  80                                  DSPATR(ND)
     A            ISSDATE        8A  B  7 42DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                  7 51'TO EMPL'
     A  80                                  DSPATR(ND)
     A            EMPL           4A  B  7 59DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                  7 64'DEPT'
     A  80                                  DSPATR(ND)
     A            CHARDEPT      10A  B  7 69DSPATR(PR)
     A                                      OVRDTA
     A                                  8  1'REORDER'
     A  80                                  DSPATR(ND)
     A            REORDER        9A  B  8 10DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                  8 23'LAST ACTIVITY DATE'
     A            ACTDATE        8A  B  8 42DSPATR(PR)
     A                                      OVRDTA
     A            EMPLNAME      16A  B  8 59DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                  9  1'EXPEDITE'
     A  80                                  DSPATR(ND)
     A            EXPEDITE       9A  B  9 10DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                  9 23'LAST PHYS INV DATE'
     A            PHYDATE        8A  B  9 42DSPATR(PR)
     A                                      OVRDTA
     A                                  9 51'CYCLE'
     A  80                                  DSPATR(ND)
     A            CYCL           5A  B  9 57DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                  9 63'DAYS'
     A  80                                  DSPATR(ND)
     A                                 11  1'SOQ'
     A  80                                  DSPATR(ND)
     A            SOQ            9A  B 11  6DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                 11 19'STD COST'
     A  80                                  DSPATR(ND)
     A            STDCOST       16A  B 11 28DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                 11 48'EST GDYR LT'
     A  80                                  DSPATR(ND)
     A            ESLT           5A  B 11 65DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                 11 71'DAYS'
     A  80                                  DSPATR(ND)
     A                                 12  1'EOQ'
     A  80                                  DSPATR(ND)
     A            EOQ            9A  B 12  6DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                 12 19'MKT COST'
     A  80                                  DSPATR(ND)
     A            MKTCOST       16A  B 12 28DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                 12 48'OUT. REP. COST'
     A  80                                  DSPATR(ND)
     A            OUTREPCOST    16A  B 12 63DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                 13  1'LAST ACTUAL LEADTIMES'
     A  80                                  DSPATR(ND)
     A            ACLT           5A  B 13 23DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                 13 29'DAYS'
     A  80                                  DSPATR(ND)
     A            ACLT2          5A  B 13 35DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                 13 41'DAYS'
     A  80                                  DSPATR(ND)
     A            ACLT3          5A  B 13 47DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                 13 53'DAYS'
     A  80                                  DSPATR(ND)
     A                                 15  1'JA'
     A            USAGELIT      60A  B 14  1DSPATR(PR)
     A                                      DSPATR(HI)
     A                                      OVRDTA
     A            JANUSAGE       9A  B 15  4DSPATR(PR)
     A                                      OVRDTA
     A                                 15 14'FE'
     A            FEBUSAGE       9A  B 15 17DSPATR(PR)
     A                                      OVRDTA
     A                                 15 27'MA'
     A            MARUSAGE       9A  B 15 30DSPATR(PR)
     A                                      OVRDTA
     A                                 15 40'AP'
     A            APRUSAGE       9A  B 15 43DSPATR(PR)
     A                                      OVRDTA
     A                                 15 53'MA'
     A            MAYUSAGE       9A  B 15 56DSPATR(PR)
     A                                      OVRDTA
     A                                 15 66'JU'
     A            JUNUSAGE       9A  B 15 69DSPATR(PR)
     A                                      OVRDTA
     A                                 16  1'JU'
     A            JULUSAGE       9A  B 16  4DSPATR(PR)
     A                                      OVRDTA
     A                                 16 14'AU'
     A            AUGUSAGE       9A  B 16 17DSPATR(PR)
     A                                      OVRDTA
     A                                 16 27'SE'
     A            SEPUSAGE       9A  B 16 30DSPATR(PR)
     A                                      OVRDTA
     A                                 16 40'OC'
     A            OCTUSAGE       9A  B 16 43DSPATR(PR)
     A                                      OVRDTA
     A                                 16 53'NO'
     A            NOVUSAGE       9A  B 16 56DSPATR(PR)
     A                                      OVRDTA
     A                                 16 66'DE'
     A            DECUSAGE       9A  B 16 69DSPATR(PR)
     A                                      OVRDTA
     A                                 17  1'USAGE:'
     A  80                                  DSPATR(ND)
     A                                 17 21'AVERAGE MONTHLY USAGE'
     A  80                                  DSPATR(ND)
     A            AVGMUSAG       9A  B 17 43DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                 18  3'MONTH-TO-DATE'
     A  80                                  DSPATR(ND)
     A            MONTODAT       9A  B 18 17DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                 18 28'LAST-12-MONTHS'
     A  80                                  DSPATR(ND)
     A            LST12MONU      9A  B 18 43DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                 18 55'USED YESTERDAY'
     A  80                                  DSPATR(ND)
     A            USEDYEST       9A  B 18 70DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                 19  1'RECEIPTS:'
     A  80                                  DSPATR(ND)
     A                                 20  3'MONTH-TO-DATE'
     A  80                                  DSPATR(ND)
     A            RMONTODAT      9A  B 20 17DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                 20 28'LAST-12-MONTHS'
     A  80                                  DSPATR(ND)
     A            LST12MONR      9A  B 20 43DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                 20 55'RECD YESTERDAY'
     A  80                                  DSPATR(ND)
     A            RECDYEST       9A  B 20 70DSPATR(PR)
     A                                      OVRDTA
     A  80                                  DSPATR(ND)
     A                                 21  1'  PRESS  "f1"  FOR BASIC INQUIRY F-
     A                                      IELDS'
     A                                 21 46'"f5"  FOR LAST PO INQUIRY'
     A  80                                  DSPATR(ND)
     A                                 22 10'"f4"  FOR FULL DESCRIPTION'
     A                                 22 46'"f6"  FOR RESERVATION INQUIRY'
     A  80                                  DSPATR(ND)
     A                                 23 10'"f7"  FOR NEXT INQUIRY'
     A                                 23 46'"f3"  TO END PROGRAM'
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A                                 17 54'(USAGE PRIOR TO SAP)'
     A          R FMTLSTAT4
     A*%%TS  SD  19991111  104836  A257947     REL-V4R2M0  5769-PW1
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A N90                                  CF05
     A N90                                  CF06
     A                                      CF07
     A                                      CF08
     A                                      PUTOVR
     A                                  1 20'- - -   I T E M   S T A T U S   -'
     A                                  1 54'- -'
     A                                  1 75'MQ1-4'
     A                                  4  1'CODE'
     A                                 20  1'  PRESS  "f1"  FOR BASIC INQUIRY F-
     A                                      IELDS'
     A                                 20 48'"f2"  FOR MORE INQUIRY FIELDS'
     A                                 21 10'"f6"  FOR RESERVATION INQUIRY'
     A  90                                  DSPATR(ND)
     A                                 21 48'"f5"  FOR LAST PO INQUIRY'
     A  90                                  DSPATR(ND)
     A                                 22 10'"f7"  FOR NEXT INQUIRY'
     A                                 22 48'"f3"  TO END PROGRAM'
     A            COM            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            STRCODE        7A  B  4  6DSPATR(PR)
     A                                      OVRDTA
     A            DESC1         79A  B  5  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC2         79A  B  6  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC3         79A  B  7  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC4         79A  B  8  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC5         79A  B  9  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC6         79A  B 10  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC7         79A  B 11  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC8         79A  B 12  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC9         79A  B 13  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC10        79A  B 14  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC11        79A  B 15  1DSPATR(PR)
     A                                      OVRDTA
     A            DESC12        79A  B 16  1DSPATR(PR)
     A                                      OVRDTA
     A            DESCMSG       58A  B 18  6DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R FMTLSTAT5
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 14'- - - INSTRUCTIONS ON OBTAINING P.-
     A                                      O. INFORMATION - - -'
     A                                  1 76'MQ1-5'
     A                                  2 22'FOLLOW INSTRUCTIONS ON BOTTOM OF S-
     A                                      CREEN'
     A                                  5  1'P.O.-RCV SLIP INQUIRY BY CODE -- (-
     A                                      SELECT KEY TO RUN PROGRAM FROM MAST-
     A                                      ER MENU)'
     A                                  7  4'USE THIS INQUIRY TO LOOK AT ALL PU-
     A                                      RCHASE ORDERS FOR ANY CORP CODE'
     A                                  8  8'(a)  DETERMINE IF ANY ITEMS ARE RE-
     A                                      CEIVED BUT NOT STORED'
     A                                  9  8'(b)  OBTAIN PURCHASE ORDER NUMBER(-
     A                                      s)'
     A                                 11  1'PURCHASE ORDER INQUIRY BY P.O. --'
     A                                 11 35'(SELECT KEY TO RUN PROGRAM FROM MA-
     A                                      STER MENU)'
     A                                 13  4'USE THIS INQUIRY TO OBTAIN INFORMA-
     A                                      TION ON P.O. HEADER AND ITEMS'
     A                                 14  8'(a)  HEADER - ACCT. DATA, DELIVER'
     A                                 14 42'TO DATA, PO DATE, SHIP DATE, EXPEC-
     A                                      TED'
     A                                 15 22'DELIVERY DATE, VENDOR DATA.'
     A                                 16  8'(b)  ITEMS  - DESCRIPTION, PRICE,'
     A                                 16 42'QUANTITIES (ORDERED,RECEIVED,STORE-
     A                                      D),'
     A                                 17 22'DATE RECEIVED, DATE STORED.'
     A                                 19  1'  PRESS  "f1"  FOR BASIC INQUIRY F-
     A                                      IELDS     "f2"  FOR MORE INQUIRY FI-
     A                                      ELDS'
     A                                 20 10'"f4"  FOR FULL INQUIRY'
     A                                 21 10'"f6"  FOR RESERVATION INQUIRY'
     A                                 21 45'"f7"  FOR NEXT INQUIRY'
     A                                 22 10'"f3"  TO END PROGRAM'
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
