     A*****************************************************************
     A**                D I S P L A Y   F I L E
     A*****************************************************************
     A** FILE NAME  :  ZTPOINQCS
     A**
     A** DESCRIPTION:  PO INQUIRY BY CODE - SUBPGM
     A**
     A** AUTHOR     :  DAN RAUCH - EXLTECH, LLC
     A** CREATED    :  MAR 9, 2005
     A**
     A** FORMATS    :  CORP_CODE  INQUIRY
     A**
     A*****************************************************************
     A** COPIED FROM ZCSISINQ
     A*****************************************************************
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A          R CORP_CODE
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  6'P. O.    I N Q U I R Y    B Y    C'
     A                                  1 41'O R P O R A T E   C O D E'
     A                                  5  6'KEY IN THE CORPORATE CODE OR ALTER-
     A                                      NATE KEY TO INQUIRE ON AND:'
     A            CODE          12A  B  7 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            SORT           1A  B  9 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-TO EXIT                 -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A                                 12 15'A - PRESS "ENTER" TO SEARCH THE LI-
     A                                      VE DATABASE'
     A                                 14 36'OR'
     A                                 16 15'B - PRESS "F6" TO SEARCH THE HISTO-
     A                                      RY DATABASE'
     A                                 22  8'PRESS "F3" TO EXIT'
     A                                  9  6'SORT PO DATE IN ASCENDING,DESCENDI-
     A                                      NG, OR NO SORT (A,D,BLANK):'
     A          R INQUIRY
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  9'P. O.   I N Q U I R Y    B Y    C'
     A                                  1 43'O R P O R A T E   C O D E'
     A                                  3  1'CODE:'
     A                                  3 17'ONORDER:'
     A                                  3 40'UM:'
     A                                  3 50'BIN LOC:'
     A                                  5 32'************  QUANTITIES  ********-
     A                                      ** ** DATES **'
     A                                  6  3'PO.....-RLS-RS'
     A                                  6 33'ORDERED     DELIVERED      STORED'
     A                                  6 70'DLVR  STOR'
     A                                 22  1'ENTER "X" NEXT TO PO OR RCVR FOR I-
     A                                      NQUIRY'
     A                                 23  1'PRESS f3 TO EXIT.'
     A                                 23 34'PRESS f6 TO SWITCH TO LIVE/HISTORY-
     A                                       DATABASE'
     A            CODE           7A  B  3  7DSPATR(PR)
     A                                      OVRDTA
     A            ONORDER        8A  B  3 28DSPATR(PR)
     A                                      OVRDTA
     A            UM             2A  B  3 44DSPATR(PR)
     A                                      OVRDTA
     A            BINLOCATIO    12A  B  3 59DSPATR(PR)
     A                                      OVRDTA
     A            DESCRIPTIO    79A  B  4  1DSPATR(PR)
     A                                      OVRDTA
     A            INQ01          1   B  8  1OVRDTA
     A                                      OVRATR
     A N01                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            LINE1         77A  B  8  3DSPATR(PR)
     A                                      OVRDTA
     A            INQ02          1   B  9  1OVRDTA
     A                                      OVRATR
     A N02                                  DSPATR(UL)
     A  02                                  DSPATR(PR)
     A            LINE2         77A  B  9  3DSPATR(PR)
     A                                      OVRDTA
     A            INQ03          1   B 10  1OVRDTA
     A                                      OVRATR
     A N03                                  DSPATR(UL)
     A  03                                  DSPATR(PR)
     A            LINE3         77A  B 10  3DSPATR(PR)
     A                                      OVRDTA
     A            INQ04          1   B 11  1OVRDTA
     A                                      OVRATR
     A N04                                  DSPATR(UL)
     A  04                                  DSPATR(PR)
     A            LINE4         77A  B 11  3DSPATR(PR)
     A                                      OVRDTA
     A            INQ05          1   B 12  1OVRDTA
     A                                      OVRATR
     A N05                                  DSPATR(UL)
     A  05                                  DSPATR(PR)
     A            LINE5         77A  B 12  3DSPATR(PR)
     A                                      OVRDTA
     A            INQ06          1   B 13  1OVRDTA
     A                                      OVRATR
     A N06                                  DSPATR(UL)
     A  06                                  DSPATR(PR)
     A            LINE6         77A  B 13  3DSPATR(PR)
     A                                      OVRDTA
     A            INQ07          1   B 14  1OVRDTA
     A                                      OVRATR
     A N07                                  DSPATR(UL)
     A  07                                  DSPATR(PR)
     A            LINE7         77A  B 14  3DSPATR(PR)
     A                                      OVRDTA
     A            INQ08          1   B 15  1OVRDTA
     A                                      OVRATR
     A N08                                  DSPATR(UL)
     A  08                                  DSPATR(PR)
     A            LINE8         77A  B 15  3DSPATR(PR)
     A                                      OVRDTA
     A            INQ09          1   B 16  1OVRDTA
     A                                      OVRATR
     A N09                                  DSPATR(UL)
     A  09                                  DSPATR(PR)
     A            LINE9         77A  B 16  3DSPATR(PR)
     A                                      OVRDTA
     A            INQ10          1   B 17  1OVRDTA
     A                                      OVRATR
     A N10                                  DSPATR(UL)
     A  10                                  DSPATR(PR)
     A            LINE10        77A  B 17  3DSPATR(PR)
     A                                      OVRDTA
     A            INQ11          1   B 18  1OVRDTA
     A                                      OVRATR
     A N11                                  DSPATR(UL)
     A  11                                  DSPATR(PR)
     A            LINE11        77A  B 18  3DSPATR(PR)
     A                                      OVRDTA
     A            INQ12          1   B 19  1OVRDTA
     A                                      OVRATR
     A N12                                  DSPATR(UL)
     A  12                                  DSPATR(PR)
     A            LINE12        77A  B 19  3DSPATR(PR)
     A                                      OVRDTA
     A            CONTINUATI    79A  B 20  1DSPATR(PR)
     A                                      OVRDTA
     A            HISTMSG       23A  B 22 50DSPATR(HI)
     A                                      DSPATR(BL)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f7-NEW CODE f3-EXIT PROGRAM-
     A                                       f6-SWITCH DATABASES               -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A                                  6 19'ITEM'
     A                                  6 24'UM'
     A                                  6  1'X'
