     A*%%TS  SD  19941019  143910  A257947     REL-V2R3M0  5738-PW1
     A*            22:56:39    T881S28     VTRNSINQ.HPTO38.CME
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A          R TRANSHDR
     A*%%TS  SD  19941019  143910  A257947     REL-V2R3M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 22'CORPORATE STORES ACCOUNTING SYSTEM'
     A                                  1 74'SQ1-1'
     A                                  2 29'TRANSACTION INQUIRY'
     A                                  4 12'ENTER MATERIAL CODE OR PO NUMBER A-
     A                                      ND PRESS "ENTER"'
     A                                  5 12'-----------------------------------
     A                                      ----------------'
     A                                  6 12':'
     A                                  6 61':'
     A                                  7 12':      MATERIAL CODE'
     A                                  7 61':'
     A                                  8 12':'
     A                                  8 61':'
     A                                  9 12':'
     A                                  9 61':'
     A                                 10 12':'
     A                                 10 61':'
     A                                 11 12':                             '
     A                                 11 61':'
     A                                 13 12':                                 -
     A                                                     :'
     A                                 15 12':'
     A                                 15 61':'
     A                                 16 12':  TO ALSO VIEW PREVIOUS MONTH(S)'
     A                                 16 46'OPEN RECEIVER  :'
     A                                 17 12':  AND INVOICE TRANSACTIONS  ENTER'
     A                                 17 47'AN "X"  '
     A                                 17 61':'
     A            CODE          12A  B  7 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            ORDERNO        7A  B 12 43DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            REL            3Y 0B 12 53DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            X              1A  B 17 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES('X' ' ')
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-END PROGRAM             -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A                                  8 19'(OR RAW MATERIAL NAME)'
     A                                 10 34'- O R -'
     A                                 12 12':'
     A                                 12 19'PURCHASE ORDER NUMBER'
     A                                 12 61':'
     A                                 19 12'-----------------------------------
     A                                      ----------------'
     A                                 14 12'-----------------------------------
     A                                      ----------------'
     A                                 18 12':'
     A                                 18 61':'
     A          R RDSF                      SFL
     A*  90/03/20  11:01:28    A034675     REL-R01M02  5728-PW1
     A            DETAIL        79A  B 11  2DSPATR(PR)
     A          R RDSC                      SFLCTL(RDSF)
     A                                      CF03(03)
     A                                      OVERLAY
     A  75                                  SFLDSP
     A  76                                  SFLDSPCTL
     A  77                                  SFLCLR
     A N74                                  SFLEND
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(0010)
     A                                  1 23'CORPORATE STORES ACCOUNTING SYSTEM'
     A                                  1 75'SQ1-2'
     A                                  2 30'TRANSACTION INQUIRY'
     A                                  8  2'TC   QUANTITY'
     A                                  8 24'VALUE'
     A                                  8 48'RCV ITEM ACCT   DEPT    DATE   UM'
     A                                  9  7'BAL. QUANTITY'
     A                                  9 36'DOCUMENT #'
     A            HEADER1       40A  B  4  1DSPATR(PR)
     A            HEADER2       18A  B  5  1DSPATR(PR)
     A            DESCR         79A  B  6  1DSPATR(PR)
     A            POCODELIT     10A  B  8 35DSPATR(PR)
     A          R RDSB
     A                                 23  1'"f3" RETURN TO PREV SCREEN    '
