     A*  90/06/14  10:30:32    T000144     REL-R02M00  5728-PW1
     A*            11:33:55    T881S28     VUDCDOCK.HPTO38.CME
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A                                      INVITE
     A          R TESTNUM
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A            PRESQTY       12Y04B  9 60DSPATR(MDT)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26
     AO 97 96                               DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-EXIT AND PROCESS f7-EXIT-
     A                                      -NO PROCESS f3-END PROGRAM         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
