     A*  90/01/08  10:15:18    T000144     REL-R01M02  5728-PW1
     A*            22:57:43    T881S28     VUDCACCT.HPTO38.CME
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A          R DEACC1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 20'V A L I D   P L A N T   D A T A'
     A                                  1 75'MP2-1'
     A                                  4 20'f1 - ADD DEPARTMENT CODES'
     A                                  6 20'f2 - DELETE DEPARTMENT CODES'
     A                                  8 20'f8 - ADD EXPENSE CLASS CODES'
     A                                 10 20'f4 - DELETE EXPENSE CLASS CODES'
     A                                 12 20'f5 - ADD NEW WORK CODES'
     A                                 14 20'f6 - DELETE NEW WORK CODES'
     A                                 18  3'PRESS:  DESIRED FUNCTION KEY'
     A                                 19 11'"f7" TO PRINT SCREEN'
     A                                 20 11'"f3" TO END PROGRAM'
     A            COM            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-ADD DEPT f2-DELETE DEPT -
     A                                      f8-ADD EXP CLS f4-DELETE EXP CLS f5-
     A                                      -ADD NW CODES f6-')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R DEACC2
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 19'A D D   D E P A R T M E N T   C O'
     A                                  1 53'D E S'
     A                                  1 75'MP2-2'
     A                                  7 14'DEPARTMENT CODE'
     A                                 19  5'PRESS  "ENTER" TO PROCESS'
     A                                 20 12'"f5" TO PRINT SCREEN'
     A                                 21 12'"f3" TO RETURN TO REQUEST SCREEN'
     A            COM            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  7 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R DEACC3
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 15'D E L E T E   D E P A R T M E N T'
     A                                  1 51'C O D E S'
     A                                  1 75'MP2-3'
     A                                  7 14'DEPARTMENT CODE'
     A                                 19  5'PRESS  "ENTER" TO PROCESS'
     A                                 20 12'"f5" TO PRINT SCREEN'
     A                                 21 12'"f3" TO RETURN TO REQUEST SCREEN'
     A            COM            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  7 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R DEACC4
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 17'A D D   E X P E N S E   C L A S S'
     A                                  1 53'C O D E S'
     A                                  1 75'MP2-4'
     A                                  7 12'EXPENSE CLASS CODE'
     A                                 19  5'PRESS  "ENTER" TO PROCESS'
     A                                 20 12'"f5" TO PRINT SCREEN'
     A                                 21 12'"f3" TO RETURN TO REQUEST SCREEN'
     A            COM            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            EXPCDE         6Y 0B  7 32DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R DEACC5
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 13'D E L E T E   E X P E N S E   C L'
     A                                  1 47'A S S   C O D E S'
     A                                  1 76'MP2-5'
     A                                  7 10'EXPENSE CLASS CODE'
     A                                 19  5'PRESS  "ENTER" TO PROCESS'
     A                                 20 12'"f5" TO PRINT SCREEN'
     A                                 21 12'"f3" TO RETURN TO REQUEST SCREEN'
     A            COM            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            EXPCLS         6Y 0B  7 30DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R DEACC6
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 20'A D D   N E W   W O R K   C O D E'
     A                                  1 54'S'
     A                                  1 75'MP2-6'
     A                                  7 16'NEW WORK CODE'
     A                                 19  5'PRESS  "ENTER" TO PROCESS'
     A                                 20 12'"f5" TO PRINT SCREEN'
     A                                 21 12'"f3" TO RETURN TO REQUEST SCREEN'
     A            COM            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            NWKCDE         6Y 0B  7 31DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R DEACC7
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 16'D E L E T E   N E W   W O R K   C'
     A                                  1 50'O D E S'
     A                                  1 75'MP2-7'
     A                                  7 16'NEW WORK CODE'
     A                                 19  5'PRESS  "ENTER" TO PROCESS'
     A                                 20 12'"f5" TO PRINT SCREEN'
     A                                 21 12'"f3" TO RETURN TO REQUEST SCREEN'
     A            COM            3A  B  1  2DSPATR(PR)
     A                                      OVRDTA
     A            NWKCDE         6Y 0B  7 31DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R UDCACCT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 10'-----------------------------------
     A                                      -------------------'
     A                                  2 10'¦'
     A                                  2 62'¦'
     A                                  3 10'¦     A C C O U N T I N G   M A S'
     A                                  3 44'T E R   M E N U   ¦'
     A                                  4 10'¦'
     A                                  4 62'¦'
     A                                  5 10'-----------------------------------
     A                                      -------------------'
     A                                  9  1'KEY'
     A                                  9 13'PROGRAMS'
     A                                  9 44'KEY'
     A                                  9 55'INQUIRIES'
     A                                 10  1'---'
     A                                 10 13'--------'
     A                                 10 44'---'
     A                                 10 55'---------'
     A                                 11  1'VQ1   MASTER VENDOR MENU'
     A                                 11 44'Q1   MATERIAL STATUS INQUIRY'
     A                                 12 44'Q2   PURCHASE ORDER INQUIRY BY PO'
     A                                 13  1'AD1   UPDATE ACCOUNTING DATA (DP,E-
     A                                      C,NW)    Q3   RECEIVING SLIP INQUIR-
     A                                      Y'
     A                                 14  1'AD2   VALID ACCOUNTING DATA LISTIN-
     A                                      G'
     A                                 14 44'Q4   P.O. - RCV SLIP INQUIRY BY CO-
     A                                      DE'
     A                                 15 44'Q5   PO INQUIRY BY VENDOR CODE'
     A                                 16  1'RC3   CORRECT FREIGHT INFORMATION'
     A                                 16 44'Q6   VENDOR INQUIRY'
     A                                 21  1'TYPE KEY AND PRESS "ENTER":'
     A            KEY            3A  B 21 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-EXIT                    -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
