     A*%%TS  SD  20030430  201526  A257947     REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A          R REQSFL                    SFL
     A*%%TS  SD  20030429  105956  A257947     REL-V5R2M0  5722-WDS
     A            REQLINE       12A  B  6 14DSPATR(PR)
     A          R REQSFLC                   SFLCTL(REQSFL)
     A*%%TS  SD  20030429  105956  A257947     REL-V5R2M0  5722-WDS
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(0016)
     A                                      CF03(03 'EXIT')
     A                                      OVERLAY
     A                                      PUTOVR
     A  70                                  SFLDSP
     A  71                                  SFLDSPCTL
     A  72                                  SFLCLR
     A  73                                  SFLEND(*MORE)
     A                                  2 14'R E C E I P T   N O T I F I C A T -
     A                                      I O N   R E P O R T'
     A                                      DSPATR(HI)
     A                                  3 31'REQUISITION LISTING'
     A                                  5 14'REQ NUMBER'
     A                                      DSPATR(UL)
     A          R REQREC
     A*%%TS  SD  20030429  105956  A257947     REL-V5R2M0  5722-WDS
     A                                 23  2'F3=EXIT'
     A          R REQSCRN
     A*%%TS  SD  20030430  201526  A257947     REL-V5R2M0  5722-WDS
     A                                      CF01(03 'CHG USER')
     A                                      CF03(03)
     A                                      CF04(04 'LIST REQS')
     A                                      PUTOVR
     A                                  2 14'R E C E I P T   N O T I F I C A T -
     A                                      I O N   R E P O R T'
     A                                      DSPATR(HI)
     A                                  4  2'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                  5  4'TO ADD A REQUISITION, TYPE THE REQ-
     A                                      UISITION NUMBER, AND PRESS ENTER.'
     A                                  7  4'TO CHANGE THE EXPEDITE USER-ID, TY-
     A                                      PE THE USER-ID IN THE SPACE PROVIDE-
     A                                      D,'
     A                                  8  4'AND PRESS F1.'
     A                                 10  4'TO LIST ACTIVE REQUISITIONS, PRESS-
     A                                       F4.'
     A                                 11  3'-----------------------------------
     A                                      ------------------------------------
     A                                      -------'
     A                                 13 25'REQUISITION NUMBER:'
     A            REQNUM        12A  B 13 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(PC)
     A  20                                  DSPATR(RI)
     A                                 15 10'USER-ID TO NOTIFY FOR REQUISITION:'
     A            USERID        10A  B 15 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(PC)
     A  21                                  DSPATR(RI)
     A                                 23  3'F3=EXIT'
     A                                 23 13'F1=CHANGE USER-ID'
     A                                 23 33'F4=LIST REQS'
     A  60        MSGLINE       78   M      OVRDTA
