     A*%%TS  SD  19970529  110102  A257947     REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A          R CHGSCRN
     A*%%TS  SD  19970527  093352  A257947     REL-V3R7M0  5716-PW1
     A                                      CA02(02 'NEXT')
     A                                      CA03(03)
     A                                      CA05(05 'UM')
     A                                      PUTOVR
     A                                  2 22'RE-TRANSMIT CORPORATE PURCHASE ORD-
     A                                      ERS'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  4  3'Type new Unit of Measure for Quant-
     A                                      ity and/or Price and press the Ente-
     A                                      r key:'
     A                                  6 19'Purchase Order:'
     A            PONUM          7A  B  6 36OVRDTA
     A                                      DSPATR(PR)
     A            RLSE           3A  B  6 44OVRDTA
     A                                      DSPATR(PR)
     A                                  6 50'Item:'
     A            ITEM           4A  B  6 57OVRDTA
     A                                      DSPATR(PR)
     A                                  8 19'Requisition #:'
     A            REQ           10A  B  8 36OVRDTA
     A                                      DSPATR(PR)
     A                                  8 50'Code:'
     A            CODE           7A  B  8 57OVRDTA
     A                                      DSPATR(PR)
     A                                 10 19'Quantity:'
     A            QTY           14A  B 10 29OVRDTA
     A                                      DSPATR(PR)
     A            QTYUM          2A  B 10 44OVRDTA
     A                                      DSPATR(PR)
     A                                 10 50'New UM:'
     A                                      DSPATR(HI)
     A            NEWQTYUM       2A  B 10 59DSPATR(UL)
     A                                      OVRATR
     A                                      OVRDTA
     A  11                                  DSPATR(PC)
     A  23                                  DSPATR(RI)
     A                                 12 19'Price:'
     A            PRICE         14A  B 12 29OVRDTA
     A                                      DSPATR(PR)
     A            PRICEUM        2A  B 12 44OVRDTA
     A                                      DSPATR(PR)
     A                                 12 50'New UM:'
     A                                      DSPATR(HI)
     A            NEWPRICEUM     2A  B 12 59DSPATR(UL)
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 24  3'F1=HELP'
     A                                 24 15'F2=NEXT PO'
     A                                 24 30'F3=CANCEL'
     A            F5KEY         13   B 24 44DSPATR(PR)
     A  99        MSGLINE       78   M      OVRDTA
     A          R UMSCRN
     A*%%TS  SD  19970529  110102  A257947     REL-V3R7M0  5716-PW1
     A                                      CA03(03)
     A                                      PUTOVR
     A                                  2 16'ADD ALTERNATE UNIT OF MEASURE & CO-
     A                                      NVERSION FACTOR'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  4  4'Enter alternate unit of measure an-
     A                                      d conversion factor:'
     A                                  6 16'Code:'
     A            CODE           7A  B  6 23DSPATR(PR)
     A                                  6 33'UM:'
     A            UM             2A  B  6 38DSPATR(PR)
     A                                  8 43'Conv Factor'
     A                                      DSPATR(UL)
     A                                 10 32'UM1:'
     A            UM1            2A  B 10 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A  20                                  DSPATR(PR)
     A            CONUM1        10Y 4B 10 43EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A  20                                  DSPATR(PR)
     A                                 12 32'UM2:'
     A            UM2            2A  B 12 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A  21                                  DSPATR(PR)
     A            CONUM2        10Y 4B 12 43EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A  21                                  DSPATR(PR)
     A                                 24  4'F3=EXIT'
     A  99        MSGLINE       78   M      OVRDTA
     A          R POINQSFL                  SFL
     A*%%TS  SD  19970523  153426  A257947     REL-V3R7M0  5716-PW1
     A            SELECT         1A  B  6  2DSPATR(UL)
     A                                      VALUES('C' 'R' 'X' ' ')
     A            DTLLINE       76A  B  6  4DSPATR(PR)
     A            RECNUM         4S 0H
     A          R POINQSFLC                 SFLCTL(POINQSFL)
     A*%%TS  SD  19970523  153426  A257947     REL-V3R7M0  5716-PW1
     A                                      CHGINPDFT
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(0015)
     A                                      SFLCSRRRN(&RELRCD)
     A                                      CA03(03 'EXIT')
     A                                      OVERLAY
     A                                      PUTOVR
     A  70                                  SFLDSP
     A  71                                  SFLDSPCTL
     A  72                                  SFLCLR
     A  73                                  SFLEND(*MORE)
     A N73                                  ROLLUP(75)
     A            RELRCD         5S 0H
     A            DSPREC         4S 0H      SFLRCDNBR(CURSOR)
     A                                  1 22'RE-TRANSMIT CORPORATE PURCHASE ORD-
     A                                      ERS'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  3  8'ERROR'
     A                                  3 30'PO'
     A                                  4 28'NUMBER'
     A                                  5 26'-----------'
     A                                  4  8'DATE'
     A                                  5  6'--------'
     A                                  4 38'ITEM'
     A                                  5 38'----'
     A                                  4 59'ERROR'
     A                                  4  4'R'
     A                                  5  4'-'
     A                                  3 18'REQ'
     A                                  4 17'NUMBER'
     A                                  5 15'----------'
     A                                  5 43'-----------------------------------
     A                                      ---'
     A          R POINQREC
     A*%%TS  SD  19970523  153426  A257947     REL-V3R7M0  5716-PW1
     A                                      PUTOVR
     A                                 22 16'OPTIONS:'
     A                                      DSPATR(UL)
     A                                 22 27'R'
     A                                      DSPATR(HI)
     A                                 22 29'= Re-transmit to CSIS'
     A                                 22 52'(* = Marked for Re-transmit)'
     A                                 23 27'C'
     A                                      DSPATR(HI)
     A                                 23 29'= Cancel Re-transmit'
     A                                 24  2'F3=EXIT'
     A                                 24 27'X'
     A                                      DSPATR(HI)
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A                                 24 29'= Update Purchase Order'
