     A*%%TS  SD  20010227  085828  A257947     REL-V4R4M0  5769-PW1
     A*  91/03/07  14:25:45    A171523     REL-R03M00  5728-PW1
     A*            13:02:39    T881S28     VCSISINQ.HPTO38.CME
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A  98                                  INVITE
     A                                      PRINT
     A          R CORP_CODE
     A*%%TS  SD  20010222  141506  A257947     REL-V4R4M0  5769-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  9'O P E N   P U R C H A S E   O R D -
     A                                      E R   P R I C E   U P D A T E'
     A                                      DSPATR(HI)
     A                                  5  9'ENTER THE CORPORATE CODE OR ALTERN-
     A                                      ATE KEY:'
     A            CODE          12A  B  5 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                  7  9'ENTER NEW MARKET COST:'
     A            MARKETCOST    15Y 4B  7 33EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                  7 53'UM:'
     A            UM             2A  B  7 58DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                  9  9'CURRENCY CODE:'
     A            CURRENCY       2A  B  9 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                 12  9'PRESS ENTER TO REVIEW AFFECTED PUR-
     A                                      CHASE ORDERS.'
     A                                 22  3'ENTER=CONTINUE'
     A                                 22 22'F3=EXIT'
     A            COMMANDLN1    79A  B 24  1DFTVAL('f3-TO EXIT                 -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R INQUIRY
     A*%%TS  SD  20010227  085828  A257947     REL-V4R4M0  5769-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF07
     A                                  1  9'O P E N   P U R C H A S E   O R D -
     A                                      E R   P R I C E   U P D A T E'
     A                                      DSPATR(HI)
     A                                  2  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ------'
     A                                      DSPATR(HI)
     A                                  3  2'CODE:'
     A            CODE           7A  B  3  8DSPATR(PR)
     A                                      OVRDTA
     A                                      DSPATR(HI)
     A            DESCRIPTIO    60A  B  3 17DSPATR(PR)
     A                                      OVRDTA
     A                                  4  2'PREV MKT COST:'
     A            MARKETCOST    15Y 4B  4 17EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A            UM             2A  B  4 34DSPATR(PR)
     A                                      OVRDTA
     A                                  4 40'CURRENCY:'
     A            CURDESC       12A  B  4 50DSPATR(PR)
     A                                      OVRDTA
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ------'
     A                                      DSPATR(HI)
     A                                  6  3'NEW MKT COST:'
     A            NEWMKT        15Y 4B  6 17EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A            UMB            2A  B  6 34DSPATR(PR)
     A                                      OVRDTA
     A                                  6 40'UM1:'
     A            NEWMKT1       15Y 4B  6 45EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A            UM1            2A  B  6 62DSPATR(PR)
     A                                      OVRDTA
     A                                  7  3'TYPE "UPD" TO UPDATE ==>'
     A            UPDATE         3A  B  7 28OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      DSPATR(PC)
     A                                      VALUES('   ' 'UPD' 'upd')
     A                                  7 40'UM2:'
     A            NEWMKT2       15Y 4B  7 45EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A            UM2            2A  B  7 62DSPATR(PR)
     A                                      OVRDTA
     A                                  8  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ------'
     A                                      DSPATR(HI)
     A                                  9  2'AFFECTED PURCHASE ORDERS:'
     A                                  9 30'(TYPE "X" NEXT TO PO FOR INQUIRY)'
     A                                 10  4'X PO NUM -RLS  ITEM    UM       OR-
     A                                      DERED     DELIVERED      UNPAID  '
     A                                      DSPATR(HI)
     A            INQ01          1A  B 11  4OVRDTA
     A                                      OVRATR
     A N01                                  DSPATR(UL)
     A  01                                  DSPATR(PR)
     A            LINE1         70A  B 11  6DSPATR(PR)
     A                                      OVRDTA
     A            INQ02          1A  B 12  4OVRDTA
     A                                      OVRATR
     A N02                                  DSPATR(UL)
     A  02                                  DSPATR(PR)
     A            LINE2         70A  B 12  6DSPATR(PR)
     A                                      OVRDTA
     A            INQ03          1A  B 13  4OVRDTA
     A                                      OVRATR
     A N03                                  DSPATR(UL)
     A  03                                  DSPATR(PR)
     A            LINE3         70A  B 13  6DSPATR(PR)
     A                                      OVRDTA
     A            INQ04          1A  B 14  4OVRDTA
     A                                      OVRATR
     A N04                                  DSPATR(UL)
     A  04                                  DSPATR(PR)
     A            LINE4         70A  B 14  6DSPATR(PR)
     A                                      OVRDTA
     A            INQ05          1A  B 15  4OVRDTA
     A                                      OVRATR
     A N05                                  DSPATR(UL)
     A  05                                  DSPATR(PR)
     A            LINE5         70A  B 15  6DSPATR(PR)
     A                                      OVRDTA
     A            INQ06          1A  B 16  4OVRDTA
     A                                      OVRATR
     A N06                                  DSPATR(UL)
     A  06                                  DSPATR(PR)
     A            LINE6         70A  B 16  6DSPATR(PR)
     A                                      OVRDTA
     A            INQ07          1A  B 17  4OVRDTA
     A                                      OVRATR
     A N07                                  DSPATR(UL)
     A  07                                  DSPATR(PR)
     A            LINE7         70A  B 17  6DSPATR(PR)
     A                                      OVRDTA
     A            INQ08          1A  B 18  4OVRDTA
     A                                      OVRATR
     A N08                                  DSPATR(UL)
     A  08                                  DSPATR(PR)
     A            LINE8         70A  B 18  6DSPATR(PR)
     A                                      OVRDTA
     A            INQ09          1A  B 19  4OVRDTA
     A                                      OVRATR
     A N09                                  DSPATR(UL)
     A  09                                  DSPATR(PR)
     A            LINE9         70A  B 19  6DSPATR(PR)
     A                                      OVRDTA
     A            INQ10          1A  B 20  4OVRDTA
     A                                      OVRATR
     A N10                                  DSPATR(UL)
     A  10                                  DSPATR(PR)
     A            LINE10        70A  B 20  6DSPATR(PR)
     A                                      OVRDTA
     A            INQ11          1A  B 21  4OVRDTA
     A                                      OVRATR
     A N11                                  DSPATR(UL)
     A  11                                  DSPATR(PR)
     A            LINE11        70A  B 21  6DSPATR(PR)
     A                                      OVRDTA
     A            INQ12          1A  B 22  4OVRDTA
     A                                      OVRATR
     A N12                                  DSPATR(UL)
     A  12                                  DSPATR(PR)
     A            LINE12        70A  B 22  6DSPATR(PR)
     A                                      OVRDTA
     A                                 23  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ------'
     A                                      DSPATR(HI)
     A            COMMANDLN1    36A  B 24  1DFTVAL('ENTER=PROCESS  F3=EXIT  F7=-
     A                                      NEXT CODE')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A            CONTINUATI    30A  B 24 39DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
