     A*%%TS  SD  19931214  082429  A193138     REL-V2R2M0  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A  98                                  INVITE
     A                                      PRINT
     A          R USER
     A*%%TS  SD  19931214  082429  A193138     REL-V2R2M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  3  2'USER:'
     A            SELUSER       16A  B  3  8OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(UL)
     A  50                                  DSPATR(PC)
     A  60
     AON50                                  DSPATR(PR)
     A  60                                  DSPATR(RI)
     A                                  5  3'Display Station'
     A                                  5 23'Printer 1'
     A                                  5 35'Printer 2'
     A                                  5 47'Printer 3'
     A                                  5 59'Printer 4'
     A                                  5 71'Printer 5'
     A            SELA           1A  B  6  4OVRATR
     A                                      OVRDTA
     A N31                                  DSPATR(UL)
     A  61
     AO 31                                  DSPATR(PR)
     A            DSPA          10A  B  6  6OVRDTA
     A                                      OVRATR
     A  61
     AO 01                                  DSPATR(PR)
     A  16                                  DSPATR(UL)
     A  16                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A            PA1            4Y 0B  6 25OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  61
     AO 01                                  DSPATR(PR)
     A  61                                  DSPATR(RI)
     A  16                                  DSPATR(UL)
     A            PA2            4Y 0B  6 37OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  61
     AO 01                                  DSPATR(PR)
     A  61                                  DSPATR(RI)
     A  16                                  DSPATR(UL)
     A            PA3            4Y 0B  6 49OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  61
     AO 01                                  DSPATR(PR)
     A  61                                  DSPATR(RI)
     A  16                                  DSPATR(UL)
     A            PA4            4Y 0B  6 61OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  61
     AO 01                                  DSPATR(PR)
     A  61                                  DSPATR(RI)
     A  16                                  DSPATR(UL)
     A            PA5            4Y 0B  6 73OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  61
     AO 01                                  DSPATR(PR)
     A  61                                  DSPATR(RI)
     A  16                                  DSPATR(UL)
     A            SELB           1A  B  7  4OVRATR
     A                                      OVRDTA
     A N32                                  DSPATR(UL)
     A  62
     AO 32                                  DSPATR(PR)
     A            DSPB          10A  B  7  6OVRDTA
     A                                      OVRATR
     A  62
     AO 02                                  DSPATR(PR)
     A  62                                  DSPATR(RI)
     A  17                                  DSPATR(UL)
     A  17                                  DSPATR(PC)
     A            PB1            4Y 0B  7 25OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  62
     AO 02                                  DSPATR(PR)
     A  62                                  DSPATR(RI)
     A  17                                  DSPATR(UL)
     A            PB2            4Y 0B  7 37OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  62
     AO 02                                  DSPATR(PR)
     A  62                                  DSPATR(RI)
     A  17                                  DSPATR(UL)
     A            PB3            4Y 0B  7 49OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  62
     AO 02                                  DSPATR(PR)
     A  62                                  DSPATR(RI)
     A  17                                  DSPATR(UL)
     A            PB4            4Y 0B  7 61OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  62
     AO 02                                  DSPATR(PR)
     A  62                                  DSPATR(RI)
     A  17                                  DSPATR(UL)
     A            PB5            4Y 0B  7 73OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  62
     AO 02                                  DSPATR(PR)
     A  62                                  DSPATR(RI)
     A  17                                  DSPATR(UL)
     A            SELC           1A  B  8  4OVRATR
     A                                      OVRDTA
     A N33                                  DSPATR(UL)
     A  63
     AO 33                                  DSPATR(PR)
     A            DSPC          10A  B  8  6OVRDTA
     A                                      OVRATR
     A  63
     AO 03                                  DSPATR(PR)
     A  18                                  DSPATR(UL)
     A  18                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A            PC1            4Y 0B  8 25OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  63
     AO 03                                  DSPATR(PR)
     A  18                                  DSPATR(UL)
     A  63                                  DSPATR(RI)
     A            PC2            4Y 0B  8 37OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  63
     AO 03                                  DSPATR(PR)
     A  18                                  DSPATR(UL)
     A  63                                  DSPATR(RI)
     A            PC3            4Y 0B  8 49OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  63
     AO 03                                  DSPATR(PR)
     A  18                                  DSPATR(UL)
     A  63                                  DSPATR(RI)
     A            PC4            4Y 0B  8 61OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  63
     AO 03                                  DSPATR(PR)
     A  18                                  DSPATR(UL)
     A  63                                  DSPATR(RI)
     A            PC5            4Y 0B  8 73OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  63
     AO 03                                  DSPATR(PR)
     A  18                                  DSPATR(UL)
     A  63                                  DSPATR(RI)
     A            SELD           1A  B  9  4OVRATR
     A                                      OVRDTA
     A N34                                  DSPATR(UL)
     A  64
     AO 34                                  DSPATR(PR)
     A            DSPD          10A  B  9  6OVRDTA
     A                                      OVRATR
     A  64
     AO 04                                  DSPATR(PR)
     A  19                                  DSPATR(UL)
     A  19                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A            PD1            4Y 0B  9 25OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  64
     AO 04                                  DSPATR(PR)
     A  19                                  DSPATR(UL)
     A  64                                  DSPATR(RI)
     A            PD2            4Y 0B  9 37OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  64
     AO 04                                  DSPATR(PR)
     A  19                                  DSPATR(UL)
     A  64                                  DSPATR(RI)
     A            PD3            4Y 0B  9 49OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  64
     AO 04                                  DSPATR(PR)
     A  19                                  DSPATR(UL)
     A  64                                  DSPATR(RI)
     A            PD4            4Y 0B  9 61OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  64
     AO 04                                  DSPATR(PR)
     A  19                                  DSPATR(UL)
     A  64                                  DSPATR(RI)
     A            PD5            4Y 0B  9 73OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  64
     AO 04                                  DSPATR(PR)
     A  19                                  DSPATR(UL)
     A  64                                  DSPATR(RI)
     A            SELE           1A  B 10  4OVRATR
     A                                      OVRDTA
     A N35                                  DSPATR(UL)
     A  65
     AO 35                                  DSPATR(PR)
     A            DSPE          10A  B 10  6OVRDTA
     A                                      OVRATR
     A  65
     AO 05                                  DSPATR(PR)
     A  20                                  DSPATR(UL)
     A  20                                  DSPATR(PC)
     A  65                                  DSPATR(RI)
     A            PE1            4Y 0B 10 25OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  65
     AO 05                                  DSPATR(PR)
     A  20                                  DSPATR(UL)
     A  65                                  DSPATR(RI)
     A            PE2            4Y 0B 10 37OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  65
     AO 05                                  DSPATR(PR)
     A  20                                  DSPATR(UL)
     A  65                                  DSPATR(RI)
     A            PE3            4Y 0B 10 49OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  65
     AO 05                                  DSPATR(PR)
     A  20                                  DSPATR(UL)
     A  65                                  DSPATR(RI)
     A            PE4            4Y 0B 10 61OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  65
     AO 05                                  DSPATR(PR)
     A  20                                  DSPATR(UL)
     A  65                                  DSPATR(RI)
     A            PE5            4Y 0B 10 73OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  65
     AO 05                                  DSPATR(PR)
     A  20                                  DSPATR(UL)
     A  65                                  DSPATR(RI)
     A            SELF           1A  B 11  4OVRATR
     A                                      OVRDTA
     A N36                                  DSPATR(UL)
     A  66
     AO 36                                  DSPATR(PR)
     A            DSPF          10A  B 11  6OVRDTA
     A                                      OVRATR
     A  66
     AO 06                                  DSPATR(PR)
     A  21                                  DSPATR(UL)
     A  21                                  DSPATR(PC)
     A  66                                  DSPATR(RI)
     A            PF1            4Y 0B 11 25OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  66
     AO 06                                  DSPATR(PR)
     A  21                                  DSPATR(UL)
     A  66                                  DSPATR(RI)
     A            PF2            4Y 0B 11 37OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  66
     AO 06                                  DSPATR(PR)
     A  21                                  DSPATR(UL)
     A  66                                  DSPATR(RI)
     A            PF3            4Y 0B 11 49OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  66
     AO 06                                  DSPATR(PR)
     A  21                                  DSPATR(UL)
     A  66                                  DSPATR(RI)
     A            PF4            4Y 0B 11 61OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  66
     AO 06                                  DSPATR(PR)
     A  21                                  DSPATR(UL)
     A  66                                  DSPATR(RI)
     A            PF5            4Y 0B 11 73OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  66
     AO 06                                  DSPATR(PR)
     A  21                                  DSPATR(UL)
     A  66                                  DSPATR(RI)
     A            SELG           1A  B 12  4OVRATR
     A                                      OVRDTA
     A N37                                  DSPATR(UL)
     A  67
     AO 37                                  DSPATR(PR)
     A            DSPG          10A  B 12  6OVRDTA
     A                                      OVRATR
     A  67
     AO 07                                  DSPATR(PR)
     A  22                                  DSPATR(UL)
     A  22                                  DSPATR(PC)
     A  67                                  DSPATR(RI)
     A            PG1            4Y 0B 12 25OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  67
     AO 07                                  DSPATR(PR)
     A  22                                  DSPATR(UL)
     A  67                                  DSPATR(RI)
     A            PG2            4Y 0B 12 37OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  67
     AO 07                                  DSPATR(PR)
     A  22                                  DSPATR(UL)
     A  67                                  DSPATR(RI)
     A            PG3            4Y 0B 12 49OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  67
     AO 07                                  DSPATR(PR)
     A  22                                  DSPATR(UL)
     A  67                                  DSPATR(RI)
     A            PG4            4Y 0B 12 61OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  67
     AO 07                                  DSPATR(PR)
     A  22                                  DSPATR(UL)
     A  67                                  DSPATR(RI)
     A            PG5            4Y 0B 12 73OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  67
     AO 07                                  DSPATR(PR)
     A  22                                  DSPATR(UL)
     A  67                                  DSPATR(RI)
     A            SELH           1A  B 13  4OVRATR
     A                                      OVRDTA
     A N38                                  DSPATR(UL)
     A  68
     AO 38                                  DSPATR(PR)
     A            DSPH          10A  B 13  6OVRDTA
     A                                      OVRATR
     A  68
     AO 08                                  DSPATR(PR)
     A  23                                  DSPATR(UL)
     A  23                                  DSPATR(PC)
     A  68                                  DSPATR(RI)
     A            PH1            4Y 0B 13 25OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  68
     AO 08                                  DSPATR(PR)
     A  23                                  DSPATR(UL)
     A  68                                  DSPATR(RI)
     A            PH2            4Y 0B 13 37OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  68
     AO 08                                  DSPATR(PR)
     A  23                                  DSPATR(UL)
     A  68                                  DSPATR(RI)
     A            PH3            4Y 0B 13 49OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  68
     AO 08                                  DSPATR(PR)
     A  23                                  DSPATR(UL)
     A  68                                  DSPATR(RI)
     A            PH4            4Y 0B 13 61OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  68
     AO 08                                  DSPATR(PR)
     A  23                                  DSPATR(UL)
     A  68                                  DSPATR(RI)
     A            PH5            4Y 0B 13 73OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  68
     AO 08                                  DSPATR(PR)
     A  23                                  DSPATR(UL)
     A  68                                  DSPATR(RI)
     A            SELI           1A  B 14  4OVRATR
     A                                      OVRDTA
     A N39                                  DSPATR(UL)
     A  69
     AO 39                                  DSPATR(PR)
     A            DSPI          10A  B 14  6OVRDTA
     A                                      OVRATR
     A  69
     AO 09                                  DSPATR(PR)
     A  24                                  DSPATR(UL)
     A  24                                  DSPATR(PC)
     A  69                                  DSPATR(RI)
     A            PI1            4Y 0B 14 25OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  69
     AO 09                                  DSPATR(PR)
     A  24                                  DSPATR(UL)
     A  69                                  DSPATR(RI)
     A            PI2            4Y 0B 14 37OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  69
     AO 09                                  DSPATR(PR)
     A  24                                  DSPATR(UL)
     A  69                                  DSPATR(RI)
     A            PI3            4Y 0B 14 49OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  69
     AO 09                                  DSPATR(PR)
     A  24                                  DSPATR(UL)
     A  69                                  DSPATR(RI)
     A            PI4            4Y 0B 14 61OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  69
     AO 09                                  DSPATR(PR)
     A  24                                  DSPATR(UL)
     A  69                                  DSPATR(RI)
     A            PI5            4Y 0B 14 73OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  69
     AO 09                                  DSPATR(PR)
     A  24                                  DSPATR(UL)
     A  69                                  DSPATR(RI)
     A            SELJ           1A  B 15  4OVRATR
     A                                      OVRDTA
     A N40                                  DSPATR(UL)
     A  70
     AO 40                                  DSPATR(PR)
     A            DSPJ          10A  B 15  6OVRDTA
     A                                      OVRATR
     A  70
     AO 10                                  DSPATR(PR)
     A  25                                  DSPATR(UL)
     A  25                                  DSPATR(PC)
     A  70                                  DSPATR(RI)
     A            PJ1            4Y 0B 15 25OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  70
     AO 10                                  DSPATR(PR)
     A  25                                  DSPATR(UL)
     A  70                                  DSPATR(RI)
     A            PJ2            4Y 0B 15 37OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  70
     AO 10                                  DSPATR(PR)
     A  25                                  DSPATR(UL)
     A  70                                  DSPATR(RI)
     A            PJ3            4Y 0B 15 49OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  70
     AO 10                                  DSPATR(PR)
     A  25                                  DSPATR(UL)
     A  70                                  DSPATR(RI)
     A            PJ4            4Y 0B 15 61OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  70
     AO 10                                  DSPATR(PR)
     A  25                                  DSPATR(UL)
     A  70                                  DSPATR(RI)
     A            PJ5            4Y 0B 15 73OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  70
     AO 10                                  DSPATR(PR)
     A  25                                  DSPATR(UL)
     A  70                                  DSPATR(RI)
     A            SELK           1A  B 16  4OVRATR
     A                                      OVRDTA
     A N41                                  DSPATR(UL)
     A  71
     AO 41                                  DSPATR(PR)
     A            DSPK          10A  B 16  6OVRDTA
     A                                      OVRATR
     A  71
     AO 11                                  DSPATR(PR)
     A  26                                  DSPATR(UL)
     A  26                                  DSPATR(PC)
     A  71                                  DSPATR(RI)
     A            PK1            4Y 0B 16 25OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  71
     AO 11                                  DSPATR(PR)
     A  26                                  DSPATR(UL)
     A  71                                  DSPATR(RI)
     A            PK2            4Y 0B 16 37OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  71
     AO 11                                  DSPATR(PR)
     A  26                                  DSPATR(UL)
     A  71                                  DSPATR(RI)
     A            PK3            4Y 0B 16 49OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  71
     AO 11                                  DSPATR(PR)
     A  26                                  DSPATR(UL)
     A  71                                  DSPATR(RI)
     A            PK4            4Y 0B 16 61OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  71
     AO 11                                  DSPATR(PR)
     A  26                                  DSPATR(UL)
     A  71                                  DSPATR(RI)
     A            PK5            4Y 0B 16 73OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  71
     AO 11                                  DSPATR(PR)
     A  26                                  DSPATR(UL)
     A  71                                  DSPATR(RI)
     A            SELL           1A  B 17  4OVRATR
     A                                      OVRDTA
     A N42                                  DSPATR(UL)
     A  72
     AO 42                                  DSPATR(PR)
     A            DSPL          10A  B 17  6OVRDTA
     A                                      OVRATR
     A  72
     AO 12                                  DSPATR(PR)
     A  27                                  DSPATR(UL)
     A  27                                  DSPATR(PC)
     A  72                                  DSPATR(RI)
     A            PL1            4Y 0B 17 25OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  72
     AO 12                                  DSPATR(PR)
     A  27                                  DSPATR(UL)
     A  72                                  DSPATR(RI)
     A            PL2            4Y 0B 17 37OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  72
     AO 12                                  DSPATR(PR)
     A  27                                  DSPATR(UL)
     A  72                                  DSPATR(RI)
     A            PL3            4Y 0B 17 49OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  72
     AO 12                                  DSPATR(PR)
     A  27                                  DSPATR(UL)
     A  72                                  DSPATR(RI)
     A            PL4            4Y 0B 17 61OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  72
     AO 12                                  DSPATR(PR)
     A  27                                  DSPATR(UL)
     A  72                                  DSPATR(RI)
     A            PL5            4Y 0B 17 73OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  72
     AO 12                                  DSPATR(PR)
     A  27                                  DSPATR(UL)
     A  72                                  DSPATR(RI)
     A            SELM           1A  B 18  4OVRATR
     A                                      OVRDTA
     A N43                                  DSPATR(UL)
     A  73
     AO 43                                  DSPATR(PR)
     A            DSPM          10A  B 18  6OVRDTA
     A                                      OVRATR
     A  73
     AO 13                                  DSPATR(PR)
     A  28                                  DSPATR(UL)
     A  28                                  DSPATR(PC)
     A  73                                  DSPATR(RI)
     A            PM1            4Y 0B 18 25OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  73
     AO 13                                  DSPATR(PR)
     A  28                                  DSPATR(UL)
     A  73                                  DSPATR(RI)
     A            PM2            4Y 0B 18 37OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  73
     AO 13                                  DSPATR(PR)
     A  28                                  DSPATR(UL)
     A  73                                  DSPATR(RI)
     A            PM3            4Y 0B 18 49OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  73
     AO 13                                  DSPATR(PR)
     A  28                                  DSPATR(UL)
     A  73                                  DSPATR(RI)
     A            PM4            4Y 0B 18 61OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  73
     AO 13                                  DSPATR(PR)
     A  28                                  DSPATR(UL)
     A  73                                  DSPATR(RI)
     A            PM5            4Y 0B 18 73OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  73
     AO 13                                  DSPATR(PR)
     A  28                                  DSPATR(UL)
     A  73                                  DSPATR(RI)
     A            SELN           1A  B 19  4OVRATR
     A                                      OVRDTA
     A N44                                  DSPATR(UL)
     A  74
     AO 44                                  DSPATR(PR)
     A            DSPN          10A  B 19  6OVRDTA
     A                                      OVRATR
     A  74
     AO 14                                  DSPATR(PR)
     A  29                                  DSPATR(UL)
     A  29                                  DSPATR(PC)
     A  74                                  DSPATR(RI)
     A            PN1            4Y 0B 19 25OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  74
     AO 14                                  DSPATR(PR)
     A  29                                  DSPATR(UL)
     A  74                                  DSPATR(RI)
     A            PN2            4Y 0B 19 37OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  74
     AO 14                                  DSPATR(PR)
     A  29                                  DSPATR(UL)
     A  74                                  DSPATR(RI)
     A            PN3            4Y 0B 19 49OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  74
     AO 14                                  DSPATR(PR)
     A  29                                  DSPATR(UL)
     A  74                                  DSPATR(RI)
     A            PN4            4Y 0B 19 61OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  74
     AO 14                                  DSPATR(PR)
     A  29                                  DSPATR(UL)
     A  74                                  DSPATR(RI)
     A            PN5            4Y 0B 19 73OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  74
     AO 14                                  DSPATR(PR)
     A  29                                  DSPATR(UL)
     A  74                                  DSPATR(RI)
     A            SELO           1A  B 20  4OVRATR
     A                                      OVRDTA
     A N45                                  DSPATR(UL)
     A  75
     AO 45                                  DSPATR(PR)
     A            DSPO          10A  B 20  6OVRDTA
     A                                      OVRATR
     A  75
     AO 15                                  DSPATR(PR)
     A  30                                  DSPATR(UL)
     A  30                                  DSPATR(PC)
     A  75                                  DSPATR(RI)
     A            PO1            4Y 0B 20 25OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  75
     AO 15                                  DSPATR(PR)
     A  30                                  DSPATR(UL)
     A  75                                  DSPATR(RI)
     A            PO2            4Y 0B 20 37OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  75
     AO 15                                  DSPATR(PR)
     A  30                                  DSPATR(UL)
     A  75                                  DSPATR(RI)
     A            PO3            4Y 0B 20 49OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  75
     AO 15                                  DSPATR(PR)
     A  30                                  DSPATR(UL)
     A  75                                  DSPATR(RI)
     A            PO4            4Y 0B 20 61OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  75
     AO 15                                  DSPATR(PR)
     A  30                                  DSPATR(UL)
     A  75                                  DSPATR(RI)
     A            PO5            4Y 0B 20 73OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  75
     AO 15                                  DSPATR(PR)
     A  30                                  DSPATR(UL)
     A  75                                  DSPATR(RI)
     A            INSTRUCT      65A  B 22  8OVRDTA
     A                                      DSPATR(PR)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-TERMINAL f3-EXIT f4-ADD -
     A                                      USER f5-DELETE USER f6-BACK  f7-FOR-
     A                                      WARD  f8-REFRESH ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A                                  1 19'USER DISPLAY STATION AND PRINTER M-
     A                                      AINTENANCE'
     A          R DSPST
     A*%%TS  SD  19931214  082429  A193138     REL-V2R2M0  5738-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  3  2'DISPLAY STATION:'
     A            DSPST         10A  B  3 19OVRATR
     A                                      OVRDTA
     A  50                                  DSPATR(UL)
     A  50                                  DSPATR(PC)
     A  60
     AON50                                  DSPATR(PR)
     A  60                                  DSPATR(RI)
     A                                  5  7'User'
     A                                  5 23'Printer 1'
     A                                  5 35'Printer 2'
     A                                  5 47'Printer 3'
     A                                  5 59'Printer 4'
     A                                  5 71'Printer 5'
     A            SELA           1A  B  6  4OVRATR
     A                                      OVRDTA
     A N31                                  DSPATR(UL)
     A  31                                  DSPATR(PR)
     A            USERA         16A  B  6  6OVRDTA
     A                                      OVRATR
     A  61
     AO 01                                  DSPATR(PR)
     A  16                                  DSPATR(UL)
     A  16                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A            PA1            4Y 0B  6 25OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  61
     AO 01                                  DSPATR(PR)
     A  16                                  DSPATR(UL)
     A  61                                  DSPATR(RI)
     A            PA2            4Y 0B  6 37OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  61
     AO 01                                  DSPATR(PR)
     A  16                                  DSPATR(UL)
     A  61                                  DSPATR(RI)
     A            PA3            4Y 0B  6 49OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  61
     AO 01                                  DSPATR(PR)
     A  16                                  DSPATR(UL)
     A  61                                  DSPATR(RI)
     A            PA4            4Y 0B  6 61OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  61
     AO 01                                  DSPATR(PR)
     A  16                                  DSPATR(UL)
     A  61                                  DSPATR(RI)
     A            PA5            4Y 0B  6 73OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  61
     AO 01                                  DSPATR(PR)
     A  16                                  DSPATR(UL)
     A  61                                  DSPATR(RI)
     A            SELB           1A  B  7  4OVRATR
     A                                      OVRDTA
     A N32                                  DSPATR(UL)
     A  32                                  DSPATR(PR)
     A            USERB         16A  B  7  6OVRDTA
     A                                      OVRATR
     A  62
     AO 02                                  DSPATR(PR)
     A  17                                  DSPATR(UL)
     A  17                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A            PB1            4Y 0B  7 25OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  62
     AO 02                                  DSPATR(PR)
     A  17                                  DSPATR(UL)
     A  62                                  DSPATR(RI)
     A            PB2            4Y 0B  7 37OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  62
     AO 02                                  DSPATR(PR)
     A  17                                  DSPATR(UL)
     A  62                                  DSPATR(RI)
     A            PB3            4Y 0B  7 49OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  62
     AO 02                                  DSPATR(PR)
     A  17                                  DSPATR(UL)
     A  62                                  DSPATR(RI)
     A            PB4            4Y 0B  7 61OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  62
     AO 02                                  DSPATR(PR)
     A  17                                  DSPATR(UL)
     A  62                                  DSPATR(RI)
     A            PB5            4Y 0B  7 73OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  62
     AO 02                                  DSPATR(PR)
     A  17                                  DSPATR(UL)
     A  62                                  DSPATR(RI)
     A            SELC           1A  B  8  4OVRATR
     A                                      OVRDTA
     A N33                                  DSPATR(UL)
     A  33                                  DSPATR(PR)
     A            USERC         16A  B  8  6OVRDTA
     A                                      OVRATR
     A  63
     AO 03                                  DSPATR(PR)
     A  18                                  DSPATR(UL)
     A  18                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A            PC1            4Y 0B  8 25OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  63
     AO 03                                  DSPATR(PR)
     A  18                                  DSPATR(UL)
     A  63                                  DSPATR(RI)
     A            PC2            4Y 0B  8 37OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  63
     AO 03                                  DSPATR(PR)
     A  18                                  DSPATR(UL)
     A  63                                  DSPATR(RI)
     A            PC3            4Y 0B  8 49OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  63
     AO 03                                  DSPATR(PR)
     A  18                                  DSPATR(UL)
     A  63                                  DSPATR(RI)
     A            PC4            4Y 0B  8 61OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  63
     AO 03                                  DSPATR(PR)
     A  18                                  DSPATR(UL)
     A  63                                  DSPATR(RI)
     A            PC5            4Y 0B  8 73OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  63
     AO 03                                  DSPATR(PR)
     A  18                                  DSPATR(UL)
     A  63                                  DSPATR(RI)
     A            SELD           1A  B  9  4OVRATR
     A                                      OVRDTA
     A N34                                  DSPATR(UL)
     A  34                                  DSPATR(PR)
     A            USERD         16A  B  9  6OVRDTA
     A                                      OVRATR
     A  64
     AO 04                                  DSPATR(PR)
     A  19                                  DSPATR(UL)
     A  19                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A            PD1            4Y 0B  9 25OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  64
     AO 04                                  DSPATR(PR)
     A  19                                  DSPATR(UL)
     A  64                                  DSPATR(RI)
     A            PD2            4Y 0B  9 37OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  64
     AO 04                                  DSPATR(PR)
     A  19                                  DSPATR(UL)
     A  64                                  DSPATR(RI)
     A            PD3            4Y 0B  9 49OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  64
     AO 04                                  DSPATR(PR)
     A  19                                  DSPATR(UL)
     A  64                                  DSPATR(RI)
     A            PD4            4Y 0B  9 61OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  64
     AO 04                                  DSPATR(PR)
     A  19                                  DSPATR(UL)
     A  64                                  DSPATR(RI)
     A            PD5            4Y 0B  9 73OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  64
     AO 04                                  DSPATR(PR)
     A  19                                  DSPATR(UL)
     A  64                                  DSPATR(RI)
     A            SELE           1A  B 10  4OVRATR
     A                                      OVRDTA
     A N35                                  DSPATR(UL)
     A  35                                  DSPATR(PR)
     A            USERE         16A  B 10  6OVRDTA
     A                                      OVRATR
     A  65
     AO 05                                  DSPATR(PR)
     A  20                                  DSPATR(UL)
     A  20                                  DSPATR(PC)
     A  65                                  DSPATR(RI)
     A            PE1            4Y 0B 10 25OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  65
     AO 05                                  DSPATR(PR)
     A  20                                  DSPATR(UL)
     A  65                                  DSPATR(RI)
     A            PE2            4Y 0B 10 37OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  65
     AO 05                                  DSPATR(PR)
     A  20                                  DSPATR(UL)
     A  65                                  DSPATR(RI)
     A            PE3            4Y 0B 10 49OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  65
     AO 05                                  DSPATR(PR)
     A  20                                  DSPATR(UL)
     A  65                                  DSPATR(RI)
     A            PE4            4Y 0B 10 61OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  65
     AO 05                                  DSPATR(PR)
     A  20                                  DSPATR(UL)
     A  65                                  DSPATR(RI)
     A            PE5            4Y 0B 10 73OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  65
     AO 05                                  DSPATR(PR)
     A  20                                  DSPATR(UL)
     A  65                                  DSPATR(RI)
     A            SELF           1A  B 11  4OVRATR
     A                                      OVRDTA
     A N36                                  DSPATR(UL)
     A  36                                  DSPATR(PR)
     A            USERF         16A  B 11  6OVRDTA
     A                                      OVRATR
     A  66
     AO 06                                  DSPATR(PR)
     A  21                                  DSPATR(UL)
     A  21                                  DSPATR(PC)
     A  66                                  DSPATR(RI)
     A            PF1            4Y 0B 11 25OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  66
     AO 06                                  DSPATR(PR)
     A  21                                  DSPATR(UL)
     A  66                                  DSPATR(RI)
     A            PF2            4Y 0B 11 37OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  66
     AO 06                                  DSPATR(PR)
     A  21                                  DSPATR(UL)
     A  66                                  DSPATR(RI)
     A            PF3            4Y 0B 11 49OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  66
     AO 06                                  DSPATR(PR)
     A  21                                  DSPATR(UL)
     A  66                                  DSPATR(RI)
     A            PF4            4Y 0B 11 61OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  66
     AO 06                                  DSPATR(PR)
     A  21                                  DSPATR(UL)
     A  66                                  DSPATR(RI)
     A            PF5            4Y 0B 11 73OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  66
     AO 06                                  DSPATR(PR)
     A  21                                  DSPATR(UL)
     A  66                                  DSPATR(RI)
     A            SELG           1A  B 12  4OVRATR
     A                                      OVRDTA
     A N37                                  DSPATR(UL)
     A  37                                  DSPATR(PR)
     A            USERG         16A  B 12  6OVRDTA
     A                                      OVRATR
     A  67
     AO 07                                  DSPATR(PR)
     A  22                                  DSPATR(UL)
     A  22                                  DSPATR(PC)
     A  67                                  DSPATR(RI)
     A            PG1            4Y 0B 12 25OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  67
     AO 07                                  DSPATR(PR)
     A  22                                  DSPATR(UL)
     A  67                                  DSPATR(RI)
     A            PG2            4Y 0B 12 37OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  67
     AO 07                                  DSPATR(PR)
     A  22                                  DSPATR(UL)
     A  67                                  DSPATR(RI)
     A            PG3            4Y 0B 12 49OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  67
     AO 07                                  DSPATR(PR)
     A  22                                  DSPATR(UL)
     A  67                                  DSPATR(RI)
     A            PG4            4Y 0B 12 61OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  67
     AO 07                                  DSPATR(PR)
     A  22                                  DSPATR(UL)
     A  67                                  DSPATR(RI)
     A            PG5            4Y 0B 12 73OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  67
     AO 07                                  DSPATR(PR)
     A  22                                  DSPATR(UL)
     A  67                                  DSPATR(RI)
     A            SELH           1A  B 13  4OVRATR
     A                                      OVRDTA
     A N38                                  DSPATR(UL)
     A  38                                  DSPATR(PR)
     A            USERH         16A  B 13  6OVRDTA
     A                                      OVRATR
     A  68
     AO 08                                  DSPATR(PR)
     A  23                                  DSPATR(UL)
     A  23                                  DSPATR(PC)
     A  68                                  DSPATR(RI)
     A            PH1            4Y 0B 13 25OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  68
     AO 08                                  DSPATR(PR)
     A  23                                  DSPATR(UL)
     A  68                                  DSPATR(RI)
     A            PH2            4Y 0B 13 37OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  68
     AO 08                                  DSPATR(PR)
     A  23                                  DSPATR(UL)
     A  68                                  DSPATR(RI)
     A            PH3            4Y 0B 13 49OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  68
     AO 08                                  DSPATR(PR)
     A  23                                  DSPATR(UL)
     A  68                                  DSPATR(RI)
     A            PH4            4Y 0B 13 61OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  68
     AO 08                                  DSPATR(PR)
     A  23                                  DSPATR(UL)
     A  68                                  DSPATR(RI)
     A            PH5            4Y 0B 13 73OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  68
     AO 08                                  DSPATR(PR)
     A  23                                  DSPATR(UL)
     A  68                                  DSPATR(RI)
     A            SELI           1A  B 14  4OVRATR
     A                                      OVRDTA
     A N39                                  DSPATR(UL)
     A  39                                  DSPATR(PR)
     A            USERI         16A  B 14  6OVRDTA
     A                                      OVRATR
     A  69
     AO 09                                  DSPATR(PR)
     A  24                                  DSPATR(UL)
     A  24                                  DSPATR(PC)
     A  69                                  DSPATR(RI)
     A            PI1            4Y 0B 14 25OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  69
     AO 09                                  DSPATR(PR)
     A  24                                  DSPATR(UL)
     A  69                                  DSPATR(RI)
     A            PI2            4Y 0B 14 37OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  69
     AO 09                                  DSPATR(PR)
     A  24                                  DSPATR(UL)
     A  69                                  DSPATR(RI)
     A            PI3            4Y 0B 14 49OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  69
     AO 09                                  DSPATR(PR)
     A  24                                  DSPATR(UL)
     A  69                                  DSPATR(RI)
     A            PI4            4Y 0B 14 61OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  69
     AO 09                                  DSPATR(PR)
     A  24                                  DSPATR(UL)
     A  69                                  DSPATR(RI)
     A            PI5            4Y 0B 14 73OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  69
     AO 09                                  DSPATR(PR)
     A  24                                  DSPATR(UL)
     A  69                                  DSPATR(RI)
     A            SELJ           1A  B 15  4OVRATR
     A                                      OVRDTA
     A N40                                  DSPATR(UL)
     A  40                                  DSPATR(PR)
     A            USERJ         16A  B 15  6OVRDTA
     A                                      OVRATR
     A  70
     AO 10                                  DSPATR(PR)
     A  25                                  DSPATR(UL)
     A  25                                  DSPATR(PC)
     A  70                                  DSPATR(RI)
     A            PJ1            4Y 0B 15 25OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  70
     AO 10                                  DSPATR(PR)
     A  25                                  DSPATR(UL)
     A  70                                  DSPATR(RI)
     A            PJ2            4Y 0B 15 37OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  70
     AO 10                                  DSPATR(PR)
     A  25                                  DSPATR(UL)
     A  70                                  DSPATR(RI)
     A            PJ3            4Y 0B 15 49OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  70
     AO 10                                  DSPATR(PR)
     A  25                                  DSPATR(UL)
     A  70                                  DSPATR(RI)
     A            PJ4            4Y 0B 15 61OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  70
     AO 10                                  DSPATR(PR)
     A  25                                  DSPATR(UL)
     A  70                                  DSPATR(RI)
     A            PJ5            4Y 0B 15 73OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  70
     AO 10                                  DSPATR(PR)
     A  25                                  DSPATR(UL)
     A  70                                  DSPATR(RI)
     A            SELK           1A  B 16  4OVRATR
     A                                      OVRDTA
     A N41                                  DSPATR(UL)
     A  41                                  DSPATR(PR)
     A            USERK         16A  B 16  6OVRDTA
     A                                      OVRATR
     A  71
     AO 11                                  DSPATR(PR)
     A  26                                  DSPATR(UL)
     A  26                                  DSPATR(PC)
     A  71                                  DSPATR(RI)
     A            PK1            4Y 0B 16 25OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  71
     AO 11                                  DSPATR(PR)
     A  26                                  DSPATR(UL)
     A  71                                  DSPATR(RI)
     A            PK2            4Y 0B 16 37OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  71
     AO 11                                  DSPATR(PR)
     A  26                                  DSPATR(UL)
     A  71                                  DSPATR(RI)
     A            PK3            4Y 0B 16 49OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  71
     AO 11                                  DSPATR(PR)
     A  26                                  DSPATR(UL)
     A  71                                  DSPATR(RI)
     A            PK4            4Y 0B 16 61OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  71
     AO 11                                  DSPATR(PR)
     A  26                                  DSPATR(UL)
     A  71                                  DSPATR(RI)
     A            PK5            4Y 0B 16 73OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  71
     AO 11                                  DSPATR(PR)
     A  26                                  DSPATR(UL)
     A  71                                  DSPATR(RI)
     A            SELL           1A  B 17  4OVRATR
     A                                      OVRDTA
     A N42                                  DSPATR(UL)
     A  42                                  DSPATR(PR)
     A            USERL         16A  B 17  6OVRDTA
     A                                      OVRATR
     A  72
     AO 12                                  DSPATR(PR)
     A  27                                  DSPATR(UL)
     A  27                                  DSPATR(PC)
     A  72                                  DSPATR(RI)
     A            PL1            4Y 0B 17 25OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  72
     AO 12                                  DSPATR(PR)
     A  27                                  DSPATR(UL)
     A  72                                  DSPATR(RI)
     A            PL2            4Y 0B 17 37OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  72
     AO 12                                  DSPATR(PR)
     A  27                                  DSPATR(UL)
     A  72                                  DSPATR(RI)
     A            PL3            4Y 0B 17 49OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  72
     AO 12                                  DSPATR(PR)
     A  27                                  DSPATR(UL)
     A  72                                  DSPATR(RI)
     A            PL4            4Y 0B 17 61OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  72
     AO 12                                  DSPATR(PR)
     A  27                                  DSPATR(UL)
     A  72                                  DSPATR(RI)
     A            PL5            4Y 0B 17 73OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  72
     AO 12                                  DSPATR(PR)
     A  27                                  DSPATR(UL)
     A  72                                  DSPATR(RI)
     A            SELM           1A  B 18  4OVRATR
     A                                      OVRDTA
     A N43                                  DSPATR(UL)
     A  43                                  DSPATR(PR)
     A            USERM         16A  B 18  6OVRDTA
     A                                      OVRATR
     A  73
     AO 13                                  DSPATR(PR)
     A  28                                  DSPATR(UL)
     A  28                                  DSPATR(PC)
     A  73                                  DSPATR(RI)
     A            PM1            4Y 0B 18 25OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  73
     AO 13                                  DSPATR(PR)
     A  28                                  DSPATR(UL)
     A  73                                  DSPATR(RI)
     A            PM2            4Y 0B 18 37OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  73
     AO 13                                  DSPATR(PR)
     A  28                                  DSPATR(UL)
     A  73                                  DSPATR(RI)
     A            PM3            4Y 0B 18 49OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  73
     AO 13                                  DSPATR(PR)
     A  28                                  DSPATR(UL)
     A  73                                  DSPATR(RI)
     A            PM4            4Y 0B 18 61OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  73
     AO 13                                  DSPATR(PR)
     A  28                                  DSPATR(UL)
     A  73                                  DSPATR(RI)
     A            PM5            4Y 0B 18 73OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  73
     AO 13                                  DSPATR(PR)
     A  28                                  DSPATR(UL)
     A  73                                  DSPATR(RI)
     A            SELN           1A  B 19  4OVRATR
     A                                      OVRDTA
     A N44                                  DSPATR(UL)
     A  44                                  DSPATR(PR)
     A            USERN         16A  B 19  6OVRDTA
     A                                      OVRATR
     A  74
     AO 14                                  DSPATR(PR)
     A  29                                  DSPATR(UL)
     A  29                                  DSPATR(PC)
     A  74                                  DSPATR(RI)
     A            PN1            4Y 0B 19 25OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  74
     AO 14                                  DSPATR(PR)
     A  29                                  DSPATR(UL)
     A  74                                  DSPATR(RI)
     A            PN2            4Y 0B 19 37OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  74
     AO 14                                  DSPATR(PR)
     A  29                                  DSPATR(UL)
     A  74                                  DSPATR(RI)
     A            PN3            4Y 0B 19 49OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  74
     AO 14                                  DSPATR(PR)
     A  29                                  DSPATR(UL)
     A  74                                  DSPATR(RI)
     A            PN4            4Y 0B 19 61OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  74
     AO 14                                  DSPATR(PR)
     A  29                                  DSPATR(UL)
     A  74                                  DSPATR(RI)
     A            PN5            4Y 0B 19 73OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  74
     AO 14                                  DSPATR(PR)
     A  29                                  DSPATR(UL)
     A  74                                  DSPATR(RI)
     A            SELO           1A  B 20  4OVRATR
     A                                      OVRDTA
     A N45                                  DSPATR(UL)
     A  45                                  DSPATR(PR)
     A            USERO         16A  B 20  6OVRDTA
     A                                      OVRATR
     A  75
     AO 15                                  DSPATR(PR)
     A  30                                  DSPATR(UL)
     A  30                                  DSPATR(PC)
     A  75                                  DSPATR(RI)
     A            PO1            4Y 0B 20 25OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  75
     AO 15                                  DSPATR(PR)
     A  30                                  DSPATR(UL)
     A  75                                  DSPATR(RI)
     A            PO2            4Y 0B 20 37OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  75
     AO 15                                  DSPATR(PR)
     A  30                                  DSPATR(UL)
     A  75                                  DSPATR(RI)
     A            PO3            4Y 0B 20 49OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  75
     AO 15                                  DSPATR(PR)
     A  30                                  DSPATR(UL)
     A  75                                  DSPATR(RI)
     A            PO4            4Y 0B 20 61OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  75
     AO 15                                  DSPATR(PR)
     A  30                                  DSPATR(UL)
     A  75                                  DSPATR(RI)
     A            PO5            4Y 0B 20 73OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A  75
     AO 15                                  DSPATR(PR)
     A  30                                  DSPATR(UL)
     A  75                                  DSPATR(RI)
     A            INSTRUCT      65A  B 22  8OVRDTA
     A                                      DSPATR(PR)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-USER f3-EXIT f4-ADD TERM-
     A                                      INAL f5-DELETE TERM f6-BACK  f7-FOR-
     A                                      WARD  f8-REFRESH ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A                                  1 19'DISPLAY STATION USER AND PRINTER M-
     A                                      AINTENANCE'
