     A*%%TS  SD  19971125  142637  A193138     REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A  98                                  INVITE
     A                                      INDARA
     A          R UCHANGE
     A*%%TS  SD  19971125  142637  A193138     REL-V3R7M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 19'M O N T H L Y   U S A G E   C H A -
     A                                      N G E'
     A                                  6  3'JANUARY      FEBRUARY     MARCH   -
     A                                           APRIL        MAY          JUNE'
     A                                  8  3'JULY         AUGUST       SEPTEMBE-
     A                                      R    OCTOBER      NOVEMBER     DECE-
     A                                      MBER'
     A                                 10  3'MTD          YESTERDAY'
     A            CORPCODE       8A  B  3  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A  60                                  DSPATR(PR)
     A            INSTR         60A  B  3 12OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(PR)
     A            J              1A  B  7  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES('-' ' ')
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            JAN            8A  B  7  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            F              1A  B  7 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES('-' ' ')
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            FEB            8A  B  7 18DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            M              1A  B  7 29DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES('-' ' ')
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            MARCH          8A  B  7 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            A              1A  B  7 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES('-' ' ')
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            APRIL          8A  B  7 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            Y              1A  B  7 55DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES('-' ' ')
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            MAY            8A  B  7 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            E              1A  B  7 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES('-' ' ')
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            JUNE           8A  B  7 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            U              1A  B  9  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES('-' ' ')
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            JULY           8A  B  9  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            G              1A  B  9 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES('-' ' ')
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            AUGUST         8A  B  9 18DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            S              1A  B  9 29DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES('-' ' ')
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            SEPT           8A  B  9 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            O              1A  B  9 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES('-' ' ')
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            OCTOBER        8A  B  9 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            N              1A  B  9 55DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES('-' ' ')
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            NOV            8A  B  9 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            D              1A  B  9 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES('-' ' ')
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            DEC            8A  B  9 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            X              1A  B 11  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES('-' ' ')
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            MTD            8A  B 11  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            T              1A  B 11 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES('-' ' ')
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            YEST           8A  B 11 18DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A                                  5  2'TOTAL USAGE (ISSUES and DIRECT DEL-
     A                                      IVERY):'
     A                                 14  2'DIRECT DELIVERY USAGE:'
     A                                 15  3'JANUARY      FEBRUARY     MARCH   -
     A                                           APRIL        MAY          JUNE'
     A            FLD001         1A  B 16  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES('-' ' ')
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            FLD002         8A  B 16  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            FLD003         1A  B 16 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES('-' ' ')
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            FLD004         8A  B 16 18DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            FLD005         1A  B 16 29DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES('-' ' ')
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            FLD006         8A  B 16 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            FLD007         1A  B 16 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES('-' ' ')
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            FLD008         8A  B 16 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            FLD009         1A  B 16 55DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES('-' ' ')
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A            FLD010         8A  B 16 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            FLD011         1A  B 16 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES('-' ' ')
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            FLD012         8A  B 16 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A                                 17  3'JULY         AUGUST       SEPTEMBE-
     A                                      R    OCTOBER      NOVEMBER     DECE-
     A                                      MBER'
     A            FLD013         1A  B 18  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES('-' ' ')
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A            FLD014         8A  B 18  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A            FLD015         1A  B 18 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES('-' ' ')
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A            FLD016         8A  B 18 18DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A            FLD017         1A  B 18 29DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES('-' ' ')
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(PC)
     A            FLD018         8A  B 18 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A            FLD019         1A  B 18 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES('-' ' ')
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A            FLD020         8A  B 18 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A            FLD021         1A  B 18 55DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES('-' ' ')
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A            FLD022         8A  B 18 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A            FLD023         1A  B 18 68DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES('-' ' ')
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A            FLD024         8A  B 18 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  54                                  DSPATR(RI)
     A  54                                  DSPATR(PC)
     A                                 19  3'MTD          YESTERDAY'
     A            FLD025         1A  B 20  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES('-' ' ')
     A  55                                  DSPATR(RI)
     A  55                                  DSPATR(PC)
     A            FLD026         8A  B 20  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  56                                  DSPATR(RI)
     A  56                                  DSPATR(PC)
     A            FLD027         1A  B 20 16DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      VALUES('-' ' ')
     A  57                                  DSPATR(RI)
     A  57                                  DSPATR(PC)
     A            FLD028         8A  B 20 18DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  58                                  DSPATR(RI)
     A  58                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL(' ENTER-SAVE    f2-CANCEL   -
     A                                        f3-EXIT                          -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
