     A*  89/08/24  15:21:24    T000144     REL-R01M02  5728-PW1
     A*            23:36:32    T881S28     VVENRCV.HPTO38.CME
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A          R ADD
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 27'----------------------'
     A                                  3 27':  ADD VENDOR CODES  :'
     A                                  4 27'----------------------'
     A                                 19 10'ENTER VENDOR CODES AND PRESS APPRO-
     A                                      PRIATE FUNCTION KEY.'
     A            VENCO01        7A  B  7 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            VENCO02        7A  B  7 22DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            VENCO03        7A  B  7 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            VENCO04        7A  B  7 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            VENCO05        7A  B  7 58DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            VENCO06        7A  B  8 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            VENCO07        7A  B  8 22DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            VENCO08        7A  B  8 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            VENCO09        7A  B  8 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            VENCO10        7A  B  8 58DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            VENCO11        7A  B  9 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            VENCO12        7A  B  9 22DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            VENCO13        7A  B  9 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            VENCO14        7A  B  9 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            VENCO15        7A  B  9 58DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            VENCO16        7A  B 10 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            VENCO17        7A  B 10 22DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            VENCO18        7A  B 10 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            VENCO19        7A  B 10 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            VENCO20        7A  B 10 58DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            VENCO21        7A  B 11 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            VENCO22        7A  B 11 22DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            VENCO23        7A  B 11 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            VENCO24        7A  B 11 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            VENCO25        7A  B 11 58DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            VENCO26        7A  B 12 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            VENCO27        7A  B 12 22DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            VENCO28        7A  B 12 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            VENCO29        7A  B 12 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            VENCO30        7A  B 12 58DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            VENCO31        7A  B 13 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            VENCO32        7A  B 13 22DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            VENCO33        7A  B 13 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            VENCO34        7A  B 13 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            VENCO35        7A  B 13 58DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            VENCO36        7A  B 14 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            VENCO37        7A  B 14 22DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            VENCO38        7A  B 14 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            VENCO39        7A  B 14 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A            VENCO40        7A  B 14 58DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A            VENCO41        7A  B 15 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            VENCO42        7A  B 15 22DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A            VENCO43        7A  B 15 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A            VENCO44        7A  B 15 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A            VENCO45        7A  B 15 58DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A            VENCO46        7A  B 16 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A            VENCO47        7A  B 16 22DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(PC)
     A            VENCO48        7A  B 16 34DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A            VENCO49        7A  B 16 46DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(PC)
     A            VENCO50        7A  B 16 58DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-PROCESS AND EXIT f2-PROC-
     A                                      ESS/ CONTINUE f8-DELETE f4-REPORT  -
     A                                      f7-RETURN')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R DELETE
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 26'-------------------------'
     A                                  2 26':  DELETE VENDOR CODES  :'
     A                                  3 26'-------------------------'
     A                                  6 14'CODE'
     A                                  6 26'VENDOR NAME'
     A                                  7 14'-------     -----------'
     A            VEN001         7A  B  8 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            NAME1         44A  B  8 26DSPATR(PR)
     A                                      OVRDTA
     A            VEN002         7A  B  9 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            NAME2         44A  B  9 26DSPATR(PR)
     A                                      OVRDTA
     A            VEN003         7A  B 10 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            NAME3         44A  B 10 26DSPATR(PR)
     A                                      OVRDTA
     A            VEN004         7A  B 11 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            NAME4         44A  B 11 26DSPATR(PR)
     A                                      OVRDTA
     A            VEN005         7A  B 12 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            NAME5         44A  B 12 26DSPATR(PR)
     A                                      OVRDTA
     A            VEN006         7A  B 13 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            NAME6         44A  B 13 26DSPATR(PR)
     A                                      OVRDTA
     A            VEN007         7A  B 14 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            NAME7         44A  B 14 26DSPATR(PR)
     A                                      OVRDTA
     A            VEN008         7A  B 15 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            NAME8         44A  B 15 26DSPATR(PR)
     A                                      OVRDTA
     A            VEN009         7A  B 16 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            NAME9         44A  B 16 26DSPATR(PR)
     A                                      OVRDTA
     A            VEN010         7A  B 17 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            NAME10        44A  B 17 26DSPATR(PR)
     A                                      OVRDTA
     A            MSGLINE       56A  B 20 14DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f8-ADD SCREEN f4-REPORT SCR-
     A                                      EEN f3-END PROGRAM                 -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R DELETE2
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 26'-------------------------'
     A                                  2 26':  DELETE VENDOR CODES  :'
     A                                  3 26'-------------------------'
     A                                  6 14'CODE'
     A                                  6 26'VENDOR NAME'
     A                                  7 14'-------     -----------'
     A            VEN001         7A  B  8 14DSPATR(PR)
     A                                      OVRDTA
     A            NAME1         44A  B  8 26DSPATR(PR)
     A                                      OVRDTA
     A            VEN002         7A  B  9 14DSPATR(PR)
     A                                      OVRDTA
     A            NAME2         44A  B  9 26DSPATR(PR)
     A                                      OVRDTA
     A            VEN003         7A  B 10 14DSPATR(PR)
     A                                      OVRDTA
     A            NAME3         44A  B 10 26DSPATR(PR)
     A                                      OVRDTA
     A            VEN004         7A  B 11 14DSPATR(PR)
     A                                      OVRDTA
     A            NAME4         44A  B 11 26DSPATR(PR)
     A                                      OVRDTA
     A            VEN005         7A  B 12 14DSPATR(PR)
     A                                      OVRDTA
     A            NAME5         44A  B 12 26DSPATR(PR)
     A                                      OVRDTA
     A            VEN006         7A  B 13 14DSPATR(PR)
     A                                      OVRDTA
     A            NAME6         44A  B 13 26DSPATR(PR)
     A                                      OVRDTA
     A            VEN007         7A  B 14 14DSPATR(PR)
     A                                      OVRDTA
     A            NAME7         44A  B 14 26DSPATR(PR)
     A                                      OVRDTA
     A            VEN008         7A  B 15 14DSPATR(PR)
     A                                      OVRDTA
     A            NAME8         44A  B 15 26DSPATR(PR)
     A                                      OVRDTA
     A            VEN009         7A  B 16 14DSPATR(PR)
     A                                      OVRDTA
     A            NAME9         44A  B 16 26DSPATR(PR)
     A                                      OVRDTA
     A            VEN010         7A  B 17 14DSPATR(PR)
     A                                      OVRDTA
     A            NAME10        44A  B 17 26DSPATR(PR)
     A                                      OVRDTA
     A            MSGLINE       56A  B 20 14DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-DELETE AND EXIT f2-DELET-
     A                                      E / CONTINUE f8-ADD SCREEN f4-REPOR-
     A                                      T SCREEN ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R MENU
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 25'---------------------------'
     A                                  3 25'¦'
     A                                  3 51'¦'
     A                                  4 25'¦'
     A                                  4 33'PAY VENDOR'
     A                                  4 51'¦'
     A                                  5 25'¦     RECEIVING FILE      ¦'
     A                                  6 25'¦'
     A                                  6 51'¦'
     A                                  7 25'---------------------------'
     A                                 11 32'F1  -  ADD'
     A                                 12 32'F2  -  DELETE'
     A                                 13 32'F8  -  REPORT'
     A                                 14 32'F3  -  EXIT'
     A                                 18 11'-----------------------------------
     A                                      ------------------------'
     A                                 19 13'THE PAY VENDOR RECEIVING FILE CONT-
     A                                      AINS ANY VENDOR THAT'
     A                                 20 13'IS TO BE PAID AS SOON AS A RECEIVI-
     A                                      NG SLIP IS CREATED.'
     A                                 21 11'-----------------------------------
     A                                      ------------------------'
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
