     A*%%TS  DD  19961206  085755  T881S32     REL-V3R1M0  5763-CD1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      INDARA
     A                                      PRINT
     A                                      CHGINPDFT
     A          R VOIDDISP
     A*%%TS  DD  19961205  142137  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  7'O P E N   S T A T U S   W O R K O -
     A                                      R D E R S   F O R   Z O N E :'
     A            ZONE           4A  B  2 72DSPATR(PR)
     A                                      OVRDTA
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  4'WO - PRI: EQUIP:  DESCRIPTION:    -
     A                                                      SKILLS:   RECEIVED:'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                 21  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                 22  5'Press f4 to sort list by WO/Priori-
     A                                      ty, f5 by Equipment, f6 by Date/Tim-
     A                                      e.'
     A                                 23  3'Type a character next to the WO nu-
     A                                      mber(s) you wish to void and press -
     A                                      ''ENTER''.'
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('  F3=EXIT PROGRAM')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A          R VOIDWOS
     A*%%TS  DD  19961205  124238  T881S32     REL-V3R1M0  5763-CD1
     A                                      SFL
     A            SEL            1A  B  6  2
     A            WO             7A  B  6  4DSPATR(PR)
     A            PRI            1A  B  6 12DSPATR(PR)
     A            EQP            6A  B  6 14DSPATR(PR)
     A            DESC          30A  B  6 22DSPATR(PR)
     A            S1             2A  B  6 54DSPATR(PR)
     A            S2             2A  B  6 57DSPATR(PR)
     A            S3             2A  B  6 60DSPATR(PR)
     A            RECD          15A  B  6 64DSPATR(PR)
     A          R VOID
     A*%%TS  DD  19961205  124238  T881S32     REL-V3R1M0  5763-CD1
     A                                      SFLCTL(VOIDWOS)
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(15)
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      OVERLAY
     A  75                                  SFLDSP
     A  76                                  SFLDSPCTL
     A  77                                  SFLCLR
     A N74                                  SFLEND(*MORE)
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  7'O P E N   S T A T U S   W O R K O -
     A                                      R D E R S   F O R   Z O N E :'
     A            ZONE           4A  B  2 72DSPATR(PR)
     A                                      OVRDTA
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  4'WO - PRI: EQUIP:  DESCRIPTION:    -
     A                                                      SKILLS:   RECEIVED:'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A          R VOIDSEL
     A*%%TS  DD  19961205  142137  T881S32     REL-V3R1M0  5763-CD1
     A                                 22  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                 23  5'Press f4 to sort list by WO/Priori-
     A                                      ty, f5 by Equipment, f6 by Date/Tim-
     A                                      e.'
     A                                 24  3'Type a character next to the WO nu-
     A                                      mber(s) you wish to void and press -
     A                                      ''ENTER''.'
     A                                      DSPATR(HI BL)
     A          R VERIFY
     A*%%TS  DD  19961206  085755  T881S32     REL-V3R1M0  5763-CD1
     A                                      SFL
     A            WO             7A  B  4  2DSPATR(PR)
     A          R VERIFYF
     A*%%TS  DD  19961206  085755  T881S32     REL-V3R1M0  5763-CD1
     A                                      SFLCTL(VERIFY)
     A  *DS3                                SFLLIN(3)
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(144)
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      OVERLAY
     A  75                                  SFLDSP
     A  76                                  SFLDSPCTL
     A  77                                  SFLCLR
     A N74                                  SFLEND(*MORE)
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  2':'
     A                                  2 18'W O R K O R D E R S   T O   B E   -
     A                                      V O I D E D'
     A                                  2 79':'
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A          R VERSEL
     A*%%TS  DD  19961204  075443  T881S32     REL-V3R1M0  5763-CD1
     A                                 23  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                 24  6'PRESS ''ENTER'' TO VOID THE WORKOR-
     A                                      DERS LISTED ABOVE OR PRESS F3 TO CA-
     A                                      NCEL'
     A                                      DSPATR(HI BL)
     A          R VGETZONE
     A*%%TS  DD  19961203  105500  T881S32     REL-V3R1M0  5763-CD1
     A                                      PUTOVR
     A                                  1  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A                                  2  2':                                 -
     A                                                                         -
     A                                              :'
     A                                  3  2':                                 -
     A                                                                         -
     A                                              :'
     A                                  4  2':                                 -
     A                                                                         -
     A                                              :'
     A                                  5  2':              EEEEEE   NNN   NN  -
     A                                       TTTTTT   EEEEEE   RRRRR           -
     A                                              :'
     A                                  6  2':              EE       NNNN  NN  -
     A                                         TT     EE       RR  RR          -
     A                                              :'
     A                                  7  2':              EEEE     NN NN NN  -
     A                                         TT     EEEE     RRRRR           -
     A                                              :'
     A                                  8  2':              EE       NN  NNNN  -
     A                                         TT     EE       RR RR           -
     A                                              :'
     A                                  9  2':              EEEEEE   NN   NNN  -
     A                                         TT     EEEEEE   RR  RR          -
     A                                              :'
     A                                 10  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 11  2':                  ZZZZZZ    OOOOO-
     A                                          NNN   NN   EEEEEE              -
     A                                              :'
     A                                 12  2':                     ZZ    OO   O-
     A                                      O   NNNN  NN   EE                  -
     A                                              :'
     A                                 13  2':                    ZZ     OO   O-
     A                                      O   NN NN NN   EEEE                -
     A                                              :'
     A                                 14  2':                   ZZ      OO   O-
     A                                      O   NN  NNNN   EE                  -
     A                                              :'
     A                                 15  2':                  ZZZZZZ    OOOOO-
     A                                          NN   NNN   EEEEEE              -
     A                                              :'
     A                                 16  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 17  2':               ==================-
     A                                      ========================           -
     A                                              :'
     A                                 18  2':               :                 -
     A                                                             :           -
     A                                              :'
     A                                 19  2':               :'
     A            ZONE           4A  B 19 38DSPATR(UL)
     A  01                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 19 59':                   :'
     A                                 20  2':               :                 -
     A                                                             :           -
     A                                              :'
     A                                 21  2':               ==================-
     A                                      ========================           -
     A                                              :'
     A                                 22  2':                                 -
     A                                                                         -
     A                                              :'
     A                                 23  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A            COMMANDLIN    79A  O 24  1
     A  96                                  OVRDTA
     A                                      DFT('  F3=RETURN TO MENU')
     A  99        MESSAGELIN    78   M
     A  99                                  OVRDTA
     A*%%CP+999CRTDSPF
     A*%%CP+    FILE(MCTST/ZVOIDWOS)
     A*%%CP+    SRCFILE(MCTST/QDDSSRC)
     A*%%CP+    SRCMBR(ZVOIDWOS)
     A*%%CP+    TEXT(*SRCMBRTXT)
     A*%%CP     RSTDSP(*YES)
