     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A  97                                  INVITE
     A                                      HELP
     A                                      PRINT
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A          R F24DISP
     A                                      SFL
     A            WSEL           1A  B  6  2DSPATR(UL)
     A            WO             7A  B  6  5DSPATR(PR)
     A            STAT           2A  B  6 14DSPATR(PR)
     A            DESC          30A  B  6 19DSPATR(PR)
     A            S1             2A  B  6 51DSPATR(PR)
     A            S2             2A  B  6 54DSPATR(PR)
     A            S3             2A  B  6 57DSPATR(PR)
     A            FC             7A  B  6 60DSPATR(PR)
     A            DT            11A  B  6 69DSPATR(PR)
     A          R FWO24HST
     A                                      SFLCTL(F24DISP)
     A                                      OVERLAY
     A  75                                  SFLDSP
     A  76                                  SFLDSPCTL
     A  77                                  SFLCLR
     A N74                                  SFLEND(*MORE)
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(15)
     A                                      PUTOVR
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2 16'E Q U I P M E N T   H I S T O R Y -
     A                                        F O R'
     A            EQUIP          6A  B  2 60DSPATR(PR)
     A                                      OVRDTA
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  4  2'WORKORDER STATUS DESCRIPTION      -
     A                                                     SKILLS   FAILURE  CO-
     A                                      MPLETION'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A          R F24SEL
     A                                 22  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                 23  2'Type a character by the WO number -
     A                                      and press ''ENTER'' to display     -
     A                                               '
     A                                 24 12'       f3/f8 - TO RETURN TO CRAFTS-
     A                                      MAN''S FUNCTIONS'
     A                                      DSPATR(HI BL)
