     A*            13:28:11    T881S28     VZONTOBC.HPTO38.CME
     A                                      DSPSIZ(24 80 *DS3)
     A                                      INDARA
     A                                      PRINT
     A                                      CHGINPDFT
     A  98                                  INVITE
     A          R ZONTOBC1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 28'ZONE TO BUSINESS CENTERS'
     A                                  2  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  3  1'.'
     A                                  4  1'.'
     A                                  5  1'.'
     A                                  6  1'.'
     A                                  7  1'.'
     A                                  8  1'.'
     A                                  8 19'Change zone assignment from'
     A                                  9  1'.'
     A                                 10  1'.'
     A                                 10 44'to'
     A                                 11  1'.'
     A                                 12  1'.'
     A                                 13  1'.'
     A                                 14  1'.'
     A                                 15  1'.'
     A                                 16  1'.'
     A                                 17  1'.'
     A                                 18  1'.'
     A                                 19  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                 20 63'Press "F3" to exit'
     A            DATE           8A  B  1 72DSPATR(PR)
     A                                      OVRDTA
     A            ZON1           4A  B  8 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            ZON2           4A  B 10 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1DSPATR(BL)                         -
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
