     A                                      DSPSIZ(24 80 *DS3)
     A                                      INDARA
     A                                      INVITE
     A                                      PRINT
     A                                      CHGINPDFT
     A          R ZONPRTMAIN
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF06
     A                                      CF08
     A                                  1  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                  2  1':'
     A                                  2 79':'
     A                                  3  1':'
     A                                  3 13'-----------------------------------
     A                                      -------------------'
     A                                  3 79':'
     A                                  4  1':'
     A                                  4 13':  S P O O L E D   P R I N T E R S'
     A                                  4 50'B Y   Z O N E  :'
     A                                  4 79':'
     A                                  5  1':'
     A                                  5 13'-----------------------------------
     A                                      -------------------'
     A                                  5 79':'
     A                                  6  1':'
     A                                  6 79':'
     A                                  7  1':'
     A                                  7 17'ZONE OR CRAFT IDENTIFIER:'
     A                                  7 52'Enter each Zone and'
     A                                  7 79':'
     A                                  8  1':'
     A                                  8 52'plantwide Craft and'
     A                                  8 79':'
     A                                  9  1':      PRINTER SPOOLER NUMBERS:'
     A                                  9 52'its associated spooler     :'
     A                                 10  1':'
     A                                 10 52'numbers.'
     A                                 10 79':'
     A                                 11  1':'
     A                                 11 14'MAINTENANCE PRINTER IN ZONE:'
     A                                 11 79':'
     A                                 12  1':'
     A                                 12 52'NOTE:'
     A                                 12 79':'
     A                                 13  1':'
     A                                 13 25'PLANNERS PRINTER:'
     A                                 13 52'Maintenance printer'
     A                                 13 79':'
     A                                 14  1':'
     A                                 14 52'must be entered, other     :'
     A                                 15  1':'
     A                                 15 24'ENGINEERS PRINTER:'
     A                                 15 52'printers, if left blank,   :'
     A                                 16  1':'
     A                                 16 52'will be set to the same    :'
     A                                 17  1':'
     A                                 17 25'MANAGERS PRINTER:'
     A                                 17 52'spooler number as the      :'
     A                                 18  1':'
     A                                 18 52'maintenance printer.'
     A                                 18 79':'
     A                                 19  1':'
     A                                 19 79':'
     A                                 20  1':'
     A                                 20 79':'
     A                                 21  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 22  1':      ENTER DATA AND PRESS APPROP-
     A                                      RIATE FUNCTION KEY TO UPDATE FILE'
     A                                 22 79':'
     A                                 23  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            ZONE           4A  B  7 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            ZP             2A  B 11 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            PP             2A  B 13 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            EP             2A  B 15 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            MP             2A  B 17 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            OP             2A  B 19  4DSPATR(PR)
     A                                      OVRDTA
     A            TEXT          60A  B 19 10DSPATR(PR)
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-ADD RECORD f2-CHANGE REC-
     A                                      ORD f8-DELETE RECORD f6-DISPLAY FIL-
     A                                      E f3-EXIT PROGRAM')
     A                                      DSPATR(PR)
     A  98                                  OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R ZPRTDISP
     A                                      SFL
     A            ZDISP          4A  B  7  6DSPATR(PR)
     A            VDISP          2A  B  7 16DSPATR(PR)
     A            PDISP          2A  B  7 20DSPATR(PR)
     A            EDISP          2A  B  7 24DSPATR(PR)
     A            MDISP          2A  B  7 28DSPATR(PR)
     A            XDISP          2A  B  7 32DSPATR(PR)
     A          R ZPRTLIST
     A                                      PUTOVR
     A                                      CF01
     A                                      CF03
     A                                      CF08
     A                                      SFLCTL(ZPRTDISP)
     A                                      OVERLAY
     A  75                                  SFLDSP
     A  76                                  SFLDSPCTL
     A  77                                  SFLCLR
     A N74                                  SFLEND(*MORE)
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(30)
     A                                      SFLLIN(13)
     A                                  2 20'    Z O N E   P R I N T E R   L I -
     A                                      S T'
     A                                      DSPATR(HI BL)
     A                                  4  5'ZONE OR'
     A                                  4 16'SPOOLER NUMBERS:'
     A                                  4 46'ZONE OR'
     A                                  4 57'SPOOLER NUMBERS:'
     A                                  5  5'CRAFT:     ZP  PL  EN  MG'
     A                                  5 46'CRAFT:     ZP  PL  EN  MG'
     A                                  6  2'-----------------------------------
     A                                      ------------------------------------
     A                                      --------'
     A          R ZPRTSEL
     A                                 23 12'ZP - Zone'
     A                                 23 57'PL - Planner'
     A                                 24 12'EN - Engineer'
     A                                 24 57'MG - Manager'
     A                                 24 31'F3/F8 - EXIT SCREEN'
     A                                      DSPATR(HI BL)
