000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.  CBLOWSRT.
000400 AUTHOR.  KURT MOVSESIAN.
000500*REMARKS.
000600
000700**************************************************************
000800*                                                            *
000900*    C B L O W S R T                                         *
003300*                                                            *
003400**************************************************************
003700
003800 ENVIRONMENT DIVISION.
003900 CONFIGURATION SECTION.
004000 SOURCE-COMPUTER.  HP-3000.
004100 OBJECT-COMPUTER.  HP-3000.
004200
004600 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
004800
004900 DATA DIVISION.
005000
005200 WORKING-STORAGE SECTION.
007000
007100**************************************************************
007200**                                                          **
007300**            L I N K A G E   S E C T I O N                 **
007400**                                                          **
007500**************************************************************
007600
007700 LINKAGE SECTION.
007800
007900 01  CBLOWSRT-PARMS.
008000     05  CBLOWSRT-MODE            PIC S9(4).
008100     05  BLUPDATA-FNUM            PIC S9(4) BINARY.
008200     05  FILLER                   PIC X(20).
008300
008400 01  BASE                         PIC X(16).
008500
008600 01  BU-PGM-NAME                  PIC X(8).
008700
008800 01  STATUS-AREA.
008900     05  COND-WORD                PIC S9(4)   BINARY.
009000     05  DATA-LENG                PIC S9(4)   BINARY.
009100     05  RCD-NO                   PIC S9(9)   BINARY.
009200     05  CHAIN-LENG               PIC S9(9)   BINARY.
009300     05  BKWD-ADDR                PIC S9(9)   BINARY.
009400     05  FWRD-ADDR                PIC S9(9)   BINARY.
009500
009600 01  VIEW-COMAREA.
009700     05  FILLER                   PIC X(118).
009800     05  FILLER                   PIC S9(4) BINARY.
009900
010000 01  KSAM-STATUS.
010100     05  FILLER                   PIC X(2).
010200
010300 01  BU-DISPLAY-MSG.
010400     05  BU-DISPLAY-MSG-1         PIC X(1).
010500     05  FILLER                   PIC X(59).
010600
010700 01  BU-DISPLAY-FLDS.
010800     05  BU-DISPLAY-LINE  OCCURS 5 TIMES.
010900         10  BU-DISPLAY-FLD       PIC X(14).
011000         10  BU-DISPLAY-FLD9      PIC S9(8).
011100
011400 PROCEDURE DIVISION USING CBLOWSRT-PARMS,
011500                          BASE,
011600                          BU-PGM-NAME,
011700                          STATUS-AREA,
011800                          VIEW-COMAREA,
011900                          KSAM-STATUS,
012000                          BU-DISPLAY-MSG
012100                          BU-DISPLAY-FLDS.
012200
012500 BEGIN-HERE.
012600     PERFORM 60-MAIN  THRU  60-M-X.
012700     GOBACK.
012800
015200 60-MAIN.
015300     IF CBLOWSRT-MODE = 1
019500         MOVE 2 TO CBLOWSRT-MODE
015500     ELSE
015600     IF CBLOWSRT-MODE = 2
               CALL "TBLOWUP" USING BASE, BU-PGM-NAME,
                 STATUS-AREA, VIEW-COMAREA, KSAM-STATUS,
                 BU-DISPLAY-MSG, BU-DISPLAY-FLDS.
015800
015900 60-M-X.
016000     EXIT.
