000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          CBUDNUM.
000400 AUTHOR.              C HILLES.
000500 DATE-WRITTEN.        10/28/87.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*D   BUDGET NUMBER CONVERSION PROGRAM.  BUDGET NUMBER IN ANY
001100*D   FORMAT IS PASSED TO THIS PROGRAM, AND ALL 4 POSSIBLE FORMATS
001200*D   ARE RETURNED.
001300*D   1. BUDGET WITH DASHES AND R STRIPPED,     BUDNUM-NODASH-NOREV
001400*D      WITHOUT REVISION
001500*D      XXXXXXXXXX           X(10)
001600*D   2. BUDGET WITH DASHES AND R STRIPPED,     BUDNUM-NODASH-REV
001700*D      WITH REVISION
001800*D      XXXXXXXXXX01         X(12)
001900*D   3. FULL BUDGET NUMBER WITHOUT REVISION    BUDNUM-DASH-NOREV
002000*D      XXX-XX-XX-XXX        X(13)
002100*D   4. FULL BUDGET NUMBER:                    BUDNUM-DASH-REV
002200*D      XXX-XX-XX-XXXR01     X(16)
002300
002400 ENVIRONMENT DIVISION.
002500 CONFIGURATION SECTION.
002600 SOURCE-COMPUTER.  HP-3000.
002700 OBJECT-COMPUTER.  HP-3000.
002800
002900 DATA DIVISION.
003000 WORKING-STORAGE SECTION.
003100 LINKAGE SECTION.
003200 01  BUDNUM-IN.
003300     05  BUDNUM-1                  PIC X(3).
003400     05  BUDNUM-DASH-1             PIC X(1).
003500     05  BUDNUM-2                  PIC X(2).
003600     05  BUDNUM-DASH-2             PIC X(1).
003700     05  BUDNUM-3                  PIC X(2).
003800     05  BUDNUM-DASH-3             PIC X(1).
003900     05  BUDNUM-4.
004000         10  BUDNUM-4-BNR-TEST     PIC X(2).
004100         10  FILLER                PIC X(1).
004200     05  BUDNUM-R                  PIC X(1).
004300     05  BUDNUM-REV                PIC X(2).
004400
004500 01  BUDNUM-NODASH-NOREV.
004600     05  BNN-NUM-1                 PIC X(3).
004700     05  BNN-NUM-2                 PIC X(2).
004800     05  BNN-NUM-3                 PIC X(2).
004900     05  BNN-NUM-4                 PIC X(3).
005000
005100 01  BUDNUM-NODASH-REV.
005200     05  BNR-NUM-1                 PIC X(3).
005300     05  BNR-NUM-2                 PIC X(2).
005400     05  BNR-NUM-3                 PIC X(2).
005500     05  BNR-NUM-4                 PIC X(3).
005600     05  BNR-REV                   PIC X(2).
005700
005800 01  BUDNUM-DASH-NOREV.
005900     05  BDN-NUM-1                 PIC X(3).
006000     05  BDN-DASH-1                PIC X(1).
006100     05  BDN-NUM-2                 PIC X(2).
006200     05  BDN-DASH-2                PIC X(1).
006300     05  BDN-NUM-3                 PIC X(2).
006400     05  BDN-DASH-3                PIC X(1).
006500     05  BDN-NUM-4                 PIC X(3).
006600
006700 01  BUDNUM-DASH-REV.
006800     05  BDR-NUM-1                 PIC X(3).
006900     05  BDR-DASH-1                PIC X(1).
007000     05  BDR-NUM-2                 PIC X(2).
007100     05  BDR-DASH-2                PIC X(1).
007200     05  BDR-NUM-3                 PIC X(2).
007300     05  BDR-DASH-3                PIC X(1).
007400     05  BDR-NUM-4                 PIC X(3).
007500     05  BDR-R                     PIC X(1).
007600     05  BDR-REV                   PIC X(2).
007700
007800
007900 PROCEDURE DIVISION USING          BUDNUM-IN,
008000                                   BUDNUM-NODASH-NOREV,
008100                                   BUDNUM-NODASH-REV,
008200                                   BUDNUM-DASH-NOREV,
008300                                   BUDNUM-DASH-REV.
008400
008500 6000-MAIN.
008600     MOVE "-"                      TO   BDN-DASH-1,
008700                                        BDN-DASH-2,
008800                                        BDN-DASH-3,
008900                                        BDR-DASH-1,
009000                                        BDR-DASH-2,
009100                                        BDR-DASH-3.
009200     MOVE "R"                      TO   BDR-R.
009300*------ TYPE 4: FULL BUDGET NUMBER
009400     IF BUDNUM-DASH-1 = "-" AND BUDNUM-DASH-2 = "-"
009500     AND BUDNUM-DASH-3 = "-" AND BUDNUM-R = "R"
009600         PERFORM 7000-MOVE-NUMS-1
009700         MOVE BUDNUM-REV           TO   BNR-REV,
009800                                        BDR-REV
009900     ELSE
010000*------ TYPE 3: FULL BUDGET NO REVISION
010100     IF BUDNUM-DASH-1 = "-" AND BUDNUM-DASH-2 = "-"
010200     AND BUDNUM-DASH-3 = "-"
010300         PERFORM 7000-MOVE-NUMS-1
010400         MOVE "  "                 TO   BNR-REV,
010500                                        BDR-REV
010600*------ TYPE 3, BUT WITH A FEW DASHES MISSING
010700     ELSE
010800     IF BUDNUM-DASH-1 = "-"
010900         PERFORM 7000-MOVE-NUMS-1
011000         MOVE "  "                 TO   BNR-REV,
011100                                        BDR-REV
011200*------ TYPE 2: DASHES AND R STRIPPED, WITH REVISION
011300     ELSE
011400     IF BUDNUM-4-BNR-TEST NUMERIC
011500         MOVE BUDNUM-IN            TO   BUDNUM-NODASH-REV
011600         PERFORM 7100-MOVE-NUMS-2
011700         MOVE BNR-REV              TO   BDR-REV
011800*------ TYPE 1: DASHES AND R STRIPPED, NO REVISION
011900     ELSE
012000         MOVE BUDNUM-IN            TO   BUDNUM-NODASH-REV
012100         PERFORM 7100-MOVE-NUMS-2
012200         MOVE "  "                 TO   BNR-REV,
012300                                        BDR-REV.
012400
012500 6990-MAIN-X.
012600     GOBACK.
012700
012800
012900 7000-MOVE-NUMS-1.
013000     MOVE BUDNUM-1                 TO   BNN-NUM-1,
013100                                        BNR-NUM-1,
013200                                        BDN-NUM-1,
013300                                        BDR-NUM-1.
013400
013500     MOVE BUDNUM-2                 TO   BNN-NUM-2,
013600                                        BNR-NUM-2,
013700                                        BDN-NUM-2,
013800                                        BDR-NUM-2.
013900
014000     MOVE BUDNUM-3                 TO   BNN-NUM-3,
014100                                        BNR-NUM-3,
014200                                        BDN-NUM-3,
014300                                        BDR-NUM-3.
014400
014500     MOVE BUDNUM-4                 TO   BNN-NUM-4,
014600                                        BNR-NUM-4,
014700                                        BDN-NUM-4,
014800                                        BDR-NUM-4.
014900
015000 7100-MOVE-NUMS-2.
015100     MOVE BNR-NUM-1                TO   BNN-NUM-1,
015200                                        BDN-NUM-1,
015300                                        BDR-NUM-1.
015400
015500     MOVE BNR-NUM-2                TO   BNN-NUM-2,
015600                                        BDN-NUM-2,
015700                                        BDR-NUM-2.
015800
015900     MOVE BNR-NUM-3                TO   BNN-NUM-3,
016000                                        BDN-NUM-3,
016100                                        BDR-NUM-3.
016200
016300     MOVE BNR-NUM-4                TO   BNN-NUM-4,
016400                                        BDN-NUM-4,
016500                                        BDR-NUM-4.
