001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.     CCODECHK.
001300 AUTHOR.         ANNETTE M. KRAUSS.
001600 INSTALLATION.   THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
001400 DATE-WRITTEN.   FEBRUARY 5, 1986.
001500 DATE-COMPILED.
001700*REMARKS.
001800**************************************************************
001900*D  C C O D E C H K      CODE CHECK SUBPROGRAM               *
002000*D                                                           *
002100*D  THIS SUBPROGRAM DETERMINES IF AN MSTORERM "CORP-CODE"    *
002200*D  IS A "CORPORATE" CODE OR A "PLANT" CODE.  THE CALLING    *
002300*D  PROGRAM PASSES BOTH THE CODE AND THE PLANT NUMBER, AND   *
002400*D  THIS SUBPROGRAM RETURNS A ONE BYTE FLAG TO IDENTIFY THE  *
002500*D  CODE TYPE.                                               *
002600*                                                            *
002700*   WHETHER A CODE IS A "CORPORATE" CODE OR A "PLANT" CODE   *
002800*   IS FUNCTION OF BOTH THE PLANT AND THE ACTUAL FORMAT OF   *
002900*   THE CODE ITSELF.   IF A PLANT IS DEFINED AS A            *
003000*   "STAND ALONE" PLANT IN THE COPYLIB.DB MEMBER PLANTS THEN *
003100*   ALL OF THAT PLANT'S MSTORERM CODES ARE CONSIDERED        *
003200*   "PLANT" CODES.   FOR ALL OTHER PLANTS, THE FORMAT OF THE *
003300*   CODE IDENTIFIES THE TYPE OF CODE IT IS.   THE CURRENT    *
003400*   RULE ESTABLISHED BY CME IS THAT A "PLANT" CODE WILL      *
003500*   CONTAIN AT LEAST ONE ALPHABETIC CHARACTER (A THRU Z) IN  *
003600*   POSITIONS 5, 6, AND 7 OF THE SEVEN CHARACTER CODE.       *
003700*   ALTERNATIVELY, A "CORPORATE" CODE WILL CONTAIN ONLY      *
003800*   NUMERIC CHARACTERS AND/OR SPACES IN POSITIONS 5, 6, AND  *
003900*   7.                                                       *
004000*                                                            *
004100**************************************************************
      *C  07APR1994     DAVE PLUM
      *C  RECOMPILED TO PICK UP AN UPDATED VERSION OF COPYLIB MEMBER
      *C  "PLANTS".
      *C
      *C  03OCT1994     DAVE PLUM
      *C  RECOMPILED TO PICK UP AN UPDATED VERSION OF COPYLIB MEMBER
      *C  "PLANTS".
      *C  (NOW FOUND IN "COPYLIB" INSTEAD OF "C O P Y C S I S".)
      *C
      *C  12APR1997     DAVE PLUM
      *C  RECOMPILED TO PICK REVISED "PLANTS" COPYLIB MEMBER.
      *C
      *C  19DEC1997     DAVE PLUM
      *C  RECOMPILED TO PICK REVISED "PLANTS" COPYLIB MEMBER.
      *C
004300 ENVIRONMENT DIVISION.
004400 CONFIGURATION SECTION.
004500 SOURCE-COMPUTER.  IBM-AS400.
004600 OBJECT-COMPUTER.  IBM-AS400.
004700
004800 DATA DIVISION.
004900 WORKING-STORAGE SECTION.
005000
005100**************************************************************
005200**      W O R K I N G   S T O R A G E   S E C T I O N       **
005300**************************************************************
005400
005500 COPY PLANTS IN COPYLIB.
005600
005700**************************************************************
005800**         L I N K A G E   S E C T I O N                    **
005900**************************************************************
006000
006100 LINKAGE SECTION.
006200
006300 01  CCODECHK-PARMS.
006400     05  CODE-CHK-IN.
006500         10  CODE-CHK-1-4           PIC X(4).
006600         10  CODE-CHK-5             PIC X.
006700         10  CODE-CHK-6             PIC X.
006800         10  CODE-CHK-7             PIC X.
006900     05  PLANT-CHK                  PIC X(3).
007000     05  CODE-CHK-FLAG              PIC X.
007100
007200*************************************************************
007300**#########################################################**
007400*************************************************************
007500**                                                         **
007600**          P R O C E D U R E    D I V I S I O N           **
007700**                                                         **
007800*************************************************************
007900**#########################################################**
008000*************************************************************
008100
008200
008300 PROCEDURE DIVISION USING CCODECHK-PARMS.
008400
008500 BEGIN-HERE.
008600     MOVE SPACES TO CODE-CHK-FLAG.
008700     PERFORM 6-MAIN THRU 6-MAIN-X.
008800     GOBACK.
008900
009000 6-MAIN.
009100     MOVE PLANT-CHK TO WHICH-PLANT.
009200
009300     IF STAND-ALONE-PLANT
009400       MOVE "P" TO CODE-CHK-FLAG
009500     ELSE
009600       IF  ((CODE-CHK-5 IS NUMERIC OR CODE-CHK-5 = SPACE)
009700        AND (CODE-CHK-6 IS NUMERIC OR CODE-CHK-6 = SPACE)
009800        AND (CODE-CHK-7 IS NUMERIC OR CODE-CHK-7 = SPACE))
009900           MOVE "C" TO CODE-CHK-FLAG
010000       ELSE
010100           MOVE "P" TO CODE-CHK-FLAG.
010200
010300 6-MAIN-X.
010400     EXIT.
