       IDENTIFICATION DIVISION.
       PROGRAM-ID.     CCODEDEL.
       AUTHOR.         C.I.HILLES.
       DATE-WRITTEN.   4/1/86.
       DATE-COMPILED.
      *INSTALLATION.   THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
      *REMARKS.
      *D   THIS SUBPROGRAM DELETES A CORPORATE CODE OUT OF THE STORES
      *D   DATABASE.  IT DOES NOT DISPLAY A SCREEN.  IT DOES NOT PERFORM
      *D   ANY EDITING.  THE CALLING PROGRAM IS RESPONSIBLE FOR ANY EDITING.
      *D   THE CORPORATE CODE PASSED WILL BE SLICED OUT OF THE DATABASE
      *D   REGARDLESS OF WHAT MIGHT EXIST IN OTHER DATASETS REFERENCING
      *D   THAT CORP CODE.
      *C
      *C   09/14/93   JS BUNGO  REQUEST 6420.
      *C     ADDED CALL TO SJOBPCOD TO DELETE A CODE FROM MMISA
      *C     PM-JOBPLAN WHEN A CODE IS DELETED FROM STORES.
      *C
      *C   09/20/93   JS BUNGO  REQUEST 5643.
      *C     ADDED CALL TO SCCLKCHG TO DELETE A CODE FROM MMISA
      *C     CORP-CODE-LINK AND CC-NOTE-MSTR WHEN A CODE IS DELETED
      *C     FROM STORES.
      *C
      *C   01/28/94   JS BUNGO
      *C     ADDED CALL TO SCCALTCH TO DELETE A CODE FROM THE
      *C     ALTERNATE KEY FILE WHEN A CODE IS DELETED FROM STORES.
      *C
      *C   09/12/96  JEFF BUNGO
      *C     EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C     RECOMPILE PICK UP COPYLIB CHANGES.
      *C
      *C   09/26/96  JEFF BUNGO
      *C     DELETE ENTRIES FROM DRCVCORR AND DCHATNO.
      *C
      *C   1/14/97    BILL ROXBURY REQ #95-012
      *C     DELETE ENTRIES FROM NEW RECEIVING FILE (MCFLCSRCPT).
      *C
      *C  11/25/97    JEFF BUNGO   REQ #97-017
      *C     ADD USAGE FIELDS FOR DIRECT DELIVERY.  DD USAGE
      *C     TO BE STORED IN ADDITIONAL FIELD AND TOTAL USAGE.
      *C     STORE ISSUE USAGE CALCULATED BY TOTAL USAGE - DD USAGE.
      *C

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  HP-3000.
       OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DWLITEM-CD-O
               ASSIGN TO DATABASE-MCFLCS1502
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DMANPART-CD-O
               ASSIGN TO DATABASE-MCFLCS3603
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DDESC-CD-O
               ASSIGN TO DATABASE-MCFLCS1401
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DDESC2-CD-O
               ASSIGN TO DATABASE-MCFLCS3101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DRESERVE-CD-O
               ASSIGN TO DATABASE-MCFLCS1301
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DCODE-CD-O
               ASSIGN TO DATABASE-MCFLCS3402
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DREQITM-CD-O
               ASSIGN TO DATABASE-MCFLCS2202
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DVENDITM-CD-O
               ASSIGN TO DATABASE-MCFLCS0802
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DPOITEM-CD-O
               ASSIGN TO DATABASE-MCFLCS1001
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DINVITM-CD-O
               ASSIGN TO DATABASE-MCFLCS2602
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DRCVITEM-CD-O
               ASSIGN TO DATABASE-MCFLCS1202
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DRCVCORR-CD-O
               ASSIGN TO DATABASE-MCFLCS5402
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DCHATNO-CD-O
               ASSIGN TO DATABASE-MCFLCS5501
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DTALLY-CD-O
               ASSIGN TO DATABASE-MCFLCS4703
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-CD-O
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT USAGEFIL-CD-O
               ASSIGN TO DATABASE-MCFLCSUSAG
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT RECEIPTFIL-CD-O
               ASSIGN TO DATABASE-MCFLCSRCPT
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       FD  DWLITEM-CD-O
           LABEL RECORDS ARE STANDARD.
       01  DWLITEM-CD-REC-O.
           COPY DDS-MCRPCS1500  OF MCFLCS1502.

       FD  DMANPART-CD-O
           LABEL RECORDS ARE STANDARD.
       01  DMANPART-CD-REC-O.
           COPY DDS-MCRPCS3600  OF MCFLCS3603.

       FD  DDESC-CD-O
           LABEL RECORDS ARE STANDARD.
       01  DDESC-CD-REC-O.
           COPY DDS-MCRPCS1400  OF MCFLCS1401.

       FD  DDESC2-CD-O
           LABEL RECORDS ARE STANDARD.
       01  DDESC2-CD-REC-O.
           COPY DDS-MCRPCS3100  OF MCFLCS3101.

       FD  DRESERVE-CD-O
           LABEL RECORDS ARE STANDARD.
       01  DRESERVE-CD-REC-O.
           COPY DDS-MCRPCS1300  OF MCFLCS1301.

       FD  DCODE-CD-O
           LABEL RECORDS ARE STANDARD.
       01  DCODE-CD-REC-O.
           COPY DDS-MCRPCS3400  OF MCFLCS3402.

       FD  DREQITM-CD-O
           LABEL RECORDS ARE STANDARD.
       01  DREQITM-CD-REC-O.
           COPY DDS-MCRPCS2200  OF MCFLCS2202.

       FD  DVENDITM-CD-O
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM-CD-REC-O.
           COPY DDS-MCRPCS0800  OF MCFLCS0802.

       FD  DPOITEM-CD-O
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-CD-REC-O.
           COPY DDS-MCRPCS1000  OF MCFLCS1001.

       FD  DINVITM-CD-O
           LABEL RECORDS ARE STANDARD.
       01  DINVITM-CD-REC-O.
           COPY DDS-MCRPCS2600  OF MCFLCS2602.

       FD  DRCVITEM-CD-O
           LABEL RECORDS ARE STANDARD.
       01  DRCVITEM-CD-REC-O.
           COPY DDS-MCRPCS1200  OF MCFLCS1202.

       FD  DRCVCORR-CD-O
           LABEL RECORDS ARE STANDARD.
       01  DRCVCORR-CD-REC-O.
           COPY DDS-MCRPCS5400  OF MCFLCS5402.

       FD  DCHATNO-CD-O
           LABEL RECORDS ARE STANDARD.
       01  DCHATNO-CD-REC-O.
           COPY DDS-MCRPCS5500  OF MCFLCS5501.

       FD  DTALLY-CD-O
           LABEL RECORDS ARE STANDARD.
       01  DTALLY-CD-REC-O.
           COPY DDS-MCRPCS4700  OF MCFLCS4703.

       FD  MSTORERM-CD-O
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-CD-REC-O.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  USAGEFIL-CD-O
           LABEL RECORDS ARE STANDARD.
       01  USAGEFIL-CD-REC-O.
           COPY DDS-MCRPCSUSAG  OF MCFLCSUSAG.

       FD  RECEIPTFIL-CD-O
           LABEL RECORDS ARE STANDARD.
       01  RECEIPTFIL-CD-REC-O.
           COPY DDS-MCRPCSRCPT  OF MCFLCSRCPT.

      *------ FD STATEMENT AREA FOR IBM ONLY ------*

       WORKING-STORAGE SECTION.
       77  SUB                           PIC S9(4) COMP-4 VALUE 0.
      **************************************************************
      **                                                          **
      **               K S A M   W O R K                          **
      **                                                          **
      **************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

       01  KEY-VALUE                     PIC X(8)  VALUE SPACES.
       01  KEY-LOC                       PIC S9(4) COMP-4 VALUE 3.
       01  KEY-LENGTH                    PIC S9(4) COMP-4 VALUE 8.
       01  RELOP                         PIC S9(4) COMP-4 VALUE 2.
       01  RECSIZE                       PIC S9(4) COMP-4 VALUE 66.
       01  RESULT                        PIC 9(4)  VALUE ZEROS.
       01  LOCK-COND                     PIC S9(4) COMP-4 VALUE 1.

       01  NEW-CODE                     PIC X(08)  VALUE SPACES.
       01  NEW-UM                       PIC X(02)  VALUE SPACES.
       01  NEW-UM-CF                    PIC S9(8)  VALUE ZEROS.
       01  BU-DISPLAY-FLDS.
           05  BU-DISPLAY-LINE OCCURS 5 TIMES.
               10  BU-DISPLAY-FLD       PIC X(14).
               10  BU-DISPLAY-FLD9      PIC S9(8).

       COPY USAGEFIL IN COPYLIB.

       01  BUF-RECEIPTFIL.
           05  R-CORP-CODE               PIC X(8).
           05  R-MONTHS                  OCCURS 14 TIMES.
               10  R-MTH-RECEIPTS        PIC S9(9) COMP-4.

      ********************************************
      **     I-O TYPE :  0 = INPUT ONLY         **
      **                 1 = OUTPUT ONLY        **
      **                 2 = INPUT-OUTPUT       **
      **                                        **
      **     A-MODE      0 = SEQUENTIAL ONLY    **
      **                 1 = RANDOM ONLY        **
      **                 2 = DYNAMIC            **
      ********************************************

       01  FILE-TABLE.
           05  FILENUMBER               PIC S9(4) COMP-4 VALUE 0.
           05  FILENAME                 PIC X(8)  VALUE "USAGEFIL".
           05  I-O-TYPE                 PIC S9(4) COMP-4 VALUE 2.
           05  A-MODE                   PIC S9(4) COMP-4 VALUE 2.
           05  PREV-OP                  PIC S9(4) COMP-4 VALUE 0.

       01  KSAM-STATUS.
           05  K-STAT-1                 PIC X.
           05  FILLER                   PIC X.

      **************************************************************
      **                                                          **
      **                     DATA BASE WORK                       **
      **                                                          **
      **************************************************************

       01  CODE-ARG                     PIC X(8).

       COPY DBMODES    IN COPYLIB.

       01  DSET-TABLE-AREA.
           05  FILLER                PIC X(16) VALUE "DWLITEM;        ".
           05  FILLER                PIC X(16) VALUE "DMANPART;       ".
           05  FILLER                PIC X(16) VALUE "DDESC;          ".
           05  FILLER                PIC X(16) VALUE "DDESC2;         ".
           05  FILLER                PIC X(16) VALUE "DDESC3;         ".
           05  FILLER                PIC X(16) VALUE "DRESERVE;       ".
           05  FILLER                PIC X(16) VALUE "DCODE;          ".
           05  FILLER                PIC X(16) VALUE "DREQITM;        ".
           05  FILLER                PIC X(16) VALUE "DVENDITM;       ".
           05  FILLER                PIC X(16) VALUE "DPOITEM;        ".
           05  FILLER                PIC X(16) VALUE "DINVITM;        ".
           05  FILLER                PIC X(16) VALUE "DRCVITEM;       ".
           05  FILLER                PIC X(16) VALUE "DTALLY;         ".
           05  FILLER                PIC X(16) VALUE "DRCVCORR;       ".
           05  FILLER                PIC X(16) VALUE "DCHATNO;        ".

       01  DSET-TABLE REDEFINES DSET-TABLE-AREA.
           05  DSET-TABLE-NAME OCCURS 13 TIMES PIC X(16).

       01 SOME-DB-STUFF.
           05  ALL-ITEMS             PIC X(2)  VALUE "@;".
           05  CODE-SEARCH           PIC X(16) VALUE "CORP-CODE;".
           05  DSET-NAME             PIC X(16) VALUE SPACES.

      **************************************************************
      **************************************************************
      **                                                          **
      **                     DATA BASE BUFFERS                    **
      **                                                          **
      **************************************************************
      **************************************************************
       01  BUF-ANY                   PIC X(900).

      **************************************************************
      **                                                          **
      **            L I N K A G E   S E C T I O N                 **
      **                                                          **
      **************************************************************
       LINKAGE SECTION.
       01  BASE                          PIC X(10).
       COPY DBSTAT     IN COPYLIB.
       01  BU-DISPLAY-MSG.
           05  BU-DISPLAY-SUBPROG.
               10  BU-DISPLAY-MSG-1      PIC X(1).
               10  FILLER                PIC X(8).
           05  BU-DISPLAY-REST           PIC X(51).

       01  PASSED-CORP-CODE              PIC X(8).

       01  PASSED-KSAM-FILE-NUMBER       PIC S9(4) COMP-4.
       01  PASSED-PADDING                PIC X(50).

       PROCEDURE DIVISION USING BASE,
                                STATUS-AREA,
                                BU-DISPLAY-MSG,
                                PASSED-CORP-CODE
                                PASSED-KSAM-FILE-NUMBER,
                                PASSED-PADDING.
       6000-MAIN.
           PERFORM 9980-OPENS.
           MOVE PASSED-CORP-CODE         TO   CODE-ARG.
           MOVE 0                        TO   SUB.
       6310-DELETE-DETAIL-LOOP.
           ADD 1                         TO   SUB.
           IF SUB > 13
               GO TO 6390-UNLOCK.

           MOVE DSET-TABLE-NAME (SUB)    TO   DSET-NAME.
           PERFORM 6500-DELETE-DETAIL THRU 6590-DD-X.
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               GO TO 6990-MAIN-X.

           GO TO 6310-DELETE-DETAIL-LOOP.

       6390-UNLOCK.

       6400-DELETE-MSTORERM.
           MOVE "MSTORERM"               TO   DSET-NAME.
      *    CALL "DBGET" USING BASE, DSET-NAME, MODE7,
      *      STATUS-AREA, ALL-ITEMS, BUF-ANY,
      *      PASSED-CORP-CODE.
           PERFORM 9999-DBGET7-MSTORERM-CD-O.
           IF COND-WORD = 17
               GO TO 6990-MAIN-X.

      *    CALL "DBDELETE" USING BASE, DSET-NAME, MODE1, STATUS-AREA.
           PERFORM 9999-DBDELETE-MSTORERM-CD-O.

       6419-DELETE-ALT-KEY.
           MOVE SPACES TO BU-DISPLAY-MSG.
           CALL "SCCALTCH" USING PASSED-CORP-CODE NEW-CODE
                          BU-DISPLAY-MSG BU-DISPLAY-FLDS.
           IF BU-DISPLAY-MSG NOT = SPACES
               MOVE BU-DISPLAY-FLD9 (3) TO COND-WORD
               GO TO 6990-MAIN-X.

       6420-DELETE-PM-JOBPLAN.
           MOVE SPACES TO BU-DISPLAY-MSG.
           CALL "SJOBPCOD" USING PASSED-CORP-CODE NEW-CODE NEW-UM
                NEW-UM-CF BU-DISPLAY-MSG BU-DISPLAY-FLDS.
           IF BU-DISPLAY-MSG NOT = SPACES
               MOVE BU-DISPLAY-FLD9 (3) TO COND-WORD
               GO TO 6990-MAIN-X.

       6425-DELETE-CC-LINK.
           MOVE SPACES TO BU-DISPLAY-MSG.
           CALL "SCCLKCHG" USING PASSED-CORP-CODE NEW-CODE
                          BU-DISPLAY-MSG BU-DISPLAY-FLDS.
           IF BU-DISPLAY-MSG NOT = SPACES
               MOVE BU-DISPLAY-FLD9 (3) TO COND-WORD
               GO TO 6990-MAIN-X.

       6450-DELETE-KSAM.
           MOVE PASSED-CORP-CODE         TO   KEY-VALUE.
      *    CALL "CKREADBYKEY" USING FILE-TABLE, KSAM-STATUS,
      *      USAGE-REC, KEY-VALUE, KEY-LOC, RECSIZE.
           PERFORM 9999-DBGET7-USAGEFIL-CD-O.
           IF COND-WORD = 17
               GO TO 6455-DELETE-RECEIPTS.

      *    CALL "CKDELETE" USING FILE-TABLE, KSAM-STATUS.
           PERFORM 9999-DBDELETE-USAGEFIL-CD-O.

       6455-DELETE-RECEIPTS.
           PERFORM 9999-DBGET7-RECEIPTFIL-CD-O.
           IF COND-WORD = 17
               GO TO 6990-MAIN-X.

           PERFORM 9999-DBDELETE-RECEIPTFIL-CD-O.

           GO TO 6990-MAIN-X.

       6500-DELETE-DETAIL.
      *    CALL "DBFIND" USING BASE, DSET-NAME, MODE1, STATUS-AREA,
      *      CODE-SEARCH, PASSED-CORP-CODE.
           PERFORM 9000-DBFIND.
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               GO TO 6590-DD-X.

       6510-GET-DETAIL-LOOP.
      *    CALL "DBGET" USING BASE, DSET-NAME, MODE5, STATUS-AREA,
      *      ALL-ITEMS, BUF-ANY, PASSED-CORP-CODE.
           PERFORM 9100-DBGET.
           IF COND-WORD = 15
               GO TO 6590-DD-X
           ELSE
           IF COND-WORD NOT = 0
               GO TO 6590-DD-X.

      *    CALL "DBDELETE" USING BASE, DSET-NAME, MODE1, STATUS-AREA.
           PERFORM 9200-DBDELETE.
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               GO TO 6590-DD-X.

           GO TO 6510-GET-DETAIL-LOOP.

       6590-DD-X.
           EXIT.

       6990-MAIN-X.
           PERFORM 9981-CLOSES.
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               MOVE BU-DISPLAY-MSG TO BU-DISPLAY-REST
               MOVE "CCODEDEL" TO BU-DISPLAY-SUBPROG.
           GOBACK.

       9000-DBFIND.
           IF DSET-NAME = "DWLITEM;"
               PERFORM 9999-DBFIND-DWLITEM-CD-O
           ELSE
           IF DSET-NAME = "DMANPART;"
               PERFORM 9999-DBFIND-DMANPART-CD-O
           ELSE
           IF DSET-NAME = "DDESC;"
               PERFORM 9999-DBFIND-DDESC-CD-O
           ELSE
           IF DSET-NAME = "DDESC2;"
               PERFORM 9999-DBFIND-DDESC2-CD-O
           ELSE
           IF DSET-NAME = "DRESERVE;"
               PERFORM 9999-DBFIND-DRESERVE-CD-O
           ELSE
           IF DSET-NAME = "DCODE;"
               PERFORM 9999-DBFIND-DCODE-CD-O
           ELSE
           IF DSET-NAME = "DREQITM;"
               PERFORM 9999-DBFIND-DREQITM-CD-O
           ELSE
           IF DSET-NAME = "DVENDITM;"
               PERFORM 9999-DBFIND-DVENDITM-CD-O
           ELSE
           IF DSET-NAME = "DPOITEM;"
               PERFORM 9999-DBFIND-DPOITEM-CD-O
           ELSE
           IF DSET-NAME = "DINVITM;"
               PERFORM 9999-DBFIND-DINVITM-CD-O
           ELSE
           IF DSET-NAME = "DRCVITEM;"
               PERFORM 9999-DBFIND-DRCVITEM-CD-O
           ELSE
           IF DSET-NAME = "DTALLY;"
               PERFORM 9999-DBFIND-DTALLY-CD-O
           ELSE
           IF DSET-NAME = "DRCVCORR;"
               PERFORM 9999-DBFIND-DRCVCORR-CD-O
           ELSE
           IF DSET-NAME = "DCHATNO;"
               PERFORM 9999-DBFIND-DCHATNO-CD-O.

        9100-DBGET.
           IF DSET-NAME = "DWLITEM;"
               PERFORM 9999-DBGET5-DWLITEM-CD-O
           ELSE
           IF DSET-NAME = "DMANPART;"
               PERFORM 9999-DBGET5-DMANPART-CD-O
           ELSE
           IF DSET-NAME = "DDESC;"
               PERFORM 9999-DBGET5-DDESC-CD-O
           ELSE
           IF DSET-NAME = "DDESC2;"
               PERFORM 9999-DBGET5-DDESC2-CD-O
           ELSE
           IF DSET-NAME = "DRESERVE;"
               PERFORM 9999-DBGET5-DRESERVE-CD-O
           ELSE
           IF DSET-NAME = "DCODE;"
               PERFORM 9999-DBGET5-DCODE-CD-O
           ELSE
           IF DSET-NAME = "DREQITM;"
               PERFORM 9999-DBGET5-DREQITM-CD-O
           ELSE
           IF DSET-NAME = "DVENDITM;"
               PERFORM 9999-DBGET5-DVENDITM-CD-O
           ELSE
           IF DSET-NAME = "DPOITEM;"
               PERFORM 9999-DBGET5-DPOITEM-CD-O
           ELSE
           IF DSET-NAME = "DINVITM;"
               PERFORM 9999-DBGET5-DINVITM-CD-O
           ELSE
           IF DSET-NAME = "DRCVITEM;"
               PERFORM 9999-DBGET5-DRCVITEM-CD-O
           ELSE
           IF DSET-NAME = "DTALLY;"
               PERFORM 9999-DBGET5-DTALLY-CD-O
           ELSE
           IF DSET-NAME = "DRCVCORR;"
               PERFORM 9999-DBGET5-DRCVCORR-CD-O
           ELSE
           IF DSET-NAME = "DCHATNO;"
               PERFORM 9999-DBGET5-DCHATNO-CD-O.

        9200-DBDELETE.
           IF DSET-NAME = "DWLITEM;"
               PERFORM 9999-DBDELETE-DWLITEM-CD-O
           ELSE
           IF DSET-NAME = "DMANPART;"
               PERFORM 9999-DBDELETE-DMANPART-CD-O
           ELSE
           IF DSET-NAME = "DDESC;"
               PERFORM 9999-DBDELETE-DDESC-CD-O
           ELSE
           IF DSET-NAME = "DDESC2;"
               PERFORM 9999-DBDELETE-DDESC2-CD-O
           ELSE
           IF DSET-NAME = "DRESERVE;"
               PERFORM 9999-DBDELETE-DRESERVE-CD-O
           ELSE
           IF DSET-NAME = "DCODE;"
               PERFORM 9999-DBDELETE-DCODE-CD-O
           ELSE
           IF DSET-NAME = "DREQITM;"
               PERFORM 9999-DBDELETE-DREQITM-CD-O
           ELSE
           IF DSET-NAME = "DVENDITM;"
               PERFORM 9999-DBDELETE-DVENDITM-CD-O
           ELSE
           IF DSET-NAME = "DPOITEM;"
               PERFORM 9999-DBDELETE-DPOITEM-CD-O
           ELSE
           IF DSET-NAME = "DINVITM;"
               PERFORM 9999-DBDELETE-DINVITM-CD-O
           ELSE
           IF DSET-NAME = "DRCVITEM;"
               PERFORM 9999-DBDELETE-DRCVITEM-CD-O
           ELSE
           IF DSET-NAME = "DTALLY;"
               PERFORM 9999-DBDELETE-DTALLY-CD-O
           ELSE
           IF DSET-NAME = "DRCVCORR;"
               PERFORM 9999-DBDELETE-DRCVCORR-CD-O
           ELSE
           IF DSET-NAME = "DCHATNO;"
               PERFORM 9999-DBDELETE-DCHATNO-CD-O.

       9980-OPENS.
           OPEN I-O DWLITEM-CD-O, DMANPART-CD-O, DDESC-CD-O,
                    DRESERVE-CD-O, DCODE-CD-O, DREQITM-CD-O,
                    DVENDITM-CD-O, DPOITEM-CD-O, DINVITM-CD-O,
                    DRCVITEM-CD-O, MSTORERM-CD-O, USAGEFIL-CD-O,
                    DDESC2-CD-O, DTALLY-CD-O DRCVCORR-CD-O
                    DCHATNO-CD-O RECEIPTFIL-CD-O.

       9981-CLOSES.
           CLOSE    DWLITEM-CD-O, DMANPART-CD-O, DDESC-CD-O,
                    DRESERVE-CD-O, DCODE-CD-O, DREQITM-CD-O,
                    DVENDITM-CD-O, DPOITEM-CD-O, DINVITM-CD-O,
                    DRCVITEM-CD-O, MSTORERM-CD-O, USAGEFIL-CD-O
                    DDESC2-CD-O DTALLY-CD-O  DRCVCORR-CD-O
                    DCHATNO-CD-O RECEIPTFIL-CD-O.

       9999-DBFIND-DWLITEM-CD-O.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DWLITEM-CD-REC-O.
           START DWLITEM-CD-O KEY = CORPCDE OF DWLITEM-CD-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DWLITEM-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBFIND-DMANPART-CD-O.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DMANPART-CD-REC-O.
           START DMANPART-CD-O KEY = CORPCDE OF DMANPART-CD-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DMANPART-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBFIND-DDESC-CD-O.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DDESC-CD-REC-O.
           START DDESC-CD-O KEY = CORPCDE OF DDESC-CD-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DDESC-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBFIND-DDESC2-CD-O.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DDESC2-CD-REC-O.
           START DDESC2-CD-O KEY = CORPCDE OF DDESC2-CD-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DDESC2-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBFIND-DRESERVE-CD-O.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DRESERVE-CD-REC-O.
           START DRESERVE-CD-O KEY = CORPCDE OF DRESERVE-CD-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DRESERVE-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBFIND-DCODE-CD-O.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DCODE-CD-REC-O.
           START DCODE-CD-O KEY = CORPCDE OF DCODE-CD-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DCODE-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBFIND-DREQITM-CD-O.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DREQITM-CD-REC-O.
           START DREQITM-CD-O KEY = CORPCDE OF DREQITM-CD-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DREQITM-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBFIND-DVENDITM-CD-O.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DVENDITM-CD-REC-O.
           START DVENDITM-CD-O KEY = CORPCDE OF DVENDITM-CD-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DVENDITM-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBFIND-DPOITEM-CD-O.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DPOITEM-CD-REC-O.
           START DPOITEM-CD-O KEY = CORPCDE OF DPOITEM-CD-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DPOITEM-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBFIND-DINVITM-CD-O.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DINVITM-CD-REC-O.
           START DINVITM-CD-O KEY = CORPCDE OF DINVITM-CD-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DINVITM-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBFIND-DRCVITEM-CD-O.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DRCVITEM-CD-REC-O.
           START DRCVITEM-CD-O KEY = CORPCDE OF DRCVITEM-CD-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DRCVITEM-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBFIND-DRCVCORR-CD-O.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DRCVCORR-CD-REC-O.
           START DRCVCORR-CD-O KEY = CORPCDE OF DRCVCORR-CD-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DRCVCORR-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBFIND-DCHATNO-CD-O.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DCHATNO-CD-REC-O.
           START DCHATNO-CD-O KEY = CORPCDE OF DCHATNO-CD-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DCHATNO-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBFIND-DTALLY-CD-O.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DTALLY-CD-REC-O.
           START DTALLY-CD-O KEY = CORPCDE OF DTALLY-CD-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DTALLY-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBGET5-DWLITEM-CD-O.
           MOVE 0 TO COND-WORD.
           READ DWLITEM-CD-O NEXT INTO BUF-ANY
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DWLITEM-CD-O"
                       TO BU-DISPLAY-MSG
                   MOVE 99 TO COND-WORD
           ELSE
           IF CORPCDE OF DWLITEM-CD-REC-O NOT = CODE-ARG
               MOVE 15 TO COND-WORD.

       9999-DBGET5-DMANPART-CD-O.
           MOVE 0 TO COND-WORD.
           READ DMANPART-CD-O NEXT INTO BUF-ANY
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DMANPART-CD-O"
                       TO BU-DISPLAY-MSG
                   MOVE 99 TO COND-WORD
           ELSE
           IF CORPCDE OF DMANPART-CD-REC-O NOT = CODE-ARG
               MOVE 15 TO COND-WORD.

       9999-DBGET5-DDESC-CD-O.
           MOVE 0 TO COND-WORD.
           READ DDESC-CD-O NEXT INTO BUF-ANY
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DDESC-CD-O"
                       TO BU-DISPLAY-MSG
                   MOVE 99 TO COND-WORD
           ELSE
           IF CORPCDE OF DDESC-CD-REC-O NOT = CODE-ARG
               MOVE 15 TO COND-WORD.

       9999-DBGET5-DDESC2-CD-O.
           MOVE 0 TO COND-WORD.
           READ DDESC2-CD-O NEXT INTO BUF-ANY
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DDESC2-CD-O"
                       TO BU-DISPLAY-MSG
                   MOVE 99 TO COND-WORD
           ELSE
           IF CORPCDE OF DDESC2-CD-REC-O NOT = CODE-ARG
               MOVE 15 TO COND-WORD.

       9999-DBGET5-DRESERVE-CD-O.
           MOVE 0 TO COND-WORD.
           READ DRESERVE-CD-O NEXT INTO BUF-ANY
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DRESERVE-CD-O"
                       TO BU-DISPLAY-MSG
                   MOVE 99 TO COND-WORD
           ELSE
           IF CORPCDE OF DRESERVE-CD-REC-O NOT = CODE-ARG
               MOVE 15 TO COND-WORD.

       9999-DBGET5-DCODE-CD-O.
           MOVE 0 TO COND-WORD.
           READ DCODE-CD-O NEXT INTO BUF-ANY
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DCODE-CD-O"
                       TO BU-DISPLAY-MSG
                   MOVE 99 TO COND-WORD
           ELSE
           IF CORPCDE OF DCODE-CD-REC-O NOT = CODE-ARG
               MOVE 15 TO COND-WORD.

       9999-DBGET5-DREQITM-CD-O.
           MOVE 0 TO COND-WORD.
           READ DREQITM-CD-O NEXT INTO BUF-ANY
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DREQITM-CD-O"
                       TO BU-DISPLAY-MSG
                   MOVE 99 TO COND-WORD
           ELSE
           IF CORPCDE OF DREQITM-CD-REC-O NOT = CODE-ARG
               MOVE 15 TO COND-WORD.

       9999-DBGET5-DVENDITM-CD-O.
           MOVE 0 TO COND-WORD.
           READ DVENDITM-CD-O NEXT INTO BUF-ANY
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DVENDITM-CD-O"
                       TO BU-DISPLAY-MSG
                   MOVE 99 TO COND-WORD
           ELSE
           IF CORPCDE OF DVENDITM-CD-REC-O NOT = CODE-ARG
               MOVE 15 TO COND-WORD.

       9999-DBGET5-DPOITEM-CD-O.
           MOVE 0 TO COND-WORD.
           READ DPOITEM-CD-O NEXT INTO BUF-ANY
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DPOITEM-CD-O"
                       TO BU-DISPLAY-MSG
                   MOVE 99 TO COND-WORD
           ELSE
           IF CORPCDE OF DPOITEM-CD-REC-O NOT = CODE-ARG
               MOVE 15 TO COND-WORD.

       9999-DBGET5-DINVITM-CD-O.
           MOVE 0 TO COND-WORD.
           READ DINVITM-CD-O NEXT INTO BUF-ANY
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DINVITM-CD-O"
                       TO BU-DISPLAY-MSG
                   MOVE 99 TO COND-WORD
           ELSE
           IF CORPCDE OF DINVITM-CD-REC-O NOT = CODE-ARG
               MOVE 15 TO COND-WORD.

       9999-DBGET5-DRCVITEM-CD-O.
           MOVE 0 TO COND-WORD.
           READ DRCVITEM-CD-O NEXT INTO BUF-ANY
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DRCVITEM-CD-O"
                       TO BU-DISPLAY-MSG
                   MOVE 99 TO COND-WORD
           ELSE
           IF CORPCDE OF DRCVITEM-CD-REC-O NOT = CODE-ARG
               MOVE 15 TO COND-WORD.

       9999-DBGET5-DRCVCORR-CD-O.
           MOVE 0 TO COND-WORD.
           READ DRCVCORR-CD-O NEXT INTO BUF-ANY
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DRCVCORR-CD-O"
                       TO BU-DISPLAY-MSG
                   MOVE 99 TO COND-WORD
           ELSE
           IF CORPCDE OF DRCVCORR-CD-REC-O NOT = CODE-ARG
               MOVE 15 TO COND-WORD.

       9999-DBGET5-DCHATNO-CD-O.
           MOVE 0 TO COND-WORD.
           READ DCHATNO-CD-O NEXT INTO BUF-ANY
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DCHATNO-CD-O"
                       TO BU-DISPLAY-MSG
                   MOVE 99 TO COND-WORD
           ELSE
           IF CORPCDE OF DCHATNO-CD-REC-O NOT = CODE-ARG
               MOVE 15 TO COND-WORD.

       9999-DBGET5-DTALLY-CD-O.
           MOVE 0 TO COND-WORD.
           READ DTALLY-CD-O NEXT INTO BUF-ANY
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DTALLY-CD-O"
                       TO BU-DISPLAY-MSG
                   MOVE 99 TO COND-WORD
           ELSE
           IF CORPCDE OF DTALLY-CD-REC-O NOT = CODE-ARG
               MOVE 15 TO COND-WORD.

       9999-DBDELETE-DWLITEM-CD-O.
           MOVE 0 TO COND-WORD.
           DELETE DWLITEM-CD-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBDELETE ERR 9999-DBDELETE-DWLITEM-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBDELETE-DMANPART-CD-O.
           MOVE 0 TO COND-WORD.
           DELETE DMANPART-CD-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBDELETE ERR 9999-DBDELETE-DMANPART-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBDELETE-DDESC-CD-O.
           MOVE 0 TO COND-WORD.
           DELETE DDESC-CD-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBDELETE ERR 9999-DBDELETE-DDESC-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBDELETE-DDESC2-CD-O.
           MOVE 0 TO COND-WORD.
           DELETE DDESC2-CD-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBDELETE ERR 9999-DBDELETE-DDESC2-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBDELETE-DRESERVE-CD-O.
           MOVE 0 TO COND-WORD.
           DELETE DRESERVE-CD-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBDELETE ERR 9999-DBDELETE-DRESERVE-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBDELETE-DCODE-CD-O.
           MOVE 0 TO COND-WORD.
           DELETE DCODE-CD-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBDELETE ERR 9999-DBDELETE-DCODE-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBDELETE-DREQITM-CD-O.
           MOVE 0 TO COND-WORD.
           DELETE DREQITM-CD-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBDELETE ERR 9999-DBDELETE-DREQITM-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBDELETE-DVENDITM-CD-O.
           MOVE 0 TO COND-WORD.
           DELETE DVENDITM-CD-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBDELETE ERR 9999-DBDELETE-DVENDITM-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBDELETE-DPOITEM-CD-O.
           MOVE 0 TO COND-WORD.
           DELETE DPOITEM-CD-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBDELETE ERR 9999-DBDELETE-DPOITEM-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBDELETE-DINVITM-CD-O.
           MOVE 0 TO COND-WORD.
           DELETE DINVITM-CD-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBDELETE ERR 9999-DBDELETE-DINVITM-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBDELETE-DRCVITEM-CD-O.
           MOVE 0 TO COND-WORD.
           DELETE DRCVITEM-CD-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBDELETE ERR 9999-DBDELETE-DRCVITEM-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBDELETE-DRCVCORR-CD-O.
           MOVE 0 TO COND-WORD.
           DELETE DRCVCORR-CD-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBDELETE ERR 9999-DBDELETE-DRCVCORR-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBDELETE-DCHATNO-CD-O.
           MOVE 0 TO COND-WORD.
           DELETE DCHATNO-CD-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBDELETE ERR 9999-DBDELETE-DCHATNO-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBGET7-MSTORERM-CD-O.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-CD-REC-O.
           READ MSTORERM-CD-O INTO BUF-ANY
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET7 ERR 9999-DBGET7-MSTORERM-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBGET7-USAGEFIL-CD-O.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF USAGEFIL-CD-REC-O.
           READ USAGEFIL-CD-O INTO BUF-ANY
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET7 ERR 9999-DBGET7-USAGEFIL-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBGET7-RECEIPTFIL-CD-O.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF RECEIPTFIL-CD-REC-O.
           READ RECEIPTFIL-CD-O INTO BUF-ANY
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET7 ERR 9999-DBGET7-RECEIPTFIL-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBDELETE-MSTORERM-CD-O.
           MOVE 0 TO COND-WORD.
           DELETE MSTORERM-CD-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBDELETE ERR 9999-DBDELETE-MSTORERM-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBDELETE-USAGEFIL-CD-O.
           MOVE 0 TO COND-WORD.
           DELETE USAGEFIL-CD-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBDELETE ERR 9999-DBDELETE-USAGEFIL-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBDELETE-RECEIPTFIL-CD-O.
           MOVE 0 TO COND-WORD.
           DELETE RECEIPTFIL-CD-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBDELETE ERR 9999-DBDELETE-RECEIPTFIL-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

       9999-DBDELETE-DTALLY-CD-O.
           MOVE 0 TO COND-WORD.
           DELETE DTALLY-CD-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBDELETE ERR 9999-DBDELETE-DTALLY-CD-O"
                   TO BU-DISPLAY-MSG
               MOVE 99 TO COND-WORD.

