       IDENTIFICATION DIVISION.
       PROGRAM-ID.          CCRQDESC.
       AUTHOR.              CA YODER.
       DATE-WRITTEN.        MARCH 2002.

      ******************************************************
      *                                                    *
      *   THIS SUBPROGRAM RETURNS THE COMPLIANCE           *
      *   REQUIREMENT DESCRIPTION FOR POS, RECEIVING       *
      *   SLIPS, AND INQUIRY SCREENS.                      *
      *                                                    *
      ******************************************************
      *C
      *C  CHANGES:
      *C


       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

            SELECT DCOMPL-I
                  ASSIGN TO DATABASE-MCFLCS7001
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.

       FD  DCOMPL-I
           LABEL RECORDS ARE STANDARD.
       01  DCOMPL-REC-I.
           COPY DDS-MCRPCS7000 OF MCFLCS7001.

       WORKING-STORAGE SECTION.

       01  FILE-STATUS.
           05  FILE-STATUS-1          PIC X  VALUE "0".
           05  FILE-STATUS-2          PIC X  VALUE "0".

       01  SUB                        PIC 9(2) VALUE 0.

       01  COMPL-LIT.
           05  FILLER                 PIC X(52)  VALUE
           "SELLER WARRANTS SUPPLIED PART IS IN COMPLIANCE WITH:".
           05  FILLER                 PIC X(28)  VALUE SPACES.

       COPY TDATECHK IN COPYLIB.

       COPY DCOMPL   OF COPYLIB.

       COPY DBSTAT IN COPYLIB.

       01 ARG-VALUES.
           05  CODE-ARG               PIC X(8)  VALUE SPACES.

       COPY CCHKOBJ IN COPYLIB.

       LINKAGE SECTION.

       01  CCRQDESC-PARMS.
           05  CCRQDESC-CODE          PIC X(7).
           05  CCRQDESC-LINES.
               10  CCRQDESC-LINE  OCCURS 10 TIMES
                                      PIC X(80).

       PROCEDURE DIVISION USING  CCRQDESC-PARMS.

       BEGIN-HERE.
           INITIALIZE CCRQDESC-LINES.
           OPEN INPUT DCOMPL-I.
           IF CCRQDESC-CODE NOT = "NON-STR"
               PERFORM 6-PRINT-DCOMPL.
           GOBACK.

       6-PRINT-DCOMPL.
           MOVE CCRQDESC-CODE    TO  CODE-ARG.
           MOVE CODE-ARG         TO  CORPCDE OF DCOMPL-REC-I.
           START DCOMPL-I KEY = CORPCDE OF DCOMPL-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               READ DCOMPL-I NEXT INTO BUF-DCOMPL
                   AT END MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               PERFORM VARYING SUB FROM 1 BY 1
                       UNTIL CMPL-CORP-CODE NOT = CODE-ARG OR
                                FILE-STATUS NOT = "00"
                   PERFORM 61-FORMAT-DCOMPL-LINES
                   READ DCOMPL-I NEXT INTO BUF-DCOMPL
                       AT END MOVE FILE-STATUS TO FILE-STATUS
                   END-READ
               END-PERFORM.

       61-FORMAT-DCOMPL-LINES.
           IF CMPL-ID-NUM = "00"
               MOVE COMPL-LIT               TO  CCRQDESC-LINE (SUB)
           ELSE
               MOVE SPACES                  TO  CCRQDESC-LINE (SUB)
               STRING CMPL-REG-BODY  "  "  CMPL-STANDARD
                        DELIMITED BY SIZE
                   INTO CCRQDESC-LINE (SUB).

