000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          CDATCALC.
000400 AUTHOR.              C HILLES.
000500 DATE-WRITTEN.        10/28/87.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
002400 ENVIRONMENT DIVISION.
002500 CONFIGURATION SECTION.
002600 SOURCE-COMPUTER.  HP-3000.
002700 OBJECT-COMPUTER.  HP-3000.
      ***************************************************************
      *C 06/06/96   JEFF BUNGO
      *C    CHANGED THE PROGRAM TO ASSUME CENTURY 19 IF YEAR > 70
      *C    OTHERWISE CENTURY 20
      ***************************************************************
002800
002900 DATA DIVISION.
003000 WORKING-STORAGE SECTION.
       01  WHO-CARES        PIC 9(4).
       01  MOD-4            PIC 9(4).
       01  MOD-100          PIC 9(4).
       01  MOD-400          PIC 9(4).
       01  LY               PIC 9(1).
       01  LY-1             PIC 9(1).
       01  LY-2             PIC 9(1).
       01  BIG-YEAR         PIC 9(4).
       01  BIG-YEAR-1       PIC 9(4).
       01  BIG-YEAR-2       PIC 9(4).
       01  G-DAY            PIC 9(4).
       01  G-MONTH          PIC 9(4).
       01  TEST-IT          PIC 9(4).
       01  THE-DATE.
           05  CURRENT-DATE-YY  PIC 9(2).
           05  FILLER           PIC X(4).
       01  GREGORIAN-DATE.
           05  GD-YY            PIC 9(2).
           05  GD-MM            PIC 9(2).
           05  GD-DD            PIC 9(2).
       01  JD-NUM               PIC 9(3).
       01  BIG-JULIAN           PIC 9(4).
       01  JULIAN-1             PIC 9(3).
       01  JULIAN-2             PIC 9(3).
       01  SAVE-LY              PIC 9(1).
003100 LINKAGE SECTION.
       01  DATE-1.
           05  DATE-1-YY           PIC 9(2).
           05  FILLER              PIC X(4).
       01  DATE-2.
           05  DATE-2-YY           PIC 9(2).
           05  FILLER              PIC X(4).
       01  DATE-DIFF               PIC 9(4).

007900 PROCEDURE DIVISION USING DATE-1, DATE-2, DATE-DIFF.
008400
008500 6000-MAIN.
           MOVE DATE-1 TO GREGORIAN-DATE.
           PERFORM 7000-COMPUTE-JULIAN THRU 7090-CJ-X.
           MOVE LY TO LY-1.
           MOVE JD-NUM TO JULIAN-1.
           MOVE DATE-2 TO GREGORIAN-DATE.
           PERFORM 7000-COMPUTE-JULIAN THRU 7090-CJ-X.
           MOVE LY TO LY-2.
           MOVE JD-NUM TO JULIAN-2.
           IF DATE-2-YY > 70
              COMPUTE BIG-YEAR-2 = 1900 + DATE-2-YY
           ELSE
              COMPUTE BIG-YEAR-2 = 2000 + DATE-2-YY.
           IF DATE-1-YY > 70
              COMPUTE BIG-YEAR-1 = 1900 + DATE-1-YY
           ELSE
              COMPUTE BIG-YEAR-1 = 2000 + DATE-1-YY.
           IF BIG-YEAR-2 > BIG-YEAR-1
               COMPUTE BIG-JULIAN = 365 * (BIG-YEAR-2 - BIG-YEAR-1)
                  + LY-1 + JULIAN-2
               COMPUTE DATE-DIFF = BIG-JULIAN - JULIAN-1
           ELSE
           IF BIG-YEAR-1 > BIG-YEAR-2
               COMPUTE BIG-JULIAN = 365 * (BIG-YEAR-1 - BIG-YEAR-2)
                  + LY-2 + JULIAN-1
               COMPUTE DATE-DIFF = BIG-JULIAN - JULIAN-2
           ELSE
               COMPUTE DATE-DIFF = JULIAN-2 - JULIAN-1.
       6990-MAIN-X.
           GOBACK.
       7000-COMPUTE-JULIAN.
           IF GD-YY > 70
              COMPUTE BIG-YEAR = 1900 + GD-YY
           ELSE
              COMPUTE BIG-YEAR = 2000 + GD-YY.
           DIVIDE BIG-YEAR BY 4 GIVING WHO-CARES REMAINDER MOD-4.
           DIVIDE BIG-YEAR BY 100 GIVING WHO-CARES REMAINDER MOD-100.
           DIVIDE BIG-YEAR BY 400 GIVING WHO-CARES REMAINDER MOD-400.
           MOVE ZERO TO LY.
           IF (MOD-4 = ZERO) AND (MOD-400 = 0 OR (MOD-100 NOT = ZERO))
             MOVE 1 TO LY.
           COMPUTE JD-NUM = 3055 * (GD-MM + 2) / 100 -
           (GD-MM + 10) / 13 * 2 - 91 + LY * (GD-MM + 10) / 13 + GD-DD.
       7090-CJ-X.
           EXIT.
