000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          CDAYOFWK.
000400 AUTHOR.              BK  DISMUKES
000500 DATE-WRITTEN.        MAY 1993.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - NAPANEE.
000800*SECURITY.
000900*REMARKS.   THIS SUBPROGRAM CALCULATES THE DAY OF THE WEEK GIVEN
001000*           A JULIAN DATE BEYOND 89/001.
001100*           ####  NOTE -  THE BASE DATE FOR THIS LOGIC IS
      *                 SUNDAY 89/01/01 (89-001).
      *                    SUNDAY    RECEIVES A VALUE OF 0
      *                    MONDAY    RECEIVES A VALUE OF 1
      *                    TUESDAY   RECEIVES A VALUE OF 2
      *                    WEDNESDAY RECEIVES A VALUE OF 3
      *                    THURSDAY  RECEIVES A VALUE OF 4
      *                    FRIDAY    RECEIVES A VALUE OF 5
      *                    SATURDAY  RECEIVES A VALUE OF 6
      *                 IF YOU WISH TO CHOSE ANOTHER BASE DATE, PICK
      *                 A YEAR AFTER A LEAP YEAR. IE 1988 WAS A LEAP
      *                 YEAR.  YOU WILL ALSO NEED TO RESET THE OFFSET
      *                 TO REFLECT THE FIRST DAY OF THE YEAR. IE IF
      *                 WEDNESDAY IS THE FIRST DAY IT WILL TAKE 0.
      *
001200
001300 ENVIRONMENT DIVISION.
001400 CONFIGURATION SECTION.
001500 SOURCE-COMPUTER.  HP-3000.
001600 OBJECT-COMPUTER.  HP-3000.
001700 DATA DIVISION.
001800 WORKING-STORAGE SECTION.
001900 01  OFFSET                        PIC 9(6).
001900 01  TRASH-VAR                     PIC 9(2).
001900 01  WHOLE-NUM                     PIC 9(4).
001900 01  YEARS-DIF                     PIC 9(4).
001900 01  YEARS-IN-DAYS                 PIC 9(6).

001900 01  TEST-YEAR                     PIC 9(4).
001900 01  TEST-DDD                      PIC 9(16).

       01  BASE-YEAR                     PIC 9(4)  VALUE 1989.
       01  BASE-DDD                      PIC S9(3)  VALUE 001.


003500 LINKAGE SECTION.
003700 01  PASSED-YEAR                   PIC 9(4).
001900 01  PASSED-DDD                    PIC 9(3).
003700 01  RETURN-DOW                    PIC X(2).

007100 PROCEDURE DIVISION USING PASSED-YEAR, PASSED-DDD, RETURN-DOW.

       6000-MAIN.
           MOVE PASSED-YEAR      TO  TEST-YEAR.
           MOVE ZEROS            TO  TEST-DDD.

      *----  DETERMINE THE YEARS IN DAYS. (THE DIVIDE ACCOUNTS FOR
      *      LEAP YEARS.)
           COMPUTE YEARS-DIF = TEST-YEAR - BASE-YEAR.
           DIVIDE  YEARS-DIF BY 4 GIVING WHOLE-NUM.
           COMPUTE YEARS-IN-DAYS = YEARS-DIF * 365 + WHOLE-NUM.

      *----  DETERMINE THE TOTAL NUMBER OF DAYS SINCE BASE DATE.
           COMPUTE TEST-DDD = YEARS-IN-DAYS + PASSED-DDD - BASE-DDD.

      *----  DETERMINE THE DAY OF THE WEEK OFFSET
           DIVIDE TEST-DDD  BY 7  GIVING WHOLE-NUM.
           COMPUTE OFFSET = TEST-DDD - ( 7 * WHOLE-NUM ).

      *----  DETERMINE THE DAY OF THE WEEK FROM OFFSET.
           EVALUATE OFFSET
             WHEN  0
               MOVE "SU"     TO  RETURN-DOW

             WHEN  1
               MOVE "MO"     TO  RETURN-DOW

             WHEN  2
               MOVE "TU"     TO  RETURN-DOW

             WHEN  3
               MOVE "WE"     TO  RETURN-DOW

             WHEN  4
               MOVE "TH"     TO  RETURN-DOW

             WHEN  5
               MOVE "FR"     TO  RETURN-DOW

             WHEN  6
               MOVE "SA"     TO  RETURN-DOW

           END-EVALUATE.

       6990-MAIN-X.
           GOBACK.

