000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          CDISFULL.
000400 AUTHOR.              C HILLES.
000500 DATE-WRITTEN.        10/28/87.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*D   DUMMY PROGRAM FOR IBM.  ON HP DISPLAYS ERROR MESSAGE
001100*D   THAT RECEVING SLIP CAN'T BE CREATED BECAUSE CERTAIN DATASETS
001200*D   ARE ALMOST FULL.
002300
002400 ENVIRONMENT DIVISION.
002500 CONFIGURATION SECTION.
002600 SOURCE-COMPUTER.  HP-3000.
002700 OBJECT-COMPUTER.  HP-3000.
002800
002900 DATA DIVISION.
003000 WORKING-STORAGE SECTION.
003100 LINKAGE SECTION.
       01  DFULL-TITLE                   PIC X(50).
       01  DSET-ARRAY.
           05  DSET-NUMBER               PIC 9(2).
           05  DSET-INFO OCCURS 10 TIMES.
               07  D-SET-NAME            PIC X(16).
               07  LEEWAY-NUMBER         PIC 9(4).
               07  CURRENT-ENTRIES       PIC 9(9) BINARY.
               07  SET-CAPACITY          PIC 9(9) BINARY.
               07  GO-AHEAD-FLAG         PIC X.
               07  FILLER                PIC X.
       COPY VCOMLINK IN COPYCSIS.

007900 PROCEDURE DIVISION USING          DFULL-TITLE,
008000                                   DSET-ARRAY,
008100                                   VIEW-COMAREA.
008400
008500 6000-MAIN.
       6990-MAIN-X.
           GOBACK.
