       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TPERPASS.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER COMPANY.
       DATE-WRITTEN.           SEPTEMBER 1987.
      *REMARKS.        **** THE PERSONNEL PASSWORD SYSTEM ****
      *                THIS IS THE SUBROUTINE CALLED TO ENTER
      *                AND CHANGE INDIVIDUAL PASSWORDS FOR PLANT
      *                PERSONNEL WHEN EXECUTING SPECIFIC PROGRAMS.
      *                PASSWORD CHANGES ARE FORCED EVERY 35 DAYS.
      *                ****.
      *C
      *C   03/12/1998   CA YODER   REQ #97-1125
      *C     CHANGED PASSWORD FROM 6 TO 8 FOR CALL TO "TPERPASS."
      *C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        AS-400.
       OBJECT-COMPUTER.        AS-400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PERS-READ
                  ASSIGN TO DATABASE-MCFLMM0301
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STAT.

           SELECT PERS-UPDATE
                  ASSIGN TO DATABASE-MCFLMM0301
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STAT.

       DATA DIVISION.
       FILE SECTION.
       FD  PERS-READ
           LABEL RECORDS ARE STANDARD.
       01  READ-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0301.

       FD  PERS-UPDATE
           LABEL RECORDS ARE STANDARD.
       01  UPDATE-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0301.

       WORKING-STORAGE SECTION.
       77  FILE-STAT                PIC XX.
      *-------- EXPAND PASSWORD FROM 6 TO 8 CHARACTERS.
      *77  VERIFY-PWORD             PIC X(06).
       77  VERIFY-PWORD             PIC X(08).
      *77  TRAN-LEN                 PIC 9(5)    VALUE 6   COMP-3.
       77  TRAN-LEN                 PIC 9(5)    VALUE 8   COMP-3.
      *77  TRAN-BUF                 PIC X(06).
       77  TRAN-BUF                 PIC X(08).
       77  TRAN-CODE                PIC X.
       77  SHOW-SW                  PIC S9(4)   VALUE 0   COMP-4.
       77  CC-SW                    PIC S9(4)   VALUE 0   COMP-4.
           88  CC-FOUND                         VALUE 0.
       77  EXPIRE-SW                PIC S9(4)   VALUE 0   COMP-4.
           88  EXPIRED                          VALUE 1.
       77  CYCLE-DATE               PIC 9(4)    VALUE 0   COMP-4.
       77  CURR-DATE                PIC 9(4)    VALUE 0   COMP-4.
       77  HELP-KEY                 PIC XXXX    VALUE "#$%&".
       77  TRUE-VAL                 PIC 1       VALUE B"1".
       77  NEG-VAL                  PIC 1       VALUE B"0".
       77  S90                      PIC 1       VALUE B"0".
       77  S91                      PIC 1       VALUE B"0".
       77  S92                      PIC 1       VALUE B"0".
       77  CMDSAV                   PIC X(79).

       01  PWD-DATE.
           05  PWD-DATE-X           PIC XX.
           05  PWD-DATE-9 REDEFINES PWD-DATE-X PIC S9(4) COMP-4.

       01  PWD-DATE-DISP            PIC 9(4).

       01  SCREEN-PARMS.
           05  SCREEN-INDICATORS.
               10 IND OCCURS 99 TIMES          PIC 1 INDICATOR 01.
           05  MAJOR-MINOR                     PIC X(4).
           05  SCREEN-CONTROL.
               10 KEY-HIT-X                    PIC XX.
               10 KEY-HIT REDEFINES KEY-HIT-X  PIC 99.
               10 TERMINAL-ID                  PIC X(10).
               10 FORMAT-NAME                  PIC X(10).

       01  SCREEN-DATA.
           05  CC-NUMBER            PIC X(04).
           05  CC-NAME              PIC X(16).
           05  OLD-PWORD            PIC X(06).
           05  PW-MESSAGE           PIC X(30).
           05  NEW-PWORD.
               10  FIRST-BUF        PIC X.
               10  FILLER           PIC XXX.
               10  LAST-TWO         PIC XX.
           05  HELP-MSG             PIC X(26).
           05  CMDMSG               PIC X(79).
           05  ERRMSG               PIC X(79).

       01  HELP-LINE.
           05  HELP-NAME            PIC X(16).
           05  HELP-E1              PIC X(02).
           05  HELP-E2              PIC X(04).
           05  HELP-E3              PIC X(04).

       01  JUL-INDATE.
           05  JIN-YY               PIC 99.
           05  JIN-MM               PIC 99.
           05  JIN-DD               PIC 99.

       01  JUL-OUTDATE.
           05  JUL-YY               PIC 99.
           05  JUL-NUM              PIC 999.

           COPY CATREAD        IN COPYLIB.

       01  PERSONNEL-DATA.
           COPY MPERSONL       IN COPYLIB.

       01  CC-BUFFER           PIC XXXX.

       01  NAME-BUFFER         PIC X(16).

       PROCEDURE DIVISION.
       MAIN.
           DISPLAY "ENTER CCNUM".
           ACCEPT CC-BUFFER.
           IF CC-BUFFER = "XXXX"
               GO TO END-PROGRAM.
           OPEN INPUT          PERS-READ.
           MOVE CC-BUFFER      TO PERCCNUM OF PERS-READ.
           START PERS-READ KEY NOT < EXTERNALLY-DESCRIBED-KEY.
           IF FILE-STAT NOT = ZEROS
               GO TO END-PROGRAM.

           READ PERS-READ      INTO PERSONNEL-DATA.
           IF FILE-STAT NOT = ZEROS
               GO TO END-PROGRAM.

           MOVE "1"            TO TRAN-CODE.
           MOVE PWORD-BUFF     TO TRAN-BUF.
           CALL "CTRANSLATE" USING TRAN-LEN
                                   TRAN-BUF
                                   TRAN-CODE.

           MOVE PWD-X TO PWD-DATE-X.
           MOVE PWD-DATE-9 TO PWD-DATE-DISP.
           ADD 35 TO PWD-DATE-DISP.
           DISPLAY "PASSWORD IS ", TRAN-BUF
              " - EXPIRE DATE (JULIAN) IS ", PWD-DATE-DISP.

           GO TO MAIN.

       END-PROGRAM.
           CLOSE PERS-READ.
           GOBACK.
