000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          CEAEDIT.
000400 AUTHOR.              C HILLES/JIM COFFMAN (MAINTAINER).
000500 DATE-WRITTEN.        10/21/87.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*D   ELECTRONIC REQUISITION APPROVALS - EDIT SUBPROGRAM.
001100*D   THIS SUBPROGRAM EDITS ABILITY TO RETURN, MODIFY, APPROVE,
001200*D   OR DELETE A REQUSITION, BASED ON EAEDIT-MODE:
001300*D       1.  "A" = APPROVE
001400*D       2.  "R" = RETURN
001500*D       3.  "F" = FORWARD
001600*D       4.  "M" = MODIFY
001700*D       5.  "D" = DELETE
001800*D       6.  "C" = UPDATE COMMENTS
      *C
      *C   05/05/94  JE COFFMAN  WRITTEN REQUEST 94-001/SLS REQ 6487
      *C     ADDED THE ABILITY TO ALLOW 'SS' STATUS REQUISITIONS
      *C     THAT HAVE THE AUTHORIZATION FLAG SET VIA MP1 TO BE
      *C     CHANGED.
      *C
      *C   02FEB1998  WL MCINTYRE
      *C     REVISED LOGIC TO SEPARATE EDITS FOR MODIFY AND DELETES.
      *C     PREVIOUSLY, CALLING PROGRAM SEARQADD PASSED AN "M" IN
      *C     EAEDIT-MODE FOR BOTH MODIFY AND DELETE REQUESTS.
      *C     SEARQADD WAS CHANGED TO PASS "M" OR "D" APPROPRIATELY.
      *C
002000
002100 CONFIGURATION SECTION.
002200 SOURCE-COMPUTER.  HP-3000.
002300 OBJECT-COMPUTER.  HP-3000.
002400
002500 DATA DIVISION.
002600 WORKING-STORAGE SECTION.
       COPY CATREAD IN COPYLIB.
002700**************************************************************
002800**                                                          **
002900**            L I N K A G E   S E C T I O N                 **
003000**                                                          **
003100**************************************************************
003200
003300 LINKAGE SECTION.
003400 COPY CEAEDIT    IN COPYLIB.
003500 COPY REQGLOBS   IN COPYLIB.
003600 COPY MEMPL      IN COPYLIB.
003700 01  MESSAGE-BUFFER                PIC X(76).
003800 COPY LANGSUB    IN COPYLIB.
003900 01  BU-DISPLAY-MSG                PIC X(60).
004000
004100 PROCEDURE DIVISION USING          EAEDIT-PARMS,
004200                                   REQ-GLOBALS,
004300                                   BUF-MEMPL,
004400                                   MESSAGE-BUFFER,
004500                                   LANGUAGE-PARMS
004600                                   BU-DISPLAY-MSG.
004700
004800 6000-MAIN.
004900
005000     MOVE SPACES                   TO   MESSAGE-BUFFER.
005100
005200*------ STOREROOM REQ CANT BE MODIFIED EXCEPT BY MATERIALS CTRL
005300     IF EAEDIT-STATUS = "SS"
               IF EAEDIT-AUTH-FLAG = "X"
                   NEXT SENTENCE
               ELSE
005400*        "R18: REQUISITION IS STOREROOM CONTROLLED"
005500         MOVE  18 TO LANG-SETNUM
005600         MOVE  18 TO LANG-MSGNUM
005700         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
005800         GO TO 6990-MAIN-X.
005900
006000*------ CANT MODIFY, RETURN, OR APPROVE REQ IF ON A PO
006100     IF EAEDIT-RELEASE-STAT = "XX"
006200*        "R14: REQUISITION HAS ALREADY BEEN ASSIGNED A PO"
006300         MOVE  18 TO LANG-SETNUM
006400         MOVE  14 TO LANG-MSGNUM
006500         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
006600         GO TO 6990-MAIN-X.
006700
006800*------ CANT MODIFY, FORWARD,RETURN, OR APPROVE REQ IF RLSD
006900*------ TO PURCH: PURCHASING WOULD HAVE TO RETURN IT FIRST.
007000*------ NOTE: THE PURCH RETURN PROG 'SRQPUPDC' OR 'SRQPUPDN' CALL
007100*------ 'CEARETRN' BUT NOT 'CEAEDIT' SO THIS WONT STOP THAT.
007100*------ NOTE:    ADD "D" TO CONDITION   (02FEB1998-WLM)
007200     IF EAEDIT-MODE = "M" OR "A" OR "F" OR "R" OR "D"
007300         IF EAEDIT-RELEASE-STAT = "X "
007400*            "R7: REQ HAS ALREADY BEEN RELEASED"
007500             MOVE  18 TO LANG-SETNUM
007600             MOVE   7 TO LANG-MSGNUM
007700             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
007800             GO TO 6990-MAIN-X.
007900
008000*------ A REQ MAY BE MODIFIED BY THE ORIGINATOR OR BY AN APPROVER
008100*------ WITH MODIFY CAPABILITY
008200     IF EAEDIT-MODE = "M"
008300         IF EAEDIT-EMPL = EAEDIT-ORIG
008400             NEXT SENTENCE
008500         ELSE
008600         IF MEMPL-MODIFY-CAP = "Y"
008700             NEXT SENTENCE
008800         ELSE
008900             PERFORM 7000-NOT-AUTHORIZED
009000             GO TO 6990-MAIN-X.
009100
009200     IF EAEDIT-MODE = "F" AND (MEMPL-FORWARD-CAP NOT = "Y")
009300         PERFORM 7000-NOT-AUTHORIZED
009400         GO TO 6990-MAIN-X.
009500
009600     IF EAEDIT-MODE = "A" AND (MEMPL-APP-RQ-FLAG NOT = "Y")
009700         PERFORM 7000-NOT-AUTHORIZED
009800         GO TO 6990-MAIN-X.
009900
010000     IF EAEDIT-MODE = "R" AND (MEMPL-RETURN-CAP NOT = "Y")
010100         PERFORM 7000-NOT-AUTHORIZED
010200         GO TO 6990-MAIN-X.
010300
010400     IF EAEDIT-MODE = "D"
010500         IF MEMPL-EMPL NOT = EAEDIT-ORIG
010600*            "R48: REQ MAY BE DELETED ONLY BY ORIGINATOR"
010700             MOVE  18 TO LANG-SETNUM
010800             MOVE  48 TO LANG-MSGNUM
010900             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
011000             GO TO 6990-MAIN-X.
011100
011200*------ CANNOT APPROVE, RETURN, OR FORWARD A REQ THAT IS ON HOLD
011300*------ (SUCH AS A RETURNED REQ).  IT MUST FIRST BE MODIFIED BY
011400*------ THE ORIGINATOR OF THE REQ.
011500     IF EAEDIT-MODE = "A" OR "R" OR "F"
011600         IF EAEDIT-HOLD-STATUS NOT = SPACES
011700*            "REQUISITION IS ON HOLD - CANNOT PROCESS"
011800             MOVE  18 TO LANG-SETNUM
011900             MOVE  45 TO LANG-MSGNUM
012000             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
012100             GO TO 6990-MAIN-X.
012200
012300     IF EAEDIT-MODE = "A"
012400         IF EAEDIT-QUEUED-FLAG NOT = "Y"
012500*            "THIS REQUISITION IS NOT IN YOUR APPROVAL QUEUE"
012600             MOVE  20 TO LANG-SETNUM
012700             MOVE  58 TO LANG-MSGNUM
012800             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
012900             GO TO 6990-MAIN-X
013000         ELSE
013100         IF EAEDIT-APPROVE-DATE > SPACES
013200*            "YOU HAVE ALREADY APPROVED THIS REQUISITION"
013300             MOVE  25 TO LANG-SETNUM
013400             MOVE  27 TO LANG-MSGNUM
013500             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
013600             GO TO 6990-MAIN-X.
013700
013800*------ YOU CAN UPDATE THE QUEUE COMMENTS IF YOU ARE FORWARDING
013900*------ THE REQ TO ANOTHER PERSON, OR IF THE REQ IS IN YOUR
014000*------ APPROVAL QUEUE.
014100     IF EAEDIT-COMMENT-FLAG = "Y"
014200         IF EAEDIT-MODE = "F"
014300             NEXT SENTENCE
014400         ELSE
014500         IF EAEDIT-QUEUED-FLAG = "N"
014600*            "U22: UPDATE COMMENTS ONLY IF IN YOUR QUEUE OR FWRD"
014700             MOVE  21 TO LANG-SETNUM
014800             MOVE  22 TO LANG-MSGNUM
014900             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
015000             GO TO 6990-MAIN-X.
015100
015200 6990-MAIN-X.
015300     GOBACK.
015400
015500 7000-NOT-AUTHORIZED.
015600*    "Y25: YOU ARE NOT AUTHORIZED FOR THIS FUNCTION"
015700     MOVE  25 TO LANG-SETNUM.
015800     MOVE  24 TO LANG-MSGNUM.
015900     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
016000
016100 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
016900 999-CATREAD-EXIT.
017000     EXIT.
