000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    CEAFWRD.
000400 AUTHOR.        C HILLES/JIM COFFMAN (MAINTAINER).
000500 DATE-WRITTEN.  11/3/87.
000600 DATE-COMPILED.
000700*INSTALLATION.  GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*D   ELECTRONIC REQUISITION APPROVALS - FORWARD A REQ SUBPROGRAM.
001100*D   FORWARD A REQ TO ANOTHER APPROVER FOR APPROVAL.  THIS CAN
001200*D   ONLY BE DONE BY AN APPROVER THAT HAS "FORWARD REQ"
001300*D   CAPABILITY.
      *C
      *C   08/14/96  JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   INCLUDE CENTURY ON APPROVED AND QUEUED DATE.
001400
001500 ENVIRONMENT DIVISION.
001600 CONFIGURATION SECTION.
001700 SOURCE-COMPUTER.  HP-3000.
001800 OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MEMPL-I
                  ASSIGN TO DATABASE-MCFLCS4201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MREQ-O
                  ASSIGN TO DATABASE-MCFLCS2001
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DREQQUE-O
                  ASSIGN TO DATABASE-MCFLCS4401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

001900
002000 DATA DIVISION.
       FILE SECTION.
       FD  MEMPL-I
           LABEL RECORDS ARE STANDARD.
       01  MEMPL-REC-I.
           COPY DDS-MCRPCS4200  OF MCFLCS4201.

       FD  MREQ-O
           LABEL RECORDS ARE STANDARD.
       01  MREQ-REC-O.
           COPY DDS-MCRPCS2000  OF MCFLCS2001.

       FD  DREQQUE-O
           LABEL RECORDS ARE STANDARD.
       01  DREQQUE-REC-O.
           COPY DDS-MCRPCS4400  OF MCFLCS4401.

002100 WORKING-STORAGE SECTION.
002200
       01  SAVE-DRQQ-ORDER.
           05  SAVE-ORDER               PIC X(4).
           05  SAVE-ORDER-9 REDEFINES SAVE-ORDER
                                        PIC 9(4).

002300**************************************************************
002400**                                                          **
002500**            D A T A B A S E   W O R K                     **
002600**                                                          **
002700**************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
002800
002900 01  DSET-NAMES.
003000     05  DSET-DREQQUE              PIC X(16) VALUE "DREQQUE;".
003100     05  DSET-MEMPL                PIC X(16) VALUE "MEMPL;".
003200     05  DSET-MREQ                 PIC X(16) VALUE "MREQ;".
003300
003400 01  EMPL-ARG                      PIC X(4).
003500 01  REQ-SEARCH                    PIC X(16) VALUE "REQ-NUMBER;".
003600
003700 01  MODE-AREA.
003800     05  DB-MODE                   PIC S9(4)   COMP       VALUE 0.
003900     05  MODE1                     PIC S9(4)   COMP       VALUE 1.
004000     05  MODE5                     PIC S9(4)   COMP       VALUE 5.
004100     05  MODE7                     PIC S9(4)   COMP       VALUE 7.
004200
006000 COPY DREQQUE    IN COPYLIB.
006100 COPY MEMPL      IN COPYLIB.
006200
006300******************************************************************
006400**                                                              **
006500**          S U B P R O G R A M   A R E A S                     **
006600**                                                              **
006700******************************************************************
006800 COPY TDATECHK   IN COPYLIB.
       COPY CATREAD    IN COPYLIB.
006900
007000**************************************************************
007100**                                                          **
007200**            L I N K A G E   S E C T I O N                 **
007300**                                                          **
007400**************************************************************
007500
007600 LINKAGE SECTION.
007700 01  BASE                          PIC X(10).
007800 COPY DBSTAT     IN COPYLIB.
007900 COPY MREQ       IN COPYLIB.
008000 COPY CEAFWRD    IN COPYLIB.
008100 COPY REQGLOBS   IN COPYLIB.
008200 COPY LANGSUB    IN COPYLIB.
008300 01  MESSAGE-BUFFER                PIC X(76).
008400 01  BU-DISPLAY-MSG.
008500     05  BU-DISPLAY-MSG-1          PIC X(1).
008600     05  FILLER                    PIC X(57).
           05  BU-DISPLAY-MSG-59-60      PIC X(2).
008700
008800 PROCEDURE DIVISION USING          BASE,
008900                                   STATUS-AREA,
009000                                   BUF-MREQ,
009100                                   FWRD-PARMS,
009200                                   REQ-GLOBALS,
009300                                   LANGUAGE-PARMS,
009400                                   MESSAGE-BUFFER,
009500                                   BU-DISPLAY-MSG.
009600
009700
009800
009900 6000-MAIN.
           OPEN I-O DREQQUE-O, MREQ-O.
           OPEN INPUT MEMPL-I.

010000     MOVE FWRD-EMPL                TO   EMPL-ARG.
010100*    CALL "DBGET" USING BASE, DSET-MEMPL, MODE7, STATUS-AREA,
010200*      ALL-ITEMS, BUF-MEMPL, EMPL-ARG.
           MOVE EMPL-ARG TO EMPLOYID OF MEMPL-REC-I.
           READ MEMPL-I INTO BUF-MEMPL
               INVALID KEY MOVE 17 TO COND-WORD.
010300     IF FILE-STATUS-1 = "2"
010400*        "EMPLOYEE ID DOES NOT EXIST"
010500         MOVE   5 TO LANG-SETNUM
010600         MOVE  17 TO LANG-MSGNUM
010700         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
010800         GO TO 6990-MAIN-X
010900     ELSE
011000     IF FILE-STATUS NOT = "00"
011100         MOVE "CEAFWRD DBGET ERR MEMPL" TO BU-DISPLAY-MSG
011200         GO TO 6990-MAIN-X.
           IF MEMPL-LEVEL = 00
               MOVE   3 TO LANG-SETNUM
               MOVE 211 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               GO TO 6990-MAIN-X.
011300
011400*------ MAKE SURE REQ IS NOT ALREADY QUEUED FOR PERSON
011500*------ FORWARDED TO. USE REQ CHAIN RATHER THAN EMPL-QUEUED CHAIN
011600*------ SINCE THIS IS LIKELY TO BE SHORTER.
011700*------ NOTE: DONT ALLOW FORWARD TO ALREADY QUEUED PERSON EVEN
011800*------ IF ALREADY APPROVED.
011900*    CALL "DBFIND" USING BASE, DSET-DREQQUE, MODE1, STATUS-AREA,
012000*      REQ-SEARCH, MREQ-NUMBER.
           MOVE MREQ-NUMBER TO REQNO OF DREQQUE-REC-O.
           START DREQQUE-O KEY = REQNO OF DREQQUE-REC-O
               INVALID KEY MOVE 17 TO COND-WORD.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
012200         MOVE "CEAFWRD DBFIND ERR DREQQUE" TO BU-DISPLAY-MSG
012300         GO TO 6990-MAIN-X.
012400
012500 6010-GET-DREQQUE-LOOP.
012600*    CALL "DBGET" USING BASE, DSET-DREQQUE, MODE5,
012700*      STATUS-AREA, ALL-ITEMS, BUF-DREQQUE, MREQ-NUMBER.
           MOVE 0 TO COND-WORD.
           READ DREQQUE-O NEXT INTO BUF-DREQQUE
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF REQNO OF DREQQUE-REC-O NOT = MREQ-NUMBER
               MOVE 15 TO COND-WORD.
012800     IF END-OF-CHAIN
               PERFORM 7000-UNLOCK-DREQQUE
012900         GO TO 6020-MOVE-FIELDS
013000     ELSE
013100     IF NOT GOOD-CALL
013200         MOVE "DBGET ERR DREQQUE 6010-GDL" TO BU-DISPLAY-MSG
013300         GO TO 6990-MAIN-X.
013400
           MOVE DRQQ-ORDER TO SAVE-DRQQ-ORDER.

013500     IF DRQQ-EMPL-QUEUED = FWRD-EMPL
013600*        "R85: REQ IS ALREQDY QUEUED FOR THIS EMPL"
013700         MOVE  18 TO LANG-SETNUM
013800         MOVE  86 TO LANG-MSGNUM
013900         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
014000         GO TO 6990-MAIN-X.
014100
014200     GO TO 6010-GET-DREQQUE-LOOP.
014300
014400 6020-MOVE-FIELDS.
014500     MOVE MREQ-NUMBER              TO   DRQQ-REQ-NUMBER.
014600     MOVE FWRD-EMPL                TO   DRQQ-EMPL-QUEUED,
014700                                        DRQQ-EQ-EMPL.
014800     MOVE "R"                      TO   DRQQ-TYPE.
014900     MOVE 1                        TO   DATE-MODE.
015000     CALL "TDATECHK" USING DATE-CHECK-AREA.
015100     MOVE DATE-YMD-OUT             TO   DRQQ-QUEUED-DATE.
           IF DRQQ-QUEUED-DATE-YY > "70"
               MOVE "19" TO DRQQ-QUEUED-DATE-CC
           ELSE
               MOVE "20" TO DRQQ-QUEUED-DATE-CC.
015200     MOVE SPACES                   TO   DRQQ-APPROVE-DATE-CN.
015300     MOVE FWRD-COMMENT-1           TO   DRQQ-COMMENT-1.
015400     MOVE FWRD-COMMENT-2           TO   DRQQ-COMMENT-2.
015500     MOVE SPACES                   TO   DRQQ-FLAGS.
015600     MOVE REQ-ORIGINATOR           TO   DRQQ-EMPL-ORIG,
015700                                        DRQQ-EO-EMPL.
015800     MOVE MEMPL-LEVEL              TO   DRQQ-LEVEL-NUM.
015900     MOVE SPACES                   TO   DRQQ-EQ-ST,
016000                                        DRQQ-EO-ST.
           IF SAVE-ORDER = "    "
               NEXT SENTENCE
           ELSE
           ADD 1                         TO   SAVE-ORDER-9.
           MOVE SAVE-ORDER               TO   DRQQ-ORDER.
016100
016200     ADD 1                         TO   REQ-APPROVALS-LEFT-9.
016300
017100*    CALL "DBPUT" USING BASE, DSET-DREQQUE, MODE1, STATUS-AREA,
017200*      ALL-ITEMS, BUF-DREQQUE.
           WRITE DREQQUE-REC-O FROM BUF-DREQQUE
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
017400         MOVE "CEAFWRD DBPUT ERR" TO BU-DISPLAY-MSG
017500         GO TO 6990-MAIN-X.
017600
017700*    CALL "DBUPDATE" USING BASE, DSET-MREQ, MODE1, STATUS-AREA,
017800*      ALL-ITEMS, BUF-MREQ.
           MOVE MREQ-NUMBER TO REQNO OF MREQ-REC-O.
           READ MREQ-O
               INVALID KEY MOVE 17 TO COND-WORD.
017900     IF FILE-STATUS NOT = "00"
018000         MOVE "CEAFWRD RE-READ MREQ ERR" TO BU-DISPLAY-MSG
018100         GO TO 6990-MAIN-X.
           REWRITE MREQ-REC-O FROM BUF-MREQ
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "CEAFWRD REWRITE MREQ ERR" TO BU-DISPLAY-MSG
               GO TO 6990-MAIN-X.
018800
018900 6990-MAIN-X.
           CLOSE MEMPL-I, MREQ-O, DREQQUE-O.
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               MOVE FILE-STATUS TO BU-DISPLAY-MSG-59-60.
019000     GOBACK.
019100
       7000-UNLOCK-DREQQUE.
      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO REQNO OF DREQQUE-REC-O.
           START DREQQUE-O KEY > REQNO OF DREQQUE-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

019200 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
020000 999-CATREAD-EXIT.
020100     EXIT.
