000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.     CEAQCHG.
000400 AUTHOR.         C HILLES.
000500 DATE-WRITTEN.   04/06/88.
000600 DATE-COMPILED.
000700*INSTALLATION.   GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*D   THIS SUBPROGRAM CHANGES ALL REQS QUEUED TO 1 APPROVER TO
001100*D   ANOTHER APPROVER IN DREQQUE.
      *D   CALLED BY PROGRAMS: SEAVACA
      *D                       SMREQINQ
      *D                       TEAQCHG
      *C
      *C 08/14/96  JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   INCLUDE CENTURY FOR CHECK OF APPROVAL DATE.
001200
001300 ENVIRONMENT DIVISION.
001400 CONFIGURATION SECTION.
001500 SOURCE-COMPUTER.  HP-3000.
001600 OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DREQQUE-O
                  ASSIGN TO DATABASE-MCFLCS4404
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

001700
001800 DATA DIVISION.
       FILE SECTION.
       FD  DREQQUE-O
           LABEL RECORDS ARE STANDARD.
       01  DREQQUE-REC-O.
           COPY DDS-MCRPCS4400  OF MCFLCS4404.

001900 WORKING-STORAGE SECTION.
002000*************************************************************
002100**                                                         **
002200**           D A T A B A S E   W O R K                     **
002300**                                                         **
002400*************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
002500
002600 01  PASSWORD                      PIC X(5)  VALUE "JADE;".
002700 01  DSET-NAMES.
002800     05  DSET-NAME                 PIC X(16) VALUE SPACES.
002900     05  DSET-DREQQUE              PIC X(16) VALUE "DREQQUE;".
003000
003100 01  EMPL-SEARCH-ST        PIC X(16) VALUE "EMPL-QUEUED-ST;".
003200 01  EMPL-ARG              PIC X(6)  VALUE SPACES.
003300
003400 01  MODE-AREA.
003500     05  DB-MODE                   PIC S9(4)   COMP       VALUE 0.
003600     05  MODE1                     PIC S9(4)   COMP       VALUE 1.
003700     05  MODE3                     PIC S9(4)   COMP       VALUE 3.
003800     05  MODE4                     PIC S9(4)   COMP       VALUE 4.
003900     05  MODE5                     PIC S9(4)   COMP       VALUE 5.
004000     05  MODE7                     PIC S9(4)   COMP       VALUE 7.
004100
004200 01  ALL-ITEMS                     PIC X(2)  VALUE "@;".
004300
004400 COPY DREQQUE    IN COPYLIB.
004500
004600 LINKAGE SECTION.
004700 01  BASE                          PIC X(10).
004800 COPY DBSTAT     IN COPYLIB.
004900 01  BU-DISPLAY-MSG                PIC X(60).
005000 01  OLD-APPROVER-ID               PIC X(4).
005100 01  NEW-APPROVER-ID               PIC X(4).
005200 01  NEW-APPROVER-LEVEL            PIC X(2).
005300
005400 PROCEDURE DIVISION USING BASE, STATUS-AREA, BU-DISPLAY-MSG,
005500     OLD-APPROVER-ID, NEW-APPROVER-ID, NEW-APPROVER-LEVEL.
005600
005700 0000-START.
           OPEN I-O DREQQUE-O.
005800     PERFORM 6000-MAIN THRU 6990-MAIN-X.
           CLOSE DREQQUE-O.
005900     GOBACK.
006000
006100 6000-MAIN.
006200 6500-SERIAL-LOOP.
006300     MOVE OLD-APPROVER-ID          TO   EMPL-ARG.
006400
006500 6505-FIND.
006600*------ NOTE: WE SEARCH ON EMPL-SEARCH-ST WHICH IS COMBO OF
006700*------ EMPL ID + REQ RELEASE STAT: THUS WE ONLY HAVE TO CHAIN
006800*------ THRU UNAPPROVED REQS.
006900*    CALL "DBFIND" USING BASE, DSET-DREQQUE, MODE1,
007000*      STATUS-AREA,  EMPL-SEARCH-ST,  EMPL-ARG.
           MOVE EMPL-ARG TO EMPLQUEDST OF DREQQUE-REC-O.
           START DREQQUE-O KEY = EMPLQUEDST OF DREQQUE-REC-O
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
007200         GO TO 6990-MAIN-X
007300     ELSE
007400     IF FILE-STATUS NOT = "00"
007500         MOVE "CEAQCHG DBFIND ERR DREQQUE" TO BU-DISPLAY-MSG
007600         GO TO 6990-MAIN-X.
007700
007800 6510-GET-LOOP.
007900*    CALL "DBGET" USING BASE, DSET-DREQQUE, MODE5, STATUS-AREA,
008000*      ALL-ITEMS, BUF-DREQQUE, EMPL-ARG.
           MOVE 0 TO COND-WORD.
           READ DREQQUE-O NEXT INTO BUF-DREQQUE
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF EMPLQUEDST OF DREQQUE-REC-O NOT = EMPL-ARG
               MOVE 15 TO COND-WORD.
008100     IF END-OF-CHAIN
               PERFORM 7000-UNLOCK-DREQQUE
008200         GO TO 6990-MAIN-X
008300     ELSE
008400     IF NOT GOOD-CALL
008500         GO TO 6990-MAIN-X.
008600
008700*----- WE ARE ONLY MOVING UNAPPROVED REQS, AND ONLY THOSE
008800*----- QUEUED TO A LEVEL- IE WE DONT MOVE ANY REQS THE OLD
008900*----- GUY ORIGINATED.
009000     IF DRQQ-APPROVE-DATE-CN > SPACES
009100         GO TO 6510-GET-LOOP.
009200
009300*------ WE NEVER RE-QUEUE AT THE 00 (ORIGINATOR LEVEL)
009400     IF DRQQ-LEVEL-NUM = "00"
009500         GO TO 6510-GET-LOOP.
009600
009700*------ THE CALLING PROGRAM CAN REQUE FOR ALL LEVELS OR FOR ONLY
009800*------ A CERTAIN LEVEL
009900     IF NEW-APPROVER-LEVEL = "AL"
010000         NEXT SENTENCE
010100     ELSE
010200     IF NEW-APPROVER-LEVEL = DRQQ-LEVEL-NUM
010300         NEXT SENTENCE
010400     ELSE
010500         GO TO 6510-GET-LOOP.
010600
010700*------ WE SKIP ANY OF THE ENTRIES WE HAVE ALREADY CHANGED TO
010800*------ THE NEW APPROVER.
010900     IF DRQQ-EMPL-QUEUED = NEW-APPROVER-ID
011000         GO TO 6510-GET-LOOP
011100     ELSE
011200     IF DRQQ-EMPL-QUEUED = OLD-APPROVER-ID
011300         NEXT SENTENCE
011400     ELSE
011500         GO TO 6510-GET-LOOP.
011600
011700     PERFORM 7200-CHANGE-QUEUED THRU 7210-CQ-X.
011800
011900     GO TO 6510-GET-LOOP.
012000
012100
012200 6990-MAIN-X.
012300     EXIT.
012400
       7000-UNLOCK-DREQQUE.
      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO EMPLQUEDST OF DREQQUE-REC-O.
           START DREQQUE-O KEY > EMPLQUEDST OF DREQQUE-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

012500 7200-CHANGE-QUEUED.
012900*    CALL "DBDELETE" USING BASE, DSET-DREQQUE, MODE1,
013000*      STATUS-AREA.
           DELETE DREQQUE-O INVALID KEY MOVE "2" TO FILE-STATUS-1.
           IF FILE-STATUS NOT = "00"
013200         MOVE "CEAQCHG DBDELETE ERR 7200-FQ2" TO BU-DISPLAY-MSG
013300         GO TO 7210-CQ-X.
013400
013500     MOVE NEW-APPROVER-ID          TO   DRQQ-EMPL-QUEUED,
013600                                        DRQQ-EQ-EMPL.
013700
013800*    CALL "DBPUT" USING  BASE, DSET-DREQQUE, MODE1,
013900*      STATUS-AREA, ALL-ITEMS, BUF-DREQQUE.
           WRITE DREQQUE-REC-O FROM BUF-DREQQUE
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
014100         MOVE "CEAQCHG DBPUT ERR DREQQUE 7200-FQ2"
014200                                   TO   BU-DISPLAY-MSG
014300         GO TO 7210-CQ-X.
014400
014700 7210-CQ-X.
014800     EXIT.
