000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.     CEAWOAP.
000400 AUTHOR.         C HILLES.
000500 DATE-WRITTEN.   2/16/88.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*D   ELECTRONIC REQUISITION APPROVALS - PASS WORKORDER APPROVAL TO
001100*D   CSIS FROM MMIS.  THIS IS CALLED IN THE FOLLOWING SETUP OF
001200*D   THE EA GLOBALS MENU: WO APPROVAL IS REQUIRED TO CUT REQS =
001300*D   "N", AND WO APPROVAL IS REQUIRED TO APPROVE REQS = "Y".  IF
001400*D   SO, THE LEVEL 98 IS ADDED AUTOMATICALLY TO THE APPROVAL
001500*D   QUEUE.  ONLY WHEN THE WO IS APPROVED WILL THIS SUBPROG BE
001600*D   CALLED - FOR EACH REQ ON THE WO.
      *C
      *C 08/14/96   JEFF BUNGO
      *C   EXPAND THE DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   INCLUDE CENTURY ON APPROVAL DATE.
001700
001800 ENVIRONMENT DIVISION.
001900 CONFIGURATION SECTION.
002000 SOURCE-COMPUTER.  HP-3000.
002100 OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DREQQUE-I
                  ASSIGN TO DATABASE-MCFLCS4401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT MREQ-I
                  ASSIGN TO DATABASE-MCFLCS2001
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

002200
002300 DATA DIVISION.
       FILE SECTION.
       FD  DREQQUE-I
           LABEL RECORDS ARE STANDARD.
       01  DREQQUE-REC-I.
           COPY DDS-MCRPCS4400  OF MCFLCS4401.

       FD  MREQ-I
           LABEL RECORDS ARE STANDARD.
       01  MREQ-REC-I.
           COPY DDS-MCRPCS2000  OF MCFLCS2001.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

002400 WORKING-STORAGE SECTION.
002500
002600**************************************************************
002700**                                                          **
002800**            D A T A B A S E   W O R K                     **
002900**                                                          **
003000**************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
003100
003200 01  REQ-SEARCH                    PIC X(16) VALUE "REQ-NUMBER;".
003300 01  REQ-ARG                       PIC X(12).
003400 01  PLT-ARG                       PIC X(4).
003500 01  DSET-NAMES.
003600     05  DSET-NAME                 PIC X(16) VALUE SPACES.
003700     05  DSET-MREQ                 PIC X(16) VALUE "MREQ;".
003800     05  DSET-DREQQUE              PIC X(16) VALUE "DREQQUE;".
003900     05  DSET-MPLTINFO             PIC X(16) VALUE "MPLTINFO;".
004000
004100 01  MODE-AREA.
004200     05  MODE1                     PIC S9(4)   COMP       VALUE 1.
004300     05  MODE6                     PIC S9(4)   COMP       VALUE 6.
004400     05  MODE7                     PIC S9(4)   COMP       VALUE 7.
004500
004600 01  ALL-ITEMS                     PIC X(2)  VALUE "@;".
004700
004800**************************************************************
004900**                                                          **
005000**            D A T A B A S E   B U F F E R S               **
005100**                                                          **
005200**************************************************************
005300 COPY MREQ       IN COPYLIB.
005400 COPY DREQQUE    IN COPYLIB.
005500 COPY DREQD      IN COPYLIB.
005600 COPY MPLT0      IN COPYLIB.
005700 COPY MPLTRQRL   IN COPYLIB.
005800 COPY MPLTPOPT   IN COPYLIB.
005900
006000******************************************************************
006100**                                                              **
006200**          S U B P R O G R A M   A R E A S                     **
006300**                                                              **
006400******************************************************************
006500 01  EAPP-PARMS                    PIC X(30) VALUE SPACES.
006600
006700*------ PARMS FOR CALL TO "CREQREM" - REQ REMARK SUBPROGRAM
006800 01  REQR-REMARKS.
006900     05  REQR-REMARK1              PIC X(79).
007000     05  REQR-REMARK2              PIC X(79).
007100
007200 COPY SREQPRNT   IN COPYLIB.
007300
007400**************************************************************
007500**                                                          **
007600**            L I N K A G E   S E C T I O N                 **
007700**                                                          **
007800**************************************************************
007900
008000 LINKAGE SECTION.
008100 01  BASE                          PIC X(10).
008200 01  BASE-MMISA                    PIC X(24).
008300 01  BASE-BUDGET                   PIC X(24).
008400 COPY DBSTAT     IN COPYLIB.
008500 COPY REQGLOBS   IN COPYLIB.
008600 01  PASS-SPOOL-PRT-NO             PIC S9(2) COMP-4.
008700 01  PASS-COMP                     PIC X(4).
008800 COPY CEAWOAP    IN COPYLIB.
008900 COPY ESCNAME   IN COPYLIB.
009000 COPY VCOMLINK   IN COPYLIB.
009100 COPY LANGSUB    IN COPYLIB.
009200 01  BU-DISPLAY-MSG.
009300     05  BU-DISPLAY-MSG-1          PIC X(1).
009400     05  FILLER                    PIC X(57).
           05  BU-DISPLAY-MSG-59-60      PIC X(2).
009500 01  BU-DISPLAY-FLDS.
009600     05  BU-DISPLAY-LINE  OCCURS 5 TIMES.
009700         10  BU-DISPLAY-FLD       PIC X(14).
009800         10  BU-DISPLAY-FLD9      PIC S9(8).
009900
010000
010100 PROCEDURE DIVISION USING          BASE,
010200                                   BASE-MMISA,
010300                                   BASE-BUDGET,
010400                                   STATUS-AREA,
010500                                   REQ-GLOBALS,
010600                                   PASS-SPOOL-PRT-NO,
010700                                   PASS-COMP,
010800                                   EAWOAP-PARMS,
010900                                   ESC-NAME,
011000                                   VIEW-COMAREA,
011100                                   LANGUAGE-PARMS,
011200                                   BU-DISPLAY-MSG,
011300                                   BU-DISPLAY-FLDS.
011400
011500 6000-MAIN.
           OPEN INPUT DREQQUE-I, MREQ-I, MPLTINFO-I.
011600
011700     MOVE "OK"                     TO   EAWOAP-RET-CODE.
011800
011900*------ DONT DO ANYTHING UNLESS THE FOLLOWING IS TRUE:
012000*------  1  WO APPROVAL REQUIRED TO CUT REQ = "N"
012100*------  2  WO APPROVAL REQUIRED TO APPROVE REQ = "Y"
012200*------ BECAUSE IF (1) IS NOT TRUE, NO REQS ARE CUT WITHOUT THE
012300*------ WO BEING APPROVED, SO WE DONT HAVE TO WORRY ABOUT LEVEL
012400*------ 98.  IF (2) IS NOT TRUE, WE DONT NEED THE WO APPROVED TO
012500*------ APPROVE THE REQ, SO WE ALSO DONT NEED LEVEL 98.
012600
012700     IF WOAP-TO-CUT-REQ = "N" AND WOAP-TO-APP-REQ = "Y"
012800         NEXT SENTENCE
012900     ELSE
013000         MOVE "NA"                 TO   EAWOAP-RET-CODE
013100         GO TO 6990-MAIN-X.
013200
013300     MOVE EAWOAP-REQ-NUMBER        TO   REQ-ARG.
013400*    CALL "DBGET" USING BASE, DSET-MREQ, MODE7, STATUS-AREA,
013500*      ALL-ITEMS, BUF-MREQ, REQ-ARG.
           MOVE REQ-ARG TO REQNO OF MREQ-REC-I.
           READ MREQ-I INTO BUF-MREQ
               INVALID KEY MOVE 17 TO COND-WORD.
013600     IF FILE-STATUS-1 = "2"
013700         MOVE "NF"                 TO   EAWOAP-RET-CODE
013800         GO TO 6990-MAIN-X
013900     ELSE
014000     IF FILE-STATUS NOT = "00"
014100         MOVE "CEAWOAP DBGET M7 MREQ 6000-M" TO BU-DISPLAY-MSG
014200         GO TO 6990-MAIN-X.
014300
014700*    CALL "DBFIND" USING BASE, DSET-DREQQUE, MODE1, STATUS-AREA,
014800*      REQ-SEARCH, REQ-ARG.
           MOVE REQ-ARG TO REQNO OF DREQQUE-REC-I.
           START DREQQUE-I KEY = REQNO OF DREQQUE-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
015000         MOVE "CEWOAP DBFIND DREQQUE 6000-M" TO BU-DISPLAY-MSG
015100         GO TO 6990-MAIN-X.
015200
015300 6100-GET-DREQQUE-LOOP.
015400*    CALL "DBGET" USING BASE, DSET-DREQQUE, MODE6, STATUS-AREA,
015500*      ALL-ITEMS, BUF-DREQQUE, REQ-ARG.
           MOVE 0 TO COND-WORD.
           READ DREQQUE-I NEXT INTO BUF-DREQQUE
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF REQNO OF DREQQUE-REC-I NOT = REQ-ARG
               MOVE 15 TO COND-WORD.
015600     IF END-OF-CHAIN
015700         MOVE "ND"                 TO   EAWOAP-RET-CODE
015800         GO TO 6990-MAIN-X
015900     ELSE
016000     IF NOT GOOD-CALL
016100         MOVE "CEAWOAP DBGET M5 DREQQUE 6100-GDL"
016200                                   TO   BU-DISPLAY-MSG
016300         GO TO 6990-MAIN-X.
016400
016500     IF DRQQ-LEVEL-NUM = "98"
016600         IF DRQQ-APPROVE-DATE-CN > SPACES
016700             MOVE "AA"             TO   EAWOAP-RET-CODE
016800             GO TO 6990-MAIN-X
016900         ELSE
017000             GO TO 6200-APPROVE-LEVEL-98
017100     ELSE
017200         GO TO 6100-GET-DREQQUE-LOOP.
017300
017400 6200-APPROVE-LEVEL-98.
017500     CALL "CEAAPPRV" USING BASE, BASE-MMISA, BASE-BUDGET,
017600       STATUS-AREA, BUF-MREQ, BUF-DREQQUE, REQ-GLOBALS,
017700       EAPP-PARMS, BU-DISPLAY-MSG.
017800     IF BU-DISPLAY-MSG-1 NOT = SPACES
017900         GO TO 6990-MAIN-X.
018000
018100     IF REQ-APPROVALS-LEFT-9 < 1
018200         PERFORM 9000-GET-REQ-PRINTER  THRU 9010-GRP-X
018300         MOVE REQ-APP-PRT-NUM      TO   REQ-SPOOL-PRT
018400         IF REQ-APP-PRT-NUM > 0
018500             PERFORM 9100-REPRINT.
018600
018700
018800 6990-MAIN-X.
018900     IF BU-DISPLAY-MSG-1 NOT = SPACES
019000         MOVE "BU"                 TO   EAWOAP-RET-CODE
               MOVE FILE-STATUS TO BU-DISPLAY-MSG-59-60.
           CLOSE DREQQUE-I, MREQ-I, MPLTINFO-I.
019100     GOBACK.
019200
019300 9000-GET-REQ-PRINTER.
019400     IF GOT-REQ-PRT-NUM = "Y"
019500         GO TO 9010-GRP-X.
019600
019700     MOVE "Y"                      TO   GOT-REQ-PRT-NUM.
019800
019900     MOVE "RQRL"                   TO   PLT-ARG.
020000*    CALL "DBGET" USING BASE, DSET-MPLTINFO, MODE7,
020100*      STATUS-AREA, ALL-ITEMS, BUF-MPLTINFO, PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
020200     IF FILE-STATUS-1 = "2"
020300         NEXT SENTENCE
020400     ELSE
020500     IF FILE-STATUS = "00"
020600        IF REQ-RLSE-PRINT-CONTROL = "PURCH"
020700            NEXT SENTENCE
020800        ELSE
020900         IF REQ-RLSE-PRINT-CONTROL = "LOCAL"
021000             MOVE PASS-SPOOL-PRT-NO TO  REQ-APP-PRT-NUM
021100             GO TO 9010-GRP-X
021200         ELSE
021300         IF REQ-RLSE-PRINT-CONTROL = "NOPRT"
021400             MOVE 0                TO   REQ-APP-PRT-NUM
021500             GO TO 9010-GRP-X
021600         ELSE
021700             MOVE PASS-SPOOL-PRT-NO TO  REQ-APP-PRT-NUM
021800             GO TO 9010-GRP-X
021900     ELSE
022000        MOVE "DBGET ERR MPLT1 76-GPP" TO BU-DISPLAY-MSG.
022100
022200*------ PRINT AT THE BLANK FORM PO PRINTER, IF THE KEY
022300*------ DOES NOT EXIST IN DATABASE, PRINT TO LOCAL PRINTER
022400     MOVE "POPT"                   TO  PLT-ARG.
022500*    CALL "DBGET" USING BASE, DSET-MPLTINFO, MODE7,
022600*      STATUS-AREA, ALL-ITEMS, BUF-MPLTINFO,
022700*      PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
022800     IF FILE-STATUS-1 = "2"
022900         MOVE PASS-SPOOL-PRT-NO    TO   REQ-APP-PRT-NUM
023000     ELSE
023100     IF FILE-STATUS = "00"
023200         MOVE MPLTINFO-REQ-PRT-NO  TO   REQ-APP-PRT-NUM
023300     ELSE
023400         MOVE "DBGET ERR MPLT 76-GET-REQ-PRINTER"
023500           TO BU-DISPLAY-MSG.
023600
023700 9010-GRP-X.
023800     EXIT.
023900
024000 9100-REPRINT.
024100     MOVE MREQ-NUMBER              TO   REQ-NUMBER.
024200     MOVE PASS-COMP                TO   REQ-COMPANY-SAVE.
024300
024400     MOVE EAWOAP-REQ-NUMBER        TO   DREQD-REQ-NUMBER.
024500     CALL "CREQREM" USING          BASE,
024600                                   BASE-MMISA,
024700                                   STATUS-AREA,
024800                                   BUF-DREQD,
024900                                   REQ-STATUS,
025000                                   REQR-REMARKS,
025100                                   BU-DISPLAY-MSG.
025200
025300     MOVE REQR-REMARKS             TO REQ-FREE-VERBAGE.
025400     MOVE SPACES                   TO REQ-REPRINT-INDIC.
025500     MOVE SPACES                   TO REQ-SREQPRNT-NOT-RELEASED.
025600
025700     CALL "SREQPRNT" USING BASE, BASE-MMISA, SREQPRNT-PARMS,
025800       ESC-NAME, LANGUAGE-PARMS, STATUS-AREA,
025900       BU-DISPLAY-MSG, BU-DISPLAY-FLDS, VIEW-COMAREA.
