       IDENTIFICATION DIVISION.
       PROGRAM-ID.      CFINDPO.
       AUTHOR.          CA YODER.
       DATE-WRITTEN.    OCTOBER 2003.
      **************************************************************
      *                                                            *
      *D  C F I N D P O                                            *
      *                                                            *
      *D    THIS PROGRAM FINDS THE BUYER CODE AND PO NUMBER TO     *
      *D    BE USED FOR CORPORATE CODES TO BE ADDED TO MASTER      *
      *D    REQUIREMENT ORDERS.                                    *
      *                                                            *
      **************************************************************
      *C
      *C  CHANGES:
      *C

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.
       SPECIAL-NAMES.  I-O-FEEDBACK IS I-O-FEEDBACK-AREA.


       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT VEN-FILE-I
               ASSIGN         TO DATABASE-MCFLAB2301
               ORGANIZATION   IS INDEXED
               ACCESS MODE    IS DYNAMIC
               RECORD KEY     IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS    IS FILE-STATUS.

           SELECT BUYER-FILE-I
               ASSIGN         TO DATABASE-MCFLAB2401
               ORGANIZATION   IS INDEXED
               ACCESS MODE    IS DYNAMIC
               RECORD KEY     IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS    IS FILE-STATUS.

       DATA DIVISION.

       FILE SECTION.

       FD  VEN-FILE-I
           LABEL RECORDS ARE STANDARD.
       01  VEN-FILE-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLAB2301.

       FD  BUYER-FILE-I
           LABEL RECORDS ARE STANDARD.
       01  BUYER-FILE-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLAB2401.

       WORKING-STORAGE SECTION.

       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X      VALUE "0".
           05  FILE-STATUS-2             PIC X      VALUE "0".

      **************************************************************
      **                DATABASE I/O BUFFER AREA                  **
      **************************************************************

       COPY DBUYRTBL    IN COPYLIB.

       COPY DVENPO      IN COPYLIB.

       LINKAGE SECTION.

       01  PASSED-PARAMETERS.
           05  PASS-MAJOR-GROUP         PIC X(02).
           05  PASS-VENDOR-CODE         PIC X(10).
           05  PASS-BUYER-CODE          PIC X(04).
           05  PASS-PO-NUM              PIC X(14).

      **************************************************************
      **           P R O C E D U R E   D I V I S I O N            **
      **************************************************************

       PROCEDURE DIVISION     USING PASSED-PARAMETERS.

       0-BEGIN.
           PERFORM 1-HSK.

           PERFORM 6-MAIN THROUGH 6-MAIN-X.

           PERFORM 2-EOJ.

           GOBACK.

      **************************************************************
       1-HSK.
      **************************************************************
           OPEN INPUT VEN-FILE-I, BUYER-FILE-I.

      **************************************************************
       2-EOJ.
      **************************************************************
           CLOSE  VEN-FILE-I, BUYER-FILE-I.

      **************************************************************
       6-MAIN.
      **************************************************************
           MOVE SPACES                  TO  PASS-BUYER-CODE
                                            PASS-PO-NUM.
           MOVE PASS-MAJOR-GROUP TO MAJORGRP  OF BUYER-FILE-REC-I.
           READ BUYER-FILE-I INTO BUF-DBUYRTBL
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               GO TO 6-MAIN-X.

           MOVE PASS-VENDOR-CODE     TO  VENCDE OF VEN-FILE-REC-I.
           MOVE DBUYR-BUYER-CODE     TO  BUYERCDE OF VEN-FILE-REC-I
                                         PASS-BUYER-CODE.
           READ VEN-FILE-I INTO BUF-DVENPO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               GO TO 6-MAIN-X.

           MOVE DVENPO-PO-NUM        TO  PASS-PO-NUM.

       6-MAIN-X.
           EXIT.

