000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          CFINPTYP.
000400 AUTHOR.              UP FOR GRABS.
000500 DATE-WRITTEN.        DECEMBER 1985.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*************************************************************
001100*************************************************************
001200**                  C F I N P T Y P                        **
001300**                                                         **
001400**     THIS PROGRAM FINDS A PART NUMBER TYPE BASED ON THE  **
001500**     THE FIRST LETTER OF THE CATALOG DESCRIPTION.        **
001600**                                                         **
001700**     THE EDITOR FILE "DFINPTYP.PUB" CONTAINS A LIST OF   **
001800**     MANUFACTURERS.  EACH RECORD CONTAINS THE SAME       **
001900**     ENTRY FOR UP TO TWO   LANGUAGES.  PROGRAMS CALLING  **
002000**     THIS SUBPROGRAM MUST PROVIDE THE LETTER BEING       **
002100**     SEARCHED FOR AND THE LANGUAGE NUMBER.  (NOTE        **
002200**     BELOW THAT THIS IS NOT NATIVE LANGUAGE NUMBER.)     **
002300**     IF A LANGUAGE NUMBER IS NOT PASSED, OR AN INCORRECT **
002400**     ONE IS PASSED, THE NUMBER WILL DEFAULT TO 1.        **
002500**                                                         **
002600**     IF THE MANUFACTURER IS NOT FOUND, THE EXPANDED      **
002700**     NAME WILL CONTAIN THE VALUE "***  NOT FOUND  ***".  **
002800**                                                         **
002900**     THE TABLE THAT IS LOADED FROM THE FILE IS IN THE    **
003000**     LINKAGE SECTION - THE DATA WILL BE PASSED BACK TO   **
003100**     THE CALLING PROGRAM - THEREFORE THE FILE DFINPTYP   **
003200**     .PUB WILL ONLY HAVE TO BE READ ONCE.                **
003300*************************************************************
003400**                                                         **
003500**     CALLED PROGRAMS:  NONE                              **
003600**     CALLING PROGRAMS:                                   **
003700**          1.  TMFRPT.SOURCE                              **
003800*************************************************************
003900*************************************************************
004000**              I N P U T S   /   O U T P U T S            **
004100**                                                         **
004200**     INPUT PARAMETERS:                                   **
004300**      1.  FIRST-CALL         PIC X                       **
004400**          "Y"=FIRST TIME CALLING PROGRAM CALLED THIS     **
004500**          SUBPROGRAM.  FILE "DFINPTYP.PUB" IS READ INTO  **
004600**          A TABLE.                                       **
004700**          "N"=REPEATED CALLS TO THIS SUBPROGRAM.  FILE   **
004800**          IS NOT READ INTO TABLE AGAIN SINCE THE DATA    **
004900**          IS RETAINED BETWEEN CALLS.                     **
005000**                                                         **
005100**      2.  LANGUAGE-NUMBER    PIC 9                       **
005200**          THE EDITOR FILE "DFINPTYP.PUB" HAS 2 LANGUAGES **
005300**          PER RECORD FOR EACH MANUFACTURER STORED.       **
005400**          (UP TO 2 ARE POSSIBLE, BUT NOT NECESSARILY     **
005500**          ENTERED IN THE FILE).  LANGUAGE-NUMBER         **
005600**          POINTS TO LANGUAGE 1, OR 2 IN THE RECORD.      **
005700**          ANY VALUE OTHER THAN 1, OR 2 WILL DEFAULT      **
005800**          TO 1.                                          **
005900**                                                         **
006000**      3.  DATA-SET-LETTER    PIC X(2)                    **
006100**          LETTER TO SEARCH FOR PART TYPE BY.             **
006200**                                                         **
006300**      OUTPUT PARAMETERS:                                 **
006400**      1.  PARM-CAT-NAME      PIC X(4)                    **
006500**          CATALOG DESCRIPTION                            **
006600**                                                         **
006700**      2.  PARM-EXPANDED      PIC X(20)                   **
006800**          MANUFACTURER'S NAME                            **
006900**          IF NOT FOUND IN THE FILE, PARM-CAT-NAME IS     **
007000**          BLANK AND PARM-EXPANDED WILL CONTAIN           **
007100**          "***  FILE NOT FOUND  ***".                    **
007200*************************************************************
007300*************************************************************
007400*    CHANGES.
007500*    06/20/86.
007600*    CHANGED FROM "SUBPROGRAM" TO "DYNAMIC" SO THAT THIS SUPBGRAM,
007700*    AND "CDESC" WHICH CALLS IT, CAN BE PLACED IN THE ACCOUNT SL.
007800*    DECREASED THE TABLE SIZE FROM 75 TO 23 ENTRIES, AND ELIMINATED
007900*    THE 3RD LANGUAGE FROM THE TABLE.  THIS REDUCED THE TABLE SIZE
008000*    FROM ALMOST 6K BYTES TO A LITTLER OVER 1K BYTES.  NUMBER OF POSSIBLE
008100*    PART ENTRIES IS CURRENTLY FIXED AT 8 IN THE MAINFRAME - NOT
008200*    EXPECTED TO INCREASE MUCH IF ANY.  THE PROBLEM OF RETAINING THE
008300*    TABLE OF ENTRIES ONCE LOADED WAS SOLVED BY MOVING THE TABLE INTO
008400*    THE LINKAGE SECTION - THIS IS IS PASSED TO AND FROM THE SUBPROGRAM -
008500*    THEREFORE THE DATA IS NOT LOST.  THE TABLE IS REFERENCED AS A "FILLER
008600*    ENTRY IN THE COPYLIB, SINCE THE CALLING PROGRAM IS NOT CONCERNED
008700*    WITH IT.  CIH.
008800*
      *    SINCE WE HAVE 'DFINPTYP.PUB' IN THE PUB GROUP AND SEND IT
      *    OUT ON UPDATE TAPES, EVERYONE HAS OUR FILE, WHICH NEVER
      *    CHANGES.  THEREFORE SAVE THE FILE ACCESSES AND RETURN
      *    THE TRANSLATED INFORMATION DIRECTLY.  CIH 28 NOV 88.
      *
008900 ENVIRONMENT DIVISION.
009000 CONFIGURATION SECTION.
009100 SOURCE-COMPUTER.  HP-3000.
009200 OBJECT-COMPUTER.  HP-3000.
009300*INPUT-OUTPUT SECTION.
009400*FILE-CONTROL.
009500*
009600*SELECT CATTYP-FILE ASSIGN TO "DFINPTYP.PUB".
009700*
009800 DATA DIVISION.
009900*FILE SECTION.
010000*
010100*FD  CATTYP-FILE
010200*    LABEL RECORDS ARE STANDARD
010300*    RECORD CONTAINS 78 CHARACTERS
010400*    DATA RECORD IS CATTYP-RCD.
010500*01  CATTYP-RCD.
010600*    05  CM1-LETTER          PIC X(2).
010700*    05  CM1-NAME            PIC X(4).
010800*    05  CM1-EXPANDED-NAME   PIC X(20).
010900*    05  CM2-LETTER          PIC X(2).
011000*    05  CM2-NAME            PIC X(4).
011100*    05  CM2-EXPANDED-NAME   PIC X(20).
011200*    05  FILLER              PIC X(26).
011300*
011400 WORKING-STORAGE SECTION.
011500 LINKAGE SECTION.
011600 01  CFINPTYP-PARMS.
012500     05 PASSED-PARMS.
012600        10  FIRST-CALL           PIC X.
012700        10  LANGUAGE-NUMBER      PIC 9.
012800        10  DATA-SET-LETTER      PIC X(2).
012900     05 RETURNED-PARMS.
013000        10  PARM-CAT-NAME        PIC X(4).
013100        10  PARM-EXPANDED        PIC X(20).
013200
013300 PROCEDURE DIVISION USING CFINPTYP-PARMS.
013400
013500 6000-MAIN.
           IF DATA-SET-LETTER = "B"
               MOVE "B/M" TO PARM-CAT-NAME
               MOVE "BILL OF MATERIALS" TO PARM-EXPANDED
           ELSE
           IF DATA-SET-LETTER = "C"
               MOVE "CAT" TO PARM-CAT-NAME
               MOVE "CATALOG NUMBER" TO PARM-EXPANDED
           ELSE
           IF DATA-SET-LETTER = "D"
               MOVE "DWG" TO PARM-CAT-NAME
               MOVE "DRAWING NUMBER" TO PARM-EXPANDED
           ELSE
           IF DATA-SET-LETTER = "K"
               MOVE "K/L" TO PARM-CAT-NAME
               MOVE "DRAWING NUMBER" TO PARM-EXPANDED
           ELSE
           IF DATA-SET-LETTER = "M"
               MOVE "MOD" TO PARM-CAT-NAME
               MOVE "MODEL NUMBER" TO PARM-EXPANDED
           ELSE
           IF DATA-SET-LETTER = "P"
               MOVE "P/N" TO PARM-CAT-NAME
               MOVE "PART NUMBER" TO PARM-EXPANDED
           ELSE
           IF DATA-SET-LETTER = "S"
               MOVE "SK." TO PARM-CAT-NAME
               MOVE "SKETCH NUMBER" TO PARM-EXPANDED
           ELSE
               MOVE SPACES TO PARM-CAT-NAME
               MOVE SPACES TO PARM-EXPANDED.
       6000-MAIN-X.
           GOBACK.
