       IDENTIFICATION DIVISION.
       PROGRAM-ID.          CFINDLCK.
       AUTHOR.              C HILLES.
       DATE-WRITTEN.        3/8/91.
       DATE-COMPILED.
      *INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
      *SECURITY.
      *REMARKS.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  HP-3000.
       OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT QPDSPJOB-FILE
                  ASSIGN TO DATABASE-MCFPDSPJOB
                  ORGANIZATION IS SEQUENTIAL
                  ACCESS MODE IS SEQUENTIAL
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  QPDSPJOB-FILE
           RECORD CONTAINS 133 CHARACTERS.
       01  QPDSPJOB-REC.
           05  FILLER                    PIC X(1).
           05  QP-LOCKED-FILE            PIC X(10).
           05  FILLER                    PIC X(30).
           05  JOB-RECORD-LOCKS-CHK      PIC X(16).
           05  FILLER                    PIC X(76).

       WORKING-STORAGE SECTION.
       COPY CFLIT    IN COPYLIB.
       COPY COMMAND  IN COPYLIB.
       COPY CCRTFILE IN COPYLIB.
       COPY FILESTAT IN COPYLIB.
       01  END-OF-FILE                   PIC X(1).
       01  WORK-1                        PIC X(133).
       01  SUB                           PIC 9(4) BINARY.
       01  RETURN-CODE                   PIC X(2).

       LINKAGE SECTION.
       01  JOB-NUM                       PIC X(6).
       01  JOB-USER                      PIC X(10).
       01  JOB-NAME                      PIC X(10).
       01  LOCK-FLAG                     PIC X(1).
       01  LOCKED-FILE                   PIC X(10).
       PROCEDURE DIVISION USING          JOB-NUM,
                                         JOB-USER,
                                         JOB-NAME,
                                         LOCK-FLAG,
                                         LOCKED-FILE.

       6000-MAIN.
           CALL "MCXWRKJOBL" USING JOB-NUM, JOB-USER, JOB-NAME,
             RETURN-CODE.
           IF RETURN-CODE NOT = "00"
               MOVE "N" TO LOCK-FLAG
               GO TO 6990-MAIN-X.

      *------ CALL CCRTFILE TO CREATE A TEMPORARY FILE 'MCFPDSPJOB'
           MOVE "QTEMP"                  TO  CCRTFILE-LIBRARY.
           MOVE "MCFPDSPJOB"             TO  CCRTFILE-FILE.
           MOVE "0133"                   TO  CCRTFILE-RECORD-LENGTH.
           MOVE "01000"                  TO  CCRTFILE-NO-RECORDS.
           MOVE "01000"                  TO  CCRTFILE-INCREMENT-AMT.
           MOVE "10"                     TO  CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               DISPLAY "CREATE OF MCFPDSPJOB FAILED"
               GO TO 6990-MAIN-X.

           MOVE SPACES                   TO  COMMAND.
           STRING "CPYSPLF FILE(QPDSPJOB) TOFILE(QTEMP/MCFPDSPJOB)",
             " SPLNBR(*LAST)" DELIMITED BY SIZE INTO COMMAND.
           PERFORM 9999-COMMAND.

           MOVE "DLTSPLF FILE(QPDSPJOB) SPLNBR(*LAST)" TO COMMAND.
           PERFORM 9999-COMMAND.

           OPEN INPUT QPDSPJOB-FILE.
           MOVE "N"                      TO  LOCK-FLAG
           MOVE "N"                      TO  END-OF-FILE.
           READ QPDSPJOB-FILE AT END MOVE "Y" TO END-OF-FILE.
           PERFORM UNTIL END-OF-FILE = "Y"
           OR JOB-RECORD-LOCKS-CHK = "Job Record Locks"
               READ QPDSPJOB-FILE AT END
                   MOVE "Y" TO END-OF-FILE
               END-READ
           END-PERFORM.

           PERFORM UNTIL END-OF-FILE = "Y"
               IF QP-LOCKED-FILE > "A"
               AND (QP-LOCKED-FILE NOT = "File")
                   MOVE QP-LOCKED-FILE   TO  LOCKED-FILE
                   MOVE "Y"              TO  LOCK-FLAG
               END-IF
               READ QPDSPJOB-FILE AT END
                   MOVE "Y"              TO  END-OF-FILE
               END-READ
           END-PERFORM.

       6990-MAIN-X.
           CLOSE QPDSPJOB-FILE.
           GOBACK.

       9999-COMMAND.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

