000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.   CFLIT.
016600 ENVIRONMENT DIVISION.
016700 CONFIGURATION SECTION.
016800 SOURCE-COMPUTER. HP-3000.
016900 OBJECT-COMPUTER. HP-3000.
017200 DATA DIVISION.
017300 WORKING-STORAGE SECTION.
       01  STRING-LEN        PIC 9(2).
       01  SUB               PIC 9(2).
       01  WORK-LINE         PIC X(80).

       01  SEARCH-STRING-1   PIC X(01).
       01  SEARCH-STRING-2   PIC X(02).
       01  SEARCH-STRING-3   PIC X(03).
       01  SEARCH-STRING-4   PIC X(04).
       01  SEARCH-STRING-5   PIC X(05).
       01  SEARCH-STRING-6   PIC X(06).
       01  SEARCH-STRING-7   PIC X(07).
       01  SEARCH-STRING-8   PIC X(08).
       01  SEARCH-STRING-9   PIC X(09).
       01  SEARCH-STRING-10  PIC X(10).
       01  SEARCH-STRING-11  PIC X(11).
       01  SEARCH-STRING-12  PIC X(12).
       01  SEARCH-STRING-13  PIC X(13).
       01  SEARCH-STRING-14  PIC X(14).
       01  SEARCH-STRING-15  PIC X(15).
       01  SEARCH-STRING-16  PIC X(16).
       01  SEARCH-STRING-17  PIC X(17).
       01  SEARCH-STRING-18  PIC X(18).
       01  SEARCH-STRING-19  PIC X(19).
       01  SEARCH-STRING-20  PIC X(20).
       01  SEARCH-STRING-21  PIC X(21).
       01  SEARCH-STRING-22  PIC X(22).
       01  SEARCH-STRING-23  PIC X(23).
       01  SEARCH-STRING-24  PIC X(24).
       01  SEARCH-STRING-25  PIC X(25).
       01  SEARCH-STRING-26  PIC X(26).
       01  SEARCH-STRING-27  PIC X(27).
       01  SEARCH-STRING-28  PIC X(28).
       01  SEARCH-STRING-29  PIC X(29).
       01  SEARCH-STRING-30  PIC X(30).

       01  SEARCH-STRING.
           05  SEARCH-BYTE OCCURS 30 TIMES PIC X(1).

       LINKAGE SECTION.
       01  FOUND-POS             PIC 9(3).
       01  PASSED-SEARCH-STRING  PIC X(30).
       01  STRING-TO-SEARCH      PIC X(133).
026800 PROCEDURE DIVISION USING FOUND-POS, PASSED-SEARCH-STRING,
            STRING-TO-SEARCH.
027000 6000-MAIN.
           MOVE ZERO TO FOUND-POS.
           MOVE PASSED-SEARCH-STRING TO SEARCH-STRING.

      *------ CHANGE THE STRING TO SEARCH TO ALL UPPERCASE
           INSPECT STRING-TO-SEARCH REPLACING
              ALL "a" BY "A"
              ALL "b" BY "B"
              ALL "c" BY "C"
              ALL "d" BY "D"
              ALL "e" BY "E"
              ALL "f" BY "F"
              ALL "g" BY "G"
              ALL "h" BY "H"
              ALL "i" BY "I"
              ALL "j" BY "J"
              ALL "k" BY "K"
              ALL "l" BY "L"
              ALL "m" BY "M"
              ALL "n" BY "N"
              ALL "o" BY "O"
              ALL "p" BY "P"
              ALL "q" BY "Q"
              ALL "r" BY "R"
              ALL "s" BY "S"
              ALL "t" BY "T"
              ALL "u" BY "U"
              ALL "v" BY "V"
              ALL "w" BY "W"
              ALL "x" BY "X"
              ALL "y" BY "Y"
              ALL "z" BY "Z".

      *------ FIRST DETERMINE LENGTH OF THE STRING TO SEARCH FOR
           IF SEARCH-BYTE (30) > " "
               MOVE 30 TO STRING-LEN
           ELSE
               MOVE 30 TO STRING-LEN.
               PERFORM UNTIL SEARCH-BYTE (STRING-LEN) > " "
               OR STRING-LEN < 1
                   SUBTRACT 1 FROM STRING-LEN
               END-PERFORM.

      *------ SHIFT-6 IS USED FOR SPACE HOLDER
           MOVE ZERO TO SUB.
           PERFORM 30 TIMES
               ADD 1 TO SUB
               IF SEARCH-BYTE (SUB) = "¬"
                   MOVE " " TO SEARCH-BYTE (SUB)
               END-IF
           END-PERFORM.

           IF STRING-LEN = 1
               PERFORM 7001-SEARCH
           ELSE
           IF STRING-LEN = 2
               PERFORM 7002-SEARCH
           ELSE
           IF STRING-LEN = 3
               PERFORM 7003-SEARCH
           ELSE
           IF STRING-LEN = 4
               PERFORM 7004-SEARCH
           ELSE
           IF STRING-LEN = 5
               PERFORM 7005-SEARCH
           ELSE
           IF STRING-LEN = 6
               PERFORM 7006-SEARCH
           ELSE
           IF STRING-LEN = 7
               PERFORM 7007-SEARCH
           ELSE
           IF STRING-LEN = 8
               PERFORM 7008-SEARCH
           ELSE
           IF STRING-LEN = 9
               PERFORM 7009-SEARCH
           ELSE
           IF STRING-LEN = 10
               PERFORM 7010-SEARCH
           ELSE
           IF STRING-LEN = 11
               PERFORM 7011-SEARCH
           ELSE
           IF STRING-LEN = 12
               PERFORM 7012-SEARCH
           ELSE
           IF STRING-LEN = 13
               PERFORM 7013-SEARCH
           ELSE
           IF STRING-LEN = 14
               PERFORM 7014-SEARCH
           ELSE
           IF STRING-LEN = 15
               PERFORM 7015-SEARCH
           ELSE
           IF STRING-LEN = 16
               PERFORM 7016-SEARCH
           ELSE
           IF STRING-LEN = 17
               PERFORM 7017-SEARCH
           ELSE
           IF STRING-LEN = 18
               PERFORM 7018-SEARCH
           ELSE
           IF STRING-LEN = 19
               PERFORM 7019-SEARCH
           ELSE
           IF STRING-LEN = 20
               PERFORM 7020-SEARCH
           ELSE
           IF STRING-LEN = 21
               PERFORM 7021-SEARCH
           ELSE
           IF STRING-LEN = 22
               PERFORM 7022-SEARCH
           ELSE
           IF STRING-LEN = 23
               PERFORM 7023-SEARCH
           ELSE
           IF STRING-LEN = 24
               PERFORM 7024-SEARCH
           ELSE
           IF STRING-LEN = 25
               PERFORM 7025-SEARCH
           ELSE
           IF STRING-LEN = 26
               PERFORM 7026-SEARCH
           ELSE
           IF STRING-LEN = 27
               PERFORM 7027-SEARCH
           ELSE
           IF STRING-LEN = 28
               PERFORM 7028-SEARCH
           ELSE
           IF STRING-LEN = 29
               PERFORM 7029-SEARCH
           ELSE
           IF STRING-LEN = 30
               PERFORM 7030-SEARCH.

           IF FOUND-POS > 132
               MOVE ZERO TO FOUND-POS
           ELSE
               ADD 1 TO FOUND-POS.

       6990-MAIN-X.
           GOBACK.

       7001-SEARCH.
           MOVE SEARCH-STRING TO SEARCH-STRING-1.
           UNSTRING STRING-TO-SEARCH DELIMITED BY SEARCH-STRING-1
             INTO WORK-LINE
             COUNT IN FOUND-POS.
       7002-SEARCH.
           MOVE SEARCH-STRING TO SEARCH-STRING-2.
           UNSTRING STRING-TO-SEARCH DELIMITED BY SEARCH-STRING-2
             INTO WORK-LINE
             COUNT IN FOUND-POS.
       7003-SEARCH.
           MOVE SEARCH-STRING TO SEARCH-STRING-3.
           UNSTRING STRING-TO-SEARCH DELIMITED BY SEARCH-STRING-3
             INTO WORK-LINE
             COUNT IN FOUND-POS.
       7004-SEARCH.
           MOVE SEARCH-STRING TO SEARCH-STRING-4.
           UNSTRING STRING-TO-SEARCH DELIMITED BY SEARCH-STRING-4
             INTO WORK-LINE
             COUNT IN FOUND-POS.
       7005-SEARCH.
           MOVE SEARCH-STRING TO SEARCH-STRING-5.
           UNSTRING STRING-TO-SEARCH DELIMITED BY SEARCH-STRING-5
             INTO WORK-LINE
             COUNT IN FOUND-POS.
       7006-SEARCH.
           MOVE SEARCH-STRING TO SEARCH-STRING-6.
           UNSTRING STRING-TO-SEARCH DELIMITED BY SEARCH-STRING-6
             INTO WORK-LINE
             COUNT IN FOUND-POS.
       7007-SEARCH.
           MOVE SEARCH-STRING TO SEARCH-STRING-7.
           UNSTRING STRING-TO-SEARCH DELIMITED BY SEARCH-STRING-7
             INTO WORK-LINE
             COUNT IN FOUND-POS.
       7008-SEARCH.
           MOVE SEARCH-STRING TO SEARCH-STRING-8.
           UNSTRING STRING-TO-SEARCH DELIMITED BY SEARCH-STRING-8
             INTO WORK-LINE
             COUNT IN FOUND-POS.
       7009-SEARCH.
           MOVE SEARCH-STRING TO SEARCH-STRING-9.
           UNSTRING STRING-TO-SEARCH DELIMITED BY SEARCH-STRING-9
             INTO WORK-LINE
             COUNT IN FOUND-POS.
       7010-SEARCH.
           MOVE SEARCH-STRING TO SEARCH-STRING-10.
           UNSTRING STRING-TO-SEARCH DELIMITED BY SEARCH-STRING-10
             INTO WORK-LINE
             COUNT IN FOUND-POS.
       7011-SEARCH.
           MOVE SEARCH-STRING TO SEARCH-STRING-11.
           UNSTRING STRING-TO-SEARCH DELIMITED BY SEARCH-STRING-11
             INTO WORK-LINE
             COUNT IN FOUND-POS.
       7012-SEARCH.
           MOVE SEARCH-STRING TO SEARCH-STRING-12.
           UNSTRING STRING-TO-SEARCH DELIMITED BY SEARCH-STRING-12
             INTO WORK-LINE
             COUNT IN FOUND-POS.
       7013-SEARCH.
           MOVE SEARCH-STRING TO SEARCH-STRING-13.
           UNSTRING STRING-TO-SEARCH DELIMITED BY SEARCH-STRING-13
             INTO WORK-LINE
             COUNT IN FOUND-POS.
       7014-SEARCH.
           MOVE SEARCH-STRING TO SEARCH-STRING-14.
           UNSTRING STRING-TO-SEARCH DELIMITED BY SEARCH-STRING-14
             INTO WORK-LINE
             COUNT IN FOUND-POS.
       7015-SEARCH.
           MOVE SEARCH-STRING TO SEARCH-STRING-15.
           UNSTRING STRING-TO-SEARCH DELIMITED BY SEARCH-STRING-15
             INTO WORK-LINE
             COUNT IN FOUND-POS.
       7016-SEARCH.
           MOVE SEARCH-STRING TO SEARCH-STRING-16.
           UNSTRING STRING-TO-SEARCH DELIMITED BY SEARCH-STRING-16
             INTO WORK-LINE
             COUNT IN FOUND-POS.
       7017-SEARCH.
           MOVE SEARCH-STRING TO SEARCH-STRING-17.
           UNSTRING STRING-TO-SEARCH DELIMITED BY SEARCH-STRING-17
             INTO WORK-LINE
             COUNT IN FOUND-POS.
       7018-SEARCH.
           MOVE SEARCH-STRING TO SEARCH-STRING-18.
           UNSTRING STRING-TO-SEARCH DELIMITED BY SEARCH-STRING-18
             INTO WORK-LINE
             COUNT IN FOUND-POS.
       7019-SEARCH.
           MOVE SEARCH-STRING TO SEARCH-STRING-19.
           UNSTRING STRING-TO-SEARCH DELIMITED BY SEARCH-STRING-19
             INTO WORK-LINE
             COUNT IN FOUND-POS.
       7020-SEARCH.
           MOVE SEARCH-STRING TO SEARCH-STRING-20.
           UNSTRING STRING-TO-SEARCH DELIMITED BY SEARCH-STRING-20
             INTO WORK-LINE
             COUNT IN FOUND-POS.
       7021-SEARCH.
           MOVE SEARCH-STRING TO SEARCH-STRING-21.
           UNSTRING STRING-TO-SEARCH DELIMITED BY SEARCH-STRING-21
             INTO WORK-LINE
             COUNT IN FOUND-POS.
       7022-SEARCH.
           MOVE SEARCH-STRING TO SEARCH-STRING-22.
           UNSTRING STRING-TO-SEARCH DELIMITED BY SEARCH-STRING-22
             INTO WORK-LINE
             COUNT IN FOUND-POS.
       7023-SEARCH.
           MOVE SEARCH-STRING TO SEARCH-STRING-23.
           UNSTRING STRING-TO-SEARCH DELIMITED BY SEARCH-STRING-23
             INTO WORK-LINE
             COUNT IN FOUND-POS.
       7024-SEARCH.
           MOVE SEARCH-STRING TO SEARCH-STRING-24.
           UNSTRING STRING-TO-SEARCH DELIMITED BY SEARCH-STRING-24
             INTO WORK-LINE
             COUNT IN FOUND-POS.
       7025-SEARCH.
           MOVE SEARCH-STRING TO SEARCH-STRING-25.
           UNSTRING STRING-TO-SEARCH DELIMITED BY SEARCH-STRING-25
             INTO WORK-LINE
             COUNT IN FOUND-POS.
       7026-SEARCH.
           MOVE SEARCH-STRING TO SEARCH-STRING-26.
           UNSTRING STRING-TO-SEARCH DELIMITED BY SEARCH-STRING-26
             INTO WORK-LINE
             COUNT IN FOUND-POS.
       7027-SEARCH.
           MOVE SEARCH-STRING TO SEARCH-STRING-27.
           UNSTRING STRING-TO-SEARCH DELIMITED BY SEARCH-STRING-27
             INTO WORK-LINE
             COUNT IN FOUND-POS.
       7028-SEARCH.
           MOVE SEARCH-STRING TO SEARCH-STRING-28.
           UNSTRING STRING-TO-SEARCH DELIMITED BY SEARCH-STRING-28
             INTO WORK-LINE
             COUNT IN FOUND-POS.
       7029-SEARCH.
           MOVE SEARCH-STRING TO SEARCH-STRING-29.
           UNSTRING STRING-TO-SEARCH DELIMITED BY SEARCH-STRING-29
             INTO WORK-LINE
             COUNT IN FOUND-POS.
       7030-SEARCH.
           MOVE SEARCH-STRING TO SEARCH-STRING-30.
           UNSTRING STRING-TO-SEARCH DELIMITED BY SEARCH-STRING-30
             INTO WORK-LINE
             COUNT IN FOUND-POS.
