       IDENTIFICATION DIVISION.
       PROGRAM-ID.          CFNDLCKJBL.
       AUTHOR.              C HILLES.
       DATE-WRITTEN.        3/8/91.
       DATE-COMPILED.
      *INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
      *SECURITY.
      *REMARKS.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  HP-3000.
       OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT QPJOBLOG-FILE
                  ASSIGN TO DATABASE-MCFPJOBLOG
                  ORGANIZATION IS SEQUENTIAL
                  ACCESS MODE IS SEQUENTIAL
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  QPJOBLOG-FILE
           RECORD CONTAINS 133 CHARACTERS.
       01  QPJOBLOG-REC                  PIC X(133).

       WORKING-STORAGE SECTION.
       COPY CFLIT    IN COPYLIB.
       COPY COMMAND  IN COPYLIB.
       COPY CCRTFILE IN COPYLIB.
       COPY FILESTAT IN COPYLIB.
       01  END-OF-FILE                   PIC X(1).
       01  WORK-1                        PIC X(133).
       01  JOB-SPEC                      PIC X(28).

       LINKAGE SECTION.
       01 JOB-NUMBER              PIC X(6).
       01 JOB-USER                PIC X(10).
       01 JOB-NAME                PIC X(10).
       01 RET-STAT                PIC X(2).
       PROCEDURE DIVISION USING   JOB-NUMBER,
                                  JOB-USER,
                                  JOB-NAME,
                                  RET-STAT.

       6000-MAIN.
           MOVE "00"                     TO  RET-STAT.
           MOVE SPACES                   TO  JOB-NUMBER,
                                             JOB-USER,
                                             JOB-NAME.
           MOVE "DSPJOBLOG OUTPUT(*PRINT)" TO COMMAND.
           PERFORM 9999-COMMAND.
      *------ CALL CCRTFILE TO CREATE A TEMPORARY FILE 'MCFPJOBLOG'
           MOVE "QTEMP"                  TO  CCRTFILE-LIBRARY.
           MOVE "MCFPJOBLOG"             TO  CCRTFILE-FILE.
           MOVE "0133"                   TO  CCRTFILE-RECORD-LENGTH.
           MOVE "01000"                  TO  CCRTFILE-NO-RECORDS.
           MOVE "01000"                  TO  CCRTFILE-INCREMENT-AMT.
           MOVE 10                       TO  CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 RET-STAT.
           IF RET-STAT NOT = "00"
               DISPLAY "CREATE OF MCFPJOBLOG FAILED"
               GO TO 6990-MAIN-X.

           MOVE SPACES                   TO  COMMAND.
           STRING "CPYSPLF FILE(QPJOBLOG) TOFILE(QTEMP/MCFPJOBLOG)",
             " SPLNBR(*LAST)" DELIMITED BY SIZE INTO COMMAND.
           PERFORM 9999-COMMAND.

           MOVE "DLTSPLF FILE(QPJOBLOG) SPLNBR(*LAST)" TO COMMAND.
           PERFORM 9999-COMMAND.

           OPEN INPUT QPJOBLOG-FILE.
           MOVE "N"                      TO  END-OF-FILE.
           MOVE ZERO                     TO  FOUND-POS.
           READ QPJOBLOG-FILE AT END MOVE "Y" TO END-OF-FILE.
           PERFORM UNTIL END-OF-FILE = "Y" OR FOUND-POS > ZERO
               MOVE "IS BEING USED BY JOB" TO CFLIT-SEARCH-STRING
               MOVE QPJOBLOG-REC         TO  CFLIT-STRING-TO-SEARCH
               CALL "CFLIT" USING FOUND-POS, CFLIT-SEARCH-STRING,
                 CFLIT-STRING-TO-SEARCH
               IF FOUND-POS = 0
                   READ QPJOBLOG-FILE AT END
                       MOVE "Y"          TO  END-OF-FILE
                   END-READ
               END-IF
           END-PERFORM.
           IF FOUND-POS < 1
               MOVE "NO LCK FND"         TO  JOB-NAME
           ELSE
               UNSTRING QPJOBLOG-REC DELIMITED BY "used by job "
                 OR "." INTO WORK-1, JOB-SPEC
               END-UNSTRING
               UNSTRING JOB-SPEC DELIMITED BY "/"
                 INTO JOB-NUMBER, JOB-USER, JOB-NAME.

       6990-MAIN-X.
           CLOSE QPJOBLOG-FILE.
           GOBACK.

       9999-COMMAND.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

