000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          CINVEDIT.
000400 AUTHOR.              C HILLES.
000500 DATE-WRITTEN.        6/1/89.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*
001100*    STOREOOM INVENTORY PROGRAMS EDIT SUBPROGRAM.
      *C***********************************************************
      *C   05/03/94                                               *
      *C      REMOVED ALL REFERENCES TO PORTABILITY COPYLIB       *
      *C      MEMBERS.                              W.L.M.        *
      *C
      *C   06/12/96      JEFF BUNGO
      *C      EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C      RECOMPILE PROGRAM TO PICK UP NEW FILE FORMATS.
      *C***********************************************************
001200 ENVIRONMENT DIVISION.
001300 CONFIGURATION SECTION.
001400 SOURCE-COMPUTER.  HP-3000.
001500 OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MSTORERM-CD-I
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DRCVITEM-CD-I
               ASSIGN TO DATABASE-MCFLCS1202
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DWLITEM-CD-I
               ASSIGN TO DATABASE-MCFLCS1502
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

001600 DATA DIVISION.
       FILE SECTION.
       FD  MSTORERM-CD-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-CD-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  DRCVITEM-CD-I
           LABEL RECORDS ARE STANDARD.
       01  DRCVITEM-CD-REC-I.
           COPY DDS-MCRPCS1200  OF MCFLCS1202.

       FD  DWLITEM-CD-I
           LABEL RECORDS ARE STANDARD.
       01  DWLITEM-CD-REC-I.
           COPY DDS-MCRPCS1500  OF MCFLCS1502.

001700 WORKING-STORAGE SECTION.
001800 01  HANDLE-BLOWUP-FLAG            PIC X(1)  VALUE "N".
001800 01  ALL-ITEMS                     PIC XX    VALUE "@;".
001900 01  PO-WORK.
002000     05  FILLER       PIC X(1).
002100     05  PO-STRIPPED  PIC X(13).
002200
002300*************************************************************
002400**                                                          **
002500**          C O M M U N I C A T I O N S   A R E A S         **
002600**                                                          **
002700**************************************************************
002800
002900 COPY CATREAD    IN COPYLIB.
003000
003100**************************************************************
003200**                                                          **
003300**           D A T A B A S E   W O R K                      **
003400**                                                          **
003500**************************************************************
003600
003700 COPY FILESTAT   IN COPYLIB.
004000
004100 COPY DBMODES    IN COPYLIB.
004500 01  CODE-SEARCH                   PIC X(16) VALUE "CORP-CODE;".
004600 01  DSET-NAME                     PIC X(16) VALUE SPACES.
004600 01  DSET-MSTORERM                 PIC X(16) VALUE "MSTORERM;".
004700 01  DSET-DRCVITEM                 PIC X(16) VALUE "DRCVITEM;".
004800 01  DSET-DWLITEM                  PIC X(16) VALUE "DWLITEM;".
004900
005000**************************************************************
005100**                                                          **
005200**           D A T A B A S E   B U F F E R S                **
005300**                                                          **
005400**************************************************************
005500
005600 COPY MSTORERM   IN COPYLIB.
005700 COPY DRCVITEM   IN COPYLIB.
005800 COPY DWLITEM    IN COPYLIB.
005900
006000**************************************************************
006100**                                                          **
006200**            L I N K A G E   S E C T I O N                 **
006300**                                                          **
006400**************************************************************
006500
006600 LINKAGE SECTION.
006700
006800 01  BASE                          PIC X(10).
006900 COPY DBSTAT   IN COPYLIB.
007100 01  CODE-ARG                      PIC X(7).
       01  MESSAGE-BUFFER.
           05  MSG-TEXT.
               10  MESSAGE-BUFFER-1        PIC X(1).
               10  FILLER                  PIC X(63).
           05  MSG-FLD                     PIC X(14).
           05  MSG-FLD-9 REDEFINES MSG-FLD PIC Z(13)9.
007300
007400 01  BU-DISPLAY-MSG.
007400     05  BU-MSG-AREA               PIC X(60).
007500
007600 PROCEDURE DIVISION USING          BASE,
007700                                   STATUS-AREA,
007900                                   CODE-ARG,
008000                                   MESSAGE-BUFFER
008100                                   BU-DISPLAY-MSG.
008200 6000-MAIN.
008300     MOVE SPACES TO MESSAGE-BUFFER-1.
           PERFORM 9999-OPEN-STUFF.
008400
008500*------ VERIFY THAT THE CODE TO BE FROZEN ACTUALLY EXISTS
008600     PERFORM 9999-GETKEY-MSTORERM-CD-I.
008700     IF NO-ENTRY
008800*        "S9: STORES CODE DOES NOT EXIST"
008900         MOVE 19009                TO  CATREAD-MSG-NUMBER
009000         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
009100         GO TO 6990-MAIN-X
009200     ELSE
009300     IF NOT GOOD-CALL
009400         MOVE "CINVEDIT READ ERR MSTORERM" TO BU-DISPLAY-MSG
009500         GO TO 6990-MAIN-X.
009600
009700*------ DUDE, YOU CAN'T FREEZE THE CODE IF IT'S ALREADY FROZEN!
009800     IF STR-STATE = "F"
009900*        "C114: CODE ALREADY FROZEN"
010000         MOVE 03114                TO  CATREAD-MSG-NUMBER
010100         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
010200         GO TO 6990-MAIN-X.
010300
010400*------ YOU CAN'T FREEZE THE CODE IF ITS ON THE DOCK.
010500     PERFORM 9999-CHAINHD-DRCVITEM-CD-I.
010600     IF NOT GOOD-CALL
010700         MOVE "CINVEDIT START ERR DRCVITEM" TO BU-DISPLAY-MSG
010800         GO TO 6990-MAIN-X.
010900
011000     PERFORM UNTIL (NOT GOOD-CALL) OR MESSAGE-BUFFER-1 > " "
011100         PERFORM 9999-GETNEXT-DRCVITEM-CD-I
011200         IF GOOD-CALL AND RCV-QTY-DLVR > RCV-QTY-STORED
011300*            "I37: ITEM HAS RECEIVERS ON DOCK"
011400             MOVE 09037            TO  CATREAD-MSG-NUMBER
011500             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
011600             MOVE RCV-PO-RCV-NO TO PO-WORK
011700             MOVE PO-STRIPPED TO MSG-FLD
011800         END-IF
011900     END-PERFORM.
012000
012100*------ YOU CAN'T FREEZE THE CODE IF ITS ON A STOREROOM WORKSHEET
012200     PERFORM 9999-CHAINHD-DWLITEM-CD-I.
012300     IF NOT GOOD-CALL
012400         MOVE "CINVEDIT START ERR DWLITEM" TO BU-DISPLAY-MSG
012500         GO TO 6990-MAIN-X.
012600
012700     PERFORM UNTIL (NOT GOOD-CALL) OR MESSAGE-BUFFER-1 > " "
012800         PERFORM 9999-GETNEXT-DWLITEM-CD-I
012900         IF GOOD-CALL
013000*            "C148: CANNOT FREEZE; CODE IS ON WORKSHEET"
013100             MOVE 03148            TO  CATREAD-MSG-NUMBER
013200             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
013300         END-IF
013400     END-PERFORM.
013500
013600 6990-MAIN-X.
           PERFORM 9999-CLOSE-STUFF.
013700     GOBACK.
013800
013900 2100-BLOWUP.
014000
       9999-OPEN-STUFF.
      *COPY OPMSTCDI IN COPY DBCS.
           OPEN INPUT MSTORERM-CD-I.
      *COPY OPDWLCDI IN COPY DBCS.
           OPEN INPUT DWLITEM-CD-I.
      *COPY OPDRCCDI IN COPY DBCS.
           OPEN INPUT DRCVITEM-CD-I.

       9999-CLOSE-STUFF.
      *COPY CLMSTCDI IN COPY DBCS.
           CLOSE MSTORERM-CD-I.
      *COPY CLDWLCDI IN COPY DBCS.
           CLOSE DWLITEM-CD-I.
      *COPY CLDRCCDI IN COPY DBCS.
           CLOSE DRCVITEM-CD-I.
014000
       999-CATREAD.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
           IF MESSAGE-BUFFER-1  = SPACES
               MOVE "* ERROR ON THIS FIELD *" TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.

014200*COPY GKMSTCDI IN COPY DBCS.
       9999-GETKEY-MSTORERM-CD-I.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-CD-REC-I.
           READ MSTORERM-CD-I INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MSTORERM-CD-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

014300*COPY CHDWLCDI IN COPY DBCS.
       9999-CHAINHD-DWLITEM-CD-I.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DWLITEM-CD-REC-I.
           START DWLITEM-CD-I KEY = CORPCDE OF DWLITEM-CD-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DWLITEM-CD-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

014400*COPY GNDWLCDI IN COPY DBCS.
       9999-GETNEXT-DWLITEM-CD-I.
           MOVE 0 TO COND-WORD.
           READ DWLITEM-CD-I NEXT INTO BUF-DWLITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DWLITEM-CD-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF CORPCDE OF DWLITEM-CD-REC-I NOT = CODE-ARG
               MOVE 15 TO COND-WORD.

014500*COPY CHDRCCDI IN COPY DBCS.
       9999-CHAINHD-DRCVITEM-CD-I.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DRCVITEM-CD-REC-I.
           START DRCVITEM-CD-I KEY = CORPCDE OF DRCVITEM-CD-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DRCVITEM-CD-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

014600*COPY GNDRCCDI IN COPY DBCS.
       9999-GETNEXT-DRCVITEM-CD-I.
           MOVE 0 TO COND-WORD.
           READ DRCVITEM-CD-I NEXT INTO BUF-DRCVITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DRCVITEM-CD-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF CORPCDE OF DRCVITEM-CD-REC-I NOT = CODE-ARG
               MOVE 15 TO COND-WORD.

