       IDENTIFICATION DIVISION.
       PROGRAM-ID.          CIRPRNT.
       AUTHOR.              C HILLES.
       DATE-WRITTEN.        8/28/90.
       DATE-COMPILED.
      *INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
      *SECURITY.
      *REMARKS.
      *
      *    SUBPROGRAM TO PRINT SINGLE ISSUES, OR ISSUES FROM THE
      *    MULTIPLE STOREROOM ISSUE PROGRAM (SW6).  ALSO PRINTS
      *    RETURNS.  BROKE THIS LOGIC OUT AS A SUBPROGRAM SINCE THE
      *    NEW MULTIPLE ISSUE PROGRAM SW6 WOULD USE THE SAME PRINT
      *    LOGIC AS SW1/ST1.

      *C  06/13/96   JEFF BUNGO
      *C   REMOVED COMPRESSED PRINTING FROM THE HEADING FOR
      *C   EXP CLASS (CHG ACCT/NW#) AND DATE/TIME.
      *C
      *C  05/02/97   JEFF BUNGO
      *C   ADDED FOUR BYTES TO THE BIN LINE IN THE LINKAGE SECTION
      *C   TO ACCOUNT FOR THE FRANCHISE ID BEING PASSED IN FOR
      *C   FRANCHISE PARTS.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  HP-3000.
       OBJECT-COMPUTER.  HP-3000.
       COPY SPECIALN IN COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.
       DATA DIVISION.
       FILE SECTION.
       FD  PRINT-FILE
           RECORD CONTAINS 132 CHARACTERS.
       01  PRINT-REC                     PIC X(132).
       WORKING-STORAGE SECTION.
       01  SUB                           PIC 9(1).
       01  LINE-ADV                      PIC 9(1).
       COPY OVRPFDAT IN COPYLIB.
       COPY SPOOLER  IN COPYLIB.

       01  PRINT-HEADINGS.
           05  PRT-HDR1.
               10  FILLER                PIC X(08) VALUE SPACES.
               10  FILLER      PIC X(20) VALUE "S T O R E R O O M   ".
               10  PRT-TITLE             PIC X(19).
               10  FILLER                PIC X(3)  VALUE SPACES.
               10  FILLER                PIC X(6)  VALUE "DATE: ".
               10  PRT-DATE              PIC X(8)  VALUE SPACES.
               10  FILLER                PIC XX    VALUE SPACES.
               10  FILLER                PIC X(6)  VALUE "TIME: ".
               10  PRT-TIME              PIC X(8).
           05  PRT-HDR2.
               10  FILLER                PIC X(29)  VALUE SPACES.
               10  FILLER                PIC X(6)   VALUE "REQ.  ".
               10  PRT-C-HD              PIC X(6).
               10  FILLER                PIC X(2)  VALUE SPACES.
               10  FILLER                PIC X(08)  VALUE "EXP. CLS".
               10  FILLER                PIC X(10)  VALUE "  QUANTITY".
               10  FILLER                PIC X(18)  VALUE SPACES.
           05  PRT-HDR3.
               10  FILLER                PIC X(9)   VALUE "CORP CODE".
               10  FILLER                PIC X(2)   VALUE SPACES.
               10  FILLER                PIC X(6)   VALUE "EMPL  ".
               10  FILLER                PIC X(9)   VALUE "WORKORDER".
               10  FILLER                PIC X(3)   VALUE SPACES.
               10  FILLER    PIC X(13)  VALUE "DEPT  DEPT   ".
               10  FILLER    PIC X(10)  VALUE "(ACCT/NW#)".
               10  FILLER                PIC X(2)   VALUE SPACES.
               10  PRT-Q-HD              PIC X(8)   VALUE "ISSUED  ".
               10  FILLER                PIC X(6)   VALUE "  UM  ".
               10  FILLER                PIC X(8)   VALUE "LOCATION".
               10  FILLER                PIC X(2)   VALUE SPACES.
               10  CNTR-HD               PIC X(4)   VALUE SPACES.
           05  PRT-DETAIL.
               10  FILLER                PIC X      VALUE SPACES.
               10  PRT-CODE              PIC X(7)   VALUE SPACES.
               10  FILLER                PIC X(3)   VALUE SPACES.
               10  PRT-EMPL              PIC X(4)   VALUE SPACES.
               10  FILLER                PIC XX     VALUE SPACES.
               10  PRT-WO                PIC X(12)  VALUE SPACES.
               10  PRT-REQ-DEPT          PIC X(4)   VALUE SPACES.
               10  FILLER                PIC XX     VALUE SPACES.
               10  PRT-CHARGE-1-4        PIC X(4)   VALUE SPACES.
               10  FILLER                PIC X(1)   VALUE SPACES.
               10  PRT-CHARGE-5-6        PIC X(2)   VALUE SPACES.
               10  FILLER                PIC X(3)   VALUE SPACES.
               10  PRT-EXP-CLASS         PIC X(6)   VALUE SPACES.
               10  PRT-QTY               PIC Z(9)9  VALUE ZEROS.
               10  FILLER                PIC X(3)   VALUE SPACES.
               10  PRT-UM                PIC XX     VALUE SPACES.
               10  FILLER                PIC XX     VALUE SPACES.
               10  PRT-LOC               PIC X(10)  VALUE SPACES.
               10  FILLER                PIC X(1)   VALUE SPACES.
               10  PRT-WORK-CENTER       PIC X(2)   VALUE SPACES.
           05  PRT-HDR5.
               10  FILLER   PIC X(11)  VALUE "DESCRIPTION".
               10  FILLER                PIC X(69)  VALUE SPACES.
           05  PRT-KWRD-ADJ-LINE.
               10  FILLER                PIC X(4)   VALUE SPACES.
               10  PRT-KWDADJ            PIC X(76)  VALUE SPACES.
           05  PRT-DESC-LINE.
               10  FILLER                PIC X(4)   VALUE SPACES.
               10  PRT-DESC              PIC X(76)  VALUE SPACES.
           05  PRT-SIG-LINE.
               10  FILLER      PIC X(15) VALUE "WITHDRAWN BY - ".
               10  PRT-EMP               PIC X(4)  VALUE SPACES.
               10  FILLER      PIC X(21) VALUE " ____________________".
           05  PRT-DISB-INSTR.
               10  FILLER PIC X(28) VALUE "DISBURSEMENT INSTRUCTION - ".
               10  PRT-DISB              PIC X(30) VALUE SPACES.

       LINKAGE SECTION.
       01  SCOM-PGM-KEY.
           05  FILLER                    PIC X(1).
           05  SCOM-PGM-KEY-2            PIC X(1).
           05  FILLER                    PIC X(1).
       COPY MULTSTR  IN COPYLIB.
       COPY TSHWSUB  IN COPYLIB.
       01  DE-CHARGE-DATA.
           05  DE-EMPL                   PIC X(4).
           05  DE-WO                     PIC X(10).
           05  DE-REQ-DEPT               PIC X(4).
           05  DE-CHARGE-DEPT.
               10  DE-CHARGE-DEPT-1-4    PIC X(4).
               10  DE-CHARGE-DEPT-5-6    PIC X(2).
           05  DE-EXP-CLASS              PIC X(6).
           05  DE-WORK-CENTER            PIC X(2).
       COPY MSTORERM IN COPYLIB.
       01  BIN-AREA.
           05  BIN-LINE OCCURS 6 TIMES.
               10  FILLER                PIC X(4).
               10  V-LOC                 PIC X(12).
               10    FILLER              PIC X(8).
               10  DE-QTY                PIC 9(8).
       01  DESC-1                        PIC X(80).
       01  DESC-2                        PIC X(80).
       COPY ESCSUB   IN COPYLIB.
       COPY TDATESUB IN COPYLIB.

       PROCEDURE DIVISION USING SCOM-PGM-KEY, MULTIPLE-STR-DATA,
           SRF-COMAREA, SRF-SPOOLER-REC, DE-CHARGE-DATA, BUF-MSTORERM,
           BIN-AREA, DESC-1, DESC-2, ESC-NAME, DATE-CHECK-AREA.

       6000-MAIN.
           MOVE SRF-SPOOL-PRT-NO         TO  SPOOL-PRT
                                             OVRPRTF-TOFILE-NUM.

           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT PRINT-FILE.

           MOVE SPACES                   TO  PRINT-REC.
           MOVE DATE-SLASH-OUT           TO  PRT-DATE.
           MOVE DATE-FORMATTED-TIME-OUT  TO  PRT-TIME.

           IF SCOM-PGM-KEY-2 = "W"
               MOVE "W I T H D R A W A L"     TO  PRT-TITLE
               MOVE "CHARGE"             TO  PRT-C-HD
               MOVE "ISSUED"             TO  PRT-Q-HD
           ELSE
               MOVE "R E T U R N"        TO  PRT-TITLE
               MOVE "CREDIT"             TO  PRT-C-HD
               MOVE "RETURNED"           TO  PRT-Q-HD.

           IF AKRON-PLANT
               MOVE "CNTR"               TO  CNTR-HD.

           WRITE PRINT-REC FROM PRT-HDR1 AFTER ADVANCING 1.
           WRITE PRINT-REC FROM PRT-HDR2 AFTER ADVANCING 2.
           WRITE PRINT-REC FROM PRT-HDR3 AFTER ADVANCING 1.

           MOVE CORP-CODE                TO  PRT-CODE.
           MOVE DE-EMPL                  TO  PRT-EMPL.
           MOVE DE-WO                    TO  PRT-WO.
           MOVE DE-REQ-DEPT              TO  PRT-REQ-DEPT.
           MOVE DE-CHARGE-DEPT-1-4       TO  PRT-CHARGE-1-4.
           MOVE DE-CHARGE-DEPT-5-6       TO  PRT-CHARGE-5-6.
           MOVE DE-EXP-CLASS             TO  PRT-EXP-CLASS.
           MOVE DE-WORK-CENTER           TO  PRT-WORK-CENTER.
           MOVE STR-UM                   TO  PRT-UM.

           MOVE 0                        TO  SUB.
           MOVE 2                        TO  LINE-ADV.
       651-PRINT-LOOP.
           ADD 1                         TO  SUB.
           IF SUB > 6
               GO TO 652-FINISH-PRINT.
           MOVE STR-LOC (SUB)            TO  PRT-LOC.
           IF DE-QTY (SUB) > 0
               MOVE DE-QTY (SUB)         TO  PRT-QTY
               WRITE PRINT-REC FROM PRT-DETAIL AFTER ADVANCING LINE-ADV
               MOVE SPACES TO PRT-CODE, PRT-EMPL, PRT-WO, PRT-REQ-DEPT,
                              PRT-CHARGE-1-4, PRT-CHARGE-5-6,
                              PRT-EXP-CLASS
               MOVE 1                    TO  LINE-ADV.

           GO TO 651-PRINT-LOOP.

       652-FINISH-PRINT.
           MOVE DESC-1                   TO  PRT-KWDADJ.
           MOVE DESC-2                   TO  PRT-DESC.
           MOVE STR-DISB-INSTR           TO  PRT-DISB.
           MOVE DE-EMPL                  TO  PRT-EMP.
           WRITE PRINT-REC FROM PRT-HDR5 AFTER ADVANCING 2.

           WRITE PRINT-REC FROM PRT-KWRD-ADJ-LINE AFTER ADVANCING 1.
           WRITE PRINT-REC FROM PRT-DESC-LINE AFTER ADVANCING 1.
           IF SCOM-PGM-KEY-2 = "W"
               WRITE PRINT-REC FROM PRT-SIG-LINE AFTER ADVANCING 2.
           IF PRT-DISB > SPACES
               WRITE PRINT-REC FROM PRT-DISB-INSTR AFTER ADVANCING 2.

           IF ADV-AFTER-SINGLE NOT NUMERIC
               MOVE 0                    TO  ADV-AFTER-SINGLE.
           MOVE SPACES                   TO  PRINT-REC.
           PERFORM ADV-AFTER-SINGLE TIMES
               WRITE PRINT-REC AFTER ADVANCING NEW-PAGE
           END-PERFORM.

           CLOSE PRINT-FILE.

       6990-MAIN-X.
           GOBACK.

       COPY OVRPFCAL IN COPYLIB.
