000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          CISITRAW.
000400 AUTHOR.              ABID H. K.
000500 DATE-WRITTEN.        26 JULY 1990
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*    THIS SUBROUTINE TAKES MSTOREM BUFFER & RETURNS WHETHER
001100*    THE CORPORATE CODE IS A RAW MATERIAL OR NOT
      *C
      *C   07MAY1996     DAVE PLUM     REQUEST #6598
      *C    ADDED COMPANY CODE TO THE SET OF PARAMETERS BEING
      *C    RECEIVED FROM THE CALLING PROGRAM.  REVISED THE
      *C    MAIN PROGRAM LOGIC TO UTILIZE THE COMPANY-CODE TO
      *C    DETERMINE WHETHER OR NOT A MATERIAL IS A RAW
      *C    MATERIAL.
      *C       - ADDED "PLANT SPECIFIC" LOGIC FOR: NORTH AMERICA
      *C                                           INDIA
      *C       - FOR ALL OTHER PLANTS, THIS PROGRAM WILL TREAT
      *C         ALL MATERIAL AS NON-RAW MATERIAL FOR NOW.
      *C
      *C   12APR1997     DAVE PLUM
      *C    RECOMPILED TO PICK REVISED "PLANTS" COPYLIB MEMBER.
      *C
      *C   19DEC1997     DAVE PLUM
      *C    RECOMPILED TO PICK REVISED "PLANTS" COPYLIB MEMBER.
      *C
001400 ENVIRONMENT DIVISION.
001500 CONFIGURATION SECTION.
001600 SOURCE-COMPUTER.  HP-3000.
001700 OBJECT-COMPUTER.  HP-3000.
001800 SPECIAL-NAMES.
001900
002000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
002100
002200 DATA DIVISION.
002600 WORKING-STORAGE SECTION.
002700
       COPY PLANTS IN COPYLIB.

002800 01  WS-STR-CLASS            PIC X(3).
002900     88 NA-RAW-MATERIAL      VALUES "100" THRU "199",
003000                                    "400" THRU "499".
           88 INDIA-RAW-MATERIAL   VALUES "001" THRU "058",
                                          "191" THRU "199",
                                          "601" THRU "699".
003100
003200 LINKAGE SECTION.
003300
003400 01  CIR-PARMS.
003500     05  RET-CODE            PIC X(1).

003600 COPY MSTORERM IN COPYLIB.
003700
       01  COMPANY-CODE            PIC X(3).

      *--- 07MAY1996 ADDED COMPANY-CODE TO THE SET OF
      *---  PARAMETERS PASSED TO THIS SUBROUTINE.
003800 PROCEDURE DIVISION USING CIR-PARMS, BUF-MSTORERM,
                                COMPANY-CODE.
003900 1-HOUSEKEEP SECTION.
       1-HSK.
           MOVE "N"                TO RET-CODE.
           MOVE COMPANY-CODE       TO WHICH-PLANT.
004100     MOVE STR-CLASS          TO WS-STR-CLASS.

      *------ NORTH AMERICA
           IF NA-PLANT AND NA-RAW-MATERIAL
               MOVE "Y"            TO RET-CODE.

      *------ INDIA
           IF INDIA AND INDIA-RAW-MATERIAL
               MOVE "Y"            TO RET-CODE.

004600     GOBACK.
