001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.          CLSHIFTX.
001300 AUTHOR.              BARBARA WINTER.
001400 DATE-WRITTEN.        1/25/86.
001500 DATE-COMPILED.
001600*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
001700*SECURITY.
001710*REMARKS.
001800*D         THIS SUBPROGRAM LEFT SHIFTS ANY FIELD UP
001900*D         TO 50 BYTES LONG.
002000
002100 ENVIRONMENT DIVISION.
002200 CONFIGURATION SECTION.
002300 SOURCE-COMPUTER.  HP-3000.
002400 OBJECT-COMPUTER.  HP-3000.
002500
002600 DATA DIVISION.
002700 WORKING-STORAGE SECTION.
002800
002900 77  SUB2                 PIC 9(2)  VALUE ZERO.
003000 77  SUB3                 PIC 9(2)  VALUE ZERO.
003100
003200 LINKAGE SECTION.
003300 01  RET-CODE             PIC X(2).
003400
003500 01  SHIFT-QTY-FLD.
003600     05  S-Q-BYTE OCCURS 50 TIMES PIC X.
003700
003800 PROCEDURE DIVISION USING RET-CODE, SHIFT-QTY-FLD.
003900
004000 6-MAIN.
004100 61-EXAMINE.
004200     INSPECT SHIFT-QTY-FLD REPLACING LEADING "0" BY " ".
004300 643-LEFT-SHIFT.
004400     MOVE +1  TO  SUB2, SUB3.
004500     IF S-Q-BYTE (SUB2) NOT = SPACES
004600         GO TO 643-L-S-E.
004700 643-L-S-FIRST.
004800     IF S-Q-BYTE (SUB2) NOT = SPACES
004900         GO TO 643-L-S-MOVE.
005000     IF SUB2 = 50
005100         GO TO 643-L-S-E.
005200     ADD 1  TO  SUB2.
005300     GO TO 643-L-S-FIRST.
005400 643-L-S-MOVE.
005500*    IF S-Q-BYTE (SUB2) = SPACES
005600*        GO TO 643-L-S-E.
005700     MOVE S-Q-BYTE (SUB2)  TO  S-Q-BYTE (SUB3).
005800     MOVE SPACE  TO  S-Q-BYTE (SUB2).
005900     IF SUB2 = 50
006000         GO TO 643-L-S-E.
006100     ADD  1  TO  SUB2, SUB3.
006200     GO TO 643-L-S-MOVE.
006300 643-L-S-E.
006400     EXIT.
006500
006600 6-MAIN-X.
006700     GOBACK.
