       IDENTIFICATION DIVISION.
       PROGRAM-ID.          CMFRCDES.
       AUTHOR.              JEFF BUNGO.
       DATE-WRITTEN.        10/01/97.
       DATE-COMPILED.
      *INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
       SECURITY.
      *REMARKS.   THIS PROGRAM IS USED TO CALL CDESC AND GET THE CODE
      *           DESCRIPTION, BUT THE KEY PARAMETER TO THIS PROGRAM
      *           IS THE MANUFACTURER AND PART NUMBER.  THE CORPORATE
      *           CODE IS FOUND FOR THE MFR/PART AND THEN CDESC IS
      *           CALLED.  FOR DUPLICATE CODES ONLY THE FIRST CORPORATE
      *           CODE FOUND IS RETURNED.
      *
      *           THIS PROGRAM WAS WRITTEN AS AN INTERFACE PROGRAM IN
      *           DES MOINES, WHERE AN EXTERNAL APPLICATION NEEDED
      *           CODE DESCRIPTION AND ONLY HAD THE GBS MATERIAL NUMBER
      *           OR GOODYEAR PRODUCT NUMBER (WHICH ARE MFR/PART IN
      *           THE CSIS CODE).
      *
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  HP-3000.
       OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DMANPART
                  ASSIGN TO DATABASE-MCFLCS3601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  DMANPART
           LABEL RECORDS ARE STANDARD.
       01  DMANPART-REC.
           COPY DDS-MCRPCS3600  OF MCFLCS3601.

       WORKING-STORAGE SECTION.

       01  BASE                       PIC X(10).

       01  FILE-STATUS                PIC X(2).
       01  STATUS-AREA.
           05  COND-WORD              PIC S9(4) COMP-4 VALUE 0.
           05  DATA-LENG              PIC S9(4) COMP-4 VALUE 0.
           05  RCD-NO                 PIC S9(9) COMP-4 VALUE 0.
           05  CHAIN-LENG             PIC S9(9) COMP-4 VALUE 0.
           05  BKWD-ADDR              PIC S9(9) COMP-4 VALUE 0.
           05  FWRD-ADDR              PIC S9(9) COMP-4 VALUE 0.

       01  BU-DISPLAY-MSG.
           05 BU-DISPLAY-MSG-1         PIC X(1).
           05 FILLER                   PIC X(59).

       COPY DMANPART IN COPYLIB.

       LINKAGE SECTION.
       01  MFR                         PIC X(26).
       01  MFR-PART                    PIC X(20).
       01  CORP-CODE                   PIC X(8).
      *---------- CDESC-OPTIONS
      *   CDESC-LINES-TO-GET       PASS MAX NUMBER OF LINES YOU WISH
      *                            RETURNED
      *
      *   CDESC-LINES-GOT          RETURNS ACUTAL NUMBER OF LINES GOT
      *
      *   CDESC-LANGUAGE-OPITON    P  -  PRIMARY LANGUAGE
      *                            S  -  SECONDARY LANGUAGE
      *
      *   CDESC-DESC-OPTION        F  -  FULL DESC (KEYWORD, MAN, DDESC)
      *                            D  -  JUST DDESC OR DDESC2 WITH KWM
      *                            M  -  JUST MANUFACTURERS
      *                            K  -  JUST KEYWORD/ADJECTIVE
      *
      *  CDESC-MANUFACT-OPTION     S  -  RETURN ONLY THE SELECTED
      *                                  MANUFACTURERS
      *                            A  -  RETURN ALL MANUFACTURERS
      *  CDESC-LOCAL-OPTION        R  -  LOCAL DESC REQUIRED AS PART OF
      *                                  DESC
      *                            N  -  LOCAL DESC NOT REQUIRED
      *
       01  CDESC-RET-CODE                PIC X(2).
       01  CDESC-DATA.
           05  CDESC-LINES-TO-GET        PIC S9(4) BINARY.
           05  CDESC-LINES-GOT           PIC S9(4) BINARY.
           05  CDESC-LANGUAGE-OPTION     PIC X(1).
           05  CDESC-DESC-OPTION         PIC X(1).
           05  CDESC-MANUFACT-OPTION     PIC X(1).
           05  CDESC-LOCAL-DESC-OPTION   PIC X(1).
           05  CDESC-PAD                 PIC X(10).
           05  CDESC-SPACE-AREA          PIC X(2050).
           05  CDESC-AREA REDEFINES CDESC-SPACE-AREA.
               10  CDESC-LINE OCCURS 25 TIMES.
                   15  CDESC-TYPE        PIC X(1).
                   15  CDESC-MANUFACT-SELCT PIC X(1).
                   15  CDESC             PIC X(80).
      *---------- CDESC-TYPE = "K"
                   15  CDESC-KWM-DATA REDEFINES CDESC.
                       20 CDESC-KWM.
                          25 CDESC-KEYWORD        PIC X(19).
                          25   FILLER    PIC X(1).
                          25 CDESC-MODIFIER       PIC X(30).
                       20 FILLER         PIC X(30).
      *---------- CDESC-TYPE = "M"
                   15  CDESC-MFR-DATA REDEFINES CDESC.
                       20 CDESC-MFR-NAME PIC X(26).
                       20   FILLER       PIC X(1).
                       20 CDESC-MFR-TYPE PIC X(3).
                       20   FILLER       PIC X(1).
                       20 CDESC-MFR-PART PIC X(20).
                       20   FILLER       PIC X(29).

       PROCEDURE DIVISION USING MFR MFR-PART CORP-CODE CDESC-RET-CODE
                                                 CDESC-DATA.

       6000-MAIN.
            OPEN INPUT DMANPART.

            MOVE MFR TO MANUFACT OF DMANPART-REC.
            MOVE MFR-PART TO MANPARTNO OF DMANPART-REC.
            READ DMANPART INTO BUF-DMANPART
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

            IF FILE-STATUS = "00"
                MOVE MAN-CORPCODE TO CORP-CODE
                IF CDESC-LINES-TO-GET > 0
                    CALL "CDESC" USING CDESC-RET-CODE BASE STATUS-AREA
                      BU-DISPLAY-MSG, CORP-CODE, CDESC-DATA
                    IF BU-DISPLAY-MSG-1 NOT = SPACES
                        MOVE "ER" TO CDESC-RET-CODE
                    END-IF
                ELSE
                    MOVE "00" TO CDESC-RET-CODE
                END-IF
            ELSE
                MOVE "NF" TO CDESC-RET-CODE.

       6990-MAIN-X.
           CLOSE DMANPART.
           GOBACK.

