       IDENTIFICATION DIVISION.

       PROGRAM-ID.     CMPLTINFO.
       AUTHOR.         EXLTECH, LLC - DAN RAUCH
      *****************************************************************
      **                     C M P L T I N F O
      *****************************************************************
      ** AVOID DEFINING, OPENING, READING AND CLOSING MPLTINFO FILE.
      ** PASS THIS SUBROUTINE A MPLTINFO KEY AND IT WILL PASS BACK THE
      ** RESPECTIVE PLTINFODTA FIELD AND READK FILE STATUS.
      **                    -------------------
      ** SEE COBOL PROGRAM TARIBAPO FOR EXAMPLE OF "HOW TO" CODE
      ** USE COPY MBRS "ZMPLTSUBR" AND "ZMPLTWS" WHEN CALLING THIS PGM.
      *****************************************************************

      *****************************************************************
      **            M O D I F I C A T I O N    H I S T O R Y
      *****************************************************************

      ***------------------------------------------------------------***
      *   JUNE  27 2003      DAN RAUCH
      *   INITIAL AUTHOR   XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX  'G
      *   XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX  'G
      ***------------------------------------------------------------***
      *   MONTH DD CCYY      XXXXXXXXXX
      *   XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX  'G
      ***------------------------------------------------------------***
                                                                       *
      *================================================================
       ENVIRONMENT DIVISION.
      *===============================================================
       CONFIGURATION SECTION.

       SOURCE-COMPUTER.       IBM-AS400.
       OBJECT-COMPUTER.       IBM-AS400.
       SPECIAL-NAMES.         LOCAL-DATA IS LDA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT MPLTINFO-FILE   ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

      *================================================================
       DATA DIVISION.
      *================================================================
       FILE SECTION.

       FD  MPLTINFO-FILE.
       01  MPLTINFO-REC.
       COPY DDS-ALL-FORMATS OF MCFLCS0501.

      *----------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *----------------------------------------------------------------
       COPY FILESTATUS  OF COPYLIB.

      *============================================================
      *=             L I N K A G E    S E C T I O N
      *============================================================
       LINKAGE SECTION.
       01  LS-PLTINFOKEY         PIC X(04).
       01  LS-PLTINFODTA         PIC X(60).
       01  LS-STATUS             PIC X(02).

      *================================================================
      *===        P R O C E D U R E    D I V I S I O N              ===
      *================================================================
       PROCEDURE DIVISION USING LS-PLTINFOKEY LS-PLTINFODTA LS-STATUS.
       0000-PROGRAM-ENTRY.

           OPEN  INPUT  MPLTINFO-FILE.

           PERFORM 1000-MAIN-LOGIC    THRU 1000-EXIT.

           CLOSE        MPLTINFO-FILE.

       0000-PROGRAM-END.
           GOBACK.

      *****************************************************************
      ***  MAIN PROGRAM LOGIC AREA
      *****************************************************************
       1000-MAIN-LOGIC.

           PERFORM 9000-READK-MPLTINFO      THRU 9000-READK-EXIT.
           MOVE PLTINFODTA       TO LS-PLTINFODTA.
           MOVE WS-FILE-STATUS   TO LS-STATUS.

       1000-EXIT.
            EXIT.

      *****************************************************************
      ***  READ BY KEY MPLTINFO FILE
      *****************************************************************
       9000-READK-MPLTINFO.

           INITIALIZE MPLTINFO-REC.
           MOVE  LS-PLTINFOKEY    TO PLTINFOKEY.

           READ MPLTINFO-FILE
           END-READ.

           IF  FS-RECORD-NOT-FOUND
               MOVE SPACE       TO PLTINFODTA
           END-IF.

       9000-READK-EXIT.
           EXIT.
      *****************************************************************
      ***                     END OF SOURCE
      *****************************************************************
