       IDENTIFICATION DIVISION.
       PROGRAM-ID.          CNUM114.
       AUTHOR.              C HILLES.
       DATE-WRITTEN.        2/22/91.
       DATE-COMPILED.
      *INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
      *SECURITY.
      *REMARKS.
      *D   HANDLES A DATA-ENTRY 9(11)V9(4) FIELD: RIGHT SHIFTS/ZERO FILLS THE
      *D   FIRST PART, LEFT SHIFTS/FILL TRAILING ZERO THE RIGHT PART, CHECKS
      *D   FOR NUMERIC
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  HP-3000.
       OBJECT-COMPUTER.  HP-3000.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  NUMERIC-FLAG                  PIC X(1).
       01  SUB                           PIC S9(4) BINARY.
       01  SUB2                          PIC S9(4) BINARY.
       01  SUB3                          PIC S9(4) BINARY.
       01  STARTIT                       PIC S9(4) BINARY.
       01  NUM-LEN                       PIC S9(4) BINARY VALUE 11.
       01  DEC-LEN                       PIC S9(4) BINARY VALUE 4.
       COPY CATREAD IN COPYLIB.

       LINKAGE SECTION.
       01  DATA-ENTRY-FIELD.
           05  NUM-BYTE OCCURS 11 TIMES  PIC X(1).
           05  DEC-BYTE OCCURS 4 TIMES   PIC X(1).
       01  MESSAGE-BUFFER.
           05  MSG-TEXT.
               10  MESSAGE-BUFFER-1        PIC X(1).
               10  FILLER                  PIC X(63).
           05  MSG-FLD                     PIC X(14).
           05  MSG-FLD-9 REDEFINES MSG-FLD PIC Z(13)9.

       COPY LANGSUB  IN COPYLIB.
       PROCEDURE DIVISION USING DATA-ENTRY-FIELD, MESSAGE-BUFFER,
                                LANGUAGE-PARMS.
       6000-MAIN.
           MOVE "Y"                      TO  NUMERIC-FLAG.
           MOVE SPACES                   TO  MESSAGE-BUFFER-1.
           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > NUM-LEN
               IF NUM-BYTE (SUB) = " "
                   COMPUTE STARTIT = SUB - 1
                   PERFORM VARYING SUB2 FROM STARTIT BY -1
                   UNTIL SUB2 < 1
                       COMPUTE SUB3 = SUB2 + 1
                       MOVE NUM-BYTE (SUB2) TO NUM-BYTE (SUB3)
                   END-PERFORM
                   MOVE "0"              TO  NUM-BYTE (1)
               END-IF
           END-PERFORM.

      *----- AT THIS POINT MY BRAIN WAS NOT FUNCTIONING PLEASE
      *----- CHANGE THIS TO COMPREHENSIBLE STRUCTURED CODE LATER...
       643-LEFT-SHIFT.
           MOVE 1                        TO  SUB2, SUB3.
           IF DEC-BYTE (SUB2) NOT = SPACES
               GO TO 643-L-S-E.
       643-L-S-FIRST.
           IF DEC-BYTE (SUB2) NOT = SPACES
               GO TO 643-L-S-MOVE.
           IF SUB2 = DEC-LEN
               GO TO 643-L-S-E.
           ADD 1                         TO  SUB2.
           GO TO 643-L-S-FIRST.
       643-L-S-MOVE.
           IF DEC-BYTE (SUB2) = SPACES
               GO TO 643-L-S-E.
           MOVE DEC-BYTE (SUB2)          TO  DEC-BYTE (SUB3).
           MOVE SPACE                    TO  DEC-BYTE (SUB2).
           IF SUB2 = DEC-LEN
               GO TO 643-L-S-E.
           ADD  1                        TO  SUB2, SUB3.
           GO TO 643-L-S-MOVE.
       643-L-S-E.

           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > DEC-LEN
               IF DEC-BYTE (SUB) = " "
                   MOVE "0"              TO  DEC-BYTE (SUB)
               END-IF
               IF DEC-BYTE (SUB) NOT NUMERIC
                   MOVE "N"              TO  NUMERIC-FLAG
               END-IF
           END-PERFORM.

           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > NUM-LEN
               IF NUM-BYTE (SUB) = " "
                   MOVE "0"              TO  NUM-BYTE (SUB)
               END-IF
               IF NUM-BYTE (SUB) NOT NUMERIC
                   MOVE "N"              TO  NUMERIC-FLAG
               END-IF
           END-PERFORM.

           IF NUMERIC-FLAG = "N"
               MOVE "20063"              TO  CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD.

       6990-MAIN-X.
           GOBACK.

       999-CATREAD.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
           IF MESSAGE-BUFFER-1  = SPACES
               MOVE "* ERROR ON THIS FIELD *" TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.
