000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          COVRFILE.
000400 AUTHOR.              C HILLES.
000500 DATE-WRITTEN.        01/03/90.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*D   THIS IS A MACHINE-DEPENDENT SUBPROGRAM, WITH IDENTICAL
001100*D   PARAMETERS ON HP AND IBM.  THIS RETURNS A COMMAND STATMENT
001200*D   THAT OVERRIDES ONE FILE TO ANOTHER.  ON THE IBM IT RETURNS
001300*D   "OVRDBF FILE1 FILE2" WHILE ON THE HP IT RETURNS             V
001400*D   "FILE FILE1=FILE2".
002300
002400 ENVIRONMENT DIVISION.
002500 CONFIGURATION SECTION.
002600 SOURCE-COMPUTER.  HP-3000.
002700 OBJECT-COMPUTER.  HP-3000.
002800
002900 DATA DIVISION.
003000 WORKING-STORAGE SECTION.
003100 LINKAGE SECTION.
       01  COVRFILE-FROMFILE          PIC X(26).
       01  COVRFILE-TOFILE            PIC X(26).
       01  COVRFILE-COMMAND           PIC X(200).
007800
007900 PROCEDURE DIVISION USING COVRFILE-FROMFILE,
008000                          COVRFILE-TOFILE,
008100                          COVRFILE-COMMAND.
008400
008500 6000-MAIN.
           MOVE SPACES TO COVRFILE-COMMAND.
           STRING "OVRDBF " DELIMITED BY SIZE,
                  COVRFILE-FROMFILE DELIMITED BY SPACES
                  " " DELIMITED BY SIZE,
                  COVRFILE-TOFILE DELIMITED BY SPACES
             INTO COVRFILE-COMMAND.
       6990-MAIN-X.
           GOBACK.
