000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. COVRPRT.
000400 AUTHOR.     C HILLES.
000500 DATE-WRITTEN. FEBRUARY, 1990.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*
      *    THIS SUBPROGRAM IS MACHINE DEPENDENT: FOR IBM AS/400 ONLY.
001100*    OVERRIDE THE PRINT FILE TO A PASSED PRINT FILE.
001200*    IF THE PRINT FILE DOESN'T EXIST, USE DEFAULT PRINTER
001300*    FROM THE LOCAL DATA AREA.  IF THAT DOESN'T EXIST THEN
001400*    USE THE PRINT FILE 'MCPRT'.  THE OUTQ TO GO TO IS GIVEN
001500*    IN THE LOCAL DATA AREA, NOT THE PRINT FILE, SO IN THAT CASE
001600*    WE OVERRIDE THE PRINT FILE 'MCPRT' TO A SPECIFIC OUT QUEUE.
      *    ALSO, IN THE CASE OF DEFAULT PRINTER, WE DON'T KNOW IF IT
      *    IS A LINE PRINTER (CANNNOT PRINT ESC SEQUENCES) OR A
      *    CHARACTER PRINTER (CAN PRINT ESC SEQUENCES).  SO, THE
      *    LOCAL DATA AREA (SET IN THE MENU SYSTEM) PASSES US THE INFO.
      *    IN THE CASE OF OVERRIDING TO A PRINT FILE, THAT PARTICULAR
      *    PRINT FILE IS ALREADY SET UP FOR A PARTICULAR PRINTER, AND
      *    SO IT IS ALREADY SET TO REPLACE OR NOT REPLACE UNPRINTABLE
      *    CHARACTERS.
001700*
006800 ENVIRONMENT DIVISION.
006900 CONFIGURATION SECTION.
007000 SOURCE-COMPUTER.  HP-3000.
007100 OBJECT-COMPUTER.  HP-3000.
007200 SPECIAL-NAMES. LOCAL-DATA IS LOCAL-DATA-AREA.
007400
007900 DATA DIVISION.
008900 WORKING-STORAGE SECTION.
       COPY UTC9001X IN U0PRD-QLBLSRC.
       COPY CCHKOBJ  IN COPYCSIS.
009000
       01  REPLACE-UNPRINT               PIC X(4).
       01  PRINTER-WORK                  PIC X(10).

       01  PAGESIZE-WORK                 PIC X(16).
       01  PAGESIZE-PAREN                PIC X(2).
       01  OVRFLW-WORK                   PIC X(14).
       01  OVRFLW-PAREN                  PIC X(2).
       01  LPI-WORK                      PIC X(7).
       01  LPI-PAREN                     PIC X(2).

026400 LINKAGE SECTION.
       01  OVRPRTF-PARMS.
           05  OVRPRTF-FILE              PIC X(10).
           05  OVRPRTF-TOFILE.
               10  FILLER                PIC X(5).
               10  OVRPRTF-TOFILE-NUM    PIC 9(2).
               10  FILLER                PIC X(3).
           05  OVRPRTF-COPIES            PIC 9(2).
           05  OVRPRTF-SHARED            PIC X(4).
           05  OVRPRTF-PAGESIZE          PIC X(5).
           05  OVRPRTF-OVRFLW            PIC X(5).
           05  OVRPRTF-LPI               PIC X(1).
           05  OVRPRTF-SPLFNAME          PIC X(10).
           05  OVRPRTF-PARM1             PIC X(150).
           05  OVRPRTF-PARM2             PIC S9(10)V9(5) COMP-3.
031600 PROCEDURE DIVISION USING OVRPRTF-PARMS.                         ,
032000 6000-MAIN.
           IF OVRPRTF-COPIES NOT NUMERIC OR OVRPRTF-COPIES = ZERO
               MOVE 1                    TO  OVRPRTF-COPIES.

      *------ FIRST SEE IF THE PRINT FILE TO OVERRIDE TO EXISTS.
      *------ IF SO, OVERRIDE TO THAT PRINT FILE.  IF NOT,
      *------ FIND THE DEFAULT OUTQ AND OVERRIDE TO THAT.
           MOVE SPACES                   TO  OVRPRTF-PARM1.
           MOVE OVRPRTF-TOFILE           TO  CHKOBJ-FILE-NAME.
           CALL "CCHKOBJ" USING CHKOBJ-FILE-NAME,
                               CHKOBJ-RETURN-STATUS.
           IF CHKOBJ-RETURN-STATUS = "00"
              PERFORM 6100-OVERRIDE-TO-PRINT-FILE THRU 6190-OTPF-X
           ELSE
              PERFORM 6200-OVERRIDE-TO-OUTQ THRU 6290-OTO-X
              IF CHKOBJ-RETURN-STATUS NOT = "00"
                  MOVE "MCPRT"           TO  OVRPRTF-TOFILE
                  PERFORM 6100-OVERRIDE-TO-PRINT-FILE THRU 6190-OTPF-X.

       6010-END-OF-JOB.
           MOVE ZERO                     TO  OVRPRTF-TOFILE-NUM.
           GOBACK.

       6100-OVERRIDE-TO-PRINT-FILE.
           MOVE OVRPRTF-TOFILE           TO  OVRPRTF-SPLFNAME.
           PERFORM 7000-PAGESIZE-OVRFLW-LPI.
           STRING "OVRPRTF FILE(" DELIMITED BY SIZE,
                  OVRPRTF-FILE DELIMITED BY SPACES,
                  ") TOFILE(*LIBL/" DELIMITED BY SIZE,
                  OVRPRTF-TOFILE DELIMITED BY SPACES,
                  ") COPIES(" DELIMITED BY SIZE,
                  OVRPRTF-COPIES DELIMITED BY SPACES,
                  ") SHARE(" DELIMITED BY SIZE,
                  OVRPRTF-SHARED DELIMITED BY SPACES,
                  ") SPLFNAME(" DELIMITED BY SIZE,
                  OVRPRTF-SPLFNAME DELIMITED BY SPACES,
                  ") " DELIMITED BY SIZE
                  PAGESIZE-WORK DELIMITED BY SPACES,
                  PAGESIZE-PAREN DELIMITED BY SIZE,
                  OVRFLW-WORK DELIMITED BY SPACES,
                  OVRFLW-PAREN DELIMITED BY SIZE,
                  LPI-WORK DELIMITED BY SPACES,
                  LPI-PAREN DELIMITED BY SIZE,
             INTO OVRPRTF-PARM1.

       6190-OTPF-X.
           EXIT.

       6200-OVERRIDE-TO-OUTQ.
           ACCEPT SC-SYSTEMS-COMMON FROM LOCAL-DATA-AREA.
      *------ IF THE OUTQ FROM MENU SYSTEM IS SPACES, DON'T EVEN
      *------ BOTHER CHECKING IT'S EXISTANCE
           IF SC-DEFAULT-OUTQ > SPACES
               MOVE SC-DEFAULT-OUTQ      TO  PRINTER-WORK
           ELSE
           IF SC-PRINTER > SPACES
               MOVE SC-PRINTER           TO  PRINTER-WORK
           ELSE
               MOVE "99"                 TO  CHKOBJ-RETURN-STATUS
               GO TO 6290-OTO-X.

      *------ NOTE: 'CCHKOBJ3' IS CALLED BECAUSE IT DOES NOT
      *------ REQUIRE ANY AUTHORITY TO THE OBJECT BEING CHECKED.
           MOVE OVRPRTF-TOFILE           TO  OVRPRTF-SPLFNAME.
           MOVE PRINTER-WORK             TO  CHKOBJ-FILE-NAME.
           MOVE "*OUTQ"                  TO  CHKOBJ-FILE-TYPE.
           CALL "CCHKOBJ3" USING CHKOBJ-FILE-NAME,
                                 CHKOBJ-FILE-TYPE,
                                 CHKOBJ-RETURN-STATUS.
           IF CHKOBJ-RETURN-STATUS NOT = "00"
               GO TO 6290-OTO-X.

           IF SC-DEFAULT-PRINTER-TYPE = "C"
               MOVE "*NO"                TO  REPLACE-UNPRINT
           ELSE
               MOVE "*YES"               TO  REPLACE-UNPRINT.

           PERFORM 7000-PAGESIZE-OVRFLW-LPI.
           STRING "OVRPRTF FILE(" DELIMITED BY SIZE,
                  OVRPRTF-FILE DELIMITED BY SPACES,
                  ") RPLUNPRT(" DELIMITED BY SIZE,
                  REPLACE-UNPRINT DELIMITED BY SPACES,
                  ") OUTQ(" DELIMITED BY SIZE,
                  PRINTER-WORK DELIMITED BY SPACES,
                  ") COPIES(" DELIMITED BY SIZE,
                  OVRPRTF-COPIES DELIMITED BY SPACES,
                  ") SHARE(" DELIMITED BY SIZE,
                  OVRPRTF-SHARED DELIMITED BY SPACES,
                  ") SPLFNAME(" DELIMITED BY SIZE,
                  OVRPRTF-SPLFNAME DELIMITED BY SPACES,
                  ") " DELIMITED BY SIZE

                  PAGESIZE-WORK DELIMITED BY SPACES,
                  PAGESIZE-PAREN DELIMITED BY SIZE,
                  OVRFLW-WORK DELIMITED BY SPACES,
                  OVRFLW-PAREN DELIMITED BY SIZE,
                  LPI-WORK DELIMITED BY SPACES,
                  LPI-PAREN DELIMITED BY SIZE,

             INTO OVRPRTF-PARM1.

       6290-OTO-X.
           EXIT.

       7000-PAGESIZE-OVRFLW-LPI.
           MOVE SPACES TO PAGESIZE-WORK, OVRFLW-WORK, LPI-WORK,
             PAGESIZE-PAREN, OVRFLW-PAREN, LPI-PAREN.
           IF OVRPRTF-PAGESIZE > SPACES
               MOVE ") " TO PAGESIZE-PAREN
               STRING "PAGESIZE(" DELIMITED BY SIZE,
                      OVRPRTF-PAGESIZE DELIMITED BY SPACES
                 INTO PAGESIZE-WORK.
           IF OVRPRTF-OVRFLW > SPACES
               MOVE ") " TO OVRFLW-PAREN
               STRING "OVRFLW(" DELIMITED BY SIZE,
                      OVRPRTF-OVRFLW DELIMITED BY SPACES
                 INTO OVRFLW-WORK.
           IF OVRPRTF-LPI > SPACES
               MOVE ") " TO LPI-PAREN
               STRING "LPI(" DELIMITED BY SIZE,
                      OVRPRTF-LPI DELIMITED BY SPACES
                 INTO LPI-WORK.

