       IDENTIFICATION DIVISION.

       PROGRAM-ID.     CPOFOBMNT.
       AUTHOR.         EXLTECH, INC - DAN RAUCH

      ***************************************************************
      **         MAINTAIN MCFPPOFOB - FOB DESCRIPTIONS  (TMS)
      ***************************************************************

      *================================================================
       ENVIRONMENT DIVISION.
      *===============================================================
       CONFIGURATION SECTION.

       SOURCE-COMPUTER.       IBM-AS400.
       OBJECT-COMPUTER.       IBM-AS400.
       SPECIAL-NAMES.         LOCAL-DATA LDA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT DISPLAY-FILE  ASSIGN TO WORKSTATION-ZDFOBMNT-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS DYNAMIC
                  FILE STATUS IS WS-FILE-STATUS
                  RELATIVE KEY IS WS-RRN
                  CONTROL-AREA IS WS-KEYBOARD-RETURN-AREA.

      *=== PHYSICAL KEYED BY FOBCODE - UNIQUE ========================
           SELECT FOB-CDE-FILE  ASSIGN TO DATABASE-MCFPCS7200
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS IS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

      *=== LOGICAL KEYED BY SORT CODE\FOBCODE ========================
           SELECT FOB-SRT-FILE  ASSIGN TO DATABASE-MCFLCS7201
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS IS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

      *=== LOGICAL KEYED BY FOBDESC - UNIQUE ========================
           SELECT FOB-DSC-FILE  ASSIGN TO DATABASE-MCFLCS7202
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS IS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

      *================================================================
       DATA DIVISION.
      *================================================================
       FILE SECTION.

       FD  DISPLAY-FILE.
       01  DISPLAY-REC.
       COPY DDS-ALL-FORMATS OF ZDFOBMNT.

       FD  FOB-CDE-FILE.
       01  FOB-CDE-REC.
       COPY DDS-ALL-FORMATS OF MCFPCS7200.

       FD  FOB-SRT-FILE.
       01  FOB-SRT-REC.
       COPY DDS-ALL-FORMATS OF MCFLCS7201.

       FD  FOB-DSC-FILE.
       01  FOB-DSC-REC.
       COPY DDS-ALL-FORMATS OF MCFLCS7202.

      *----------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *----------------------------------------------------------------
       COPY FILESTATUS IN COPYLIB.
       COPY DTSPARMS2  IN COPYLIB.

      *****************************************************************
      *  KEYBOARD RETURN AREA
      *****************************************************************
       01  WS-KEYBOARD-RETURN.
           03  WS-KEYBOARD-RETURN-AREA  PIC XX     VALUE SPACE.
               88  KB-ENTER-KEY                VALUE '00'.
               88  KB-F01-KEY                  VALUE '01'.
               88  KB-F02-KEY                  VALUE '02'.
               88  KB-F03-KEY                  VALUE '03'.
               88  KB-F04-KEY                  VALUE '04'.
               88  KB-F05-KEY                  VALUE '05'.
               88  KB-F06-KEY                  VALUE '06'.
               88  KB-F07-KEY                  VALUE '07'.
               88  KB-F08-KEY                  VALUE '08'.
               88  KB-F09-KEY                  VALUE '09'.
               88  KB-F10-KEY                  VALUE '10'.
               88  KB-F11-KEY                  VALUE '11'.
               88  KB-F12-KEY                  VALUE '12'.
               88  KB-F13-KEY                  VALUE '13'.
               88  KB-F14-KEY                  VALUE '14'.
               88  KB-F15-KEY                  VALUE '15'.
               88  KB-F16-KEY                  VALUE '16'.
               88  KB-F17-KEY                  VALUE '17'.
               88  KB-F18-KEY                  VALUE '18'.
               88  KB-F19-KEY                  VALUE '19'.
               88  KB-F20-KEY                  VALUE '20'.
               88  KB-F21-KEY                  VALUE '21'.
               88  KB-F22-KEY                  VALUE '22'.
               88  KB-F23-KEY                  VALUE '23'.
               88  KB-F24-KEY                  VALUE '24'.

      *****************************************************************
      *  ALL PROGRAM INDICATORS
      *****************************************************************
       01  WS-ALL-INDICATORS.
           03  IN83              PIC 1   INDIC 83   VALUE B"0".
               88  SFL-END-OFF                      VALUE B"0".
               88  SFL-END-ON                       VALUE B"1".
           03  IN84              PIC 1   INDIC 84   VALUE B"0".
               88  SFL-CLEAR-OFF                    VALUE B"0".
               88  SFL-CLEAR-ON                     VALUE B"1".
           03  IN85              PIC 1   INDIC 85   VALUE B"0".
               88  SFL-DISPLAY-OFF                  VALUE B"0".
               88  SFL-DISPLAY-ON                   VALUE B"1".
           03  IN86              PIC 1   INDIC 86   VALUE B"0".
               88  SFL-NXTCHG-OFF                   VALUE B"0".
               88  SFL-NXTCHG-ON                    VALUE B"1".

           03  IN99              PIC 1   INDIC 99   VALUE B"0".
               88  DISPLAY-ERROR-MSSG-OFF           VALUE B"0".
               88  DISPLAY-ERROR-MSSG-ON            VALUE B"1".

           03  IN30              PIC 1   INDIC 30   VALUE B"0".
               88  FOBC-ERROR-OFF                   VALUE B"0".
               88  FOBC-ERROR-ON                    VALUE B"1".

           03  IN31              PIC 1   INDIC 31   VALUE B"0".
               88  FOBD-ERROR-OFF                   VALUE B"0".
               88  FOBD-ERROR-ON                    VALUE B"1".

           03  IN50              PIC 1   INDIC 50   VALUE B"0".
               88  FOBC-PROTECTED-OFF               VALUE B"0".
               88  FOBC-PROTECTED-ON                VALUE B"1".


       01  WS-ALL-SCREEN-FIELDS.
            03  WS-H01-FLDS.
                05  FILLER            PIC X              VALUE SPACE.

            03  WS-CTL01-FLDS.
                05  CRRN              PIC S9(04)         VALUE +0.
                05  CREC              PIC X(10)          VALUE SPACE.
                05  CFLD              PIC X(10)          VALUE SPACE.
                05  CLOC              PIC S9(05)         VALUE +0.
                05  CLIBR             PIC X(10)          VALUE SPACE.
                05  CFILE             PIC X(10)          VALUE SPACE.

            03  WS-SFL01-FLDS.
                05  SEL               PIC X(01)          VALUE SPACE.
                05  SRTC              PIC X(03)          VALUE SPACE.
                05  FOBC              PIC X(03)          VALUE SPACE.
                05  FOBD              PIC X(20)          VALUE SPACE.
                05  HSRTC             PIC X(03)          VALUE SPACE.

            03  WS-S02-FLDS.
                05  SRTC              PIC X(03)          VALUE SPACE.
                05  FOBC              PIC X(03)          VALUE SPACE.
                05  FOBD              PIC X(20)          VALUE SPACE.
                05  MODELIT           PIC X(12)          VALUE SPACE.

            03  WS-B01-FLDS.
                05  MSSG              PIC X(78)          VALUE SPACE.

            03  WS-B02-FLDS.
                05  MSSG              PIC X(78)          VALUE SPACE.

      *****************************************************************
      *  PROGRAM MESSAGES
      *****************************************************************
       01  WS-PROGRAM-MESSAGES.
           03  WS-CANT-BE-BLANK-MSG       PIC X(78)     VALUE
               "Field Can NOT Be Blank".

           03  WS-USER-MSG.
               05  FILLER            PIC X(12)           VALUE SPACE.
               05  FILLER            PIC X(65)           VALUE
               "Make a Selection and Press ENTER - X=Update  D=Delete".

           03  WS-F6ADD-MSG.
               05  FILLER            PIC X(25)           VALUE SPACE.
               05  FILLER            PIC X(53)           VALUE
                  "File is Empty - Press F6 to ADD".

           03  WS-FOBC-DUPR-MSG          PIC X(78)     VALUE
               "FOB Code Must be Unique - RECORD ALREADY EXISTS".

           03  WS-FOBD-DUPR-MSG          PIC X(78)     VALUE
           "FOB Description Must Be Unique - RECORD ALREADY EXISTS".

      *****************************************************************
      *  MISCELLANEOUS WORK FIELDS
      *****************************************************************
       01  WS-MISCELLANEOUS-FIELDS.

           03  WS-EDIT-ERRORS-SW PIC X(01)          VALUE "N".
               88  EDIT-ERRORS-NO                   VALUE "N".
               88  EDIT-ERRORS-YES                  VALUE "Y".

           03  WS-ADD-MODE-SW    PIC X(01)          VALUE "N".
               88  ADD-MODE-NO                      VALUE "N".
               88  ADD-MODE-YES                     VALUE "Y".

           03  WS-FILE-NAME      PIC X(10)   VALUE "MCFPCS7200".
           03  WS-FILE-LIBR      PIC X(10)          VALUE SPACE.
           03  WS-RRN            PIC  9(05)         VALUE ZERO.
           03  WS-RRN1           PIC  9(05)         VALUE ZERO.
           03  WS-DSP-RRN        PIC  9(05)         VALUE ZERO.
           03  WS-FOBCDE-KEY     PIC X(03)          VALUE SPACE.
           03  WS-FOBDSC-KEY     PIC X(20)          VALUE SPACE.
           03  WS-ADD-MODE       PIC X(12)     VALUE "*** ADD ***".
           03  WS-UPD-MODE       PIC X(12)     VALUE "** UPDATE **".

      *================================================================
      *=             L I N K A G E    S E C T I O N
      *================================================================
       LINKAGE SECTION.
       01  LS-LIBRARY-NAME       PIC X(10).


      *================================================================
      *=             P R O C E D U R E    D I V I S I O N
      *================================================================
       PROCEDURE DIVISION  USING LS-LIBRARY-NAME.
       0000-PROGRAM-ENTRY.

           OPEN  I-O    DISPLAY-FILE
                        FOB-CDE-FILE
                 INPUT  FOB-SRT-FILE
                        FOB-DSC-FILE.

           PERFORM 0010-INITIALIZE       THRU 0010-EXIT.

           PERFORM 1000-PROCESS-SCREEN-1 THRU 1000-EXIT
                   UNTIL KB-F03-KEY.

           CLOSE        DISPLAY-FILE
                        FOB-CDE-FILE
                        FOB-SRT-FILE
                        FOB-DSC-FILE.


       0000-PROGRAM-END.
           GOBACK.

      *****************************************************************
      ** 1ST TIME PROCESSING ROUTINE
      *****************************************************************
       0010-INITIALIZE.

           SET  KB-ENTER-KEY     TO TRUE.
           MOVE LS-LIBRARY-NAME  TO WS-FILE-LIBR.
           PERFORM 1999-BUILD-SFL01      THRU 1999-EXIT.

       0010-EXIT.
            EXIT.

      *****************************************************************
      ***  MAIN PROCESSING LOOP ROUTINE
      *****************************************************************
       1000-PROCESS-SCREEN-1.

           PERFORM 8000-DISPLAY-SCREEN-1  THRU 8000-DSP-EXIT.
           IF  KB-F03-KEY
               GO TO 1000-EXIT
           END-IF.

           IF  KB-F06-KEY
               SET  ADD-MODE-YES   TO TRUE
               PERFORM 2999-BUILD-SCREEN-2   THRU 2999-EXIT
               PERFORM 2000-PROCESS-SCREEN-2 THRU 2000-EXIT
           END-IF.

           IF  SFL-DISPLAY-ON
               IF  ADD-MODE-NO
                   PERFORM 1100-CHECK-SFL01  THRU 1100-EXIT
               END-IF
           END-IF.

           PERFORM 1999-BUILD-SFL01          THRU 1999-EXIT.

       1000-EXIT.
            EXIT.

      *****************************************************************
      ***  CHECK SFL01 FOR USER SELECTION
      *****************************************************************
       1100-CHECK-SFL01.

           PERFORM 8000-READN-SFL01      THRU 8000-READN-EXIT.
           IF  FS-END-OF-FILE
               GO TO 1100-EXIT
           END-IF.

      ***  SELECT FOR UPDATE
           IF  SEL  OF WS-SFL01-FLDS = 'X'
               PERFORM 2999-BUILD-SCREEN-2   THRU 2999-EXIT
               PERFORM 2000-PROCESS-SCREEN-2 THRU 2000-EXIT
           END-IF.

      ***  SELECT FOR DELETE
           IF  SEL  OF WS-SFL01-FLDS = 'D'
               MOVE FOBC  OF WS-SFL01-FLDS   TO WS-FOBCDE-KEY
               PERFORM 3000-UPDATE-DATABASE  THRU 3000-EXIT
           END-IF.

           IF  SEL  OF WS-SFL01-FLDS = SPACE
      ***  SORT CODE HAS CHANGED
               IF  SRTC OF WS-SFL01-FLDS NOT = HSRTC OF WS-SFL01-FLDS
                   MOVE "U"      TO SEL OF WS-SFL01-FLDS
                   MOVE FOBC  OF WS-SFL01-FLDS   TO WS-FOBCDE-KEY
                   PERFORM 3000-UPDATE-DATABASE  THRU 3000-EXIT
                   MOVE SRTC OF WS-SFL01-FLDS TO HSRTC OF WS-SFL01-FLDS
               END-IF
           END-IF.

           MOVE SPACE             TO SEL OF WS-SFL01-FLDS.
           PERFORM 8000-REWRT-SFL01      THRU 8000-REWRT-EXIT.
           GO TO 1100-CHECK-SFL01.

       1100-EXIT.
            EXIT.

      *****************************************************************
      ***  CLEAR SFL01
      *****************************************************************
       1998-CLEAR-SFL01.

           INITIALIZE  WS-SFL01-FLDS.
           MOVE ZERO             TO WS-RRN  WS-RRN1.
           MOVE 1                TO WS-DSP-RRN.

           SET  SFL-CLEAR-ON     TO TRUE.
           PERFORM 8000-WRITE-CTL01   THRU 8000-WRTCR-EXIT.
           SET  SFL-CLEAR-OFF    TO TRUE.
           SET  SFL-END-ON       TO TRUE.
           SET  SFL-DISPLAY-OFF  TO TRUE.

       1998-EXIT.
            EXIT.

      *****************************************************************
      ***  BUILD SFL01 - LIST ALL PROCESS RECORDS
      *****************************************************************
       1999-BUILD-SFL01.

           PERFORM 1998-CLEAR-SFL01      THRU 1998-EXIT.

           PERFORM 9000-START-FOB-SRT    THRU 9000-START-SRT-EXIT.

       1999-READ-LOOP1.

           PERFORM 9000-READN-FOB-SRT    THRU 9000-READN-SRT-EXIT.
           IF  FS-END-OF-FILE
               GO TO 1999-EXIT
           END-IF.

           MOVE SPACE                   TO SEL   OF WS-SFL01-FLDS.
           MOVE FOBSRTC OF FOB-SRT-REC  TO SRTC  OF WS-SFL01-FLDS.
           MOVE FOBSRTC OF FOB-SRT-REC  TO HSRTC OF WS-SFL01-FLDS.
           MOVE FOBCODE OF FOB-SRT-REC  TO FOBC  OF WS-SFL01-FLDS.
           MOVE FOBDESC OF FOB-SRT-REC  TO FOBD  OF WS-SFL01-FLDS.

           ADD  1  TO WS-RRN.
           SET  SFL-NXTCHG-OFF  TO TRUE.

           PERFORM 8000-WRITE-SFL01      THRU 8000-WRTSF-EXIT.
           GO TO 1999-READ-LOOP1.

       1999-EXIT.
            EXIT.

      *****************************************************************
      ***  PROCESS SCREEN 2 - ADD MODE SCREEN
      *****************************************************************
       2000-PROCESS-SCREEN-2.

           PERFORM 8100-DISPLAY-SCREEN-2 THRU 8100-DSP-EXIT.
           IF  KB-F03-KEY
           OR  KB-F12-KEY
               GO TO 2000-EXIT
           END-IF.

           IF  ADD-MODE-YES
               PERFORM 2100-EDIT-SCREEN-2-A  THRU 2100-A-EXIT
           ELSE
               PERFORM 2100-EDIT-SCREEN-2-B  THRU 2100-B-EXIT
           END-IF.

           IF  EDIT-ERRORS-YES
               GO TO  2000-PROCESS-SCREEN-2
           END-IF.

      ***  UPDATE THE DATABASE
           MOVE FOBC          OF WS-S02-FLDS   TO WS-FOBCDE-KEY.
           PERFORM 3000-UPDATE-DATABASE  THRU 3000-EXIT.
           MOVE FOBD OF WS-S02-FLDS   TO FOBD  OF WS-SFL01-FLDS.

       2000-EXIT.
            EXIT.

      *****************************************************************
      ***  EDIT SCREEN 2 IN ADD MODE
      *****************************************************************
       2100-EDIT-SCREEN-2-A.

           SET EDIT-ERRORS-NO  TO TRUE.

      **===============================================================
      ***  FIELD CAN'T BE BLANK
      **===============================================================
      **** IF  SRTC          OF WS-S02-FLDS = SPACE
      ****     SET  SRTC-ERROR-ON          TO TRUE
      ****     MOVE WS-CANT-BE-BLANK-MSG   TO MSSG OF WS-B02-FLDS
      ****     GO TO 2100-EDIT-ERRORS
      **** END-IF.
      **************************************************************


      **===============================================================
      ***  FIELD CAN'T BE BLANK
      **===============================================================
           IF  FOBC          OF WS-S02-FLDS = SPACE
               SET  FOBC-ERROR-ON    TO TRUE
               MOVE WS-CANT-BE-BLANK-MSG   TO MSSG OF WS-B02-FLDS
               GO TO 2100-EDIT-ERRORS-A
           END-IF.

      **===============================================================
      ***  FIELD CAN'T BE BLANK
      **===============================================================
           IF  FOBD          OF WS-S02-FLDS = SPACE
               SET  FOBD-ERROR-ON    TO TRUE
               MOVE WS-CANT-BE-BLANK-MSG   TO MSSG OF WS-B02-FLDS
               GO TO 2100-EDIT-ERRORS-A
           END-IF.

      **===============================================================
      ***  CHECK FOR DUPE RECORD WHEN IN ADD MODE - FOBC
      **===============================================================
           MOVE FOBC   OF WS-S02-FLDS  TO WS-FOBCDE-KEY.
           PERFORM 9000-READK-FOB-CDE-NL   THRU 9000-READK-CDE-NL-EXIT.
           IF  FS-GOOD-FILE-IO
               SET  FOBC-ERROR-ON    TO TRUE
               MOVE WS-FOBC-DUPR-MSG TO MSSG OF WS-B02-FLDS
               GO TO 2100-EDIT-ERRORS-A
           END-IF.

      **===============================================================
      ***  CHECK FOR DUPE RECORD WHEN IN ADD MODE - FOBD
      **===============================================================
           MOVE FOBD   OF WS-S02-FLDS  TO WS-FOBDSC-KEY.
           PERFORM 9000-READK-FOB-DSC      THRU 9000-READK-DSC-EXIT.
           IF  FS-GOOD-FILE-IO
               SET  FOBD-ERROR-ON    TO TRUE
               MOVE WS-FOBD-DUPR-MSG  TO MSSG OF WS-B02-FLDS
               GO TO 2100-EDIT-ERRORS-A
           END-IF.

           GO TO 2100-A-EXIT.

       2100-EDIT-ERRORS-A.

           SET DISPLAY-ERROR-MSSG-ON  TO TRUE.
           SET EDIT-ERRORS-YES TO TRUE.

       2100-A-EXIT.
            EXIT.

      *****************************************************************
      ***  EDIT SCREEN 2 WHEN NOT IN ADD MODE
      *****************************************************************
       2100-EDIT-SCREEN-2-B.

           SET EDIT-ERRORS-NO  TO TRUE.

      **===============================================================
      ***  FIELD CAN'T BE BLANK
      **===============================================================
      **** IF  SRTC          OF WS-S02-FLDS = SPACE
      ****     SET  SRTC-ERROR-ON          TO TRUE
      ****     MOVE WS-CANT-BE-BLANK-MSG   TO MSSG OF WS-B02-FLDS
      ****     GO TO 2100-EDIT-ERRORS-B
      **** END-IF.
      **************************************************************

      **===============================================================
      ***  FIELD CAN'T BE BLANK
      **===============================================================
           IF  FOBD          OF WS-S02-FLDS = SPACE
               SET  FOBD-ERROR-ON    TO TRUE
               MOVE WS-CANT-BE-BLANK-MSG   TO MSSG OF WS-B02-FLDS
               GO TO 2100-EDIT-ERRORS-B
           END-IF.

           MOVE FOBC   OF WS-S02-FLDS  TO WS-FOBCDE-KEY.

      **===============================================================
      ***  MAKE SURE THE DESC FLD IS UNIQUE
      **===============================================================
           MOVE FOBD   OF WS-S02-FLDS  TO WS-FOBDSC-KEY
           PERFORM 9000-READK-FOB-DSC      THRU 9000-READK-DSC-EXIT
           IF  FS-GOOD-FILE-IO
               IF  FOBCODE OF FOB-DSC-REC NOT = WS-FOBCDE-KEY
                   SET  FOBD-ERROR-ON    TO TRUE
                   MOVE WS-FOBD-DUPR-MSG  TO MSSG OF WS-B02-FLDS
                   GO TO 2100-EDIT-ERRORS-B
               END-IF
           END-IF.

           GO TO 2100-B-EXIT.

       2100-EDIT-ERRORS-B.

           SET DISPLAY-ERROR-MSSG-ON  TO TRUE.
           SET EDIT-ERRORS-YES TO TRUE.

       2100-B-EXIT.
            EXIT.

      *****************************************************************
      ***  BUILD SCREEN 2
      *****************************************************************
       2999-BUILD-SCREEN-2.

           INITIALIZE  WS-S02-FLDS.
           SET  FOBC-PROTECTED-OFF    TO TRUE.
           MOVE WS-UPD-MODE  TO MODELIT OF WS-S02-FLDS.

           IF  ADD-MODE-YES
               MOVE WS-ADD-MODE  TO MODELIT OF WS-S02-FLDS
               GO TO 2999-EXIT
           END-IF.

           SET  FOBC-PROTECTED-ON     TO TRUE.
           MOVE CORR  WS-SFL01-FLDS TO WS-S02-FLDS.

       2999-EXIT.
            EXIT.

      *****************************************************************
      ***  UPDATE DATABASE
      *****************************************************************
       3000-UPDATE-DATABASE.

           PERFORM 9000-READK-FOB-CDE    THRU 9000-READK-CDE-EXIT.
           IF  FS-RECORD-NOT-FOUND
               PERFORM 3100-ADD-RECORD    THRU 3100-EXIT
               GO TO 3000-EXIT
           END-IF.

           IF  SEL        OF WS-SFL01-FLDS = "X"
               PERFORM 3200-CHG-RECORD THRU 3200-EXIT
               GO TO 3000-EXIT
           END-IF.

           IF  SEL        OF WS-SFL01-FLDS = "D"
               PERFORM 3300-DLT-RECORD THRU 3300-EXIT
               GO TO 3000-EXIT
           END-IF.

           IF  SEL        OF WS-SFL01-FLDS = "U"
               PERFORM 3200-CHG-RECORD-2 THRU 3200-2-EXIT
               GO TO 3000-EXIT
           END-IF.

       3000-EXIT.
            EXIT.

      *****************************************************************
      *** ADD A RECORD
      *****************************************************************
       3100-ADD-RECORD.

           INITIALIZE  FOB-CDE-REC.
           MOVE SRTC      OF WS-S02-FLDS TO FOBSRTC OF FOB-CDE-REC.
           MOVE FOBC      OF WS-S02-FLDS TO FOBCODE OF FOB-CDE-REC.
           MOVE FOBD      OF WS-S02-FLDS TO FOBDESC OF FOB-CDE-REC.
           PERFORM 9000-WRITE-FOB-CDE    THRU 9000-WRITE-CDE-EXIT.

       3100-EXIT.
            EXIT.

      *****************************************************************
      *** CHANGE A RECORD
      *****************************************************************
       3200-CHG-RECORD.

           MOVE SRTC      OF WS-S02-FLDS TO FOBSRTC OF FOB-CDE-REC.
           MOVE FOBD      OF WS-S02-FLDS TO FOBDESC OF FOB-CDE-REC.
           PERFORM 9000-REWRT-FOB-CDE    THRU 9000-REWRT-CDE-EXIT.

       3200-EXIT.
           EXIT.

      *****************************************************************
      *** DELETE A RECORD
      *****************************************************************
       3300-DLT-RECORD.

           PERFORM 9000-DELET-FOB-CDE    THRU 9000-DELET-CDE-EXIT.

       3300-EXIT.
           EXIT.

      *****************************************************************
      *** CHANGE A SORT CODE
      *****************************************************************
       3200-CHG-RECORD-2.

           MOVE SRTC      OF WS-SFL01-FLDS TO FOBSRTC OF FOB-CDE-REC.
           PERFORM 9000-REWRT-FOB-CDE    THRU 9000-REWRT-CDE-EXIT.

       3200-2-EXIT.
           EXIT.

      *****************************************************************
      ** DISPLAY SCREEN 1 - LIST PROCESSES & ALLOW SELECTION
      *****************************************************************
       8000-DISPLAY-SCREEN-1.

           SET  ADD-MODE-NO    TO TRUE.
           IF  WS-RRN1 = ZERO
               MOVE WS-F6ADD-MSG   TO MSSG OF WS-B01-FLDS
           ELSE
               MOVE WS-USER-MSG    TO MSSG OF WS-B01-FLDS
           END-IF.

      *****MOVE CORR WS-H01-FLDS    TO H01-O.
           WRITE DISPLAY-REC FORMAT "H01"
      *******    INDICATORS ARE WS-ALL-INDICATORS.
           END-WRITE.

           MOVE CORR WS-B01-FLDS    TO B01-O.
           WRITE DISPLAY-REC FORMAT "B01"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

           IF  WS-RRN1 > ZERO
               SET SFL-DISPLAY-ON   TO TRUE
           END-IF.
           MOVE WS-DSP-RRN TO CRRN OF WS-CTL01-FLDS.

           MOVE WS-FILE-NAME      TO CFILE OF WS-CTL01-FLDS.
           MOVE WS-FILE-LIBR      TO CLIBR OF WS-CTL01-FLDS.

           MOVE CORR WS-CTL01-FLDS  TO CTL01-O.
           WRITE DISPLAY-REC FORMAT "CTL01"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

           INITIALIZE  WS-CTL01-FLDS.

           READ  DISPLAY-FILE FORMAT "CTL01"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-READ.
           MOVE CORR CTL01-I TO WS-CTL01-FLDS.

       8000-DSP-EXIT.
            EXIT.

      *****************************************************************
      *** CTL01 WRITE CONTROL RECORD
      *****************************************************************
       8000-WRITE-CTL01.

           WRITE DISPLAY-REC FORMAT "CTL01"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

       8000-WRTCR-EXIT.
            EXIT.
      *****************************************************************
      *** SFL01 READ NEXT MODIFIED RECORD
      *****************************************************************
       8000-READN-SFL01.

           READ SUBFILE DISPLAY-FILE
                NEXT MODIFIED RECORD FORMAT IS "SFL01"
                     INDICATORS ARE WS-ALL-INDICATORS
           END-READ.
           MOVE CORR SFL01-I        TO WS-SFL01-FLDS.

       8000-READN-EXIT.
            EXIT.
      *****************************************************************
      *** SFL01 WRITE SUBFILE RECORD
      *****************************************************************
       8000-WRITE-SFL01.

           MOVE WS-RRN              TO WS-RRN1.

           MOVE CORR WS-SFL01-FLDS  TO SFL01-O.
           WRITE SUBFILE DISPLAY-REC FORMAT "SFL01"
                         INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

       8000-WRTSF-EXIT.
            EXIT.
      *****************************************************************
      *** SFL01 REWRITE SUBFILE RECORD
      *****************************************************************
       8000-REWRT-SFL01.

           MOVE CORR WS-SFL01-FLDS  TO SFL01-O.
           REWRITE SUBFILE DISPLAY-REC FORMAT "SFL01"
                         INDICATORS ARE WS-ALL-INDICATORS
           END-REWRITE.

       8000-REWRT-EXIT.
            EXIT.

      *****************************************************************
      ** DISPLAY SCREEN 2 - S02 - ADD MODE SCREEN
      *****************************************************************
       8100-DISPLAY-SCREEN-2.

      *****MOVE CORR WS-H01-FLDS    TO H01-O.
           WRITE DISPLAY-REC FORMAT "H01"
      *******    INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

           MOVE CORR WS-B02-FLDS    TO B02-O.
           WRITE DISPLAY-REC FORMAT "B02"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

           MOVE CORR WS-S02-FLDS  TO S02-O.
           WRITE DISPLAY-REC FORMAT "S02"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

           PERFORM 8100-INIT-SCREEN-2    THRU 8100-INIT-EXIT.

           READ  DISPLAY-FILE FORMAT "S02"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-READ.
           MOVE CORR S02-I TO WS-S02-FLDS.

       8100-DSP-EXIT.
            EXIT.

      *****************************************************************
      ** INIT S02
      *****************************************************************
       8100-INIT-SCREEN-2.

           INITIALIZE  WS-S02-FLDS  WS-B02-FLDS.
           SET  DISPLAY-ERROR-MSSG-OFF  TO TRUE.

           SET  FOBC-ERROR-OFF        TO TRUE.
           SET  FOBD-ERROR-OFF        TO TRUE.

       8100-INIT-EXIT.
            EXIT.

      *----------------------------------------------------------------
      *
      *            ALL DATABASE FILE I-O'S BELOW THIS POINT
      *
      *----------------------------------------------------------------

      *****************************************************************
      ***  START FOB-SRT-FILE
      *****************************************************************
       9000-START-FOB-SRT.

           INITIALIZE FOB-SRT-REC.
           MOVE LOW-VALUES       TO FOBSRTC  OF FOB-SRT-REC.
           MOVE LOW-VALUES       TO FOBCODE  OF FOB-SRT-REC.

           START FOB-SRT-FILE
                 KEY IS >= EXTERNALLY-DESCRIBED-KEY
           END-START.

       9000-START-SRT-EXIT.
            EXIT.

      *****************************************************************
      *** READ FOB DESC FILE SEQUENTIALLY WITHOUT RECORD LOCK
      *****************************************************************
       9000-READN-FOB-SRT.

           READ FOB-SRT-FILE  NEXT RECORD
           END-READ.

       9000-READN-SRT-EXIT.
            EXIT.
      *****************************************************************
      *** READ FOB BY CODE W/NO RECORD LOCK
      *****************************************************************
       9000-READK-FOB-CDE-NL.

           INITIALIZE FOB-CDE-REC.
           MOVE WS-FOBCDE-KEY    TO FOBCODE  OF FOB-CDE-REC.

           READ FOB-CDE-FILE   NO LOCK
           END-READ.

       9000-READK-CDE-NL-EXIT.
            EXIT.
      *****************************************************************
      *** READ FOB BY CODE FOR UPDATE
      *****************************************************************
       9000-READK-FOB-CDE.

           INITIALIZE FOB-CDE-REC.
           MOVE WS-FOBCDE-KEY    TO FOBCODE  OF FOB-CDE-REC.

           READ FOB-CDE-FILE
           END-READ.

       9000-READK-CDE-EXIT.
            EXIT.
      *****************************************************************
      *** READ FOB BY DESC
      *****************************************************************
       9000-READK-FOB-DSC.

           INITIALIZE FOB-DSC-REC.
           MOVE WS-FOBDSC-KEY    TO FOBDESC  OF FOB-DSC-REC.

           READ FOB-DSC-FILE
           END-READ.

       9000-READK-DSC-EXIT.
            EXIT.
      *****************************************************************
      *** REWRITE FOB CDE
      *****************************************************************
       9000-REWRT-FOB-CDE.

           REWRITE FOB-CDE-REC
           END-REWRITE.

       9000-REWRT-CDE-EXIT.
            EXIT.
      *****************************************************************
      *** WRITE FOB CDE
      *****************************************************************
       9000-WRITE-FOB-CDE.

           WRITE FOB-CDE-REC
           END-WRITE.

       9000-WRITE-CDE-EXIT.
            EXIT.
      *****************************************************************
      *** DELETE  FOB CDE
      *****************************************************************
       9000-DELET-FOB-CDE.

           DELETE  FOB-CDE-FILE
           END-DELETE.

       9000-DELET-CDE-EXIT.
            EXIT.
      *****************************************************************
      ***              END  OF  SOURCE  MEMBER
      *****************************************************************
