       IDENTIFICATION DIVISION.

       PROGRAM-ID.     CPOLOG.
       AUTHOR.         EXLTECH, INC - DAN RAUCH
      *****************************************************************
      **                     C P O L O G
      *****************************************************************
      ** THIS PROGRAM WRITES RECORDS TO THE PO LOG FILES
      *****************************************************************


      *****************************************************************
      **            M O D I F I C A T I O N    H I S T O R Y
      *****************************************************************

      ***------------------------------------------------------------***
      *   APRIL 01 2003      DAN RAUCH
      *   INITIAL AUTHOR   XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX  'G
      *   XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX  'G
      ***------------------------------------------------------------***
      *   MONTH DD CCYY      XXXXXXXXXX
      *   XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX  'G
      ***------------------------------------------------------------***
                                                                       *
      *================================================================
       ENVIRONMENT DIVISION.
      *===============================================================
       CONFIGURATION SECTION.

       SOURCE-COMPUTER.       IBM-AS400.
       OBJECT-COMPUTER.       IBM-AS400.
       SPECIAL-NAMES.         LOCAL-DATA IS LDA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT CPOLOG-FILE     ASSIGN TO DATABASE-MCFLCS7501
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

           SELECT CPOLOG-FILE2    ASSIGN TO DATABASE-MCFLCS7601
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

      *================================================================
       DATA DIVISION.
      *================================================================
       FILE SECTION.

       FD  CPOLOG-FILE.
       01  CPOLOG-REC.
       COPY DDS-ALL-FORMATS OF MCFLCS7501.

       FD  CPOLOG-FILE2.
       01  CPOLOG-REC2.
       COPY DDS-ALL-FORMATS OF MCFLCS7601.

      *----------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *----------------------------------------------------------------
       COPY FILESTATUS  OF COPYLIB.
       COPY DTSPARMS2   OF COPYLIB.
       COPY ZMPLTWS     OF COPYLIB.


       01  WS-MISCELLANEOUS-FLDS.
           03  WS-CPOLOG-KEY         PIC X(04)           VALUE "POLG".

      *================================================================
      *===              L I N K A G E    S E C T I O N
      *================================================================
       LINKAGE SECTION.
       COPY CPOLOGPRM  OF COPYLIB.

      *================================================================
      *=          P R O C E D U R E    D I V I S I O N
      *================================================================
       PROCEDURE DIVISION  USING LS-CPOLOG-PARMS.
       0000-PROGRAM-ENTRY.

           OPEN  I-O    CPOLOG-FILE
                        CPOLOG-FILE2.

           PERFORM 0010-INITIALIZE          THRU 0010-EXIT.

           PERFORM 1000-MAIN-LOGIC-ROUTINE  THRU 1000-EXIT.

           CLOSE        CPOLOG-FILE
                        CPOLOG-FILE2.

       0000-PROGRAM-END.
           GOBACK.

      *****************************************************************
      ***    1ST TIME PROCESSING ROUTINE
      *****************************************************************
       0010-INITIALIZE.


       0010-EXIT.
            EXIT.

      *****************************************************************
      ***  MAIN PROCESSING LOOP ROUTINE
      *****************************************************************
       1000-MAIN-LOGIC-ROUTINE.

      *----------------------------------------------------------------
      *  MAKE SURE PO LOGGING IS TURNED ON FOR THIS PLANT
      *----------------------------------------------------------------
           MOVE  WS-CPOLOG-KEY      TO WS-ZMPLT-KEY.
           PERFORM ZMPLT-GET-MPLTINFO   THRU ZMPLT-EXIT.
           MOVE WS-ZMPLT-FILE-STATUS  TO  WS-FILE-STATUS.
           IF  FS-GOOD-FILE-IO

               IF  WS-ZMPLT-PLTINFODTA(1:1) = "Y"
                   PERFORM 2000-PROCESS-LOG-REC     THRU 2000-EXIT
               END-IF

           END-IF.

       1000-EXIT.
            EXIT.
      *****************************************************************
      *** BUILD/WRITE RECEIVING LOG RECORDS
      *****************************************************************
       2000-PROCESS-LOG-REC.

           INITIALIZE  CPOLOG-REC  CPOLOG-REC2.

           MOVE  LS-CPOLOG-PO-NUMBER  TO PORCVNO  OF CPOLOG-REC.
           MOVE  LS-CPOLOG-PLANT-CODE TO POPLT    OF CPOLOG-REC.
           MOVE  LS-CPOLOG-IO-EVNTDS  TO EVNTDS   OF CPOLOG-REC.
           MOVE  LS-CPOLOG-IO-EVNTCD  TO EVNTCD   OF CPOLOG-REC.

           CALL "GETDTSTMP2" USING WS-SYSTEM-DATE-TIME2.
           MOVE  WS-SYSTEM-DATE-TIME2 TO DATETIME14 OF CPOLOG-REC.

           PERFORM 9000-WRITE-CPOLOG   THRU 9000-WRITE-EXIT.
           MOVE  WS-FILE-STATUS  TO LS-CPOLOG-FILE-STATUS-AREA.

       2000-EXIT.
            EXIT.

       COPY ZMPLTSUBR   OF COPYLIB.

      *****************************************************************
      ***  WRITE CPOLOG FILES
      ***   1 FOR VITRIA PROCESSING   AND  1 FOR AUDIT TRAIL
      *****************************************************************
       9000-WRITE-CPOLOG.

           MOVE  CPOLOG-REC    TO CPOLOG-REC2.

      ***  VITRIA PROCESSING
           WRITE CPOLOG-REC
           END-WRITE.


      ***  AUDIT TRAIL COPY FOR GOODYEAR
           WRITE CPOLOG-REC2
           END-WRITE.

       9000-WRITE-EXIT.
            EXIT.
      *****************************************************************
      ***                  END OF SOURCE
      *****************************************************************
