       IDENTIFICATION DIVISION.

       PROGRAM-ID.     CPOVIAMNT.
       AUTHOR.         EXLTECH, INC - DAN RAUCH

      ***************************************************************
      **         MAINTAIN MCFPPOVIA - VIA DESCRIPTIONS  (TMS)
      ***************************************************************

      *================================================================
       ENVIRONMENT DIVISION.
      *===============================================================
       CONFIGURATION SECTION.

       SOURCE-COMPUTER.       IBM-AS400.
       OBJECT-COMPUTER.       IBM-AS400.
       SPECIAL-NAMES.         LOCAL-DATA LDA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT DISPLAY-FILE  ASSIGN TO WORKSTATION-ZDVIAMNT-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS DYNAMIC
                  FILE STATUS IS WS-FILE-STATUS
                  RELATIVE KEY IS WS-RRN
                  CONTROL-AREA IS WS-KEYBOARD-RETURN-AREA.

      *=== PHYSICAL KEYED BY VIACODE - UNIQUE ========================
           SELECT VIA-CDE-FILE  ASSIGN TO DATABASE-MCFPCS7700
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS IS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

      *=== LOGICAL KEYED BY SORT CODE\VIACODE ========================
           SELECT VIA-SRT-FILE  ASSIGN TO DATABASE-MCFLCS7701
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS IS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

      *=== LOGICAL KEYED BY VIADESC - UNIQUE ========================
           SELECT VIA-DSC-FILE  ASSIGN TO DATABASE-MCFLCS7702
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS IS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

      *================================================================
       DATA DIVISION.
      *================================================================
       FILE SECTION.

       FD  DISPLAY-FILE.
       01  DISPLAY-REC.
       COPY DDS-ALL-FORMATS OF ZDVIAMNT.

       FD  VIA-CDE-FILE.
       01  VIA-CDE-REC.
       COPY DDS-ALL-FORMATS OF MCFPCS7700.

       FD  VIA-SRT-FILE.
       01  VIA-SRT-REC.
       COPY DDS-ALL-FORMATS OF MCFLCS7701.

       FD  VIA-DSC-FILE.
       01  VIA-DSC-REC.
       COPY DDS-ALL-FORMATS OF MCFLCS7702.

      *----------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *----------------------------------------------------------------
       COPY FILESTATUS IN COPYLIB.
       COPY DTSPARMS2  IN COPYLIB.

      *****************************************************************
      *  KEYBOARD RETURN AREA
      *****************************************************************
       01  WS-KEYBOARD-RETURN.
           03  WS-KEYBOARD-RETURN-AREA  PIC XX     VALUE SPACE.
               88  KB-ENTER-KEY                VALUE '00'.
               88  KB-F01-KEY                  VALUE '01'.
               88  KB-F02-KEY                  VALUE '02'.
               88  KB-F03-KEY                  VALUE '03'.
               88  KB-F04-KEY                  VALUE '04'.
               88  KB-F05-KEY                  VALUE '05'.
               88  KB-F06-KEY                  VALUE '06'.
               88  KB-F07-KEY                  VALUE '07'.
               88  KB-F08-KEY                  VALUE '08'.
               88  KB-F09-KEY                  VALUE '09'.
               88  KB-F10-KEY                  VALUE '10'.
               88  KB-F11-KEY                  VALUE '11'.
               88  KB-F12-KEY                  VALUE '12'.
               88  KB-F13-KEY                  VALUE '13'.
               88  KB-F14-KEY                  VALUE '14'.
               88  KB-F15-KEY                  VALUE '15'.
               88  KB-F16-KEY                  VALUE '16'.
               88  KB-F17-KEY                  VALUE '17'.
               88  KB-F18-KEY                  VALUE '18'.
               88  KB-F19-KEY                  VALUE '19'.
               88  KB-F20-KEY                  VALUE '20'.
               88  KB-F21-KEY                  VALUE '21'.
               88  KB-F22-KEY                  VALUE '22'.
               88  KB-F23-KEY                  VALUE '23'.
               88  KB-F24-KEY                  VALUE '24'.

      *****************************************************************
      *  ALL PROGRAM INDICATORS
      *****************************************************************
       01  WS-ALL-INDICATORS.
           03  IN83              PIC 1   INDIC 83   VALUE B"0".
               88  SFL-END-OFF                      VALUE B"0".
               88  SFL-END-ON                       VALUE B"1".
           03  IN84              PIC 1   INDIC 84   VALUE B"0".
               88  SFL-CLEAR-OFF                    VALUE B"0".
               88  SFL-CLEAR-ON                     VALUE B"1".
           03  IN85              PIC 1   INDIC 85   VALUE B"0".
               88  SFL-DISPLAY-OFF                  VALUE B"0".
               88  SFL-DISPLAY-ON                   VALUE B"1".
           03  IN86              PIC 1   INDIC 86   VALUE B"0".
               88  SFL-NXTCHG-OFF                   VALUE B"0".
               88  SFL-NXTCHG-ON                    VALUE B"1".

           03  IN99              PIC 1   INDIC 99   VALUE B"0".
               88  DISPLAY-ERROR-MSSG-OFF           VALUE B"0".
               88  DISPLAY-ERROR-MSSG-ON            VALUE B"1".

           03  IN30              PIC 1   INDIC 30   VALUE B"0".
               88  VIAC-ERROR-OFF                   VALUE B"0".
               88  VIAC-ERROR-ON                    VALUE B"1".

           03  IN31              PIC 1   INDIC 31   VALUE B"0".
               88  VIAD-ERROR-OFF                   VALUE B"0".
               88  VIAD-ERROR-ON                    VALUE B"1".

           03  IN50              PIC 1   INDIC 50   VALUE B"0".
               88  VIAC-PROTECTED-OFF               VALUE B"0".
               88  VIAC-PROTECTED-ON                VALUE B"1".


       01  WS-ALL-SCREEN-FIELDS.
            03  WS-H01-FLDS.
                05  FILLER            PIC X              VALUE SPACE.

            03  WS-CTL01-FLDS.
                05  CRRN              PIC S9(04)         VALUE +0.
                05  CREC              PIC X(10)          VALUE SPACE.
                05  CFLD              PIC X(10)          VALUE SPACE.
                05  CLOC              PIC S9(05)         VALUE +0.
                05  CLIBR             PIC X(10)          VALUE SPACE.
                05  CFILE             PIC X(10)          VALUE SPACE.

            03  WS-SFL01-FLDS.
                05  SEL               PIC X(01)          VALUE SPACE.
                05  SRTC              PIC X(03)          VALUE SPACE.
                05  VIAC              PIC X(03)          VALUE SPACE.
                05  VIAD              PIC X(20)          VALUE SPACE.
                05  HSRTC             PIC X(03)          VALUE SPACE.

            03  WS-S02-FLDS.
                05  SRTC              PIC X(03)          VALUE SPACE.
                05  VIAC              PIC X(03)          VALUE SPACE.
                05  VIAD              PIC X(20)          VALUE SPACE.
                05  MODELIT           PIC X(12)          VALUE SPACE.

            03  WS-B01-FLDS.
                05  MSSG              PIC X(78)          VALUE SPACE.

            03  WS-B02-FLDS.
                05  MSSG              PIC X(78)          VALUE SPACE.

      *****************************************************************
      *  PROGRAM MESSAGES
      *****************************************************************
       01  WS-PROGRAM-MESSAGES.
           03  WS-CANT-BE-BLANK-MSG       PIC X(78)     VALUE
               "Field Can NOT Be Blank".

           03  WS-USER-MSG.
               05  FILLER            PIC X(12)           VALUE SPACE.
               05  FILLER            PIC X(65)           VALUE
               "Make a Selection and Press ENTER - X=Update  D=Delete".

           03  WS-F6ADD-MSG.
               05  FILLER            PIC X(25)           VALUE SPACE.
               05  FILLER            PIC X(53)           VALUE
                  "File is Empty - Press F6 to ADD".

           03  WS-VIAC-DUPR-MSG          PIC X(78)     VALUE
               "VIA Code Must be Unique - RECORD ALREADY EXISTS".

           03  WS-VIAD-DUPR-MSG          PIC X(78)     VALUE
           "VIA Description Must Be Unique - RECORD ALREADY EXISTS".

      *****************************************************************
      *  MISCELLANEOUS WORK FIELDS
      *****************************************************************
       01  WS-MISCELLANEOUS-FIELDS.

           03  WS-EDIT-ERRORS-SW PIC X(01)          VALUE "N".
               88  EDIT-ERRORS-NO                   VALUE "N".
               88  EDIT-ERRORS-YES                  VALUE "Y".

           03  WS-ADD-MODE-SW    PIC X(01)          VALUE "N".
               88  ADD-MODE-NO                      VALUE "N".
               88  ADD-MODE-YES                     VALUE "Y".

           03  WS-FILE-NAME      PIC X(10)   VALUE "MCFPCS7700".
           03  WS-FILE-LIBR      PIC X(10)          VALUE SPACE.
           03  WS-RRN            PIC  9(05)         VALUE ZERO.
           03  WS-RRN1           PIC  9(05)         VALUE ZERO.
           03  WS-DSP-RRN        PIC  9(05)         VALUE ZERO.
           03  WS-VIACDE-KEY     PIC X(03)          VALUE SPACE.
           03  WS-VIADSC-KEY     PIC X(20)          VALUE SPACE.
           03  WS-ADD-MODE       PIC X(12)     VALUE "*** ADD ***".
           03  WS-UPD-MODE       PIC X(12)     VALUE "** UPDATE **".

      *================================================================
      *=             L I N K A G E    S E C T I O N
      *================================================================
       LINKAGE SECTION.
       01  LS-LIBRARY-NAME       PIC X(10).


      *================================================================
      *=             P R O C E D U R E    D I V I S I O N
      *================================================================
       PROCEDURE DIVISION  USING LS-LIBRARY-NAME.
       0000-PROGRAM-ENTRY.

           OPEN  I-O    DISPLAY-FILE
                        VIA-CDE-FILE
                 INPUT  VIA-SRT-FILE
                        VIA-DSC-FILE.

           PERFORM 0010-INITIALIZE       THRU 0010-EXIT.

           PERFORM 1000-PROCESS-SCREEN-1 THRU 1000-EXIT
                   UNTIL KB-F03-KEY.

           CLOSE        DISPLAY-FILE
                        VIA-CDE-FILE
                        VIA-SRT-FILE
                        VIA-DSC-FILE.


       0000-PROGRAM-END.
           GOBACK.

      *****************************************************************
      ** 1ST TIME PROCESSING ROUTINE
      *****************************************************************
       0010-INITIALIZE.

           SET  KB-ENTER-KEY     TO TRUE.
           MOVE LS-LIBRARY-NAME  TO WS-FILE-LIBR.
           PERFORM 1999-BUILD-SFL01      THRU 1999-EXIT.

       0010-EXIT.
            EXIT.

      *****************************************************************
      ***  MAIN PROCESSING LOOP ROUTINE
      *****************************************************************
       1000-PROCESS-SCREEN-1.

           PERFORM 8000-DISPLAY-SCREEN-1  THRU 8000-DSP-EXIT.
           IF  KB-F03-KEY
               GO TO 1000-EXIT
           END-IF.

           IF  KB-F06-KEY
               SET  ADD-MODE-YES   TO TRUE
               PERFORM 2999-BUILD-SCREEN-2   THRU 2999-EXIT
               PERFORM 2000-PROCESS-SCREEN-2 THRU 2000-EXIT
           END-IF.

           IF  SFL-DISPLAY-ON
               IF  ADD-MODE-NO
                   PERFORM 1100-CHECK-SFL01  THRU 1100-EXIT
               END-IF
           END-IF.

           PERFORM 1999-BUILD-SFL01          THRU 1999-EXIT.

       1000-EXIT.
            EXIT.

      *****************************************************************
      ***  CHECK SFL01 FOR USER SELECTION
      *****************************************************************
       1100-CHECK-SFL01.

           PERFORM 8000-READN-SFL01      THRU 8000-READN-EXIT.
           IF  FS-END-OF-FILE
               GO TO 1100-EXIT
           END-IF.

      ***  SELECT FOR UPDATE
           IF  SEL  OF WS-SFL01-FLDS = 'X'
               PERFORM 2999-BUILD-SCREEN-2   THRU 2999-EXIT
               PERFORM 2000-PROCESS-SCREEN-2 THRU 2000-EXIT
           END-IF.

      ***  SELECT FOR DELETE
           IF  SEL  OF WS-SFL01-FLDS = 'D'
               MOVE VIAC  OF WS-SFL01-FLDS   TO WS-VIACDE-KEY
               PERFORM 3000-UPDATE-DATABASE  THRU 3000-EXIT
           END-IF.

           IF  SEL  OF WS-SFL01-FLDS = SPACE
      ***  SORT CODE HAS CHANGED
               IF  SRTC OF WS-SFL01-FLDS NOT = HSRTC OF WS-SFL01-FLDS
                   MOVE "U"      TO SEL OF WS-SFL01-FLDS
                   MOVE VIAC  OF WS-SFL01-FLDS   TO WS-VIACDE-KEY
                   PERFORM 3000-UPDATE-DATABASE  THRU 3000-EXIT
                   MOVE SRTC OF WS-SFL01-FLDS TO HSRTC OF WS-SFL01-FLDS
               END-IF
           END-IF.

           MOVE SPACE             TO SEL OF WS-SFL01-FLDS.
           PERFORM 8000-REWRT-SFL01      THRU 8000-REWRT-EXIT.
           GO TO 1100-CHECK-SFL01.

       1100-EXIT.
            EXIT.

      *****************************************************************
      ***  CLEAR SFL01
      *****************************************************************
       1998-CLEAR-SFL01.

           INITIALIZE  WS-SFL01-FLDS.
           MOVE ZERO             TO WS-RRN  WS-RRN1.
           MOVE 1                TO WS-DSP-RRN.

           SET  SFL-CLEAR-ON     TO TRUE.
           PERFORM 8000-WRITE-CTL01   THRU 8000-WRTCR-EXIT.
           SET  SFL-CLEAR-OFF    TO TRUE.
           SET  SFL-END-ON       TO TRUE.
           SET  SFL-DISPLAY-OFF  TO TRUE.

       1998-EXIT.
            EXIT.

      *****************************************************************
      ***  BUILD SFL01 - LIST ALL PROCESS RECORDS
      *****************************************************************
       1999-BUILD-SFL01.

           PERFORM 1998-CLEAR-SFL01      THRU 1998-EXIT.

           PERFORM 9000-START-VIA-SRT    THRU 9000-START-SRT-EXIT.

       1999-READ-LOOP1.

           PERFORM 9000-READN-VIA-SRT    THRU 9000-READN-SRT-EXIT.
           IF  FS-END-OF-FILE
               GO TO 1999-EXIT
           END-IF.

           MOVE SPACE                   TO SEL   OF WS-SFL01-FLDS.
           MOVE VIASRTC OF VIA-SRT-REC  TO SRTC  OF WS-SFL01-FLDS.
           MOVE VIASRTC OF VIA-SRT-REC  TO HSRTC OF WS-SFL01-FLDS.
           MOVE VIACODE OF VIA-SRT-REC  TO VIAC  OF WS-SFL01-FLDS.
           MOVE VIADESC OF VIA-SRT-REC  TO VIAD  OF WS-SFL01-FLDS.

           ADD  1  TO WS-RRN.
           SET  SFL-NXTCHG-OFF  TO TRUE.

           PERFORM 8000-WRITE-SFL01      THRU 8000-WRTSF-EXIT.
           GO TO 1999-READ-LOOP1.

       1999-EXIT.
            EXIT.

      *****************************************************************
      ***  PROCESS SCREEN 2 - ADD MODE SCREEN
      *****************************************************************
       2000-PROCESS-SCREEN-2.

           PERFORM 8100-DISPLAY-SCREEN-2 THRU 8100-DSP-EXIT.
           IF  KB-F03-KEY
           OR  KB-F12-KEY
               GO TO 2000-EXIT
           END-IF.

           IF  ADD-MODE-YES
               PERFORM 2100-EDIT-SCREEN-2-A  THRU 2100-A-EXIT
           ELSE
               PERFORM 2100-EDIT-SCREEN-2-B  THRU 2100-B-EXIT
           END-IF.

           IF  EDIT-ERRORS-YES
               GO TO  2000-PROCESS-SCREEN-2
           END-IF.

      ***  UPDATE THE DATABASE
           MOVE VIAC          OF WS-S02-FLDS   TO WS-VIACDE-KEY.
           PERFORM 3000-UPDATE-DATABASE  THRU 3000-EXIT.
           MOVE VIAD OF WS-S02-FLDS   TO VIAD  OF WS-SFL01-FLDS.

       2000-EXIT.
            EXIT.

      *****************************************************************
      ***  EDIT SCREEN 2 IN ADD MODE
      *****************************************************************
       2100-EDIT-SCREEN-2-A.

           SET EDIT-ERRORS-NO  TO TRUE.

      **===============================================================
      ***  FIELD CAN'T BE BLANK
      **===============================================================
      **** IF  SRTC          OF WS-S02-FLDS = SPACE
      ****     SET  SRTC-ERROR-ON          TO TRUE
      ****     MOVE WS-CANT-BE-BLANK-MSG   TO MSSG OF WS-B02-FLDS
      ****     GO TO 2100-EDIT-ERRORS
      **** END-IF.
      **************************************************************


      **===============================================================
      ***  FIELD CAN'T BE BLANK
      **===============================================================
           IF  VIAC          OF WS-S02-FLDS = SPACE
               SET  VIAC-ERROR-ON    TO TRUE
               MOVE WS-CANT-BE-BLANK-MSG   TO MSSG OF WS-B02-FLDS
               GO TO 2100-EDIT-ERRORS-A
           END-IF.

      **===============================================================
      ***  FIELD CAN'T BE BLANK
      **===============================================================
           IF  VIAD          OF WS-S02-FLDS = SPACE
               SET  VIAD-ERROR-ON    TO TRUE
               MOVE WS-CANT-BE-BLANK-MSG   TO MSSG OF WS-B02-FLDS
               GO TO 2100-EDIT-ERRORS-A
           END-IF.

      **===============================================================
      ***  CHECK FOR DUPE RECORD WHEN IN ADD MODE - VIAC
      **===============================================================
           MOVE VIAC   OF WS-S02-FLDS  TO WS-VIACDE-KEY.
           PERFORM 9000-READK-VIA-CDE-NL   THRU 9000-READK-CDE-NL-EXIT.
           IF  FS-GOOD-FILE-IO
               SET  VIAC-ERROR-ON    TO TRUE
               MOVE WS-VIAC-DUPR-MSG TO MSSG OF WS-B02-FLDS
               GO TO 2100-EDIT-ERRORS-A
           END-IF.

      **===============================================================
      ***  CHECK FOR DUPE RECORD WHEN IN ADD MODE - VIAD
      **===============================================================
           MOVE VIAD   OF WS-S02-FLDS  TO WS-VIADSC-KEY.
           PERFORM 9000-READK-VIA-DSC      THRU 9000-READK-DSC-EXIT.
           IF  FS-GOOD-FILE-IO
               SET  VIAD-ERROR-ON    TO TRUE
               MOVE WS-VIAD-DUPR-MSG  TO MSSG OF WS-B02-FLDS
               GO TO 2100-EDIT-ERRORS-A
           END-IF.

           GO TO 2100-A-EXIT.

       2100-EDIT-ERRORS-A.

           SET DISPLAY-ERROR-MSSG-ON  TO TRUE.
           SET EDIT-ERRORS-YES TO TRUE.

       2100-A-EXIT.
            EXIT.

      *****************************************************************
      ***  EDIT SCREEN 2 WHEN NOT IN ADD MODE
      *****************************************************************
       2100-EDIT-SCREEN-2-B.

           SET EDIT-ERRORS-NO  TO TRUE.

      **===============================================================
      ***  FIELD CAN'T BE BLANK
      **===============================================================
      **** IF  SRTC          OF WS-S02-FLDS = SPACE
      ****     SET  SRTC-ERROR-ON          TO TRUE
      ****     MOVE WS-CANT-BE-BLANK-MSG   TO MSSG OF WS-B02-FLDS
      ****     GO TO 2100-EDIT-ERRORS-B
      **** END-IF.
      **************************************************************

      **===============================================================
      ***  FIELD CAN'T BE BLANK
      **===============================================================
           IF  VIAD          OF WS-S02-FLDS = SPACE
               SET  VIAD-ERROR-ON    TO TRUE
               MOVE WS-CANT-BE-BLANK-MSG   TO MSSG OF WS-B02-FLDS
               GO TO 2100-EDIT-ERRORS-B
           END-IF.

           MOVE VIAC   OF WS-S02-FLDS  TO WS-VIACDE-KEY.

      **===============================================================
      ***  MAKE SURE THE DESC FLD IS UNIQUE
      **===============================================================
           MOVE VIAD   OF WS-S02-FLDS  TO WS-VIADSC-KEY
           PERFORM 9000-READK-VIA-DSC      THRU 9000-READK-DSC-EXIT
           IF  FS-GOOD-FILE-IO
               IF  VIACODE OF VIA-DSC-REC NOT = WS-VIACDE-KEY
                   SET  VIAD-ERROR-ON    TO TRUE
                   MOVE WS-VIAD-DUPR-MSG  TO MSSG OF WS-B02-FLDS
                   GO TO 2100-EDIT-ERRORS-B
               END-IF
           END-IF.

           GO TO 2100-B-EXIT.

       2100-EDIT-ERRORS-B.

           SET DISPLAY-ERROR-MSSG-ON  TO TRUE.
           SET EDIT-ERRORS-YES TO TRUE.

       2100-B-EXIT.
            EXIT.

      *****************************************************************
      ***  BUILD SCREEN 2
      *****************************************************************
       2999-BUILD-SCREEN-2.

           INITIALIZE  WS-S02-FLDS.
           SET  VIAC-PROTECTED-OFF    TO TRUE.
           MOVE WS-UPD-MODE  TO MODELIT OF WS-S02-FLDS.

           IF  ADD-MODE-YES
               MOVE WS-ADD-MODE  TO MODELIT OF WS-S02-FLDS
               GO TO 2999-EXIT
           END-IF.

           SET  VIAC-PROTECTED-ON     TO TRUE.
           MOVE CORR  WS-SFL01-FLDS TO WS-S02-FLDS.

       2999-EXIT.
            EXIT.

      *****************************************************************
      ***  UPDATE DATABASE
      *****************************************************************
       3000-UPDATE-DATABASE.

           PERFORM 9000-READK-VIA-CDE    THRU 9000-READK-CDE-EXIT.
           IF  FS-RECORD-NOT-FOUND
               PERFORM 3100-ADD-RECORD    THRU 3100-EXIT
               GO TO 3000-EXIT
           END-IF.

           IF  SEL        OF WS-SFL01-FLDS = "X"
               PERFORM 3200-CHG-RECORD THRU 3200-EXIT
               GO TO 3000-EXIT
           END-IF.

           IF  SEL        OF WS-SFL01-FLDS = "D"
               PERFORM 3300-DLT-RECORD THRU 3300-EXIT
               GO TO 3000-EXIT
           END-IF.

           IF  SEL        OF WS-SFL01-FLDS = "U"
               PERFORM 3200-CHG-RECORD-2 THRU 3200-2-EXIT
               GO TO 3000-EXIT
           END-IF.

       3000-EXIT.
            EXIT.

      *****************************************************************
      *** ADD A RECORD
      *****************************************************************
       3100-ADD-RECORD.

           INITIALIZE  VIA-CDE-REC.
           MOVE SRTC      OF WS-S02-FLDS TO VIASRTC OF VIA-CDE-REC.
           MOVE VIAC      OF WS-S02-FLDS TO VIACODE OF VIA-CDE-REC.
           MOVE VIAD      OF WS-S02-FLDS TO VIADESC OF VIA-CDE-REC.
           PERFORM 9000-WRITE-VIA-CDE    THRU 9000-WRITE-CDE-EXIT.

       3100-EXIT.
            EXIT.

      *****************************************************************
      *** CHANGE A RECORD
      *****************************************************************
       3200-CHG-RECORD.

           MOVE SRTC      OF WS-S02-FLDS TO VIASRTC OF VIA-CDE-REC.
           MOVE VIAD      OF WS-S02-FLDS TO VIADESC OF VIA-CDE-REC.
           PERFORM 9000-REWRT-VIA-CDE    THRU 9000-REWRT-CDE-EXIT.

       3200-EXIT.
           EXIT.

      *****************************************************************
      *** DELETE A RECORD
      *****************************************************************
       3300-DLT-RECORD.

           PERFORM 9000-DELET-VIA-CDE    THRU 9000-DELET-CDE-EXIT.

       3300-EXIT.
           EXIT.

      *****************************************************************
      *** CHANGE A SORT CODE
      *****************************************************************
       3200-CHG-RECORD-2.

           MOVE SRTC      OF WS-SFL01-FLDS TO VIASRTC OF VIA-CDE-REC.
           PERFORM 9000-REWRT-VIA-CDE    THRU 9000-REWRT-CDE-EXIT.

       3200-2-EXIT.
           EXIT.

      *****************************************************************
      ** DISPLAY SCREEN 1 - LIST PROCESSES & ALLOW SELECTION
      *****************************************************************
       8000-DISPLAY-SCREEN-1.

           SET  ADD-MODE-NO    TO TRUE.
           IF  WS-RRN1 = ZERO
               MOVE WS-F6ADD-MSG   TO MSSG OF WS-B01-FLDS
           ELSE
               MOVE WS-USER-MSG    TO MSSG OF WS-B01-FLDS
           END-IF.

      *****MOVE CORR WS-H01-FLDS    TO H01-O.
           WRITE DISPLAY-REC FORMAT "H01"
      *******    INDICATORS ARE WS-ALL-INDICATORS.
           END-WRITE.

           MOVE CORR WS-B01-FLDS    TO B01-O.
           WRITE DISPLAY-REC FORMAT "B01"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

           IF  WS-RRN1 > ZERO
               SET SFL-DISPLAY-ON   TO TRUE
           END-IF.
           MOVE WS-DSP-RRN TO CRRN OF WS-CTL01-FLDS.

           MOVE WS-FILE-NAME      TO CFILE OF WS-CTL01-FLDS.
           MOVE WS-FILE-LIBR      TO CLIBR OF WS-CTL01-FLDS.

           MOVE CORR WS-CTL01-FLDS  TO CTL01-O.
           WRITE DISPLAY-REC FORMAT "CTL01"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

           INITIALIZE  WS-CTL01-FLDS.

           READ  DISPLAY-FILE FORMAT "CTL01"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-READ.
           MOVE CORR CTL01-I TO WS-CTL01-FLDS.

       8000-DSP-EXIT.
            EXIT.

      *****************************************************************
      *** CTL01 WRITE CONTROL RECORD
      *****************************************************************
       8000-WRITE-CTL01.

           WRITE DISPLAY-REC FORMAT "CTL01"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

       8000-WRTCR-EXIT.
            EXIT.
      *****************************************************************
      *** SFL01 READ NEXT MODIFIED RECORD
      *****************************************************************
       8000-READN-SFL01.

           READ SUBFILE DISPLAY-FILE
                NEXT MODIFIED RECORD FORMAT IS "SFL01"
                     INDICATORS ARE WS-ALL-INDICATORS
           END-READ.
           MOVE CORR SFL01-I        TO WS-SFL01-FLDS.

       8000-READN-EXIT.
            EXIT.
      *****************************************************************
      *** SFL01 WRITE SUBFILE RECORD
      *****************************************************************
       8000-WRITE-SFL01.

           MOVE WS-RRN              TO WS-RRN1.

           MOVE CORR WS-SFL01-FLDS  TO SFL01-O.
           WRITE SUBFILE DISPLAY-REC FORMAT "SFL01"
                         INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

       8000-WRTSF-EXIT.
            EXIT.
      *****************************************************************
      *** SFL01 REWRITE SUBFILE RECORD
      *****************************************************************
       8000-REWRT-SFL01.

           MOVE CORR WS-SFL01-FLDS  TO SFL01-O.
           REWRITE SUBFILE DISPLAY-REC FORMAT "SFL01"
                         INDICATORS ARE WS-ALL-INDICATORS
           END-REWRITE.

       8000-REWRT-EXIT.
            EXIT.

      *****************************************************************
      ** DISPLAY SCREEN 2 - S02 - ADD MODE SCREEN
      *****************************************************************
       8100-DISPLAY-SCREEN-2.

      *****MOVE CORR WS-H01-FLDS    TO H01-O.
           WRITE DISPLAY-REC FORMAT "H01"
      *******    INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

           MOVE CORR WS-B02-FLDS    TO B02-O.
           WRITE DISPLAY-REC FORMAT "B02"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

           MOVE CORR WS-S02-FLDS  TO S02-O.
           WRITE DISPLAY-REC FORMAT "S02"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

           PERFORM 8100-INIT-SCREEN-2    THRU 8100-INIT-EXIT.

           READ  DISPLAY-FILE FORMAT "S02"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-READ.
           MOVE CORR S02-I TO WS-S02-FLDS.

       8100-DSP-EXIT.
            EXIT.

      *****************************************************************
      ** INIT S02
      *****************************************************************
       8100-INIT-SCREEN-2.

           INITIALIZE  WS-S02-FLDS  WS-B02-FLDS.
           SET  DISPLAY-ERROR-MSSG-OFF  TO TRUE.

           SET  VIAC-ERROR-OFF        TO TRUE.
           SET  VIAD-ERROR-OFF        TO TRUE.

       8100-INIT-EXIT.
            EXIT.

      *----------------------------------------------------------------
      *
      *            ALL DATABASE FILE I-O'S BELOW THIS POINT
      *
      *----------------------------------------------------------------

      *****************************************************************
      ***  START VIA-SRT-FILE
      *****************************************************************
       9000-START-VIA-SRT.

           INITIALIZE VIA-SRT-REC.
           MOVE LOW-VALUES       TO VIASRTC  OF VIA-SRT-REC.
           MOVE LOW-VALUES       TO VIACODE  OF VIA-SRT-REC.

           START VIA-SRT-FILE
                 KEY IS >= EXTERNALLY-DESCRIBED-KEY
           END-START.

       9000-START-SRT-EXIT.
            EXIT.

      *****************************************************************
      *** READ VIA DESC FILE SEQUENTIALLY WITHOUT RECORD LOCK
      *****************************************************************
       9000-READN-VIA-SRT.

           READ VIA-SRT-FILE  NEXT RECORD
           END-READ.

       9000-READN-SRT-EXIT.
            EXIT.
      *****************************************************************
      *** READ VIA BY CODE W/NO RECORD LOCK
      *****************************************************************
       9000-READK-VIA-CDE-NL.

           INITIALIZE VIA-CDE-REC.
           MOVE WS-VIACDE-KEY    TO VIACODE  OF VIA-CDE-REC.

           READ VIA-CDE-FILE   NO LOCK
           END-READ.

       9000-READK-CDE-NL-EXIT.
            EXIT.
      *****************************************************************
      *** READ VIA BY CODE FOR UPDATE
      *****************************************************************
       9000-READK-VIA-CDE.

           INITIALIZE VIA-CDE-REC.
           MOVE WS-VIACDE-KEY    TO VIACODE  OF VIA-CDE-REC.

           READ VIA-CDE-FILE
           END-READ.

       9000-READK-CDE-EXIT.
            EXIT.
      *****************************************************************
      *** READ VIA BY DESC
      *****************************************************************
       9000-READK-VIA-DSC.

           INITIALIZE VIA-DSC-REC.
           MOVE WS-VIADSC-KEY    TO VIADESC  OF VIA-DSC-REC.

           READ VIA-DSC-FILE
           END-READ.

       9000-READK-DSC-EXIT.
            EXIT.
      *****************************************************************
      *** REWRITE VIA CDE
      *****************************************************************
       9000-REWRT-VIA-CDE.

           REWRITE VIA-CDE-REC
           END-REWRITE.

       9000-REWRT-CDE-EXIT.
            EXIT.
      *****************************************************************
      *** WRITE VIA CDE
      *****************************************************************
       9000-WRITE-VIA-CDE.

           WRITE VIA-CDE-REC
           END-WRITE.

       9000-WRITE-CDE-EXIT.
            EXIT.
      *****************************************************************
      *** DELETE  VIA CDE
      *****************************************************************
       9000-DELET-VIA-CDE.

           DELETE  VIA-CDE-FILE
           END-DELETE.

       9000-DELET-CDE-EXIT.
            EXIT.
      *****************************************************************
      ***              END  OF  SOURCE  MEMBER
      *****************************************************************
