       IDENTIFICATION DIVISION.
       PROGRAM-ID.     CQTPRT.
       AUTHOR.         BARBARA WINTER.
       INSTALLATION.   GOODYEAR TIRE & RUBBER COMPANY.
       DATE-WRITTEN.   MAY 1987.
       DATE-COMPILED.
      *SECURITY.
      *REMARKS.
      *                     PRINTS A QUOTE SHEET.
      *
      ***************************************************************
      ***                      C Q T P R T                        ***
      ***                                                         ***
      ***      THIS PROGRAM   PRINTS A QUOTE SHEET THAT HAS       ***
      ***      ALREADY BEEN CREATED.  TWO PARAMETERS ARE          ***
      ***      PASSED TO THIS PROGRAM.                            ***
      ***                                                         ***
      ***************************************************************
      *C
      *C 06/29/92  BK DISMUKES  REQUEST 6228
      *C     1. ADDED CURRENCY AND VENDOR FAX FIELD
      *C     2. CHANGED FOB TO SHIPPING TERMS IN MSG FILE
      *C
      *C 07/01/92  BK DISMUKES  REQUEST 5851
      *C     1. ADDED LOGIC TO PRINT BUYER PHONE NUMBER
      *C
      *C 06/22/94  MARVIN MITCHELL
      *C     CHANGED THE PRNT-ANNUAL AND PRNT-USAGE FIELDS
      *C     TO DISPLAY NEGATIVE VALUES.
      *C
      *C 04/25/96  WILL MCINTYRE     REQUEST 96-010
      *C     TO MAKE THE QUOTE SHEET LOOK MORE REFINED, REVISE THE
      *C     ANNUAL USAGE FIELD TO DISPLAY "NOT KNOWN" IF THE ANNUAL
      *C     USAGE IS ZERO OR LESS FOR CORPCODE OR IF ITEM IS A
      *C     NON-CODED ITEM.
      *C
      *C 05/03/96  WILL MCINTYRE     REQUEST 96-012
      *C     INCLUDE EFFECTIVE DATE ON QUOTE SHEET.
      *C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.    HP-3000.
       OBJECT-COMPUTER.    HP-3000.
       SPECIAL-NAMES. C01 IS NEW-PAGE.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT ONLINE-PRT    ASSIGN TO PRINTER-MCPRT.
            SELECT MBUYER-I
              ASSIGN TO DATABASE-MCFLCS0601
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
              FILE STATUS IS FILE-STATUS.
            SELECT DVENDOR-I
              ASSIGN TO DATABASE-MCFLCS0701
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT DVENDITM3-I
              ASSIGN TO DATABASE-MCFLCS0803
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT MVALIDUM-I
               ASSIGN TO DATABASE-MCFLCS0401
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT DQUOTEXT-I
               ASSIGN TO DATABASE-MCFLCS3801
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT MSTORERM-I
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT DREQITM-I
               ASSIGN TO DATABASE-MCFLCS2201
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT DREQDESC-I
               ASSIGN TO DATABASE-MCFLCS2301
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT MPLTINFO-I
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT USAGEFIL-I
               ASSIGN TO DATABASE-MCFLCSUSAG
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  ONLINE-PRT
           RECORD CONTAINS 132 CHARACTERS.
       01  PRT-REC.
           05  PRT-LINE                  PIC X(132).

       FD  MBUYER-I
           LABEL RECORDS ARE STANDARD.
       01  MBUYER-REC-I.
           COPY DDS-MCRPCS0600  OF MCFLCS0601.

       FD  DVENDOR-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-REC-I.
           COPY DDS-MCRPCS0700  OF MCFLCS0701.

       FD  DVENDITM3-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM3-REC-I.
           COPY DDS-MCRPCS0800  OF MCFLCS0803.

       FD  DQUOTEXT-I
           LABEL RECORDS ARE STANDARD.
       01  DQUOTEXT-REC-I.
           COPY DDS-MCRPCS3800  OF MCFLCS3801.

       FD  MVALIDUM-I
           LABEL RECORDS ARE STANDARD.
       01  MVALIDUM-REC-I.
           COPY DDS-MCRPCS0400  OF MCFLCS0401.

       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  DREQITM-I
           LABEL RECORDS ARE STANDARD.
       01  DREQITM-REC-I.
           COPY DDS-MCRPCS2200  OF MCFLCS2201.

       FD  DREQDESC-I
           LABEL RECORDS ARE STANDARD.
       01  DREQDESC-REC-I.
           COPY DDS-MCRPCS2300  OF MCFLCS2301.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  USAGEFIL-I
           LABEL RECORDS ARE STANDARD.
       01  USAGEFIL-REC-I.
           COPY DDS-MCRPCSUSAG OF MCFLCSUSAG.
      **************************************************************
      *           W O R K I N G         S T O R A G E              *
      **************************************************************
       WORKING-STORAGE SECTION.
       01  HOLD-FAX  VALUE SPACES.
           05  HOLD-FAX-1                PIC X.
           05  HOLD-FAX-2-AND-ON         PIC X(23).
       01  PRT-FAX-END        PIC X(5)  VALUE "**END".
PDR    01  REF-LINE.
PDR        05  PRT-REF-LIT    PIC X(8)  VALUE "**(REF) ".
PDR        05  PRT-QUOTE-REF  PIC X(10) VALUE SPACES.
PDR    01  PRT-FAX-NUMBER     PIC X(23) VALUE SPACES.
       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X.
           05  FILE-STATUS-2             PIC X.
       01  PAGE-NUM                      PIC 9(3)   VALUE 0.
       01  DISCOUNT-CTR                  PIC 9      VALUE 0.
       01  LINE-CTR                      PIC 9(3)   VALUE 0.
       01  X                             PIC 9(2)    VALUE 0.
       01  SUB                           PIC S9(4)   VALUE ZEROES.
       01  YTD-TOTAL                     PIC S9(8)   VALUE ZEROES.
       01  QUOTE-EXISTS                  PIC X      VALUE "0".
           88 NO-QUOTE                            VALUE "1".
       01  QUOTE-WS.
           05  WORK-QUOTE                PIC 9(6)   VALUE ZEROES.
           05  FILLER                    PIC X(4)   VALUE SPACES.
       01  REQ-PRINT-WS.
           05  FILLER                    PIC X(5)  VALUE SPACES.
           05  WS-REQ-LIT                PIC X(30).
           05  WS-REQ                    PIC X(12).
       01  MESSAGE-BUFFER                PIC X(76)  VALUE SPACES.
       01  MESSAGE-BUFFER-RD REDEFINES MESSAGE-BUFFER.
           05  MSG-BUFFER                PIC X(68).
           05  MSG-VALUE                 PIC X(8).
       01  MESSAGE-BUFLEN                PIC S9(4)  VALUE 76  COMP.
       01  MESSAGE-ACTLEN                PIC S9(4)  VALUE 0   COMP.
       01  FIELD-NUMBER                  PIC S9(4)  VALUE 1   COMP.

       01  SPOOLER-PARAMETERS.
           05  SPOOL-STATUS              PIC S9       VALUE ZERO  COMP.
           05  SPOOL-MESSAGE             PIC X(75)    VALUE SPACES.
           05  FILLER                    PIC X        VALUE SPACES.
           05  SPOOL-COPIES              PIC S9(2)    VALUE 1     COMP.
           05  SPOOL-PRIORITY            PIC S9       VALUE ZERO  COMP.
       01  SPOOL-LIMIT                   PIC S9(8)  COMP VALUE 20000.
       01  SPOOL-FEQ-NAME                PIC X(8)   VALUE "SXXXXXXX".

      *----------  TOTAL LINE COUNT FOR INDIVIDUAL ITEMS; USED TO
      *            DETERMINE PAGE BREAKS SO ITEMS WILL NOT BE SPLIT
      *            BETWEEN 2 PAGES.
       01  ITEM-LINE-CTR                 PIC 999      VALUE ZERO.

      *----------  KEEPS TRACK OF WHERE TO PRINT VENDOR ADDRESS LINES
       01  ADDRESS-COUNT                 PIC 9(2)   VALUE ZEROES.

      *----------  SUBSCRIPT INTO VENDOR ADDRESS TABLE
       01  ADDR-SUB                      PIC 9(2)   VALUE ZEROES.

      *----------  VENDOR ADDRESS TABLE
       01  ADDRESS-TABLE.
           05  ADDRESS-TAB  OCCURS 1 TO 8  TIMES DEPENDING ON ADDR-SUB
                                         PIC X(44).
      *
      * FIELDS USED BY 920-FIND-POSITION PARAGRAPH
      *
       01  TOTAL-LENGTH                  PIC S9(3) VALUE 44 BINARY.
       01  FIND-POSITION.
           05  CHAR-POS OCCURS 44 TIMES  PIC X.

       01  PRINT-POSITION                PIC S9(3) BINARY.

      *
      * SAVE FIELDS USED IN PRINTING VENDOR ADDRESS
      *
       01  SAVE-ZIP-LOC-FLAG             PIC X.
           88  SAVE-ZIP-BEFORE-CITY    VALUE "1".
           88  SAVE-ZIP-AFTER-COUNTRY  VALUE "2".
       01  SAVE-ZIP                      PIC X(09).
       01  SAVE-STATE-CODE               PIC X(02).
       01  SAVE-PROV-CODE                PIC X(04).
      *


      **************************************************************
      **                   K S A M   W O R K                      **
      **************************************************************
       01  KEY-VALUE                     PIC X(8)  VALUE SPACES.
       01  KEY-LOC                       PIC S9(4) COMP VALUE 3.
       01  RECSIZE                       PIC S9(4) COMP VALUE ZEROS.
       01  RESULT                        PIC 9(4)  VALUE ZEROS.

       01  USAGE-REC.
           05  FILLER                    PIC XX.
           05  K-CORP-CODE               PIC X(8).
           05  K-MONTHS                              OCCURS 14 TIMES.
               10  K-MTH-USAGE           PIC S9(9) COMP-4.

       01  FILE-TABLE.
           05  FILENUMBER                PIC S9(4) COMP VALUE 0.
           05  FILENAME                  PIC X(8)  VALUE SPACES.
           05  I-O-TYPE                  PIC S9(4) COMP VALUE 0.
           05  A-MODE                    PIC S9(4) COMP VALUE 1.
           05  PREV-OP                   PIC S9(4) COMP VALUE 0.

       01  KSAM-STATUS.
           05  K-STAT-1                  PIC X.
           05  FILLER                    PIC X.
      **************************************************************
      *                 C A L L E D  R O U T I N E S               *
      **************************************************************
       COPY TBLOWUP IN COPYLIB.
       COPY CDESC IN COPYLIB.
       01  RET-CODE                      PIC X(2)  VALUE SPACES.
       01  VIEW-COMAREA.
           05  FILLER                    PIC X(118)  VALUE ALL "0".
           05  FILLER                    PIC S9(4)   COMP VALUE 9999.

       COPY TDATECHK IN COPYLIB.
       COPY OVRPFDATA IN COPYLIB.
       COPY CCHKOBJ   IN COPYLIB.
       COPY CATREAD   IN COPYLIB.
      *************************************************************
      *                      PRINT LINES                          *
      *************************************************************
       77  STRIP                         PIC X(5)  JUSTIFIED RIGHT.

       01  PRINT-LINE-WS.
           05  P-L-WS                    PIC X(132) VALUE SPACES.
           05  PRINT-PRIME-TITLE.
               10  FILLER                PIC X(2)   VALUE SPACES.
               10  NORMAL-1              PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(05)  VALUE SPACES.
               10  PRINT-TITLE1          PIC X(60)  VALUE SPACES.
               10  PRINT-TITLE2          PIC X(12)  VALUE SPACES.

           05  PRINT-PAGE-LINE.
               10  QUOTE-WORD            PIC X(7)   VALUE SPACES.
               10  PRNT-QUOTE-NO         PIC ZZZZZ9 VALUE ZEROES.
               10  PRNT-QUOTE  REDEFINES PRNT-QUOTE-NO PIC X(6).
               10  FILLER                PIC X(3)   VALUE SPACES.
               10  PRNT-TITLE2           PIC X(38)  VALUE SPACES.
               10  FILLER                PIC X(3)   VALUE SPACES.
               10  PRNT-DATE             PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(3)   VALUE SPACES.
               10  PRNT-PAGE1            PIC X(5)   VALUE SPACES.
               10  PRNT-PAGE             PIC ZZ9    VALUE SPACES.

           05  PRINT-REF-LINE.
               10  COMPRESS-21           PIC X(5)   VALUE SPACES.
               10  FILLER                PIC X(5)   VALUE SPACES.
               10  REF-WORD              PIC X(12)  VALUE SPACES.
               10  REF-NO                PIC ZZZ9   VALUE ZEROES.
               10  REF-NO-X REDEFINES REF-NO  PIC X(4).

           05  PRINT-COMPANY-LINE.
               10  NORMAL-2              PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(23)  VALUE SPACES.
               10  PRINT-COMPANY-NAME    PIC X(60)  VALUE SPACES.

           05  PRINT-PLANT-LINE.
               10  FILLER                PIC X(23)  VALUE SPACES.
               10  NORMAL-3              PIC X(8)   VALUE SPACES.
               10  PRINT-PLANT-NAME      PIC X(60)  VALUE SPACES.

           05  PRINT-PLANT-ADDR1-LINE.
               10  FILLER                PIC X(23)  VALUE SPACES.
               10  NORMAL-4              PIC X(8)   VALUE SPACES.
               10  PRINT-PLANT-ADDR1     PIC X(60)  VALUE SPACES.

           05  PRINT-PLANT-ADDR2-LINE.
               10  FILLER                PIC X(23)  VALUE SPACES.
               10  NORMAL-5              PIC X(8)   VALUE SPACES.
               10  PRINT-PLANT-ADDR2     PIC X(60)  VALUE SPACES.

           05  PRINT-LINE-NAME.
               10  COMPRESS-3            PIC X(5)   VALUE SPACES.
               10  PRT-VNAME             PIC X(15)  VALUE SPACES.
               10  FILLER                PIC X(2)   VALUE SPACES.
               10  NORMAL-6              PIC X(8)   VALUE SPACES.
               10  PRNT-VEND-NAME        PIC X(44)  VALUE SPACES.

           05  PRINT-LINE-ADDR1.
               10  COMPRESS-5            PIC X(5)   VALUE SPACES.
               10  PRT-ADDR              PIC X(15)  VALUE SPACES.
               10  FILLER                PIC X(2)   VALUE SPACES.
               10  NORMAL-7              PIC X(8)   VALUE SPACES.
               10  PRNT-VEND-ADDR1       PIC X(44)  VALUE SPACES.

           05  PRINT-EXP-DATE.
               10  NORMAL-8              PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(10)  VALUE SPACES.
               10  PRNT-VEND-ADDR2       PIC X(44)  VALUE SPACES.
               10  COMPRESS-2            PIC X(5)   VALUE SPACES.
               10  PRT-EXP-DATE          PIC X(21)  VALUE SPACES.
               10  UNDERLINE-ON-1        PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(19)  VALUE SPACES.
               10  UNDERLINE-OFF-1       PIC X(8)   VALUE SPACES.

           05  PRINT-LINE-DLVY.
               10  NORMAL-9              PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(10)  VALUE SPACES.
               10  PRNT-VEND-ADDR3       PIC X(44)  VALUE SPACES.
               10  COMPRESS-4            PIC X(5)   VALUE SPACES.
               10  PRT-DLY-TIME          PIC X(21)  VALUE SPACES.
               10  UNDERLINE-ON-2        PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(19)  VALUE SPACES.
               10  UNDERLINE-OFF-2       PIC X(8)   VALUE SPACES.
               10  PRNT-DAYS             PIC X(5)   VALUE SPACES.

           05  PRINT-LINE-FOB.
               10  NORMAL-12             PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(10)  VALUE SPACES.
               10  PRNT-VEND-ADDR4       PIC X(44)  VALUE SPACES.
               10  COMPRESS-5A           PIC X(5)   VALUE SPACES.
               10  PRT-FOB               PIC X(21)  VALUE SPACES.
               10  UNDERLINE-ON-3        PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(19)  VALUE SPACES.
               10  UNDERLINE-OFF-3       PIC X(8)   VALUE SPACES.

           05  PRINT-LINE-SPLC.
               10  NORMAL-13             PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(10)  VALUE SPACES.
               10  PRNT-VEND-ADDR5       PIC X(44)  VALUE SPACES.
               10  COMPRESS-7            PIC X(5)   VALUE SPACES.
               10  PRT-SPLC-1            PIC X(21)  VALUE SPACES.
               10  UNDERLINE-ON-4        PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(19)  VALUE SPACES.
               10  UNDERLINE-OFF-4       PIC X(8)   VALUE SPACES.

           05  PRINT-LINE-BILLING.
               10  NORMAL-14             PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(10)  VALUE SPACES.
               10  PRNT-VEND-ADDR6       PIC X(44)  VALUE SPACES.
               10  COMPRESS-9            PIC X(5)   VALUE SPACES.
               10  PRT-BILLING           PIC X(21)  VALUE SPACES.
               10  UNDERLINE-ON-5        PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(19)  VALUE SPACES.
               10  UNDERLINE-OFF-5       PIC X(8)   VALUE SPACES.

           05  PRINT-LINE-CURRENC.
               10  NORMAL-20             PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(10)  VALUE SPACES.
               10  PRNT-VEND-ADDR7       PIC X(44)  VALUE SPACES.
               10  COMPRESS-1            PIC X(5)   VALUE SPACES.
               10  PRT-CURRENC           PIC X(21)  VALUE SPACES.
               10  UNDERLINE-ON-19       PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(19)  VALUE SPACES.
               10  UNDERLINE-OFF-19      PIC X(8)   VALUE SPACES.

           05  PRINT-LINE-MIN.
               10  NORMAL-10             PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(10)  VALUE SPACES.
               10  PRNT-VEND-ADDR8       PIC X(44)  VALUE SPACES.
               10  COMPRESS-11           PIC X(5)   VALUE SPACES.
               10  PRT-MIN               PIC X(21)  VALUE SPACES.
               10  PRT-CURR              PIC X      VALUE SPACES.
               10  UNDERLINE-ON-6        PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(19)  VALUE SPACES.
               10  UNDERLINE-OFF-6       PIC X(8)   VALUE SPACES.

           05  PRINT-LINE-PHONE.
               10  NORMAL-11             PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(54)  VALUE SPACES.
               10  COMPRESS-13           PIC X(5)   VALUE SPACES.
               10  PRT-VPHONE            PIC X(21)  VALUE SPACES.
               10  UNDERLINE-ON-7        PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(19)  VALUE SPACES.
               10  UNDERLINE-OFF-7       PIC X(8)   VALUE SPACES.
               10  COMPRESS-9-OFF        PIC X(5).

           05  PRINT-LINE-CONTACT.
               10  EXPAND-5              PIC X(5)   VALUE SPACES.
               10  FILLER                PIC X(27)  VALUE SPACES.
               10  EXPAND-6-OFF          PIC X(5).
               10  COMPRESS-15           PIC X(5)   VALUE SPACES.
               10  PRT-CONTACT           PIC X(21)  VALUE SPACES.
               10  UNDERLINE-ON-8        PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(19)  VALUE SPACES.
               10  UNDERLINE-OFF-8       PIC X(8)   VALUE SPACES.
               10  COMPRESS-5-OFF        PIC X(5).

           05  PRINT-LINE-REF.
               10  EXPAND-6              PIC X(5)   VALUE SPACES.
               10  FILLER                PIC X(27)  VALUE SPACES.
               10  EXPAND-7-OFF          PIC X(5).
               10  COMPRESS-17           PIC X(5)   VALUE SPACES.
               10  PRT-REF               PIC X(21)  VALUE SPACES.
               10  UNDERLINE-ON-9        PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(19)  VALUE SPACES.
               10  UNDERLINE-OFF-9       PIC X(8)   VALUE SPACES.
               10  COMPRESS-6-OFF        PIC X(5).

           05  PRINT-LINE-VCODE.
               10  EXPAND-7              PIC X(5)   VALUE SPACES.
               10  FILLER                PIC X(27)  VALUE SPACES.
               10  EXPAND-8-OFF          PIC X(5).
               10  COMPRESS-19           PIC X(5)   VALUE SPACES.
               10  PRT-VCODE             PIC X(21)  VALUE SPACES.
               10  PRNT-VEND-CODE        PIC X(10)  VALUE SPACES.
               10  COMPRESS-7-OFF        PIC X(5).

           05  PRINT-TELEX-LINE.
               10  EXPAND-8              PIC X(5)   VALUE SPACES.
               10  FILLER                PIC X(27)  VALUE SPACES.
               10  EXPAND-9-OFF          PIC X(5).
               10  COMPRESS-20           PIC X(5)   VALUE SPACES.
               10  PRT-TELEX             PIC X(21)  VALUE SPACES.
               10  UNDERLINE-ON-10       PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(19)  VALUE SPACES.
               10  UNDERLINE-OFF-10      PIC X(8)   VALUE SPACES.
               10  COMPRESS-8-OFF        PIC X(5).

           05  PRINT-LINE-VENFAX.
               10  EXPAND-12             PIC X(5)   VALUE SPACES.
               10  FILLER                PIC X(27)  VALUE SPACES.
               10  EXPAND-12-OFF         PIC X(5).
               10  COMPRESS-14           PIC X(5)   VALUE SPACES.
               10  PRT-VENFAX            PIC X(21)  VALUE SPACES.
               10  UNDERLINE-ON-26       PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(19)  VALUE SPACES.
               10  UNDERLINE-OFF-26      PIC X(8)   VALUE SPACES.
               10  COMPRESS-14-OFF       PIC X(5).

           05  PRINT-TEXT-LINE-1.
               10  NORMAL-15             PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(5)   VALUE SPACES.
               10  TEXT1                 PIC X(72)  VALUE SPACES.

           05  PRINT-TEXT-LINE-6.
               10  NORMAL-22             PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(15)  VALUE SPACES.
               10  PRT-RETURN            PIC X(50)  VALUE SPACES.
               10  FILLER                PIC X(1)   VALUE SPACES.
               10  PRT-RDATE             PIC X(8)   VALUE SPACES.

           05  PRINT-TITLE-LINE-1.
               10  NORMAL-30             PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(24)  VALUE SPACES.
               10  COMPRESS-22           PIC X(5)   VALUE SPACES.
               10  FILLER                PIC X(3)   VALUE SPACES.
               10  PRT-NET               PIC X(10)  VALUE SPACES.
               10  FILLER                PIC X(44)  VALUE SPACES.
               10  PRT-PRICE             PIC X(34)  VALUE SPACES.

           05  PRINT-TITLE-LINE-2.
               10  COMPRESS-23           PIC X(5)   VALUE SPACES.
               10  FILLER                PIC X(28)  VALUE SPACES.
               10  PRT-HEAD1A            PIC X(57)  VALUE SPACES.
               10  FILLER                PIC X(08)  VALUE SPACES.
               10  PRT-HEAD1B            PIC X(30)  VALUE SPACES.

           05  PRINT-TITLE-LINE-2A.
               10  NORMAL-25             PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(40)  VALUE SPACES.
               10  COMPRESS-28           PIC X(5)   VALUE SPACES.
               10  FILLER                PIC X(56)  VALUE SPACES.
               10  PRT-CURRENCY          PIC X(12)  VALUE SPACES.

           05  PRINT-TITLE-LINE-3.
               10  NORMAL-16             PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(2)   VALUE SPACES.
               10  PRT-ITEM-CODE         PIC X(9)   VALUE SPACES.

           05  PRINT-TITLE-LINE-3A.
               10  NORMAL-24             PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(17)  VALUE SPACES.
               10  COMPRESS-24           PIC X(5)   VALUE SPACES.
               10  FILLER                PIC X(1)   VALUE SPACES.
               10  PRT-HEAD2A            PIC X(52)  VALUE SPACES.
               10  FILLER                PIC X(11)  VALUE SPACES.
               10  COMPRESS-10-OFF       PIC X(5).

           05  PRINT-TITLE-LINE-3B.
               10  EXPAND-3              PIC X(5)   VALUE SPACES.
               10  FILLER                PIC X(27)  VALUE SPACES.
               10  EXPAND-10-OFF         PIC X(5).
               10  COMPRESS-18           PIC X(5)   VALUE SPACES.
               10  PRT-HEAD2B            PIC X(45)  VALUE SPACES.
           05  PRINT-TITLE-LINE-4.
               10  COMPRESS-25           PIC X(5)   VALUE SPACES.
               10  FILLER                PIC X(5)   VALUE SPACES.
               10  PRT-DESC-CODE         PIC X(30)  VALUE SPACES.

           05  PRINT-CORP-CODE.
               10  NORMAL-17             PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(2)   VALUE SPACES.
               10  PRNT-CORP-CODE        PIC X(7)   VALUE SPACES.
               10  FILLER                PIC X(10)  VALUE SPACES.

           05  PRINT-NONCODED-ITEM.
               10  NORMAL-21             PIC X(8).
               10  FILLER                PIC X(2)   VALUE SPACES.
               10  PRNT-NC-ITEM          PIC 9(4).
               10  FILLER                PIC X(3)   VALUE SPACES.
               10  PRNT-NC-LIT           PIC X(10).

           05  PRINT-DATA-LINE-1.
               10  NORMAL-23             PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(18)  VALUE SPACES.
               10  COMPRESS-27           PIC X(5)   VALUE SPACES.
MM6224         10  PRNT-ANNUAL           PIC --------9  VALUE ZEROS.
               10  PRNT-ANNUAL-R     REDEFINES PRNT-ANNUAL PIC X(9).
MM6224         10  PRNT-USAGE            PIC Z(8)9  VALUE ZEROS.
               10  PRNT-USAGE-R     REDEFINES PRNT-USAGE PIC X(9).
               10  FILLER                PIC X(4)   VALUE SPACES.
               10  PRNT-STR-UM           PIC X(2)   VALUE SPACES.
               10  FILLER                PIC X(3)   VALUE SPACES.
               10  UNDERLINE-ON-11       PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(11)  VALUE SPACES.
               10  UNDERLINE-OFF-11      PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(1)   VALUE SPACES.
               10  UNDERLINE-ON-12       PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(4)   VALUE SPACES.
               10  UNDERLINE-OFF-12      PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(3)   VALUE SPACES.
               10  PRNT-EFF-DATE         PIC X(8)   VALUE SPACES.
               10  COMPRESS-11-OFF       PIC X(5).

            05  PRINT-DATA-PART2.
               10  EXPAND-9              PIC X(5)   VALUE SPACES.
               10  FILLER                PIC X(27)  VALUE SPACES.
               10  EXPAND-1-OFF          PIC X(5).
               10  COMPRESS-32           PIC X(5)   VALUE SPACES.
               10  UNDERLINE-ON-13       PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(11)  VALUE SPACES.
               10  UNDERLINE-OFF-13      PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X      VALUE SPACE.
               10  UNDERLINE-ON-14       PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(11)   VALUE SPACES.
               10  UNDERLINE-OFF-14      PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X      VALUE SPACES.
               10  COMPRESS-1-OFF        PIC X(5)   VALUE SPACES.
            05  PRINT-DATA-PART3.
               10  EXPAND-1              PIC X(5)   VALUE SPACES.
               10  FILLER                PIC X(35)  VALUE SPACES.
               10  EXPAND-2-OFF          PIC X(5).
               10  COMPRESS-6            PIC X(5)   VALUE SPACES.
               10  UNDERLINE-ON-15       PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(4)   VALUE SPACES.
               10  UNDERLINE-OFF-15      PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X      VALUE SPACES.
               10  UNDERLINE-ON-16       PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(11)  VALUE SPACES.
               10  UNDERLINE-OFF-16      PIC X(8)   VALUE SPACES.

           05  PRINT-CODE-DESCRIPTION.
               10  COMPRESS-26           PIC X(5)   VALUE SPACES.
               10  FILLER                PIC X(5)   VALUE SPACES.
               10  PRNT-CODE-DESC        PIC X(80)  VALUE SPACES.
               10  COMPRESS-2-OFF        PIC X(5).

           05  PRINT-CODE-DESC2.
               10  EXPAND-10             PIC X(5)   VALUE SPACES.
               10  FILLER                PIC X(27)  VALUE SPACES.
               10  EXPAND-3-OFF          PIC X(5).
               10  COMPRESS-8            PIC X(5)   VALUE SPACES.
               10  UNDERLINE-ON-22       PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(11)  VALUE SPACES.
               10  UNDERLINE-OFF-22      PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X      VALUE SPACE.
               10  UNDERLINE-ON-23       PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(11)   VALUE SPACES.
               10  UNDERLINE-OFF-23      PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X      VALUE SPACES.
               10  COMPRESS-3-OFF        PIC X(5).
          05  PRINT-CODE-DESC3.
              10  EXPAND-11              PIC X(5)  VALUE SPACES.
              10  FILLER                 PIC X(35) VALUE SPACES.
               10  EXPAND-4-OFF          PIC X(5).
               10  COMPRESS-12           PIC X(5)   VALUE SPACES.
               10  UNDERLINE-ON-24       PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(4)   VALUE SPACES.
               10  UNDERLINE-OFF-24      PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X      VALUE SPACES.
               10  UNDERLINE-ON-25       PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(11)  VALUE SPACES.
               10  UNDERLINE-OFF-25      PIC X(8)   VALUE SPACES.

           05  PRINT-SHIP.
               10  COMPRESS-29           PIC X(5)   VALUE SPACES.
               10  FILLER                PIC X(7)   VALUE SPACES.
               10  PRT-SHIP2             PIC X(24)  VALUE SPACES.
               10  UNDERLINE-ON-17       PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(30)  VALUE SPACES.
               10  UNDERLINE-OFF-17      PIC X(8)   VALUE SPACES.

           05  PRINT-PRICE-FORMAT.
               10  COMPRESS-30           PIC X(5)   VALUE SPACES.
               10  FILLER                PIC X(7)   VALUE SPACES.
               10  PRT-FREE              PIC X(24)  VALUE SPACES.
               10  COMPRESS-4-OFF        PIC X(5).
               10  EXPAND-2              PIC X(5)   VALUE SPACES.
               10  UNDERLINE-ON-18       PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(25)  VALUE SPACES.
               10  UNDERLINE-OFF-18      PIC X(8)   VALUE SPACES.
               10  EXPAND-5-OFF          PIC X(5).

           05  PRINT-BUYER.
               10  NORMAL-18             PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(17)  VALUE SPACES.
               10  PRT-BUYER             PIC X(22)  VALUE SPACES.
               10  FILLER                PIC X(5)   VALUE SPACES.
               10  PRNT-BUYER-NAME       PIC X(15)  VALUE SPACES.
               10  PRNT-BUYER-PHONE      PIC X(26)  VALUE SPACES.

           05  PRINT-PURCHASING.
               10  FILLER                PIC X(17)  VALUE SPACES.
               10  NORMAL-19             PIC X(8)   VALUE SPACES.
               10  PRT-DEPT              PIC X(22)  VALUE SPACES.
               10  FILLER                PIC X(1)   VALUE SPACES.
               10  PRT-PHONE             PIC X(12)  VALUE SPACES.
               10  FILLER                PIC X(6)   VALUE "  FAX ".
               10  PRT-FAX               PIC X(12)  VALUE SPACES.

           05  PRINT-VENDOR-SIGNATURE-LINE.
               10  FILLER                PIC X(2)   VALUE SPACES.
               10  PRT-VSIG              PIC X(20)  VALUE SPACES.
               10  UNDERLINE-ON-20       PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(15)  VALUE SPACES.
               10  UNDERLINE-OFF-20      PIC X(8)   VALUE SPACES.

           05  PRINT-DATE-LINE.
               10  FILLER                PIC X(2)   VALUE SPACES.
               10  PRT-DSIG              PIC X(20)  VALUE SPACES.
               10  UNDERLINE-ON-21       PIC X(8)   VALUE SPACES.
               10  FILLER                PIC X(15)  VALUE SPACES.
               10  UNDERLINE-OFF-21      PIC X(8)   VALUE SPACES.

       COPY DBMODES IN COPYLIB.
       COPY DBSTAT  IN COPYLIB.

       01  DATABASE-ARGS.
           03  CORP-ARG                  PIC X(8)    VALUE SPACES.
           03  VEN-ARG                   PIC X(10)   VALUE SPACES.
           03  BUYER-ARG                 PIC X(4)    VALUE SPACES.
           03  PLT-ARG                   PIC X(4)    VALUE SPACES.
           03  QUOTE-ARG                 PIC X(10)   VALUE SPACES.
           03  STANDARD-ARG            PIC X(10)   VALUE "STAND     ".
           03  REQ-ARG                   PIC X(12)   VALUE SPACES.
           03  UM-ARG                    PIC X(2)    VALUE SPACES.

       COPY MPLT0     IN COPYLIB.
       COPY MPLTQTH4  IN COPYLIB.
       COPY MBUYER    IN COPYLIB.
       COPY DVENDOR   IN COPYLIB.
       COPY MSTORERM  IN COPYLIB.
       COPY DQUOTEXT  IN COPYLIB.
       COPY DDESC     IN COPYLIB.
       COPY DREQDESC  IN COPYLIB.
       COPY DVENDITM  IN COPYLIB.
       COPY MVALIDUM  IN COPYLIB.
       COPY ESCNAM2   IN COPYLIB.

       LINKAGE SECTION.
       01  QUOTE-NUM                     PIC X(10).
       01  SPOOL-PRT-NO                  PIC S9(2) COMP-4.
       COPY LANGSUB IN COPYLIB.
       01 BASE                           PIC X(10).
       01  PASS-PLANT-CODE.
           05  KELLY-PLANT-CHECK         PIC X.
           05  FILLER                    PIC X(2).
      **************************************************************
      *        P R O C E D U R E        D I V I S I O N            *
      **************************************************************
       PROCEDURE DIVISION USING QUOTE-NUM,
                                SPOOL-PRT-NO
                                LANGUAGE-PARMS,
                                BASE,
                                PASS-PLANT-CODE.
       00-MAIN.

           MOVE "CQTPRT" TO BU-PGM-NAME.
      *----- INITIALIZE THOSE VARIABLES WHICH HAVE VALUE CLAUSES
      *----- IN WORKING-STORAGE, BUT ARE "NOT ALWAYS" CHANGED LATER
      *----- IN THE PROCEDURE DIVISION.  CANNOT RELY ON VALUE
      *----- CLAUSES IN WORKING-STORAGE FOR AN AS/400 SUBPROGRAM.
           MOVE 0 TO PAGE-NUM
                     DISCOUNT-CTR
                     LINE-CTR
                     X.
           MOVE ZEROES TO SUB
                          YTD-TOTAL
                          ITEM-LINE-CTR
                          ADDRESS-COUNT
                          ADDR-SUB.
           MOVE "0" TO QUOTE-EXISTS.
           MOVE SPACES TO ADDRESS-TABLE
                          PRNT-VEND-NAME
                          PRNT-VEND-ADDR1
                          PRNT-VEND-ADDR2
                          PRNT-VEND-ADDR3
                          PRNT-VEND-ADDR4
                          PRNT-VEND-ADDR5
                          PRNT-VEND-ADDR6
                          PRNT-VEND-ADDR7
                          PRNT-VEND-ADDR8
                          PRNT-VEND-CODE
                          PRT-CURRENCY.
           PERFORM 040-OPEN-SPOOLFILE THRU 049-EXIT.
           PERFORM 020-GET-FIRST-ITEM THRU 029-EXIT.
           IF NO-QUOTE
              PERFORM 050-CLOSE-SPOOLFILE THRU 059-EXIT
              GO TO 09-EXIT.

           PERFORM 030-READ-LITERALS THRU 039-EXIT.
           PERFORM 100-PRINT-BEGINNING THRU 109-EXIT.
           PERFORM 200-PRINT-QUOTE THRU 299-EXIT.
           PERFORM 810-END-OF-QUOTE THRU 819-EXIT.
           PERFORM 050-CLOSE-SPOOLFILE THRU 059-EXIT.
       09-EXIT.  GOBACK.

       020-GET-FIRST-ITEM.

      *----------  GET CORRECT DATE FORMAT
           MOVE 1 TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT TO PRNT-DATE.

           MOVE QUOTE-NUM TO QUOTE-ARG, QUOTE-WS.
           MOVE 0 TO COND-WORD.
           MOVE QUOTE-ARG TO QUOTENUM OF DVENDITM3-REC-I.
           START DVENDITM3-I KEY = QUOTENUM OF DVENDITM3-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF NO-ENTRY
              MOVE 1 TO QUOTE-EXISTS
              GO TO 029-EXIT.
           IF NOT GOOD-CALL
              MOVE "DBFIND DVENDITM AT 100 IN CQTPRT" TO BU-DISPLAY-MSG
              MOVE QUOTE-ARG TO BU-DISPLAY-FLD (1)
              PERFORM 990-BLOWUP THRU 999-EXIT.

           MOVE 0 TO COND-WORD.
           READ DVENDITM3-I NEXT INTO BUF-DVENDITM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF QUOTENUM OF DVENDITM3-REC-I NOT = QUOTE-ARG
               MOVE 15 TO COND-WORD.
           IF END-OF-CHAIN
              MOVE 1 TO QUOTE-EXISTS
              GO TO 029-EXIT.
           IF NOT GOOD-CALL
              MOVE "DBGET DVENDITM AT 105 IN CQTPRT" TO BU-DISPLAY-MSG
              MOVE QUOTE-ARG TO BU-DISPLAY-FLD (1)
              PERFORM 990-BLOWUP THRU 999-EXIT.

           MOVE VEN-ITM-VENCODE TO VEN-ARG.
       029-EXIT.  EXIT.
       030-READ-LITERALS.
           CALL "TESCSEQ" USING ESC-NAME.
           MOVE CHAR-1636PI TO STRIP.
           MOVE STRIP       TO COMPRESS-1,  COMPRESS-2,  COMPRESS-3,
                               COMPRESS-4,  COMPRESS-5,  COMPRESS-6
                               COMPRESS-7,  COMPRESS-8,  COMPRESS-9,
                                            COMPRESS-11,  COMPRESS-12
                               COMPRESS-13, COMPRESS-14, COMPRESS-15,
                                            COMPRESS-17, COMPRESS-18,
                               COMPRESS-19, COMPRESS-20, COMPRESS-21
                              COMPRESS-22,  COMPRESS-23, COMPRESS-24,
                               COMPRESS-25, COMPRESS-26, COMPRESS-27,
                               COMPRESS-5A, COMPRESS-28, COMPRESS-29,
                               COMPRESS-30, COMPRESS-32.

           MOVE CHAR-10PI   TO NORMAL-1,    NORMAL-2,    NORMAL-3,
                               NORMAL-4,    NORMAL-5,    NORMAL-6,
                               NORMAL-7,    NORMAL-8,    NORMAL-9,
                               NORMAL-10,   NORMAL-11,   NORMAL-12,
                               NORMAL-13,   NORMAL-14,   NORMAL-15,
                               NORMAL-16,   NORMAL-17,   NORMAL-18,
                               NORMAL-19,   NORMAL-20,   NORMAL-21,
                               NORMAL-22,   NORMAL-23,  NORMAL-24,
                               NORMAL-25,   NORMAL-30   STRIP.
           MOVE STRIP TO       COMPRESS-1-OFF,  COMPRESS-2-OFF,
                               COMPRESS-3-OFF,  COMPRESS-4-OFF,
                               COMPRESS-5-OFF,  COMPRESS-6-OFF,
                               COMPRESS-7-OFF,  COMPRESS-8-OFF,
                               COMPRESS-9-OFF,  COMPRESS-10-OFF,
                               COMPRESS-11-OFF, COMPRESS-14-OFF.
           MOVE CHAR-5PI   TO  STRIP.
           MOVE STRIP      TO  EXPAND-2, EXPAND-5, EXPAND-6, EXPAND-7,
                               EXPAND-8, EXPAND-9, EXPAND-1, EXPAND-10,
                               EXPAND-3, EXPAND-11, EXPAND-12.
           MOVE IBM-DOUBLE-WIDE-OFF TO STRIP.
           MOVE STRIP TO        EXPAND-1-OFF,  EXPAND-2-OFF,
                                EXPAND-3-OFF,  EXPAND-4-OFF,
                                EXPAND-5-OFF,  EXPAND-6-OFF,
                                EXPAND-7-OFF,  EXPAND-8-OFF,
                                EXPAND-9-OFF,  EXPAND-10-OFF,
                                EXPAND-12-OFF.

           MOVE UNDERLINE-ON TO UNDERLINE-ON-1,   UNDERLINE-ON-2,
                                UNDERLINE-ON-3,   UNDERLINE-ON-4,
                                UNDERLINE-ON-5,   UNDERLINE-ON-6,
                                UNDERLINE-ON-7,   UNDERLINE-ON-8,
                                UNDERLINE-ON-9,   UNDERLINE-ON-10,
                                UNDERLINE-ON-11,  UNDERLINE-ON-12,
                                UNDERLINE-ON-13,  UNDERLINE-ON-14,
                                UNDERLINE-ON-15,  UNDERLINE-ON-16,
                                UNDERLINE-ON-17,  UNDERLINE-ON-18,
                                UNDERLINE-ON-19,  UNDERLINE-ON-20,
                                UNDERLINE-ON-21,  UNDERLINE-ON-22,
                                UNDERLINE-ON-23,  UNDERLINE-ON-24,
                                UNDERLINE-ON-25,  UNDERLINE-ON-26.

           MOVE UNDERLINE-OFF  TO UNDERLINE-OFF-1,   UNDERLINE-OFF-2,
                                  UNDERLINE-OFF-3,   UNDERLINE-OFF-4,
                                  UNDERLINE-OFF-5,   UNDERLINE-OFF-6,
                                  UNDERLINE-OFF-7,   UNDERLINE-OFF-8,
                                  UNDERLINE-OFF-9,   UNDERLINE-OFF-10,
                                  UNDERLINE-OFF-11,  UNDERLINE-OFF-12,
                                  UNDERLINE-OFF-13,  UNDERLINE-OFF-14,
                                  UNDERLINE-OFF-15,  UNDERLINE-OFF-16,
                                  UNDERLINE-OFF-17,  UNDERLINE-OFF-18,
                                  UNDERLINE-OFF-19,  UNDERLINE-OFF-20,
                                  UNDERLINE-OFF-21,  UNDERLINE-OFF-22,
                                  UNDERLINE-OFF-23,  UNDERLINE-OFF-24,
                                  UNDERLINE-OFF-25,  UNDERLINE-OFF-26.


           MOVE "CQTPRT"                    TO BU-PGM-NAME.

      *----------  READ IN QUOTE SHEET LITERALS
           MOVE 60                      TO LANG-SETNUM.
           MOVE 1                       TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRNT-PAGE1.
           MOVE 2                       TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRNT-TITLE2.
           MOVE 3                       TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-VNAME.
           MOVE 4                       TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-ADDR.
           MOVE 5                       TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-DLY-TIME.
           MOVE 6                       TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-FOB.
           MOVE 7                       TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-BILLING.
           MOVE 8                       TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-MIN.
           MOVE 9                       TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-VPHONE.
           MOVE 10                      TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-CONTACT.
           MOVE 11                      TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-REF.
           MOVE 12                      TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-VCODE.
           MOVE 13                      TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-RETURN.
           MOVE 14                      TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-ITEM-CODE.
           MOVE 15                      TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-DESC-CODE.
           MOVE 16                      TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-PRICE.
           MOVE 17                      TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-NET.
           MOVE 18                      TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-HEAD1A.
           MOVE 19                      TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-HEAD2A.
           MOVE 20                      TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-HEAD1B.
           MOVE 21                      TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-HEAD2B.
           MOVE 22                      TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-SHIP2.
           MOVE 23                      TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-FREE.
      *    MOVE 24                      TO LANG-MSGNUM.
      *    PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
      *    MOVE MESSAGE-BUFFER          TO PRINT-TITLE.
           MOVE 25                      TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-TELEX.
           MOVE 26                      TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-BUYER.
           IF KELLY-PLANT-CHECK = "2"
              MOVE "KELLY BUYER "       TO PRT-BUYER.
           MOVE 27                      TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-DEPT.
           MOVE 28                      TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-VSIG.
           MOVE 29                      TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-DSIG.
           MOVE 30                      TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-CURR.
           MOVE 31                      TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO QUOTE-WORD.
           MOVE 32                      TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-EXP-DATE.
           MOVE 33                      TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-SPLC-1.
           MOVE 34                      TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRNT-NC-LIT.
           MOVE 35                      TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRNT-DAYS.
           MOVE 36                      TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO WS-REQ-LIT.
           MOVE 45                      TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO REF-WORD.
           IF KELLY-PLANT-CHECK = "2"
              MOVE "KELLY REQUISITION NUMBER " TO WS-REQ-LIT.
           MOVE 46                      TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-CURRENC.
           MOVE 47                      TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO PRT-VENFAX.
       039-EXIT.  EXIT.
       040-OPEN-SPOOLFILE.
      *----------  OPEN OUTPUT FILE
           MOVE SPOOL-PRT-NO TO OVRPRTF-TOFILE-NUM.
           MOVE "MCPRT"      TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT ONLINE-PRT.

           OPEN INPUT DVENDOR-I MSTORERM-I MVALIDUM-I
                      DVENDITM3-I USAGEFIL-I
                      MPLTINFO-I
                      MBUYER-I DREQITM-I DREQDESC-I DQUOTEXT-I.

       049-EXIT.  EXIT.
       050-CLOSE-SPOOLFILE.

           CLOSE DVENDOR-I MSTORERM-I MVALIDUM-I DVENDITM3-I USAGEFIL-I
                 MPLTINFO-I MBUYER-I DREQITM-I DREQDESC-I DQUOTEXT-I.
           CLOSE ONLINE-PRT.
       059-EXIT.  EXIT.



      *************************************************************
      *************************************************************
      *      RETRIEVE ALL NECESSARY INFORMATION FROM THE          *
      *      DATABASE AND FILL IN THE QUOTE SHEET.                *
      *************************************************************
      *************************************************************
       100-PRINT-BEGINNING.
           MOVE VEN-BUYER-CODE TO BUYER-ARG.
           MOVE SPACES TO PRT-FAX-NUMBER PRT-QUOTE-REF HOLD-FAX.
           MOVE 0 TO COND-WORD.
           MOVE BUYER-ARG TO BUYERCDE OF MBUYER-REC-I.
           READ MBUYER-I INTO BUF-MBUYER
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF NO-ENTRY
              MOVE "_______________"          TO PRNT-BUYER-NAME
           ELSE
              IF NOT GOOD-CALL
                 MOVE "DBGET MBUYER FAILED AT 240 IN CQTPRT"
                       TO BU-DISPLAY-MSG
                 PERFORM 990-BLOWUP THRU 999-EXIT
              ELSE
                 MOVE BUYER-NAME              TO PRNT-BUYER-NAME
                 MOVE BUYER-PHONE-NO          TO PRNT-BUYER-PHONE.
           MOVE WORK-QUOTE            TO PRNT-QUOTE-NO.
      *************************************************************
      *    LOOP THROUGH DVENDOR DATASET TO GET VENDOR NAME        *
      *    AND ADDRESS.                                           *
      *************************************************************
      *----------  FIND DVENDOR TO GET VENDOR NAME AND ADDRESS
           MOVE 0 TO COND-WORD, ADDR-SUB, ADDRESS-COUNT.
           MOVE VEN-ARG TO VENCDE OF DVENDOR-REC-I.
           START DVENDOR-I KEY = VENCDE OF DVENDOR-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF NO-ENTRY
              GO TO 104-MOVE-VENDOR-ADDRESS.
           IF NOT GOOD-CALL
               MOVE "DBFIND DVENDOR AT 100 IN CQTPRT" TO BU-DISPLAY-MSG
               MOVE VEN-ARG TO BU-DISPLAY-FLD (1)
               PERFORM 990-BLOWUP THRU 999-EXIT.

      *----------  GET VENDOR NAME AND ADDRESS
       102-GET-NAME-ADDR-VENDOR.
           MOVE 0 TO COND-WORD.
           READ DVENDOR-I NEXT INTO BUF-DVENDOR
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF VENCDE OF DVENDOR-REC-I NOT = VEN-ARG
               MOVE 15 TO COND-WORD.

           IF GOOD-CALL
               IF VEN-ITM-NO = "00"
                   MOVE VEN-ITM-DATA          TO PRNT-VEND-NAME
               ELSE
               IF VEN-ITM-NO = "01" OR "02" OR "03" OR "04" OR
                               "05" OR "06"
                   ADD 1                      TO ADDR-SUB, ADDRESS-COUNT
                   MOVE VEN-ITM-DATA          TO ADDRESS-TAB (ADDR-SUB)
               ELSE
               IF VEN-ITM-NO = "07"
                   ADD 1 TO ADDR-SUB, ADDRESS-COUNT
      *
      * 920-FIND-POSITION RETURNS THE POSITION TO PRINT THE NEXT ITEM
      * IN PRINT-POSITION
      *
                   IF ZIP-BEFORE-CITY

      *
      * ZIP CITY
      *
                     SET SAVE-ZIP-BEFORE-CITY TO TRUE
                     MOVE VEN-ZIP TO FIND-POSITION
                     PERFORM 920-FIND-POSITION
                     STRING VEN-CITY
                       DELIMITED BY SIZE INTO FIND-POSITION
                       WITH POINTER PRINT-POSITION
                     MOVE VEN-STATE-CODE TO SAVE-STATE-CODE
                     MOVE VEN-PROV-CODE TO SAVE-PROV-CODE

                   ELSE

      *
      * CITY STATE PROVINCE
      *
                     SET SAVE-ZIP-AFTER-COUNTRY TO TRUE
                     MOVE VEN-CITY TO FIND-POSITION
                     PERFORM 920-FIND-POSITION
                     STRING VEN-STATE-CODE
                       DELIMITED BY SIZE INTO FIND-POSITION
                       WITH POINTER PRINT-POSITION
                     PERFORM 920-FIND-POSITION
                     STRING VEN-PROV-CODE
                       DELIMITED BY SIZE INTO FIND-POSITION
                       WITH POINTER PRINT-POSITION
                     MOVE VEN-ZIP TO SAVE-ZIP

                   END-IF
                   MOVE FIND-POSITION TO ADDRESS-TAB(ADDR-SUB)

154500       ELSE
154600       IF VEN-ITM-NO = 8
               ADD 1 TO ADDR-SUB, ADDRESS-COUNT
               IF SAVE-ZIP-BEFORE-CITY

      *
      * STATE PROV COUNTRY
      *
                 MOVE SAVE-STATE-CODE TO FIND-POSITION
                 PERFORM 920-FIND-POSITION
                 STRING SAVE-PROV-CODE
                   DELIMITED BY SIZE INTO FIND-POSITION
                   WITH POINTER PRINT-POSITION
                 PERFORM 920-FIND-POSITION
                 STRING VEN-COUNTRY
                   DELIMITED BY SIZE INTO FIND-POSITION
                   WITH POINTER PRINT-POSITION

               ELSE

      *
      * COUNTRY ZIP
      *
                 MOVE VEN-COUNTRY TO FIND-POSITION
                 PERFORM 920-FIND-POSITION
                 STRING SAVE-ZIP DELIMITED BY SIZE
                   INTO FIND-POSITION WITH POINTER PRINT-POSITION

               END-IF
               MOVE FIND-POSITION TO ADDRESS-TAB(ADDR-SUB)

             ELSE
             IF VEN-ITM-NO = "10"
               MOVE VEN-FAX TO HOLD-FAX
               IF HOLD-FAX-1 = "+"
                 MOVE HOLD-FAX-2-AND-ON TO PRT-FAX-NUMBER
               END-IF
               IF VEN-CC NOT = SPACES
                 PERFORM 800-CURRENCY THRU 809-EXIT.

           IF NOT GOOD-CALL
                IF COND-WORD = 15
                    MOVE VEN-ITM-VENCODE      TO PRNT-VEND-CODE
                    MOVE 0                    TO ADDR-SUB
                    GO TO 104-MOVE-VENDOR-ADDRESS
                ELSE
                    MOVE "DBGET AT 102 IN CQTPRT" TO BU-DISPLAY-MSG
                    PERFORM 990-BLOWUP THRU 999-EXIT.

           GO TO 102-GET-NAME-ADDR-VENDOR.

      *----------  MOVE VENDOR ADDRESS TO PRINT LINES
       104-MOVE-VENDOR-ADDRESS.
           IF ADDR-SUB = ADDRESS-COUNT
               MOVE SPACES                    TO ADDRESS-TABLE
               GO TO 106-PRINT-VENDOR-AND-TEXT.

           ADD 1                              TO ADDR-SUB.

           IF ADDR-SUB = 1
               MOVE ADDRESS-TAB (ADDR-SUB)    TO PRNT-VEND-ADDR1
           ELSE
           IF ADDR-SUB = 2
               MOVE ADDRESS-TAB (ADDR-SUB)    TO PRNT-VEND-ADDR2
           ELSE
           IF ADDR-SUB = 3
               MOVE ADDRESS-TAB (ADDR-SUB)    TO PRNT-VEND-ADDR3
           ELSE
           IF ADDR-SUB = 4
               MOVE ADDRESS-TAB (ADDR-SUB)    TO PRNT-VEND-ADDR4
           ELSE
           IF ADDR-SUB = 5
               MOVE ADDRESS-TAB (ADDR-SUB)    TO PRNT-VEND-ADDR5
           ELSE
           IF ADDR-SUB = 6
               MOVE ADDRESS-TAB (ADDR-SUB)    TO PRNT-VEND-ADDR6
           ELSE
           IF ADDR-SUB = 7
               MOVE ADDRESS-TAB (ADDR-SUB)    TO PRNT-VEND-ADDR7
           ELSE
           IF ADDR-SUB = 8
               MOVE ADDRESS-TAB (ADDR-SUB)    TO PRNT-VEND-ADDR8.

           GO TO 104-MOVE-VENDOR-ADDRESS.
      *************************************************************
      *          FIND PLANT NAME AND PLANT ADDRESS                *
      *************************************************************
       106-PRINT-VENDOR-AND-TEXT.
      *---------- GET GOODYEAR NAME AND ADDRESS
           MOVE "P 00"                         TO PLT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF COND-WORD = ZERO
              MOVE MPLTINFO-DATA              TO PRINT-COMPANY-NAME
           ELSE
              MOVE SPACES                     TO PRINT-COMPANY-NAME.

           MOVE "QTA1"                         TO PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF COND-WORD = ZERO
              MOVE MPLTINFO-DATA              TO PRINT-PLANT-NAME
           ELSE
              MOVE SPACES                     TO PRINT-PLANT-NAME.

           MOVE "QTA2"                         TO PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF COND-WORD = ZERO
              MOVE MPLTINFO-DATA              TO PRINT-PLANT-ADDR1
           ELSE
              MOVE SPACES                     TO PRINT-PLANT-ADDR1.

           MOVE "QTA3"                         TO PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF COND-WORD = ZERO
              MOVE MPLTINFO-DATA              TO PRINT-PLANT-ADDR2
           ELSE
              MOVE SPACES                     TO PRINT-PLANT-ADDR2.

      *----------  RETRIEVE THE TWO QUOTE HEADINGS
           MOVE "QTH1"                   TO PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF NOT GOOD-CALL
              MOVE SPACES TO PRINT-TITLE1
           ELSE
              MOVE MPLTINFO-DATA TO PRINT-TITLE1.

           MOVE "QTH2"                   TO PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF NOT GOOD-CALL
              MOVE SPACES TO PRINT-TITLE2
           ELSE
              MOVE MPLTINFO-DATA TO PRINT-TITLE2.

           MOVE "QTH3" TO PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF NOT GOOD-CALL
              MOVE SPACES TO PRNT-TITLE2
           ELSE
              MOVE MPLTINFO-DATA TO PRNT-TITLE2.

           MOVE "QTH4" TO PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF NOT GOOD-CALL
              MOVE SPACES TO PRT-PHONE, PRT-FAX
           ELSE
              MOVE MPLTINFO-PURCH-PHONE TO PRT-PHONE
              MOVE MPLTINFO-PURCH-FAX   TO PRT-FAX.

           PERFORM 850-NEW-PAGE THRU 859-EXIT.

           MOVE PRINT-COMPANY-LINE            TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 3 LINES.
           MOVE 0 TO ADDR-SUB.
           IF PRINT-PLANT-NAME NOT = SPACES
              MOVE PRINT-PLANT-LINE            TO PRT-LINE
              ADD 1 TO ADDR-SUB
              WRITE PRT-REC AFTER ADVANCING 1 LINE.
           IF PRINT-PLANT-ADDR1-LINE NOT = SPACES
              MOVE PRINT-PLANT-ADDR1-LINE          TO PRT-LINE
              ADD 1 TO ADDR-SUB
              WRITE PRT-REC AFTER ADVANCING 1 LINE.
           IF PRINT-PLANT-ADDR2-LINE NOT = SPACES
              MOVE PRINT-PLANT-ADDR2-LINE        TO PRT-LINE
              ADD 1 TO ADDR-SUB
              WRITE PRT-REC AFTER ADVANCING 1 LINE.

      *-----  THE VENDOR ADDRESS HAS TO START ON THE SAME LINE
      *       REGARDLESS OF HOW MANY ADDRESS LINES ABOVE BECAUSE
      *       OF THE ENVELOPE WINDOW
           COMPUTE ADDR-SUB = 3 - ADDR-SUB.
           MOVE SPACES TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING ADDR-SUB LINES.

           MOVE PRINT-LINE-NAME      TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 6 LINES.
           MOVE PRINT-LINE-ADDR1     TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINES.
           MOVE PRINT-EXP-DATE        TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINES.
           MOVE PRINT-LINE-DLVY       TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
           MOVE PRINT-LINE-FOB        TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
           MOVE PRINT-LINE-SPLC       TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
           MOVE PRINT-LINE-BILLING    TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
           MOVE PRINT-LINE-CURRENC    TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
           MOVE PRINT-LINE-MIN        TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
           MOVE PRINT-LINE-PHONE      TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
           MOVE PRINT-LINE-CONTACT    TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
           MOVE PRINT-LINE-REF        TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
           IF HOLD-FAX-1 = "+"
               MOVE QUOTE-NUM  TO PRT-QUOTE-REF
               MOVE REF-LINE         TO PRT-LINE
               WRITE PRT-REC AFTER ADVANCING 0 LINES.
           MOVE PRINT-LINE-VCODE      TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
           IF HOLD-FAX-1 = "+"
               MOVE PRT-FAX-NUMBER   TO PRT-LINE
               WRITE PRT-REC AFTER ADVANCING 0 LINES.
           MOVE PRINT-TELEX-LINE      TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
           MOVE PRINT-LINE-VENFAX     TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
           MOVE SPACES                TO TEXT1.
           MOVE PRINT-TEXT-LINE-1     TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.

      *----------  GET TEXT PARAGRAPH OR STANDARD TEXT
           IF VEN-TEXT-FLAG = "S"
              MOVE STANDARD-ARG TO QUOTE-ARG.
           MOVE 0 TO COND-WORD.
           MOVE QUOTE-ARG TO QUOTENUM OF DQUOTEXT-REC-I.
           START DQUOTEXT-I KEY = QUOTENUM OF DQUOTEXT-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
             IF NOT GOOD-CALL
                MOVE "DBFIND DQUOTEXT AT 106 IN TQPRT" TO BU-DISPLAY-MSG
                MOVE QUOTE-ARG TO BU-DISPLAY-FLD (1)
                PERFORM 990-BLOWUP THRU 999-EXIT.

       107-GET-TEXT.
           MOVE 0 TO COND-WORD.
           READ DQUOTEXT-I NEXT INTO BUF-DQUOTEXT
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF QUOTENUM OF DQUOTEXT-REC-I NOT = QUOTE-ARG
               MOVE 15 TO COND-WORD.
           IF END-OF-CHAIN
              GO TO 108-PRINT-OUT.
           IF NOT GOOD-CALL
              MOVE "DBGET DQUOTEXT AT 107 IN CQTPRT" TO BU-DISPLAY-MSG
              MOVE QUOTE-ARG TO BU-DISPLAY-FLD (1)
              PERFORM 990-BLOWUP THRU 999-EXIT.

           IF DQUOTEXT-ITM-NO = 0
              MOVE DQUOTEXT-DATA         TO TEXT1
              MOVE PRINT-TEXT-LINE-1     TO PRT-LINE
              WRITE PRT-REC AFTER ADVANCING 1 LINE.
           GO TO 107-GET-TEXT.

       108-PRINT-OUT.
           MOVE QUOTE-NUM TO QUOTE-ARG.
           MOVE 4 TO DATE-MODE
           MOVE VEN-RETURN-DATE TO DATE-VALIDATE-IN.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT           TO PRT-RDATE.

           MOVE PRINT-TEXT-LINE-6        TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 3 LINES.

           PERFORM 840-PRINT-ITEM-HEADINGS THRU 849-EXIT.
           MOVE 38 TO LINE-CTR.
       109-EXIT.  EXIT.

       200-PRINT-QUOTE.

           IF VEN-BID-QTY < 0
             MOVE    0        TO PRNT-USAGE
           ELSE
             MOVE VEN-BID-QTY TO PRNT-USAGE.
           MOVE VEN-ITM-CORPCODE TO CORP-ARG.

      *-----  DISPLAY UNDERLINE FOR MANUAL ENTRY OF EFFECTIVE DATE WHEN
      *-----  DATE NOT IN DB.  IF DATE IN DB THEN DISPLAY THE DATE.

           IF VEN-CREATE-DATE = SPACES
              MOVE "________" TO PRNT-EFF-DATE
           ELSE
              MOVE VEN-CREATE-DATE TO DATE-VALIDATE-IN
              MOVE 4 TO DATE-MODE
              CALL "TDATECHK" USING DATE-CHECK-AREA
              MOVE DATE-SLASH-OUT TO PRNT-EFF-DATE.

      *-----  MOVE LITERAL "NOT KNOWN" TO PRNT-ANNUAL-R FIELD IF ANNUAL
      *-----  USAGE FOR CORPCODE IS ZERO OR LESS OR IF ITEM IS A
      *-----  NON-CODED ITEM.

           IF VEN-ITM-CORPCODE NOT = "NON-STR"
              PERFORM 910-COMPUTE-USAGE THRU 919-EXIT
              IF YTD-TOTAL GREATER THAN ZERO
                 MOVE YTD-TOTAL TO PRNT-ANNUAL
              ELSE
                 MOVE 60                      TO LANG-SETNUM
                 MOVE 50                      TO LANG-MSGNUM
                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                 MOVE MESSAGE-BUFFER          TO PRNT-ANNUAL-R
           ELSE
              MOVE 60                      TO LANG-SETNUM
              MOVE 50                      TO LANG-MSGNUM
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              MOVE MESSAGE-BUFFER          TO PRNT-ANNUAL-R.
           PERFORM 860-PRINT-DESCRIPTION THRU 869-EXIT.

           MOVE PRINT-SHIP           TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
           MOVE PRINT-PRICE-FORMAT    TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
           MOVE 0 TO COND-WORD.
           READ DVENDITM3-I NEXT INTO BUF-DVENDITM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF QUOTENUM OF DVENDITM3-REC-I NOT = QUOTE-ARG
               MOVE 15 TO COND-WORD.
           IF END-OF-CHAIN
              GO TO 299-EXIT.
           IF NOT GOOD-CALL
              MOVE "DBGET DVENDITM AT 299 IN CQTPRT" TO BU-DISPLAY-MSG
              MOVE QUOTE-ARG TO BU-DISPLAY-FLD (1)
              PERFORM 990-BLOWUP THRU 999-EXIT.

           GO TO 200-PRINT-QUOTE.

       299-EXIT.  EXIT.
      ************************************************************
      *    GET CURRENCY CODE AND PRINT ABOVE PRICE HEADING       *
      ************************************************************
       800-CURRENCY.
           MOVE VEN-CC TO UM-ARG.
           MOVE 0 TO COND-WORD.
           MOVE UM-ARG TO VALIDUM  OF MVALIDUM-REC-I.
           READ MVALIDUM-I INTO BUF-MVALIDUM
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF NOT GOOD-CALL
              GO TO 809-EXIT.
           MOVE VALID-UM-DESC                 TO PRT-CURRENCY.
       809-EXIT.  EXIT.
      *************************************************************
      *    PRINT BUYER DATA AND VENDOR SIGNATURE BLANK AT END     *
      *************************************************************
       810-END-OF-QUOTE.
           IF LINE-CTR > 52
               PERFORM 850-NEW-PAGE THRU 859-EXIT.
           MOVE PRINT-BUYER                   TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 3 LINES.
           MOVE PRINT-PURCHASING              TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
           MOVE PRINT-VENDOR-SIGNATURE-LINE   TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 3 LINES.
           MOVE PRINT-DATE-LINE               TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 2 LINES.
           IF HOLD-FAX-1 = "+"
               MOVE PRT-FAX-END TO PRT-LINE
               WRITE PRT-REC AFTER ADVANCING 1 LINE.
       819-EXIT.  EXIT.
      *************************************************************
      *************************************************************
      *                  PRINT ITEM HEADINGS                      *
      *************************************************************
      *************************************************************
       840-PRINT-ITEM-HEADINGS.
           MOVE PRINT-TITLE-LINE-1            TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 2 LINE.
           MOVE PRINT-TITLE-LINE-2            TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
           MOVE PRINT-TITLE-LINE-2A           TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 0 LINE.
           MOVE PRINT-TITLE-LINE-3            TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
           MOVE PRINT-TITLE-LINE-3A           TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 0 LINE.
           MOVE PRINT-TITLE-LINE-3B           TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 0 LINE.
           MOVE PRINT-TITLE-LINE-4            TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
           MOVE SPACES                        TO PRT-LINE.
       849-EXIT.  EXIT.

      *************************************************************
      *    PAGE BREAK HAS OCCURED SO PRINT TOP OF FORM.           *
      *************************************************************
       850-NEW-PAGE.
           MOVE SPACES                        TO PRT-LINE.
           IF PAGE-NUM = 0
              NEXT SENTENCE
           ELSE
           WRITE PRT-REC AFTER ADVANCING NEW-PAGE.
           MOVE ZERO                          TO LINE-CTR.
           ADD  1                             TO PAGE-NUM.
           MOVE PAGE-NUM                      TO PRNT-PAGE.
           MOVE PRINT-PRIME-TITLE             TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 2 LINES.
           MOVE PRINT-PAGE-LINE               TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 2 LINES.
           IF VEN-REF = "0000" OR SPACES
              NEXT SENTENCE
           ELSE
              MOVE VEN-REF TO REF-NO
              MOVE PRINT-REF-LINE TO PRT-LINE
              WRITE PRT-REC AFTER ADVANCING 1 LINE.
           MOVE SPACES                        TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
       859-EXIT.  EXIT.
      *************************************************************
      *               PRINT DESCRIPTION                           *
      *************************************************************
       860-PRINT-DESCRIPTION.
           MOVE 1 TO DISCOUNT-CTR.
           IF VEN-NONCODED-ITEM > 0
              IF VEN-REQ = SPACES
                 PERFORM 870-PRINT-NONCODED-DESC THRU 879-EXIT
                 GO TO 869-EXIT
              ELSE
                 PERFORM 890-PRINT-NONCODED-REQ THRU 899-EXIT
                 GO TO 869-EXIT.

           MOVE VEN-ITM-CORPCODE TO CORP-ARG.
      *----------  RETREIVE MSTORERM FOR UM
           MOVE 0 TO COND-WORD.
           MOVE CORP-ARG TO CORPCDE OF MSTORERM-REC-I.
           READ MSTORERM-I INTO BUF-MSTORERM
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF NOT GOOD-CALL
              IF NO-ENTRY
                 MOVE "DBGET ERROR MSTORERM AT 860 IN CQTPRT"
                       TO BU-DISPLAY-MSG
                 PERFORM 990-BLOWUP THRU 999-EXIT.

           MOVE STR-UM                TO PRNT-STR-UM.
      *----------  GET DESCRIPTION
           MOVE SPACES                   TO CDESC-DATA
           MOVE 25                       TO CDESC-LINES-TO-GET
           MOVE "P"                      TO CDESC-LANGUAGE-OPTION
           MOVE "F"                      TO CDESC-DESC-OPTION
           MOVE "S"                      TO CDESC-MANUFACT-OPTION
           MOVE "R"                      TO CDESC-LOCAL-DESC-OPTION
           CALL "CDESC" USING RET-CODE, BASE, STATUS-AREA,
                        BU-DISPLAY-MSG, CORP-ARG, CDESC-DATA.

      *----------  ADD DESCRIPTION LINES RETRIEVED TO LINE-CTR.  IF
      *            A PAGE BREAK WOULD OCCUR AFTER DESCRIPTION IS
      *            PRINTED, THEN START THE DESCRIPTION ON THE NEXT PAGE.
           MOVE CDESC-LINES-GOT TO ITEM-LINE-CTR.
           ADD 7 TO ITEM-LINE-CTR.
           ADD ITEM-LINE-CTR TO LINE-CTR.
           IF LINE-CTR > 52
              PERFORM 850-NEW-PAGE THRU 859-EXIT
              PERFORM 840-PRINT-ITEM-HEADINGS THRU 849-EXIT
              ADD ITEM-LINE-CTR TO LINE-CTR
              ADD 9 TO LINE-CTR.

      *----------  PRINT CORPORATE CODE
           MOVE CORP-ARG TO PRNT-CORP-CODE.
           MOVE PRINT-CORP-CODE TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 3 LINES.
           MOVE PRINT-DATA-LINE-1     TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 0 LINE.
           MOVE PRINT-DATA-PART2      TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 0 LINE.
           MOVE PRINT-DATA-PART3      TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 0 LINE.

           MOVE 1 TO X.
           PERFORM 865-DESC-LOOP  CDESC-LINES-GOT TIMES.
           GO TO 869-EXIT.
       865-DESC-LOOP.
           MOVE CDESC (X) TO PRNT-CODE-DESC.
           MOVE PRINT-CODE-DESCRIPTION TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
           IF DISCOUNT-CTR < 3
              MOVE PRINT-CODE-DESC2 TO PRT-LINE
              WRITE PRT-REC AFTER ADVANCING 0 LINES
              MOVE PRINT-CODE-DESC3 TO PRT-LINE
              WRITE PRT-REC AFTER ADVANCING 0 LINES
              ADD 1 TO DISCOUNT-CTR.
           ADD 1 TO X.

       869-EXIT.  EXIT.
       870-PRINT-NONCODED-DESC.
           MOVE VEN-NONCODED-UM TO PRNT-STR-UM.
           MOVE VEN-NONCODED-ITEM TO PRNT-NC-ITEM.
           MOVE PRINT-NONCODED-ITEM    TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 3 LINES.
           MOVE PRINT-DATA-LINE-1     TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 0 LINE.
           MOVE PRINT-DATA-PART2      TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 0 LINE.
           MOVE PRINT-DATA-PART3      TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 0 LINE.

           ADD 7 TO LINE-CTR.

           MOVE 0 TO COND-WORD.
           MOVE QUOTE-ARG TO QUOTENUM OF DQUOTEXT-REC-I.
           START DQUOTEXT-I KEY = QUOTENUM OF DQUOTEXT-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF NOT GOOD-CALL
              MOVE "DBFIND DQUOTEXT 870" TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.

       875-NC-DESC.
           MOVE 0 TO COND-WORD.
           READ DQUOTEXT-I NEXT INTO BUF-DQUOTEXT
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF QUOTENUM OF DQUOTEXT-REC-I NOT = QUOTE-ARG
               MOVE 15 TO COND-WORD.
           IF END-OF-CHAIN
              MOVE SPACES TO PRNT-CODE-DESC
              PERFORM 880-PRT-DISCOUNT-LINES THRU 889-EXIT
              GO TO 879-EXIT.
           IF NOT GOOD-CALL
              MOVE "DBGET DQUOTEXT 875 CQTPRT" TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.

           IF DQUOTEXT-ITM-NO NOT = VEN-NONCODED-ITEM
              GO TO 875-NC-DESC.
           ADD 1 TO LINE-CTR.
           IF LINE-CTR > 52
              PERFORM 850-NEW-PAGE THRU 859-EXIT
              PERFORM 840-PRINT-ITEM-HEADINGS THRU 849-EXIT
              MOVE 9 TO LINE-CTR.

           MOVE DQUOTEXT-DATA TO PRNT-CODE-DESC.
           MOVE PRINT-CODE-DESCRIPTION TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
           IF DISCOUNT-CTR < 3
              MOVE PRINT-CODE-DESC2 TO PRT-LINE
              WRITE PRT-REC AFTER ADVANCING 0 LINES
              MOVE PRINT-CODE-DESC3 TO PRT-LINE
              WRITE PRT-REC AFTER ADVANCING 0 LINES
              ADD 1 TO DISCOUNT-CTR.

           GO TO 875-NC-DESC.

       879-EXIT.  EXIT.
       880-PRT-DISCOUNT-LINES.
           MOVE SPACES              TO PRNT-CODE-DESC.
           MOVE PRINT-CODE-DESCRIPTION TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
           IF DISCOUNT-CTR < 3
              MOVE PRINT-CODE-DESC2 TO PRT-LINE
              WRITE PRT-REC AFTER ADVANCING 0 LINE
              MOVE PRINT-CODE-DESC3 TO PRT-LINE
              WRITE PRT-REC AFTER ADVANCING 0 LINE
              ADD 1 TO LINE-CTR, DISCOUNT-CTR.

           IF DISCOUNT-CTR < 3
              GO TO 880-PRT-DISCOUNT-LINES.
       889-EXIT.  EXIT.
       890-PRINT-NONCODED-REQ.
           MOVE VEN-NONCODED-UM TO PRNT-STR-UM.
           MOVE VEN-NONCODED-ITEM TO PRNT-NC-ITEM.
           MOVE PRINT-NONCODED-ITEM    TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 3 LINES.
           MOVE PRINT-DATA-LINE-1     TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 0 LINE.
           MOVE PRINT-DATA-PART2      TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 0 LINE.
           MOVE PRINT-DATA-PART3      TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 0 LINE.

           ADD 6 TO LINE-CTR.

           MOVE VEN-REQ TO REQ-ARG.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DREQDESC-REC-I.
           START DREQDESC-I KEY = REQNO OF DREQDESC-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF NOT GOOD-CALL
              MOVE "DBFIND DREQDESC 890 CQTPRT" TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.

       895-NC-DESC.
           MOVE 0 TO COND-WORD.
           READ DREQDESC-I NEXT INTO BUF-DREQDESC
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF REQNO OF DREQDESC-REC-I NOT = REQ-ARG
               MOVE 15 TO COND-WORD.
           IF END-OF-CHAIN
              PERFORM 900-PRINT-REQ THRU 909-EXIT
              PERFORM 880-PRT-DISCOUNT-LINES THRU 889-EXIT
              GO TO 899-EXIT.
           IF NOT GOOD-CALL
              MOVE "DBGET DREQDESC 895 CQTPRT" TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.

           IF REQDESC-LINE-NO = "95" OR "96"
              GO TO 895-NC-DESC.

           IF REQDESC-DATA-1  = "@"
              GO TO 895-NC-DESC.

           ADD 1 TO LINE-CTR.
           IF LINE-CTR > 52
              PERFORM 850-NEW-PAGE THRU 859-EXIT
              PERFORM 840-PRINT-ITEM-HEADINGS THRU 849-EXIT
              MOVE 9 TO LINE-CTR.

           MOVE REQDESC-DATA TO PRNT-CODE-DESC.
           MOVE PRINT-CODE-DESCRIPTION TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
           IF DISCOUNT-CTR < 3
              MOVE PRINT-CODE-DESC2 TO PRT-LINE
              WRITE PRT-REC AFTER ADVANCING 0 LINES
              MOVE PRINT-CODE-DESC3 TO PRT-LINE
              WRITE PRT-REC AFTER ADVANCING 0 LINES
              ADD 1 TO DISCOUNT-CTR.
           GO TO 895-NC-DESC.
       899-EXIT.  EXIT.
       900-PRINT-REQ.
           IF VEN-REQ = SPACES
              GO TO 909-EXIT.
           MOVE VEN-REQ TO WS-REQ.
           MOVE REQ-PRINT-WS TO PRT-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
           IF DISCOUNT-CTR < 3
              MOVE PRINT-CODE-DESC2 TO PRT-LINE
              WRITE PRT-REC AFTER ADVANCING 0 LINES
              MOVE PRINT-CODE-DESC3 TO PRT-LINE
              WRITE PRT-REC AFTER ADVANCING 0 LINES
              ADD 1 TO LINE-CTR
              ADD 1 TO DISCOUNT-CTR.
       909-EXIT.  EXIT.
       910-COMPUTE-USAGE.

           MOVE 0                               TO YTD-TOTAL.
           MOVE 0                               TO SUB.
           MOVE 0 TO COND-WORD.
           MOVE CORP-ARG TO CORPCDE OF USAGEFIL-REC-I.
           READ USAGEFIL-I INTO USAGE-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF COND-WORD NOT =  0
              MOVE "USAGEFILE ERR 575 SRCVEXEC" TO BU-DISPLAY-MSG
              MOVE CORP-ARG         TO BU-DISPLAY-FLD (5)
              PERFORM 990-BLOWUP THRU 999-EXIT.
       915-CALCULATE-YTD-USAGE.
           ADD 1                                TO SUB.
           IF SUB NOT > 12
              ADD K-MTH-USAGE (SUB)             TO YTD-TOTAL
              GO TO 915-CALCULATE-YTD-USAGE.
       919-EXIT.  EXIT.

      *
      * PARAGRAPH TO FIND THE POSITION TO PRINT THE NEXT ITEM IN
      *
       920-FIND-POSITION.
           MOVE TOTAL-LENGTH TO PRINT-POSITION.
           PERFORM UNTIL PRINT-POSITION < 1 OR
                         CHAR-POS(PRINT-POSITION) NOT EQUAL SPACE
             SUBTRACT 1 FROM PRINT-POSITION
           END-PERFORM.
           IF PRINT-POSITION < 1
             MOVE 1 TO PRINT-POSITION
           ELSE
             ADD 2 TO PRINT-POSITION
           END-IF.

       COPY OVRPFCALL IN COPYLIB.
       990-BLOWUP.
           MOVE "CQTPRT"    TO BU-PGM-NAME.
           MOVE QUOTE-ARG TO BU-DISPLAY-FLD (1).
           MOVE CORP-ARG TO BU-DISPLAY-FLD (3).
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
                VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                 BU-DISPLAY-FLDS.
       999-EXIT.  EXIT.

       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.  EXIT.
