       IDENTIFICATION DIVISION.

       PROGRAM-ID.     CRCVLOG.
       AUTHOR.         EXLTECH, LLC - DAN RAUCH

      ***************************************************************
      **                     C R C V L O G
      ***************************************************************
      ** THIS PROGRAM WRITES RECORDS TO THE PO RECEIVING LOG FILES
      ** ----  CRCVLOG1 = MCFPAB1700(VITRIA FILE)
      ** ----  CRCVLOG2 = MCFPAB1800(GOODYEAR FILE)
      ***************************************************************

      ************************************************************
      **                MODIFICATION   HISTORY
      ************************************************************
      ** --------- ----------  -----------------------------------
      **    WHO       WHEN     WHAT (DESCRIPTION)
      ** --------- ----------  -----------------------------------
      ** DCR01     09/26/2003  CHANGED FILES TO USE NEW NAMES
      ** --------- ----------  -----------------------------------
      *================================================================
       ENVIRONMENT DIVISION.
      *===============================================================
       CONFIGURATION SECTION.

       SOURCE-COMPUTER.       IBM-AS400.
       OBJECT-COMPUTER.       IBM-AS400.
       SPECIAL-NAMES.         LOCAL-DATA IS LDA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT CRCVLOG-FILE1    ASSIGN TO DATABASE-MCFLAB1702
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

           SELECT CRCVLOG-FILE2    ASSIGN TO DATABASE-MCFLAB1802
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

      *================================================================
       DATA DIVISION.
      *================================================================
       FILE SECTION.

       FD  CRCVLOG-FILE1.
       01  CRCVLOG-REC1.
       COPY DDS-ALL-FORMATS OF MCFLAB1702.
       COPY CRCVLOG1 IN COPYLIB.

       FD  CRCVLOG-FILE2.
       01  CRCVLOG-REC2.
       COPY DDS-ALL-FORMATS OF MCFLAB1802.
       COPY CRCVLOG2 IN COPYLIB.

      *----------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *----------------------------------------------------------------
       COPY FILESTATUS  OF COPYLIB.
       COPY DTSPARMS2   OF COPYLIB.
       01  WS-SAVE-LOG-REC         PIC X(100)             VALUE SPACE.

      *============================================================
      *===              L I N K A G E    S E C T I O N
      *============================================================
       LINKAGE SECTION.
       COPY CRCVLOGPRM  OF COPYLIB.

      *================================================================
      *===            P R O C E D U R E    D I V I S I O N
      *================================================================
       PROCEDURE DIVISION  USING LS-CRCVLOG-PARMS.
       0000-PROGRAM-ENTRY.

           OPEN  I-O    CRCVLOG-FILE1
                        CRCVLOG-FILE2.

           PERFORM 0010-INITIALIZE          THRU 0010-EXIT.

           PERFORM 1000-MAIN-LOGIC-ROUTINE  THRU 1000-EXIT.

           CLOSE        CRCVLOG-FILE1
                        CRCVLOG-FILE2.

       0000-PROGRAM-END.
           GOBACK.

      *****************************************************************
      ***    1ST TIME PROCESSING ROUTINE
      *****************************************************************
       0010-INITIALIZE.

           MOVE  "99"            TO LS-CRCVLOG-FILE-STATUS-AREA.

       0010-EXIT.
            EXIT.

      *****************************************************************
      ***  MAIN PROCESSING LOOP ROUTINE
      *****************************************************************
       1000-MAIN-LOGIC-ROUTINE.

           PERFORM 2000-PROCESS-LOG-REC      THRU 2000-EXIT.

       1000-EXIT.
            EXIT.
      *****************************************************************
      *** BUILD/WRITE RECEIVING LOG RECORDS
      *****************************************************************
       2000-PROCESS-LOG-REC.

           INITIALIZE  BUF-CRCVLOG1  BUF-CRCVLOG2.

           MOVE LS-CRCVLOG-PLANT-CODE    TO CRCVLOG1-PLANT-CODE.
           MOVE LS-CRCVLOG-PO-NUMBER     TO CRCVLOG1-PO-NUMBER.
           MOVE LS-CRCVLOG-ARIBA-PO-NUMBER TO CRCVLOG1-ARIBA-PO-NUMBER.
           MOVE LS-CRCVLOG-PO-ITEM       TO CRCVLOG1-ITEM-NUMBER.
           MOVE LS-CRCVLOG-CALLING-PGM   TO CRCVLOG1-CALLING-PGM.
           MOVE LS-CRCVLOG-RCVQTY-PO-UM  TO CRCVLOG1-RCVQTY-PO-UM.

           PERFORM 2100-CHECK-CRCVLOG1  THRU 2100-EXIT.
           MOVE WS-SAVE-LOG-REC   TO  BUF-CRCVLOG2.
           PERFORM 2200-CHECK-CRCVLOG2  THRU 2200-EXIT.

           MOVE  WS-FILE-STATUS  TO LS-CRCVLOG-FILE-STATUS-AREA.

       2000-EXIT.
            EXIT.
      *****************************************************************
      ***  PROCESS CRCVLOG1 FOR UNIQUE KEYS  ==> PO#\ITEMNO\DTSTAMP
      *****************************************************************
       2100-CHECK-CRCVLOG1.

           CALL "GETDTSTMP2" USING WS-SYSTEM-DATE-TIME2
           MOVE  WS-SYSTEM-DATE-TIME2  TO CRCVLOG1-DATE-TIME.

           MOVE  BUF-CRCVLOG1     TO WS-SAVE-LOG-REC.
           PERFORM 9000-READK-CRCVLOG1  THRU 9000-READK1-EXIT.
           IF  FS-GOOD-FILE-IO
               MOVE  WS-SAVE-LOG-REC   TO  BUF-CRCVLOG1
               GO TO 2100-CHECK-CRCVLOG1
           END-IF.

           PERFORM 9000-WRITE-CRCVLOG1  THRU 9000-WRITE1-EXIT.

       2100-EXIT.
            EXIT.
      *****************************************************************
      ***  PROCESS CRCVLOG2 FOR UNIQUE KEYS  ==> PO#\ITEMNO\DTSTAMP
      ***  ------- SHOULD BE AN EXACT COPY OF CRCVLOG1 -------
      *****************************************************************
       2200-CHECK-CRCVLOG2.

           PERFORM 9000-READK-CRCVLOG2  THRU 9000-READK2-EXIT.

           IF  FS-GOOD-FILE-IO
               MOVE  WS-SAVE-LOG-REC   TO  BUF-CRCVLOG2
               CALL "GETDTSTMP2" USING WS-SYSTEM-DATE-TIME2
               MOVE  WS-SYSTEM-DATE-TIME2  TO CRCVLOG2-DATE-TIME
               MOVE  BUF-CRCVLOG2      TO WS-SAVE-LOG-REC
               GO TO 2200-CHECK-CRCVLOG2
           END-IF.

           PERFORM 9000-WRITE-CRCVLOG2  THRU 9000-WRITE2-EXIT.

       2200-EXIT.
            EXIT.
      *****************************************************************
      ***  READK CRCVLOG1 FILE
      *****************************************************************
       9000-READK-CRCVLOG1.

           READ CRCVLOG-FILE1
           END-READ.

       9000-READK1-EXIT.
            EXIT.
      *****************************************************************
      ***  READK CRCVLOG2 FILE
      *****************************************************************
       9000-READK-CRCVLOG2.

           READ CRCVLOG-FILE2
           END-READ.

       9000-READK2-EXIT.
            EXIT.
      *****************************************************************
      ***  WRITE CRCVLOG FILE1 - VITRIA'S COPY
      *****************************************************************
       9000-WRITE-CRCVLOG1.

           MOVE  WS-SAVE-LOG-REC   TO  BUF-CRCVLOG1.

      ***  VITRIA COPY
           WRITE CRCVLOG-REC1
           END-WRITE.

       9000-WRITE1-EXIT.
            EXIT.
      *****************************************************************
      ***  WRITE CRCVLOG FILE2 - GOODYEAR AUDIT TRAIL COPY
      *****************************************************************
       9000-WRITE-CRCVLOG2.

           MOVE  WS-SAVE-LOG-REC   TO  BUF-CRCVLOG2.

      ***  GOODYEAR COPY
           WRITE CRCVLOG-REC2
           END-WRITE.

       9000-WRITE2-EXIT.
            EXIT.
      *****************************************************************
      **                     END  OF  SOURCE
      *****************************************************************
