       IDENTIFICATION DIVISION.

       PROGRAM-ID.     CREQLOG.
       AUTHOR.         EXLTECH, INC - DAN RAUCH

      ***************************************************************
      **              WRITE TO REQUISTION LOG FILE
      *****************************************************************
      **            M O D I F I C A T I O N    H I S T O R Y
      ***------------------------------------------------------------***
DCR01 *   MAR 18, 2004       D.RAUCH     DCR01    PER BILL FONAGY
DCR01 *                      ADDED CODE TO CHECK FOR SAP VENDOR NBR    'G
DCR01 *                      AND CONVERT IT FROM CSIS FMT TO SAP FMT   'G
      ***------------------------------------------------------------***

      *================================================================
       ENVIRONMENT DIVISION.
      *===============================================================

       CONFIGURATION SECTION.

       SOURCE-COMPUTER.       IBM-AS400.
       OBJECT-COMPUTER.       IBM-AS400.
       SPECIAL-NAMES.         LOCAL-DATA IS LDA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT CREQLOG-FILE     ASSIGN TO DATABASE-MCFLAB0701
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES.

           SELECT CREQLOG-FILE2    ASSIGN TO DATABASE-MCFLAB0801
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES.

      *================================================================
       DATA DIVISION.
      *================================================================
       FILE SECTION.

       FD  CREQLOG-FILE.
       01  CREQLOG-REC.
       COPY DDS-ALL-FORMATS OF MCFLAB0701.
       COPY DREQLOG IN COPYLIB.

       FD  CREQLOG-FILE2.
       01  CREQLOG-REC2.
       COPY DDS-ALL-FORMATS OF MCFLAB0801.
       COPY DREQLOG2 IN COPYLIB.

      *----------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *----------------------------------------------------------------

       COPY FILESTATUS  OF COPYLIB.
       COPY DTSPARMS2   OF COPYLIB.


DCR01  01  WS-MISCELLANEOUS-FLDS.
DCR01      03  WS-VENDOR-CODE          PIC X(10)          VALUE SPACE.



      *============================================================
      *===              L I N K A G E    S E C T I O N
      *============================================================
       LINKAGE SECTION.
       COPY CREQLOGPRM  OF COPYLIB.

      *================================================================
      *===        P R O C E D U R E    D I V I S I O N              ===
      *================================================================
       PROCEDURE DIVISION  USING LS-CREQLOG-PARMS.
       0000-PROGRAM-ENTRY.

           OPEN  I-O    CREQLOG-FILE
                        CREQLOG-FILE2.

           PERFORM 0010-INITIALIZE          THRU 0010-EXIT.

           PERFORM 1000-MAIN-LOGIC-ROUTINE  THRU 1000-EXIT.

           CLOSE        CREQLOG-FILE
                        CREQLOG-FILE2.

       0000-PROGRAM-END.
           GOBACK.

      *****************************************************************
      ***    1ST TIME PROCESSING ROUTINE
      *****************************************************************
       0010-INITIALIZE.


       0010-EXIT.
            EXIT.

      *****************************************************************
      ***  MAIN PROCESSING LOOP ROUTINE
      *****************************************************************
       1000-MAIN-LOGIC-ROUTINE.

           INITIALIZE    BUF-DREQLOG  BUF-DREQLOG2.


DCR01      MOVE SPACE              TO WS-VENDOR-CODE.
DCR01 **--------------------------------------------------------------
DCR01 ***  CHECK FOR SAP VENDOR NUMBER CONVERSION
DCR01 **--------------------------------------------------------------
DCR01      IF  LS-CREQLOG-VENDOR-CODE(1:1) = "S"
DCR01          MOVE "0000"         TO WS-VENDOR-CODE(1:4)
DCR01          MOVE LS-CREQLOG-VENDOR-CODE(2:6) TO WS-VENDOR-CODE(5:6)
DCR01      ELSE
DCR01          MOVE LS-CREQLOG-VENDOR-CODE TO WS-VENDOR-CODE
DCR01      END-IF.



           MOVE  LS-CREQLOG-REQNO  TO REQLOG-REQ-NUMBER.
           MOVE  LS-CREQLOG-CORP-CODE  TO REQLOG-CORP-CODE.
           MOVE  LS-CREQLOG-PLANT-CODE TO REQLOG-PLT.
           MOVE  LS-CREQLOG-MANFACT-NAME TO REQLOG-MANUFACT-NAME.
           MOVE  LS-CREQLOG-MANFACT-PARTNO TO REQLOG-MANUFACT-PARTNO.
           MOVE  WS-VENDOR-CODE     TO REQLOG-VENDOR-CDE.
           MOVE  LS-CREQLOG-VENDOR-PARTNO TO REQLOG-VENDOR-PARTNO.
           MOVE  LS-CREQLOG-VENDOR-AUXID TO REQLOG-VENDOR-AUXID.
           MOVE  LS-CREQLOG-UOM     TO REQLOG-UOM.

           CALL "GETDTSTMP2" USING WS-SYSTEM-DATE-TIME2.
           MOVE  WS-SYSTEM-DATE-TIME2  TO REQLOG-DATETIME.

           PERFORM 9000-WRITE-CREQLOG   THRU 9000-WRITE-EXIT.

       1000-EXIT.
            EXIT.
      *****************************************************************
      ***  WRITE CREQLOG FILE
      *****************************************************************
       9000-WRITE-CREQLOG.

           MOVE  BUF-DREQLOG           TO BUF-DREQLOG2.

           WRITE CREQLOG-REC
           END-WRITE.

           WRITE CREQLOG-REC2
           END-WRITE.

       9000-WRITE-EXIT.
            EXIT.
      *****************************************************************
      ***                  END OF SOURCE
      *****************************************************************
