       IDENTIFICATION DIVISION.
       PROGRAM-ID.     CRFMTKWM.
       AUTHOR.         DAVID A. PLUM, JR.
       DATE-WRITTEN.   SEPTEMBER 1985.
       DATE-COMPILED.
      *INSTALLATION.   THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
      *REMARKS.
      *D
      *D  C R F M T K W M      REFORMAT KEYWORD/MODIFIER
      *D
      *D  THIS SUBPROGRAM IS CALLED BY:
      *D     1) SKWMUPDT
      *D     2) SCODEUPD
      *D     3) SINQKWM
      *D
      *D  SUBPROGRAMS CALLED:
      *D     1) TBLOWUP
      *D
      *D  THIS SUBPROGRAM REMOVES "EXTRA" SPACES FROM MULTI-WORD
      *D  KEYWORDS AND MODIFIERS.  THIS IS ACCOMPLISHED BY FIRST
      *D  UNSTRINGING AND THEN RESTRINGING BOTH THE KEYWORD AND
      *D  THE MODIFIER INDIVIDUALLY.
      *D
      *D  FOR EXAMPLE:
      *D
      *D    IF THE CALLING PROGRAM PASSES:
      *D      SEND-MOD   = "CLUTCH      REPAIR           "
      *D
      *D    THIS PROGRAM WILL RETURN:
      *D      RETURN-MOD = "CLUTCH REPAIR                "
      *D
      *D  TO USE THIS SUBPROGRAM:
      *D    1) INCLUDE THE COPYLIB MEMBER "CRFMTKWM" IN WORKING
      *D       STORAGE.
      *D    2) MOVE THE KEYWORD AND MODIFIER TO BE REFORMATTED
      *D       (BOTH SHOULD BE LEFT JUSTIFIED AND UPSHIFTED USING
      *D       VIEW EDITS) TO SEND-KW AND SEND-MOD RESPECTIVELY.
      *D    3) CALL "CRFMTKWM" USING REFORMAT-KWM-AREA,
      *D           BASE, VIEW-COMAREA.
      *D    4) USE RETURN-KW AND RETURN-MOD, OR RETURN-KWM AND
      *D       CONTINUE WITH PROCESSING.
      *D
      *D  FOR EXAMPLE:
      *D
      *D 613-EDIT-KWM.
      *D     MOVE KW-ENTERED   TO SEND-KW.
      *D     MOVE MOD-ENTERED  TO SEND-MOD.
      *D
      *D     CALL "CRFMTKWM" USING REFORMAT-KWM-AREA,
      *D         BASE, VIEW-COMAREA.
      *D
      *D     MOVE RETURN-KWM TO KWM-ARG.
      *D
      *C CR KALMAN     APRIL 22, 1994
      *C ADDED SOME CODE CHANGES TO LEFT JUSTIFY THE KEYWORD AND
      *C MODIFIER FIELDS. THIS CHECK OCCURS AUTOMATICALLY IN THE
      *C FORM ON THE HP BUT DID NOT OCCUR ON THE AS/400 UNTIL NOW.
      *C

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  HP-3000.
       OBJECT-COMPUTER.  HP-3000.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

      **************************************************************
      **      W O R K I N G   S T O R A G E   S E C T I O N       **
      **************************************************************

       01  UNSTRUNG-AREA.
           05  UNSTRUNG-KW1              PIC X(20)  VALUE SPACES.
           05  UNSTRUNG-KW2              PIC X(20)  VALUE SPACES.
           05  UNSTRUNG-KW3              PIC X(20)  VALUE SPACES.
           05  UNSTRUNG-KW4              PIC X(20)  VALUE SPACES.
           05  UNSTRUNG-KW5              PIC X(20)  VALUE SPACES.
           05  UNSTRUNG-KW6              PIC X(20)  VALUE SPACES.
           05  UNSTRUNG-KW7              PIC X(20)  VALUE SPACES.
           05  UNSTRUNG-KW8              PIC X(20)  VALUE SPACES.
           05  UNSTRUNG-KW9              PIC X(20)  VALUE SPACES.
           05  UNSTRUNG-KW10             PIC X(20)  VALUE SPACES.
           05  UNSTRUNG-MOD1             PIC X(30)  VALUE SPACES.
           05  UNSTRUNG-MOD2             PIC X(30)  VALUE SPACES.
           05  UNSTRUNG-MOD3             PIC X(30)  VALUE SPACES.
           05  UNSTRUNG-MOD4             PIC X(30)  VALUE SPACES.
           05  UNSTRUNG-MOD5             PIC X(30)  VALUE SPACES.
           05  UNSTRUNG-MOD6             PIC X(30)  VALUE SPACES.
           05  UNSTRUNG-MOD7             PIC X(30)  VALUE SPACES.
           05  UNSTRUNG-MOD8             PIC X(30)  VALUE SPACES.
           05  UNSTRUNG-MOD9             PIC X(30)  VALUE SPACES.
           05  UNSTRUNG-MOD10            PIC X(30)  VALUE SPACES.
           05  UNSTRUNG-MOD11            PIC X(30)  VALUE SPACES.
           05  UNSTRUNG-MOD12            PIC X(30)  VALUE SPACES.
           05  UNSTRUNG-MOD13            PIC X(30)  VALUE SPACES.
           05  UNSTRUNG-MOD14            PIC X(30)  VALUE SPACES.
           05  UNSTRUNG-MOD15            PIC X(30)  VALUE SPACES.

9404CK 01  TEMP-KEYWORD                  PIC X(29)  VALUE SPACES.
9404CK 01  TEMP-MODIFIER                 PIC X(45)  VALUE SPACES.

       01  STRUNG-AREA.
           05  STRUNG-KEYWORD            PIC X(29)  VALUE SPACES.
           05  STRUNG-MODIFIER           PIC X(45)  VALUE SPACES.

       01  STRUNG-AREA-REDEF REDEFINES STRUNG-AREA.
           10 STRUNG-KW-19           PIC X(19).
           10 STRUNG-KW-10           PIC X(10).
           10 STRUNG-MOD-30          PIC X(30).
           10 STRUNG-MOD-15          PIC X(15).

9404CK 01  CNT-1                     PIC 9(2).

       COPY TBLOWUP IN COPYLIB.

       01  WS-SEND-KW.
           05  WS-SEND-KW-1-14           PIC X(14)  VALUE SPACES.
           05  WS-SEND-KW-15-19          PIC X(5)   VALUE SPACES.

       01  WS-SEND-MOD.
           05  WS-SEND-MOD-1-14          PIC X(14)  VALUE SPACES.
           05  WS-SEND-MOD-15-28         PIC X(14)  VALUE SPACES.
           05  WS-SEND-MOD-29-30         PIC X(2)   VALUE SPACES.

       01  DUMMY-STATUS-AREA             PIC X(20) VALUE ZEROES.

      **************************************************************
      **              L I N K A G E    S E C T I O N              **
      **************************************************************

       LINKAGE SECTION.

       01  REFORMAT-KWM-AREA.
           05  SEND-KWM.
               10  SEND-KW               PIC X(19).
               10     FILLER             PIC X(1).
               10  SEND-MOD              PIC X(30).
           05  RETURN-KWM.
               10  RETURN-KW             PIC X(19).
               10     FILLER             PIC X(1).
               10  RETURN-MOD            PIC X(30).

       01  BASE                          PIC X(10).

       COPY VCOMLINK IN COPYLIB.

      **************************************************************
      **          P R O C E D U R E    D I V I S I O N            **
      **************************************************************

       PROCEDURE DIVISION USING REFORMAT-KWM-AREA, BASE, VIEW-COMAREA.

       REFORMAT-KWM SECTION.
           PERFORM 6-MAIN THRU 6-MAIN-X.
           GOBACK.

       6-MAIN.
           MOVE SPACES TO RETURN-KWM.
           MOVE SPACES TO STRUNG-KEYWORD,
                          STRUNG-MODIFIER.
           MOVE SPACES TO UNSTRUNG-AREA.
9404CK     INITIALIZE CNT-1, TEMP-KEYWORD.

           UNSTRING SEND-KW DELIMITED BY ALL " "
9404CK        INTO UNSTRUNG-KW1 COUNT IN CNT-1,
                   UNSTRUNG-KW2,
                   UNSTRUNG-KW3,
                   UNSTRUNG-KW4,
                   UNSTRUNG-KW5,
                   UNSTRUNG-KW6,
                   UNSTRUNG-KW7,
                   UNSTRUNG-KW8,
                   UNSTRUNG-KW9,
                   UNSTRUNG-KW10;
              ON OVERFLOW
                MOVE "UNSTRING KW ERROR IN 6-MAIN"
                    TO BU-DISPLAY-MSG
                MOVE SEND-KW             TO WS-SEND-KW
                MOVE "SEND-KW  1-14="    TO BU-DISPLAY-FLD (1)
                MOVE WS-SEND-KW-1-14     TO BU-DISPLAY-FLD (2)
                MOVE "SEND-KW 15-19="    TO BU-DISPLAY-FLD (3)
                MOVE WS-SEND-KW-15-19    TO BU-DISPLAY-FLD (4)
                PERFORM 61-CALL-TBLOWUP.

           STRING
              UNSTRUNG-KW2    DELIMITED BY " ",
              SPACE           DELIMITED BY SIZE,
              UNSTRUNG-KW3    DELIMITED BY " ",
              SPACE           DELIMITED BY SIZE,
              UNSTRUNG-KW4    DELIMITED BY " ",
              SPACE           DELIMITED BY SIZE,
              UNSTRUNG-KW5    DELIMITED BY " ",
              SPACE           DELIMITED BY SIZE,
              UNSTRUNG-KW6    DELIMITED BY " ",
              SPACE           DELIMITED BY SIZE,
              UNSTRUNG-KW7    DELIMITED BY " ",
              SPACE           DELIMITED BY SIZE,
              UNSTRUNG-KW8    DELIMITED BY " ",
              SPACE           DELIMITED BY SIZE,
              UNSTRUNG-KW9    DELIMITED BY " ",
              SPACE           DELIMITED BY SIZE,
              UNSTRUNG-KW10   DELIMITED BY " ",
9404CK           INTO TEMP-KEYWORD.
  .        MOVE TEMP-KEYWORD TO STRUNG-KEYWORD.
  .
  .        IF CNT-1 > 0
  .           STRING
  .              UNSTRUNG-KW1    DELIMITED BY " ",
  .              SPACE           DELIMITED BY SIZE,
  .              TEMP-KEYWORD    DELIMITED BY SIZE,
  .                 INTO STRUNG-KEYWORD.
  .
9404CK     INITIALIZE CNT-1, TEMP-MODIFIER.

           UNSTRING SEND-MOD DELIMITED BY ALL " "
9404CK        INTO UNSTRUNG-MOD1 COUNT IN CNT-1,
                   UNSTRUNG-MOD2,
                   UNSTRUNG-MOD3,
                   UNSTRUNG-MOD4,
                   UNSTRUNG-MOD5,
                   UNSTRUNG-MOD6,
                   UNSTRUNG-MOD7,
                   UNSTRUNG-MOD8,
                   UNSTRUNG-MOD9,
                   UNSTRUNG-MOD10,
                   UNSTRUNG-MOD11,
                   UNSTRUNG-MOD12,
                   UNSTRUNG-MOD13,
                   UNSTRUNG-MOD14,
                   UNSTRUNG-MOD15;
              ON OVERFLOW
                MOVE "UNSTRING MOD ERROR IN 6-MAIN"
                    TO BU-DISPLAY-MSG
                MOVE SEND-MOD            TO WS-SEND-MOD
                MOVE "SEND-MOD ="        TO BU-DISPLAY-FLD (1)
                MOVE WS-SEND-MOD-1-14    TO BU-DISPLAY-FLD (2)
                MOVE WS-SEND-MOD-15-28   TO BU-DISPLAY-FLD (3)
                MOVE WS-SEND-MOD-29-30   TO BU-DISPLAY-FLD (4)
                PERFORM 61-CALL-TBLOWUP.

           STRING
              UNSTRUNG-MOD2  DELIMITED BY " ",
              SPACE          DELIMITED BY SIZE,
              UNSTRUNG-MOD3  DELIMITED BY " ",
              SPACE          DELIMITED BY SIZE,
              UNSTRUNG-MOD4  DELIMITED BY " ",
              SPACE          DELIMITED BY SIZE,
              UNSTRUNG-MOD5  DELIMITED BY " ",
              SPACE          DELIMITED BY SIZE,
              UNSTRUNG-MOD6  DELIMITED BY " ",
              SPACE          DELIMITED BY SIZE,
              UNSTRUNG-MOD7  DELIMITED BY " ",
              SPACE          DELIMITED BY SIZE,
              UNSTRUNG-MOD8  DELIMITED BY " ",
              SPACE          DELIMITED BY SIZE,
              UNSTRUNG-MOD9  DELIMITED BY " ",
              SPACE          DELIMITED BY SIZE,
              UNSTRUNG-MOD10 DELIMITED BY " ",
              SPACE          DELIMITED BY SIZE,
              UNSTRUNG-MOD11 DELIMITED BY " ",
              SPACE          DELIMITED BY SIZE,
              UNSTRUNG-MOD12 DELIMITED BY " ",
              SPACE          DELIMITED BY SIZE,
              UNSTRUNG-MOD13 DELIMITED BY " ",
              SPACE          DELIMITED BY SIZE,
              UNSTRUNG-MOD14 DELIMITED BY " ",
              SPACE          DELIMITED BY SIZE,
              UNSTRUNG-MOD15 DELIMITED BY " ",
9404CK           INTO TEMP-MODIFIER.
  .        MOVE TEMP-MODIFIER TO STRUNG-MODIFIER.
  .
  .        IF CNT-1 > 0
  .        STRING
  .           UNSTRUNG-MOD1  DELIMITED BY " ",
  .           SPACE          DELIMITED BY SIZE,
  .           TEMP-MODIFIER  DELIMITED BY SIZE,
9404CK           INTO STRUNG-MODIFIER.

           MOVE STRUNG-KW-19   TO RETURN-KW.
           MOVE STRUNG-MOD-30  TO RETURN-MOD.

       6-MAIN-X.
           EXIT.

       61-CALL-TBLOWUP.
           MOVE "CRFMTKWM" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME,
               DUMMY-STATUS-AREA, VIEW-COMAREA, DUMMY-KSAM-STAT,
               BU-DISPLAY-MSG, BU-DISPLAY-AREA.
