       IDENTIFICATION DIVISION.
       PROGRAM-ID.     CRFMTMFR.
       AUTHOR.         DAVID A. PLUM, JR.
       DATE-WRITTEN.   SEPTEMBER 1985.
       DATE-COMPILED.
      *INSTALLATION.   THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
      *REMARKS.
      **************************************************************
      *D  C R F M T M F R         REFORMAT MANUFACTURER NAME       *
      *D                                                           *
      *   THIS SUBPROGRAM IS CALLED BY:                            *
      *      1) SMFRUPDT                                           *
      *      2) SCODEUPD                                           *
      *      3) SDSCINQ                                            *
      *      4) SINQMFR                                            *
      *                                                            *
      *   SUBPROGRAMS CALLED:                                      *
      *      1) TBLOWUP                                            *
      *                                                            *
      **************************************************************
      *                                                            *
      *D  THIS SUBPROGRAM REMOVES "EXTRA" SPACES FROM MULTI-WORD   *
      *D  MANUFACTURER NAMES.  THIS IS ACCOMPLISHED BY FIRST       *
      *D  UNSTRINGING AND THEN RESTRINGING THE MANUFACTURER NAME.  *
      *                                                            *
      *   FOR EXAMPLE:                                             *
      *     IF THE CALLING PROGRAM PASSES:                         *
      *       SEND-MFR   = "GOODYEAR  TIRE  &  RUBBER "            *
      *                                                            *
      *     THIS PROGRAM WILL RETURN:                              *
      *       RETURN-MFR = "GOODYEAR TIRE & RUBBER    "            *
      *                                                            *
      *   TO USE THIS SUBPROGRAM:                                  *
      *     1) INCLUDE THE COPYLIB MEMBER "CRFMTMFR" IN WORKING    *
      *        STORAGE.                                            *
      *     2) MOVE THE MANUFACTURER NAME TO BE REFORMATTED TO     *
      *        SEND-MFR (SHOULD BE LEFT JUSTIFIED AND UPSHIFTED    *
      *        USING VIEW EDITS).                                  *
      *     3) CALL "CRFMTMFR" USING REFORMAT-MFR-AREA,            *
      *            BASE, VIEW-COMAREA.                             *
      *     4) USE RETURN-MFR AND CONTINUE WITH PROCESSING.        *
      *                                                            *
      *   FOR EXAMPLE:                                             *
      *                                                            *
      *  615-EDIT-MFR.                                             *
      *      MOVE MFR-ENTERED  TO SEND-MFR.                        *
      *                                                            *
      *      CALL "CRFMTMFR" USING REFORMAT-MFR-AREA,              *
      *          BASE, VIEW-COMAREA.                               *
      *                                                            *
      *      MOVE RETURN-MFR TO MFR-ARG.                           *
      *                                                            *
      **************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  HP-3000.
       OBJECT-COMPUTER.  HP-3000.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

      **************************************************************
      **       W O R K I N G   S T O R A G E   S E C T I O N      **
      **************************************************************

       01  UNSTRUNG-MFR.
           05  UNSTRUNG-MFR1             PIC X(26)  VALUE SPACES.
           05  UNSTRUNG-MFR2             PIC X(26)  VALUE SPACES.
           05  UNSTRUNG-MFR3             PIC X(26)  VALUE SPACES.
           05  UNSTRUNG-MFR4             PIC X(26)  VALUE SPACES.
           05  UNSTRUNG-MFR5             PIC X(26)  VALUE SPACES.
           05  UNSTRUNG-MFR6             PIC X(26)  VALUE SPACES.
           05  UNSTRUNG-MFR7             PIC X(26)  VALUE SPACES.
           05  UNSTRUNG-MFR8             PIC X(26)  VALUE SPACES.
           05  UNSTRUNG-MFR9             PIC X(26)  VALUE SPACES.
           05  UNSTRUNG-MFR10            PIC X(26)  VALUE SPACES.
           05  UNSTRUNG-MFR11            PIC X(26)  VALUE SPACES.
           05  UNSTRUNG-MFR12            PIC X(26)  VALUE SPACES.
           05  UNSTRUNG-MFR13            PIC X(26)  VALUE SPACES.

9404CK 01  TEMP-MFR                      PIC X(39).

       01  STRUNG-MFR                    PIC X(39).
       01  STRUNG-MFR-REDEF REDEFINES STRUNG-MFR.
           05  STRUNG-MFR-26             PIC X(26).
           05  STRUNG-MFR-13             PIC X(13).

9404CK 01  CNT-1                         PIC 9(2).

       COPY TBLOWUP IN COPYLIB.

       01  WS-SEND-MFR.
           05 WS-SEND-MFR-1-14           PIC X(14).
           05 WS-SEND-MFR-15-26          PIC X(12).

       01  DUMMY-STATUS-AREA             PIC X(20) VALUE ZEROES.

      **************************************************************
      **              L I N K A G E    S E C T I O N              **
      **************************************************************

       LINKAGE SECTION.

       01  REFORMAT-MFR-AREA.
           05  SEND-MFR                  PIC X(26).
           05  RETURN-MFR                PIC X(26).

       01  BASE                          PIC X(10).

       COPY VCOMLINK IN COPYLIB.

      **************************************************************
      **          P R O C E D U R E    D I V I S I O N            **
      **************************************************************

       PROCEDURE DIVISION USING REFORMAT-MFR-AREA, BASE, VIEW-COMAREA.

       REFORMAT-MFR SECTION.
           PERFORM 6-MAIN THRU 6-MAIN-X.
           GOBACK.

       6-MAIN.
           MOVE SPACES TO RETURN-MFR.
           MOVE SPACES TO STRUNG-MFR.
           MOVE SPACES TO UNSTRUNG-MFR.
9404CK     INITIALIZE CNT-1, TEMP-MFR.

           UNSTRING SEND-MFR DELIMITED BY ALL " "
9404CK        INTO UNSTRUNG-MFR1 COUNT IN CNT-1,
                   UNSTRUNG-MFR2,
                   UNSTRUNG-MFR3,
                   UNSTRUNG-MFR4,
                   UNSTRUNG-MFR5,
                   UNSTRUNG-MFR6,
                   UNSTRUNG-MFR7,
                   UNSTRUNG-MFR8,
                   UNSTRUNG-MFR9,
                   UNSTRUNG-MFR10,
                   UNSTRUNG-MFR11,
                   UNSTRUNG-MFR12,
                   UNSTRUNG-MFR13;
              ON OVERFLOW
                MOVE "CRFMTMFR"          TO BU-PGM-NAME
                MOVE "UNSTRING MFR ERROR IN 6-MAIN"
                    TO BU-DISPLAY-MSG
                MOVE SEND-MFR TO WS-SEND-MFR
                MOVE "SEND-MFR 1-14="    TO BU-DISPLAY-FLD (1)
                MOVE WS-SEND-MFR-1-14    TO BU-DISPLAY-FLD (2)
                MOVE "SEND-MFR REST="    TO BU-DISPLAY-FLD (3)
                MOVE WS-SEND-MFR-15-26   TO BU-DISPLAY-FLD (4)
                CALL "TBLOWUP" USING BASE, BU-PGM-NAME,
                    DUMMY-STATUS-AREA, VIEW-COMAREA, DUMMY-KSAM-STAT,
                    BU-DISPLAY-MSG, BU-DISPLAY-AREA.

           STRING
              UNSTRUNG-MFR2  DELIMITED BY " ",
              SPACE          DELIMITED BY SIZE,
              UNSTRUNG-MFR3  DELIMITED BY " ",
              SPACE          DELIMITED BY SIZE,
              UNSTRUNG-MFR4  DELIMITED BY " ",
              SPACE          DELIMITED BY SIZE,
              UNSTRUNG-MFR5  DELIMITED BY " ",
              SPACE          DELIMITED BY SIZE,
              UNSTRUNG-MFR6  DELIMITED BY " ",
              SPACE          DELIMITED BY SIZE
              UNSTRUNG-MFR7  DELIMITED BY " ",
              SPACE          DELIMITED BY SIZE
              UNSTRUNG-MFR8  DELIMITED BY " ",
              SPACE          DELIMITED BY SIZE,
              UNSTRUNG-MFR9  DELIMITED BY " ",
              SPACE          DELIMITED BY SIZE,
              UNSTRUNG-MFR10 DELIMITED BY " ",
              SPACE          DELIMITED BY SIZE,
              UNSTRUNG-MFR11 DELIMITED BY " ",
              SPACE          DELIMITED BY SIZE,
              UNSTRUNG-MFR12 DELIMITED BY " ",
              SPACE          DELIMITED BY SIZE,
              UNSTRUNG-MFR13 DELIMITED BY " ",
9404CK           INTO TEMP-MFR.
  .        MOVE TEMP-MFR TO STRUNG-MFR.
  .
  .        IF CNT-1 > 0
  .           STRING
  .              UNSTRUNG-MFR1  DELIMITED BY " ",
  .              SPACE          DELIMITED BY SIZE,
  .              TEMP-MFR       DELIMITED BY SIZE,
9404CK              INTO STRUNG-MFR.

           MOVE STRUNG-MFR-26 TO RETURN-MFR.

       6-MAIN-X.
           EXIT.
