000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.     CRLSTRCV.
000400 AUTHOR.         C.I.HILLES.
000500 DATE-WRITTEN.   06/20/90.
000600 DATE-COMPILED.
000700*INSTALLATION.   GOODYEAR TIRE AND RUBBER - AKRON.
000900*REMARKS.
001000*D   FIND THE   R E A L   LAST RECEIVING SLIP, AS OPPOSED TO THE
001100*D   SUPPOSED LAST RECEIVING SLIP AS INICATED BY M-PO-LAST-RCVR. TIES
      *    THIS SUBPROGRAM IS MACHINE-SPECIFIC SINCE THE IBM ALLOWS
      *    A QUICKER WAY TO ACCOMPISH THIS.
001230
001300 ENVIRONMENT DIVISION.
001400 CONFIGURATION SECTION.
001500 SOURCE-COMPUTER.  HP-3000.
001600 OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MPORCV-PO-I
               ASSIGN TO DATABASE-MCFLCS0101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

001700
       DATA DIVISION.
       FILE SECTION.
       FD  MPORCV-PO-I
           LABEL RECORDS ARE STANDARD.
       01  MPORCV-PO-REC-I.
           COPY DDS-MCRPCS0100  OF MCFLCS0101.

001900 WORKING-STORAGE SECTION.
       01  FILE-STATUS        PIC X(2).
       01  PO-RCV-WORK.
           05  FILLER         PIC X(11).
           05  RCV-WORK       PIC X(3).

       LINKAGE SECTION.
       01  BASE2              PIC X(10).
       01  M-PO-RCV-NO.
           05  PO-NUM         PIC X(8).
           05  RLSE-NUM       PIC X(3).
           05  RCVR-NUM       PIC X(3).
       01  REAL-LAST-RCVR     PIC 9(3).
010200 PROCEDURE DIVISION USING BASE2, M-PO-RCV-NO, REAL-LAST-RCVR.
010300
010400 6000-MAIN.
           OPEN INPUT MPORCV-PO-I.
           MOVE M-PO-RCV-NO TO PO-RCV-WORK.
           MOVE "999" TO RCV-WORK.
           MOVE PO-RCV-WORK TO PORCVNO OF MPORCV-PO-REC-I.
           START MPORCV-PO-I KEY >= PORCVNO OF MPORCV-PO-REC-I
             INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE ZERO TO REAL-LAST-RCVR
               GO TO 6990-MAIN-X.

            READ MPORCV-PO-I PRIOR AT END
                MOVE FILE-STATUS TO FILE-STATUS.
            IF FILE-STATUS NOT = "00"
                MOVE ZERO TO REAL-LAST-RCVR
                GO TO 6990-MAIN-X.

            MOVE PORCVNO OF MPORCV-PO-REC-I TO PO-RCV-WORK.
            MOVE RCV-WORK TO REAL-LAST-RCVR.

       6990-MAIN-X.
           CLOSE MPORCV-PO-I.
           GOBACK.
