000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          CRSPRT.
000400 AUTHOR.              BARBARA WINTER.
000500 DATE-WRITTEN.        JULY 12, 1985.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*     THIS PROGRAM DOES THE ACTUAL PRINTING OF A RECEIVING SLIP.
001100*************************************************************
001200*************************************************************
001300**                      C R S P R T                        **
001400**                                                         **
001500*D    THIS PROGRAM RETRIEVES THE DATA FOR A RECEIVING SLIP **
001600*D    NUMBER FROM THE DATABASE AND PRINTS IT TO THE        **
001700*D    PRINTERS FOUND IN THE SPOOLFILE FILE FOR THAT USER.  **
001800**                                                         **
001900**    THERE ARE SOME DIFFERENCES BETWEEN THE RECEIVING     **
002000**    SLIP PRINTED FROM A REPRINT REQUEST AND THE          **
002100**    RECEIVING SLIP PRINTED AT CREATION TIME.             **
002200**          1.  NO RECEIVED UM IS PRINTED ON REPRINT.      **
002300**              (NOT STORED IN DATABASE)                   **
002400**          2.  NO FREIGHT COMMENT FIELD IS PRINTED        **
002500**              ON REPRINT. (NOT STORED IN DATABASE)       **
      **          #2 NO LONGER APPLIES WITH RLSE H0100 (JSB)     **
002600**                                                         **
002700*************************************************************
002800*************************************************************
002900**   CALLING ROUTINES:                                     **
003000**          1.  SRSPRTS  - RECEIVING SLIP REPRINT          **
003100**          2.  SRCVEXEC - RECEIVER CREATE PROGRAM        **
003200*************************************************************
003300*************************************************************.
003400*************************************************************
003500*************************************************************
003600*   PASSED PARAMETERS:   (NOT INCLUSIVE OR IN ORDER)        *
003700*     1.  BASE   X(10)                                      *
003800*                DATABASE NAME (STORES)                     *
003900*                                                           *
004000*     3.  PASS-PGM-NAME   X(8)                              *
004100*                PASSED SO BLOWUP PROGRAM CAN SHOW THE      *
004200*                CALLING PROGRAM NAME.                      *
004300*                                                           *
004400*     4.  PASS-PRINT-DEPT X(4)                              *
004500*                AKRON ONLY - EACH SIGNON DOCK HAS ITS OWN  *
004600*                PRINT DEPARTMENT.                          *
004700*                                                           *
004800*     5.  MISC-FRT-COMMENT    X(68)                             *
004900*                OSD COMMENT FROM FREIGHT SCREEN NEEDS TO   *
005000*                BE PASSED BECAUSE ITS NOT STORED IN DB.    *
005100*                                                           *
005200*     6.  MISC-RS-ARG          X(14)                             *
005300*                RECEIVING SLIP NUMBER TO BE PRINTED        *
005400*                                                           *
005500*     7.  SPOOL-PRT-NO    S9(2) COMP                        *
005600*         ACCTG-PRT-NO    S9(2) COMP                        *
005700*         PRINT-PRT-NO    S9(2) COMP                        *
005800*                SPOOLED PRINTER NUMBERS FOR PRINT OUT.     *
005900*                SPOOL-PRT-NO IS REQUIRED, OTHERS AREN'T.   *
006000*                                                           *
006100*     8.  PLT-NUMBER    X(3)                              *
006200*                PLANT NUMBER FOR SPECIAL LOGICS.           *
006300*                                                           *
006400*     9.  PRINT-PRICE-SW  X(1)                            *
006500*                "Y" IF AKRON'S CORDER PO HAS A DIFFERENT   *
006600*                PRICE UM FROM ORDERED UM. NEED TO PRINT    *
006700*                PRICE UM IN THAT CASE.                     *
006800*                                                           *
006900*    10.  PASS-ITEM-TABLE.           OCCURS 12 TIMES.       *
007000*           A)  PASS-ITEM      - ITEM NUMBER ON RCVING SLIP *
007100*           B)  PASS-DLV-UM    - CODED DELIVERED UM         *
007200*           C)  PASS-PRICE-QTY -                            *
007300*           D)  PASS-PRICE-UM  - CERTAIN RECEIVING DEPTS    *
007400*                                NEED TO SHOW UNIT PRICES.  *
007500*         THE ABOVE TABLE IS ONLY FILLED IN WHEN CREATING   *
007600*         A RECEIVIER, NOT WHEN PROCESSING A REPRINT.       *
007700*                                                           *
007800*    11.  VIEW-COMAREA - SO BLOWUP PROGRAM CAN ABORT        *
003900*                                                           *
003700*    12.  BASE-MMISA X(24)                                  *
003800*                DATABASE NAME (MMISA)                      *
007900*************************************************************
008000*C***********************************************************
      *C MAY 21, 1992  - J.S. BUNGO   (005979)                    *
      *C   MADE A DATABASE CALL TO PER-PERSONNEL IN THE MMISA     *
      *C   DATABASE TO RETRIEVE AND PRINT THE ORIGINATOR NAME     *
      *C   WITH THE CLOCK CARD NUMBER FOR PO'S FROM MMIS WITH     *
      *C   A REQUISTION.                                          *
      *C
      *C 09/19/94    JEFF BUNGO
      *C   ADDED A LINE TO THE RECEIVING SLIP TO PRINT A CHAT
      *C   NUMBER AND ITS MFR AND TRADE NAME IF A CHAT NUMBER WAS
      *C   REFERENCED ON AN ITEM ON THE RECEIVING SLIP.
      *C
      *C 06/06/96    JEFF BUNGO
      *C   EXPANDED DATES FOR YEAR 2000 COMPLIANCE.
      *C   RECOMPILED TO PICK UP NEW FILE FORMATS.
      *C
      *C 10/22/96  JEFF BUNGO
      *C   ADD CAST, CIRC, CIRM, AND DES TO LIST OF RECEIVING
      *C   DEPARTMENTS TO PRINT PRICE INFORMATION.
      *C
      *C 10/31/96  JEFF BUNGO
      *C   ADDED PRINTING OF RECEIVING INSTRUCTIONS FOR BEFORE
      *C   AND AFTER ALL ITEMS AS WELL AS ITEM INSTRUCTIONS.
      *C
      *C 05/22/97  JEFF BUNGO
      *C   ADDED "END OF RECEIVER" PRINT TEXT AT THE END OF
      *C   THE RECEIVING SLIP PRINT.
      *C
      *C 01/26/99  CA YODER
      *C   IF A NON-CODED RCVG SLIP WAS PRINTED AFTER ONE WITH
      *C   CODED ITEMS WHICH INCLUDES CHAT NUMBERS, THE CHAT
      *C   DESCRIPTION WAS CARRIED OVER TO THE NEXT RCVG SLIP.
      *C   CORRECTED LOGIC TO ELIMINATE THE PRINTING ERROR.
      *C
      *C 03/24/98  JIM COFFMAN
      *C   ADD CIRA AND CIRO TO LIST OF RECEIVING
      *C   DEPARTMENTS TO PRINT PRICE INFORMATION.
      *C
      *C 12/06/00  CA YODER
      *C   ADDED LOGIC TO CHECK ORIGINATOR FIELD ON PRT-REQ-LINE
      *C   TO SEE IF LINE SHOULD BE PRINTED.
      *C
      *C 03/14/02  CA YODER        (NAPANEE REQUEST)
      *C   ADDED LOGIC TO PRINT COMMENTS FROM MCFPCS7000 ON RECEIVING
      *C   SLIP, IF THE FILE EXISTS.
      *C
      *C 01/28/2003  DAN RAUCH   DCR01
      *C   CORRECT PRINTING OF "NOTIFY"  - INIT MREQ PRIOR TO READ
      *C
      *C***********************************************************
014300 ENVIRONMENT DIVISION.
014400 CONFIGURATION SECTION.
014500 SOURCE-COMPUTER.  HP-3000.
014600 OBJECT-COMPUTER.  HP-3000.
014700 SPECIAL-NAMES.
014800     C01 IS NEW-PAGE.
014900 INPUT-OUTPUT SECTION.
015000 FILE-CONTROL.
015100      SELECT ONLINE-PRT   ASSIGN TO PRINTER-MCPRT.
015200      SELECT ACCTG-PRT    ASSIGN TO PRINTER-MCPRT2.
015300      SELECT THIRD-PRT    ASSIGN TO PRINTER-MCPRT3.
015400      SELECT CAPITAL-PRT  ASSIGN TO PRINTER-MCPRT4.
015500      SELECT RAWMAT-PRT   ASSIGN TO PRINTER-MCPRT5.
015600      SELECT HOLD-PRT     ASSIGN TO DISK-RCHLDPRT
                              ORGANIZATION IS SEQUENTIAL
                              ACCESS MODE IS SEQUENTIAL
015700                        FILE STATUS IS FILE-STATUS.
            SELECT DVENDOR
              ASSIGN TO DATABASE-MCFLCS0701
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT DVENDITM
              ASSIGN TO DATABASE-MCFLCS0802
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT DPOFREIGHT
               ASSIGN TO DATABASE-MCFLCS2401
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT DPOITEM
               ASSIGN TO DATABASE-MCFLCS1002
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT DRCVITEM
               ASSIGN TO DATABASE-MCFLCS1201
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT MSTORERM
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT DPODATAITM
               ASSIGN TO DATABASE-MCFLCS1101
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT MPORCV
               ASSIGN TO DATABASE-MCFLCS0101
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT DREQD
               ASSIGN TO DATABASE-MCFLCS2102
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT MREQ
               ASSIGN TO DATABASE-MCFLCS2001
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT DPORECD
               ASSIGN TO DATABASE-MCFLCS0901
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT PER-PERSONNEL
               ASSIGN TO DATABASE-MCFLMM0301
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT DCHATNO
               ASSIGN TO DATABASE-MCFLCS5502
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT DCOMMENT
               ASSIGN TO DATABASE-MCFLCS1901
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
015800 DATA DIVISION.
015900 FILE SECTION.
016000
016100 FD  ONLINE-PRT
016200     LABEL RECORDS ARE OMITTED
016300     RECORD CONTAINS 132 CHARACTERS
016400     DATA RECORD IS PRINT-RCD.
016500 01  PRINT-RCD.
016600     05  PLINE           PIC X(132).
016700
016800 FD  ACCTG-PRT
016900     LABEL RECORDS ARE OMITTED
017000     RECORD CONTAINS 132 CHARACTERS
017100     DATA RECORD IS ACCTG-RCD.
017200 01  ACCTG-RCD.
017300     05  PACCTG          PIC X(132).
017400
017500 FD  THIRD-PRT
017600     LABEL RECORDS ARE OMITTED
017700     RECORD CONTAINS 132 CHARACTERS
017800     DATA RECORD IS THIRD-RCD.
017900 01  THIRD-RCD.
01800      05  PTHIRD               PIC X(132).
018100
018200 FD  CAPITAL-PRT
018300     LABEL RECORDS ARE OMITTED
018400     RECORD CONTAINS 132 CHARACTERS
018500     DATA RECORD IS CAPITAL-RCD.
018600 01  CAPITAL-RCD.
018700     05  PCAP                   PIC X(132).
018800
018900 FD  RAWMAT-PRT
019000     LABEL RECORDS ARE OMITTED
019100     RECORD CONTAINS 132 CHARACTERS
019200     DATA RECORD IS RAWMAT-RCD.
019300 01  RAWMAT-RCD.
019400     05  RMAT                   PIC X(132).
019500
019600 FD  HOLD-PRT
019700     LABEL RECORDS ARE OMITTED
019800     RECORD CONTAINS 84 CHARACTERS
019900     DATA RECORD IS HOLD-PRT-RCD.
020000 01  HOLD-PRT-RCD.
020100     05  HOLD-PRT-ITEM.
020200         10  HOLD-PRT-ITM     PIC 9(4).
020300     05  HOLD-PRT-DESC        PIC X(80).
       FD  DVENDOR
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-REC.
           COPY DDS-MCRPCS0700  OF MCFLCS0701.

       FD  DVENDITM
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM-REC.
           COPY DDS-MCRPCS0800  OF MCFLCS0802.

       FD  DPOFREIGHT
           LABEL RECORDS ARE STANDARD.
       01  DPOFREIGHT-REC.
           COPY DDS-MCRPCS2400  OF MCFLCS2401.

       FD  DPOITEM
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-REC.
           COPY DDS-MCRPCS1000  OF MCFLCS1002.

       FD  DRCVITEM
           LABEL RECORDS ARE STANDARD.
       01  DRCVITEM-REC.
           COPY DDS-MCRPCS1200  OF MCFLCS1201.

       FD  MSTORERM
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  DPODATAITM
           LABEL RECORDS ARE STANDARD.
       01  DPODATAITM-REC.
           COPY DDS-MCRPCS1100  OF MCFLCS1101.

       FD  MPORCV
           LABEL RECORDS ARE STANDARD.
       01  MPORCV-REC.
           COPY DDS-MCRPCS0100  OF MCFLCS0101.

       FD  DREQD
           LABEL RECORDS ARE STANDARD.
       01  DREQD-REC.
           COPY DDS-MCRPCS2100  OF MCFLCS2102.

       FD  MREQ
           LABEL RECORDS ARE STANDARD.
       01  MREQ-REC.
           COPY DDS-MCRPCS2000  OF MCFLCS2001.

       FD  DPORECD
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-REC.
           COPY DDS-MCRPCS0900  OF MCFLCS0901.

       FD  PER-PERSONNEL
           LABEL RECORDS ARE STANDARD.
       01  PER-PERSONNEL-REC.
           COPY DDS-MCRPMM0300 OF MCFLMM0301.

       FD  DCHATNO
           LABEL RECORDS ARE STANDARD.
       01  DCHATNO-REC.
           COPY DDS-MCRPCS5500 OF MCFLCS5502.
       FD  DCOMMENT
           LABEL RECORDS ARE STANDARD.
       01  DCOMMENT-REC.
           COPY DDS-MCRPCS1900 OF MCFLCS1901.

020400*************************************************************
020500*************************************************************
020600*              WORKING STORAGE SECTION                      *
020700*************************************************************
020800*************************************************************
020900 WORKING-STORAGE SECTION.
       01  SUB                        PIC 9(2)  VALUE 0.
       01  FILE-STATUS.
           05  FILE-STATUS-1          PIC X.
           05  FILE-STATUS-2          PIC X.
021000 01  TALLY-MSG-WS               PIC X(8)    VALUE SPACES.
021100 01  LOT-MSG-WS                 PIC X(8)   VALUE SPACES.
021200 01  LINE-ADV                   PIC 99     VALUE ZEROS.
021300 01  LINE-CTR                   PIC 9(4)   VALUE ZEROS.
021400 01  MESSAGE-BUFFER             PIC X(76)  VALUE SPACES.
021500 01  VEN-LIT-SAVE               PIC X(13)  VALUE SPACES.
021600 01  BUYER-LIT-SAVE             PIC X(6)   VALUE SPACES.
021700 01  SELLER-LIT-SAVE            PIC X(13)  VALUE SPACES.
021800 01  PRICE-QTY-SAVE             PIC X(12)  VALUE SPACES.
       01  SAVE-PACK-SLIP             PIC X(12)  VALUE SPACES.
       01  PRINT-DCOMPL-SW            PIC X      VALUE "N".
021900
022000*----------  REQUISITION NUMBER FROM PO HEADER IN CASE THE
022100*            INDIVIDUAL ITEMS DON'T HAVE A REQUISITION NUMBER
022200 01  SAVE-REQ                      PIC X(12) VALUE SPACES.
022300
022400*----------  ONLY PRINT THE LAST 5 CHARACTERS OF ZBILL
022500 01  WS-ENTIRE-ZBILL.
022600     05  FILLER                    PIC X     VALUE SPACES.
022700     05  WS-ZBILL                  PIC X(5)  VALUE SPACES.
022800
022900*----------  SUBSCRIPT INTO COUNT TABLE
023000 01  I                          PIC 9(4)    VALUE ZERO.
023100*----------  PRINT POSITION OF 6 STOREROOM LOCATIONS
023200 01  STK                        PIC 9      VALUE ZERO.
023300*----------  SUBSCRIPT INTO DESCRIPTION TABLE
023400 01  X                          PIC 9(2)   VALUE ZERO.
023500
023600*-----------  IF RECEIVER WAS NOT CREATED, DO NOT PRINT
023700 01  DO-NOTHING                    PIC 9    VALUE ZERO.
023800     88  NO-RECEIVER                        VALUE 1.

      *----------  RECEIVE INSTRUCTION NUMBERS
       01  RCV-INSTRUCTIONS.
           05  RCV-BEFORE-INST.
               10  RCV-BEFORE-NO OCCURS 6 TIMES PIC X(3).
           05  RCV-AFTER-INST.
               10  RCV-AFTER-NO OCCURS 6 TIMES PIC X(3).
       01  FILLER REDEFINES RCV-INSTRUCTIONS.
           05  RCV-INST-NO OCCURS 12 TIMES PIC X(3).
       01  RECEIVE-INSTRUCTION      PIC X(3).
       01  BUILD-COMMENT-NO.
           05  BUILD-COM-PREFIX     PIC X     VALUE "R".
           05  BUILD-COM-NO         PIC X(3)  VALUE SPACES.
023900
024000 COPY DBPOARG1 OF COPYLIB.
024100 COPY DBPOARG2 OF COPYLIB.
024200 01  PO-RLSE-RS-WORKAREA.
024300     05  DISPLAY-PO-RLSE-RS.
024400         10  DISP-PO            PIC X(7)   VALUE SPACES.
024500         10  FILLER             PIC X      VALUE "-".
024600         10  DISP-RLSE          PIC X(3)   VALUE SPACES.
024700         10  FILLER             PIC X      VALUE "-".
024800         10  DISP-RS            PIC X(3)   VALUE SPACES.
024900     05  DISPLAY-FRT-REFER.
025000         10  DISP-FRT-PO        PIC X(7)   VALUE SPACES.
025100         10  HYPHEN-1           PIC X      VALUE "-".
025200         10  DISP-FRT-RLSE      PIC X(3)   VALUE SPACES.
025300         10  HYPHEN-2           PIC X      VALUE "-".
025400         10  DISP-FRT-RS        PIC X(3)   VALUE SPACES.
025500
025600*----------  QUANTITY WORK AREA
025700 01  WORK-QTY-X.
025800     05  WORK-QTY-BDP-X         PIC X(8).
025900     05  WORK-QTY-ADP-X         PIC X(4).
026000 01  WORK-QTY REDEFINES WORK-QTY-X     PIC 9(8)V9(4).
026100
026200*----------  CURRENT DELIVERED QTY SAVED FOR NONCODED KELLY RAW
026300*            MATERIALS TO MULTIPLY WITH CONVERSION FACTOR.
026400 01  SAVE-QTY                   PIC 9(8)V9(4).
026500
026600*----------  USED TO CONVERT NON-KELLY QUANTITIES FROM
026700*            PO TO STOREROOM UM
026800 01  WS-CONVERT-FLD                    PIC 9(8)V9(4).
026900
027000*----------  COMPARES RECEIVER ITEM WITH ITEM IN DESCRIPTION
027100*            HOLD FILE
027200 01  HOLD-ITM-NO                PIC 9(4)    VALUE ZEROES.
027300
027400 COPY PLANTS OF COPYLIB.
027500**************************************************************
027600*                 C A L L E D  R O U T I N E S               *
027700**************************************************************
027800 01  SPOOLER-PARAMETERS.
027900     05  SPOOL-STATUS          PIC S9       VALUE ZERO COMP-4.
028000     05  SPOOL-MESSAGE         PIC X(75)    VALUE SPACES.
028100     05  FILLER                PIC X        VALUE SPACES.
028200     05  SPOOL-COPIES          PIC S9(2)    VALUE 1    COMP-4.
028300     05  SPOOL-PRIORITY        PIC S9       VALUE ZERO COMP-4.
028400     05  ACCTG-STATUS          PIC S9       VALUE ZERO COMP-4.
028500     05  ACCTG-MESSAGE         PIC X(75)    VALUE SPACES.
028600     05  FILLER                PIC X        VALUE SPACES.
028700     05  ACCTG-COPIES          PIC S9(2)    VALUE 1     COMP-4.
028800     05  ACCTG-PRIORITY        PIC S9       VALUE ZERO  COMP-4.
028900*----------  THE FOLLOWING DATA IS FOR 3RD PRTR IN SUBPLANTS ONLY
029000     05  THIRD-STATUS          PIC S9       VALUE ZERO  COMP-4.
029100     05  THIRD-MESSAGE         PIC X(75)    VALUE SPACES.
029200     05  FILLER                PIC X        VALUE SPACES.
029300     05  THIRD-COPIES          PIC S9(2)    VALUE 1     COMP-4.
029400     05  THIRD-PRIORITY        PIC S9       VALUE ZERO  COMP-4.
029500 COPY TBLOWUP   OF COPYLIB.
029600 COPY TDATECHK  OF COPYLIB.
       COPY OVRPFDATA OF COPYLIB.
       COPY CCHKOBJ   OF COPYLIB.
029700 COPY CDESC     OF COPYLIB.
029800 COPY CNDESC    OF COPYLIB.
       COPY CATREAD   OF COPYLIB.
       COPY CCRTFILE IN COPYLIB.
029900 01  RET-CODE                  PIC X(2)     VALUE SPACES.
030000 COPY DBMODES   OF COPYLIB.
030100 COPY DBSTAT    OF COPYLIB.
030200 01  ALL-ITEM-LIST                PIC X(2)  VALUE "@;".
031500
       01  CCRQDESC-PARMS.
           05  CCRQDESC-CODE          PIC X(7).
           05  CCRQDESC-LINES.
               10  CCRQDESC-LINE  OCCURS 10 TIMES
                                      PIC X(80).
031600*----------  ARGUMENT VALUES
031700 01  CODE-ARG                   PIC X(8)   VALUE SPACES.
031800 01  PO-ARG                     PIC X(14)  VALUE SPACES.
031900 01  VEN-ARG                    PIC X(10)  VALUE SPACES.
032000 01  REQ-ARG                    PIC X(12) VALUE SPACES.
032100 01  FRT-ARG                    PIC X(14) VALUE SPACES.
       01  EMPL-ARG                   PIC X(6)   VALUE SPACES.
       01  COMMENT-ARG                PIC X(4)   VALUE SPACES.
032200
032800*************************************************************
032900*              D A T A B A S E   B U F F E R S              *
033000*************************************************************
033100 COPY DPOITEM  OF COPYLIB.
033200 COPY DRCVITEM OF COPYLIB.
033300 COPY DPORECD  OF COPYLIB.
033400 COPY DVENDOR  OF COPYLIB.
033500 COPY DVENDITM OF COPYLIB.
033600 COPY MSTORERM OF COPYLIB.
033700 COPY MPORCV   OF COPYLIB.
033800 COPY DPODATA  OF COPYLIB.
033900 COPY MREQ     OF COPYLIB.
034000 COPY DREQD    OF COPYLIB.
034100 COPY DFREIGHT OF COPYLIB.
       COPY DCHATNO  OF COPYLIB.
       COPY DCOMMENT OF COPYLIB.
       01  BUF-PER-PERSONNEL.    COPY MPERSONL IN COPYLIB.
034200*************************************************************
034300*                 H E A D I N G S                           *
034400*************************************************************
034500
034600 77  STRIP                PIC X(5) JUSTIFIED RIGHT.
034700
034800 01  HDR-1.
034900     05  COMPRESS-1-1     PIC X(5)   VALUE SPACES.
035000     05  MSG1             PIC X(5)   VALUE SPACES.
035100     05  PG-NO            PIC 99     VALUE ZEROS.
035200     05  MSG2             PIC X(4)   VALUE SPACES.
035300     05  PG-LIMIT         PIC 99     VALUE 1.
035400     05  FILLER           PIC X      VALUE SPACES.
           05  COMPRESS-1-OFF   PIC X(5)   VALUE SPACES.
035500     05  EXPAND-1         PIC X(5)   VALUE SPACES.
035600     05  FILLER           PIC X      VALUE SPACES.
035700     05  HDR1-TITLE       PIC X(30)  VALUE SPACES.
           05  EXP-1-OFF        PIC X(5)   VALUE SPACES.
035800     05  COMPRESS-1-2     PIC X(5)   VALUE SPACES.
035900     05  FILLER           PIC X(2)   VALUE SPACES.
036000     05  PRT-DATE         PIC X(8)   VALUE SPACES.
036100     05  FILLER           PIC X(3)   VALUE SPACES.
036200     05  PRT-TIME         PIC X(8)   VALUE SPACES.
036300
036400 01  HDR-1A.
036500     05  NORMAL-1A        PIC X(5)   VALUE SPACES.
036600     05  MSG3             PIC X(64)  VALUE SPACES.
036700     05  PRT-PRIOR-RS     PIC X(15)  VALUE SPACES.
036800
036900 01  HDR-2.
037000     05  NORMAL-2         PIC X(5)   VALUE SPACES.
037100     05  PRPD-COLLECT-H2A PIC X(8)    VALUE SPACES.
037200     05  COMPRESS-2       PIC X(5)   VALUE SPACES.
037300     05  FILLER           PIC X(4)   VALUE SPACES.
037400     05  MSG4             PIC X(14)  VALUE SPACES.
037500     05  FREIGHT-H2A      PIC ZZZZZZZZZZZZZ.99 VALUE ZEROES.
037600     05  FILLER           PIC X(4)   VALUE SPACES.
037700     05  MSG5             PIC X(15)  VALUE SPACES.
037800     05  C-WT-H2A         PIC ZZZZZZZ9  VALUE ZEROS.
037900     05  MSG6             PIC X(12)  VALUE SPACES.
038000     05  O-WT-H2A         PIC ZZZZZZZ9  VALUE ZEROS.
038100     05  FILLER           PIC X(16)  VALUE SPACES.
038200     05  MSG7             PIC X(9)   VALUE SPACES.
038300     05  PRO-DATE-H2      PIC X(8)   VALUE SPACES.
038400 01  HDR-2A.
038500     05  MSG8             PIC X(9)   VALUE SPACES.
038600     05  CARRIER-H2       PIC X(4)   VALUE SPACES.
038700     05  FILLER           PIC X(4)   VALUE SPACES.
038800     05  MSG9             PIC X(12)  VALUE SPACES.
038900     05  PRO-NUM-H2       PIC X(16)  VALUE SPACES.
039000     05  FILLER           PIC X(6)   VALUE SPACES.
039100     05  MSG10            PIC X(15)  VALUE SPACES.
039200     05  EMPL-2B          PIC X(4)   VALUE SPACES.
039300     05  FILLER           PIC X(8)   VALUE SPACES.
039400     05  MSG11            PIC X(17)  VALUE SPACES.
039500     05  P-SLIP-H2        PIC X(12)  VALUE SPACES.
039600     05  FILLER           PIC X(3)   VALUE SPACES.
039700     05  MSG12            PIC X(9)   VALUE SPACES.
039800     05  ORIGIN-H2        PIC X(9)   VALUE SPACES.
039900
040000 01  HDR-2B.
040100     05  MSG13            PIC X(9)   VALUE SPACES.
040200     05  LOT-NO-2B        PIC XXX    VALUE SPACES.
040300     05  FILLER           PIC X(5)   VALUE SPACES.
040400     05  MSG14            PIC X(12)  VALUE SPACES.
040500     05  CAR-NO-2B        PIC X(10)  VALUE SPACES.
040600     05  FILLER           PIC X(12)  VALUE SPACES.
040700     05  MSG15            PIC X(10)  VALUE SPACES.
040800     05  SEALS-2B         PIC X(68)  VALUE SPACES.
040900
041000 01  HDR-2C.
041100     05  MSG16            PIC X(17)  VALUE SPACES.
041200     05  OSD-NO-2C        PIC X(3)   VALUE SPACES.
041300     05  FILLER           PIC X(31)  VALUE SPACES.
041400     05  MSG17            PIC X(10)  VALUE SPACES.
041500     05  COMMENT-2C       PIC X(80)  VALUE SPACES.
041600
041700 01  HDR-2D.
041800     05  MSG18            PIC X(3)   VALUE SPACES.
041900     05  FILLER           PIC X(14)  VALUE SPACES.
042000     05  FOB-2D           PIC X(20)  VALUE SPACES.
042100     05  FILLER           PIC X(14)  VALUE SPACES.
042200     05  MSG20            PIC X(9)   VALUE SPACES.
042300     05  RCV-DATE-2D      PIC X(8)   VALUE SPACES.
042400     05  NORMAL-SEQ       PIC X(5)   VALUE SPACES.
042500     05  FILLER           PIC X(18)  VALUE SPACES.
042600     05  MSG19            PIC X(10)  VALUE SPACES.
042700     05  SEQ-2D           PIC X(6)   VALUE SPACES.
042800 01  HDR-3.
042900     05  NORMAL-3         PIC X(5)   VALUE SPACES.
043000     05  MSG21            PIC X(17)  VALUE SPACES.
043100     05  PRT-RCV-DEPT     PIC X(4)   VALUE SPACES.
043200     05  FILLER           PIC X(16)  VALUE SPACES.
043300     05  FILLER           PIC X      VALUE SPACE.
043400     05  MSG22            PIC X(24)  VALUE SPACES.
043500     05  PRT-PO-RLSE-RS   PIC X(15)  VALUE SPACES.
043600     05  FILLER           PIC X(4)   VALUE SPACES.
043700
043800 01  PRT-Z-BILL-NO.
043900     05  NORMAL-ZBL       PIC X(5)   VALUE SPACES.
044000     05  FILLER           PIC X(46)  VALUE SPACES.
044100     05  MSG23            PIC X(15)  VALUE SPACES.
044200     05  PRT-Z-BILL       PIC X(5)   VALUE SPACES.
044300
044400 01  PRT-PO-DATA.
044500     05  PRT-BUD-NO       PIC X(12)  VALUE SPACES.
044600     05  FILLER           PIC X(1)   VALUE SPACE.
044700     05  PRT-PO-DATE      PIC X(8)   VALUE SPACES.
044800     05  FILLER           PIC XX     VALUE SPACES.
044900     05  PRT-DELIV-TO.
045000         10 PRT-FOR-DEPT  PIC X(6)   VALUE SPACES.
045100         10 FILLER        PIC X      VALUE SPACES.
045200         10 PRT-ADDL-INFO PIC X(16)  VALUE SPACES.
045300     05  FILLER           PIC XX     VALUE SPACES.
045400     05  PRT-SHIP-DATE    PIC X(8)   VALUE SPACES.
045500     05  FILLER           PIC XXX    VALUE SPACES.
045600     05  PRT-SUB          PIC XXX    VALUE SPACES.
045700     05  FILLER           PIC XX     VALUE SPACES.
045800     05  PRT-SUB-DETL     PIC X(4)   VALUE SPACES.
045900     05  FILLER           PIC X(1)   VALUE SPACES.
046000     05  FILLER           PIC X(12)  VALUE "____________".
046100
046200 01  HDR-4A.
046300     05  MSG42            PIC X(12)  VALUE SPACES.
046400     05  FILLER           PIC X(1)   VALUE SPACE.
046500     05  MSG24            PIC X(8)   VALUE SPACES.
046600     05  FILLER           PIC XX     VALUE SPACES.
046700     05  MSG25            PIC X(24)  VALUE SPACES.
046800     05  MSG26            PIC X(9)   VALUE SPACES.
046900     05  FILLER           PIC XXX    VALUE SPACES.
047000     05  MSG27            PIC XXX    VALUE SPACES.
047100     05  FILLER           PIC X      VALUE SPACES.
047200     05  COMPRESS-4A      PIC X(5)   VALUE SPACES.
047300     05  MSG28            PIC X(10)  VALUE SPACES.
047400     05  NORMAL-4A        PIC X(5)   VALUE SPACES.
047500     05  MSG29            PIC X(12)  VALUE SPACES.
047600 01  HDR-5.
047700     05  VEN-LIT          PIC X(13)  VALUE SPACES.
047800     05  PRT-VEN-ADDR     PIC X(44)  VALUE SPACES.
047900     05  FILLER           PIC X(2)   VALUE SPACES.
048000     05  BUYER-LIT        PIC X(6)   VALUE SPACES.
048100     05  PRT-BUYER        PIC X(15)  VALUE SPACES.
048200
048300 01  HDR-6.
048400     05  MSG30            PIC X(4)   VALUE SPACES.
048500     05  FILLER           PIC XX     VALUE SPACES.
048600     05  HDR6-CODE        PIC X(9)   VALUE SPACES.
048700     05  FILLER           PIC XX     VALUE SPACES.
048800     05  HDR6-DESC        PIC X(11)  VALUE SPACES.
048900     05  FILLER           PIC X(7)   VALUE SPACES.
049000     05  COMPRESS-6       PIC X(5)   VALUE SPACES.
049100     05  PRICE-QTY-TITLE  PIC X(12)  VALUE SPACES.
049200     05  FILLER           PIC X(3)   VALUE SPACES.
049300     05  MSG31            PIC X(15)  VALUE SPACES.
049400     05  FILLER           PIC X      VALUE SPACES.
049500     05  MSG32            PIC XX     VALUE SPACES.
049600     05  FILLER           PIC X(4)   VALUE SPACES.
049700     05  MSG33            PIC X(16)  VALUE SPACES.
049800     05  FILLER           PIC X      VALUE SPACES.
049900     05  MSG34            PIC XX     VALUE SPACES.
050000     05  FILLER           PIC X(5)   VALUE SPACES.
050100     05  MSG35            PIC X(7)   VALUE SPACES.
050200 01  HDR-7.
050300     05  FILLER           PIC X(72)  VALUE SPACES.
050400     05  MSG36            PIC X(18)  VALUE SPACES.
050500     05  FILLER           PIC X(4)   VALUE SPACES.
050600     05  MSG37            PIC X(19)  VALUE SPACES.
050700 01  PRT-COUNT-MSG.
050800     05  NORMAL-PCM       PIC X(5)   VALUE SPACES.
050900     05  PRT-COUNT        PIC X(25) VALUE SPACES.
051000     05  COMPRESS-PCM     PIC X(5)   VALUE SPACES.
051100
051200 01  PRT-ITM-HDR.
051300     05  NORMAL-ITM       PIC X(5)   VALUE SPACES.
051400     05  PRT-ITM          PIC Z(3)9  VALUE ZEROS.
051500     05  FILLER           PIC X(2)   VALUE SPACES.
051600     05  PRT-CODE         PIC X(7)   VALUE SPACES.
051700     05  FILLER           PIC X(3)   VALUE SPACES.
051800     05  PRT-PREV-CODE    PIC X(12)  VALUE SPACES.
051900     05  FILLER           PIC X(3)   VALUE SPACES.
052000     05  COMPRESS-ITM     PIC X(5)   VALUE SPACES.
052100     05  FILLER           PIC X(2)   VALUE SPACES.
052200     05  PRT-PRICE-QTY    PIC Z(7)9.9999 VALUE ZEROS.
052300     05  PRT-PRICE-QTY-R REDEFINES PRT-PRICE-QTY  PIC Z(12)9.
052400     05  PRT-PRICE-QTY-X REDEFINES PRT-PRICE-QTY  PIC X(13).
052500     05  FILLER           PIC X(1)   VALUE SPACES.
052600     05  PRT-PRICE-UM     PIC X(2)   VALUE SPACES.
052700     05  FILLER           PIC X(5)   VALUE SPACES.
052800     05  PRT-PO-ORD       PIC Z(7)9.9999 VALUE ZEROS.
052900     05  PRT-PO-ORD-R REDEFINES PRT-PO-ORD   PIC Z(12)9.
053000     05  FILLER           PIC X      VALUE SPACES.
053100     05  PRT-PO-ORD-UM    PIC XX     VALUE SPACES.
053200     05  FILLER           PIC X(7)   VALUE SPACES.
053300     05  PRT-PO-DLVR      PIC Z(7)9.9999 VALUE ZEROS.
053400     05  PRT-PO-DLVR-R REDEFINES PRT-PO-DLVR  PIC Z(12)9.
053500     05  FILLER           PIC X      VALUE SPACES.
053600     05  PRT-PO-DLVR-UM   PIC XX     VALUE SPACES.
053700     05  FILLER           PIC X(5)   VALUE SPACES.
053800     05  PRT-REQ-NO       PIC X(12)  VALUE SPACES.
053900
054000 01  PRT-ITM-HDR2.
054100     05  NORMAL-LOT       PIC X(5)   VALUE SPACES.
054200     05  FILLER           PIC X(3)   VALUE SPACES.
054300     05  MSG50            PIC X(8)   VALUE SPACES.
054400     05  PRT-RAW-LOT      PIC ZZZZ.
054500     05  FILLER           PIC X(5)   VALUE SPACES.
054600     05  PRT-TALLY-MSG    PIC X(8)   VALUE SPACES.
054700     05  PRT-TALLY        PIC X(4).
054800     05  FILLER           PIC X(13)  VALUE SPACES.
054900     05  COMPRESS-LOT     PIC X(5)   VALUE SPACES.
055000     05  PRT2-STR-ORD     PIC Z(7)9.9999 VALUE ZEROES.
055100     05  PRT2-STR-ORD-R REDEFINES PRT2-STR-ORD PIC Z(12)9.
055200     05  FILLER           PIC X      VALUE SPACES.
055300     05  PRT2-STR-ORD-UM  PIC X(2)   VALUE SPACES.
055400     05  FILLER           PIC X(7)   VALUE SPACES.
055500     05  PRT2-STR-DLVR    PIC Z(7)9.9999 VALUE ZEROES.
055600     05  PRT2-STR-DLVR-R REDEFINES PRT2-STR-DLVR PIC Z(12)9.
055700     05  FILLER           PIC X      VALUE SPACES.
055800     05  PRT2-STR-DLVR-UM PIC X(2)   VALUE SPACES.
055900 01  PRT-ITM-HDR3.
056000     05  FILLER           PIC X(2)   VALUE SPACES.
056100     05  PRT3-REQ         PIC X(22)  VALUE SPACES.
056200     05  PRT3-REQ-INFO    PIC X(16)  VALUE SPACES.
056300     05  FILLER           PIC X(32)  VALUE SPACES.
056400     05  PRT3-CONT        PIC X(20)  VALUE SPACES.
056500     05  FILLER           PIC X(5)   VALUE SPACES.
056600     05  PRT3-CONT-DLVR   PIC Z(7)9.9999  VALUE ZEROES.
056700     05  PRT3-CONT-DLVR-R REDEFINES PRT3-CONT-DLVR PIC Z(12)9.
056800     05  FILLER           PIC X      VALUE SPACE.
056900     05  PRT3-CONT-UM     PIC X(2)   VALUE SPACES.
057000 01  PRT-DESC-HDR.
057100     05  NORMAL-DESC-1    PIC X(5)   VALUE SPACES.
057200     05  FILLER           PIC X(6)   VALUE SPACES.
057300     05  COMPRESS-DESC    PIC X(5)   VALUE SPACES.
057400     05  PRT-DESC-COMMENT PIC X(80)  VALUE SPACES.
057500     05  FILLER           PIC X(36)  VALUE SPACES.
057600     05  NORMAL-DESC-2    PIC X(5)   VALUE SPACES.
057700
057800 01  PRT-SUB-SUBDETL-ADDLDATA.
057900     05  FILLER           PIC X(28)  VALUE SPACES.
058000     05  COMPRESS-SSA     PIC X(5)   VALUE SPACES.
058100     05  FILLER           PIC X(4)   VALUE "SUB ".
058200     05  PRT-SUB2         PIC XXX    VALUE SPACES.
058300     05  MSG38            PIC X(11)  VALUE SPACES.
058400     05  PRT-SUB-DETL2    PIC X(4)   VALUE SPACES.
058500     05  MSG39            PIC X(12)  VALUE SPACES.
058600     05  PRT-ADDL-DATA    PIC X(10)  VALUE SPACES.
058700     05  NORMAL-SSA       PIC X(5)   VALUE SPACES.
058800
058900 01  PRT-COMMENT.
059000     05  PRT-COMM1        PIC X(10)  VALUE SPACES.
059100     05  PRT-ITEM-COMMENT PIC X(70)  VALUE SPACES.
059200
059300 01  PRT-REQ-LINE.
059400     05  NORMAL-REQ-1     PIC X(5)   VALUE SPACES.
059500     05  FILLER           PIC X(6)   VALUE SPACES.
059600     05  COMPRESS-REQ     PIC X(5)   VALUE SPACES.
059700     05  FILLER           PIC X(8)   VALUE "STAGE:  ".
059800     05  PRT-REQ-STAGE    PIC X(4)   VALUE SPACES.
059900     05  MSG40            PIC X(12)  VALUE SPACES.
060000     05  PRT-WO           PIC X(10)  VALUE SPACES.
060100     05  MSG41            PIC X(18)  VALUE SPACES.
060200     05  PRT-REQ-INFO     PIC X(16)  VALUE SPACES.
060300     05  MSG61            PIC X(10)  VALUE SPACES.
060400     05  PRT-REQ-SUBD     PIC X(4)   VALUE SPACES.
060500     05  MSG62            PIC X(14)  VALUE SPACES.
060600     05  PRT-REQ-ORIG     PIC X(4)   VALUE SPACES.
           05  FILLER           PIC X(2)   VALUE ", ".
           05  PRT-REQ-ORIG-NAME PIC X(16) VALUE SPACES.
060700     05  NORMAL-REQ-2     PIC X(5)   VALUE SPACES.

       01  PRT-REQ-NOTIFY-LINE.
           05  NORMAL-REQN-1    PIC X(5)   VALUE SPACES.
           05  FILLER           PIC X(6)   VALUE SPACES.
           05  COMPRESS-REQN    PIC X(5)   VALUE SPACES.
           05  FILLER           PIC X(85)  VALUE SPACES.
           05  PRT-REQ-NOTIFY-H PIC X(10)  VALUE "NOTIFY: ".
           05  PRT-REQ-NOTIFY   PIC X(10)  VALUE SPACES.
060700     05  NORMAL-REQN-2    PIC X(5)   VALUE SPACES.
060800
060900*----------  FOR CODED ITEMS ONLY
061000 01  PRT-STR-LOCS-1.
061100     05  NORMAL-LOCS-1    PIC X(5)   VALUE SPACES.
061200     05  PRT-STR-LIT      PIC X(16)  VALUE SPACES.
061400     05  PRT-DD-DETL      PIC X(4)   VALUE SPACES.
061500     05  FILLER           PIC X(2)   VALUE SPACES.
062400
061000 01  PRT-STR-LOCS-2.
           05  FILLER           PIC X(02)  VALUE SPACES.
061700     05  PRT-LOC1         PIC X(12)  VALUE SPACES.
061700     05  PRT-LOC1-9 REDEFINES PRT-LOC1  PIC ZZZZ,ZZZ,ZZ9.
061800     05  PRT-SEMI1        PIC X      VALUE SPACES.
061900     05  PRT-LOCATION-ENTRY.
062000         10  PRT-LOCATIONS OCCURS 5 TIMES.
062100             15 PRT-LOC   PIC X(12).
061700             15 PRT-LOC-9 REDEFINES PRT-LOC  PIC ZZZZ,ZZZ,ZZ9.
062200             15 PRT-SEMI  PIC X.
062400
062500 01  PRT2-STR-DLVR-UM-PRICE.
062600     05  NORMAL-DLVR      PIC X(5)   VALUE SPACES.
062700     05  PRT-COMPLETE     PIC X(16)  VALUE SPACES.
062800     05  FILLER           PIC X(2)   VALUE SPACES.
062900     05  PRICE-UMH        PIC X(11)  VALUE SPACES.
063000     05  PRICE-UM         PIC X(2)   VALUE SPACES.
063100     05  FILLER           PIC X(3)   VALUE SPACES.
063200     05  PRICE-H          PIC X(8)   VALUE SPACES.
063300     05  PRT-PRICE-X      PIC X(13).
063400     05  PRT-PRICE REDEFINES PRT-PRICE-X  PIC ZZZZZZZ9.9999.

       01  PRT-CHAT-LINE.
           05  FILLER           PIC X(6)   VALUE SPACES.
           05  COMPRESS-CHAT    PIC X(5)   VALUE SPACES.
           05  PRT-CHAT-HDR     PIC X(5)   VALUE "CHAT:".
           05  FILLER           PIC X(01)  VALUE SPACES.
           05  PRT-CHATNO       PIC X(6)   VALUE SPACES.
           05  FILLER           PIC X(1)   VALUE SPACES.
           05  PRT-CHAT-MFR     PIC X(26)  VALUE SPACES.
           05  FILLER           PIC X(1)   VALUE SPACES.
           05  PRT-CHAT-TRADE   PIC X(79)  VALUE SPACES.
           05  FILLER           PIC X(7)   VALUE SPACES.
           05  NORMAL-CHAT      PIC X(5)   VALUE SPACES.

       01  PRTWK-AREA           PIC X(132).
       01  PRTWK-STD-INST-LINE  REDEFINES PRTWK-AREA.
               10  FILLER            PIC X(4).
               10  PRTWK-STD-INST    PIC X(88).
               10  PRTWK-STD-INST-C REDEFINES PRTWK-STD-INST.
                   15  PRTWK-STD-INST-COMP-START  PIC X(8).
                   15  PRTWK-STD-INST-COMP        PIC X(72).
                   15  PRTWK-STD-INST-COMP-END    PIC X(8).
               10  PRTWK-STD-INST-E REDEFINES PRTWK-STD-INST.
                   15  PRTWK-STD-INST-EXP-START   PIC X(8).
                   15  PRTWK-STD-INST-EXP         PIC X(40).
                   15  PRTWK-STD-INST-EXP-END     PIC X(8).
                   15  FILLER                     PIC X(32).
               10  FILLER            PIC X(40).

       01  END-RCV-MSG.
           05  FILLER                PIC X(11)    VALUE SPACES.
           05  END-MSG               PIC X(58)    VALUE
           "-------------------- END OF RECEIVER --------------------".
           05  FILLER                PIC X(11)    VALUE SPACES.


063500 LINKAGE SECTION.
063600*----------  PARAMETERS PASSED TO RECEIVER REPRINT PROGRAM
       01  BASE-MMISA           PIC X(24).

063700 COPY DOCKMISC OF COPYLIB.
063800
063900 COPY RCVPRT OF COPYLIB.
064000 01  RCVR-PRINT-ITEMS.
064100     05  RCVR-ITEM OCCURS 999 TIMES INDEXED BY RI  PIC X(4).
064200
064300 COPY VCOMLINK OF COPYLIB.
064500 COPY LANGSUB  OF COPYLIB.
064600
064700*----------  TABLE FOR ITEMS THAT NEED A PHYSICAL COUNT.  IF
064800*            ITEM NEEDS A COUNT, "Y" IS PLACED IN TABLE.
064900 01  COUNT-AREA                PIC X(999).
065000 01  COUNT-TABLE REDEFINES COUNT-AREA.
065100     02  COUNT-ITEM OCCURS 999 TIMES     PIC X.
064400 COPY ESCNAME OF COPYLIB.
065200*************************************************************
065300*************************************************************'
065400*                   MAIN PARAGRAGH                          *
065500*     RETRIEVE HEADER AND FREIGHT INFORMATION FOR RECEIVER  *
065600*     AND THEN DETERMINE IF  RECEIVER IS CODED OR NONCODED. *
065700*     READ THROUGH EACH RECEIVER'S ITEMS TO DETERMINE HOW   *
065800*     MANY PAGES THE PRINTOUT WILL BE, AND THEN START OVER  *
065900*     AND PRINT THE SECOND TIME THROUGH THE ITEMS.          *
066000*                                                           *
066100*     RECEIVING SLIP REPRINT WILL NOT HAVE FREIGHT OSD      *
066200*     COMMENTS PRINTED OR HAVE CODED RECEIVING UM PRINTED.  *
066300*     THESE ITEMS ARE NOT STORED IN THE DATABASE.  THEY     *
066400*     ARE PASSED PARAMETERS WHEN A RECEIVER IS CREATED.     *
066500*     IF AKRON AND IF A C-ORDER HAS A DIFFERENT ORDERED UM  *
066600*     FROM THE DELIVERED UM, THE PRICE DATA IS PASSED       *
066700*     WHEN A RECEIVER IS CREATED, BUT NOT FOR A REPRINT.    *
066800*************************************************************
066900*************************************************************
067000 PROCEDURE DIVISION USING BASE-MMISA MISCELLANEOUS-DATA
067100                    RCVR-PRINT-PARAMETERS RCVR-PRINT-ITEMS
067200                    VIEW-COMAREA, LANGUAGE-PARMS, COUNT-AREA,
067300                    ESC-NAME.
067400 00-PRINT SECTION 00.
067500 00-SRSPRT-MAIN.
           MOVE ZEROES TO PG-NO.
           MOVE SPACES TO DISP-FRT-PO, DISP-FRT-RLSE, DISP-FRT-RS.
067600     IF MISC-REPRINT = "Y"
067700        MOVE "R C V  S L I P  R E P R I N T"  TO HDR1-TITLE
067800     ELSE
067900        MOVE "  R E C E I V I N G  S L I P  " TO HDR1-TITLE.
068000     MOVE CHAR-1636PI TO STRIP.
068100     MOVE STRIP       TO COMPRESS-1-1
068200                         COMPRESS-1-2
068300                         COMPRESS-2
068400                         COMPRESS-4A
068500                         COMPRESS-6
068600                         COMPRESS-PCM
068700                         COMPRESS-ITM
068800                         COMPRESS-DESC
068900                         COMPRESS-SSA
069000                         COMPRESS-REQ
069000                         COMPRESS-REQN
069100                         COMPRESS-LOT
                               COMPRESS-CHAT.
069300     MOVE CHAR-5PI    TO STRIP.
069400     MOVE STRIP       TO EXPAND-1.
           MOVE IBM-DOUBLE-WIDE-OFF TO STRIP.
           MOVE STRIP       TO EXP-1-OFF.
069500     MOVE CHAR-10PI   TO STRIP.
069600     MOVE STRIP       TO NORMAL-1A
069700                         NORMAL-2
069800                         NORMAL-3
069900                         NORMAL-ZBL
070000                         NORMAL-4A
070100                         NORMAL-PCM
070200                         NORMAL-ITM
070300                         NORMAL-DESC-1
070400                         NORMAL-DESC-2
070500                         NORMAL-SSA
070600                         NORMAL-LOCS-1
070800                         NORMAL-REQ-1
                               NORMAL-REQN-1
070900                         NORMAL-REQ-2
                               NORMAL-REQN-2
071000                         NORMAL-LOT
071100                         NORMAL-SEQ
071200                         NORMAL-DLVR
                               COMPRESS-1-OFF
                               NORMAL-CHAT.
071300
071400*----------  READ IN LITERALS FOR RECEIVING SLIP
071500     MOVE 64               TO LANG-SETNUM.
071600     MOVE 1                TO LANG-MSGNUM.
071700     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
071800     MOVE MESSAGE-BUFFER              TO MSG1.
071900     MOVE 2                           TO LANG-MSGNUM.
072000     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
072100     MOVE MESSAGE-BUFFER              TO MSG2.
072200     MOVE 3                           TO LANG-MSGNUM.
072300     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
072400     MOVE MESSAGE-BUFFER              TO MSG3.
072500     MOVE 4                           TO LANG-MSGNUM.
072600     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
072700     MOVE MESSAGE-BUFFER              TO MSG4.
072800     MOVE 5                           TO LANG-MSGNUM.
072900     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
073000     MOVE MESSAGE-BUFFER              TO MSG5.
073100     MOVE 6                           TO LANG-MSGNUM.
073200     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
073300     MOVE MESSAGE-BUFFER              TO MSG6.
073400     MOVE 7                           TO LANG-MSGNUM.
073500     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
073600     MOVE MESSAGE-BUFFER              TO MSG7.
073700     MOVE 8                           TO LANG-MSGNUM.
073800     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
073900     MOVE MESSAGE-BUFFER              TO MSG8.
074000     MOVE 9                           TO LANG-MSGNUM.
074100     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
074200     MOVE MESSAGE-BUFFER              TO MSG9.
074300     MOVE 10                           TO LANG-MSGNUM.
074400     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
074500     MOVE MESSAGE-BUFFER              TO MSG10.
074600     MOVE 11                           TO LANG-MSGNUM.
074700     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
074800     MOVE MESSAGE-BUFFER              TO MSG11.
074900     MOVE 12                           TO LANG-MSGNUM.
075000     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
075100     MOVE MESSAGE-BUFFER              TO MSG12.
075200     MOVE 13                           TO LANG-MSGNUM.
075300     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
075400     MOVE MESSAGE-BUFFER              TO MSG13.
075500     MOVE 14                           TO LANG-MSGNUM.
075600     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
075700     MOVE MESSAGE-BUFFER              TO MSG14.
075800     MOVE 15                           TO LANG-MSGNUM.
075900     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
076000     MOVE MESSAGE-BUFFER              TO MSG15.
076100     MOVE 16                           TO LANG-MSGNUM.
076200     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
076300     MOVE MESSAGE-BUFFER              TO MSG16.
076400     MOVE 17                           TO LANG-MSGNUM.
076500     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
076600     MOVE MESSAGE-BUFFER              TO MSG17, PRT-COMM1.
076700     MOVE 18                           TO LANG-MSGNUM.
076800     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
076900     MOVE MESSAGE-BUFFER              TO MSG18.
077000     MOVE 19                           TO LANG-MSGNUM.
077100     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
077200     MOVE MESSAGE-BUFFER              TO MSG19.
077300     MOVE 20                           TO LANG-MSGNUM.
077400     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
077500     MOVE MESSAGE-BUFFER              TO MSG20.
077600     MOVE 21                           TO LANG-MSGNUM.
077700     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
077800     MOVE MESSAGE-BUFFER              TO MSG21.
077900     MOVE 22                           TO LANG-MSGNUM.
078000     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
078100     MOVE MESSAGE-BUFFER              TO MSG22.
078200     MOVE 23                           TO LANG-MSGNUM.
078300     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
078400     MOVE MESSAGE-BUFFER              TO MSG23.
078500     MOVE 24                           TO LANG-MSGNUM.
078600     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
078700     MOVE MESSAGE-BUFFER              TO MSG24.
078800     MOVE 25                           TO LANG-MSGNUM.
078900     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
079000     MOVE MESSAGE-BUFFER              TO MSG25.
079100     MOVE 26                           TO LANG-MSGNUM.
079200     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
079300     MOVE MESSAGE-BUFFER              TO MSG26.
079400     MOVE 27                           TO LANG-MSGNUM.
079500     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
079600     MOVE MESSAGE-BUFFER              TO MSG27.
079700     MOVE 28                           TO LANG-MSGNUM.
079800     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
079900     MOVE MESSAGE-BUFFER              TO MSG28.
080000     MOVE 29                           TO LANG-MSGNUM.
080100     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
080200     MOVE MESSAGE-BUFFER              TO MSG29.
080300     MOVE 30                           TO LANG-MSGNUM.
080400     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
080500     MOVE MESSAGE-BUFFER              TO MSG30.
080600     MOVE 31                           TO LANG-MSGNUM.
080700     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
080800     MOVE MESSAGE-BUFFER              TO MSG31.
080900     MOVE 32                           TO LANG-MSGNUM.
081000     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
081100     MOVE MESSAGE-BUFFER              TO MSG33.
081200     MOVE 33                           TO LANG-MSGNUM.
081300     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
081400     MOVE MESSAGE-BUFFER              TO MSG32, MSG34.
081500     MOVE 34                           TO LANG-MSGNUM.
081600     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
081700     MOVE MESSAGE-BUFFER              TO MSG35.
081800     MOVE 35                           TO LANG-MSGNUM.
081900     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
082000     MOVE MESSAGE-BUFFER              TO MSG36.
082100     MOVE 36                           TO LANG-MSGNUM.
082200     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
082300     MOVE MESSAGE-BUFFER              TO MSG37.
082400     MOVE 37                           TO LANG-MSGNUM.
082500     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
082600     MOVE MESSAGE-BUFFER              TO MSG38.
082700     MOVE 38                           TO LANG-MSGNUM.
082800     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
082900     MOVE MESSAGE-BUFFER              TO MSG39.
083000     MOVE 39                           TO LANG-MSGNUM.
083100     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
083200     MOVE MESSAGE-BUFFER              TO MSG40.
083300     MOVE 49                           TO LANG-MSGNUM.
083400     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
083500     MOVE MESSAGE-BUFFER               TO MSG42.
083600     IF MISC-REPRINT = "Y"
083700        MOVE 41                           TO LANG-MSGNUM
083800     ELSE
083900        MOVE 42                           TO LANG-MSGNUM.
084000     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
084100     MOVE MESSAGE-BUFFER                           TO HDR1-TITLE.
084200     MOVE 43                           TO LANG-MSGNUM.
084300     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
084400     MOVE MESSAGE-BUFFER               TO VEN-LIT-SAVE.
084500     MOVE 44                           TO LANG-MSGNUM.
084600     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
084700     MOVE MESSAGE-BUFFER               TO BUYER-LIT-SAVE.
084800     MOVE 45                           TO LANG-MSGNUM.
084900     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
085000     MOVE MESSAGE-BUFFER               TO SELLER-LIT-SAVE.
085100     MOVE 46                           TO LANG-MSGNUM.
085200     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
085300     MOVE MESSAGE-BUFFER               TO HDR6-CODE.
085400     MOVE 47                           TO LANG-MSGNUM.
085500     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
085600     MOVE MESSAGE-BUFFER               TO HDR6-DESC.
085700     MOVE 48                           TO LANG-MSGNUM.
085800     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
085900     MOVE MESSAGE-BUFFER               TO PRICE-QTY-SAVE.
086000     MOVE 50                           TO LANG-MSGNUM.
086100     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
086200     MOVE MESSAGE-BUFFER               TO LOT-MSG-WS.
086300     MOVE 51                           TO LANG-MSGNUM.
086400     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
086500     MOVE MESSAGE-BUFFER               TO TALLY-MSG-WS.
086600     MOVE 52                           TO LANG-MSGNUM.
086700     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
086800     MOVE MESSAGE-BUFFER               TO MSG61.
086900     MOVE 53                           TO LANG-MSGNUM.
087000     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
087100     MOVE MESSAGE-BUFFER               TO MSG62.
087200     MOVE MISC-RS-ARG TO WS-RECEIVER, WS-ACCUMULATOR.
087300     MOVE "000" TO WS-ACCUM-RS.
087400     MOVE WS-ACCUMULATOR TO PO-ARG.
087500     MOVE PLT-NUMBER TO WHICH-PLANT.
087600
           MOVE "MCFPCS7000"   TO  CHKOBJ-FILE-NAME.
           CALL "CCHKOBJ" USING    CHKOBJ-FILE-NAME,
                                   CHKOBJ-RETURN-STATUS.
           IF CHKOBJ-RETURN-STATUS  = "00"
               MOVE "Y"        TO  PRINT-DCOMPL-SW
           ELSE
               MOVE "N"        TO  PRINT-DCOMPL-SW.

           OPEN INPUT DVENDOR
                      DPOITEM
                      MPORCV
                      DREQD
                      MSTORERM
                      MREQ
                      DVENDITM
                      DPOFREIGHT
                      DRCVITEM
                      DPODATAITM
                      DPORECD
                      PER-PERSONNEL
                      DCHATNO
                      DCOMMENT.
087700     PERFORM 100-GET-DPORECD THRU 199-EXIT.
087800     IF NO-RECEIVER
087900        GO TO 09-EXIT.
088000
088100     PERFORM 040-OPEN-SPOOLFILES THRU 049-EXIT.
088200
088300     PERFORM 200-GET-DPOFREIGHT THRU 299-EXIT.
088400
088500     PERFORM 400-FIND-RECEIVER THRU 499-EXIT.

      *----------  GET BEFORE/AFTER RCV INSTRUCTIONS
           PERFORM 600-GET-RCV-INST THRU 600-GRI-X.

           PERFORM 500-PRINT-RCVR THRU 599-EXIT.

      *----------  PRINT RCV AFTER INSTRUCTIONS
           IF RCV-AFTER-INST NOT = SPACES
              MOVE 1 TO LINE-ADV
              ADD  1 TO LINE-CTR
              MOVE SPACES TO PRINT-RCD
              PERFORM 860-PRT-LINE THRU 869-EXIT
              PERFORM 601-PRINT-RCV-INST THRU 601-PRI-X
                  VARYING SUB FROM 7 BY 1
                    UNTIL SUB > 12.
088800
088900*----------  SET PRINT BACK TO NORMAL FROM COMPRESSED
           MOVE NORMAL-DLVR     TO PLINE.
089100     PERFORM 860-PRT-LINE THRU 869-EXIT.

      *----------  PRINT END OF RECEIVER MESSAGE
           MOVE 1 TO LINE-ADV.
           ADD 1 TO LINE-CTR.
           MOVE SPACES TO PRINT-RCD.
           MOVE END-RCV-MSG TO PRINT-RCD.
           PERFORM 860-PRT-LINE THRU 869-EXIT.
089200
089300     PERFORM 050-CLOSE-SPOOLFILES THRU 059-EXIT.
089400
089500 09-EXIT.
089600     GOBACK.
089700*************************************************************
089800**      OPEN AS MANY SPOOLFILES AS WERE REQUESTED          **
089900*************************************************************
090000 040-OPEN-SPOOLFILES.
           MOVE SPOOL-PRT-NO TO OVRPRTF-TOFILE-NUM.
           MOVE "MCPRT"      TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
090800     OPEN OUTPUT ONLINE-PRT.
090900
           IF ACCTG-PRT-NO NOT = ZEROES
              MOVE ACCTG-PRT-NO TO OVRPRTF-TOFILE-NUM
              MOVE "MCPRT2"     TO OVRPRTF-FILE
              PERFORM 996-OVERRIDE-PRINT-FILE
              OPEN OUTPUT ACCTG-PRT.

092100     IF PRINT-PRT-NO NOT = ZEROES
              MOVE PRINT-PRT-NO TO OVRPRTF-TOFILE-NUM
              MOVE "MCPRT3"     TO OVRPRTF-FILE
              PERFORM 996-OVERRIDE-PRINT-FILE
093000        OPEN OUTPUT THIRD-PRT.
093100
093200     IF MISC-CAPITAL-SPOOLER NOT = ZEROES
              IF MISC-CAP-RCVR = "Y"
              MOVE MISC-CAPITAL-SPOOLER TO OVRPRTF-TOFILE-NUM
              MOVE "MCPRT4"     TO OVRPRTF-FILE
              PERFORM 996-OVERRIDE-PRINT-FILE
094200        OPEN OUTPUT CAPITAL-PRT.
094300
094400     IF RAW-MAT-SPOOLER NOT = ZEROES
094500        IF RAW-MAT-PRINT = "Y"
              MOVE RAW-MAT-SPOOLER TO OVRPRTF-TOFILE-NUM
              MOVE "MCPRT5"     TO OVRPRTF-FILE
              PERFORM 996-OVERRIDE-PRINT-FILE
095400        OPEN OUTPUT RAWMAT-PRT.
095500
095600 049-EXIT.  EXIT.
095700*************************************************************
095800**     CLOSE AS MANY SPOOLFILES AS WERE REQUESTED          **
095900*************************************************************
096000 050-CLOSE-SPOOLFILES.
097400     CLOSE ONLINE-PRT.
097500     IF ACCTG-PRT-NO NOT = ZEROES
098700             CLOSE ACCTG-PRT.
098800
098900     IF PRINT-PRT-NO NOT = ZEROES
100300             CLOSE THIRD-PRT.
100400
100500     IF MISC-CAPITAL-SPOOLER NOT = ZEROES
100600        IF MISC-CAP-RCVR = "Y"
101800             CLOSE CAPITAL-PRT.
101900
102000     IF RAW-MAT-SPOOLER NOT = ZEROES
102100          IF RAW-MAT-PRINT = "Y"
103300             CLOSE RAWMAT-PRT.
103400
           CLOSE      DVENDOR
                      DREQD
                      MREQ
                      DPOFREIGHT
                      DPOITEM
                      DRCVITEM
                      MSTORERM
                      DPODATAITM
                      MPORCV
                      DPORECD
                      PER-PERSONNEL
                      DCOMMENT.
103500 059-EXIT.  EXIT.
103600*************************************************************
103700*            READ DPORECD FOR PRINT DATA AND TO             *
103800*            DETERMINE IF RECEIVER IS CODED OR NONCODED.    *
103900*************************************************************
104000 100-GET-DPORECD.
104100*----------  MOVE RS NUMBER TO PRINTOUT
104200     MOVE WS-PO                    TO DISP-PO.
104300     MOVE WS-RLSE                  TO DISP-RLSE.
104400     MOVE WS-RS                    TO DISP-RS.
104500     MOVE DISPLAY-PO-RLSE-RS       TO PRT-PO-RLSE-RS.
104600
104700*----------  FIND SEQUENCE NUMBER OF RECEIVING SLIP
           MOVE 0 TO COND-WORD.
           MOVE MISC-RS-ARG TO PORCVNO OF MPORCV-REC.
           READ MPORCV INTO BUF-MPORCV
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
105000
105100*----------  IF NO ENTRY, THEN WHEN CREATING THE RECEIVER, THE
105200*            USER SKIPPED ALL ITEMS AND CODE FALLS THROUGH.
105300     IF NO-ENTRY
105400        MOVE 1 TO DO-NOTHING
105500        GO TO 199-EXIT.
105600
105700     IF NOT GOOD-CALL
105800        MOVE "DBGET MPORCV 100 SRSPRT" TO BU-DISPLAY-MSG
105900        PERFORM 990-BLOWUP THRU 999-EXIT.
106000
106100     MOVE M-PO-RCV-SEQ TO SEQ-2D.
106200
106300*---------  USE PO NUMBER TO FIND HEADER INFORMATION
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPORECD-REC.
           START DPORECD KEY = PORCVNO OF DPORECD-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
106600     IF NOT GOOD-CALL
106700        MOVE "DBFIND DPORECD AT 200 SRSPRT" TO BU-DISPLAY-MSG
106800        PERFORM 990-BLOWUP THRU 999-EXIT.
106900
           MOVE 0 TO COND-WORD.
           READ DPORECD NEXT INTO BUF-DPORECD
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPORECD-REC NOT = PO-ARG
               MOVE 15 TO COND-WORD.
107200     IF NOT GOOD-CALL
107300        MOVE "DBGET DPORECD AT 200 SRSPRT" TO BU-DISPLAY-MSG
107400        PERFORM 990-BLOWUP THRU 999-EXIT.
107500
107600     MOVE PO-REQ-NUMBER       TO   SAVE-REQ.
107700     MOVE PO-BUDGET-NUMBER    TO   PRT-BUD-NO.
107800
107900     MOVE PO-DATE             TO   DATE-VALIDATE-IN.
108000     MOVE 4                   TO   DATE-MODE.
108100     CALL "TDATECHK" USING DATE-CHECK-AREA.
108200     MOVE DATE-SLASH-OUT      TO   PRT-PO-DATE.
108300     MOVE PO-FOR-DEPT         TO   PRT-FOR-DEPT.
108400     MOVE PO-RCV-DEPT         TO   PRT-RCV-DEPT.
108500     MOVE PO-ADDL-INFO        TO   PRT-ADDL-INFO.
108600     IF PO-SHIP-DATE IS NUMERIC
108700        MOVE PO-SHIP-DATE     TO   DATE-VALIDATE-IN
108800        CALL "TDATECHK" USING DATE-CHECK-AREA
108900        MOVE DATE-SLASH-OUT   TO PRT-SHIP-DATE
109000     ELSE
109100         MOVE SPACES          TO   PRT-SHIP-DATE
109200         MOVE PO-SHIP-DATE    TO   PRT-SHIP-DATE.
109300     MOVE PO-SUB              TO   PRT-SUB.
109400     MOVE PO-SUB-DET          TO   PRT-SUB-DETL.
109500     MOVE PO-VEN-CODE         TO   VEN-ARG.
109600     MOVE PO-BUYER            TO   PRT-BUYER.
109700     MOVE BUYER-LIT-SAVE      TO   BUYER-LIT.
109800     MOVE PO-FOB              TO   FOB-2D.
109900
110000 199-EXIT.  EXIT.
110100*************************************************************
110200*         READ DPOFREIGHT TO FIND FREIGHT INFORMATION       *
110300*************************************************************
110400 200-GET-DPOFREIGHT.
           MOVE SPACES TO SAVE-PACK-SLIP.
           MOVE 0 TO COND-WORD.
           MOVE MISC-RS-ARG TO PORCVNO OF DPOFREIGHT-REC.
           START DPOFREIGHT KEY = PORCVNO OF DPOFREIGHT-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2" OR FILE-STATUS = "00"
               NEXT SENTENCE
           ELSE
               MOVE 99 TO COND-WORD.
110700     IF COND-WORD NOT = 0
110800           MOVE "DBFIND DPOFRGHT 200 RSPRT" TO BU-DISPLAY-MSG
110900           PERFORM 990-BLOWUP THRU 999-EXIT.
111000
           MOVE 0 TO COND-WORD.
           READ DPOFREIGHT NEXT INTO BUF-DPOFREIGHT
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPOFREIGHT-REC NOT = MISC-RS-ARG
               MOVE 15 TO COND-WORD.
111300     IF COND-WORD NOT = 0
111400         IF COND-WORD = 15
111500             MOVE SPACES TO DISPLAY-FRT-REFER
111600             MOVE "NO FRGHT" TO PRPD-COLLECT-H2A
111700             GO TO 299-EXIT
111800         ELSE
111900           MOVE "DBGET DPOFREIGHT 200 RSPRT" TO BU-DISPLAY-MSG
112000           PERFORM 990-BLOWUP THRU 999-EXIT.
112100
112200     IF FRT-REFERBACK NOT  = SPACES
112300        MOVE FRT-REFERBACK TO FRT-ARG
112400        MOVE FRT-REFER-PO     TO DISP-FRT-PO
112500        MOVE FRT-REFER-RLSE   TO DISP-FRT-RLSE
112600        MOVE FRT-REFER-RS     TO DISP-FRT-RS
              IF PO-INVOICELESS-IND = "X"
                  MOVE FRT-PACK-SLIP    TO SAVE-PACK-SLIP
              END-IF
              PERFORM 250-FIND-FRTREFER
112900        IF NOT GOOD-CALL
113000           MOVE "DBFIND DPOFREIGHT2 200 RSPRT" TO BU-DISPLAY-MSG
113100           PERFORM 990-BLOWUP THRU 999-EXIT
113200        ELSE
              PERFORM 260-GET-FRTREFER
113500        IF END-OF-CHAIN
113600           MOVE SPACES TO DISPLAY-FRT-REFER
113700           MOVE "NO FRGHT" TO PRPD-COLLECT-H2A
113800           GO TO 299-EXIT
113900        ELSE
114000           IF NOT GOOD-CALL
114100              MOVE "DBGET2 DPOFREIGHT 200 RSPRT" TO BU-DISPLAY-MSG
114200              PERFORM 990-BLOWUP THRU 999-EXIT
                 END-IF
              END-IF
              IF PO-INVOICELESS-IND = "X" AND
                 SAVE-PACK-SLIP NOT = SPACES
                  MOVE SAVE-PACK-SLIP TO FRT-PACK-SLIP.
114300
114400 210-MOVE-FREIGHT-DATA.
114500     MOVE PO-ZBILL           TO PRT-Z-BILL.
114600     IF AKRON
114700        MOVE FRT-ZBILL       TO PRT-Z-BILL.
114800     MOVE FRT-CARRIER        TO CARRIER-H2.
114900     MOVE FRT-BILL-NO        TO PRO-NUM-H2.
115000     IF FRT-BILL-DATE NOT = SPACES
115100        MOVE FRT-BILL-DATE TO DATE-VALIDATE-IN
115200        MOVE 4 TO DATE-MODE
115300        CALL "TDATECHK" USING DATE-CHECK-AREA
115400        MOVE DATE-SLASH-OUT TO PRO-DATE-H2
115500     ELSE
115600        MOVE SPACES TO PRO-DATE-H2.
115700     MOVE FRT-CHARGES-9      TO FREIGHT-H2A.
115800     MOVE FRT-PACK-SLIP      TO P-SLIP-H2.
115900     MOVE FRT-CARRIER-WT     TO C-WT-H2A.
116000     MOVE FRT-OUR-WT         TO O-WT-H2A.
116100     MOVE FRT-SPLC           TO ORIGIN-H2.
116200     MOVE FRT-EMPL           TO EMPL-2B.
116300     MOVE FRT-LOT            TO LOT-NO-2B.
116400     MOVE FRT-RAIL-CAR       TO CAR-NO-2B.
116500     MOVE FRT-SEALS          TO SEALS-2B.
116600     MOVE FRT-OSD            TO OSD-NO-2C.
116700*    MOVE MISC-FRT-COMMENT      TO  COMMENT-2C.
           MOVE FRT-OSD-CLAIM      TO COMMENT-2C.
116800     IF FRT-TYPE = "P"
116900        IF AKRON
117000           MOVE "PREPAID"    TO PRPD-COLLECT-H2A
117100        ELSE
117200           IF DISP-FRT-PO = SPACES
117300              MOVE "PREPAID" TO PRPD-COLLECT-H2A
117400           ELSE
117500              MOVE "PRIOR-P" TO PRPD-COLLECT-H2A.
117600
117700     IF FRT-TYPE = "C"
117800        IF AKRON
117900           MOVE "COLLECT"    TO PRPD-COLLECT-H2A
118000        ELSE
118100            IF DISP-FRT-PO = SPACES
118200               MOVE "COLLECT"  TO PRPD-COLLECT-H2A
118300            ELSE
118400              MOVE "PRIOR-C" TO PRPD-COLLECT-H2A.
118500
118600     IF FRT-TYPE = "G"
118700        IF AKRON
118800           MOVE "GOODYEAR"    TO PRPD-COLLECT-H2A
118900        ELSE
119000            IF DISP-FRT-PO = SPACES
119100               MOVE "GOODYEAR"  TO PRPD-COLLECT-H2A
119200            ELSE
119300            MOVE "PRIOR-G"    TO PRPD-COLLECT-H2A.
119400
119500     IF FRT-TYPE = "U"
119600        MOVE "UPS"            TO PRPD-COLLECT-H2A.
119700
119800     IF FRT-TYPE = "D"
119900        MOVE "LOCAL"          TO PRPD-COLLECT-H2A.
120000
120100     IF FRT-TYPE = "M"
120200        MOVE "PRIOR"          TO PRPD-COLLECT-H2A.
120300     GO TO 299-EXIT.
       250-FIND-FRTREFER.
              MOVE 0 TO COND-WORD
              MOVE FRT-ARG TO PORCVNO OF DPOFREIGHT-REC
              START DPOFREIGHT KEY = PORCVNO OF DPOFREIGHT-REC
                    INVALID KEY MOVE 17 TO COND-WORD.
              IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
       260-GET-FRTREFER.
           MOVE 0 TO COND-WORD.
           READ DPOFREIGHT NEXT INTO BUF-DPOFREIGHT
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPOFREIGHT-REC NOT = FRT-ARG
               MOVE 15 TO COND-WORD.
120400 299-EXIT.  EXIT.
120500*************************************************************
120600*         READ THROUGH ALL ITEMS ON RECEIVER AND GET        *
120700*         THE DESCRIPTIONS FOR EACH.  WRITE THE DESC-       *
120800*         RIPTIONS TO A FILE TO BE USED LATER DURING        *
120900*         THE ACTUAL WRITING OF THE RECEIVER.  KEEP         *
121000*         TRACK NOW OF THE NUMBER OF PRINT LINES THAT       *
121100*         WILL BE REQUIRED SO THE TOTAL NUMBER OF PAGES     *
121200*         CAN BE WRITTEN ON EACH PAGE OF THE RECEIVER.      *
121300*************************************************************
121400 400-FIND-RECEIVER.
121500     MOVE SPACES                TO BUF-MSTORERM.
121600*----------  FIND SPECIFIC ENTRY FOR RECEIVER
           MOVE 0 TO COND-WORD.
           MOVE MISC-RS-ARG TO PORCVNO OF DRCVITEM-REC.
           START DRCVITEM KEY NOT < PORCVNO OF DRCVITEM-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
121900     IF NOT GOOD-CALL
122000           MOVE "DBFIND DRCVITEM -SRSPRT  " TO BU-DISPLAY-MSG
122100           PERFORM 990-BLOWUP THRU 999-EXIT.

      *----------  CREATE TEMPORARY FILE FOR DESCRIPTION
           MOVE "QTEMP"        TO CCRTFILE-LIBRARY.
           MOVE "RCHLDPRT"     TO CCRTFILE-FILE.
           MOVE "0084"         TO CCRTFILE-RECORD-LENGTH.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE
                                 CCRTFILE-RECORD-LENGTH
                                 CCRTFILE-NO-RECORDS
                                 CCRTFILE-INCREMENT-AMT
                                 CCRTFILE-NO-INCREMENTS
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
              MOVE "CCRTFILE CREATE OF RCHLDPRT FAILED"
                   TO BU-DISPLAY-MSG
                   PERFORM 990-BLOWUP THRU 999-EXIT.
122200     OPEN OUTPUT HOLD-PRT.
122300     MOVE 1 TO PG-LIMIT.
122400     MOVE 0 TO I.
122500     MOVE 25 TO LINE-CTR.
122600
122700 405-GET-NEXT-ITEM.
           MOVE 0 TO COND-WORD.
           READ DRCVITEM NEXT INTO BUF-DRCVITEM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DRCVITEM-REC NOT = MISC-RS-ARG
               MOVE 15 TO COND-WORD.
123000     IF END-OF-CHAIN
123100        CLOSE HOLD-PRT
123200        GO TO 499-EXIT.
123300     IF NOT GOOD-CALL
123400        MOVE "DBGET DRCVITEM 405 SRSPRT" TO BU-DISPLAY-MSG
123500        PERFORM 990-BLOWUP THRU 999-EXIT.
123600
123700*----------  IF SPECIFIC ITEMS WERE LISTED ON A REPRINT, SEARCH
123800*            ONLY FOR THOSE ITEMS.
           IF MISC-REPRINT NOT = "Y"
              GO TO 406-CONTINUE.
123900     IF RCVR-PRINT-ITEMS NOT = ZERO
      *       "0000000000000000000000000000000000000000"
124000        SET RI TO 1
124100        SEARCH RCVR-ITEM
124200                AT END GO TO 405-GET-NEXT-ITEM
124300                WHEN RCVR-ITEM (RI) = RCV-ITEM-NUMBER
124400                GO TO 406-CONTINUE.
124500
124600 406-CONTINUE.
124700*----------  COUNT QTY COUNT MSG IF NEEDED
124800     ADD 1 TO I.
124900     IF COUNT-ITEM (I) = "Y"
125000        ADD 1 TO LINE-CTR
125100        IF LINE-CTR > 55
125200           MOVE 8 TO LINE-CTR
125300           ADD 1 TO PG-LIMIT.
125400
125500*-----------  COUNT COMMENT LINE
125600        ADD 1 TO LINE-CTR
125700        IF LINE-CTR > 55
125800           MOVE 8 TO LINE-CTR
125900           ADD 1 TO PG-LIMIT.
126000
126100*-----------  ALWAYS COUNT RETURNABLE CONTAINERS
126200        ADD 1 TO LINE-CTR
126300        IF LINE-CTR > 55
126400           MOVE 8 TO LINE-CTR
126500           ADD 1 TO PG-LIMIT.
126600
126700     MOVE RCV-DATE-RCVD TO DATE-VALIDATE-IN.
126800     MOVE 4 TO DATE-MODE.
126900     CALL "TDATECHK" USING DATE-CHECK-AREA.
127000     MOVE DATE-SLASH-OUT TO RCV-DATE-2D.
127100     IF RCV-CORP-CODE = "NON-STR"
127200        GO TO 415-GET-ACCUMULATOR-UM.
127300
127400*----------   FIND AND GET ALL COMMENT LINES (LOCATED IN THE
127500*----------   DATASET DPODATAITM) AND STORE IN THE HOLD FILE
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPODATAITM-REC.
           START DPODATAITM KEY NOT < PORCVNO OF DPODATAITM-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS = "00" OR FILE-STATUS-1 = "2"
               MOVE 0 TO COND-WORD
           ELSE
127900           MOVE "DBFIND DPODATAITM 405 SRSPRT" TO BU-DISPLAY-MSG
128000           PERFORM 990-BLOWUP THRU 999-EXIT.
128100
128200     ADD 7 TO LINE-CTR.
128300     IF LINE-CTR > 55
128400         MOVE 8 TO LINE-CTR
128500         ADD 1 TO PG-LIMIT.
128600
128700 410-GET-COMMENTS-LOOP.
           MOVE 0 TO COND-WORD.
           READ DPODATAITM NEXT INTO BUF-DPODATAITM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPODATAITM-REC NOT = PO-ARG
               MOVE 15 TO COND-WORD.
129000     IF END-OF-CHAIN  OR DATAITM-ITEM-NO > RCV-ITEM-NUMBER
129100         GO TO 415-GET-ACCUMULATOR-UM
129200     ELSE
129300         IF NOT GOOD-CALL
129400           MOVE "DBGET DPODATAITM 410 SRSPRT" TO BU-DISPLAY-MSG
129500           PERFORM 990-BLOWUP THRU 999-EXIT.
129600
129700     IF DATAITM-ITEM-NO = RCV-ITEM-NUMBER
129800         MOVE DATAITM-INFO      TO HOLD-PRT-DESC
129900         MOVE RCV-ITEM-NUMBER   TO HOLD-PRT-ITEM
130000         ADD 1                  TO LINE-CTR
130100         WRITE HOLD-PRT-RCD.
130200
130300      IF LINE-CTR > 55
130400          MOVE 8 TO LINE-CTR
130500          ADD  1 TO PG-LIMIT.
130600
130700     GO TO 410-GET-COMMENTS-LOOP.
130800
130900*>>>>>>>>>>  GET ACCUMULATOR TO FIND THE UM (LOT UM NEEDS
131000*            DESCRIPTION FROM RS-ARG INSTEAD OF PO-ARG)
131100 415-GET-ACCUMULATOR-UM.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPOITEM-REC.
           START DPOITEM KEY NOT < PORCVNO OF DPOITEM-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
131400     IF NOT GOOD-CALL
131500        MOVE "DBFIND DPOITEM 500 SRSPRT" TO BU-DISPLAY-MSG
131600        PERFORM 990-BLOWUP THRU 999-EXIT.
131700
131800 416-GET-NEXT-ITEM.
           MOVE 0 TO COND-WORD.
           READ DPOITEM NEXT INTO BUF-DPOITEM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPOITEM-REC NOT = PO-ARG
               MOVE 15 TO COND-WORD.
132100     IF NOT GOOD-CALL
132200        MOVE "DBGET DPOITEM 416 SRSPRT" TO BU-DISPLAY-MSG
132300        PERFORM 990-BLOWUP THRU 999-EXIT.
132400
132500     IF ITM-NUMBER NOT = RCV-ITEM-NUMBER
132600        GO TO 416-GET-NEXT-ITEM.
132700
132800     MOVE 1                           TO X.
132900     IF ITM-UM = "LT" OR "AS"
133000        MOVE 25                       TO CNDESC-LINES-TO-GET
133100        MOVE 0                        TO CNDESC-LINES-GOT
133200        MOVE SPACES                   TO CNDESC-LINE
133300        CALL "CNDESC" USING BASE, MISC-RS-ARG, RCV-ITEM-NUMBER,
133400                            CNDESC-DATA
133500           PERFORM 426-MOVE-NONCODED-DESC CNDESC-LINES-GOT TIMES
133600           ADD CNDESC-LINES-GOT TO LINE-CTR
133700     ELSE
133800     IF RCV-CORP-CODE = "NON-STR"
133900        MOVE 25                       TO CNDESC-LINES-TO-GET
134000        MOVE 0                        TO CNDESC-LINES-GOT
134100        MOVE SPACES                   TO CNDESC-LINE
134200           CALL "CNDESC" USING BASE, PO-ARG, RCV-ITEM-NUMBER,
134300                               CNDESC-DATA
134400           PERFORM 426-MOVE-NONCODED-DESC CNDESC-LINES-GOT TIMES
134500           ADD CNDESC-LINES-GOT TO LINE-CTR
134600     ELSE
134700        MOVE SPACES                   TO CDESC-DATA
134800        MOVE 25                       TO CDESC-LINES-TO-GET
134900        MOVE "P"                      TO CDESC-LANGUAGE-OPTION
135000        MOVE "F"                      TO CDESC-DESC-OPTION
135100        MOVE "S"                      TO CDESC-MANUFACT-OPTION
135200        MOVE "R"                      TO CDESC-LOCAL-DESC-OPTION
135300        CALL "CDESC" USING RET-CODE, BASE, STATUS-AREA,
135400                     BU-DISPLAY-MSG, RCV-CORP-CODE, CDESC-DATA
              IF RET-CODE = "NF"
                 NEXT SENTENCE
              ELSE
135500           PERFORM 425-MOVE-CODED-DESC CDESC-LINES-GOT TIMES
135600           ADD CDESC-LINES-GOT TO LINE-CTR.
135700
       421-PRINT-DCOMPL.
           IF PRINT-DCOMPL-SW = "Y"
               MOVE RCV-CORP-CODE  TO  CCRQDESC-CODE
               MOVE SPACES         TO  CCRQDESC-LINES
               CALL "CCRQDESC" USING CCRQDESC-PARMS
           ELSE
               GO TO 422-CHECK-LINE-CTR.
           IF CCRQDESC-LINES = SPACES
               GO TO 422-CHECK-LINE-CTR.
           IF LINE-CTR > 55
               SUBTRACT 55 FROM LINE-CTR
               ADD 1 TO PG-LIMIT.
           PERFORM VARYING SUB FROM 1 BY 1
                   UNTIL CCRQDESC-LINE (SUB) = SPACES OR
                            SUB > 6
               MOVE CCRQDESC-LINE (SUB)     TO  HOLD-PRT-DESC
               MOVE RCV-ITEM-NUMBER         TO  HOLD-PRT-ITEM
               WRITE HOLD-PRT-RCD
               ADD 1                        TO  LINE-CTR
           END-PERFORM.

135800 422-CHECK-LINE-CTR.
135900*----------  ADD ACCTG DATA, LOCATIONS, AND BLANK LINES
136000     ADD 6 TO LINE-CTR.
136100     IF LINE-CTR > 55
136200         SUBTRACT 55 FROM LINE-CTR
136300         ADD 1 TO PG-LIMIT
136400         GO TO 422-CHECK-LINE-CTR.
136500     GO TO 405-GET-NEXT-ITEM.
136600
136700 425-MOVE-CODED-DESC.
136800     MOVE CDESC (X)                TO HOLD-PRT-DESC.
136900     MOVE RCV-ITEM-NUMBER          TO HOLD-PRT-ITEM.
137000     WRITE HOLD-PRT-RCD.
137100     ADD 1 TO X.
137200 426-MOVE-NONCODED-DESC.
137300     MOVE CNDESC (X)               TO HOLD-PRT-DESC.
137400     MOVE RCV-ITEM-NUMBER          TO HOLD-PRT-ITEM.
137500     WRITE HOLD-PRT-RCD.
137600     ADD 1 TO X.
137700 499-EXIT.  EXIT.
137800*************************************************************
137900*         READ THROUGH THE RECEIVER ITEMS AGAIN AND         *
138000*         PRINT THE RECEIVER THIS TIME USING THE HOLD       *
138100*         FILE TO RETRIEVE THE DESCRIPTION LINES.           *
138200*************************************************************
138300 500-PRINT-RCVR.
138400     MOVE 0 TO I.
138500     PERFORM 880-PRINT-HEADINGS THRU 889-EXIT.
138600     MOVE 26 TO LINE-CTR.
138700
138800     OPEN INPUT HOLD-PRT.
138900     READ HOLD-PRT AT END
139000          MOVE ALL "9" TO HOLD-PRT-ITEM.
139100
139200*----------  FIND SPECIFIC ENTRY FOR RECEIVER
           MOVE 0 TO COND-WORD.
           MOVE MISC-RS-ARG TO PORCVNO OF DRCVITEM-REC.
           START DRCVITEM KEY NOT < PORCVNO OF DRCVITEM-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
139500     IF NOT GOOD-CALL
139600           MOVE "DBFIND DRCVITEM 500 SRSPRT  " TO BU-DISPLAY-MSG
139700           PERFORM 990-BLOWUP THRU 999-EXIT.
139800
139900 505-GET-NEXT-ITEM.
           MOVE 0 TO COND-WORD.
           READ DRCVITEM NEXT INTO BUF-DRCVITEM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DRCVITEM-REC NOT = MISC-RS-ARG
               MOVE 15 TO COND-WORD.
140200     IF END-OF-CHAIN
140300        CLOSE HOLD-PRT
140400        GO TO 599-EXIT.
140500     IF NOT GOOD-CALL
140600        MOVE "DBGET DRCVITEM 505 SRSPRT" TO BU-DISPLAY-MSG
140700        PERFORM 990-BLOWUP THRU 999-EXIT.
140800
140900*----------  IF SPECIFIC ITEMS WERE LISTED ON A REPRINT, SEARCH
141000*            ONLY FOR THOSE ITEMS.
           IF MISC-REPRINT NOT = "Y"
              GO TO 506-CONTINUE.
123900     IF RCVR-PRINT-ITEMS NOT = ZERO
      *       "0000000000000000000000000000000000000000"
141200        SET RI TO 1
141300        SEARCH RCVR-ITEM
141400                AT END GO TO 505-GET-NEXT-ITEM
141500                WHEN RCVR-ITEM (RI) = RCV-ITEM-NUMBER
141600                GO TO 506-CONTINUE.
141700
141800 506-CONTINUE.
141900*************************************************************
142000*   GET ACCUMULATOR ENTRY FOR THE REST OF ITEM INFORMATION  *
142100*************************************************************
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPOITEM-REC.
           START DPOITEM KEY NOT < PORCVNO OF DPOITEM-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
142400     IF NOT GOOD-CALL
142500        MOVE "DBFIND DPOITEM 500 SRSPRT" TO BU-DISPLAY-MSG
142600        PERFORM 990-BLOWUP THRU 999-EXIT.
142700
142800 506-GET-NEXT-ITEM.
           MOVE 0 TO COND-WORD.
           READ DPOITEM NEXT INTO BUF-DPOITEM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPOITEM-REC NOT = PO-ARG
               MOVE 15 TO COND-WORD.
143100     IF NOT GOOD-CALL
143200        MOVE "DBGET DPOITEM 506 SRSPRT" TO BU-DISPLAY-MSG
143300        PERFORM 990-BLOWUP THRU 999-EXIT.
143400
143500     IF ITM-NUMBER NOT = HOLD-PRT-ITM
143600         GO TO 506-GET-NEXT-ITEM.
143700
143800     PERFORM 800-FIND-PASSED-ITEM THRU 809-EXIT.
143900
144000     MOVE SPACES                 TO PRT-SUB2.
144100     MOVE ITM-CLASS             TO PRT-SUB2.
144200     IF RCV-LOT = SPACES
144300        MOVE SPACES TO MSG50
144400        MOVE ZEROES TO PRT-RAW-LOT
144500     ELSE
144600        MOVE RCV-LOT TO PRT-RAW-LOT
144700        MOVE LOT-MSG-WS TO MSG50.
144800     MOVE RCV-ITEM-NUMBER       TO  PRT-ITM, HOLD-ITM-NO.
144900     IF RCV-TALLY = SPACES
145000        MOVE SPACES TO PRT-TALLY-MSG
145100        MOVE SPACES       TO PRT-TALLY
145200     ELSE
145300        MOVE TALLY-MSG-WS TO PRT-TALLY-MSG
145400        MOVE RCV-TALLY    TO PRT-TALLY.
145500     MOVE RCV-CORP-CODE         TO  PRT-CODE.
145600     IF RCV-CORP-CODE = "NON-STR"
145700        MOVE SPACES             TO  PRT-PREV-CODE
145800        GO TO 507-PRT-QTY.
145900
146000*-----------  GET MSTORERM FOR LOCATIONS, CLASS, AND PREV-CODE
146100     MOVE ITM-CORP-CODE TO CODE-ARG.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC.
           READ MSTORERM INTO BUF-MSTORERM
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
146400     IF NOT GOOD-CALL
146500         MOVE "DBGET MSTORER 506 SRSPRT" TO BU-DISPLAY-MSG
146600         MOVE CODE-ARG TO BU-DISPLAY-FLD (5)
146700         PERFORM 990-BLOWUP THRU 999-EXIT.
146800
146900     IF DANVILLE OR NEW-TORONTO
147000        MOVE STR-PREV-CODE      TO  PRT-PREV-CODE
147100     ELSE
147200        MOVE SPACES             TO  PRT-PREV-CODE.
147300     IF PRT-SUB2 = SPACES
147400     MOVE ST-CLASS             TO  PRT-SUB2.
147500
147600 507-PRT-QTY.
147700     IF KELLY-PLANT
147800        MOVE RCV-KELLY-PO-QTY   TO  WORK-QTY
147900     ELSE
148000        MOVE RCV-QTY-DLVR       TO  WORK-QTY.
148100     IF WORK-QTY-ADP-X = ZEROES
148200        MOVE WORK-QTY           TO  PRT-PO-DLVR-R
148300     ELSE
148400        MOVE WORK-QTY           TO  PRT-PO-DLVR.
148500
148600     IF RCV-CORP-CODE = "NON-STR"
148700        GO TO 508-ITEM-COMPLETE.
148800
148900     IF KELLY-PLANT
149000        MOVE ITM-UM             TO  PRT2-STR-DLVR-UM
149100        MOVE RCV-QTY-DLVR       TO  WORK-QTY
149200     ELSE
149300        MOVE RCV-QTY-DLVR       TO  WS-CONVERT-FLD
149400        PERFORM 820-CONVERT-TO-STR THRU 829-EXIT.
149500     IF WORK-QTY-ADP-X = ZEROS
149600         MOVE WORK-QTY          TO  PRT2-STR-DLVR-R
149700     ELSE
149800         MOVE WORK-QTY          TO  PRT2-STR-DLVR.
149900
150000 508-ITEM-COMPLETE.
150100     IF ITM-COMPLETE-FLAG = SPACES
150200        MOVE SPACES TO PRT-COMPLETE
150300     ELSE
150400        MOVE "MARKED COMPLETE " TO PRT-COMPLETE.
150500
150600     IF KELLY-PLANT
150700        MOVE RCV-KELLY-PO-UM    TO PRT-PO-DLVR-UM
150800     ELSE
150900        MOVE ITM-UM             TO PRT-PO-DLVR-UM.
151000
151100*----------  IF KELLY RAW MATERIALS, DISPLAY PO AND STORES QTY
151200     IF RCV-CORP-CODE = "NON-STR"
151300        IF KELLY-PLANT
151400           IF PO-TYPE = "2"
151500              NEXT SENTENCE
151600           ELSE
151700              GO TO 514-CHECK-NEXT-PAGE
151800        ELSE
151900           GO TO 514-CHECK-NEXT-PAGE
152000     ELSE
152100        GO TO 512-CODED-LOGIC.
152200
152300     MOVE ITM-QTY-ORD TO WORK-QTY.
152400     IF WORK-QTY-ADP-X  = ZEROS
152500         MOVE WORK-QTY          TO  PRT2-STR-ORD-R
152600     ELSE
152700         MOVE WORK-QTY          TO  PRT2-STR-ORD.
152800
152900     MOVE RCV-QTY-DLVR TO WORK-QTY.
153000     IF WORK-QTY-ADP-X = ZEROES
153100        MOVE WORK-QTY           TO  PRT2-STR-DLVR-R
153200     ELSE
153300        MOVE WORK-QTY           TO  PRT2-STR-DLVR.
153400     MOVE ITM-UM                TO  PRT2-STR-ORD-UM,
153500                                    PRT2-STR-DLVR-UM.
153600
153700     GO TO 514-CHECK-NEXT-PAGE.
153800
153900*>>>>>>>>>>  CODED ITEM LOGIC
154000 512-CODED-LOGIC.
154100     MOVE STR-UM             TO  PRT2-STR-ORD-UM, PRT2-STR-DLVR-UM.
154200     IF KELLY-PLANT
154300        MOVE ITM-UM          TO  PRT2-STR-ORD-UM
154400        MOVE ITM-QTY-ORD     TO  WORK-QTY
154500     ELSE
154600        MOVE ITM-QTY-ORD     TO  WS-CONVERT-FLD
154700        PERFORM 820-CONVERT-TO-STR THRU 829-EXIT.
154800     IF WORK-QTY-ADP-X  = ZEROS
154900         MOVE WORK-QTY       TO  PRT2-STR-ORD-R
155000     ELSE
155100         MOVE WORK-QTY       TO  PRT2-STR-ORD.

           IF RCV-CHATNO NOT = SPACES
               MOVE RCV-CHATNO TO CHATNO OF DCHATNO
               READ DCHATNO INTO BUF-DCHATNO
                 INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS = "00"
                   MOVE RCV-CHATNO TO PRT-CHATNO
                   MOVE CHAT-MFR   TO PRT-CHAT-MFR
                   MOVE CHAT-TRADE TO PRT-CHAT-TRADE
               ELSE
                   MOVE SPACES     TO PRT-CHATNO
                                      PRT-CHAT-MFR
                                      PRT-CHAT-TRADE
               END-IF
           ELSE
               MOVE SPACES     TO PRT-CHATNO
                                  PRT-CHAT-MFR
                                  PRT-CHAT-TRADE
           END-IF.
155200
155300 514-CHECK-NEXT-PAGE.
155400     PERFORM 850-CHECK-NEXT-PAGE.
155500*----------  FIND REQUISITION NUMBER
155600     MOVE SPACES TO PRT-REQ-NO, PRT-WO, PRT-REQ-ORIG.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DREQD-REC.
           START DREQD KEY = PORCVNO OF DREQD-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF NO-ENTRY
              GO TO 525-PRT-ITEM.
155900     IF NOT GOOD-CALL
156000        MOVE "DBFIND DREQD AT 535 IN TNONCDRS" TO BU-DISPLAY-MSG
156100        PERFORM 990-BLOWUP THRU 999-EXIT.
156200
156300 515-GET-DREQD.
           MOVE 0 TO COND-WORD.
           READ DREQD NEXT INTO BUF-DREQD
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DREQD-REC NOT = PO-ARG
               MOVE 15 TO COND-WORD.
156600     IF END-OF-CHAIN
156700        GO TO 525-PRT-ITEM.
156800     IF DREQD-PO-ITM-NO NOT = ITM-NUMBER
156900        GO TO 515-GET-DREQD.
157000     MOVE DREQD-REQ-NUMBER TO PRT-REQ-NO, REQ-ARG.
157100     MOVE DREQD-WO-NUMBER  TO PRT-WO.
157200
157300 525-PRT-ITEM.
157400     IF PRT-REQ-NO = SPACES
157500        MOVE SAVE-REQ TO PRT-REQ-NO, REQ-ARG.
157600
157700     MOVE ITM-SUB-DETL       TO  PRT-SUB-DETL2.
157800     MOVE ITM-ADDL-DATA      TO  PRT-ADDL-DATA.
157900
158000     IF KELLY-PLANT
158100        MOVE ITM-KELLY-PO-QTY       TO  WORK-QTY
158200        MOVE ITM-KELLY-PO-UM    TO  PRT-PO-ORD-UM,
158300                                    PRT-PO-DLVR-UM
158400     ELSE
158500        MOVE ITM-QTY-ORD        TO  WORK-QTY
158600        MOVE ITM-UM             TO  PRT-PO-ORD-UM.
158700     IF WORK-QTY-ADP-X  = ZEROS
158800         MOVE WORK-QTY          TO  PRT-PO-ORD-R
158900     ELSE
159000         MOVE WORK-QTY          TO  PRT-PO-ORD.
159100     ADD 1 TO I.
           MOVE SPACES       TO PRINT-RCD.
           MOVE PRT-ITM-HDR  TO PLINE.
159500     MOVE 1            TO LINE-ADV.
159600     ADD 1             TO LINE-CTR.
159700     PERFORM 860-PRT-LINE THRU 869-EXIT.
159800     MOVE SPACES       TO PRT-REQ-NO.
159900
160000     IF ITM-CORP-CODE = "NON-STR"
160100        IF KELLY-PLANT
160200           IF PO-TYPE = "2"
160300              NEXT SENTENCE
160400           ELSE
160500              GO TO 527-PRT-CONTAINER
160600        ELSE
160700           GO TO 527-PRT-CONTAINER.
160800
           MOVE SPACES           TO  PRINT-RCD.
           MOVE PRT-ITM-HDR2     TO  PLINE.
161200     MOVE 1                TO  LINE-ADV.
161300     ADD 1                 TO  LINE-CTR.
161400     PERFORM 860-PRT-LINE THRU 869-EXIT.
161500
161600 527-PRT-CONTAINER.
161700     MOVE SPACES TO PRT-ITM-HDR3.
161800     IF ITM-UM = "LT" OR "AS"
161900        GO TO 530-PRT-DESC.
162000     IF PASS-CONTAINER-QTY (I) NOT NUMERIC
162100        GO TO 530-PRT-DESC.
162200     IF PASS-CONTAINER-QTY (I) = ZERO
162300        GO TO 530-PRT-DESC.
162400
162500     MOVE PASS-CONTAINER-QTY (I)  TO WORK-QTY.
162600     IF WORK-QTY-ADP-X = ZEROES
162700        MOVE WORK-QTY             TO PRT3-CONT-DLVR-R
162800     ELSE
162900        MOVE WORK-QTY             TO PRT3-CONT-DLVR.
163000     MOVE PASS-CONTAINER-UM (I)   TO PRT3-CONT-UM.
163100     MOVE "RETURNABLE CONTAINER"   TO PRT3-CONT.
163200
163300 530-PRT-DESC.
163400     MOVE SPACES TO PRT-REQ-INFO, PRT-REQ-STAGE.
           MOVE SPACES           TO  PRINT-RCD.
           MOVE PRT-ITM-HDR3     TO  PLINE.
163800     MOVE 1                TO  LINE-ADV.
163900     ADD 1                 TO  LINE-CTR.
164000     PERFORM 860-PRT-LINE THRU 869-EXIT.
164100
164200*----------  PRINT DESCRIPTION, SUB DETAIL, AND ADDITIONAL DATA
164300 533-PRT-DESC.
164400     PERFORM 850-CHECK-NEXT-PAGE.
164500 534-CHECK-HOLD-ITEM.
164600     IF ITM-NUMBER > HOLD-PRT-ITEM
164700         PERFORM 875-READ-HOLD-PRT THRU 879-EXIT
164800         GO TO 534-CHECK-HOLD-ITEM.
164900
165000     IF ITM-NUMBER = HOLD-PRT-ITEM
165100         MOVE HOLD-PRT-DESC   TO   PRT-DESC-COMMENT
               MOVE PRT-DESC-HDR TO PLINE
165300         MOVE 1                       TO   LINE-ADV
165400         ADD 1                        TO   LINE-CTR
165500         PERFORM 860-PRT-LINE THRU 869-EXIT
165600         PERFORM 875-READ-HOLD-PRT THRU 879-EXIT
165700         GO TO 533-PRT-DESC
165800     ELSE
165900     IF ITM-SUB-DETL NOT = SPACES
166000         MOVE PRT-SUB-SUBDETL-ADDLDATA TO PLINE
166200         MOVE 1 TO LINE-ADV
166300         ADD 1  TO LINE-CTR
166400         PERFORM 860-PRT-LINE THRU 869-EXIT
166500     ELSE
166600     IF ITM-ADDL-DATA NOT = SPACES
166700         MOVE PRT-SUB-SUBDETL-ADDLDATA TO PLINE
166900         MOVE 1 TO LINE-ADV
167000         ADD 1  TO LINE-CTR
167100         PERFORM 860-PRT-LINE THRU 869-EXIT.
167200
DCR01      INITIALIZE BUF-MREQ.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF MREQ-REC.
           READ MREQ INTO BUF-MREQ
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
167500     IF NO-ENTRY
167600        NEXT SENTENCE
167700     ELSE
167800        IF NOT GOOD-CALL
167900           MOVE "DBGET MREQ 530 SRSPRT" TO BU-DISPLAY-MSG
168000           PERFORM 990-BLOWUP THRU 999-EXIT
168100        ELSE
168200           MOVE REQ-SUBD      TO PRT-REQ-SUBD
168300           MOVE REQ-ORIGINATOR TO PRT-REQ-ORIG EMPL-ARG
                 MOVE 0 TO COND-WORD
                 MOVE EMPL-ARG TO PERCCNUM OF PER-PERSONNEL-REC
                 READ PER-PERSONNEL INTO BUF-PER-PERSONNEL
                    INVALID KEY MOVE 17 TO COND-WORD
                 END-READ
                    IF FILE-STATUS-1 = "2"
                       MOVE 17 TO COND-WORD
                    ELSE
                       IF FILE-STATUS NOT = "00"
                          MOVE 99 TO COND-WORD
                       END-IF
              END-IF
              IF GOOD-CALL
                  MOVE PER-EMP-NAME TO PRT-REQ-ORIG-NAME
              ELSE
                  IF NO-ENTRY
                      MOVE SPACES TO PRT-REQ-ORIG-NAME
                  ELSE
                      MOVE "DBGET ERR PERSONNEL 534-CHECK-HOLD-ITEM" TO
                        BU-DISPLAY-MSG
                      PERFORM 990-BLOWUP THRU 999-EXIT
                  END-IF
              END-IF
168400        MOVE REQ-ADDL-INFO TO PRT-REQ-INFO
168500        MOVE REQ-STAGING-AREA         TO PRT-REQ-STAGE.
168600
           MOVE SPACES           TO  PRINT-RCD.
169000     ADD 1                 TO  LINE-CTR.
169100     IF PRT-REQ-INFO = SPACES
169200        IF PRT-REQ-STAGE = SPACES
169300           IF PRT-WO = SPACES
                   IF PRT-REQ-ORIG = "    " OR "9999"
169400              PERFORM 860-PRT-LINE THRU 869-EXIT
169500              GO TO 540-PRINT-REQN-LINE.
           MOVE PRT-REQ-LINE TO PLINE.
169700     PERFORM 860-PRT-LINE THRU 869-EXIT.

       540-PRINT-REQN-LINE.
           IF REQ-DOCK-NOTIFY NOT = SPACES
               MOVE "  NOTIFY: " TO PRT-REQ-NOTIFY-H
               MOVE REQ-DOCK-NOTIFY TO PRT-REQ-NOTIFY
               MOVE PRT-REQ-NOTIFY-LINE TO PLINE
               PERFORM 860-PRT-LINE THRU 869-EXIT.

       540-PRINT-CHAT-LINE.
           IF PRT-CHATNO NOT = SPACES
               MOVE SPACES TO PRINT-RCD
               MOVE 1 TO LINE-ADV
               MOVE PRT-CHAT-LINE TO PLINE
               PERFORM 860-PRT-LINE THRU 869-EXIT
               ADD 1 TO LINE-CTR
               MOVE SPACES TO PRT-CHATNO.
169800
169900 550-PRINT-LAST-LINES.
170000     IF COUNT-ITEM (I) = "Y"
170100        MOVE "* QUANTITY COUNT REQUIRED" TO PRT-COUNT
              MOVE PRT-COUNT-MSG TO PLINE
170300        MOVE 1 TO LINE-ADV
170400        PERFORM 860-PRT-LINE THRU 869-EXIT
170500        ADD 1 TO LINE-CTR.

      *---------  PRINT ITEM RCV INSTRUCTIONS
           IF ITM-RCV-STD-INST NOT = SPACES
              MOVE 1 TO LINE-ADV
              ADD  1 TO LINE-CTR
              MOVE SPACES TO PRINT-RCD
              PERFORM 860-PRT-LINE THRU 869-EXIT
              PERFORM 601-PRINT-ITM-RCV-INST THRU 601-PIRI-X
                 VARYING SUB FROM 1 BY 1
                   UNTIL SUB > 4
              MOVE 1 TO LINE-ADV
              ADD  1 TO LINE-CTR
              MOVE SPACES TO PRINT-RCD
              PERFORM 860-PRT-LINE THRU 869-EXIT.

170600*----------  SHOW ITEM PRICE ONLY FOR CERTAIN RECEIVING DEPTS.
      *---10/22/96 JSB, ADD ADDITIONAL DEPARTMENTS
170700     IF PO-RCV-DEPT = "107A" OR "1071" OR "BRUN" OR "LARE" OR
170800                      "ZUNI" OR "AEI" OR "JAN" OR "CLOV" OR
                            "CAST" OR "CIRC" OR "CIRM" OR "DES"
                            OR "CIRA" OR "CIRO"
170900        MOVE "PRICE UM:  " TO PRICE-UMH
171000        MOVE ITM-PRICE-UM   TO PRICE-UM
171100        MOVE "PRICE:  "    TO PRICE-H
171200        MOVE ITM-UNIT-PRICE TO PRT-PRICE
171300     ELSE
171400        MOVE SPACES TO PRICE-UMH, PRICE-UM, PRICE-H, PRT-PRICE-X.
171500
171600*----PRINT EITHER STOREROOM, NONCODED OR DIRECT DELIVERY LITERALS
171700     IF ITM-CORP-CODE = "NON-STR"
171800        MOVE "NONCODED ITEM" TO PRT-STR-LIT
171900        MOVE SPACES TO PRT-DD-DETL, PRT-LOC1,
172000                       PRT-LOCATION-ENTRY
                             PRT-SEMI1
172100        GO TO 555-PLINE
172200     ELSE
172300     IF ITM-DATE-STORED = "  DD  "
172400          MOVE ITM-SUB-DETL        TO  PRT-DD-DETL
172500          MOVE "DIRECT DELIVERY "  TO  PRT-STR-LIT
172600     ELSE
172700          MOVE SPACES              TO  PRT-DD-DETL
172800          MOVE "--BIN LOCATIONS "  TO  PRT-STR-LIT.
172900
173000     MOVE STR-LOC (1)         TO   PRT-LOC1.
173100     MOVE SPACES              TO   PRT-LOCATION-ENTRY.
173200     MOVE ZEROS               TO   STK.
173600     MOVE "; "                TO   PRT-SEMI1.
173300     IF STR-LOC (2) > SPACES
173400         ADD 1 TO STK
173500         MOVE STR-LOC (2)     TO   PRT-LOC (STK)
173600         MOVE "; "         TO   PRT-SEMI (STK).
173700     IF STR-LOC (3) > SPACES
173800         ADD 1 TO STK
173900         MOVE STR-LOC (3)     TO   PRT-LOC (STK)
174000         MOVE "; "         TO   PRT-SEMI (STK).
174100     IF STR-LOC (4) > SPACES
174200         ADD 1 TO STK
174300         MOVE STR-LOC (4)     TO   PRT-LOC (STK)
174400         MOVE "; "         TO   PRT-SEMI (STK).
174500     IF STR-LOC (5) > SPACES
174600         ADD 1 TO STK
174700         MOVE STR-LOC (5)     TO   PRT-LOC (STK)
174800         MOVE "; "         TO   PRT-SEMI (STK).
174900     IF STR-LOC (6) > SPACES
175000         ADD 1 TO STK
175100         MOVE STR-LOC (6)     TO   PRT-LOC (STK).

           MOVE PRT-STR-LOCS-1 TO  PLINE.
175500     MOVE 1              TO  LINE-ADV.
175600     ADD 1               TO  LINE-CTR.
175700     PERFORM 860-PRT-LINE THRU 869-EXIT.
           MOVE PRT-STR-LOCS-2 TO  PLINE.
175500     MOVE 1              TO  LINE-ADV.
175600     ADD 1               TO  LINE-CTR.
175700     PERFORM 860-PRT-LINE THRU 869-EXIT.
175200*--------- PRINT ONHAND QUANTITIES UNDERNEATH BIN LOCATIONS
173000     MOVE STR-LOC-ONHAND (1)  TO   PRT-LOC1-9.
173100     MOVE SPACES              TO   PRT-LOCATION-ENTRY.
173200     MOVE ZEROS               TO   STK.
173600     MOVE "; "                TO   PRT-SEMI1.
173300     IF STR-LOC (2) > SPACES
173400         ADD 1 TO STK
173500         MOVE STR-LOC-ONHAND (2)  TO   PRT-LOC-9 (STK)
173600         MOVE "; "         TO   PRT-SEMI (STK).
173700     IF STR-LOC (3) > SPACES
173800         ADD 1 TO STK
173900         MOVE STR-LOC-ONHAND (3)  TO   PRT-LOC-9 (STK)
174000         MOVE "; "         TO   PRT-SEMI (STK).
174100     IF STR-LOC (4) > SPACES
174200         ADD 1 TO STK
174300         MOVE STR-LOC-ONHAND (4)  TO   PRT-LOC-9 (STK)
174400         MOVE "; "         TO   PRT-SEMI (STK).
174500     IF STR-LOC (5) > SPACES
174600         ADD 1 TO STK
174700         MOVE STR-LOC-ONHAND (5)  TO   PRT-LOC-9 (STK)
174800         MOVE "; "         TO   PRT-SEMI (STK).
174900     IF STR-LOC (6) > SPACES
175000         ADD 1 TO STK
175100         MOVE STR-LOC-ONHAND (6)  TO   PRT-LOC-9 (STK).

175300 555-PLINE.
           MOVE PRT-STR-LOCS-2 TO  PLINE.
175500     MOVE 1              TO  LINE-ADV.
175600     ADD 1               TO  LINE-CTR.
175700     PERFORM 860-PRT-LINE THRU 869-EXIT.
175800
175900*----------  PRINT COMMENT LINE ENTERED WITH EACH ITEM
176000     IF RCV-COMMENT NOT = SPACES
176100        MOVE RCV-COMMENT TO PRT-ITEM-COMMENT
              MOVE PRT-COMMENT TO PLINE
176300        PERFORM 860-PRT-LINE THRU 869-EXIT
176400        ADD 1 TO LINE-CTR.
176500
176600*---------  PRINT PRICE
           MOVE PRT2-STR-DLVR-UM-PRICE   TO  PLINE.
176900     MOVE 3            TO  LINE-ADV.
177000     ADD 3             TO  LINE-CTR.
177100     PERFORM 860-PRT-LINE THRU 869-EXIT.
177200
177300     GO TO 505-GET-NEXT-ITEM.
177400
177500 599-EXIT.  EXIT.
177600
      *---GET BEFORE AND AFTER RCV INSTRUCTIONS
      *---  STORED IN DPODATAITM "000002" SEQ NO
       600-GET-RCV-INST.
           MOVE SPACES TO RCV-INSTRUCTIONS.
           MOVE PO-ARG TO PORCVNO OF DPODATAITM-REC.
           MOVE "000002" TO ITEMSEQNO OF DPODATAITM-REC.
           READ DPODATAITM INTO BUF-DPODATAITM
               AT END MOVE 17 TO COND-WORD.
           IF FILE-STATUS = "00"
               MOVE DATAITM-INFO  TO  RCV-INSTRUCTIONS.
       600-GRI-X.
           EXIT.


      *---- PRINT BEFORE/AFTER RCV INSTRUCTIONS
       601-PRINT-RCV-INST.
            MOVE RCV-INST-NO(SUB) TO RECEIVE-INSTRUCTION.
            PERFORM 601-PRINT-INST THRU 601-PI-X.
       601-PRI-X.
           EXIT.

       601-PRINT-ITM-RCV-INST.
           MOVE ITM-RCV-STD-INSTR(SUB) TO RECEIVE-INSTRUCTION.
           PERFORM 601-PRINT-INST THRU 601-PI-X.
       601-PIRI-X.
           EXIT.

       601-PRINT-INST.
           IF RECEIVE-INSTRUCTION = SPACES
               GO TO 601-PI-X.

           MOVE RECEIVE-INSTRUCTION TO BUILD-COM-NO.
           MOVE BUILD-COMMENT-NO TO COMMENT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE COMMENT-ARG TO MCOMCOMMNT OF DCOMMENT-REC.
           START DCOMMENT KEY = MCOMCOMMNT OF DCOMMENT-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               GO TO 601-PI-X.

       601-GET-DCOMMENT.
           MOVE 0 TO COND-WORD.
           READ DCOMMENT NEXT INTO BUF-DCOMMENT
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO 601-PI-X
               ELSE
                   MOVE "READ DCOMMENT *601-PI" TO  BU-DISPLAY-MSG
                   MOVE COMMENT-ARG           TO  BU-DISPLAY-FLD (2)
                   PERFORM 990-BLOWUP THRU 999-EXIT.
           IF MCOMCOMMNT OF DCOMMENT-REC NOT = COMMENT-ARG
               GO TO 601-PI-X.

           MOVE 1                       TO  LINE-ADV.
           ADD  1 TO LINE-CTR.
           MOVE SPACES                  TO  PRTWK-AREA.
           IF EXP-PRT-START = "*EXP*"
               MOVE EXPAND-1            TO  PRTWK-STD-INST-EXP-START
               MOVE EXP-DATA-COMMENT    TO  PRTWK-STD-INST-EXP
               MOVE EXP-1-OFF           TO  PRTWK-STD-INST-EXP-END
           ELSE
           IF EXP-PRT-START = "*CMP*"
               MOVE COMPRESS-1-1        TO  PRTWK-STD-INST-COMP-START
               MOVE COMP-DATA-COMMENT   TO  PRTWK-STD-INST-COMP
               MOVE NORMAL-1A           TO  PRTWK-STD-INST-COMP-END
           ELSE
               MOVE DCOM-DATA-LINE      TO  PRTWK-STD-INST.
           MOVE SPACES                  TO  PRINT-RCD.
           MOVE PRTWK-STD-INST-LINE     TO  PRINT-RCD.
           PERFORM 860-PRT-LINE THRU 869-EXIT.

           GO TO 601-GET-DCOMMENT.
       601-PI-X.
           EXIT.

177700*************************************************************
177800*   SEARCH THE ITEMS PASSED AND SEE IF DELIVERED UM AND     *
177900*   PRICE DATA WAS PASSED FROM THE RCVR CREATE PROGRAM.     *
178000*************************************************************
178100 800-FIND-PASSED-ITEM.
178200     SET T TO 1.
178300     SEARCH PASS-ITEM-TABLE
178400        AT END
178500        MOVE SPACES TO PRT-PRICE-QTY-X
178600                       PRT-PRICE-UM
178700                       PRT2-STR-DLVR-UM
178800        GO TO 809-EXIT
178900        WHEN RCV-ITEM-NUMBER = PASS-ITEM (T)
179000        MOVE PASS-DLV-UM (T)       TO PRT2-STR-DLVR-UM.
179100
179200*----------  IF PRICE DATA IS NEEDED, MOVE IT ALSO
179300     IF PASS-PRICE-UM (T) NOT = SPACES
179400        MOVE PASS-PRICE-QTY (T)    TO PRT-PRICE-QTY
179500        MOVE PASS-PRICE-UM (T)     TO PRT-PRICE-UM
179600     ELSE
179700        MOVE SPACES                TO PRT-PRICE-QTY-X
179800                                      PRT-PRICE-UM.
179900
180000 809-EXIT.  EXIT.
180100 810-DISPLAY.
180200     SET T UP BY 1.
180300
180400*----------  CONVERT NON-KELLY PLANTS' PO DELIVERY QUANTITY
180500*            TO STOREROOM QUANTITY.
180600 820-CONVERT-TO-STR.
180700     IF ITM-UM = STR-UM
180800        MOVE WS-CONVERT-FLD TO WORK-QTY
180900     ELSE
181000        IF ITM-UM = STR-UM1
181100           MULTIPLY WS-CONVERT-FLD BY STR-UM1-CF
181200              GIVING WORK-QTY ROUNDED
181300        ELSE
181400           IF ITM-UM = STR-UM2
181500              MULTIPLY WS-CONVERT-FLD BY STR-UM2-CF
181600                  GIVING WORK-QTY ROUNDED.
181700 829-EXIT.  EXIT.
181800*************************************************************
181900*      CHECK IF A PAGE BREAK HAS OCCURRED                   *
182000*************************************************************
182100 850-CHECK-NEXT-PAGE.
182200     IF LINE-CTR > 55 AND
182300        HOLD-PRT-ITEM NOT = ALL "9"
182400         MOVE 8 TO LINE-CTR
182500         ADD  1 TO PG-NO
               MOVE SPACES TO PRINT-RCD
182800         PERFORM 870-TOP-OF-NEW-PAGE
               MOVE HDR-1 TO PLINE
183000         MOVE 2 TO LINE-ADV
183100         PERFORM 860-PRT-LINE THRU 869-EXIT
               MOVE HDR-3   TO PLINE
183300         MOVE 2 TO LINE-ADV
183400         PERFORM 860-PRT-LINE THRU 869-EXIT
               MOVE  HDR-6  TO PLINE
183600         MOVE 1 TO LINE-ADV
183700         PERFORM 860-PRT-LINE THRU 869-EXIT
               MOVE  HDR-7  TO PLINE
183900         MOVE 2 TO LINE-ADV
184000         PERFORM 860-PRT-LINE THRU 869-EXIT.
184100************************************************************
184200*   WRITE THE RECORD TO ANY PRINTERS THAT ARE REQUIRED.    *
184300************************************************************
184400 860-PRT-LINE.
184500     WRITE PRINT-RCD BEFORE ADVANCING LINE-ADV LINES.
184600     IF ACCTG-PRT-NO NOT = ZEROES
               MOVE PLINE TO PACCTG
184700         WRITE ACCTG-RCD BEFORE ADVANCING LINE-ADV LINES.
184800     IF PRINT-PRT-NO NOT = ZEROES
             MOVE PLINE TO PTHIRD
184900       WRITE THIRD-RCD BEFORE ADVANCING LINE-ADV LINES.
185000*----------  PRINT CAPITAL ITEMS IF THE FLAG IS SET.  PRINT ALL
185100*            HEADING LINES (I=0) AND THEN PRINT ONLY ITEMS
185200*            THAT ARE CAPITAL ITEMS.
185300     IF MISC-CAPITAL-SPOOLER NOT = ZEROES
185400        IF MISC-CAP-RCVR = "Y"
185500           IF I = 0
                    MOVE PLINE TO PCAP
185600              WRITE CAPITAL-RCD BEFORE ADVANCING LINE-ADV LINES
185700           ELSE
185800              IF PASS-CAPITAL-ITEM (I) = "Y"
                    MOVE PLINE TO PCAP
185900              WRITE CAPITAL-RCD BEFORE ADVANCING LINE-ADV LINES.
186000
186100*----------  WRITE TO RAW MATERIAL PRINTER IF REQUIRED
186200     IF RAW-MAT-SPOOLER NOT = ZEROES
186300        IF RAW-MAT-PRINT = "Y"
                 MOVE PLINE TO RMAT
186400           WRITE RAWMAT-RCD BEFORE ADVANCING LINE-ADV LINES.
186500 869-EXIT.  EXIT.
186600
186700************************************************************
186800*              TOP OF NEW PAGE ROUTINE                     *
186900************************************************************
187000 870-TOP-OF-NEW-PAGE.
187100     WRITE PRINT-RCD AFTER ADVANCING NEW-PAGE.
187200     IF ACCTG-PRT-NO NOT = ZEROES
               MOVE PLINE TO PACCTG
187300         WRITE ACCTG-RCD AFTER ADVANCING NEW-PAGE.
187400     IF PRINT-PRT-NO NOT = ZEROES
             MOVE PLINE TO PTHIRD
187500       WRITE THIRD-RCD AFTER ADVANCING NEW-PAGE.
187600     IF MISC-CAPITAL-SPOOLER NOT = ZEROES
187700        IF MISC-CAP-RCVR = "Y"
                 MOVE PLINE TO PCAP
187800           WRITE CAPITAL-RCD AFTER ADVANCING NEW-PAGE.
187900     IF RAW-MAT-SPOOLER NOT = ZEROES
188000        IF RAW-MAT-PRINT = "Y"
                 MOVE PLINE TO RMAT
188100           WRITE RAWMAT-RCD AFTER ADVANCING NEW-PAGE.
188200 875-READ-HOLD-PRT.
188300     READ HOLD-PRT AT END
188400          MOVE ALL "9" TO HOLD-PRT-ITEM.
188500 879-EXIT.  EXIT.
188600************************************************************
188700*              PRINT TO THE APPROPRIATE PRINTER            *
188800************************************************************
188900 880-PRINT-HEADINGS.
189000     MOVE 1                     TO DATE-MODE.
189100     CALL "TDATECHK" USING DATE-CHECK-AREA.
189200     MOVE DATE-SLASH-OUT        TO PRT-DATE.
189300     MOVE DATE-FORMATTED-TIME-OUT TO PRT-TIME.
189400     ADD 1 TO PG-NO.
           MOVE HDR-1       TO PLINE.
189600     MOVE 2 TO LINE-ADV.
189700     PERFORM 860-PRT-LINE THRU 869-EXIT.
189800
189900     IF DISP-FRT-PO NOT = SPACES
190000         MOVE DISPLAY-FRT-REFER TO PRT-PRIOR-RS
               MOVE HDR-1A   TO PLINE
190200         MOVE 2                 TO LINE-ADV
190300         PERFORM 860-PRT-LINE THRU 869-EXIT.
           MOVE  HDR-2      TO PLINE.
190500     MOVE 1 TO LINE-ADV.
190600     PERFORM 860-PRT-LINE THRU 869-EXIT.
           MOVE HDR-2A     TO   PLINE.
190800     MOVE 1                   TO   LINE-ADV.
190900     PERFORM 860-PRT-LINE THRU 869-EXIT.
           MOVE HDR-2B    TO   PLINE.
191100     MOVE 1                  TO   LINE-ADV.
191200     PERFORM 860-PRT-LINE THRU 869-EXIT.
           MOVE HDR-2C    TO   PLINE.
191400     MOVE 1 TO LINE-ADV.
191500     PERFORM 860-PRT-LINE THRU 869-EXIT.
           MOVE HDR-2D    TO   PLINE.
191700     MOVE 2                  TO   LINE-ADV.
191800     PERFORM 860-PRT-LINE THRU 869-EXIT.
           MOVE  HDR-3      TO PLINE.
192000     MOVE 2 TO LINE-ADV.
192100     PERFORM 860-PRT-LINE THRU 869-EXIT.
192200     IF PRT-Z-BILL  = SPACES
192300         NEXT SENTENCE
192400     ELSE
               MOVE PRT-Z-BILL-NO TO PLINE
192600         MOVE 2             TO LINE-ADV
192700         PERFORM 860-PRT-LINE THRU 869-EXIT.
192800
           MOVE PRT-PO-DATA TO   PLINE.
193000     MOVE 1                   TO  LINE-ADV.
193100     PERFORM 860-PRT-LINE THRU 869-EXIT.
193200
           MOVE HDR-4A TO PLINE.
193400     MOVE 2                   TO   LINE-ADV.
193500     PERFORM 860-PRT-LINE THRU 869-EXIT.
193600*************************************************************
193700*         RETRIEVE VENDOR INFORMATION FOR THE REPORT        *
193800*************************************************************
193900     MOVE VEN-LIT-SAVE        TO   VEN-LIT.
194000     MOVE VEN-ARG             TO   PRT-VEN-ADDR.
194100     MOVE 1                   TO   LINE-ADV.
           MOVE HDR-5      TO   PLINE.
194300     PERFORM 860-PRT-LINE THRU 869-EXIT.
194400
194500     MOVE SPACES              TO   PRT-BUYER, BUYER-LIT.
194600
           MOVE 0 TO COND-WORD.
           MOVE VEN-ARG TO VENCDE OF DVENDOR-REC.
           START DVENDOR KEY = VENCDE OF DVENDOR-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS = "00" OR FILE-STATUS-1 = "2"
               MOVE 0 TO COND-WORD
           ELSE
               MOVE 99 TO COND-WORD.
194900     IF NOT GOOD-CALL
195000           MOVE "DBFIND DVENDOR -SRSPRT  " TO BU-DISPLAY-MSG
195100           MOVE VEN-ARG                     TO BU-DISPLAY-FLD (5)
195200           PERFORM 990-BLOWUP THRU 999-EXIT.
195400
195500 885-LOAD-VEN-DATA-FOR-PRT.
           MOVE 0 TO COND-WORD.
           READ DVENDOR NEXT INTO BUF-DVENDOR
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF VENCDE OF DVENDOR-REC NOT = VEN-ARG
               MOVE 15 TO COND-WORD.
195800     IF NOT GOOD-CALL
195900         GO TO 886-PRINT.
196000
196100     IF VEN-ITM-NO = "00" OR "07"
196200       IF VEN-ITM-NO = "00"
196300         MOVE SELLER-LIT-SAVE  TO  VEN-LIT
196400         MOVE VEN-NAME         TO  PRT-VEN-ADDR
196500         MOVE 1                TO  LINE-ADV
196600       ELSE
196700         MOVE SPACES           TO  VEN-LIT
196800         MOVE VEN-07-RCD       TO  PRT-VEN-ADDR
196900         MOVE 3                TO  LINE-ADV
197000     ELSE
197100       GO TO 885-LOAD-VEN-DATA-FOR-PRT.
197200
           MOVE HDR-5    TO  PLINE.
197400     PERFORM 860-PRT-LINE THRU 869-EXIT.
197500     GO TO 885-LOAD-VEN-DATA-FOR-PRT.
197600
197700 886-PRINT.
      *----------  PRINT BEFORE RECEIVER INSTRUCTIONS
           IF RCV-BEFORE-INST NOT = SPACES
              PERFORM 601-PRINT-RCV-INST THRU 601-PRI-X
                 VARYING SUB FROM 1 BY 1
                   UNTIL SUB > 6
              MOVE 1 TO LINE-ADV
              ADD  1 TO LINE-CTR
              MOVE SPACES TO PRINT-RCD
              PERFORM 860-PRT-LINE THRU 869-EXIT.

197800     IF PRINT-PRICE-SW = "Y"
197900        MOVE PRICE-QTY-SAVE TO PRICE-QTY-TITLE
198000     ELSE
198100        MOVE SPACES TO PRICE-QTY-TITLE.
198200
           MOVE  HDR-6      TO PLINE.
198400     MOVE 1           TO LINE-ADV.
198500     PERFORM 860-PRT-LINE THRU 869-EXIT.
           MOVE HDR-7  TO PLINE.
198700     PERFORM 860-PRT-LINE THRU 869-EXIT.
198800
198900 889-EXIT.  EXIT.

       COPY OVRPFCALL IN COPYLIB.
200100 990-BLOWUP.
200200     MOVE "CRSPRT"    TO BU-PGM-NAME.
200300     MOVE MISC-RS-ARG TO BU-DISPLAY-FLD (1).
200400     MOVE PO-ARG TO BU-DISPLAY-FLD (2).
200500     MOVE CODE-ARG TO BU-DISPLAY-FLD (3).
200600     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
200700          VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
200800           BU-DISPLAY-FLDS.
200900 999-EXIT.  EXIT.
201000
201100 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
202700 999-CATREAD-EXIT.  EXIT.
