000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. CSUBTIME.
000400 AUTHOR.     C HILLES.
000500 DATE-WRITTEN. MARCH, 1989.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*
001100*    THIS SUBPROGRAM SIMPLY SUBTRACTS TIME-2 FROM TIME-1 AND
001200*    RETURNS THE RESULT.
001700*
006800 ENVIRONMENT DIVISION.
006900 CONFIGURATION SECTION.
007000 SOURCE-COMPUTER.  HP-3000.
007100 OBJECT-COMPUTER.  HP-3000.
007400
007900 DATA DIVISION.
008900 WORKING-STORAGE SECTION.
       01  FF-1-WORK             PIC 9(3).
       01  SS-1-WORK             PIC 9(3).
       01  MM-1-WORK             PIC 9(3).
       01  TIME-1.
           05  TIME-1-HH         PIC 9(2).
           05  TIME-1-MM         PIC 9(2).
           05  TIME-1-SS         PIC 9(2).
           05  TIME-1-FF         PIC 9(2).

       01  TIME-2.
           05  TIME-2-HH         PIC 9(2).
           05  TIME-2-MM         PIC 9(2).
           05  TIME-2-SS         PIC 9(2).
           05  TIME-2-FF         PIC 9(2).

       LINKAGE SECTION.
       01  PASSED-TIME-1.
           05  PASSED-TIME-1-HH         PIC 9(2).
           05  PASSED-TIME-1-MM         PIC 9(2).
           05  PASSED-TIME-1-SS         PIC 9(2).
           05  PASSED-TIME-1-FF         PIC 9(2).

       01  PASSED-TIME-2.
           05  PASSED-TIME-2-HH         PIC 9(2).
           05  PASSED-TIME-2-MM         PIC 9(2).
           05  PASSED-TIME-2-SS         PIC 9(2).
           05  PASSED-TIME-2-FF         PIC 9(2).

       01  ELAPSED-TIME.
           05  ELAPSED-TIME-HH   PIC 9(2).
           05  ELAPSED-TIME-MM   PIC 9(2).
           05  ELAPSED-TIME-SS   PIC 9(2).
           05  ELAPSED-TIME-FF   PIC 9(2).

031600 PROCEDURE DIVISION USING PASSED-TIME-1,                         ,
                                PASSED-TIME-2,
                                ELAPSED-TIME.
       6000-MAIN.
           MOVE PASSED-TIME-1 TO TIME-1.
           MOVE PASSED-TIME-2 TO TIME-2.
           IF TIME-2-FF > TIME-1-FF AND TIME-2-SS >= TIME-1-SS
           AND TIME-2-MM >= TIME-1-MM AND TIME-2-HH >= TIME-1-HH
               MOVE "99999999" TO ELAPSED-TIME
               GO TO 6990-MAIN-X.
           IF TIME-2-SS > TIME-1-SS AND TIME-2-MM >= TIME-1-MM
           AND TIME-2-HH >= TIME-1-HH
               MOVE "99999999" TO ELAPSED-TIME
               GO TO 6990-MAIN-X.
           IF TIME-2-MM > TIME-1-MM AND TIME-2-HH >= TIME-1-HH
               MOVE "99999999" TO ELAPSED-TIME
               GO TO 6990-MAIN-X.
           IF TIME-2-HH > TIME-1-HH
               MOVE "99999999" TO ELAPSED-TIME
               GO TO 6990-MAIN-X.
           IF TIME-2-FF > TIME-1-FF
               COMPUTE FF-1-WORK = TIME-1-FF + 100
               COMPUTE TIME-1-SS = TIME-1-SS - 1
           ELSE
               MOVE TIME-1-FF TO FF-1-WORK.
           COMPUTE ELAPSED-TIME-FF = FF-1-WORK - TIME-2-FF.
           IF TIME-2-SS > TIME-1-SS
               COMPUTE SS-1-WORK = TIME-1-SS + 60
               COMPUTE TIME-1-MM = TIME-1-MM - 1
           ELSE
               MOVE TIME-1-SS TO SS-1-WORK.
           COMPUTE ELAPSED-TIME-SS = SS-1-WORK - TIME-2-SS.
           IF TIME-2-MM > TIME-1-MM
               COMPUTE MM-1-WORK = TIME-1-MM + 60
               COMPUTE TIME-1-HH = TIME-1-HH - 1
           ELSE
               MOVE TIME-1-MM TO MM-1-WORK.
           COMPUTE ELAPSED-TIME-MM = MM-1-WORK - TIME-2-MM.
           COMPUTE ELAPSED-TIME-HH = TIME-1-HH - TIME-2-HH.
       6990-MAIN-X.
           GOBACK.
