000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. CTC999.
000400 AUTHOR.     C HILLES.
000500 DATE-WRITTEN. APRIL, 1985.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*
001100*    THIS PROGRAM PRODUCES A FILE OF TC-999 TRANSACTIONS FOR
001200*    EVERY CODE IN THE DATABASE.
001300*    THIS IS A SUBPROGRAM CALLED OUT OF 'TCDLYABS'
001400*    NOTE: THE CALLING PROGRAM MUST HAVE A DATABASE LOCK ON
001500*    "STORES".
001600*
001700*    2/4/86.
001800*      CHANGED PROGRAM TO ADD STR-ONORDER TO THE TRANSACTION.
001900*      CIH.
002000*    10/1/87: CHANGED TO A SUBPROGRAM OUT OF 'TCDLYABS'.
002100*
      *C   1/18/95  JEFF BUNGO
      *C     CHANGED PROGRAM TO USE ABSTFILE AS THE FILE WITH THE
      *C     CURRENT DAILY TRANSACTIONS.
      *C
      *C   9/12/96  JEFF BUNGO
      *C     EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C     RECOMPILE TO PICK UP COPYLIB CHANGES.
002200*
002300 ENVIRONMENT DIVISION.
002400 CONFIGURATION SECTION.
002500 SOURCE-COMPUTER.  HP-3000.
002600 OBJECT-COMPUTER.  HP-3000.
002700 SPECIAL-NAMES. SYSTEM-CONSOLE IS CONSOLE.
002900 INPUT-OUTPUT SECTION.
003000 FILE-CONTROL.
003100     SELECT TC999-FILE ASSIGN TO DISK-MCFPTC999.
003200     SELECT ABST-FILE  ASSIGN TO DISK-ABSTFILE.
           SELECT MPLTINFO-O
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-I
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

003300
003400 DATA DIVISION.
003500 FILE SECTION.
003600
003700 FD  TC999-FILE
003800     RECORD CONTAINS 80 CHARACTERS
003900     DATA RECORD IS TC999-RCD.
004000 01  TC999-RCD.
004100     05  TC999-DATE                PIC X(6).
004200     05  TC999-TIME                PIC X(6).
004300     05  TC999-TC                  PIC X(3).
004400     05  TC999-PLT                 PIC X(3).
004500     05  TC999-CODE                PIC X(7).
004600     05  TC999-ONHAND              PIC S9(8).
004700     05  TC999-UM                  PIC X(2).
004800     05  TC999-ONORDER             PIC S9(8).
004900     05  FILLER                    PIC X(37).
005000
005100 FD  ABST-FILE
005200     RECORD CONTAINS 80 CHARACTERS
005300     DATA RECORD IS ABST-RCD.
005400 01  ABST-RCD                      PIC X(80).
005500
       FD  MPLTINFO-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-O.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

005600 WORKING-STORAGE SECTION.
005700
005800 77  RCD-CNTR                      PIC 9(6)  VALUE 0.
005900 77  CUTOFF-SEQ-SAVE               PIC 9(5)  VALUE 0.
006000 77  CUTOFF-SEQ-SAVE2              PIC 9(5)  VALUE 0.
006100 77  COMP-SAVE                     PIC X(3)  VALUE SPACES.
       01  TIME-WORK                     PIC X(8).
006200 01  DLY-RCD-CNTR-TC.
006300     05  DAILY-R-C-DATE         PIC X(6)  VALUE SPACES.
006400     05  DAILY-R-C-TIME         PIC X(6)  VALUE SPACES.
006500     05  DAILY-R-C-TC           PIC X(3)  VALUE SPACES.
006600     05  DAILY-R-C-PLT          PIC X(3)  VALUE SPACES.
006700     05  DAILY-R-C-900.
006800         10  DAILY-R-C-CNTR     PIC 9(6)  VALUE ZEROS.
006900         10  DAILY-R-C-CUTOFF-SEQ  PIC 9(5)  VALUE ZEROS.
007000
007100*************************************************************
007200**                                                          **
007300**          C O M M U N I C A T I O N S   A R E A S         **
007400**                                                          **
007500**************************************************************
007600
007700*** PARM FOR CALL TO ANY SUBPROGRAM
007800
007900 01  RET-CODE                      PIC X(2)  VALUE SPACES.
008000
008100 COPY TDATECHK   IN COPYLIB.
008200 COPY SONORDER   IN COPYLIB.
       COPY CCRTFILE   IN COPYLIB.
       COPY CCHKOBJ    IN COPYLIB.
       COPY QCMDEXC    IN COPYLIB.
008600
009500**************************************************************
009600**                                                          **
009700**            D A T A B A S E   W O R K                     **
009800**                                                          **
009900**************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
010000
010100 01  DB-DATASETS.
010200     05  DSET-MSTORERM          PIC X(16)  VALUE "MSTORERM;".
010300     05  DSET-MPLTINFO          PIC X(16) VALUE "MPLTINFO;".
010400
010500 01  MODE-AREA.
010600     05  MODE1                  PIC S9(4)   COMP       VALUE 1.
010700     05  MODE2                  PIC S9(4)   COMP       VALUE 2.
010800     05  MODE3                  PIC S9(4)   COMP       VALUE 3.
010900     05  MODE7                  PIC S9(4)   COMP       VALUE 7.
011000
011100 01  CODE-SEARCH                PIC X(10) VALUE "CORP-CODE;".
011200
011300 01  CODE-ARG                   PIC X(8)  VALUE SPACES.
011400 01  PLTINFO-ARG                PIC X(4)  VALUE "P 01".
011500 01  ALL-ITEMS                  PIC X(2)  VALUE "@;".
011600
011700**************************************************************
011800**                                                          **
011900**           D A T A B A S E   B U F F E R S                **
012000**                                                          **
012100**************************************************************
012200
012300 COPY MSTORERM   IN COPYLIB.
012400 COPY MPLT0      IN COPYLIB.
012500 COPY MPLTP01   IN COPYLIB.
012600 COPY MPLTP02   IN COPYLIB.
012700
012800******************************************************************
012900**                                                              **
013000**          L I N K A G E   S E C T I O N                       **
013100**                                                              **
013200******************************************************************
013300 LINKAGE SECTION.
013400
013500 01  BASE                          PIC X(10).
013600 COPY DBSTAT     IN COPYLIB.
013700 01  TC999-PARMS                   PIC X(30).
013800 01  BU-DISPLAY-MSG.
013900     05  BU-PGM.
014000         10  BU-DISPLAY-MSG-1      PIC X(1).
014100         10  FILLER                PIC X(9).
014200     05  BU-COMMAND                PIC X(46).
014300     05  BU-COMMAND-ERR            PIC 9(4).
014400 01  BU-DISPLAY-FLDS.
014500     05  BU-DISPLAY-LINE OCCURS 5 TIMES.
014600         10  BU-DISPLAY-FLD        PIC X(14).
014700         10  BU-DISPLAY-FLD9       PIC S9(8).
014800
014900 PROCEDURE DIVISION USING          BASE,
015000                                   STATUS-AREA,
015100                                   TC999-PARMS,
015200                                   BU-DISPLAY-MSG
015300                                   BU-DISPLAY-FLDS.
015400
015500 1-HOUSEKEEP SECTION.
015600 1-BEGIN-HOUSEKEEP.
           OPEN INPUT MSTORERM-I.
           OPEN I-O MPLTINFO-O.
015700*------ THE FLAG FILE "DO999ALL" INSTRUCTS THIS PROGRAM TO DO
015800*------ THE COMPLETE 999 TRANSACTION PROCEDURE.  IF NOT THERE,
015900*------ DO NOTHING.
           MOVE "DO999ALL" TO CHKOBJ-FILE-NAME.
           CALL "CCHKOBJ" USING CHKOBJ-FILE-NAME,
             CHKOBJ-RETURN-STATUS.
           IF CHKOBJ-RETURN-STATUS NOT = "00"
               GO TO 2000-EOJ.
016700
016800     DISPLAY "*************************************************".
016900     DISPLAY "***                                           ***".
017000     DISPLAY "***  FILE 'DO999ALL' HAS REQUESTED A COMPLETE ***".
017100     DISPLAY "***  999 TRANSACTION FILE OF ALL CORPORATE    ***".
017200     DISPLAY "***  CODES TO BE GENEREATED.                  ***".
017300     DISPLAY "***                                           ***".
017400     DISPLAY "*************************************************".
017500
017600     DISPLAY "*************************************************"
017700       UPON CONSOLE.
017800     DISPLAY "***                                           ***"
017900       UPON CONSOLE.
018000     DISPLAY "***  FILE 'DO999ALL' HAS REQUESTED A COMPLETE ***"
018100       UPON CONSOLE.
018200     DISPLAY "***  999 TRANSACTION FILE OF ALL CORPORATE    ***"
018300       UPON CONSOLE.
018400     DISPLAY "***  CODES TO BE GENERATED.  THE CUTOFF WILL  ***"
018500       UPON CONSOLE.
018600     DISPLAY "***  TAKE LONGER THAN NORMAL.  ALSO, THE      ***"
018700       UPON CONSOLE.
018800     DISPLAY "***  ABSTFILE WILL BE MUCH BIGGER, AND WILL   ***"
018900       UPON CONSOLE.
019000     DISPLAY "***  TAKE LONGER TO SEND.                     ***"
019100       UPON CONSOLE.
019200     DISPLAY "***     I M P O R T A N T | | |               ***"
019300       UPON CONSOLE.
019400     DISPLAY "***  DO NOT ABORT THE CUTOFF JOB DURING THIS  ***"
019500       UPON CONSOLE.
019600     DISPLAY "***  PROCESS|                                 ***"
019700       UPON CONSOLE.
019800     DISPLAY "***                                           ***"
019900       UPON CONSOLE.
020000     DISPLAY "*************************************************"
020100       UPON CONSOLE.
020200
020300
           ACCEPT TIME-WORK FROM TIME.
020400     DISPLAY "* BEGINNING TC-999 GENERATION PROCEDURE AT ",
020500           TIME-WORK  , " *".
020600
020700     DISPLAY "* BEGINNING TC-999 GENERATION PROCEDURE AT ",
020800       TIME-WORK  , " *"  UPON CONSOLE.
020900
           MOVE "DLTF DO999ALL"          TO   COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.
021400
022000*    MOVE "BUILD DTC999FL;DISC=30000,32,1;REC=-80,16,F,ASCII"
022100*                                  TO   COMMAND.
      *------ CALL CCRTFILE TO CREATE A TEMPORARY FILE 'MCFPTC999'
           MOVE "*CURLIB"     TO CCRTFILE-LIBRARY.
           MOVE "MCFPTC999"   TO CCRTFILE-FILE.
           MOVE "0080"        TO CCRTFILE-RECORD-LENGTH.
           MOVE "01000"       TO CCRTFILE-NO-RECORDS.
           MOVE "01000"       TO CCRTFILE-INCREMENT-AMT.
           MOVE "99"          TO CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               MOVE "CCRTFILE CREATE OF 'MCFPTC999' FAILED"
                  TO BU-DISPLAY-MSG
               GO TO 2000-EOJ.

022800
           ACCEPT TIME-WORK FROM TIME.
022900     DISPLAY "* STARTING TO WRITE ABSTFILE INTO DCT999FL AT ",
023000       TIME-WORK  , " *".
023100     DISPLAY "* STARTING TO WRITE ABSTFILE INTO DCT999FL AT ",
023200       TIME-WORK  , " *" UPON CONSOLE.
023300
023400     OPEN INPUT ABST-FILE.
023500     OPEN OUTPUT TC999-FILE.
023600     PERFORM 7000-WRITE-ABSTFILE THRU 7090-WA-X.
023700     CLOSE ABST-FILE.
023800
           ACCEPT TIME-WORK FROM TIME.
023900     DISPLAY "* STARTING WRITE OF EACH CORPRATE CODE AT ",
024000       TIME-WORK  , " *".
024100     DISPLAY "* STARTING WRITE OF EACH CORPRATE CODE AT ",
024200       TIME-WORK  , " *" UPON CONSOLE.
024300
024400     PERFORM 6000-MAIN THRU 6990-MAIN-X.
024500
024600     CLOSE TC999-FILE.
024700
           ACCEPT TIME-WORK FROM TIME.
024800     DISPLAY "* SWITCHING MCFPTC999 WITH ABSTFILE AT ",
024900       TIME-WORK  , " *".
025000     DISPLAY "* SWITCHING MCFPTC999 WITH ABSTFILE AT ",
025100       TIME-WORK  , " *" UPON CONSOLE.
025200
025300*    MOVE "PURGE ABSTFL99"         TO   COMMAND.
           MOVE "MCFPABST99" TO CHKOBJ-FILE-NAME.
           CALL "CCHKOBJ" USING CHKOBJ-FILE-NAME,
             CHKOBJ-RETURN-STATUS.
           IF CHKOBJ-RETURN-STATUS = "00"
               MOVE "DLTF FILE(MCFPABST99)" TO COMMAND-WORK
               DISPLAY COMMAND-WORK
               CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.
025700
025800*    MOVE "RENAME ABSTFILE,ABSTFL99" TO COMMAND.
           MOVE
           "RNMOBJ OBJ(ABSTFILE) OBJTYPE(*FILE) NEWOBJ(MCFPABST99)"
             TO COMMAND-WORK.
025900     DISPLAY COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.
026500
026600*    MOVE "RENAME DTC999FL,ABSTFILE" TO COMMAND.
           MOVE
           "RNMOBJ OBJ(MCFPTC999) OBJTYPE(*FILE) NEWOBJ(ABSTFILE)"
             TO COMMAND-WORK.
026700     DISPLAY COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.
027300
           ACCEPT TIME-WORK FROM TIME.
027400     DISPLAY "* ENDING COMPLETE TC999 UPDATE FOR ALL CODES AT ",
027500       TIME-WORK  , " *".
027600     DISPLAY "* ENDING COMPLETE TC999 UPDATE FOR ALL CODES AT ",
027700       TIME-WORK  , " *" UPON CONSOLE.
027800
027900 2000-EOJ.
028000     GOBACK.
028100
028700 6000-MAIN.
028800
028900     MOVE "P 01"                   TO  PLTINFO-ARG.
029000*    CALL "DBGET" USING BASE, DSET-MPLTINFO, MODE7,
029100*      STATUS-AREA, ALL-ITEMS, BUF-MPLTINFO, PLTINFO-ARG.
           MOVE PLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-REC-O.
           READ MPLTINFO-O INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
077400     IF FILE-STATUS NOT = "00"
029300         MOVE "CTC999 DBGET ERR 6000-M"   TO BU-DISPLAY-MSG
029400         GO TO 6990-MAIN-X.
029500
029600     MOVE MPLTINFO-COMPANY         TO   DAILY-R-C-PLT,
029700                                        COMP-SAVE.
029800
029900     MOVE "P 02"                   TO  PLTINFO-ARG.
030000*    CALL "DBGET" USING BASE, DSET-MPLTINFO, MODE7,
030100*      STATUS-AREA, ALL-ITEMS, BUF-MPLTINFO,
030200*      PLTINFO-ARG.
           MOVE PLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-REC-O.
           READ MPLTINFO-O INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
077400     IF FILE-STATUS NOT = "00"
030400         MOVE "CTC999 DBGET ER2 6000-M"   TO BU-DISPLAY-MSG
030500         GO TO 6990-MAIN-X.
030600
030700     MOVE MPLTINFO-SEQ   TO  CUTOFF-SEQ-SAVE
030800                                       CUTOFF-SEQ-SAVE2.
030900
031000*---------- WRITE THE HEADER RECORD FOR THE FILE, WHICH IS
031100*---------- IDENTICAL TO A DAILY TRANSACTION FILE (ABSTFILE)
031200*---------- HEADER RECORD.
031300     MOVE 1                        TO   DATE-MODE.
031400     CALL "TDATECHK" USING DATE-CHECK-AREA.
031500     MOVE DATE-YMD-OUT             TO   DAILY-R-C-DATE.
031600     MOVE DATE-UNFORMATTED-TIME-OUT TO  DAILY-R-C-TIME.
031700     MOVE "001"                    TO   DAILY-R-C-TC.
031800     ADD 1                         TO   CUTOFF-SEQ-SAVE.
031900     MOVE CUTOFF-SEQ-SAVE          TO   DAILY-R-C-CUTOFF-SEQ.
032000     MOVE DLY-RCD-CNTR-TC          TO   TC999-RCD.
032100     WRITE TC999-RCD.
032200     ADD 1                         TO   RCD-CNTR.
032300
032400     MOVE DAILY-R-C-PLT            TO   TC999-PLT.
032500     MOVE "999"                    TO   TC999-TC.
032600
032700*------ THIS REWIND OF THE DATASET MSTORERM WILL RESET POINTER
032800*------ TO BEGINNING OF DATASET FOR SERIAL READ.
032900*    CALL "DBCLOSE" USING BASE, DSET-MSTORERM, MODE3,
033000*      STATUS-AREA.
           MOVE SPACES TO CORPCDE OF MSTORERM-REC-I.
           START MSTORERM-I KEY >= CORPCDE OF MSTORERM-REC-I
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "START ERROR MSTORERM     " TO BU-DISPLAY-MSG
               GO TO 6990-MAIN-X.

033500 6100-SERIAL-READ.
033600*    CALL "DBGET" USING BASE, DSET-MSTORERM, MODE2, STATUS-AREA,
033700*      ALL-ITEMS, BUF-MSTORERM, CODE-ARG.
           READ MSTORERM-I NEXT INTO BUF-MSTORERM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1"
033900         GO TO 6200-WRITE-CONTROL-RCD
034000     ELSE
034100     IF FILE-STATUS NOT = "00"
034200         MOVE "CTC999 DBGET ERROR 6100-SR" TO BU-DISPLAY-MSG
034300         GO TO 6990-MAIN-X.
034400
034500*------- CORP CODE 'NON-STR' IS A DUMMY MASTER FOR NON-STOREROOM
034600*------- PO DETAIL SEGMENTS.
034700     IF CORP-CODE = "NON-STR"
034800         GO TO 6100-SERIAL-READ.
034900
           MOVE SPACES TO TC999-RCD.
035000     MOVE 1                        TO   DATE-MODE.
035100     CALL "TDATECHK" USING DATE-CHECK-AREA.
035200     MOVE DATE-YMD-OUT             TO   TC999-DATE.
035300     MOVE DATE-UNFORMATTED-TIME-OUT TO  TC999-TIME.
           MOVE "999"                    TO   TC999-TC.
           MOVE COMP-SAVE                TO   TC999-PLT.
035400     MOVE CORP-CODE                TO   TC999-CODE.
035500     MOVE STR-ONHAND               TO   TC999-ONHAND.
035600     MOVE STR-UM                   TO   TC999-UM.
035700*------- STOREROOM ONORDER IS NO LONGER STORED IN THE MSTORERM
035800*------- MASTER, BUT IS DETERMINED BY A SUBPROGRAM BY FINDING
035900*------- ALL PO ITEMS FOR THAT CODE
036000     CALL "SONORDER" USING BASE, CORP-CODE, SONORDER-PARMS,
036100       COMP-SAVE, STATUS-AREA, BU-DISPLAY-MSG, BU-DISPLAY-FLDS.
036200     IF BU-DISPLAY-MSG-1 NOT = SPACES
036300         DISPLAY "******** SONORDER ERROR FOR CODE ", CORP-CODE
036400         DISPLAY BU-DISPLAY-MSG
036500         MOVE SPACES               TO   BU-DISPLAY-MSG.
036600     MOVE SONORDER-TOTAL-ONORDER   TO   TC999-ONORDER.
036700
036800     WRITE TC999-RCD.
036900     ADD 1                         TO  RCD-CNTR.
037000
037100     GO TO 6100-SERIAL-READ.
037200
037300 6200-WRITE-CONTROL-RCD.
037400     MOVE "900"                    TO  DAILY-R-C-TC.
037500     ADD 1                         TO  RCD-CNTR.
037600     MOVE RCD-CNTR                 TO  DAILY-R-C-CNTR.
037700     MOVE CUTOFF-SEQ-SAVE          TO  DAILY-R-C-CUTOFF-SEQ.
037800     MOVE DLY-RCD-CNTR-TC          TO  TC999-RCD.
037900     WRITE TC999-RCD.
038000
038100 6300-UPDATE-SEQ-CNTR.
038200     MOVE CUTOFF-SEQ-SAVE          TO  MPLTINFO-SEQ.
038300*    CALL "DBUPDATE" USING BASE, DSET-MPLTINFO, MODE1,
038400*      STATUS-AREA, ALL-ITEMS, BUF-MPLTINFO.
           REWRITE MPLTINFO-REC-O FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
038600         MOVE "CTC999 DBUPDATE ERR 6300-USC" TO BU-DISPLAY-MSG
038700         GO TO 6990-MAIN-X.
038800
038900     DISPLAY "* SEQUENCE COUNTER UPDATED FROM ",
039000       CUTOFF-SEQ-SAVE2, " TO ", CUTOFF-SEQ-SAVE, " *".
039100
039200 6990-MAIN-X.
039300     EXIT.
039400
039500 7000-WRITE-ABSTFILE.
039600 7010-WRITE-ABSTFILE-LOOP.
039700     READ ABST-FILE AT END
039800         GO TO 7090-WA-X.
039900
040000     MOVE ABST-RCD                 TO   TC999-RCD.
040100     WRITE TC999-RCD.
040200
040300     GO TO 7010-WRITE-ABSTFILE-LOOP.
040400
040500 7090-WA-X.
040600     EXIT.
