       IDENTIFICATION DIVISION.
       PROGRAM-ID.    CVALID.
       AUTHOR.        MARVIN MITCHELL.
       INSTALLATION.  THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
       DATE-WRITTEN.  JANUARY 1993.
      *REMARKS.       GENERIC CODE VALIDATION PROGRAM.

      *D         This program checks the DVALIDTYPE (MCFPCS5200) for
      *D    a code that is passed to this program via the CVALID-PARMS
      *D    copylib.  If the code is found, the description of that code
      *D    is returned to the calling program.  If not found, the
      *D    MVALIDTYPE (MCFPCS5100) dataset is searched for the TYPE
      *D    of code passed from the calling program.  When the TYPE
      *D    of code is found, the ERROR-MESSAGE NUMBER is moved to the
      *D    correct CVALID-PARM field and returned to the calling pro-
      *D    gram.
      *D
      *D    IF THE TYPE CODE IS INVALID:
      *D         If there is no record containing the TYPE of code,
      *D    ERROR-MESSAGE 09100, informing the user that an INVALID
      *D    CODE-TYPE wass passed to this program, is returned to the
      *D    calling program.
      *D
      *D    The following TWO parameters are needed to execute this
      *D    program on the AS/400:
      *D
      *D    PARAMETERS:
      *D       BU-DISPLAY-MSG
      *D      ================
      *D   01  BU-DISPLAY-MSG         PIC X(60).
      *D
      *D         Returns:    SPACES if no ERRORS occur.
      *D
      *D                     Message to help locate the
      *D                     problem if an ERROR occurs.
      *D
      *D
      *D       CVALID-PARMS
      *D      ==============
      *D   01  CVALID-PARMS.
      *D       05  CVALID-CODE.                        <== Passed by
      *D           10  CVALID-CODE-TYPE      PIC X(6). <== calling
      *D           10  CVALID-CODE-KEY       PIC X(6). <== program.
      *D
      *D       05  CVALID-ERROR-CODE.                  <-- Returned
      *D           10  CVALID-ERROR-SET-NUM  PIC S9(2).<-- to calling
      *D           10  CVALID-ERROR-MSG-NUM  PIC S9(2).<-- program by
      *D       05  CVALID-CODE-DESC          PIC X(30).<-- CVALID.
      *D       05    FILLER                  PIC X(33).
      *D
      *D         Passed:
      *D            VAlid 12 character code in the CVALID-CODE field
      *D            of CVALID-PARMS.
      *D
      *D         Returns:
      *D            Error SET and MSG number in the CVALID-ERROR-CODE
      *D            field if an INVALID type or code was passed to
      *D            CVALID.
      *D
      *D            Description of the passed code in the CVALID-CODE-
      *D            DESC field if the passed code was valid.
      *D

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. AS400.
       OBJECT-COMPUTER. AS400.
       INPUT-OUTPUT SECTION.

       FILE-CONTROL.
           SELECT MVALID-FILE
               ASSIGN TO DATABASE-MCFLCS5101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DVALID-FILE
               ASSIGN TO DATABASE-MCFLCS5202
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  MVALID-FILE
           LABEL RECORDS ARE STANDARD.
       01  TYPE-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS5101.

       FD  DVALID-FILE
           LABEL RECORDS ARE STANDARD.
       01  DATA-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS5202.

       WORKING-STORAGE SECTION.

       COPY DVLDDATA OF COPYCSIS.
       COPY MVLDTYPE OF COPYCSIS.

       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X     VALUE "0".
           05  FILE-STATUS-2             PIC X     VALUE "0".

      ****************************************************
      **                                                **
      **         L I N K A G E    S E C T I O N         **
      **                                                **
      ****************************************************

       LINKAGE SECTION.
       01  BU-DISPLAY-MSG                PIC X(60).

       COPY CVALID   OF COPYCSIS.

       PROCEDURE DIVISION  USING  BU-DISPLAY-MSG,
                                  CVALID-PARMS.

       0-INSTRUCTIONS.
           PERFORM 6-MAIN         THRU 6-EXIT.
           GOBACK.

       6-MAIN.
           OPEN INPUT MVALID-FILE,
                      DVALID-FILE.

           MOVE ZEROS        TO CVALID-ERROR-CODE.
           MOVE SPACES       TO CVALID-CODE-DESC,
                                BU-DISPLAY-MSG.

           MOVE CVALID-CODE  TO VLDCODEKEY OF DATA-REC.

           START DVALID-FILE
             KEY IS EQUAL    TO VLDCODEKEY OF DATA-REC
               INVALID KEY
                 PERFORM 60-GET-ERROR-NUM THRU 60-EXIT
                 GO TO 6-EXIT.

           READ DVALID-FILE  INTO  BUF-DVALIDDATA
             INVALID KEY
               MOVE "INVALID KEY FOUND ON READ TO DVALID"
                   TO BU-DISPLAY-MSG
               GO TO 6-EXIT.

           MOVE VALID-CODE-DESC TO CVALID-CODE-DESC.

           CLOSE MVALID-FILE,
                 DVALID-FILE.

       6-EXIT.
           EXIT.

       60-GET-ERROR-NUM.
           MOVE CVALID-CODE-TYPE TO VLDCODETYP OF TYPE-REC.

           START MVALID-FILE
             KEY IS EQUAL TO VLDCODETYP OF TYPE-REC
               INVALID KEY
                 MOVE   9 TO CVALID-ERROR-SET-NUM
                 MOVE 100 TO CVALID-ERROR-MSG-NUM
                 MOVE "NO MVALID RECORD FOUND IN CVALID"
                     TO BU-DISPLAY-MSG
                 GO TO 60-EXIT.

           READ MVALID-FILE  INTO BUF-MVALIDTYPE
             INVALID KEY
               MOVE "INVALID KEY ERROR ON READ TO MVALID"
                 TO BU-DISPLAY-MSG
               GO TO 60-EXIT.

           MOVE VALID-TYPE-SET-NO TO CVALID-ERROR-SET-NUM.
           MOVE VALID-TYPE-MSG-NO TO CVALID-ERROR-MSG-NUM.

       60-EXIT.
           EXIT.
