       IDENTIFICATION DIVISION.
       PROGRAM-ID.          CVENDEL.
       AUTHOR.              C HILLES.
       DATE-WRITTEN.        8/8/85.
       DATE-COMPILED.
       INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
      *SECURITY.
      *REMARKS.
      *    THIS SUBPROGRAM WILL DELETE ALL SEGMENTS FOR A VENDOR
      *    NUMBER PASSED BY THE CALLING PROGRAM.
      *
      *C   4/11/94.   MARVIN MITCHELL  REQUEST #6490
      *C     COMMENTED EACH OF THE 'COPY' CODE STATEMENTS AT
      *C     THE END OF THIS PROGRAM, AND COPIED THE ACTUAL
      *C     COPYLIB MEMBERS' SOURCE CODE.
      *C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  HP-3000.
       OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DVENDOR-VN-O
               ASSIGN TO DATABASE-MCFLCS0701
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DVENDITM-VN-O
               ASSIGN TO DATABASE-MCFLCS0801
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT KVENDOR-VN-O
               ASSIGN TO DATABASE-MCFLCSVEN2
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  DVENDOR-VN-O
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-VN-REC-O.
           COPY DDS-MCRPCS0700  OF MCFLCS0701.

       FD  DVENDITM-VN-O
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM-VN-REC-O.
           COPY DDS-MCRPCS0800  OF MCFLCS0801.

       FD  KVENDOR-VN-O.
       01  KVENDOR-VN-REC-O.
           COPY DDS-MCRPCSVEND  OF MCFLCSVEN2.

       WORKING-STORAGE SECTION.

      **************************************************************
      **                                                          **
      **            D A T A B A S E   W O R K                     **
      **                                                          **
      **************************************************************

       77  HANDLE-BLOWUP-FLAG            PIC X      VALUE "Y".

       COPY FILESTAT IN COPYLIB.

       01  DSET-NAMES.
           05  DSET-NAME                 PIC X(16)  VALUE SPACES.
           05  DSET-DVENDOR              PIC X(16)  VALUE "DVENDOR;".
           05  DSET-DVENDITM             PIC X(16)  VALUE "DVENDITM;".

       01  MODE-AREA.
           05  MODE1                  PIC S9(4)   BINARY     VALUE 1.
           05  MODE3                  PIC S9(4)   BINARY     VALUE 3.
           05  MODE5                  PIC S9(4)   BINARY     VALUE 5.
           05  MODE7                  PIC S9(4)   BINARY     VALUE 7.

       01 ITEMS-LISTING.
           05  ALL-ITEMS                 PIC XX    VALUE "@;".
           05  VEN-SEARCH                PIC X(10) VALUE "VEN-CODE;".

      **************************************************************
      **                                                          **
      **           D A T A B A S E   B U F F E R S                **
      **                                                          **
      **************************************************************

       COPY DVENDOR    IN COPYLIB.
       COPY KVENDOR    IN COPYLIB.
       COPY DVENDITM   IN COPYLIB.

      **************************************************************
      **                                                          **
      **            L I N K A G E   S E C T I O N                 **
      **                                                          **
      **************************************************************

       LINKAGE SECTION.

       01  RET-CODE                      PIC S9(4) BINARY.
       01  CALL-MODE                     PIC S9(4) BINARY.
       01  BASE                          PIC X(10).
       COPY DBSTAT IN COPYLIB.

       01  VEN-ARG                       PIC X(10).

       01  BU-DISPLAY-MSG.
           05  BU-MSG-AREA               PIC X(60).

       PROCEDURE DIVISION USING RET-CODE, CALL-MODE, BASE,
           STATUS-AREA, VEN-ARG, BU-DISPLAY-MSG.

       MAIN-LINE-LOGIC.

           MOVE "Y" TO HANDLE-BLOWUP-FLAG.

           PERFORM 9999-OPENS.
           MOVE DSET-DVENDOR TO DSET-NAME.
           PERFORM 9999-DSET-LOCK.

      *
      * DELETE KVENDOR ENTRY IF IT EXISTS
      *
           PERFORM 9999-GETKEY-KVENDOR-VN-O.
           IF GOOD-CALL
             PERFORM 9999-DELETE-KVENDOR-VN-O
           END-IF.

      *
      * DELETE DVENDOR ENTRIES
      *
           PERFORM 9999-CHAINHD-DVENDOR-VN-O.
           PERFORM 9999-GETNEXT-DVENDOR-VN-O.
           PERFORM UNTIL END-OF-CHAIN


      *------- VENDORS WITH A DETAIL "99" INDICATE IT IS A SPECIAL
      *------- "PAY UPON RECEIPT" VENDOR WHICH MUST NOT BE TOTALLY
      *------- DELETED
             IF VEN-ITM-NO NOT = "99"
               PERFORM 9999-DELETE-DVENDOR-VN-O
             END-IF
             PERFORM 9999-GETNEXT-DVENDOR-VN-O

           END-PERFORM.
           PERFORM 9999-UNLOCK.

      *
      * DELETE DVENDITM ENTRIES
      *
           MOVE DSET-DVENDITM TO DSET-NAME.
           PERFORM 9999-DSET-LOCK.

           PERFORM 9999-CHAINHD-DVENDITM-VN-O.
           PERFORM 9999-GETNEXT-DVENDITM-VN-O.
           PERFORM UNTIL END-OF-CHAIN

             PERFORM 9999-DELETE-DVENDITM-VN-O
             PERFORM 9999-GETNEXT-DVENDITM-VN-O

           END-PERFORM.
           PERFORM 9999-UNLOCK.

       2100-BLOWUP.
           PERFORM 9999-CLOSES.
           GOBACK.

       9999-OPENS.
           OPEN I-O DVENDOR-VN-O, DVENDITM-VN-O, KVENDOR-VN-O.

       9999-CLOSES.
           CLOSE DVENDOR-VN-O, DVENDITM-VN-O, KVENDOR-VN-O.

       9999-DSET-LOCK.
      * DUMMY COPYLIB MEMBER ON AS/400

       9999-UNLOCK.
      * DUMMY COPYLIB MEMBER ON AS/400

       9999-CHAINHD-DVENDITM-VN-O.
           MOVE 0 TO COND-WORD.
           MOVE VEN-ARG TO VENCDE OF DVENDITM-VN-REC-O.
           START DVENDITM-VN-O KEY = VENCDE OF DVENDITM-VN-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DVENDITM-VN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-DELETE-DVENDITM-VN-O.
           MOVE 0 TO COND-WORD.
           DELETE DVENDITM-VN-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "DELETE ERR 9999-DELETE-DVENDITM-VN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DVENDITM-VN-O.
           MOVE 0 TO COND-WORD.
           READ DVENDITM-VN-O NEXT INTO BUF-DVENDITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DVENDITM-VN-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DVENDITM-VN-O"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF VENCDE OF DVENDITM-VN-REC-O NOT = VEN-ARG
               PERFORM 9999-RESET-DVENDITM-VN-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DVENDITM-VN-O.
           MOVE HIGH-VALUES TO VENCDE OF DVENDITM-VN-REC-O.
           START DVENDITM-VN-O KEY > VENCDE OF DVENDITM-VN-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-CHAINHD-DVENDOR-VN-O.
           MOVE 0 TO COND-WORD.
           MOVE VEN-ARG TO VENCDE OF DVENDOR-VN-REC-O.
           START DVENDOR-VN-O KEY = VENCDE OF DVENDOR-VN-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DVENDOR-VN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-DELETE-DVENDOR-VN-O.
           MOVE 0 TO COND-WORD.
           DELETE DVENDOR-VN-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "DELETE ERR 9999-DELETE-DVENDOR-VN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DVENDOR-VN-O.
           MOVE 0 TO COND-WORD.
           READ DVENDOR-VN-O NEXT INTO BUF-DVENDOR
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DVENDOR-VN-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DVENDOR-VN-O"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF VENCDE OF DVENDOR-VN-REC-O NOT = VEN-ARG
               PERFORM 9999-RESET-DVENDOR-VN-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DVENDOR-VN-O.
           MOVE HIGH-VALUES TO VENCDE OF DVENDOR-VN-REC-O.
           START DVENDOR-VN-O KEY > VENCDE OF DVENDOR-VN-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-DELETE-KVENDOR-VN-O.
           MOVE 0 TO COND-WORD.
           DELETE KVENDOR-VN-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "DELETE ERR 9999-DELETE-KVENDOR-VN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETKEY-KVENDOR-VN-O.
           MOVE 0 TO COND-WORD.
           MOVE VEN-ARG TO KVENCDE OF KVENDOR-VN-REC-O.
           READ KVENDOR-VN-O INTO BUF-KVENDOR
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-KVENDOR-VN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-RESET-KVENDOR-VN-O.
           MOVE HIGH-VALUES TO KVENCDE OF KVENDOR-VN-REC-O.
           START KVENDOR-VN-O KEY > KVENCDE OF KVENDOR-VN-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

