       IDENTIFICATION DIVISION.

       PROGRAM-ID.     DLTVNDCAT.
       AUTHOR.         EXLTECH, LLC - DAN RAUCH

      ***************************************************************
      ** -------------------- DLTVNDCAT ---------------------------
      ** USE VENDOR CODE PASSED FROM CALLER TO DELETE VENDOR CATALOG
      ***************************************************************

      ** 10-14-2003 *************************************************
      ** -------------------- NOT USED YET ------------------------
      ** CURRENTLY THE VENDOR CATALOG DELETE IS HANDLED BY A CLP OF
      ** THE SAME NAME USING SQL COMMAND. SHOULD SOME ADDITIONAL
      ** FUNCTIONALITY BE NECESSARY THAT THE CL CAN'T HANDLE, THIS
      ** PROGRAM WOULD BE MODIFIED TO REPLACE IT.
      ***************************************************************

      *================================================================
       ENVIRONMENT DIVISION.
      *===============================================================

       CONFIGURATION SECTION.

       SOURCE-COMPUTER.       IBM-AS400.
       OBJECT-COMPUTER.       IBM-AS400.
       SPECIAL-NAMES.         LOCAL-DATA IS LDA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT CATALOG-FILE     ASSIGN TO DATABASE-MCFLAB2001
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

      *================================================================
       DATA DIVISION.
      *================================================================
       FILE SECTION.

       FD  CATALOG-FILE.
       01  CATALOG-REC.
       COPY DDS-ALL-FORMATS OF MCFLAB2001.
       COPY DARIBACAT  IN COPYLIB.

      *----------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *----------------------------------------------------------------

       COPY FILESTATUS  OF COPYLIB.
       COPY DTSPARMS2   OF COPYLIB.

      *============================================================
      *===              L I N K A G E    S E C T I O N
      *============================================================
       LINKAGE SECTION.
       01  LS-VENDOR                PIC X(10).

      *================================================================
      *===        P R O C E D U R E    D I V I S I O N              ===
      *================================================================
       PROCEDURE DIVISION  USING LS-VENDOR.
       0000-PROGRAM-ENTRY.

           OPEN  I-O    CATALOG-FILE.

           PERFORM 0010-INITIALIZE          THRU 0010-EXIT.
           PERFORM 1000-MAIN-LOGIC-ROUTINE  THRU 1000-EXIT
                   UNTIL FS-END-OF-FILE.

           CLOSE        CATALOG-FILE.

       0000-PROGRAM-END.
           GOBACK.

      *****************************************************************
      ***    1ST TIME PROCESSING ROUTINE
      *****************************************************************
       0010-INITIALIZE.

           PERFORM 9000-START-CATALOG   THRU 9000-START-EXIT.
           PERFORM 9000-READN-CATALOG   THRU 9000-READN-EXIT.

       0010-EXIT.
            EXIT.

      *****************************************************************
      ***  MAIN PROCESSING LOOP ROUTINE
      *****************************************************************
       1000-MAIN-LOGIC-ROUTINE.

           PERFORM 9000-DELET-CATALOG   THRU 9000-DELET-EXIT.
           PERFORM 9000-READN-CATALOG   THRU 9000-READN-EXIT.

       1000-EXIT.
            EXIT.


      *----------------------------------------------------------------
      *
      *                ALL FILE I-O'S BELOW THIS POINT
      *
      *----------------------------------------------------------------

      *****************************************************************
      ***  START CATALOG FILE
      *****************************************************************
       9000-START-CATALOG.

           INITIALIZE CATALOG-REC.

           MOVE LS-VENDOR   TO ARIBACAT-VENDOR-CODE OF BUF-DARIBCAT.

           START CATALOG-FILE
                 KEY IS >= EXTERNALLY-DESCRIBED-KEY
           END-START.

       9000-START-EXIT.
            EXIT.

      *****************************************************************
      ***  READ CATALOG FILE NEXT RECORD
      *****************************************************************
       9000-READN-CATALOG.

           READ  CATALOG-FILE  NEXT RECORD
           END-READ.

           IF  FS-END-OF-FILE
               GO TO 9000-READN-EXIT
           END-IF.

           IF  ARIBACAT-VENDOR-CODE OF BUF-DARIBCAT NOT = LS-VENDOR
               SET FS-END-OF-FILE   TO TRUE
           END-IF.

       9000-READN-EXIT.
            EXIT.
      *****************************************************************
      ***  DELETE CATALOG REC
      *****************************************************************
       9000-DELET-CATALOG.

           DELETE CATALOG-FILE
           END-DELETE.

       9000-DELET-EXIT.
            EXIT.
      *****************************************************************
      ***                       END  OF  SOURCE
      *****************************************************************
