     H******************************************************
     H*  SCREEN HARD COPY : THARDCPY                       *
     H*  ----------------                                  *
     H*                                                    *
     H*  THIS PROGRAM COPIES SCREEN PRINTS ONTO            *
     H*  PAPER                                             *
     H*                                                    *
     H*  IT TAKES INTO ACCOUNT THE FOLLOWING ATTRIBUTES:   *
     H*        - NONDISPLAY                                *
     H*        - UNDERLINE                                 *
     H*        - HIGH INTENSITY                            *
     H*                                                    *
     H*  ASSOCIATE IT WITH THE ATTENTION KEY BY ENTERING   *
     H*  THE FOLLOWING COMMAND:                            *
     H*     SETATNPGM  PGM(THARDCPY) SET(*ON)              *
     H*                                                    *
     H******************************************************
     H            D
     F******************************************************
     F*  FILES USED IN THE PROGRAM                         *
     F*  -------------------------                         *
     F*                                                    *
     F*  SCREEN1 : DISPLAY FILE USED FOR COMPILATION       *
     F*            OVERRIDE WITH SCREEN2 FOR THE           *
     F*            EXECUTION.                              *
     F*  QSYSPRT : PRINTER FILE FOR OUTPUT                 *
     F*                                                    *
     F******************************************************
     FSCREEN1 CF  E                    WORKSTN                        UC
     FQSYSPRT O   F     132            PRINTER
     E******************************************************
     E*  ARRAYS                                            *
     E*  ------                                            *
     E*                                                    *
     E*  ECR : SCREEN WITH ATTRIBUTES                      *
     E*        24 LINES FOR 80 COLUMNS                     *
     E*  LIG : ONE LINE OF 80 COLUMNS                      *
     E*  UL  : LINE FOR UNDELINED CHARACTERS               *
     E*  HI  : LINE FOR HIGH INTENSITY CHARACTERS          *
     E*  B   : ARRAY FOR BUFFER                            *
     E*  OVR : FOR OVERRIDE DISPLAY FILE                   *
     E*                                                    *
     E******************************************************
     E                    ECR        24 80
     E                    LIG        80  1
     E                    UL         80  1
     E                    HI         80  1
     E                    B        2048  1
     E                    OVR     1   1 80
     I******************************************************
     I*  DATA STRUCTURES                                   *
     I******************************************************
     IBUFFER      DS                           2048
     I                                        12048 B
     C******************************************************
     C* VARIABLES AND INDICATORS USED                      *
     C* -----------------------------                      *
     C*                                                    *
     C* *INLR    : END OF PROGRAM                          *
     C* *IN72    : THE CURRENT LINE HAS HIGH INTENSITY     *
     C*            CHARACTERS                              *
     C* *IN73    : THE CURRENT LINE HAS UNDELINED          *
     C*            CHARACTERS                              *
     C* *IN81    : NONDISPLAY MODE                         *
     C* *IN82    : HIGH INTENSITY MODE                     *
     C* *IN83    : UNDERLINE MODE                          *
     C* BYTE     : CURRENT CHARACTER OF ATTRIBUTE          *
     C* CMDLN    : LENGTH OF COMMAND                       *
     C* DETAIL   : EXCEPT NAME FOR LINE OUTPUT             *
     C* HExx     : REPRESENTATION OF HEX CHARACTERS        *
     C* I        : LINE INDEX                              *
     C* J        : COLUMN INDEX                            *
     C*            OR WORK INDEX                           *
     C* LIGHI    : EXCEPT NAME FOR HIGH INTENSITY          *
     C*            CHARACTERS                              *
     C* LIGUL    : EXCEPT NAME FOR UNDERLINE CHARACTERS    *
     C*                                                    *
     C******************************************************
     C*
     C*  ---->  OPEN THE DISPLAY FILE
     C*   ON THE S/38, USE CALL 'QCAEXEC'
     C*
     C                     CALL 'QCMDEXC'
     C                     PARM           OVR
     C                     PARM 80        CMDLN  155
     C                     OPEN SCREEN1
     C*
     C*  ---->  READ SCREEN CONTENT
     C*            1. FORMAT THE DATA STREAM
     C*            2. READ THE CONTENT
     C*            3. MOVE THE CONTENT INTO ARRAY ECR
     C*
     C                     BITOF'01234567'HEX00   1
     C                     BITOF'01234567'HEX02   1
     C                     BITON'6'       HEX02
     C                     BITOF'01234567'HEX04   1
     C                     BITON'5'       HEX04
     C                     BITOF'01234567'HEX10   1
     C                     BITON'3'       HEX10
     C                     BITOF'01234567'HEX62   1
     C                     BITON'126'     HEX62
     C                     BITOF'01234567'HEX73   1
     C                     BITON'12367'   HEX73
     C                     MOVE *BLANK    B
     C                     MOVE HEX00     B,1
     C                     MOVE HEX02     B,2
     C                     MOVE HEX10     B,3
     C                     MOVE HEX00     B,4
     C                     MOVE HEX73     B,5
     C                     MOVE HEX04     B,6
     C                     MOVE HEX62     B,7
     C                     EXFMTFMT#1
     C                     MOVEAB,1       ECR,1
     C*
     C*  ---->  INITIALIZATION
     C*
     C                     BITOF'01234567'HEX20   1
     C                     BITON'2'       HEX20
     C                     BITOF'01234567'HEX3F   1
     C                     BITON'234567'  HEX3F
     C                     MOVE '0'       *IN81
     C                     MOVE '0'       *IN82
     C                     MOVE '0'       *IN83
     C*
     C*  ---->  LINES LOOP
     C*
     C           1         DO   24        I       30
     C                     MOVEAECR,I     LIG,1
     C                     MOVE *BLANK    HI
     C                     MOVE *BLANK    UL
     C                     MOVE '0'       *IN72
     C                     MOVE '0'       *IN73
     C*
     C*  ---->  COLUMNS LOOP
     C*
     C           1         DO   80        J       30
     C           LIG,J     IFLT HEX20
     C                     MOVE *BLANK    LIG,J
     C                     END
     C                     MOVE LIG,J     BYTE    1
     C*
     C*  ---->  TESTING IF ATTRIBUTE
     C*
     C           BYTE      IFGE HEX20
     C           BYTE      ANDLEHEX3F
     C                     MOVE '0'       *IN81
     C                     MOVE '0'       *IN82
     C                     MOVE '0'       *IN83
     C                     END
     C*
     C*  ---->  IF NONDISPLAY
     C*
     C           *IN81     IFEQ '1'
     C                     MOVE *BLANK    LIG,J
     C                     END
     C*
     C*  ---->  IF HIGH INTENSITY
     C*
     C           *IN82     IFEQ '1'
     C                     MOVE LIG,J     HI,J
     C                     MOVE '1'       *IN72
     C                     END
     C*
     C*  ---->  IF UNDERLINE
     C*
     C           *IN83     IFEQ '1'
     C                     MOVE '_'       UL,J
     C                     MOVE '1'       *IN73
     C                     END
     C*
     C           BYTE      IFGE HEX20
     C           BYTE      ANDLEHEX3F
     C*
     C*  ---->  TESTING NONDISPLAY
     C*
     C                     TESTB'567'     BYTE           81
     C           *IN81     IFEQ '0'
     C*
     C*  ---->  TESTING HIGH INTENSITY
     C*
     C                     TESTB'6'       BYTE           82
     C*
     C*  ---->  TESTING UNDERLINE
     C*
     C                     TESTB'5'       BYTE           83
     C                     END
     C                     MOVE *BLANK    LIG,J
     C                     END
     C                     END
     C*
     C*  ---->  OUTPUT FOR HIGH INTENSITY
     C*
     C           *IN72     IFEQ '1'
     C           1         DO   3         J
     C                     EXCPTLIGHI
     C                     END
     C                     END
     C*
     C*  ---->  OUTPUT FOR UNDERLINE
     C*
     C           *IN73     IFEQ '1'
     C                     EXCPTLIGUL
     C                     END
     C*
     C*  ---->  OUTPUT FOR LINE
     C*
     C                     EXCPTDETAIL
     C                     END
     C******************************************************
     C                     MOVE '1'       *INLR
     O******************************************************
     OQSYSPRT E 01             DETAIL
     O                         LIG       80
     O        E 00             LIGHI
     O                         HI        80
     O        E 00             LIGUL
     O                         UL        80
     O******************************************************
**
OVRDSPF SCREEN1 SCREEN2 LVLCHK(*NO)
