000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          TTRACE.
000400 AUTHOR.              C HILLES.
000500 DATE-WRITTEN.        1/20/89.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.     TRACE ANALYZE PROGRAM.
001000*
001100*    THIS PROGRAM IS A TOOL TO HELP IN THE TESTING PROCESS.
001200*    THE OUTPUT OF THE PROGRAM IS A SOURCE FILE COMPILE LISTING
001300*    THAT SHOWS EACH EXECUTABLE STATMENT AND HOW MANY TIMES
001400*    IT WAS EXECUTED.
      *
      * STATEMENTS TO CREATE THE INPUT FILES FOR TRACE AND PROGRAM
      * COMPILE LISTINGS:
      *  CRTPF FILE(QTEMP/TRCIN) RCDLEN(132)
      *  CPYSPLF FILE(QPDBGDSP) TOFILE(QTEMP/TRCIN)
      *  CPYSPLF FILE(TIRWSOK) JOB(T881S28/TIRWSOK) TOFILE(QTEMP/PGMIN)
      *
009400 ENVIRONMENT DIVISION.
009500 CONFIGURATION SECTION.
009600 SOURCE-COMPUTER.  HP-3000.
009700 OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT TRACE-FILE
                  ASSIGN TO DATABASE-TRCIN
                  ORGANIZATION IS SEQUENTIAL
                    ACCESS MODE IS SEQUENTIAL
                  FILE STATUS IS FILE-STATUS.

           SELECT PGM-IN-FILE
                  ASSIGN TO DATABASE-PGMIN
                  ORGANIZATION IS SEQUENTIAL
                    ACCESS MODE IS SEQUENTIAL
                  FILE STATUS IS FILE-STATUS.

           SELECT PRINT-FILE ASSIGN TO PRINTER-QPRINT.

010200 DATA DIVISION.
010300 FILE SECTION.
010400
       FD  TRACE-FILE
           LABEL RECORDS ARE STANDARD.
       01  TRACE-REC.
           05  FIL              PIC X(1).
           05  TF-PGM-NAME      PIC X(10).
           05  FIL              PIC X(7).
           05  TF-STMT          PIC X(5).
           05  FIL              PIC X(109).

       FD  PGM-IN-FILE
           LABEL RECORDS ARE STANDARD.
       01  PGM-IN-REC.
           05  FILLER           PIC X(1).
           05  STMT-IN.
               10  STMT-IN-1    PIC X(1).
               10  STMT-IN-2    PIC X(1).
               10  STMT-IN-3    PIC X(1).
               10  STMT-IN-4    PIC X(1).
               10  STMT-IN-5    PIC X(1).
           05  FILLER           PIC X(2).
           05  SEQNBR-IN.
               10  SEQ-NBR-1    PIC X(1).
               10  SEQ-NBR-2-5  PIC X(4).
               10  SEQ-NBR-9 REDEFINES SEQ-NBR-2-5 PIC 9(4).
               10  SEQ-NBR-6    PIC X(1).
           05  COMMENT-CHECK    PIC X(1).
           05  PROCEDURE-CHECK  PIC X(18).
           05  END-SOURCE       PIC X(18).
           05  FIL              PIC X(27).
           05  PGM-NAME-IN      PIC X(10).
           05  FILLER           PIC X(44).

       FD  PRINT-FILE
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 132 CHARACTERS
           DATA RECORD IS PRINT-REC.
       01  PRINT-REC            PIC X(132).

011200 WORKING-STORAGE SECTION.
011300
       01  SUB                          PIC 9(3) VALUE 0.
       01  FIND-PGM-NAME                PIC X(10).

       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

       01  NUM-PROGRAMS           PIC 9(2).
       01  NUM-STMT-TABLE.
           05  NUM-STMT OCCURS 30 TIMES PIC 9(5).

       01  ZERO-AREA              PIC X(30000) VALUE ALL "0".
       01  TRACE-TABLE REDEFINES ZERO-AREA.
           05  TRACE-PGM-LINE OCCURS 5 TIMES.
               10  TRACE-STMT-LINE OCCURS 2000 TIMES.
                   15  TRACE-STMT PIC 9(3).

       01  SPACE-AREA             PIC X(300).
       01  PGM-TABLE REDEFINES SPACE-AREA.
           05  PGM-LINE OCCURS 30 TIMES.
               10  PGM-NAME       PIC X(10).

       01  CUR-PGM                PIC 9(2).
       01  CUR-STMT-X             PIC X(5).
       01  CUR-STMT REDEFINES CUR-STMT-X PIC 9(5).

       01  STMT-COUNT-WORK.
           05  FIL                PIC X(1)  VALUE "(".
           05  STMT-COUNT         PIC 9(4).
           05  FIL                PIC X(1)  VALUE ")".

       01  RS-RET-CODE            PIC X(2).
       01  RS-SHIFT-FLD.
           05  FILLER             PIC X(3).
           05  RS-SHIFT-FLD-4-8   PIC X(5).

032400 PROCEDURE DIVISION.
033000
033100 1-HSK.
           MOVE 0 TO NUM-PROGRAMS.
           MOVE SPACES TO SPACE-AREA.
           OPEN INPUT TRACE-FILE.
           PERFORM 6100-COUNT-UP-STATEMENTS THRU 6190-CUS-X.
           CLOSE TRACE-FILE.
           OPEN INPUT PGM-IN-FILE.
           OPEN OUTPUT PRINT-FILE.
           MOVE 1 TO CUR-PGM.
           PERFORM 6200-PRINT-LISTING THRU 6290-PL-X.
           CLOSE PGM-IN-FILE.
           CLOSE PRINT-FILE.
           GOBACK.

       6100-COUNT-UP-STATEMENTS.
           READ TRACE-FILE AT END
               DISPLAY "ERROR: NO TRACE STATEMENTS FOUND"
               GO TO 6190-CUS-X.
           IF TF-PGM-NAME = "Program"
               NEXT SENTENCE
           ELSE
               GO TO 6100-COUNT-UP-STATEMENTS.

       6110-READ-TRACE-LOOP.
           READ TRACE-FILE AT END
               GO TO 6190-CUS-X.

           IF TF-PGM-NAME = "5728SS1 R0" OR SPACES
               GO TO 6110-READ-TRACE-LOOP.

           MOVE TF-STMT TO RS-SHIFT-FLD.
           CALL "TRSHIFT" USING RS-RET-CODE, RS-SHIFT-FLD.
           MOVE RS-SHIFT-FLD-4-8 TO TF-STMT.

           IF TF-STMT NOT NUMERIC
               GO TO 6110-READ-TRACE-LOOP.
           IF TF-STMT = "00000"
               GO TO 6110-READ-TRACE-LOOP.

           MOVE TF-STMT TO CUR-STMT.

           MOVE TF-PGM-NAME TO FIND-PGM-NAME.
           PERFORM 7100-FIND-PGM THRU 7190-FP-X.

           IF CUR-PGM < 1 OR CUR-PGM > 5
             OR CUR-STMT < 1 OR CUR-STMT > 2000
               DISPLAY "ERROR, CUR-PGM = ", CUR-PGM
               DISPLAY "CUR-STMT = ", CUR-STMT
               DISPLAY "TRACE-REC = ", TRACE-REC
               DISPLAY "RS-SHIFT-FLD = ", RS-SHIFT-FLD
               DISPLAY "TF-PGM-NAME = ", TF-PGM-NAME
               STOP RUN.

           ADD 1 TO TRACE-STMT (CUR-PGM, CUR-STMT).
           GO TO 6110-READ-TRACE-LOOP.

       6190-CUS-X.
           EXIT.

       6200-PRINT-LISTING.
       6210-FIND-PROCEDURE-LOOP.
           READ PGM-IN-FILE AT END
               GO TO 6290-PL-X.

           IF PROCEDURE-CHECK = "PROCEDURE DIVISION"
               NEXT SENTENCE
           ELSE
               GO TO 6210-FIND-PROCEDURE-LOOP.

       6220-READ-LISTING-LOOP.
           READ PGM-IN-FILE AT END
               GO TO 6290-PL-X.

           IF STMT-IN = "5728C" AND SEQNBR-IN = " R01 M"
               MOVE PGM-NAME-IN TO FIND-PGM-NAME
               PERFORM 7100-FIND-PGM THRU 7190-FP-X
               GO TO 6220-READ-LISTING-LOOP.

           IF END-SOURCE = " * *  E N D  O F  "
               GO TO 6290-PL-X.

           IF COMMENT-CHECK = "*"
               GO TO 6220-READ-LISTING-LOOP.

           MOVE STMT-IN TO RS-SHIFT-FLD.
           CALL "TRSHIFT" USING RS-RET-CODE, RS-SHIFT-FLD.
           MOVE RS-SHIFT-FLD-4-8 TO STMT-IN.
           IF STMT-IN NOT NUMERIC
               GO TO 6285-PRINT-SOURCE-LINE.
           IF STMT-IN = "00000"
               MOVE SPACES TO STMT-IN, SEQNBR-IN
               GO TO 6285-PRINT-SOURCE-LINE.
           MOVE STMT-IN TO CUR-STMT.
           IF TRACE-STMT (CUR-PGM, CUR-STMT) = 0
               MOVE "******" TO SEQNBR-IN
           ELSE
               MOVE TRACE-STMT (CUR-PGM, CUR-STMT) TO STMT-COUNT
               MOVE STMT-COUNT-WORK TO SEQNBR-IN.

       6285-PRINT-SOURCE-LINE.
           MOVE PGM-IN-REC TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1.
           GO TO 6220-READ-LISTING-LOOP.

       6290-PL-X.
           EXIT.

       7100-FIND-PGM.
           MOVE 0 TO SUB.
           MOVE 5 TO CUR-PGM.
       7110-FIND-PGM-LOOP.
           ADD 1 TO SUB.
           IF SUB > 5 OR PGM-NAME (SUB) = SPACES
               ADD 1 TO NUM-PROGRAMS
               IF NUM-PROGRAMS > 5
                   MOVE 5 TO CUR-PGM
                   DISPLAY "ERROR: MORE THAN 5 PROGRAMS IN TRACE"
                   GO TO 7190-FP-X
               ELSE
                   MOVE NUM-PROGRAMS TO CUR-PGM
                   MOVE FIND-PGM-NAME TO PGM-NAME (NUM-PROGRAMS)
                   GO TO 7190-FP-X.

           IF PGM-NAME (SUB) = FIND-PGM-NAME
               MOVE SUB TO CUR-PGM
               GO TO 7190-FP-X.

           GO TO 7110-FIND-PGM-LOOP.

       7190-FP-X.
           EXIT.
