       IDENTIFICATION DIVISION.
       PROGRAM-ID.    SADDPITM.
       AUTHOR.        KURT MOVSESIAN/JIM COFFMAN (MAINTAINER).
      ***************************************************************
      *                                                             *
      *   S A D D P I T M                                           *
      *                                                             *
      *   THIS SUB PROGRAM ADDS ITEMS TO A PURCHASE ORDER           *
      *                                                             *
      ***************************************************************
      *C   AUG. 94   JE COFFMAN  REQ #6527
      *C   ADDED CALL TO SCHATREF IF THE USER OPTION SWITCH IS
      *C   SET REQUIRING THAT CHAT NUMBERS BE INCLUDED ON CSIS
      *C   DOCUMENTS CONTAINING CORPORATE CODED ITEMS.
      *C
      *C   FEB. 95    CA ZUBEK   **NOTE**
      *C   COPIED THE LOGIC WHICH ADDS THE TAX AMOUNT TO THE PO
      *C   BUDGETED AMOUNT FROM THIS PROGRAM TO "SRELEASE."  IF THE
      *C   LOGIC IS CHANGED IN THIS PROGRAM, YOU MAY HAVE TO MAKE
      *C   THE SAME CHANGE IN THE PROGRAM "SRELEASE," SINCE IT
      *C   CONTAINS THE SAME LOGIC.
      *C   ** NOTE:  THIS TAX LOGIC WAS REMOVED FROM THIS PROGRAM
      *C   AND REPLACED WITH A CALL TO PROGRAM "SCALCBGT" TO
      *C   CALCULATE THE BUDGET AMOUNT.
      *C
      *C   04/29/96  CA YODER        REQ #96-023
      *C     ADDED TWO CHECKS AT THE REQUEST OF JIM FISHEL IN UNC TO
      *C     NOT ALLOW AN INVOICELESS PO TO BE CREATED IF THE PO IS
      *C     A MEMO Z-BILL OR A NON-RECEIVABLE PO.
      *C
      *C   07/18/96  CA YODER
      *C     MODIFIED FOR CENTURY DATABASE CHANGES.
      *C
      *C   10/31/96  JEFF BUNGO
      *C     ADD RECEIVING SLIP STANDARD INSTRUCTIONS.
      *C
      *C   11/20/96  JEFF BUNGO
      *C     ALLOW THE FLAGING OF THIS ITEM TO BE QS9000 TRACKING.
      *C     IF QS9000 TRACKING THEN DISPLAY THE TRACKING SCREEN.
      *C
      *C   12/16/96  CA YODER    REQ #96-040
      *C     THIS REQUEST WAS TO ADD LOGIC TO ALLOW THE USER TO
      *C     MODIFY COMPANY AND PRIME FIELDS.  HOWEVER, LOGIC WAS
      *C     ALREADY IN PLACE FOR THIS BY TURNING ON A SWITCH IN
      *C     PLANT STARTUP.  THE ONLY PROBLEM, THOUGH, WAS THAT
      *C     CLASS WAS BEING VALIDATED IN MVALIDPLTDATA INSTEAD OF
      *C     MCLASS.  MODIFIED THE EDIT CHECK TO USE MCLASS INSTEAD.
      *C
      *C   05/14/97  CA YODER
      *C     ADDED LOGIC TO ACCOUNT FOR FRANCHISE VENDORS/ITEMS.
      *C       1.  ITEMS ON FRANCHISE VENDOR POS CANNOT BE BOTH DIRECT
      *C           DELIVERY AND STOREROOM ITEMS.  THE FIRST ITEM SETS
      *C           THE STANDARD FOR THE REST OF THE ITEMS.
      *C       2.  IF THE ITEMS ARE STOREROOM ITEMS AND THE VENDOR IS A
      *C           FRANCHISE VENDOR, THE PO IS MARKED AS NON-PAYABLE.
      *C
      *C   07/21/97  CA YODER
      *C     ADDED A CHECK FOR NON-NUMERIC DATA IN THE
      *C     VEN-DISCOUNT-PERCENT FIELD.
      *C
      *C   13FEB1998 WL MCINTYRE  REQ# 98-002
      *C     ADD LOGIC TO CHECK FOR TAX CODE ON DREQITM, AND IF
      *C     ENTERED, USE IT AS DEFAULT FOR TAX CODE ON PO ITEM.
      *C
      *C   03/19/1998  CA YODER
      *C     MODIFIED LOGIC FOR FRANCHISED ITEMS.
      *C       - ALL ITEMS ON A PO MUST BE EITHER ALL CONSIGNED OR ALL
      *C             NON-CONSIGNED.
      *C       - IF ALL ITEMS ARE CONSIGNED, THEN IT IS NON-PAYABLE.
      *C       - IF A PO IS NON-PAYABLE, THEN ALL ITEMS MUST BE
      *C             STOREROOM ITEMS.
      *C       - IF A PO IS NOT NON-PAYABLE (NON-CONSIGNED), THEN
      *C             DIRECT DELIVERY AND STOREROOM ITEMS CAN BE ON
      *C             THE SAME PO.
      *C
      *C   04/02/1998  CA YODER
      *C     ADDED LOGIC TO ALLOW A CONSIGNED ITEM TO BE FOR A
      *C     NON-STOREROOM DEPARTMENT IF IT'S A "000" PO.  OTHERWISE,
      *C     CONSIGNED ITEMS MUST BE ON A REQUIREMENT ORDER.
      *C
      *C   04/08/1998  CA YODER
      *C     ADDED LOGIC TO ALLOW A CONSIGNED ITEM TO BE FOR THE
      *C     STOREROOM DEPARTMENT ON A Z-BILL PO.
      *C
      *C   04/14/1998  CA YODER
      *C     ADDED LOGIC TO ALLOW A CONSIGNED ITEM TO BE FOR THE
      *C     STOREROOM DEPARTMENT ON A REGULAR "000" PO.
      *C
      *C   05/27/98  CA YODER
      *C     ADDED CALL TO "SCALCBGT" TO CALCULATE THE CORRECT
      *C     BUDGET AMOUNT FOR THE PO.  REMOVED LOGIC THAT USED
      *C     TO DO THE CALCULATION IN THIS PROGRAM.
      *C
      *C   10/05/98  CA YODER
      *C     ADDED LOGIC FOR VALLEYFIELD TO OBTAIN THE DEPARTMENT
      *C     AND EXPENSE CLASS FROM MSTORERM INSTEAD OF FROM THE
      *C     LAST PO.
      *C
      *C   06/07/99   CA YODER   (DECATUR REQUEST)
      *C     RE-COMPILED TO PICK UP MTAX DATABASE CHANGE TO
      *C     EXPAND TAX RATE PERCENTAGE FROM 2 DECIMAL PLACES TO 4.
      *C
      *C   09/08/99  CA YODER    NAPANEE REQUEST
      *C     MOVE MSTORERM MARKET COST TO UNIT VALUE FIELD FOR
      *C     REPAIR PURCHASE ORDER ITEMS.
      *C
      *C   03/01/00  CA YODER    NAPANEE REQUEST    (D. STUBBS)
      *C     REMOVE LOGIC TO UPDATE MARKET COST ON REPAIR ORDERS.
      *C
      *C   03/27/00  CA YODER    NAPANEE REQUEST
      *C     DISPLAY WARNING MESSAGE WHEN EXPENSE CLASS ON PO ITEM
      *C     (FROM MSTORERM) DIFFERS FROM EXPENSE CLASS ON REQUISITION.
      *C
      *C   06/12/02  CA YODER    LAWTON REQUEST
      *C     DISPLAY WARNING MESSAGE WHEN PO ITEM AMOUNT EXCEEDS REQ
      *C     BUDGET AMOUNT BY PERCENTAGE SPECIFIED IN MPLTINFO
      *C     (NON-CODED M-REQS ONLY).
      *C

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT TAXGST-FILE        ASSIGN TO DISK-TAXGST
                                     FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO-PK-I
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZPURORD-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

           SELECT DPOITEM-I
                  ASSIGN TO DATABASE-MCFLCS1002
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPOITEM-L1
                  ASSIGN TO DATABASE-MCFLCS1001
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT MCLASS-I
                  ASSIGN TO DATABASE-MCFLCS4901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MVALIDUM-I
                  ASSIGN TO DATABASE-MCFLCS0401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MVALIDPLTDATA-I
                  ASSIGN TO DATABASE-MCFLCS1701
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MCOMMENT-I
                  ASSIGN TO DATABASE-MCFLCS1801
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-I
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MTAX-I
                  ASSIGN TO DATABASE-MCFLCS3701
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MREQ-I
                  ASSIGN TO DATABASE-MCFLCS2001
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.


           SELECT DREQD-I
                  ASSIGN TO DATABASE-MCFLCS2101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DREQDESC-I
                  ASSIGN TO DATABASE-MCFLCS2301
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DREQITM-I
                  ASSIGN TO DATABASE-MCFLCS2201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DVENDITM-I
                  ASSIGN TO DATABASE-MCFLCS0802
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DVENDOR-I
                  ASSIGN TO DATABASE-MCFLCS0701
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPOITEM-O
                  ASSIGN TO DATABASE-MCFLCS1002
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPODATAITM-O
                  ASSIGN TO DATABASE-MCFLCS1101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DDAILYTC-O
                  ASSIGN TO DATABASE-MCFLCS1601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  TAXGST-FILE
           RECORD CONTAINS 80 CHARACTERS.
       01  TAXGST-RECORD             PIC X(80).

       FD  MCLASS-I
           LABEL RECORDS ARE STANDARD.
       01  MCLASS-REC-I.
           COPY DDS-MCRPCS4900  OF MCFLCS4901.

       FD  MPLTINFO-PK-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-PK-REC-I.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                  PIC X(2000).
      *    COPY DD-PURORD2-O OF ZPURORD.

       FD  DPOITEM-I
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS1002.

       FD  DPOITEM-L1
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-REC-L1.
           COPY DDS-ALL-FORMATS  OF MCFLCS1001.

       FD  MVALIDUM-I
           LABEL RECORDS ARE STANDARD.
       01  MVALIDUM-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0401.

       FD  MVALIDPLTDATA-I
           LABEL RECORDS ARE STANDARD.
       01  MVALIDPLTDATA-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS1701.

       FD  MCOMMENT-I
           LABEL RECORDS ARE STANDARD.
       01  MCOMMENT-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS1801.

       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0201.

       FD  MTAX-I
           LABEL RECORDS ARE STANDARD.
       01  MTAX-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS3701.

       FD  MREQ-I
           LABEL RECORDS ARE STANDARD.
       01  MREQ-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS2001.

       FD  DREQD-I
           LABEL RECORDS ARE STANDARD.
       01  DREQD-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS2101.

       FD  DREQDESC-I
           LABEL RECORDS ARE STANDARD.
       01  DREQDESC-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS2301.

       FD  DREQITM-I
           LABEL RECORDS ARE STANDARD.
       01  DREQITM-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS2201.

       FD  DVENDITM-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0802.

       FD  DVENDOR-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0701.

       FD  DPOITEM-O
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLCS1002.

       FD  DPODATAITM-O
           LABEL RECORDS ARE STANDARD.
       01  DPODATAITM-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLCS1101.

       FD  DDAILYTC-O
           LABEL RECORDS ARE STANDARD.
       01  DDAILYTC-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLCS1601.

       WORKING-STORAGE SECTION.
       77  CODE-DUP-SW                  PIC X.
       77  SAVE-CHAT-SW                 PIC X.
       77  SAVE-PACD-SW                 PIC X.
       77  SAVE-PCPO-SW                 PIC X.
       77  TRAK-FUNCTION                PIC X.
       77  SAVE-STOREROOM-DEPT          PIC X(4).
       77  EXP-ERR-SW                   PIC X.
       77  REQ-COMPARE-PERCENT-SW       PIC X  VALUE "N".
       77  REQ-COMPARE-PERCENT          PIC S9V99   VALUE 0.
       77  K-PO-ITEM-EXT                PIC S9(11)V9(2).

       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

       01  SAVE-CONSIGN-PO-TYPE          PIC X.
           88  CONSIGNED-PO                    VALUE "C".
           88  NON-CONSIGNED-PO                VALUE "N".


      **********************
      *                    *
      *  S W I T C H E S   *
      *                    *
      **********************

       01  SWITCH-AREA.
           05  FATAL-ERR-SW            PIC X       VALUE "N".
           05  ERR-SW                  PIC X       VALUE SPACES.
           05  CONT-SW                 PIC X       VALUE SPACES.
           05  END-OF-REQ-DESC-SW      PIC X       VALUE SPACES.
           05  TC370-CUT-SW            PIC X       VALUE SPACES.
               88  TC370-CUT                       VALUE "Y".
               88  TC370-NOT-CUT                   VALUE "N".
           05  MASTER-STOCK-EDIT-SW    PIC X       VALUE SPACES.
           05  HANDLE-BLOWUP-FLAG      PIC X       VALUE "Y".

       01  GST-TAX-SW                  PIC X(1).
           88  DONT-TAX-ON-GST                       VALUE "1".
           88  TAX-ON-GST                            VALUE "2".

       01  ZBILL-PO-SW                 PIC X         VALUE SPACE.
           88  ZBILL-PO                              VALUE "1".

       01  SAVE-MANUFACT-LIT     PIC X(26)           VALUE SPACES.
       01  SAVE-ITEM-VALUE-LIT   PIC X(11)           VALUE SPACES.
       01  COUNTERS BINARY.
           05  BUDGET-AMT-SAVED      PIC S9(11)      VALUE ZERO.
           05  READ-CTR              PIC S9(4)       VALUE ZERO.
           05  TOTAL-MTAX-PERCENT    PIC S9(4)V9(5)  VALUE ZERO.
           05  ITEM-EXTENSION-SAVED  PIC S9(11)V9(4) VALUE ZERO.
           05  ITEM-TAX              PIC S9(11)      VALUE ZERO.
           05  GST-TAX               PIC S9(11)V9(4) VALUE ZERO.
           05  GST-ENTRY             PIC S9          VALUE ZERO.
           05  DISCOUNT-PERCENT      PIC 9V9(6)      VALUE ZERO.
           05  DISCOUNT-PRICE        PIC S9(11)V9(4) VALUE ZERO.
           05  SAVE-PRICE-COMPARE    PIC S9(11)V9(4) VALUE ZERO.
           05  SAVE-PRICE-CHG        PIC S9(11)V9(4) VALUE ZERO.
           05  SAVE-PERCENT-CHG      PIC S9(2)V9(2)  VALUE ZERO.
           05  SAVE-ITEM-PRICE       PIC S9(11)V9(4) VALUE ZERO.
           05  SAVE-QTY              PIC 9(8)V9(4)   VALUE ZERO.

       01  SUB-AREA  COMP-4.
           05  SUB                   PIC S99         VALUE ZEROS.
           05  DESC-SUB              PIC S9(4) COMP-4 VALUE ZEROS.

       01  WORK-AREA.
           05  SEQ-NO-SAVE.
               10  SEQ-ITEM-NO-SAVE        PIC 9(4)  VALUE ZEROS.
               10  LINE-NO-SAVE            PIC 99    VALUE ZEROS.

       COPY TDATECHK IN COPYLIB.

       01  DATES-AND-TIMES.
           05  HP-CUR-DATE.
               10  MM               PIC XX.
               10  FILLER           PIC X.
               10  DD               PIC XX.
               10  FILLER           PIC X.
               10  YY               PIC XX.
           05  CUR-DATE-CN.
               10  CUR-DATE-CC      PIC XX.
               10  CUR-DATE.
                   15  YY.
                       20  FILLER   PIC X.
                       20  YR-YR    PIC X.
                   15  MM           PIC XX.
                   15  DD           PIC XX.


       01  WORK-AREA-KEYS.
           05  BUILD-VALID-DEPT-KEY.
               10  DEPT-PREFIX            PIC XX   VALUE "DP".
               10  DEPT-NUM               PIC X(8) VALUE SPACES.

           05  BUILD-EXPENSE-CLASS.
               10  FILLER                 PIC X(2) VALUE "EC".
               10  EXPENSE-CLASS          PIC X(6) VALUE SPACES.

           05  BUILD-NEW-WORK.
               10  FILLER                 PIC X(2) VALUE "NW".
               10  NEW-WORK               PIC X(6) VALUE SPACES.

           05  BUILD-COMMENT-NO.
               10  BUILD-COM-PREFIX       PIC X     VALUE "C".
               10  BUILD-COM-NO           PIC X(3)  VALUE SPACES.


       01  MESSAGE-BUFFER.
           05  MSG-TEXT              PIC X(66)    VALUE SPACE.
           05  MSG-FLD               PIC X(10)    VALUE SPACE.
           05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC Z(9)9.

       01  FIELD-NUMBER              PIC S9(4)    VALUE 1  COMP-4.

       01  WHICH-LABELS              PIC S9(4)    VALUE 1  COMP-4.

       01  LABEL-NUMBER              PIC S9(4)    VALUE 1  COMP-4.

       01  PASS-CORP-CODE            PIC X(7)     VALUE SPACES.

       01  PREV-KEY-LABEL            PIC X(79)    VALUE SPACES.

       01  RETURN-CHAT-NO            PIC X(6)     VALUE SPACES.

       01  END-ITEMS-KEY-LABEL       PIC X(79)    VALUE SPACES.

       COPY CATREAD IN COPYLIB.

       COPY DISPDATA IN COPYLIB.

       COPY IOFEEDBACK IN COPYLIB.

      **************************************************************
      **************************************************************
      **                                                          **
      **             TERMINAL I/O DATA AREA                       **
      **                                                          **
      **************************************************************
      **************************************************************

       01  SCREEN-2.
           05  DE2-COMPANY-CODE            PIC X(3).
           05  DE2-EDIPOLIT                PIC X(6).
           05  DE2-PO                      PIC X(7).
           05  DE2-PO-REL                  PIC X(3).
           05  DE2-ITEM-NO                 PIC X(4).
           05  DE2-REQ-NO                  PIC X(12).
           05  DE2-CODE                    PIC X(7).
           05  DE2-PRICE                   PIC 9(11)V9(4).
           05  DE2-PRICE-UM                PIC XX.
           05  DS2-CODE                    PIC X(7).
           05  DS2-CHAT-NO                 PIC X(6).
           05  DE2-QTY                     PIC 9(8)V9(4).
           05  DE2-QTY-UM                  PIC XX.
           05  DE2-SUB-DETL                PIC X(4).
           05  DE2-SUB                     PIC X(3).
           05  DE2-ADDTDATA                PIC X(6).
           05  DE2-CURRENCY-LIT            PIC X(26).
           05  DE2-DISCOUNT-AREA           PIC X(48).
           05  DE2-ITEM-VALUE-LIT          PIC X(11).
           05  DE2-ITEM-VALUE              PIC 9(11).
           05  DE2-TAX-CODE                PIC X(2).
           05  DE2-SECOND-LANG-INDIC       PIC X.
           05  DE2-INVOICELESS-LIT         PIC X(14).
           05  DE2-INVOICELESS-IND         PIC X.
           05  DE2-MASTER-STOCK            PIC X(7).
           05  DE2-QS9000-TRACKING         PIC X(1).
           05  DE2-MANUFACTUR-LIT          PIC X(26).
           05  DE2-STD-INST-TABLE.
               10  DE2-STD-INST  OCCURS 4 TIMES  PIC X(3).
           05  DE2-RCV-INST-TABLE.
               10  DE2-RCV-INST  OCCURS 4 TIMES  PIC X(3).
           05  DE2-MANUFACTUR-SELECT       PIC X(26).
           05  DE2-DESC-LIT                PIC X(22).
           05  DE2-MORE-DESC-MSG           PIC X(55).
           05  DE2-DESC-AREA.
               10  DE2-DESC OCCURS 7 TIMES.
                   15  DE2-DESC-FIRST-45   PIC X(45).
                   15  DE2-DESC-LAST       PIC X(34).
               10  DE2-ADDL-DESC-MSG       PIC X(60).
               10  DE2-CONT-SW             PIC X.
           05  DE2-INSTRUCTIONLINE         PIC X(60).
           05  DE2-COMMAND-LINE            PIC X(79).
           05  DE2-MESSAGE-LINE            PIC X(79).

       01  SCREEN-2L.
           05  DE2-COMPANY-CODE-L          PIC X(3).
           05  DE2-EDIPOLIT-L              PIC X(6).
           05  DE2-PO-L                    PIC X(7).
           05  DE2-PO-REL-L                PIC X(3).
           05  DE2-ITEM-NO-L               PIC X(4).
           05  DE2-REQ-NO-L                PIC X(12).
           05  DE2-CODE-L                  PIC X(7).
           05  DE2-PRICE-L                 PIC 9(11)V9(4).
           05  DE2-PRICE-UM-L              PIC XX.
           05  DS2-CODE-L                  PIC X(7).
           05  DE2-QTY-L                   PIC 9(8)V9(4).
           05  DE2-QTY-UM-L                PIC XX.
           05  DE2-COMPANY-L               PIC XXX.
           05  DE2-PRIME-L                 PIC XXX.
           05  DE2-SUB-L                   PIC X(3).
           05  DE2-SUB-L-9 REDEFINES DE2-SUB-L
                                           PIC 9(3).
           05  DE2-SUB-DETL-L              PIC X(4).
           05  DE2-ADDTDATA-L              PIC X(6).
           05  DE2-CURRENCY-LIT-L          PIC X(26).
           05  DE2-DISCOUNT-AREA-L         PIC X(48).
           05  DE2-ITEM-VALUE-LIT-L        PIC X(11).
           05  DE2-ITEM-VALUE-L            PIC 9(11).
           05  DE2-TAX-CODE-L              PIC X(2).
           05  DE2-SECOND-LANG-INDIC-L     PIC X.
           05  DE2-INVOICELESS-LIT-L       PIC X(14).
           05  DE2-INVOICELESS-IND-L       PIC X.
           05  DE2-MASTER-STOCK-L          PIC X(7).
           05  DE2-QS9000-TRACKING-L       PIC X(1).
           05  DE2-MANUFACTUR-LIT-L        PIC X(26).
           05  DE2-STD-INST-TABLE-L.
               10  DE2-STD-INST-L  OCCURS 4 TIMES  PIC X(3).
           05  DE2-RCV-INST-TABLE-L.
               10  DE2-RCV-INST-L  OCCURS 4 TIMES  PIC X(3).
           05  DE2-MANUFACTUR-SELECT-L     PIC X(26).
           05  DE2-DESC-LIT-L              PIC X(22).
           05  DE2-MORE-DESC-MSG-L         PIC X(55).
           05  DE2-DESC-AREA-L.
               10  DE2-DESC-L OCCURS 7 TIMES.
                   15  DE2-DESC-FIRST-45-L PIC X(45).
                   15  DE2-DESC-LAST-L     PIC X(34).
               10  DE2-ADDL-DESC-MSG-L     PIC X(60).
               10  DE2-CONT-SW-L           PIC X.
           05  DE2-INSTRUCTIONLINE-L       PIC X(60).
           05  DE2-COMMAND-LINE-L          PIC X(79).
           05  DE2-MESSAGE-LINE-L          PIC X(79).

       01  BUILD-CC-LIT.
           05  CURRENCY-LIT             PIC X(10).
           05  FILLER                   PIC X.
           05  CUR-CODE                 PIC X(2).
           05  FILLER                   PIC X.
           05  CUR-CODE-DESC            PIC X(12).

       01  DISCOUNT-PRICE-DIS-LIT.
           05  DIS-PRICE-LIT            PIC X(18) VALUE SPACES.
           05  FILLER                   PIC X(3)  VALUE " ->".
           05  DIS-PRE-PRICE            PIC Z(10)9.9(4) VALUE ZEROS.
           05  FILLER                   PIC X(3)  VALUE " @ ".
           05  DIS-DISCOUNT-PERCENT     PIC Z9.9(2) VALUE ZEROS.
           05  FILLER                   PIC X(1)  VALUE "%".

       01  DESC-COMMENT-LIT             PIC X(22).

       01  ADDL-DESC-MSG-LIT            PIC X(60).

      **************************************************************
      **************************************************************
      **                                                          **
      **                DATABASE I/O BUFFER AREA                  **
      **                                                          **
      **************************************************************
      **************************************************************

       COPY MPLTINFO IN COPYLIB.
       COPY MSTORERM IN COPYLIB.
       COPY DPODATA IN COPYLIB.
       COPY DPOITEM IN COPYLIB.
       COPY DVENDITM IN COPYLIB.
       COPY DDAILYTC IN COPYLIB.
       COPY TC370 IN COPYLIB.
       COPY MVALIDUM IN COPYLIB.
       COPY MVALDPLT IN COPYLIB.
       COPY MCOMMENT IN COPYLIB.
       COPY DREQD IN COPYLIB.
       COPY MREQ IN COPYLIB.
       COPY DREQITM IN COPYLIB.
       COPY DREQDESC IN COPYLIB.
       COPY MTAX IN COPYLIB.
       COPY DPORECD IN COPYLIB.
       COPY DVENDOR IN COPYLIB.
       COPY DBSTAT  IN COPYLIB.

      *********************
      *                   *
      *   DATA SET NAMES  *
      *                   *
      *********************

       01  DSET-NAMES.
           05  DSET-NAME              PIC X(16)  VALUE SPACES.
           05  DSET-MSTORERM          PIC X(16)  VALUE "MSTORERM;".
           05  DSET-MREQ              PIC X(16)  VALUE "MREQ;".
           05  DSET-DREQD             PIC X(16)  VALUE "DREQD;".
           05  DSET-DREQITM           PIC X(16)  VALUE "DREQITM;".
           05  DSET-DREQDESC          PIC X(16)  VALUE "DREQDESC;".
           05  DSET-DVENDITM          PIC X(16)  VALUE "DVENDITM;".
           05  DSET-DPOITEM           PIC X(16)  VALUE "DPOITEM;".
           05  DSET-DVENDOR           PIC X(16)  VALUE "DVENDOR;".
           05  DSET-MCOMMENT          PIC X(16)  VALUE "MCOMMENT;".
           05  DSET-DDAILYTC          PIC X(16)  VALUE "DDAILYTC;".
           05  DSET-MVALIDUM          PIC X(16)  VALUE "MVALIDUM;".
           05  DSET-DPODATAITM        PIC X(16)  VALUE "DPODATAITM;".
           05  DSET-MTAX              PIC X(16)  VALUE "MTAX;".
           05  DSET-MVALIDPLTDATA  PIC X(16) VALUE "MVALIDPLTDATA;".
           05  DSET-MPLTINFO          PIC X(16)  VALUE "MPLTINFO;".
           05  DSET-MCLASS            PIC X(16)  VALUE "MCLASS;".

       01 ITEMS-LISTING.
           05  ALL-ITEMS              PIC XX    VALUE "@;".
           05  CODE-SEARCH            PIC X(10) VALUE "CORP-CODE;".
           05  REQ-SEARCH             PIC X(12) VALUE "REQ-NUMBER;".
           05  PO-SEARCH              PIC X(10) VALUE "PO-RCV-NO;".
           05  VEN-SEARCH             PIC X(10) VALUE "VEN-CODE;".

       01 ARG-VALUES.
           05  CODE-ARG               PIC X(8)  VALUE SPACES.
           05  REQ-ARG                PIC X(12) VALUE SPACES.
           05  MVALIDPLT-ARG.
               10  MVALIDPLT-ARG-1-2  PIC X(2)  VALUE SPACES.
               10  MVALIDPLT-ARG-3-10.
                   15  MVALIDPLT-ARG-3-8  PIC X(6) VALUE SPACES.
                   15  FILLER             PIC XX   VALUE SPACES.
           05  PO-ARG                 PIC X(14) VALUE SPACES.
           05  COMMENT-ARG            PIC X(4)  VALUE SPACES.
           05  UM-ARG                 PIC X(2)  VALUE SPACES.
           05  TAX-ARG                PIC X(2)  VALUE SPACES.
           05  PLT-ARG                PIC X(4)  VALUE SPACES.

      *****************************************
      *   PARAMETERS FOR CALLING SEDIPOLG
      *****************************************

       01  SEDIPOLG-PARMS.
           05  PO-NUMBER-EDI      PIC X(14) VALUE SPACES.
           05  VENDOR-CODE-EDI    PIC X(10) VALUE SPACES.
           05  FLAGS-EDI.
               10  FLAG-EDI-A     PIC X     VALUE SPACE.
               10  FLAG-EDI-M     PIC X     VALUE SPACE.
               10  FLAG-EDI-D     PIC X     VALUE SPACE.
               10  FLAG-EDI-SEND  PIC X     VALUE SPACE.
               10  FILLER         PIC XX    VALUE SPACES.
           05  PO-ITEM-NO-EDI     PIC X(4)  VALUE SPACES.
           05  CALLING-PGM-EDI    PIC X(8)  VALUE SPACES.

      *****************************************
      *   PARAMETERS FOR CALLING 'SEDIVNCK'
      *   WHICH IS THE ROUTINE TO DETERMINE
      *   IF VENDOR IS EDI OR NOT
      *****************************************

       COPY SEDIVNCK IN COPYLIB.

      ************************************
      *
      *  PARAMETERS FOR CALLING
      *  TREQLINK.SOURCE
      *
      ***********************************

       COPY SREQLINK IN COPYLIB.

      ************************************
      *
      *  PARAMETERS FOR CALLING
      *  SPOCDESC.SOURCE
      *
      ***********************************

       01  PO-DESC-PARMS.
           05  PODESC-COMPANY-SAVE       PIC X(3)   VALUE SPACES.
           05  SAVE-MANUFACTUR-DESC      PIC X(26)  VALUE SPACES.

      ************************************
      *
      *  PARAMETERS FOR CALLING
      *  CDESC.SOURCE
      *
      ************************************

       COPY CDESC IN COPYLIB.

      ************************************
      *
      *  PARAMETERS FOR CALLING
      *  SPOMSTRM.SOURCE
      *
      ************************************

       COPY SPOMSTRM IN COPYLIB.

      ************************************
      *
      *  PARAMETERS FOR CALLING
      *  STC320.SOURCE
      *
      ************************************

       COPY STC320 IN COPYLIB.

      ************************************
      *
      *  PARAMETERS FOR CALLING
      *  SCURCONV.SOURCE
      *
      ************************************

       COPY SCURCONV IN COPYLIB.

      ************************************
      *
      *  PARAMETERS FOR CALLING
      *  SVENPRC.SOURCE
      *
      ************************************

       COPY SVENPRC IN COPYLIB.

       COPY SCALCBGT IN COPYLIB.

       01  RET-CODE                     PIC X(2)   VALUE SPACES.

      *************************************************************
      **                                                         **
      **          E R R O R   M E S S A G E   A R E A S          **
      **                                                         **
      *************************************************************

       COPY TBLOWUP IN COPYLIB.



       LINKAGE SECTION.

       01  BASE             PIC X(10).

       01  BASE-MMISA       PIC X(24).

       01  BUILD-PO-SEARCH.
           05  PO-PREFIX           PIC X.
           05  PO-NO-REL.
               10  PO-NO           PIC X(7).
               10  PO-REL          PIC X(3).
           05  PO-RCV              PIC X(3).

       01  VEN-ARG          PIC X(10).

       COPY VCOMLINK IN COPYLIB.

      ***********************************
      **  PARAMETERS FOR 'SADDPITM'
      ***********************************

       COPY SADDPITM IN COPYLIB.

      **************************************
      *                                    *
      *  PRINTCNTL IS SET TO 1 THIS CAUSES *
      *  THE FIELD ON A SCREEN PRINTOUT    *
      *  TO BE UNDERLINED                  *
      *                                    *
      *  PAGECNTL IS SET TO 49 (OCTAL 61)  *
      *  THIS CAUSE THE LP TO EJECT AFTER  *
      *  THE SCREEN IS PRINTED             *
      *                                    *
      **************************************

       01  SCREEN-PRINT-PARMS.
           05  PRINTCNTL             PIC S9(4)    COMP-4.
           05  PAGECNTL              PIC S9(4)    COMP-4.
           05  SPOOLFIL-OPEN-SW      PIC X.

       01  PASSED-SPOOL-PRT          PIC S9(2)    COMP-4.

       COPY LANGSUB IN COPYLIB.

       PROCEDURE DIVISION USING  BASE,
                                 BASE-MMISA,
                                 BUILD-PO-SEARCH,
                                 VEN-ARG,
                                 VIEW-COMAREA,
                                 ADD-ITEM-PARMS,
                                 SCREEN-PRINT-PARMS,
                                 PASSED-SPOOL-PRT,
                                 LANGUAGE-PARMS.


       ADD-ITEM SECTION 02.

       BEGIN-HERE.
           OPEN INPUT DPOITEM-I, MVALIDUM-I, MVALIDPLTDATA-I,
                      MCOMMENT-I, MSTORERM-I, MTAX-I, MREQ-I,
                      DREQD-I, DREQDESC-I, DREQITM-I, DVENDITM-I,
                      DVENDOR-I, MPLTINFO-PK-I, MCLASS-I DPOITEM-L1.
           OPEN I-O DISPLAY-FILE, DPOITEM-O, DPODATAITM-O, DDAILYTC-O.

           PERFORM 1-INIT.
           PERFORM 6-MAIN THRU 6-M-X.

           CLOSE DPOITEM-I, MVALIDUM-I, MVALIDPLTDATA-I, MCOMMENT-I,
                 MSTORERM-I, MTAX-I, MREQ-I, DREQD-I, DREQDESC-I,
                 DREQITM-I, DVENDITM-I, DVENDOR-I, DPOITEM-O,
                 DPODATAITM-O, DDAILYTC-O, DISPLAY-FILE, MPLTINFO-PK-I,
                 MCLASS-I, DPOITEM-L1.

           GOBACK.

       1-INIT.

      *
      * FIND THE ENTRY THAT CONTAINS THE GST INFORMATION
      *
           MOVE "Y" TO HANDLE-BLOWUP-FLAG.
           MOVE 0 TO GST-ENTRY.
           MOVE "PTX1" TO PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-I.
           IF NOT GOOD-CALL
             MOVE "GETKEY MPLTINFO 1-INIT" TO BU-DISPLAY-MSG
             MOVE PLT-ARG TO BU-DISPLAY-FLD(1)
             PERFORM 2100-BLOWUP
           END-IF.
           PERFORM VARYING SUB FROM 1 BY 1
                   UNTIL GST-ENTRY > 0 OR
                         SUB > 2

             IF MPLTINFO-TAX-DISTRICT(SUB) = "GST"
               MOVE SUB TO GST-ENTRY
             END-IF

           END-PERFORM.

           IF GST-ENTRY EQUAL ZERO

             MOVE "PTX2" TO PLT-ARG
             PERFORM 9999-GETKEY-MPLTINFO-PK-I
             IF NOT GOOD-CALL
               MOVE "GETKEY MPLTINFO 1-INIT" TO BU-DISPLAY-MSG
               MOVE PLT-ARG TO BU-DISPLAY-FLD(1)
               PERFORM 2100-BLOWUP
             END-IF
             PERFORM VARYING SUB FROM 1 BY 1
                     UNTIL GST-ENTRY > 0 OR
                           SUB > 2

               IF MPLTINFO-TAX-DISTRICT(SUB) = "GST"
                 COMPUTE GST-ENTRY = SUB + 2
               END-IF

             END-PERFORM

           END-IF.

      *
      * CHECK FOR EXISTENCE OF TAXGST FILE
      *  IF IT EXISTS THIS MEANS TO APPLY TAXES OTHER THAN GST
      *  ON BASE + GST ( DOUBLE TAXATION )
      *
           OPEN INPUT TAXGST-FILE.
           IF FILE-STATUS NOT EQUAL ZERO
             SET DONT-TAX-ON-GST TO TRUE
           ELSE
             SET TAX-ON-GST TO TRUE
           END-IF.
           CLOSE TAXGST-FILE.

           MOVE "PACD" TO PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-I.
           IF NOT GOOD-CALL
               MOVE "N"                TO  SAVE-PACD-SW
           ELSE
           MOVE MPLTINFO-PACD-SW       TO  SAVE-PACD-SW.

           MOVE "PREQ" TO PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-I.
           IF NOT GOOD-CALL
               MOVE "N"                TO  REQ-COMPARE-PERCENT-SW
               MOVE 0                  TO  REQ-COMPARE-PERCENT
           ELSE
           IF MPLTINFO-RQ-COMPARE-PRICE-SW = "Y"
               MOVE MPLTINFO-RQ-COMPARE-PRICE-SW
                                       TO  REQ-COMPARE-PERCENT-SW
               MOVE MPLTINFO-RQ-COMPARE-PERCENT
                                       TO  REQ-COMPARE-PERCENT.

           MOVE "PCPO" TO PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-I.
           IF NOT GOOD-CALL
               MOVE "N"                TO  SAVE-PCPO-SW
           ELSE
           MOVE MPLTINFO-PCPO-SW       TO  SAVE-PCPO-SW.

           MOVE "CHAT" TO PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-I.
           IF NOT GOOD-CALL
               MOVE "N"                TO  SAVE-CHAT-SW
           ELSE
           MOVE MPLTINFO-CHAT-PURCH-REQUIRED TO  SAVE-CHAT-SW.

      ********************************************************
      *    RETRIEVE DSTR KEY TO DETERMINE THE STOREROOM      *
      *    DEPARTMENT.                                       *
      ********************************************************
           MOVE "DSTR" TO PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-I.
           IF NOT GOOD-CALL
               MOVE "GETKEY MPLTINFO ERR" TO BU-DISPLAY-MSG
               MOVE PLT-ARG               TO BU-DISPLAY-FLD (1)
               GO TO 2100-BLOWUP
           ELSE
               MOVE MPLTINFO-DEPT-STR (1) TO SAVE-STOREROOM-DEPT.

           MOVE SPACE                  TO  SAVE-CONSIGN-PO-TYPE.

      *-------- IF SPOMOD CALLED THIS PROGRAM, NONPAY-PO-SW WILL
      *-------- CONTAIN A VALUE SO THAT THIS PROGRAM CAN DETERMINE
      *-------- IF THIS IS A CONSIGNED OR NON-CONSIGNED PO.
           IF FRANCHISE-VEND-SW = "Y"
               IF NONPAY-PO-SW = "Y"
                   MOVE "C"            TO  SAVE-CONSIGN-PO-TYPE
               ELSE
                   MOVE "N"            TO  SAVE-CONSIGN-PO-TYPE.

      ******************************************************
      **                                                  **
      **   BLOWUP ROUTINE                                 **
      **                                                  **
      ******************************************************

       2100-BLOWUP.
           IF FILE-STATUS NUMERIC
               MOVE FILE-STATUS TO COND-WORD.
           MOVE "SADDPITM"  TO  BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                   BU-DISPLAY-FLDS.




       4-PGM-ERROR.
           MOVE B"1" TO IND(FIELD-NUMBER), IND(99).

       4-PGM-ERROR-X.
           EXIT.


       6-MAIN.
           MOVE BUILD-PO-SEARCH       TO  PO-ARG,
                                          BU-DISPLAY-FLD (1).
           PERFORM 61-FIND-LAST-ITEM  THRU  61-FLI-X.

           PERFORM 62-PROCESS-ITEM-DATA  THRU  62-PID-X.

       6-M-X.
           EXIT.


      ********************************************
      *
      *   FIND THE LAST ITEM ON THE PO IF THIS
      *   IS A NEW PO THEN THE PO-TYPE WILL BE
      *   SPACES
      *
      ********************************************

       61-FIND-LAST-ITEM.
           MOVE ZEROS                 TO  ITEM-NO-SAVE.
           MOVE SPACES                TO  SUB-SAVE,
                                          SUBD-SAVE,
                                          ADDTL-DATA-SAVE,
                                          SAVE-TAX-CODE
                                          REQ-SUBD-SAVE.

           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPOITEM-REC-I.
           START DPOITEM-I KEY = PORCVNO OF DPOITEM-REC-I
               INVALID KEY GO TO 61-FLI-X.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 61-FLI-X
               ELSE
                   MOVE 99 TO COND-WORD.
      *    CALL "DBFIND" USING BASE, DSET-DPOITEM, MODE1,
      *           STATUS-AREA, PO-SEARCH, PO-ARG.
           IF COND-WORD NOT = 0
               MOVE "FIND DPOITEM * 61-FLI" TO BU-DISPLAY-MSG
               GO TO 2100-BLOWUP.

       61-GET-DPOITEM.
           MOVE 0 TO COND-WORD.
           READ DPOITEM-I NEXT INTO BUF-DPOITEM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPOITEM-REC-I NOT = PO-ARG
               MOVE 15 TO COND-WORD.
      *    CALL "DBGET" USING BASE, DSET-DPOITEM, MODE5,
      *        STATUS-AREA, ALL-ITEMS, BUF-DPOITEM, PO-ARG.
           IF COND-WORD NOT = 0
               IF COND-WORD = 15
                   GO TO 61-FLI-X
               ELSE
                   MOVE "GET DPOITEM * 61-GD" TO BU-DISPLAY-MSG
                   GO TO 2100-BLOWUP
           ELSE
               MOVE ITM-NUMBER        TO  ITEM-NO-SAVE
               MOVE ITM-CLASS         TO  SUB-SAVE
               MOVE ITM-SUB-DETL      TO  SUBD-SAVE
               MOVE ITM-ADDL-DATA     TO  ADDTL-DATA-SAVE
               MOVE ITM-TAX-CODE      TO  SAVE-TAX-CODE
               GO TO 61-GET-DPOITEM.

       61-FLI-X.
           EXIT.


      *****************************************************
      *                                                   *
      *   PROCESS PO ITEM INFORMATION SECTION             *
      *                                                   *
      *****************************************************


       62-PROCESS-ITEM-DATA.
      *    MOVE CURRENT-DATE       TO  HP-CUR-DATE.
      *    MOVE CORR HP-CUR-DATE   TO  CUR-DATE.
           ACCEPT CUR-DATE FROM DATE.
      *-------- ACCOUNT FOR CENTURY.
           IF YY OF CUR-DATE > "70"
               MOVE "19"           TO  CUR-DATE-CC
           ELSE
               MOVE "20"           TO  CUR-DATE-CC.
           MOVE ZERO               TO  TOTAL-PO-BUDGET.
           MOVE ZBILL-INDICATOR    TO  ZBILL-PO-SW.
      **  MANUFACTURER SELECTION
           MOVE  13                TO  LANG-SETNUM.
           MOVE  36                TO  LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER     TO  SAVE-MANUFACT-LIT.
      **  DESCRIPTION/COMMENTS
           MOVE  4                 TO  LANG-SETNUM.
           MOVE  16                TO  LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER     TO  DESC-COMMENT-LIT.
      **  UNIT VALUE
           MOVE  21                TO  LANG-SETNUM.
           MOVE  6                 TO  LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER     TO  SAVE-ITEM-VALUE-LIT.
      **  'F1'-PREVIOUS SCREEN 'F3'-END ITEMS
           MOVE  16                TO  LANG-SETNUM.
           MOVE  114               TO  LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER     TO  PREV-KEY-LABEL.
      **  'F3'-END ITEMS
           MOVE  66                TO  LANG-SETNUM.
           MOVE  050               TO  LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER     TO  END-ITEMS-KEY-LABEL.
      **  IF ADDITIONAL DESCRIPTION LINES ARE NEEDED ENTER AN 'X' HERE
           MOVE  9                 TO  LANG-SETNUM.
           MOVE  38                TO  LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER     TO  ADDL-DESC-MSG-LIT.
      **  CURRENCY
           MOVE  3                 TO  LANG-SETNUM.
           MOVE  140               TO  LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE SPACES             TO  BUILD-CC-LIT.
           MOVE MESSAGE-BUFFER     TO  CURRENCY-LIT.
           IF ADD-ITEM-CUR-CODE = SPACES
               NEXT SENTENCE
           ELSE
               MOVE ADD-ITEM-CUR-CODE   TO  UM-ARG
               MOVE UM-ARG TO VALIDUM OF MVALIDUM-REC-I
               READ MVALIDUM-I INTO BUF-MVALIDUM
               IF FILE-STATUS-1 = "2"
                   NEXT SENTENCE
               ELSE
               IF FILE-STATUS NOT = "00"
                   MOVE "GET MVALIDUM *62-PID" TO BU-DISPLAY-MSG
                   MOVE UM-ARG TO BU-DISPLAY-FLD (1)
                   GO TO 2100-BLOWUP
               ELSE
                   MOVE VALID-CURRENCY-DESC  TO  CUR-CODE-DESC
                   MOVE ADD-ITEM-CUR-CODE    TO  CUR-CODE.

       62-READ-PO-ITEMS.
           MOVE "PURORD2"  TO  VIEW-NFNAME.

      ********************************************************
      **   IF THIS IS THE FIRST ITEM OF AN ORDER
      **   (ITEM-NO=0) THEN GO AND GET THE VENDOR ADDRESS
      **   AND DISPLAY IN DESCRIPTION BLOCK FOR VERIFICATION
      **   PURPOSES FOR THE USER
      ********************************************************

           MOVE SPACES                  TO  SCREEN-2
                                            SCREEN-2L.
           IF ITEM-NO-SAVE = ZERO
               PERFORM 67-GET-VENDOR-ADDRESS  THRU  67-GVA-X.

           MOVE ADD-ITEM-COMPANY-SAVE   TO  DE2-COMPANY-CODE
                                            DE2-COMPANY-CODE-L.
           IF ADD-EDI-PO = "Y"
               MOVE "EDI PO"            TO  DE2-EDIPOLIT
                                            DE2-EDIPOLIT-L.
           MOVE PO-NO                   TO  DE2-PO
                                            DE2-PO-L.
           MOVE PO-REL                  TO  DE2-PO-REL
                                            DE2-PO-REL-L.
           ADD 1                        TO  ITEM-NO-SAVE.
           MOVE ITEM-NO-SAVE            TO  DE2-ITEM-NO,
                                            DE2-ITEM-NO-L,
                                            SEQ-ITEM-NO-SAVE.
           MOVE ZEROS                   TO  SAVE-ITEM-PRICE.
           MOVE ZEROS                   TO  DE2-PRICE, DE2-PRICE-L,
                                            DE2-QTY, DE2-QTY-L,
                                            DE2-ITEM-VALUE,
                                            DE2-ITEM-VALUE-L.
      *    "ENTER REQUISITION NUMBER OR CORP-CODE AND PRESS 'ENTER'"
           MOVE   5 TO LANG-SETNUM.
           MOVE  19 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO DE2-INSTRUCTIONLINE
                                           DE2-INSTRUCTIONLINE-L.

           IF CUR-CODE-DESC = SPACES
               NEXT SENTENCE
           ELSE
               MOVE BUILD-CC-LIT        TO  DE2-CURRENCY-LIT
                                            DE2-CURRENCY-LIT-L.

           MOVE ADD-INVOICELESS-IND     TO  DE2-INVOICELESS-IND
                                            DE2-INVOICELESS-IND-L.
           IF DE2-INVOICELESS-IND = "X"
               MOVE "INVOICELESS PO"    TO  DE2-INVOICELESS-LIT
                                            DE2-INVOICELESS-LIT-L
           ELSE
           MOVE "              "        TO  DE2-INVOICELESS-LIT
                                            DE2-INVOICELESS-LIT-L.

           IF ITEM-NO-SAVE = 1
               MOVE PREV-KEY-LABEL      TO DE2-COMMAND-LINE
                                           DE2-COMMAND-LINE-L
           ELSE
               MOVE END-ITEMS-KEY-LABEL TO DE2-COMMAND-LINE
                                           DE2-COMMAND-LINE-L.

           MOVE SPACES  TO  CONT-SW,
                            END-OF-REQ-DESC-SW.
           MOVE ZEROS   TO  SUB.

           MOVE "N"     TO  EXP-ERR-SW.

       62-READ-SCREEN-2.
           MOVE SCREEN-2 TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC TO SCREEN-2.

           IF SAVE-PCPO-SW = "Y"
               MOVE DE2-REQ-NO    TO DE2-REQ-NO-L
               MOVE DE2-CODE      TO DE2-CODE-L.

           IF VIEW-LASTKEY = 3
               IF ITEM-NO-SAVE = 1
      **        YOU MUST ENTER AT LEAST ONE ITEM FOR THIS ORDER
                   MOVE 25    TO  LANG-SETNUM
                   MOVE 22    TO  LANG-MSGNUM
                   PERFORM 999-CATREAD  THRU  999-CATREAD-EXIT
               ELSE
                   GO TO 62-PID-X
           ELSE
           IF VIEW-LASTKEY = 1
               IF ITEM-NO-SAVE = 1
                   GO TO 62-PID-X
               ELSE
      *            "INVALID FUNCTION KEY ENTERED"
                   MOVE   9 TO LANG-SETNUM
                   MOVE  10 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                          DE2-MESSAGE-LINE-L
                   MOVE 12 TO  FIELD-NUMBER
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   GO TO 62-READ-SCREEN-2
           ELSE
           IF VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *        "INVALID FUNCTION KEY ENTERED"
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                      DE2-MESSAGE-LINE-L
               MOVE 12 TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 62-READ-SCREEN-2.

      **********************************************************
      *    THERE ARE 999 ITEMS ON THE P.O. AND BY LETTER FROM  *
      *    DICK CRITCHFIELD DATED  6/4/93 THIS IS THE MAX      *
      **********************************************************
           IF ITEM-NO-SAVE = 1000
               MOVE 20070 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER  TO DE2-MESSAGE-LINE
                                       DE2-MESSAGE-LINE-L
               MOVE 12    TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 62-READ-SCREEN-2.

       62-FIELD-EDITS.
           IF DE2-REQ-NO = SPACES AND
              DE2-CODE = SPACES
      *        ENTER EITHER A REQUISITION OR CORP-CODE
               MOVE  45041 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                      DE2-MESSAGE-LINE-L
               MOVE 12 TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 62-READ-SCREEN-2.

           IF DE2-REQ-NO NOT = SPACES AND
              DE2-CODE NOT = SPACES
      *        ENTER ONLY ONE VALUE - REQUISITION OR CORP-CODE
               MOVE  45045 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                      DE2-MESSAGE-LINE-L
               MOVE 12 TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 62-READ-SCREEN-2.

           IF DE2-CODE = "NON-STR"
      *        INVALID CODE, ENTER VALID OR CODE OR 'NC' FOR NON-CODED
               MOVE  45053 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                      DE2-MESSAGE-LINE-L
               MOVE 31 TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 62-READ-SCREEN-2.

           IF DE2-REQ-NO NOT = SPACES
               PERFORM 66-PROCESS-REQ-NO  THRU  66-PRN-X
               IF CODE-DUP-SW = "Y"
      *M       "CODE ON REQUISITION ALREADY EXISTS ON REQMT. ORDER"
                   MOVE   3 TO LANG-SETNUM
                   MOVE 623 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                          DE2-MESSAGE-LINE-L
                   MOVE 12 TO FIELD-NUMBER
                   PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
                   GO TO 62-READ-SCREEN-2
               ELSE
               IF ERR-SW = "Y"
                   GO TO 62-READ-SCREEN-2
               ELSE
                   NEXT SENTENCE
           ELSE
               PERFORM 66-PROCESS-CODE-NO  THRU  66-PCN-X
               IF CODE-DUP-SW = "Y"
      *    "CODE ALREADY EXISTS ON THIS REQMT. ORDER - TRY AGAIN"
                   MOVE   3 TO LANG-SETNUM
                   MOVE 622 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                          DE2-MESSAGE-LINE-L
                   MOVE 31 TO FIELD-NUMBER
                   PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
                   GO TO 62-READ-SCREEN-2
               ELSE
               IF ERR-SW = "Y"
                   GO TO 62-READ-SCREEN-2.

      ***********************************************************
      **   IF THE PLANT IS NOT USING INVOICE PROCESSING AND NO
      **   TAX CODE HAS BEEN LOADED FOR THE SCREEN THEN USE
      **   'NO' AS THE DEFAULT.  THIS IS BASICALLY FOR THE
      **   INTERNATIONAL PLANTS
      ***********************************************************

           IF DE2-TAX-CODE = SPACES
               IF ADD-INVOICING
                   NEXT SENTENCE
               ELSE
                   MOVE "NO"            TO DE2-TAX-CODE
                                           DE2-TAX-CODE-L.

           MOVE SPACES TO RETURN-CHAT-NO.
           IF SAVE-CHAT-SW = "Y"
               IF DS2-CODE = "NC"
                   NEXT SENTENCE
               ELSE
               MOVE DS2-CODE       TO  PASS-CORP-CODE
               CALL "SCHATREF" USING PASS-CORP-CODE,
                                     RETURN-CHAT-NO,
                                     VIEW-COMAREA
               IF RETURN-CHAT-NO = "NOTFND"
                   MOVE SPACES     TO  DS2-CHAT-NO
               ELSE
               MOVE RETURN-CHAT-NO TO  DS2-CHAT-NO.

           IF SAVE-PCPO-SW = "Y"
               IF DE2-REQ-NO-L = SPACES
                   IF SAVE-PACD-SW = "N"
                       MOVE SPACES TO DE2-COMPANY-L, DE2-PRIME-L,
                                      DE2-SUB, DE2-SUB-L,
                                      DE2-SUB-DETL, DE2-SUB-DETL-L,
                                      DE2-ADDTDATA, DE2-ADDTDATA-L.

       62-GETNEXTFORM-2A.
           IF ZBILL-PO
               IF SAVE-PCPO-SW = "Y"
                   IF ADD-INVOICELESS-IND = "X"
                       MOVE "PURORD2CLI" TO  VIEW-NFNAME
                       MOVE SAVE-ITEM-VALUE-LIT TO DE2-ITEM-VALUE-LIT
                                                   DE2-ITEM-VALUE-LIT-L
                   ELSE
                   MOVE "PURORD2CL"      TO  VIEW-NFNAME
                   MOVE SAVE-ITEM-VALUE-LIT TO DE2-ITEM-VALUE-LIT
                                               DE2-ITEM-VALUE-LIT-L
               ELSE
               IF ADD-INVOICELESS-IND = "X"
                   MOVE "PURORD2CI"      TO  VIEW-NFNAME
                   MOVE SAVE-ITEM-VALUE-LIT TO DE2-ITEM-VALUE-LIT
                                               DE2-ITEM-VALUE-LIT-L
               ELSE
      *        IF SAVE-CHAT-SW = "Y"
      *            MOVE "PURORD2CC"      TO  VIEW-NFNAME
      *            MOVE SAVE-ITEM-VALUE-LIT TO DE2-ITEM-VALUE-LIT
      *                                        DE2-ITEM-VALUE-LIT-L
      *        ELSE
               MOVE "PURORD2C"           TO  VIEW-NFNAME
               MOVE SAVE-ITEM-VALUE-LIT  TO  DE2-ITEM-VALUE-LIT
                                             DE2-ITEM-VALUE-LIT-L
           ELSE
           IF SAVE-PCPO-SW = "Y"
               IF ADD-INVOICELESS-IND = "X"
                   MOVE "PURORD2ALI"    TO  VIEW-NFNAME
               ELSE
               MOVE "PURORD2AL"         TO  VIEW-NFNAME
           ELSE
           IF ADD-INVOICELESS-IND = "X"
               MOVE "PURORD2AI"         TO  VIEW-NFNAME
           ELSE
      *    IF SAVE-CHAT-SW = "Y"
      *        MOVE "PURORD2AC"         TO  VIEW-NFNAME
      *    ELSE
           MOVE "PURORD2A"              TO  VIEW-NFNAME.

      *    "ENTER ITEM INFORMATION AND PRESS 'ENTER'"
           MOVE   5 TO LANG-SETNUM.
           MOVE  24 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO DE2-INSTRUCTIONLINE
                                  DE2-INSTRUCTIONLINE-L.
           MOVE DESC-COMMENT-LIT        TO  DE2-DESC-LIT
                                            DE2-DESC-LIT-L.
           MOVE ADDL-DESC-MSG-LIT       TO  DE2-ADDL-DESC-MSG
                                            DE2-ADDL-DESC-MSG-L.

       62-READ-SCREEN-2A.
           PERFORM 620-PUT-BUFFER.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           PERFORM 620-GET-BUFFER.

           IF CONT-SW = "Y"
               MOVE 13             TO  FIELD-NUMBER
           ELSE
               MOVE 39             TO  FIELD-NUMBER.

           IF CONT-SW = "Y"
               IF VIEW-LASTKEY = 1 OR 2 OR 3
                   MOVE 5  TO  VIEW-LASTKEY.
           IF VIEW-LASTKEY = 1
               SUBTRACT 1  FROM  ITEM-NO-SAVE
               GO TO 62-READ-PO-ITEMS
           ELSE
           IF VIEW-LASTKEY = 2
               IF DS2-CODE = "NC"
                   MOVE 5     TO  VIEW-LASTKEY
               ELSE
                   PERFORM 621-CALL-CODE-DESC  THRU  621-CCD-X
                   GO TO 62-GETNEXTFORM-2A
           ELSE
           IF VIEW-LASTKEY = 8
               IF DS2-CODE = "NC"
                   MOVE 5  TO  VIEW-LASTKEY
               ELSE
                   MOVE "X"               TO  DE2-SECOND-LANG-INDIC
                                              DE2-SECOND-LANG-INDIC-L
                   GO TO 62-READ-SCREEN-2A
           ELSE
           IF VIEW-LASTKEY = 4
               MOVE 13                  TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               MOVE B"0" TO IND(99)
               GO TO 62-READ-SCREEN-2A.

           IF VIEW-LASTKEY = 5 OR 6 OR 7 OR 3
      *        "INVALID FUNCTION KEY ENTERED"
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                      DE2-MESSAGE-LINE-L
               MOVE 39 TO FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 62-READ-SCREEN-2A.


           IF CONT-SW = "Y"
               GO TO 62-UPDATE-ITEM-SEGMENTS.

        62-FIELD-EDITS-2A.
           IF DE2-PRICE-UM = SPACES
      *        YOU MUST ENTER A PRICE UM
               MOVE  45054 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                      DE2-MESSAGE-LINE-L
               MOVE 9 TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 62-READ-SCREEN-2A.

           IF DE2-QTY-UM = SPACES
      *        YOU MUST ENTER A QUANTITY UM
               MOVE  45055 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                      DE2-MESSAGE-LINE-L
               MOVE 6 TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 62-READ-SCREEN-2A.

           IF DE2-SUB-DETL = SPACES
      *        DEPARTMENT IS REQUIRED
               MOVE  45056 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                      DE2-MESSAGE-LINE-L
               MOVE 10 TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 62-READ-SCREEN-2A.

           IF DE2-SUB = SPACES
      *        CLASS IS REQUIRED
               MOVE  45057 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                      DE2-MESSAGE-LINE-L
               MOVE 27 TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 62-READ-SCREEN-2A.

           IF DE2-TAX-CODE = SPACES
      *        YOU MUST ENTER A VALID TAX CODE
               MOVE  45058 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                      DE2-MESSAGE-LINE-L
               MOVE 23 TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 62-READ-SCREEN-2A.

           IF DS2-CODE = "NC"
               IF DE2-SECOND-LANG-INDIC NOT = SPACES
      *           SEC. LANG. OPTION ONLY AVAILABLE FOR CODE POS
                   MOVE  45059 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                          DE2-MESSAGE-LINE-L
                   MOVE 28 TO  FIELD-NUMBER
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   GO TO 62-READ-SCREEN-2A.

           IF ZBILL-PO
               IF DE2-ITEM-VALUE = ZEROS
      *           THIS IS A MEMO ZBILL! YOU MUST ENTER A ITEM VALUE
                   MOVE  45061 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                          DE2-MESSAGE-LINE-L
                   MOVE 24 TO  FIELD-NUMBER
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   GO TO 62-READ-SCREEN-2A.

           IF DS2-CODE = "NC"
             IF DE2-DESC (1) = SPACES
      *        YOU MUST ENTER AT LEAST ONE LINE OF DESCRIPTION
               MOVE  45060 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                      DE2-MESSAGE-LINE-L
               MOVE 13 TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 62-READ-SCREEN-2A.

           MOVE ZERO     TO  LINE-NO-SAVE.

       62-CHECK-PO-QTY.
           IF BLANKET-SW = "Y"
               IF DE2-QTY NOT = ZERO
      *            "QTY. MUST BE ZERO FOR A REQUIREMENT ORDER"
                   MOVE  17 TO LANG-SETNUM
                   MOVE   3 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                          DE2-MESSAGE-LINE-L
                   MOVE 4  TO  FIELD-NUMBER
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   GO TO 62-READ-SCREEN-2A.

           MOVE 0 TO FIELD-NUMBER.
           PERFORM 620-PCPO-EDITS THRU 620-PE-X.
           IF FIELD-NUMBER NOT = 0
               MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                      DE2-MESSAGE-LINE-L
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 62-READ-SCREEN-2A.

       62-EDIT-DEPT.
           MOVE DE2-SUB-DETL          TO  DEPT-NUM.
           MOVE BUILD-VALID-DEPT-KEY  TO MVALIDPLT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE MVALIDPLT-ARG TO VALDTAKEY OF MVALIDPLTDATA-REC-I.
           START MVALIDPLTDATA-I KEY = VALDTAKEY OF MVALIDPLTDATA-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
      *    CALL "DBGET" USING BASE, DSET-MVALIDPLTDATA, MODE7,
      *        STATUS-AREA, ALL-ITEMS, BUF-MVALIDPLTDATA,
      *            MVALIDPLT-ARG.
           IF COND-WORD NOT = 0
               IF COND-WORD = 17
      *            "DEPARTMENT CODE DOES NOT EXIST"
                   MOVE   4 TO LANG-SETNUM
                   MOVE  12 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                          DE2-MESSAGE-LINE-L
                   MOVE 10          TO FIELD-NUMBER
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   GO TO 62-READ-SCREEN-2A
               ELSE
                   MOVE "GET MVALID * 62-GB2"  TO  BU-DISPLAY-MSG
                   MOVE MVALIDPLT-ARG           TO  BU-DISPLAY-FLD (2)
                   GO TO 2100-BLOWUP.

           IF DE2-COMPANY-CODE = "631"
               IF DE2-CODE = "NC"
                   IF DE2-SUB-DETL = "1210"
      *M       "DEPARTMENT ENTERED IS INVALID CHARGE DEPARTMENT"
                       MOVE  4             TO LANG-SETNUM
                       MOVE 54             TO LANG-MSGNUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                              DE2-MESSAGE-LINE-L
                       MOVE 10             TO FIELD-NUMBER
                       PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                       GO TO 62-READ-SCREEN-2A.

      *------- ON CONSIGNED & FRANCHISED PO, CANNOT MIX BOTH STOREROOM
      *------- AND DIRECT DELIVERY ITEMS.  MUST BE STOREROOM.
      *-------
      *------- IF IT'S A "000" PO, A CONSIGNED ITEM IS ALLOWED TO
      *------- HAVE A NON-STOREROOM DEPARTMENT.
      *-------
      *------- IF IT'S A Z-BILL PO, A CONSIGNED ITEM CAN BE FOR
      *------- THE STOREROOM DEPARTMENT.
      *-------
      *------- IF IT'S A "000" PO, A CONSIGNED ITEM CAN BE FOR
      *------- THE STOREROOM DEPARTMENT.

           IF PO-REL > "000"
             IF FRANCHISE-VEND-SW = "Y" AND ITEM-NO-SAVE = 1
               IF STR-CODE-OWNER > " "
                   MOVE "C"                TO SAVE-CONSIGN-PO-TYPE
                   MOVE "Y"                TO NONPAY-PO-SW
               ELSE
                   MOVE "N"                TO SAVE-CONSIGN-PO-TYPE
                   MOVE "N"                TO NONPAY-PO-SW
               END-IF.

           IF PO-REL > "000" AND CONSIGNED-PO
               IF (DE2-SUB-DETL NOT = SAVE-STOREROOM-DEPT)
      *M    "CODE IS CONSIGNED - DEPT MUST BE STOREROOM DEPT"
                   MOVE   3            TO LANG-SETNUM
                   MOVE 638            TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                          DE2-MESSAGE-LINE-L
                   MOVE 10             TO FIELD-NUMBER
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   GO TO 62-READ-SCREEN-2A.

           IF ZBILL-PO AND DE2-CODE NOT = "NC"
             IF STR-CODE-OWNER > " "
               IF (DE2-SUB-DETL NOT = SAVE-STOREROOM-DEPT)
      *M    "CODE IS CONSIGNED - DEPT MUST BE STOREROOM DEPT"
                   MOVE   3            TO LANG-SETNUM
                   MOVE 638            TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                          DE2-MESSAGE-LINE-L
                   MOVE 10             TO FIELD-NUMBER
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   GO TO 62-READ-SCREEN-2A.

      *---------- COMMENTED OUT SO THAT CONSIGNED ITEMS CAN BE
      *---------- FOR THE STOREROOM DEPARTMENT ON A "000" PO.
      **** IF PO-REL = "000" AND NOT ZBILL-PO
      ****   IF STR-CODE-OWNER > " "
      ****     IF (DE2-SUB-DETL = SAVE-STOREROOM-DEPT)
      *M    "CONSIGNED STOREROOM ITEM MUST BE ON A REQUIREMENT ORDER"
      ****         MOVE   3            TO LANG-SETNUM
      ****         MOVE 639            TO LANG-MSGNUM
      ****         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
      ****         MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
      ****                                DE2-MESSAGE-LINE-L
      ****         MOVE 10             TO FIELD-NUMBER
      ****         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
      ****         GO TO 62-READ-SCREEN-2A.

      ***********************************
      *
      *  EDIT ADDITIONAL DATA FOR
      *  EITHER A VALID EXPENSE CLASS OR
      *  NEW WORK NUMBER
      *
      ***********************************

       62-EDIT-ADDTL-DATA.
           IF DE2-COMPANY-CODE = "631" AND DE2-REQ-NO > SPACES
               IF REQ-ADDTL-DATA NOT = DE2-ADDTDATA AND
                      EXP-ERR-SW     = "N"
      * E109: EXPENSE CLASS DIFFERS FROM REQUISITION EXPENSE CLASS {XXXXXX}
                   MOVE  05 TO LANG-SETNUM
                   MOVE 109 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                          DE2-MESSAGE-LINE-L
                   MOVE REQ-ADDTL-DATA TO DE2-MESSAGE-LINE (61:6)
                                          DE2-MESSAGE-LINE-L (61:6)
                   MOVE 11 TO  FIELD-NUMBER
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   MOVE "Y"  TO  EXP-ERR-SW
                   GO TO 62-READ-SCREEN-2A.

           IF DE2-ADDTDATA = SPACES  OR
              ADD-EDIT-ADDTL-DATA-SW = "N"
               GO TO 62-EDIT-UMS.
           MOVE DE2-ADDTDATA          TO  EXPENSE-CLASS.
           IF SAVE-PCPO-SW = "Y"
      *----IF EXP CLASS NOT 000-099 THEN SKIP VALIDATION OF ADDTDATA
               IF DE2-SUB < "000" OR DE2-SUB > "099"
                   GO TO 62-EDIT-UMS.
           MOVE BUILD-EXPENSE-CLASS   TO  MVALIDPLT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE MVALIDPLT-ARG TO VALDTAKEY OF MVALIDPLTDATA-REC-I.
           START MVALIDPLTDATA-I KEY = VALDTAKEY OF MVALIDPLTDATA-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
      *    CALL "DBGET" USING BASE, DSET-MVALIDPLTDATA, MODE7,
      *        STATUS-AREA, ALL-ITEMS, BUF-MVALIDPLTDATA,
      *            MVALIDPLT-ARG.
           IF COND-WORD NOT = 0
               IF COND-WORD = 17
                   NEXT SENTENCE
               ELSE
                   MOVE "GET1 MVALID * 62-EAD"  TO  BU-DISPLAY-MSG
                   MOVE MVALIDPLT-ARG           TO  BU-DISPLAY-FLD (2)
                   GO TO 2100-BLOWUP
           ELSE
               GO TO 62-EDIT-UMS.

           MOVE DE2-ADDTDATA          TO  NEW-WORK.
           MOVE BUILD-NEW-WORK        TO  MVALIDPLT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE MVALIDPLT-ARG TO VALDTAKEY OF MVALIDPLTDATA-REC-I.
           START MVALIDPLTDATA-I KEY = VALDTAKEY OF MVALIDPLTDATA-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
      *    CALL "DBGET" USING BASE, DSET-MVALIDPLTDATA, MODE7,
      *        STATUS-AREA, ALL-ITEMS, BUF-MVALIDPLTDATA,
      *            MVALIDPLT-ARG.
           IF COND-WORD NOT = 0
               IF COND-WORD = 17
      *            "INVALID EXPENSE CLASS OR NEW WORK NUMBER"
                   MOVE   9 TO LANG-SETNUM
                   MOVE  62 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                          DE2-MESSAGE-LINE-L
                   MOVE 11          TO FIELD-NUMBER
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   GO TO 62-READ-SCREEN-2A
               ELSE
                   MOVE "GET2 MVALID * 62-EAD"  TO  BU-DISPLAY-MSG
                   MOVE MVALIDPLT-ARG           TO  BU-DISPLAY-FLD (2)
                   GO TO 2100-BLOWUP.

       62-EDIT-UMS.
      *-------- EDIT INVOICELESS FIRST.
           IF DE2-INVOICELESS-IND = "X"
               IF ZBILL-PO
                   IF ADD-ITEM-COMPANY-SAVE = "129"
      *        "MEMO Z-BILL PO CANNOT BE INVOICELESS"
                       MOVE  13 TO LANG-SETNUM
                       MOVE 066 TO LANG-MSGNUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                              DE2-MESSAGE-LINE-L
                       MOVE 45 TO  FIELD-NUMBER
                       PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                       GO TO 62-READ-SCREEN-2A.

           IF DE2-INVOICELESS-IND = "X"
               IF NON-RECV-SW = "Y"
      *        "NON-RECEIVABLE PO CANNOT BE INVOICELESS"
                   MOVE  14 TO LANG-SETNUM
                   MOVE 128 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                          DE2-MESSAGE-LINE-L
                   MOVE 45 TO  FIELD-NUMBER
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   GO TO 62-READ-SCREEN-2A.

           MOVE DE2-QTY-UM   TO  UM-ARG.
           MOVE 0 TO COND-WORD.
           MOVE UM-ARG TO VALIDUM OF MVALIDUM-REC-I.
           START MVALIDUM-I KEY = VALIDUM OF MVALIDUM-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
      *    CALL "DBGET" USING BASE, DSET-MVALIDUM, MODE7,
      *        STATUS-AREA, ALL-ITEMS, BUF-MVALIDUM, UM-ARG.
           IF COND-WORD NOT = ZERO
      *        "QUANTITY UNIT OF MEASURE IS INVALID"
               MOVE  17 TO LANG-SETNUM
               MOVE  13 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                      DE2-MESSAGE-LINE-L
               MOVE 6  TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 62-READ-SCREEN-2A.
           IF DE2-INVOICELESS-IND = "X"
               IF DE2-QTY-UM = "AS" OR "LT"
      *M       "UNIT OF MEASURE INVALID FOR INVOICELESS PO"
                   MOVE 21 TO LANG-SETNUM
                   MOVE 25 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                          DE2-MESSAGE-LINE-L
                   MOVE 6 TO FIELD-NUMBER
                   PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
                   GO TO 62-READ-SCREEN-2A
               ELSE
               IF DE2-QTY = ZEROES
                   IF BLANKET-SW = "Y"
                       NEXT SENTENCE
                   ELSE
      *M       "QUANTITY MUST BE > 0 FOR INVOICELESS PO"
                   MOVE 17 TO LANG-SETNUM
                   MOVE 18 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                          DE2-MESSAGE-LINE-L
                   MOVE 4 TO FIELD-NUMBER
                   PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
                   GO TO 62-READ-SCREEN-2A.

      **************************************************
      ** THE PRICE UM IS CHECKED AGAINST THE DATABASE **
      **************************************************


           MOVE DE2-PRICE-UM  TO  UM-ARG.
           MOVE 0 TO COND-WORD.
           MOVE UM-ARG TO VALIDUM OF MVALIDUM-REC-I.
           START MVALIDUM-I KEY = VALIDUM OF MVALIDUM-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
      *    CALL "DBGET" USING BASE, DSET-MVALIDUM, MODE7,
      *        STATUS-AREA, ALL-ITEMS, BUF-MVALIDUM, UM-ARG.
           IF COND-WORD NOT = ZERO
      *        "UNIT PRICE UM IS INVALID"
               MOVE  21 TO LANG-SETNUM
               MOVE   8 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                      DE2-MESSAGE-LINE-L
               MOVE 9  TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 62-READ-SCREEN-2A.
           IF DE2-INVOICELESS-IND = "X"
               IF DE2-PRICE-UM = "AS" OR "LT"
      *M       "UNIT OF MEASURE INVALID FOR INVOICELESS PO"
                   MOVE 21 TO LANG-SETNUM
                   MOVE 25 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                          DE2-MESSAGE-LINE-L
                   MOVE 9 TO FIELD-NUMBER
                   PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
                   GO TO 62-READ-SCREEN-2A
               ELSE
               IF DE2-PRICE = ZEROES
      *M   "PRICE MUST BE GREATER THAN 0 FOR INVOICELESS PO
                   MOVE  16 TO LANG-SETNUM
                   MOVE 144 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                          DE2-MESSAGE-LINE-L
                   MOVE 39 TO FIELD-NUMBER
                   PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
                   GO TO 62-READ-SCREEN-2A.

           MOVE DE2-INVOICELESS-IND TO ADD-INVOICELESS-IND.

       62-EDIT-TAX-CODE.
           MOVE DE2-TAX-CODE   TO  TAX-ARG.
           MOVE 23             TO  FIELD-NUMBER.
           MOVE 0 TO COND-WORD.
           MOVE TAX-ARG TO TAXCDE OF MTAX-REC-I.
           READ MTAX-I INTO BUF-MTAX
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF COND-WORD NOT = 0
               IF COND-WORD = 17
      *            "TAX CODE DOES NOT EXIST"
                   MOVE  20 TO LANG-SETNUM
                   MOVE   7 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO MSG-TEXT
                   MOVE TAX-ARG  TO  MSG-FLD
                   MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                          DE2-MESSAGE-LINE-L
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   GO TO 62-READ-SCREEN-2A
               ELSE
                   MOVE "GET MTAX * 66-ETC" TO BU-DISPLAY-MSG
                   MOVE TAX-ARG TO  BU-DISPLAY-FLD (2)
                   GO TO 2100-BLOWUP.

       62-EDIT-COMMENT-NO.
           MOVE "N"      TO  ERR-SW.
           PERFORM 621-EDIT-COMMENTS  THRU  621-EC-X
               VARYING SUB  FROM 1 BY 1
                   UNTIL SUB > 4  OR  ERR-SW = "Y".
           IF ERR-SW = "Y"
               GO TO 62-READ-SCREEN-2A.

       62-EDIT-RCV-COMMENT-NO.
           MOVE "N"      TO  ERR-SW.
           PERFORM 621-EDIT-RCV-COMMENTS  THRU  621-ERC-X
               VARYING SUB  FROM 1 BY 1
                   UNTIL SUB > 4  OR  ERR-SW = "Y".
           IF ERR-SW = "Y"
               GO TO 62-READ-SCREEN-2A.

      ************************************************************
      **   EDIT MASTER STOCK CODE.  IF THE ITEM IS NON-CODED
      **   YOU CANNOT ENTER A MASTER STOCK CODE.  IF THE ITEM
      **   IS CODED EDIT MASTER STOCK TO MAKE SURE IT EXISTS AND
      **   THERE ARE VALID UNIT OF MEASURES.
      ************************************************************

           IF DS2-CODE = "NC"
               IF DE2-MASTER-STOCK = SPACES
                   NEXT SENTENCE
               ELSE
      *            "CANNOT ENTER A MASTER STOCK CODE FOR A NON-CODED ITEM"
                   MOVE  3   TO LANG-SETNUM
                   MOVE  186 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                          DE2-MESSAGE-LINE-L
                   MOVE 44 TO  FIELD-NUMBER
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   GO TO 62-READ-SCREEN-2A
           ELSE
               IF DE2-MASTER-STOCK = SPACES
                   NEXT SENTENCE
               ELSE
                   MOVE DE2-MASTER-STOCK  TO  CODE-ARG
                   MOVE "Y"             TO MASTER-STOCK-EDIT-SW
                   MOVE "N"             TO ERR-SW
                   PERFORM 621-EDIT-CODED-ITEM  THRU  621-ECI-X
                   IF ERR-SW = "Y"
                       GO TO 62-READ-SCREEN-2A.

           MOVE SPACES                  TO MASTER-STOCK-EDIT-SW.
           MOVE DS2-CODE                TO CODE-ARG.
           MOVE "N"                     TO ERR-SW.
           IF DS2-CODE = "NC"
               PERFORM 621-EDIT-NONCODED-ITEM  THRU  621-ENI-X
           ELSE
               PERFORM 621-EDIT-CODED-ITEM  THRU  621-ECI-X.
           IF ERR-SW = "Y"
               GO TO 62-READ-SCREEN-2A.

       62-UPDATE-ITEM-SEGMENTS.
           MOVE DE2-SUB               TO  SUB-SAVE.
           MOVE DE2-SUB-DETL          TO  SUBD-SAVE.
           MOVE DE2-ADDTDATA          TO  ADDTL-DATA-SAVE.
           MOVE DE2-TAX-CODE          TO  SAVE-TAX-CODE.

           PERFORM 621-UPDATE-ITEM-DATA  THRU  621-UID-X.

      *-----QS9000 TRACKING
           IF DE2-QS9000-TRACKING = "X"
               MOVE "A" TO TRAK-FUNCTION
               CALL "SRCVTRAK" USING ITM-PO-RCV-NO
                                     ITM-NUMBER
                                     VEN-ARG
                                     ITM-CORP-CODE
                                     TRAK-FUNCTION
                                     ITM-QTY-ORD.

           IF CONT-SW = "Y"
               GO TO 62-READ-SCREEN-2A
           ELSE
               GO TO 62-READ-PO-ITEMS.

       62-PID-X.
           EXIT.

       620-GET-BUFFER.
           IF VIEW-NFNAME = "PURORD2AL" OR "PURORD2CL"
               OR "PURORD2ALI" OR "PURORD2CLI"
               MOVE SPACES               TO SCREEN-2, SCREEN-2L
               MOVE DISPLAY-REC          TO SCREEN-2L
               MOVE DE2-COMPANY-CODE-L   TO DE2-COMPANY-CODE
               MOVE DE2-EDIPOLIT-L       TO DE2-EDIPOLIT
               MOVE DE2-PO-L             TO DE2-PO
               MOVE DE2-PO-REL-L         TO DE2-PO-REL
               MOVE DE2-ITEM-NO-L        TO DE2-ITEM-NO
               MOVE DE2-REQ-NO-L         TO DE2-REQ-NO
               MOVE DE2-CODE-L           TO DE2-CODE
               MOVE DE2-PRICE-L          TO DE2-PRICE
               MOVE DE2-PRICE-UM-L       TO DE2-PRICE-UM
               MOVE DS2-CODE-L           TO DS2-CODE
               MOVE DE2-QTY-L            TO DE2-QTY
               MOVE DE2-QTY-UM-L         TO DE2-QTY-UM
               MOVE DE2-SUB-DETL-L       TO DE2-SUB-DETL
               MOVE DE2-SUB-L            TO DE2-SUB
               MOVE DE2-ADDTDATA-L       TO DE2-ADDTDATA
               MOVE DE2-CURRENCY-LIT-L   TO DE2-CURRENCY-LIT
               MOVE DE2-DISCOUNT-AREA-L  TO DE2-DISCOUNT-AREA
               MOVE DE2-ITEM-VALUE-LIT-L TO DE2-ITEM-VALUE-LIT
               MOVE DE2-ITEM-VALUE-L     TO DE2-ITEM-VALUE
               MOVE DE2-TAX-CODE-L       TO DE2-TAX-CODE
               MOVE DE2-SECOND-LANG-INDIC-L
                                         TO DE2-SECOND-LANG-INDIC
               MOVE DE2-INVOICELESS-LIT-L
                                         TO DE2-INVOICELESS-LIT
               MOVE DE2-INVOICELESS-IND-L
                                         TO DE2-INVOICELESS-IND
               MOVE DE2-MASTER-STOCK-L   TO DE2-MASTER-STOCK
               MOVE DE2-QS9000-TRACKING-L TO DE2-QS9000-TRACKING
               MOVE DE2-MANUFACTUR-LIT-L TO DE2-MANUFACTUR-LIT
               MOVE DE2-STD-INST-TABLE-L TO DE2-STD-INST-TABLE
               MOVE DE2-RCV-INST-TABLE-L TO DE2-RCV-INST-TABLE
               MOVE DE2-MANUFACTUR-SELECT-L
                                         TO DE2-MANUFACTUR-SELECT
               MOVE DE2-DESC-LIT-L       TO DE2-DESC-LIT
               MOVE DE2-MORE-DESC-MSG-L  TO DE2-MORE-DESC-MSG
               MOVE DE2-DESC-AREA-L      TO DE2-DESC-AREA
               MOVE DE2-INSTRUCTIONLINE-L
                                         TO DE2-INSTRUCTIONLINE
               MOVE DE2-COMMAND-LINE-L   TO DE2-COMMAND-LINE
               MOVE DE2-MESSAGE-LINE-L   TO DE2-MESSAGE-LINE
           ELSE
           MOVE SPACES                   TO SCREEN-2, SCREEN-2L
           MOVE DISPLAY-REC              TO SCREEN-2
           MOVE DE2-COMPANY-CODE         TO DE2-COMPANY-CODE-L
                                            DE2-COMPANY-L
           MOVE DE2-EDIPOLIT             TO DE2-EDIPOLIT-L
           MOVE DE2-PO                   TO DE2-PO-L
           MOVE DE2-PO-REL               TO DE2-PO-REL-L
           MOVE DE2-ITEM-NO              TO DE2-ITEM-NO-L
           MOVE DE2-REQ-NO               TO DE2-REQ-NO-L
           MOVE DE2-CODE                 TO DE2-CODE-L
           MOVE DE2-PRICE                TO DE2-PRICE-L
           MOVE DE2-PRICE-UM             TO DE2-PRICE-UM-L
           MOVE DE2-CODE                 TO DE2-CODE-L
           MOVE DE2-QTY                  TO DE2-QTY-L
           MOVE DE2-QTY-UM               TO DE2-QTY-UM-L
           MOVE DE2-SUB-DETL             TO DE2-SUB-DETL-L
           MOVE DE2-SUB                  TO DE2-SUB-L
           MOVE DE2-ADDTDATA             TO DE2-ADDTDATA-L
           MOVE DE2-CURRENCY-LIT         TO DE2-CURRENCY-LIT-L
           MOVE DE2-DISCOUNT-AREA        TO DE2-DISCOUNT-AREA-L
           MOVE DE2-ITEM-VALUE-LIT       TO DE2-ITEM-VALUE-LIT-L
           MOVE DE2-ITEM-VALUE           TO DE2-ITEM-VALUE-L
           MOVE DE2-TAX-CODE             TO DE2-TAX-CODE-L
           MOVE DE2-SECOND-LANG-INDIC
                                         TO DE2-SECOND-LANG-INDIC-L
           MOVE DE2-INVOICELESS-LIT
                                         TO DE2-INVOICELESS-LIT-L
           MOVE DE2-INVOICELESS-IND
                                         TO DE2-INVOICELESS-IND-L
           MOVE DE2-MASTER-STOCK         TO DE2-MASTER-STOCK-L
           MOVE DE2-QS9000-TRACKING      TO DE2-QS9000-TRACKING-L
           MOVE DE2-MANUFACTUR-LIT       TO DE2-MANUFACTUR-LIT-L
           MOVE DE2-STD-INST-TABLE       TO DE2-STD-INST-TABLE-L
           MOVE DE2-RCV-INST-TABLE       TO DE2-RCV-INST-TABLE-L
           MOVE DE2-MANUFACTUR-SELECT
                                         TO DE2-MANUFACTUR-SELECT-L
           MOVE DE2-DESC-LIT             TO DE2-DESC-LIT-L
           MOVE DE2-MORE-DESC-MSG        TO DE2-MORE-DESC-MSG-L
           MOVE DE2-DESC-AREA            TO DE2-DESC-AREA-L
           MOVE DE2-INSTRUCTIONLINE
                                         TO DE2-INSTRUCTIONLINE-L
           MOVE DE2-COMMAND-LINE         TO DE2-COMMAND-LINE-L
           MOVE DE2-MESSAGE-LINE         TO DE2-MESSAGE-LINE-L.

       620-PUT-BUFFER.
           IF VIEW-NFNAME = "PURORD2AL" OR "PURORD2CL"
               OR "PURORD2ALI" OR "PURORD2CLI"
               MOVE SCREEN-2L         TO DISPLAY-REC
           ELSE
           MOVE SCREEN-2              TO DISPLAY-REC.

       620-PCPO-EDITS.
206000     IF SAVE-PCPO-SW = "N" GO TO 620-PE-X.
206100     IF DE2-COMPANY-L = "   "
206200*M   "COMPANY IS A REQUIRED FIELD"
206300         MOVE  49 TO FIELD-NUMBER
206400         MOVE   3 TO LANG-SETNUM
206500         MOVE 196 TO LANG-MSGNUM
206600         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
206700         GO TO 620-PE-X
206800     ELSE
206900     MOVE "CO" TO MVALIDPLT-ARG-1-2
207000     MOVE DE2-COMPANY-L TO MVALIDPLT-ARG-3-10
           PERFORM 9000-START-MVALIDPLTDATA-I
207800     IF COND-WORD = 17
207900*M   "COMPANY IS INVALID"
208000         MOVE  49 TO FIELD-NUMBER
208100         MOVE   3 TO LANG-SETNUM
208200         MOVE 197 TO LANG-MSGNUM
208300         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
208400         GO TO 620-PE-X.
208500
208600     IF DE2-PRIME-L = "   "
208700*M   "PRIME IS A REQUIRED FIELD"
208800         MOVE  16 TO LANG-SETNUM
208900         MOVE 149 TO LANG-MSGNUM
209000         MOVE  50 TO FIELD-NUMBER
209100         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
209200         GO TO 620-PE-X
209300     ELSE
209400     MOVE "PR" TO MVALIDPLT-ARG-1-2
209500     MOVE DE2-PRIME-L TO MVALIDPLT-ARG-3-10
           PERFORM 9000-START-MVALIDPLTDATA-I
210300     IF COND-WORD = 17
210400*M   "PRIME IS INVALID"
210500         MOVE  50 TO FIELD-NUMBER
210600         MOVE  16 TO LANG-SETNUM
210700         MOVE 150 TO LANG-MSGNUM
210800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
210900         GO TO 620-PE-X.
211000
211100     IF DE2-SUB-L = "   "
211200*M   "CLASS IS A REQUIRED FIELD"
211300         MOVE  27 TO FIELD-NUMBER
211400         MOVE   3 TO LANG-SETNUM
211500         MOVE 198 TO LANG-MSGNUM
211600         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
211700         GO TO 620-PE-X
211800     ELSE
           IF DE2-SUB-L = "CNS"
               IF DS2-CODE NOT = "NC"
                   GO TO 620-PE-X
               ELSE
215900         IF DE2-ADDTDATA-L = "000000" OR "      "
216000             GO TO 620-PE-X
216100         ELSE
216200         MOVE "NW" TO MVALIDPLT-ARG-1-2
216300         MOVE DE2-ADDTDATA-L TO MVALIDPLT-ARG-3-10
               PERFORM 9000-START-MVALIDPLTDATA-I
217100         IF COND-WORD = 0
217200*M       "EXP/NW IS INVALID FOR CLASS"
217300             MOVE  5 TO LANG-SETNUM
217400             MOVE 62 TO LANG-MSGNUM
217500             MOVE 11 TO FIELD-NUMBER
217600             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
217700             GO TO 620-PE-X
217800         ELSE
217900         GO TO 620-PE-X
           ELSE
           IF DS2-CODE = "NC"
      *---------- MODIFIED TO USE MCLASS TO VALIDATE CLASS INSTEAD
      *---------- OF MVALIDPLTDATA.
211900*        MOVE SPACES  TO MVALIDPLT-ARG
212000*        MOVE "EC"    TO MVALIDPLT-ARG-1-2
212100*        MOVE DE2-SUB-L-9 TO MVALIDPLT-ARG-3-8
      *        PERFORM 9000-START-MVALIDPLTDATA-I
               MOVE DE2-SUB-L-9 TO PLT-ARG
               PERFORM 9000-START-MCLASS-I
212900         IF COND-WORD = 17
213000*M       "CLASS ENTERED IS INVALID"
213100             MOVE  27 TO FIELD-NUMBER
213200             MOVE   3 TO LANG-SETNUM
213300             MOVE 199 TO LANG-MSGNUM
213400             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
213500             GO TO 620-PE-X
               ELSE
               NEXT SENTENCE
           ELSE
           GO TO 620-PE-X.
213600
213700     IF DE2-SUB-L NOT < "000" AND DE2-SUB-L NOT > "099"
213800         MOVE "NW" TO MVALIDPLT-ARG-1-2
213900         MOVE DE2-ADDTDATA-L TO MVALIDPLT-ARG-3-10
               PERFORM 9000-START-MVALIDPLTDATA-I
214700         IF COND-WORD = 17
214800*M       "EXP/NW ENTERED IS INVALID FOR CLASS"
214900             MOVE   5 TO LANG-SETNUM
215000             MOVE  62 TO LANG-MSGNUM
215100             MOVE  11 TO FIELD-NUMBER
215200             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
215300             GO TO 620-PE-X
215400         ELSE
215500         GO TO 620-PE-X.
215600
215700     IF DE2-SUB-L NOT LESS THAN "100"
215800         IF DE2-SUB-L NOT GREATER THAN "999"
                   IF DS2-CODE NOT = "NC"
                       GO TO 620-PE-X
                   ELSE
215900             IF DE2-ADDTDATA-L = "000000" OR "      "
216000                 NEXT SENTENCE
216100             ELSE
216200             MOVE "NW" TO MVALIDPLT-ARG-1-2
216300             MOVE DE2-ADDTDATA-L TO MVALIDPLT-ARG-3-10
                   PERFORM 9000-START-MVALIDPLTDATA-I
217100             IF COND-WORD = 0
217200*M           "EXP/NW IS INVALID FOR CLASS"
217300                 MOVE  5 TO LANG-SETNUM
217400                 MOVE 62 TO LANG-MSGNUM
217500                 MOVE 11 TO FIELD-NUMBER
217600                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
217700                 GO TO 620-PE-X
217800             ELSE
217900             GO TO 620-PE-X.
218000
218100     MOVE "NW" TO MVALIDPLT-ARG-1-2.
218200     MOVE DE2-ADDTDATA-L TO MVALIDPLT-ARG-3-10.
           PERFORM 9000-START-MVALIDPLTDATA-I.
219000     IF COND-WORD = 0
219100         IF DE2-SUB-L NOT < "000" AND DE2-SUB-L NOT > "099"
219200             NEXT SENTENCE
219300         ELSE
219400*M       "CLASS ENTERED IS INVALID"
219500         MOVE   3 TO LANG-SETNUM
219600         MOVE 199 TO LANG-MSGNUM
219700         MOVE  27 TO FIELD-NUMBER
219800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
219900         GO TO 620-PE-X
220000     ELSE
220100     IF DE2-SUB-L NOT < "000" AND DE2-SUB-L NOT > "099"
220200*M   "EXP/NW IS INVALID FOR CLASS"
220300         MOVE  5 TO LANG-SETNUM
220400         MOVE 62 TO LANG-MSGNUM
220500         MOVE 27 TO FIELD-NUMBER
220600         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
220700
       620-PE-X.    EXIT.

      *********************************
      *
      *   EDIT STD. INSTRUCTIONS
      *
      *********************************

       621-EDIT-COMMENTS.
           IF DE2-STD-INST (SUB) = SPACES
               GO TO 621-EC-X.
           MOVE DE2-STD-INST (SUB)  TO  BUILD-COM-NO.
           MOVE "C"                 TO  BUILD-COM-PREFIX.
           MOVE BUILD-COMMENT-NO    TO  COMMENT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE COMMENT-ARG TO MCOMCOMMNT OF MCOMMENT-REC-I.
           START MCOMMENT-I KEY = MCOMCOMMNT OF MCOMMENT-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
      *    CALL "DBGET" USING BASE, DSET-MCOMMENT, MODE7,
      *        STATUS-AREA, ALL-ITEMS, BUF-MCOMMENT, COMMENT-ARG.
           IF COND-WORD NOT = 0
               IF COND-WORD = 17
      *            "INSTRUCTION NUMBER DOES NOT EXIST"
                   MOVE   9 TO LANG-SETNUM
                   MOVE  60 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                          DE2-MESSAGE-LINE-L
                   ADD 31, SUB  GIVING FIELD-NUMBER
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   MOVE "Y"  TO  ERR-SW
               ELSE
                   MOVE "GET MCOMMENT * 621-EC" TO BU-DISPLAY-MSG
                   MOVE COMMENT-ARG             TO BU-DISPLAY-FLD (2)
                   GO TO 2100-BLOWUP.

       621-EC-X.
           EXIT.

      *********************************
      *
      *   EDIT RCV. INSTRUCTIONS
      *
      *********************************

       621-EDIT-RCV-COMMENTS.
           IF DE2-RCV-INST (SUB) = SPACES
               GO TO 621-ERC-X.
           MOVE DE2-RCV-INST (SUB)  TO  BUILD-COM-NO.
           MOVE "R"                 TO BUILD-COM-PREFIX.
           MOVE BUILD-COMMENT-NO    TO  COMMENT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE COMMENT-ARG TO MCOMCOMMNT OF MCOMMENT-REC-I.
           START MCOMMENT-I KEY = MCOMCOMMNT OF MCOMMENT-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF COND-WORD NOT = 0
               IF COND-WORD = 17
      *            "INSTRUCTION NUMBER DOES NOT EXIST"
                   MOVE   9 TO LANG-SETNUM
                   MOVE  60 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                          DE2-MESSAGE-LINE-L
                   ADD 59, SUB  GIVING FIELD-NUMBER
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   MOVE "Y"  TO  ERR-SW
               ELSE
                   MOVE "GET MCOMMENT * 621-ERC" TO BU-DISPLAY-MSG
                   MOVE COMMENT-ARG             TO BU-DISPLAY-FLD (2)
                   GO TO 2100-BLOWUP.

       621-ERC-X.
           EXIT.
      *********************************
      *
      *   CODED PO EDITS PROCEDURE
      *
      *********************************

       621-EDIT-CODED-ITEM.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC-I.
           READ MSTORERM-I INTO BUF-MSTORERM
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
      *    CALL "DBGET" USING BASE, DSET-MSTORERM, MODE7,
      *        STATUS-AREA, ALL-ITEMS, BUF-MSTORERM, CODE-ARG.
           IF COND-WORD NOT = ZERO
               IF COND-WORD = 17
                   IF MASTER-STOCK-EDIT-SW = "Y"
      *                "STORES CODE DOES NOT EXIST"
                       MOVE  19 TO LANG-SETNUM
                       MOVE   9 TO LANG-MSGNUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                              DE2-MESSAGE-LINE-L
                       MOVE 44  TO FIELD-NUMBER
                       PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                       MOVE "Y"  TO  ERR-SW
                       GO TO 621-ECI-X
                   ELSE
                       MOVE "GET MSTORERM COND=17 *621-ECI"
                           TO BU-DISPLAY-MSG
                       MOVE CODE-ARG    TO BU-DISPLAY-FLD (2)
                       GO TO 2100-BLOWUP
               ELSE
                   MOVE "GET MSTORERM * 621-ECI" TO BU-DISPLAY-MSG
                   MOVE CODE-ARG        TO BU-DISPLAY-FLD (2)
                   GO TO 2100-BLOWUP.

           IF DE2-QTY-UM = STR-UM OR STR-UM1 OR STR-UM2
               NEXT SENTENCE
           ELSE
      *        "QUANTITY UM IS NOT A STOREROOM UM"
               MOVE  17 TO LANG-SETNUM
               MOVE   4 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                      DE2-MESSAGE-LINE-L
               MOVE 6  TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               MOVE "Y"  TO  ERR-SW
               GO TO 621-ECI-X.

           IF DE2-PRICE-UM = STR-UM OR STR-UM1 OR STR-UM2
               NEXT SENTENCE
           ELSE
      *        "PRICE UM IS NOT A STOREROOM UM"
               MOVE  16 TO LANG-SETNUM
               MOVE  14 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                      DE2-MESSAGE-LINE-L
               MOVE 9  TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               MOVE "Y"  TO  ERR-SW
               GO TO 621-ECI-X.

           IF MASTER-STOCK-EDIT-SW = "Y"
               NEXT SENTENCE
           ELSE
               IF DE2-PRICE = ZEROS OR
                  STR-MKT-COST = ZEROS
                   NEXT SENTENCE
               ELSE
               IF DE2-PRICE = SAVE-ITEM-PRICE
                   NEXT SENTENCE
               ELSE
                   IF ADD-PO-COMPARE-PERCENT-SW = "Y"
                       PERFORM 6211-EDIT-PRICE-CHANGE  THRU 6211-EPC-X.

       621-ECI-X.
           EXIT.


      *********************************
      *
      *  NON-CODED PO EDITS PROCEDURE
      *
      *********************************

       621-EDIT-NONCODED-ITEM.
           IF DE2-QTY-UM = DE2-PRICE-UM
               NEXT SENTENCE
           ELSE
      *        "QUANTITY AND PRICE UM MUST EQUAL FOR A NON-CODED PO
               MOVE  17 TO LANG-SETNUM
               MOVE  14 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                      DE2-MESSAGE-LINE-L
               MOVE 6  TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               MOVE "Y"  TO  ERR-SW
               GO TO 621-ENI-X.

           IF DE2-PRICE = SAVE-ITEM-PRICE AND
              DE2-QTY   = SAVE-QTY
               NEXT SENTENCE
           ELSE
           IF REQ-COMPARE-PERCENT-SW = "Y"
               IF DE2-REQ-NO (1:1) = "M"
                   IF REQITM-BUDGET-AMT NUMERIC
                       IF REQITM-BUDGET-AMT > 0
                         PERFORM 6211-EDIT-PRICE-CHANGE-REQ
                                                   THRU 6211-EPCR-X.
       621-ENI-X.
           EXIT.

      ********************************************
      *
      *  UPDATE PROCEDURE FOR ITEMS
      *
      ********************************************

       621-UPDATE-ITEM-DATA.
           IF CONT-SW = "Y"
               GO TO 621-ADD-DPODATAITM-BEGIN.

           IF DS2-CODE = "NC"
               GO TO 621-ADD-DPOITEM.

       621-UPDATE-MSTORERM.
           MOVE ADD-ITEM-COMPANY-SAVE   TO  SPOMSTRM-COMPANY-SAVE.
           MOVE DE2-QTY                 TO  SPOMSTRM-QTY.
           MOVE DE2-QTY-UM              TO  SPOMSTRM-QTY-UM.
           MOVE DE2-PRICE               TO  SPOMSTRM-PRICE.
           MOVE DE2-PRICE-UM            TO  SPOMSTRM-PRICE-UM.
      *---------- DO NOT UPDATE MARKET COST.
      *****IF ZBILL-PO
      *****    MOVE DE2-ITEM-VALUE      TO  SPOMSTRM-UNIT-VALUE.
           MOVE PO-NO                   TO  SPOMSTRM-PO-NUM.
           MOVE PO-REL                  TO  SPOMSTRM-PO-RLSE.
           MOVE VEN-ARG                 TO  SPOMSTRM-VEN-CODE.
           MOVE ADD-ITEM-CUR-CODE       TO  SPOMSTRM-CUR-CODE.
           CALL "SPOMSTRM" USING BASE,
                                 CODE-ARG,
                                 SPOMSTRM-PARMS,
                                 ZBILL-PO-SW,
                                 STATUS-AREA,
                                 BU-DISPLAY-MSG,
                                 BU-DISPLAY-FLDS.
           IF BU-DISPLAY-MSG NOT = SPACES
               GO TO 2100-BLOWUP.

       621-ADD-DPOITEM.
           MOVE SPACES               TO  BUF-DPOITEM.
           IF DS2-CODE = "NC"
               MOVE "NON-STR"        TO  ITM-CORP-CODE
           ELSE
               MOVE DS2-CODE         TO  ITM-CORP-CODE.
           MOVE RETURN-CHAT-NO       TO  ITM-CHAT-NO.
           MOVE ZERO                 TO  ITM-QTY-DLVR,
                                         ITM-QTY-STORED,
                                         ITM-QTY-PAID,
                                         ITM-WT,
                                         ITM-KELLY-PO-QTY
                                         ITM-ASN-QTY.
           MOVE SEQ-ITEM-NO-SAVE     TO  ITM-NUMBER.
           MOVE DE2-QTY-UM           TO  ITM-UM.
           MOVE DE2-QTY              TO  ITM-QTY-ORD.
           MOVE DE2-PRICE-UM         TO  ITM-PRICE-UM.
           MOVE DE2-PRICE            TO  ITM-UNIT-PRICE.
           MOVE DE2-SUB              TO  ITM-CLASS.
           MOVE DE2-SUB-DETL         TO  ITM-SUB-DETL.
           MOVE DE2-ADDTDATA         TO  ITM-ADDL-DATA.
           MOVE DE2-TAX-CODE         TO  ITM-TAX-CODE.
           MOVE DE2-STD-INST-TABLE   TO  ITM-STD-INST.
           MOVE DE2-RCV-INST-TABLE   TO  ITM-RCV-STD-INST.
           MOVE DE2-SECOND-LANG-INDIC  TO  ITM-SECOND-DESC-INDIC.
           IF ZBILL-PO
               MOVE DE2-ITEM-VALUE   TO  ITM-ZBILL-VALUE
           ELSE
               MOVE ZEROS            TO  ITM-ZBILL-VALUE.
           MOVE BUILD-PO-SEARCH      TO  ITM-PO-RCV-NO.
           MOVE DE2-MASTER-STOCK     TO  ITM-MASTER-STOCK.
           MOVE DE2-QS9000-TRACKING  TO  ITM-QS9000-TRACK.
           IF SAVE-PCPO-SW = "Y"
               MOVE DE2-COMPANY-L    TO  ITM-COMPANY
               MOVE DE2-PRIME-L      TO  ITM-PRIME.

           MOVE 0 TO COND-WORD.
           WRITE DPOITEM-REC-O FROM BUF-DPOITEM
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
      *    CALL "DBPUT" USING BASE, DSET-DPOITEM, MODE1,
      *        STATUS-AREA, ALL-ITEMS, BUF-DPOITEM.
           IF COND-WORD NOT = ZERO
               MOVE "PUT DPOITEM * 621-ASD"  TO  BU-DISPLAY-MSG
               GO TO 2100-BLOWUP.

      **********************
      *                    *
      *  CUT ITEM TC "320" *
      *                    *
      **********************

       621-CALL-STC320.
           MOVE SPACES                  TO  STC320-PARMS.
           MOVE ADD-ITEM-COMPANY-SAVE   TO  STC320-COMPANY-SAVE.
           MOVE "20"                    TO  STC320-ITEM-TC-ID.
           IF DS2-CODE = "NC"
               MOVE DE2-QTY             TO  STC320-QTY
               MOVE DE2-PRICE           TO  STC320-PRICE
           ELSE
               MOVE SPOMSTRM-STR-QTY    TO  STC320-QTY
               MOVE SPOMSTRM-STR-PRICE  TO  STC320-PRICE.
           IF DS2-CODE = "NC"
               MOVE DE2-QTY-UM          TO  STC320-QTY-UM
               MOVE DE2-PRICE-UM        TO  STC320-PRICE-UM
           ELSE
               MOVE SPOMSTRM-STR-UM     TO  STC320-QTY-UM,
                                            STC320-PRICE-UM.
           MOVE SEQ-ITEM-NO-SAVE        TO  STC320-ITEM.
           MOVE BUILD-PO-SEARCH         TO  STC320-PO-NUM.
           MOVE DS2-CODE                TO  STC320-CODE.
           MOVE BUDGET-NO-SAVED         TO  STC320-BUDGET-NO.
           MOVE DE2-REQ-NO              TO  STC320-REQ-NO.
           MOVE ITM-CLASS               TO  STC320-SUB.
           MOVE ITM-SUB-DETL            TO  STC320-SUBD.
           MOVE ITM-ADDL-DATA           TO  STC320-ADDTL-DATA.
           MOVE DE2-TAX-CODE            TO  STC320-TAX-CODE.
           MOVE ZEROS                   TO  STC320-OLD-BUDGET-AMT.
           MOVE ADD-ITEM-CUR-CODE       TO  STC320-CUR-CODE.
           IF SAVE-PCPO-SW = "Y"
               MOVE ITM-COMPANY         TO  STC320-COMPANY
               MOVE ITM-PRIME           TO  STC320-PRIME.
           CALL "STC320" USING BASE,
                               STC320-PARMS,
                               STATUS-AREA,
                               BU-DISPLAY-MSG,
                               BU-DISPLAY-FLDS.
           IF BU-DISPLAY-MSG-1  NOT = SPACES
               GO TO 2100-BLOWUP.

           IF ADD-PGM-ID = "2"
               MOVE SPACES                  TO  SEDIVNCK-PARMS
               MOVE BUILD-PO-SEARCH         TO  SEDIVNCK-PO-NUMBER
               CALL "SEDIVNCK" USING BASE,
                                     SEDIVNCK-PARMS
               IF SEDIVNCK-EDI-IND = "Y"
                   MOVE SPACES              TO  SEDIPOLG-PARMS
                   MOVE BUILD-PO-SEARCH     TO  PO-NUMBER-EDI
                   MOVE VEN-ARG             TO  VENDOR-CODE-EDI
                   MOVE "X"                 TO  FLAG-EDI-A
                   MOVE SEQ-ITEM-NO-SAVE    TO  PO-ITEM-NO-EDI
                   MOVE "SADDPITM"          TO  CALLING-PGM-EDI
                   MOVE "X"             TO  FLAG-EDI-M
                   CALL "SEDIPOLG" USING BASE,
                                         SEDIPOLG-PARMS,
                                         LANGUAGE-PARMS.

      *************************************************************
      **
      **   CALCULATE BUDGET AMOUNT FOR THE ITEM AND ALSO
      **   INCLUDE TAX (BASED ON TAX PERCENT ASSOC. WITH TAX CODE)
      **
      *************************************************************

      **** MULTIPLY STC320-PRICE  BY  STC320-QTY   GIVING
      ****   BUDGET-AMT-SAVED ROUNDED, ITEM-EXTENSION-SAVED ROUNDED.

           MOVE STC320-QTY       TO  SCALCBGT-QTY.
           MOVE STC320-PRICE     TO  SCALCBGT-PRICE.
           MOVE STC320-TAX-CODE  TO  SCALCBGT-TAX-CODE.
           MOVE 0                TO  SCALCBGT-BUDGET.
           CALL "SCALCBGT"  USING  SCALCBGT-PARMS.
           ADD SCALCBGT-BUDGET   TO  TOTAL-PO-BUDGET.

      **** ADD BUDGET-AMT-SAVED, ITEM-TAX TO TOTAL-PO-BUDGET.

      ***************************************************
      **
      **  LINK THE REQ TO THE PURCHASE ORDER
      **
      ***************************************************

           IF DE2-REQ-NO  =  SPACES
               NEXT SENTENCE
           ELSE
               PERFORM 66-UPDATE-REQ  THRU  66-UR-X.

           MOVE "N"                     TO  TC370-CUT-SW.
           IF DS2-CODE = "NC"
               GO TO 621-ADD-DPODATAITM-BEGIN.

      **********************************************************
      **  CALL 'SVENPRC' TO UPDATE LAST PO PRICE FOR THAT
      **  VENDOR IN DVENDITM.
      **********************************************************

       621-UPDATE-VENDOR-PRICE.
           MOVE SPACES                  TO  SVENPRC-PARMS.
           MOVE "U"                     TO  SVENPRC-FLAG.
           MOVE CODE-ARG                TO  SVENPRC-CODE.
           MOVE VEN-ARG                 TO  SVENPRC-VEN-CODE.
           MOVE ITM-UNIT-PRICE          TO  SVENPRC-PRICE.
           MOVE ITM-PRICE-UM            TO  SVENPRC-PRICE-UM.
           MOVE CUR-DATE                TO  SVENPRC-PO-DATE.
           CALL "SVENPRC" USING BASE,
                                SVENPRC-PARMS,
                                STATUS-AREA,
                                BU-DISPLAY-MSG,
                                BU-DISPLAY-FLDS.
           IF BU-DISPLAY-MSG-1  NOT = SPACES
               GO TO 2100-BLOWUP.

      **********************
      *                    *
      *   BUILD DPODATAITM *
      *                    *
      **********************

       621-ADD-DPODATAITM-BEGIN.
           IF DS2-CODE = "NC"  AND
              TC370-NOT-CUT
               PERFORM 6211-CUT-TC370  THRU  6211-CT370-X.

           MOVE ZERO                 TO SUB.

       621-ADD-DPODATAITM.
           ADD 1 TO SUB.
           IF SUB > 7
               GO TO 621-ADD-DPODATAITM-2.
           IF DE2-DESC(SUB) = SPACES
               GO TO 621-ADD-DPODATAITM.
           ADD 1                     TO LINE-NO-SAVE.
           IF LINE-NO-SAVE = 99
                GO TO 621-UID-X.
           MOVE SPACES               TO  BUF-DPODATAITM.
           MOVE BUILD-PO-SEARCH      TO  DATAITM-PO-RCV-NO.
           MOVE SEQ-NO-SAVE          TO  DATAITM-LINE.
           MOVE DE2-DESC(SUB)        TO  DATAITM-INFO.
           MOVE 0 TO COND-WORD.
           WRITE DPODATAITM-REC-O FROM BUF-DPODATAITM
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
      *    CALL "DBPUT" USING BASE, DSET-DPODATAITM, MODE1,
      *        STATUS-AREA, ALL-ITEMS, BUF-DPODATAITM.
           IF COND-WORD = ZERO
               NEXT SENTENCE
           ELSE
               MOVE "PUT DPODATAITM2* 621-AD" TO BU-DISPLAY-MSG
               GO TO 2100-BLOWUP.

           GO TO 621-ADD-DPODATAITM.

       621-ADD-DPODATAITM-2.
           MOVE SPACES                  TO  CONT-SW.
           MOVE ZEROS                   TO  SUB.
           IF DE2-CONT-SW = SPACE
               IF DE2-REQ-NO = SPACES
                   GO TO 621-UID-X
               ELSE
                   IF END-OF-REQ-DESC-SW = "Y"
                       GO TO 621-UID-X
                   ELSE
                       PERFORM 661-LOAD-DESC  THRU  661-LRD-X
                       MOVE "Y"         TO  CONT-SW
                       GO TO 621-ADD-DPODATAITM.
           MOVE "Y"                     TO  CONT-SW.
           MOVE SPACES                  TO  DE2-DESC-AREA
                                            DE2-DESC-AREA-L.
      *    "QTY AND PRICE INFO. PROCESSED, CONTINUE ENTERING COMMENTS"
           MOVE  17                     TO  LANG-SETNUM.
           MOVE  10                     TO  LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO  DE2-INSTRUCTIONLINE
                                            DE2-INSTRUCTIONLINE-L.
           MOVE ADDL-DESC-MSG-LIT       TO  DE2-ADDL-DESC-MSG
                                            DE2-ADDL-DESC-MSG-L.

           IF DE2-REQ-NO = SPACES
               NEXT SENTENCE
           ELSE
               IF END-OF-REQ-DESC-SW = "Y"
                   NEXT SENTENCE
               ELSE
                   PERFORM 661-LOAD-DESC  THRU  661-LRD-X.

      *    IF SAVE-CHAT-SW = "Y"
      *        MOVE "PURORD2BC"       TO  VIEW-NFNAME
      *    ELSE
           MOVE "PURORD2B"            TO  VIEW-NFNAME.

       621-UID-X.
           EXIT.


       621-CALL-CODE-DESC.
           MOVE ADD-ITEM-COMPANY-SAVE   TO  PODESC-COMPANY-SAVE.
           CALL "SPOCDESC" USING BASE,
                                 CODE-ARG,
                                 VIEW-COMAREA,
                                 PO-DESC-PARMS,
                                 SCREEN-PRINT-PARMS,
                                 PASSED-SPOOL-PRT,
                                 LANGUAGE-PARMS.


       621-CCD-X.
           EXIT.


       6211-CUT-TC370.
           MOVE ZERO                    TO  SUB.

       6211-CHECK-FOR-DESC.
           ADD 1                        TO  SUB.
           IF SUB > 7
               GO TO 6211-CT370-X
           ELSE
               IF DE2-DESC (SUB) = SPACES
                   GO TO 6211-CHECK-FOR-DESC.

           MOVE "Y"                     TO  TC370-CUT-SW.
           MOVE SPACES                  TO  BUF-DDAILYTC.
           MOVE CUR-DATE                TO  DDAILYTC-DATE.
           ACCEPT DDAILYTC-TIME FROM TIME.
      *    MOVE TIME-OF-DAY             TO  DDAILYTC-TIME.
           MOVE ADD-ITEM-COMPANY-SAVE   TO  DDAILYTC-PLT.
           MOVE "370"                   TO  DDAILYTC-TC.
           MOVE BUILD-PO-SEARCH         TO  TC370-PO-RLS.
           MOVE SEQ-ITEM-NO-SAVE        TO  TC370-ITEM-NO.
           MOVE "01"                    TO  TC370-LINE-NO.
           MOVE DE2-DESC-FIRST-45 (SUB) TO  TC370-NONCODED-DESC.
           MOVE 0 TO COND-WORD.
           WRITE DDAILYTC-REC-O FROM BUF-DDAILYTC
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
      *    CALL "DBPUT" USING BASE, DSET-DDAILYTC, MODE1,
      *        STATUS-AREA, ALL-ITEMS, BUF-DDAILYTC.
           IF COND-WORD NOT = ZERO
               MOVE "PUT DDAILYTC * 6211-CFD" TO BU-DISPLAY-MSG
               GO TO 2100-BLOWUP.

       6211-CT370-X.
           EXIT.

      *************************************************************
      **   THE FOLLOWING ROUTINE COMPARES THE UNIT PRICE
      **   ENTERED WITH THE LAST MARKET COST AND IF THE
      **   PERCENTAGE PRICE CHANGE IS GREATER THEN THE USER
      **   SELECTED PERCENTAGE THEN A WARNING MESSAGE IS DISPLAYED
      **   TO THE SCREEN.  THE USER CAN THEN CORRECT THE PRICE
      **   OR PRESS ENTER AGAIN IF THE PRICE IS CORRECT.
      *************************************************************

       6211-EDIT-PRICE-CHANGE.
           MOVE DE2-PRICE               TO SAVE-ITEM-PRICE.

      ****************************************************
      **   CONVERT TO STOREROOM UNIT OF MEASURE
      ****************************************************
           IF DE2-PRICE-UM = STR-UM
               MOVE DE2-PRICE           TO SAVE-PRICE-COMPARE
           ELSE
           IF DE2-PRICE-UM = STR-UM1
               DIVIDE DE2-PRICE BY STR-UM1-CF
                   GIVING SAVE-PRICE-COMPARE ROUNDED
           ELSE
           IF DE2-PRICE-UM = STR-UM2
               DIVIDE DE2-PRICE BY STR-UM2-CF
                   GIVING SAVE-PRICE-COMPARE ROUNDED
           ELSE
               MOVE "PRICE CONV FACTOR PROBLEM*6211-EPC"
                   TO BU-DISPLAY-MSG
               MOVE DE2-PRICE-UM        TO BU-DISPLAY-FLD (2)
               GO TO 2100-BLOWUP.

      *********************************************************
      **   CONVERT TO LOCAL CURRENCY IF A CURRENCY CODE WAS
      **   ENTERED FOR THE PO.  CALL 'SCURCONV' TO CONVERT.
      *********************************************************
           IF ADD-ITEM-CUR-CODE = SPACES
               NEXT SENTENCE
           ELSE
               MOVE SAVE-PRICE-COMPARE  TO SCURCONV-PRICE-DEC
               MOVE ZEROS               TO SCURCONV-PRICE-WHL
               MOVE ADD-ITEM-CUR-CODE   TO SCURCONV-CUR-CODE
               MOVE "Y"                 TO SCURCONV-OVERRIDE-CONV-SW
               CALL "SCURCONV" USING BASE,
                                     SCURCONV-PARMS,
                                     STATUS-AREA,
                                     BU-DISPLAY-MSG,
                                     BU-DISPLAY-FLDS
               IF BU-DISPLAY-MSG-1 NOT = SPACES
                   MOVE "SCURCONV-6211" TO BU-DISPLAY-FLD (3)
                   GO TO 2100-BLOWUP
               ELSE
                   MOVE SCURCONV-PRICE-DEC TO SAVE-PRICE-COMPARE.

           IF SAVE-PRICE-COMPARE = ZEROS
               GO TO 6211-EPC-X.

      ************************************************************
      **   FORMULA FOR PRICE COMPARISON WITH LAST MARKET COST
      **   IS:
      **        1) LAST MARKET COST - PO PRICE = PRICE DIFFERENCE
      **        2) IF PRICE DIFFERENCE < 0
      **               MULTPLY PRICE DIFFENCE BY -1 TO GET ABSOLUTE
      **               VALUE
      **        3) PRICE DIFFERENCE
      **           ----------------  = PERCENTAGE CHANGE
      **           LAST MARKET COST
      **        4) IF PERCENTAGE CHANGE > USER SELECTED PERCENTAGE THEN
      **           DISPLAY A WARNING MESSAGE ON SCREEN
      ******************************************************************

           SUBTRACT SAVE-PRICE-COMPARE  FROM STR-MKT-COST
               GIVING SAVE-PRICE-CHG  ROUNDED.

           IF SAVE-PRICE-CHG = ZEROS
               GO TO 6211-EPC-X
           ELSE
           IF SAVE-PRICE-CHG < 0
               MULTIPLY SAVE-PRICE-CHG BY -1 GIVING SAVE-PRICE-CHG.

           DIVIDE SAVE-PRICE-CHG BY STR-MKT-COST
               GIVING SAVE-PERCENT-CHG ROUNDED.

           IF SAVE-PERCENT-CHG > ADD-PO-COMPARE-PERCENT
      *       "PRICE DIFF. GREATER THAN PERCENTAGE CHOOSEN;PRESS ENTER
               MOVE  16 TO LANG-SETNUM
               MOVE  136 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                      DE2-MESSAGE-LINE-L
               MOVE 39 TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               MOVE "Y"  TO  ERR-SW.

       6211-EPC-X.
           EXIT.

      *---------- CHECK BUDGET AMOUNT ON NON-CODED REQ.
       6211-EDIT-PRICE-CHANGE-REQ.
           MOVE DE2-PRICE          TO  SAVE-ITEM-PRICE.
           MOVE DE2-QTY            TO  SAVE-QTY.
           MULTIPLY  DE2-QTY       BY  DE2-PRICE
                               GIVING  K-PO-ITEM-EXT ROUNDED.

           MOVE REQITM-BUDGET-AMT  TO  SAVE-PRICE-COMPARE.

      *********************************************************
      **   CONVERT TO LOCAL CURRENCY IF A CURRENCY CODE WAS
      **   ENTERED FOR THE PO.  CALL 'SCURCONV' TO CONVERT.
      *********************************************************
           IF ADD-ITEM-CUR-CODE = SPACES
               NEXT SENTENCE
           ELSE
               MOVE K-PO-ITEM-EXT       TO SCURCONV-PRICE-DEC
               MOVE ZEROS               TO SCURCONV-PRICE-WHL
               MOVE ADD-ITEM-CUR-CODE   TO SCURCONV-CUR-CODE
               MOVE "Y"                 TO SCURCONV-OVERRIDE-CONV-SW
               CALL "SCURCONV" USING BASE,
                                     SCURCONV-PARMS,
                                     STATUS-AREA,
                                     BU-DISPLAY-MSG,
                                     BU-DISPLAY-FLDS
               IF BU-DISPLAY-MSG-1 NOT = SPACES
                   MOVE "SCURCONV-6211R" TO BU-DISPLAY-FLD (3)
                   GO TO 2100-BLOWUP
               ELSE
                   MOVE SCURCONV-PRICE-DEC TO K-PO-ITEM-EXT.

           IF K-PO-ITEM-EXT = ZEROS
               GO TO 6211-EPCR-X.

      ************************************************************
      **   FORMULA FOR PRICE COMPARISON WITH REQ BUDGET AMOUNT
      **   IS:
      **        1) REQ BUDGET AMT - PO PRICE = PRICE DIFFERENCE
      **        2) IF PRICE DIFFERENCE < 0
      **               MULTPLY PRICE DIFFENCE BY -1 TO GET ABSOLUTE
      **               VALUE
      **        3) PRICE DIFFERENCE
      **           ----------------- = PERCENTAGE CHANGE
      **           REQ BUDGET AMOUNT
      **        4) IF PERCENTAGE CHANGE > USER SELECTED PERCENTAGE THEN
      **           DISPLAY A WARNING MESSAGE ON SCREEN
      ******************************************************************

           SUBTRACT K-PO-ITEM-EXT  FROM  SAVE-PRICE-COMPARE
               GIVING SAVE-PRICE-CHG  ROUNDED.

           IF SAVE-PRICE-CHG = ZEROS
               GO TO 6211-EPCR-X
           ELSE
      *-------------- SKIP BUDGET CHECK IF PO ITEM < REQ BUDGET AMT.
           IF SAVE-PRICE-CHG > ZEROS
               GO TO 6211-EPCR-X
           ELSE
           IF SAVE-PRICE-CHG < 0
               MULTIPLY SAVE-PRICE-CHG BY -1 GIVING SAVE-PRICE-CHG.

           DIVIDE SAVE-PRICE-CHG BY REQITM-BUDGET-AMT
               GIVING SAVE-PERCENT-CHG ROUNDED.

           IF SAVE-PERCENT-CHG > REQ-COMPARE-PERCENT
      *       "PRICE DIFF. GREATER THAN PERCENTAGE CHOSEN;PRESS ENTER
               MOVE  16 TO LANG-SETNUM
               MOVE  138 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                      DE2-MESSAGE-LINE-L
               MOVE 39 TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               MOVE "Y"  TO  ERR-SW.

       6211-EPCR-X.
           EXIT.

       66-UPDATE-REQ.
           MOVE BUILD-PO-SEARCH       TO  REQLINK-PO-NUM.
           MOVE VEN-ARG               TO  REQLINK-VEN-CODE.
           MOVE REQ-ARG               TO  REQLINK-REQ-NO.
           MOVE SEQ-ITEM-NO-SAVE      TO  REQLINK-PO-ITEM-NO.
           CALL "SREQLINK" USING BASE,
                                 REQLINK-PARMS.

       66-UR-X.
           EXIT.

       66-PROCESS-REQ-NO.
           MOVE 12          TO  FIELD-NUMBER.
           MOVE DE2-REQ-NO  TO  REQ-ARG.
           MOVE SPACES      TO  ERR-SW.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF MREQ-REC-I.
           READ MREQ-I INTO BUF-MREQ
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
      *    CALL "DBGET" USING BASE, DSET-MREQ, MODE7, STATUS-AREA,
      *        ALL-ITEMS, BUF-MREQ, REQ-ARG.
           IF COND-WORD NOT =  0
               IF COND-WORD = 17
                   MOVE "Y"  TO  ERR-SW
      *            "REQUISITION NUMBER DOES NOT EXIST"
                   MOVE  18 TO LANG-SETNUM
                   MOVE   5 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO MSG-TEXT
                   MOVE DE2-REQ-NO  TO  MSG-FLD
                   MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                          DE2-MESSAGE-LINE-L
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   GO TO 66-PRN-X
               ELSE
                   MOVE "GET MREQ*66-PRN"  TO  BU-DISPLAY-MSG
                   MOVE REQ-ARG         TO  BU-DISPLAY-FLD (2)
                   GO TO 2100-BLOWUP.

           IF NON-CODED-RELEASE-SW = "Y"
             IF REQ-MAT-TYPE NOT = "N"
      **          "RELEASE MUST BE NON-CODED, ENTER 'NON-CODED' REQ
                 MOVE "Y"  TO  ERR-SW
                 MOVE  18 TO LANG-SETNUM
                 MOVE  24 TO LANG-MSGNUM
                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                 MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                        DE2-MESSAGE-LINE-L
                 PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                 GO TO 66-PRN-X
             ELSE
                 NEXT SENTENCE
           ELSE
           IF NON-RECV-SW = "Y"
             IF REQ-MAT-TYPE NOT = "N"
      **      "NON-RECEIVABLE PO MUST BE NON-CODED, ENTER NON-CODED REQ
                 MOVE "Y"  TO  ERR-SW
                 MOVE  14 TO LANG-SETNUM
                 MOVE  45 TO LANG-MSGNUM
                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                 MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                        DE2-MESSAGE-LINE-L
                 PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                 GO TO 66-PRN-X.

           IF REQ-MATCONT-RELEASE  NOT = "X"
               IF REQ-TYPE = "S"
      *            "REQUISITION NOT RELEASED - CONTACT MATERIALS CONTROL"
                   MOVE  18 TO LANG-SETNUM
                   MOVE  12 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                          DE2-MESSAGE-LINE-L
                   MOVE "Y"  TO  ERR-SW
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   GO TO 66-PRN-X
               ELSE
      *            "REQUISITION NOT RELEASED - CONTACT ORIGINATOR"
                   MOVE  18 TO LANG-SETNUM
                   MOVE  13 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                          DE2-MESSAGE-LINE-L
                   MOVE "Y"  TO  ERR-SW
                   PERFORM 4-PGM-ERROR  THRU 4-PGM-ERROR-X
                   GO TO 66-PRN-X.

           IF REQ-STATUS = "SS"
               IF REQ-APPROVALS-LEFT = "  "
                   NEXT SENTENCE
               ELSE
               IF REQ-APPROVALS-LEFT-9 > 0
                   MOVE 19 TO LANG-SETNUM
                   MOVE 47 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                          DE2-MESSAGE-LINE-L
                   MOVE "Y" TO ERR-SW
                   PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
                   GO TO 66-PRN-X.

           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DREQD-REC-I.
           START DREQD-I KEY = REQNO OF DREQD-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
      *    CALL "DBFIND" USING BASE, DSET-DREQD, MODE1,
      *        STATUS-AREA, REQ-SEARCH, REQ-ARG.
           IF COND-WORD NOT = 0
               MOVE "FIND DREQD * 66-GD" TO BU-DISPLAY-MSG
               MOVE REQ-ARG               TO BU-DISPLAY-FLD (2)
               GO TO 2100-BLOWUP.
           MOVE 0 TO COND-WORD.
           READ DREQD-I NEXT INTO BUF-DREQD
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF REQNO OF DREQD-REC-I NOT = REQ-ARG
               MOVE 15 TO COND-WORD.
      *    CALL "DBGET" USING BASE, DSET-DREQD, MODE5,
      *        STATUS-AREA, ALL-ITEMS, BUF-DREQD, REQ-ARG.
           IF COND-WORD NOT =  0
               MOVE "GET DREQD * 66-GD"  TO  BU-DISPLAY-MSG
               MOVE REQ-ARG           TO  BU-DISPLAY-FLD (2)
               GO TO 2100-BLOWUP.

           IF DREQD-PO-RCV-NO NOT = SPACES
      *        "REQUISITON HAS ALREADY BEEN ASSIGNED A P.O."
               MOVE  18 TO LANG-SETNUM
               MOVE  14 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO MSG-TEXT
               MOVE "Y"  TO  ERR-SW
               IF DREQD-PO-RLSE  =  "000"
                   MOVE DREQD-PO-NUM       TO  MSG-FLD
                   MOVE MESSAGE-BUFFER     TO  DE2-MESSAGE-LINE
                                               DE2-MESSAGE-LINE-L
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   GO TO 66-PRN-X
               ELSE
                   MOVE DREQD-PO-NUM-RLSE  TO  MSG-FLD
                   MOVE MESSAGE-BUFFER     TO  DE2-MESSAGE-LINE
                                               DE2-MESSAGE-LINE-L
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   GO TO 66-PRN-X.

           PERFORM 661-LOAD-REQ-ITEM  THRU  661-LRI-X.

           IF CODE-DUP-SW = "Y" GO TO 66-PRN-X.

           PERFORM 661-LOAD-REQ-DESC  THRU  661-LRD-X.

       66-PRN-X.
           EXIT.

      ********************************************
      *
      *  THIS PROCEDURE LOADS THE POSSIBLE ITEM
      *  FIELDS WITH ANY INFO. THAT CAN BE TAKEN
      *  USING THE CORP-CODE.  THIS INCLUDES
      *  TAX CODE, PRICE, PRICE-UM
      *
      ********************************************

       66-PROCESS-CODE-NO.
           MOVE 31         TO  FIELD-NUMBER.
           MOVE SPACES     TO  ERR-SW.


      ********************************************
      *
      *  IF THIS ORDER IS A RELEASE MAKE SURE THE
      *  ITEMS ARE NON-CODED.  THEY CANNOT CREATE
      *  CODED SHIPPING RELEASES USING THIS
      *  PROGRAM
      *
      ********************************************

           IF NON-CODED-RELEASE-SW = "Y"
               IF DE2-CODE = "NC"
                   NEXT SENTENCE
               ELSE
      **        "RELEASE MUST BE NON-CODED ENTER 'NC' IN CODE"
                   MOVE "Y"  TO  ERR-SW
                   MOVE 18  TO  LANG-SETNUM
                   MOVE 30  TO  LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                          DE2-MESSAGE-LINE-L
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   GO TO 66-PCN-X.

      ********************************************
      *
      *  IF THIS ORDER IS A NON-RECEIVABLE MAKE SURE THE
      *  ITEMS ARE NON-CODED.  THEY CANNOT CREATE
      *  CODED NON-RECEIVABLE POs USING THIS
      *  PROGRAM
      *
      ********************************************

           IF NON-RECV-SW = "Y"
               IF DE2-CODE = "NC"
                   NEXT SENTENCE
               ELSE
      **        "NON-RECEIVABLE MUST BE NON-CODED ENTER 'NC' IN CODE"
                   MOVE "Y"  TO  ERR-SW
                   MOVE 14  TO  LANG-SETNUM
                   MOVE 46  TO  LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                          DE2-MESSAGE-LINE-L
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   GO TO 66-PCN-X.

           IF DE2-CODE = "NC"
               GO TO 66-LOAD-CODE-INFO.

           MOVE DE2-CODE              TO  CODE-ARG.
      *    PREVENT SAME CODE FROM BEING ADDED TO A REQUIREMENT ORDER
           IF PO-REL = "999"
               PERFORM 669-CHECK-DUPLICATES THRU 669-CD-X.
           IF CODE-DUP-SW = "Y" GO TO 66-PCN-X.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC-I.
           READ MSTORERM-I INTO BUF-MSTORERM
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
      *    CALL "DBGET" USING BASE, DSET-MSTORERM, MODE7,
      *        STATUS-AREA, ALL-ITEMS, BUF-MSTORERM, CODE-ARG.
           IF COND-WORD NOT = ZERO
               IF COND-WORD = 17
      *             "STORES CODE DOES NOT EXIST"
                   MOVE  19 TO LANG-SETNUM
                   MOVE   9 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                          DE2-MESSAGE-LINE-L
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   MOVE "Y"  TO  ERR-SW
                   GO TO 66-PCN-X
               ELSE
                   MOVE "GET MSTORERM * 66-VC" TO BU-DISPLAY-MSG
                   MOVE CODE-ARG                TO BU-DISPLAY-FLD (2)
                   GO TO 2100-BLOWUP.

           IF CONSIGNED-PO AND STR-CODE-OWNER = " "
                           AND ITEM-NO-SAVE > 1
      *        "CANNOT ADD NON-CONSIGNED ITEM TO CONSIGNED PO"
               MOVE  03 TO LANG-SETNUM
               MOVE 636 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                      DE2-MESSAGE-LINE-L
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               MOVE "Y"  TO  ERR-SW
               GO TO 66-PCN-X.

           IF NON-CONSIGNED-PO AND STR-CODE-OWNER > " "
                               AND ITEM-NO-SAVE > 1
                               AND NOT ZBILL-PO
      *        "CANNOT ADD CONSIGNED ITEM TO NON-CONSIGNED PO"
               MOVE  03 TO LANG-SETNUM
               MOVE 637 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                      DE2-MESSAGE-LINE-L
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               MOVE "Y"  TO  ERR-SW
               GO TO 66-PCN-X.

           MOVE STR-TAX-CODE            TO  DE2-TAX-CODE
                                            DE2-TAX-CODE-L.
           MOVE STR-STD-INST            TO  DE2-STD-INST-TABLE
                                            DE2-STD-INST-TABLE-L.
           MOVE STR-RCV-STD-INST        TO  DE2-RCV-INST-TABLE
                                            DE2-RCV-INST-TABLE-L.
           MOVE STR-CLASS               TO  SUB-SAVE.
           MOVE STR-UM                  TO  DE2-QTY-UM,
                                            DE2-QTY-UM-L,
                                            DE2-PRICE-UM
                                            DE2-PRICE-UM-L.
           MOVE STR-QS9000-TRACK        TO  DE2-QS9000-TRACKING
                                            DE2-QS9000-TRACKING-L.

      *-------- MOVE MARKET COST TO UNIT VALUE FOR REPAIR ORDER.
      *****IF ZBILL-PO
      *****    ADD 0 STR-MKT-COST   GIVING  DE2-ITEM-VALUE   ROUNDED
      *****                                 DE2-ITEM-VALUE-L ROUNDED.

           PERFORM 67-GET-LAST-PRICE  THRU  67-GLP-X.
           PERFORM 67-GET-ONE-MANUFACTURER  THRU  67-GOM-X.

       66-LOAD-CODE-INFO.
           IF DE2-TAX-CODE  =  SPACES
               MOVE SAVE-TAX-CODE       TO  DE2-TAX-CODE
                                            DE2-TAX-CODE-L.
           MOVE SUB-SAVE                TO  DE2-SUB
                                            DE2-SUB-L.
           IF ADD-ITEM-COMPANY-SAVE = "126"
               MOVE STR-DIR-CHRG-DEPT   TO  SUBD-SAVE.

      *--------- CHECK MSTORERM FIELDS FOR VALLEYFIELD.
           IF ADD-ITEM-COMPANY-SAVE = "629"
             IF DE2-CODE NOT = "NC"
               MOVE STR-EXPENSE-CLASS      TO  ADDTL-DATA-SAVE
               MOVE STR-DIR-CHRG-DEPT      TO  SUBD-SAVE
               IF SUBD-SAVE = SPACES OR SUBD-SAVE = "0000"
                   MOVE "6325"             TO  SUBD-SAVE
                   MOVE SPACES             TO  ADDTL-DATA-SAVE.

           MOVE SUBD-SAVE               TO  DE2-SUB-DETL
                                            DE2-SUB-DETL-L.
           MOVE ADDTL-DATA-SAVE         TO  DE2-ADDTDATA
                                            DE2-ADDTDATA-L.
           MOVE DE2-CODE                TO  DS2-CODE
                                            DS2-CODE-L.

           MOVE SPACES                  TO  DE2-DESC-AREA,
                                            DE2-DESC-AREA-L,
                                            DE2-MORE-DESC-MSG
                                            DE2-MORE-DESC-MSG-L.

       66-PCN-X.
           EXIT.

       661-LOAD-REQ-DESC.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DREQDESC-REC-I.
           START DREQDESC-I KEY = REQNO OF DREQDESC-REC-I
               INVALID KEY MOVE 0 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "23"
                   MOVE 0 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
      *    CALL "DBFIND" USING BASE, DSET-DREQDESC, MODE1,
      *        STATUS-AREA, REQ-SEARCH, REQ-ARG.
           IF COND-WORD NOT =  0
               MOVE "FIND DREQDESC *661-LRD"  TO  BU-DISPLAY-MSG
               MOVE REQ-ARG              TO  BU-DISPLAY-FLD (2)
               GO TO 2100-BLOWUP.

       661-LOAD-DESC.
           MOVE SPACES                    TO  DE2-DESC-AREA,
                                              DE2-DESC-AREA-L,
                                              DE2-MORE-DESC-MSG
                                              DE2-MORE-DESC-MSG-L.
           MOVE ZERO                      TO  DESC-SUB.

       661-LOAD-DESC-LOOP.
           MOVE 0 TO COND-WORD.
           READ DREQDESC-I NEXT INTO BUF-DREQDESC
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF REQNO OF DREQDESC-REC-I NOT = REQ-ARG
               MOVE 15 TO COND-WORD.
      *    CALL "DBGET" USING BASE, DSET-DREQDESC, MODE5,
      *        STATUS-AREA, ALL-ITEMS, BUF-DREQDESC, REQ-ARG.
           IF COND-WORD NOT = 0
               IF COND-WORD = 15
                   MOVE "Y"  TO  END-OF-REQ-DESC-SW
                   GO TO 661-LRD-X
               ELSE
                   MOVE "GET DREQDESC * 661-LDL" TO BU-DISPLAY-MSG
                   MOVE REQ-ARG                TO BU-DISPLAY-FLD (2)
                   GO TO 2100-BLOWUP.
           ADD 1  TO  DESC-SUB.
           IF DESC-SUB > 7
               READ DREQDESC-I PRIOR INTO BUF-DREQDESC
               IF FILE-STATUS NOT = "00"
                   MOVE "READ PRIOR DREQDESC * 661-LDL"
                       TO BU-DISPLAY-MSG
                   MOVE REQ-ARG TO BU-DISPLAY-FLD (2)
                   GO TO 2100-BLOWUP
               ELSE
      *             "MORE DESCRIPTION PRESS 'f2' TO VIEW"
                   MOVE  13 TO LANG-SETNUM
                   MOVE  33 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE2-MORE-DESC-MSG
                                          DE2-MORE-DESC-MSG-L
                   GO TO 661-LRD-X.

      *********************************************************
      **   REQ. REMARKS ARE LINE NOS '95' AND '96' IF THEY
      **   ARE FOUND DONT PRINT THEM IN THE DESCRIPTION SCREEN
      **   BLOCK INSTEAD EXIT ROUTINE SINCE REMARKS ARE LAST
      **   THERES NO MORE DESC. AFTER REMARK LINES IN 'DREQDESC'
      *********************************************************

           IF REQDESC-LINE-NO = "95" OR "96"
               MOVE "Y"                 TO  END-OF-REQ-DESC-SW
               GO TO 661-LRD-X
           ELSE
               MOVE REQDESC-DATA        TO  DE2-DESC (DESC-SUB)
                                            DE2-DESC-L (DESC-SUB)
               GO TO 661-LOAD-DESC-LOOP.

       661-LRD-X.
           EXIT.

       661-LOAD-REQ-ITEM.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DREQITM-REC-I.
           START DREQITM-I KEY = REQNO OF DREQITM-REC-I
               INVALID KEY MOVE 0 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS  = "23"
                   MOVE 0 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
      *    CALL "DBFIND" USING BASE, DSET-DREQITM, MODE1,
      *        STATUS-AREA, REQ-SEARCH, REQ-ARG.
           IF COND-WORD NOT =  0
               MOVE "FIND DREQITM * 661-LRI"  TO  BU-DISPLAY-MSG
               MOVE REQ-ARG               TO  BU-DISPLAY-FLD (2)
               GO TO 2100-BLOWUP.

           MOVE 0 TO COND-WORD.
           READ DREQITM-I NEXT INTO BUF-DREQITM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF REQNO OF DREQITM-REC-I NOT = REQ-ARG
               MOVE 15 TO COND-WORD.
      *    CALL "DBGET" USING BASE, DSET-DREQITM, MODE5,
      *        STATUS-AREA, ALL-ITEMS, BUF-DREQITM, REQ-ARG.
           IF COND-WORD NOT = 0
               IF COND-WORD = 15
      *            "NO ITEM ON REQ- ERROR CONTACT AKRON"
                   MOVE  14 TO LANG-SETNUM
                   MOVE   9 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO MSG-TEXT
                   MOVE DE2-REQ-NO  TO  MSG-FLD
                   MOVE MESSAGE-BUFFER TO DE2-MESSAGE-LINE
                                          DE2-MESSAGE-LINE-L
                   MOVE "Y"         TO  ERR-SW
                   MOVE 12          TO  FIELD-NUMBER
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   GO TO 661-LRI-X
               ELSE
                   MOVE "GET DREQITM * 661-LRI" TO BU-DISPLAY-MSG
                   MOVE REQ-ARG                 TO BU-DISPLAY-FLD (2)
                   GO TO 2100-BLOWUP.

           IF REQITM-CORP-CODE = "NON-STR"
               MOVE "NC"                TO  DS2-CODE
                                            DS2-CODE-L
           ELSE
               MOVE REQITM-CORP-CODE    TO  DS2-CODE,
                                            DS2-CODE-L,
                                            CODE-ARG
               IF PO-REL = "999"
                   PERFORM 669-CHECK-DUPLICATES THRU 669-CD-X
                   IF CODE-DUP-SW = "Y"
                       MOVE SPACES      TO  DS2-CODE
                                            DS2-CODE-L
                       GO TO 661-LRI-X.
           MOVE REQITM-QTY-TO-ORD       TO  DE2-QTY
                                            DE2-QTY-L.
           MOVE REQITM-UM               TO  DE2-QTY-UM
                                            DE2-QTY-UM-L,
                                            DE2-PRICE-UM,
                                            DE2-PRICE-UM-L.
           MOVE REQ-CO                  TO  DE2-COMPANY-L.
           MOVE REQ-PRIME               TO  DE2-PRIME-L.
           MOVE REQ-SUB                 TO  DE2-SUB,
                                            DE2-SUB-L.
           MOVE REQ-SUBD                TO  DE2-SUB-DETL,
                                            DE2-SUB-DETL-L
                                            REQ-SUBD-SAVE.
           MOVE REQ-ADDTL-DATA          TO  DE2-ADDTDATA,
                                            DE2-ADDTDATA-L.
           IF REQITM-CORP-CODE = "NON-STR"
      *-----  DEFAULT TAX-CODE FROM DREQITM IF ENTERED

               IF REQITM-TAX-CODE NOT = SPACES
                  MOVE REQITM-TAX-CODE  TO  DE2-TAX-CODE
                                            DE2-TAX-CODE-L
               ELSE
                  MOVE SAVE-TAX-CODE    TO  DE2-TAX-CODE
                                            DE2-TAX-CODE-L
           ELSE
               PERFORM 67-GET-TAX-CODE  THRU  67-GTC-X
               PERFORM 67-GET-LAST-PRICE  THRU  67-GLP-X
               PERFORM 67-GET-ONE-MANUFACTURER  THRU  67-GOM-X.

      ***********************************************************
      *    ADDED A SPECIAL CHECK FOR NAPANEE 12/04/95 DUE TO
      *    A PROBLEM THEY UNCOVERED WHEREBY SOME OF THEIR
      *    STOREROOM CODES WERE GETTING INPUT ON REQUISITIONS
      *    PROCESSED FROM WORK ORDERS BUT DID NOT CONTAIN AN
      *    EXPENSE CLASS AND WERE BEING TREATED AS STOREROOM
      *    ITEMS INSTEAD OF DIRECT DELIVERIES.....J.E. COFFMAN
      ***********************************************************
           IF REQITM-CORP-CODE = "NON-STR"
               NEXT SENTENCE
           ELSE
           IF REQ-CO = "631"
               IF REQ-SUBD = "1210"
                   MOVE "000000"        TO  DE2-ADDTDATA,
                                            DE2-ADDTDATA-L
               ELSE
               IF REQ-SUBD = "0000"
                   NEXT SENTENCE
               ELSE
               MOVE STR-EXPENSE-CLASS   TO  DE2-ADDTDATA,
                                            DE2-ADDTDATA-L.
       661-LRI-X.
           EXIT.

       669-CHECK-DUPLICATES.
           MOVE "N" TO CODE-DUP-SW.
           MOVE CODE-ARG TO CORPCDE OF DPOITEM-REC-L1.
           START DPOITEM-L1 KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00" GO TO 669-CD-X.
       669-CD-LOOP.
           READ DPOITEM-L1 NEXT INTO BUF-DPOITEM
               AT END    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00" GO TO 669-CD-X.
           IF CODE-ARG NOT = ITM-CORP-CODE GO TO 669-CD-X.
           IF ITM-PO-RCV-NO = PO-ARG
               MOVE "Y" TO CODE-DUP-SW
           ELSE
           GO TO 669-CD-LOOP.
       669-CD-X.    EXIT.

       67-GET-TAX-CODE.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC-I.
           READ MSTORERM-I INTO BUF-MSTORERM
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
      *    CALL "DBGET" USING BASE, DSET-MSTORERM, MODE7,
      *        STATUS-AREA, ALL-ITEMS, BUF-MSTORERM, CODE-ARG.
           IF COND-WORD NOT = ZERO
               MOVE "GET MSTORERM * 67-GTC" TO BU-DISPLAY-MSG
               MOVE CODE-ARG                TO BU-DISPLAY-FLD (2)
               GO TO 2100-BLOWUP.

           MOVE STR-STD-INST          TO  DE2-STD-INST-TABLE
                                          DE2-STD-INST-TABLE-L.
           MOVE STR-RCV-STD-INST      TO  DE2-RCV-INST-TABLE
                                          DE2-RCV-INST-TABLE-L.

      *-----  DEFAULT TAX-CODE FROM DREQITM IF ENTERED

           IF REQITM-TAX-CODE NOT = SPACES
              MOVE REQITM-TAX-CODE    TO DE2-TAX-CODE
                                         DE2-TAX-CODE-L
              GO TO 67-GTC-X.

           MOVE STR-TAX-CODE          TO  TAX-ARG.
           MOVE 0 TO COND-WORD.
           MOVE TAX-ARG               TO TAXCDE OF MTAX-REC-I.
           READ MTAX-I INTO BUF-MTAX
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
      *    CALL "DBGET" USING BASE, DSET-MTAX, MODE7,
      *        STATUS-AREA, ALL-ITEMS, BUF-MTAX, TAX-ARG.
           IF COND-WORD NOT = 0
               IF COND-WORD = 17
                   MOVE SAVE-TAX-CODE  TO  DE2-TAX-CODE
                                           DE2-TAX-CODE-L
               ELSE
                   MOVE "GET MTAX * 66-GTC" TO BU-DISPLAY-MSG
                   MOVE TAX-ARG TO  BU-DISPLAY-FLD (2)
                   GO TO 2100-BLOWUP
           ELSE
               MOVE STR-TAX-CODE      TO  DE2-TAX-CODE
                                          DE2-TAX-CODE-L.

       67-GTC-X.
           EXIT.

       67-GET-LAST-PRICE.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DVENDITM-REC-I.
           START DVENDITM-I KEY = CORPCDE OF DVENDITM-REC-I
               INVALID KEY MOVE 0 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "23"
                   MOVE 0 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
      *    CALL "DBFIND" USING BASE, DSET-DVENDITM, MODE1,
      *        STATUS-AREA, CODE-SEARCH, CODE-ARG.
           IF COND-WORD NOT = ZERO
               MOVE "FIND DVENDITM * 67-GLP"  TO  BU-DISPLAY-MSG
               MOVE CODE-ARG                  TO  BU-DISPLAY-FLD (2)
               GO TO 2100-BLOWUP.

           MOVE ZEROS                   TO DE2-PRICE
                                           DE2-PRICE-L.

      *********************************************************
      **   RULES FOR GETTING A LAST PO PRICE                 **
      **    - USE THE LAST ACTIVE QUOTE PRICE (AN ACTIVE     **
      **       QUOTE IS A QUOTE THAT HAS REACHED ITS         **
      **       EFFECTIVE DATE (VEN-CREATE-DATE) AND HAS NOT  **
      **       EXPIRED YET (VEN-ITM-PRICE-DATE)              **
      **    - IF NOT ACTIVE QUOTE EXIST THEN USE FIRST       **
      **      PO PRICE OR NON-ACTIVE QUOTE FOUND THAT HAS    **
      **      A PRICE                                        **
      *********************************************************

       67-GET-DVENDITM.
           MOVE 0 TO COND-WORD.
           READ DVENDITM-I NEXT INTO BUF-DVENDITM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF CORPCDE OF DVENDITM-REC-I NOT = CODE-ARG
               MOVE 15 TO COND-WORD.
      *    CALL "DBGET" USING BASE, DSET-DVENDITM, MODE5,
      *        STATUS-AREA, ALL-ITEMS, BUF-DVENDITM, CODE-ARG.
           IF COND-WORD = ZERO
               IF VEN-ITM-VENCODE = VEN-ARG
                   IF VEN-QUOTE-FLAG = "Q"
      *--------------------- ACCOUNT FOR CENTURY.
                       IF VEN-CREATE-DATE-CN = SPACES  OR
                          VEN-ITM-PRICE = ZEROS
                           NEXT SENTENCE
                       ELSE
                       IF VEN-CREATE-DATE-CN > CUR-DATE-CN  OR
                          VEN-ITM-PRICE-DATE-CN < CUR-DATE-CN
                          IF DE2-PRICE = ZEROS
                              PERFORM 671-LOAD-QUOTE-PRICE
                          ELSE
                              NEXT SENTENCE
                       ELSE
                           PERFORM 671-LOAD-QUOTE-PRICE
                   ELSE
                       IF DE2-PRICE = ZEROS
                           PERFORM 671-LOAD-QUOTE-PRICE
                       ELSE
                           NEXT SENTENCE
               ELSE
                   NEXT SENTENCE
           ELSE
               IF COND-WORD = 15
                   GO TO 67-GLP-X
               ELSE
                   MOVE "GET DVENDITM * 671-GD" TO BU-DISPLAY-MSG
                   MOVE CODE-ARG                TO BU-DISPLAY-FLD (2)
                   GO TO 2100-BLOWUP.

           GO TO 67-GET-DVENDITM.

       67-GLP-X.
           EXIT.

       67-GET-ONE-MANUFACTURER.
           MOVE SAVE-MANUFACT-LIT       TO  DE2-MANUFACTUR-LIT
                                            DE2-MANUFACTUR-LIT-L.
           MOVE "M"                     TO  CDESC-DESC-OPTION.
           MOVE "S"                     TO  CDESC-MANUFACT-OPTION.
           CALL "CDESC" USING RET-CODE,
                              BASE,
                              STATUS-AREA,
                              BU-DISPLAY-MSG,
                              CODE-ARG,
                              CDESC-DATA.
           IF BU-DISPLAY-MSG-1  NOT = SPACES
               MOVE CODE-ARG            TO  BU-DISPLAY-FLD (2)
               GO TO 2100-BLOWUP.

           IF CDESC-LINES-GOT > 0
               MOVE CDESC (1)           TO  DE2-MANUFACTUR-SELECT
                                            DE2-MANUFACTUR-SELECT-L.

       67-GOM-X.
           EXIT.

       67-GET-VENDOR-ADDRESS.
           MOVE 0 TO COND-WORD.
           MOVE VEN-ARG TO VENCDE OF DVENDOR-REC-I.
           START DVENDOR-I KEY = VENCDE OF DVENDOR-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
      *    CALL "DBFIND" USING BASE, DSET-DVENDOR, MODE1,
      *        STATUS-AREA, VEN-SEARCH, VEN-ARG.
           IF COND-WORD NOT = 0
               IF COND-WORD = 17
                   GO TO 67-GVA-X
               ELSE
                   MOVE "FIND DVENDOR * 67-GVA" TO BU-DISPLAY-MSG
                   MOVE VEN-ARG             TO BU-DISPLAY-FLD (2)
                   GO TO 2100-BLOWUP.

      *    IF CHAIN-LENG = ZEROS
      *        GO TO 67-GVA-X.

           MOVE VEN-ARG                 TO  DE2-MORE-DESC-MSG
                                            DE2-MORE-DESC-MSG-L.
      **  VENDOR VERIFICATION
           MOVE  22                     TO  LANG-SETNUM.
           MOVE  19                     TO  LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO  DE2-DESC-LIT
                                            DE2-DESC-LIT-L.
      **  VERIFY VENDOR IS CORRECT; PRESS 'f1' IF VENDOR IS INCORRECT
           MOVE  22                     TO  LANG-SETNUM.
           MOVE  20                     TO  LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER          TO  DE2-DESC (7)
                                            DE2-DESC-L (7).

           MOVE ZERO                    TO  SUB.

       67-GET-DVENDOR.
           MOVE 0 TO COND-WORD.
           READ DVENDOR-I NEXT INTO BUF-DVENDOR
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF VENCDE OF DVENDOR-REC-I NOT = VEN-ARG
               MOVE 15 TO COND-WORD.
      *    CALL "DBGET" USING BASE, DSET-DVENDOR, MODE5,
      *        STATUS-AREA, ALL-ITEMS, BUF-DVENDOR, VEN-ARG.
           IF COND-WORD NOT = 0
               IF COND-WORD = 15
                   GO TO 67-GVA-X
               ELSE
                   MOVE "GET DVENDOR *67-GD" TO BU-DISPLAY-MSG
                   MOVE VEN-ARG         TO  BU-DISPLAY-FLD (2)
                   GO TO 2100-BLOWUP.

           ADD 1   TO  SUB.
           IF SUB > 5
               GO TO 67-GVA-X.
           IF VEN-ITM-NO > 07
               GO TO 67-GVA-X
           ELSE
           IF VEN-ITM-NO = 07
               MOVE SPACES              TO  VEN-ZIP-BEFORE-CITY
               MOVE VEN-ITM-DATA        TO  DE2-DESC (SUB)
                                            DE2-DESC-L (SUB)
           ELSE
               MOVE VEN-ITM-DATA        TO  DE2-DESC (SUB)
                                            DE2-DESC-L (SUB).

           GO TO 67-GET-DVENDOR.

       67-GVA-X.
           EXIT.

       671-LOAD-QUOTE-PRICE.
           MOVE VEN-ITM-PRICE-UM        TO DE2-PRICE-UM
                                           DE2-PRICE-UM-L.

      *---------- CHECK FOR NON-NUMERIC DATA.
           IF VEN-DSCT IS NOT NUMERIC
               MOVE ZEROS TO VEN-DISCOUNT-PERCENT.

           IF VEN-DISCOUNT-PERCENT = ZEROS
               MOVE VEN-ITM-PRICE       TO DE2-PRICE
                                           DE2-PRICE-L
               MOVE SPACES              TO DE2-DISCOUNT-AREA
                                           DE2-DISCOUNT-AREA-L
           ELSE
               COMPUTE DISCOUNT-PERCENT ROUNDED =
                   VEN-DISCOUNT-PERCENT / 100
               COMPUTE DISCOUNT-PRICE ROUNDED = VEN-ITM-PRICE -
                   (VEN-ITM-PRICE * DISCOUNT-PERCENT)
               MOVE DISCOUNT-PRICE      TO DE2-PRICE
                                           DE2-PRICE-L
               MOVE VEN-ITM-PRICE       TO DIS-PRE-PRICE
               MOVE VEN-DISCOUNT-PERCENT TO DIS-DISCOUNT-PERCENT
               IF DIS-PRICE-LIT = SPACES
      **          PRE-DISCOUNT PRICE
                   MOVE  16             TO  LANG-SETNUM
                   MOVE  133            TO  LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER  TO  DIS-PRICE-LIT
                   MOVE DISCOUNT-PRICE-DIS-LIT TO  DE2-DISCOUNT-AREA
                                                   DE2-DISCOUNT-AREA-L
               ELSE
                   MOVE DISCOUNT-PRICE-DIS-LIT TO  DE2-DISCOUNT-AREA
                                                   DE2-DISCOUNT-AREA-L.


       COPY DISPCALL IN COPYLIB.

       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.

       9000-START-MVALIDPLTDATA-I.
           MOVE 0 TO COND-WORD.
           MOVE MVALIDPLT-ARG TO VALDTAKEY OF MVALIDPLTDATA-REC-I.
           START MVALIDPLTDATA-I KEY = VALDTAKEY OF MVALIDPLTDATA-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9000-START-MCLASS-I.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO ACTGCLASS OF MCLASS-REC-I.
           START MCLASS-I KEY = ACTGCLASS OF MCLASS-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-GETKEY-MPLTINFO-PK-I.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-I.
           READ MPLTINFO-PK-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MPLTINFO-PK-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

