000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          SALTKEYS.
000400 AUTHOR.              C HILLES.
000500 DATE-WRITTEN.        3/4/88.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*D   ALTERNATE KEY SUBPROGRAM: ADD, MODIFY, AND DELETE OF ALT
001100*D   KEYS TO DATASET 'MALTKEY'. THIS PROVIDES A CROSS-REFERENCE
001200*D   TO MSTORERM.  THE USERS CAN MAKE UP ANY NAME THEY LIKE FOR
001300*D   A CORPORATE CODE AND ENTER IT HERE.  THEN, THEY CAN PUT
001400*D   THE ALTERNATE NAME IN THE MATERIAL STATUS INQUIRY TO FIND
001500*D   THE CORPORATE CODE.  THIS IS USEFUL FOR RAW MATERIALS,
001600*D   BLADDERS, ETC.
      *C
      *C   09/12/96  JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   RECOMPILE TO PICK UP COPYLIB CHANGES.
001700
001800
001900 ENVIRONMENT DIVISION.
002000 CONFIGURATION SECTION.
002100 SOURCE-COMPUTER.  HP-3000.
002200 OBJECT-COMPUTER.  HP-3000.
       COPY SPECIALN IN COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MALTKEY-CA-O
               ASSIGN TO DATABASE-MCFLCS3001
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-CD-I
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZALTMAIN-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DISPLAY-STATUS
               CONTROL-AREA IS WS-CONTROL.
002300
002400 DATA DIVISION.
       FILE SECTION.
      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       FD  MALTKEY-CA-O
           LABEL RECORDS ARE STANDARD.
       01  MALTKEY-CA-REC-O.
           COPY DDS-MCRPCS3000  OF MCFLCS3001.

       FD  MSTORERM-CD-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-CD-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC        PIC X(1500).

      *------ FD STATEMENT AREA FOR IBM ONLY ------*
002500 WORKING-STORAGE SECTION.
002600
002700**************************************************************
002800**                                                          **
002900**                S U B P R O G R A M   A R E A S           **
003000**                                                          **
003100**************************************************************
003200
003300 COPY TBLOWUP    IN COPYLIB.
003400 COPY CSWITCHF   IN COPYLIB.
       COPY DISPDAT2   IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.
       COPY CATREAD    IN COPYLIB.
003500 01  FORMFILE                      PIC X(31) VALUE "FALTMAIN".
003600
003700**************************************************************
003800**                                                          **
003900**                  V I E W   W O R K                       **
004000**                                                          **
004100**************************************************************
004200
004300**  SEE LINKAGE SECTION FOR VIEW-COMAREA
004400
004500 01  MESSAGE-BUFFER.
004600     05  MSG-TEXT.
               10  MESSAGE-BUFFER-1        PIC X(1)  VALUE SPACES.
               10  FILLER                  PIC X(67) VALUE SPACES.
004700     05  MSG-FLD                     PIC X(8)   VALUE SPACES.
004800     05  MSG-FLD-9 REDEFINES MSG-FLD PIC ZZZZZZZ9.
004900
005000 01  MSG-BUFFLEN          PIC S9(4)  BINARY VALUE 76.
005100 01  MSG-ACTUALEN         PIC S9(4)  BINARY VALUE 76.
005200
005300 01  FIELD-NUMBER         PIC S9(4) BINARY VALUE 1.
005400
005500**************************************************************
005600**                                                          **
005700**            D A T A B A S E   W O R K                     **
005800**                                                          **
005900**************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
006000
006100 COPY DBSTAT     IN COPYLIB.
006200 01  DSET-NAMES.
006300     05  DSET-MALTKEY              PIC X(16) VALUE "MALTKEY;".
006400     05  DSET-MSTORERM             PIC X(16) VALUE "MSTORERM;".
006500
006600 01  MODE-AREA.
006700     05  MODE1                     PIC S9(4)   COMP       VALUE 1.
006800     05  MODE3                     PIC S9(4)   COMP       VALUE 3.
006900     05  MODE5                     PIC S9(4)   COMP       VALUE 5.
007000     05  MODE7                     PIC S9(4)   COMP       VALUE 7.
007100
007200 01  ALL-ITEMS                     PIC X(2)  VALUE "@;".
007300 01  LEVEL-SEARCH                  PIC X(10) VALUE "LEVEL-NUM;".
007400 01  MALTKEY-ARG                   PIC X(40).
007500 01  CODE-ARG                      PIC X(8).
007600
007700**************************************************************
007800**                                                          **
007900**           D A T A B A S E   B U F F E R S                **
008000**                                                          **
008100**************************************************************
008200
008300 COPY MALTKEY    IN COPYLIB.
008400 COPY MSTORERM   IN COPYLIB.
008500
008600**************************************************************
008700**                                                          **
008800**                  S C R E E N   D A T A                   **
008900**                                                          **
009000**************************************************************
009100
009200 01  DE-FIELDS.
009300     05  DE-ALT-KEY                PIC X(12).
009400     05  DE-CORP-CODE              PIC X(7).
           05  DE-COMMAND-LINE           PIC X(79).
           05  DE-MESSAGE-LINE           PIC X(79).
009500
009600**************************************************************
009700**                                                          **
009800**            L I N K A G E   S E C T I O N                 **
009900**                                                          **
010000**************************************************************
010100
010200 LINKAGE SECTION.
010300 01  BASE                      PIC X(10).
010400
010500 COPY VCOMLINK   IN COPYLIB.
010600 COPY TSHWSUB    IN COPYLIB.
010700 COPY LANGSUB    IN COPYLIB.
010800
010900 PROCEDURE DIVISION USING BASE
011000                          VIEW-COMAREA,
011100                          SRF-COMAREA,
011200                          LANGUAGE-PARMS.
011300
011400 1-HSK.
           PERFORM 9999-OPEN-STUFF.
011500     PERFORM 6000-MAIN THRU 6990-MAIN-X.
           PERFORM 9999-CLOSE-STUFF.
011600     GOBACK.
011700
011800 2100-BLOWUP.
011900     MOVE "SALTKEYS"               TO   BU-PGM-NAME.
012000     CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
012100       VIEW-COMAREA FILE-STATUS BU-DISPLAY-MSG
012200       BU-DISPLAY-FLDS.
012300
017400******************************************************************
017500**                                                              **
017600**          L E V E L   M A I N   M E N U                       **
017700**                                                              **
017800******************************************************************
017900 6000-MAIN.
018000     MOVE "FALTMENU"               TO   VIEW-NFNAME.
018100     PERFORM 9951-GETNEXTFORM.
018200     PERFORM 9955-CLEAR-FORM.
018300
018400 6010-SHOW-MENU.
018500     MOVE 1                        TO   SRF-KEYSET.
018600     MOVE "I"                      TO   SRF-FKEY (6),
018700                                        SRF-FKEY (7).
018800     MOVE "N"                      TO   SRF-ENTER-FLAG.
           MOVE DE-FIELDS TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           MOVE DISPLAY-REC TO DE-FIELDS.
           IF MESSAGE-BUFFER-1 NOT = SPACES
               PERFORM 9954-SETERROR
               GO TO 6010-SHOW-MENU.

019400
019500     IF VIEW-LASTKEY = 3
019600         GO TO 6990-MAIN-X.
019700
019800     IF VIEW-LASTKEY = 1
019900         PERFORM 6300-ADD THRU 6390-A-X
020000     ELSE
020100     IF VIEW-LASTKEY = 2
020200         PERFORM 6500-DEL THRU 6590-D-X
020300     ELSE
020400     IF VIEW-LASTKEY = 8
020500         MOVE "N"                  TO   CSF-MODE
020600         MOVE "FCSISINQ"           TO   CSF-NEW-FORMFILE-NAME
020700         PERFORM 7150-CALL-CSWITCHF
020800         IF CSF-OPENFORM-ERR-SW = "Y"
020900             GO TO 6010-SHOW-MENU
021000         ELSE
021100             MOVE SPACES           TO   CODE-ARG
021200             CALL "TMTLSTAT" USING BASE, VIEW-COMAREA,
021300               SRF-MPLTINFO-COMPANY, SRF-SPOOL-PRT-NO,
021400               CODE-ARG, LANGUAGE-PARMS
021500             MOVE "O"              TO   CSF-MODE
021600             PERFORM 7150-CALL-CSWITCHF
021700             GO TO 6000-MAIN.
021800
021900     IF VIEW-LASTKEY = 8
022000         GO TO 6990-MAIN-X.
022100
022200     GO TO 6000-MAIN.
022300
022400******************************************************************
022500**                                                              **
022600**       A D D   L E V E L                                      **
022700**                                                              **
022800******************************************************************
022900 6300-ADD.
023000     MOVE "FALTADD"                TO   VIEW-NFNAME.
023100     PERFORM 9951-GETNEXTFORM.
023200     PERFORM 9955-CLEAR-FORM.
023300
023400 6310-SHOW-ADD-FORM.
023500     MOVE 8                        TO   SRF-KEYSET.
           MOVE DE-FIELDS TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           MOVE DISPLAY-REC TO DE-FIELDS.
           IF MESSAGE-BUFFER-1 NOT = SPACES
               PERFORM 9954-SETERROR
               GO TO 6310-SHOW-ADD-FORM.

024200     IF VIEW-LASTKEY = 3 OR 8
024300         GO TO 6390-A-X.
024400
024500     PERFORM 9952-GETBUFFER.

           MOVE DE-ALT-KEY TO MALTKEY-ARG.
           MOVE DE-CORP-CODE TO CODE-ARG.
024600
024700*------ CORP CODE MUST EXIST, AND ALTERNATE KEY MUST NOT ALREADY
024800*------ EXIST.
024900
025000     PERFORM 9999-DBGET7-MSTORERM-CD-I.
025100     IF NO-ENTRY
025200*        "E45: ENTRY DOES NOT EXIST"
025300         MOVE  5                   TO   LANG-SETNUM
025400         MOVE 45                   TO   LANG-MSGNUM
025500         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
025600         MOVE 2                    TO   FIELD-NUMBER
025700         PERFORM 9954-SETERROR
025800         GO TO 6310-SHOW-ADD-FORM.
025900
026000     PERFORM 9999-DBGET7-MALTKEY-CA-O.
           PERFORM 9999-RESET-MALTKEY-CA-O.
026100     IF GOOD-CALL
026200*        "E44: ENTRY ALREADY EXISTS"
026300         MOVE   5                  TO   LANG-SETNUM
026400         MOVE  44                  TO   LANG-MSGNUM
026500         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
026600         MOVE 1                    TO   FIELD-NUMBER
026700         PERFORM 9954-SETERROR
026800         GO TO 6310-SHOW-ADD-FORM.
026900
027000     PERFORM 7030-MOVE-TO-DB.
027100
027200     PERFORM 9930-LOCK.
027300
           PERFORM 9999-DBPUT-MALTKEY-CA-O.
027900
028000     PERFORM 9940-UNLOCK.
028100     PERFORM 9955-CLEAR-FORM.
028200     GO TO 6310-SHOW-ADD-FORM.
028300
028400 6390-A-X.
028500     EXIT.
028600
028700******************************************************************
028800**                                                              **
028900**      D E L E T E   A L T E R N A T E   K E Y                 **
029000**                                                              **
029100******************************************************************
029200 6500-DEL.
029300 6505-DEL-GETFORM-1.
029400     MOVE "FALTDEL"                TO   VIEW-NFNAME.
029500     PERFORM 9951-GETNEXTFORM.
029600     PERFORM 9955-CLEAR-FORM.
029700
029800 6510-SHOW-MOD-FORM-1.
029900     MOVE 8                        TO   SRF-KEYSET.
           MOVE DE-FIELDS TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           MOVE DISPLAY-REC TO DE-FIELDS.
           IF MESSAGE-BUFFER-1 NOT = SPACES
               PERFORM 9954-SETERROR
               GO TO 6510-SHOW-MOD-FORM-1.
030500
030600     IF VIEW-LASTKEY = 3 OR 8
030700         GO TO 6590-D-X.
030800
030900     PERFORM 9952-GETBUFFER.
031000
           MOVE DE-ALT-KEY TO MALTKEY-ARG.
           MOVE DE-CORP-CODE TO CODE-ARG.

031100     PERFORM 9999-DBGET7-MALTKEY-CA-O.
031200     IF NO-ENTRY
031300*        "E45: ENTRY DOES NOT EXIST"
031400         MOVE  5                   TO   LANG-SETNUM
031500         MOVE 45                   TO   LANG-MSGNUM
031600         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
031700         PERFORM 9954-SETERROR
031800         MOVE 1                    TO   FIELD-NUMBER
               PERFORM 9999-RESET-MALTKEY-CA-O
031900         GO TO 6510-SHOW-MOD-FORM-1.
032000
032100     PERFORM 9930-LOCK.
032200
           PERFORM 9999-DBDELETE-MALTKEY-CA-O.

032900     PERFORM 9940-UNLOCK.
033000
033100     GO TO 6505-DEL-GETFORM-1.
033200
033300 6590-D-X.
033400     EXIT.
033500
033600 6990-MAIN-X.
033700     EXIT.
033800
033900******************************************************************
034000**                                                              **
034100**      P E R F O R M E D   R O U T I N E S                     **
034200**                                                              **
034300******************************************************************
037700 7030-MOVE-TO-DB.
037800     MOVE DE-CORP-CODE             TO   ALT-CORP-CODE.
037900     MOVE DE-ALT-KEY               TO   CORPCODE-ALT-KEY.
038000
038100 7150-CALL-CSWITCHF.
038200     CALL "CSWITCHF" USING VIEW-COMAREA, LANGUAGE-PARMS,
038300       FORMFILE, CSF-PARMS, BU-DISPLAY-MSG.
038400     IF BU-DISPLAY-MSG-1 NOT = SPACES
038500         PERFORM 2100-BLOWUP.
038600
       COPY DISPCALL IN COPYLIB.
       COPY DISPCAL2 IN COPYLIB.
       COPY HCATREAD IN COPYLIB.

       9930-LOCK.
       9940-UNLOCK.
       9951-GETNEXTFORM.
       9952-GETBUFFER.
       9953-PUTBUFFER.
       9954-SETERROR.
           MOVE B"1" TO IND (99).
           MOVE B"1" TO IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE.

       9955-CLEAR-FORM.
           MOVE SPACES TO DE-FIELDS, MESSAGE-BUFFER.

       9956-PUTWINDOW.
       9957-FIELDEDITS.
       9958-INITFORM.
       9959-SHOWFORM.
       9960-SETKEYLABEL.
       9961-AUTOREAD.
       9962-OPENFORM.
       9963-CLOSEFORM.
       9964-FINISHFORM.

       9999-DBGET7-MALTKEY-CA-O.
           MOVE 0 TO COND-WORD.
           MOVE MALTKEY-ARG TO CORPALTKEY OF MALTKEY-CA-REC-O.
           READ MALTKEY-CA-O INTO BUF-MALTKEY
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET7 ERR 9999-DBGET7-MALTKEY-CA-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-RESET-MALTKEY-CA-O.
           MOVE HIGH-VALUES TO CORPALTKEY OF MALTKEY-CA-REC-O.
           START MALTKEY-CA-O KEY > CORPALTKEY OF MALTKEY-CA-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-DBPUT-MALTKEY-CA-O.
           MOVE 0 TO COND-WORD.
           WRITE MALTKEY-CA-REC-O FROM BUF-MALTKEY
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBPUT ERR 9999-DBPUT-MALTKEY-CA-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBDELETE-MALTKEY-CA-O.
           MOVE 0 TO COND-WORD.
           DELETE MALTKEY-CA-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBGET7-MSTORERM-CD-I.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-CD-REC-I.
           READ MSTORERM-CD-I INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET7 ERR 9999-DBGET7-MSTORERM-CD-I"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-OPEN-STUFF.
           OPEN I-O DISPLAY-FILE.
           OPEN INPUT MSTORERM-CD-I                              .
           OPEN I-O   MALTKEY-CA-O                               .

       9999-CLOSE-STUFF.
           CLOSE DISPLAY-FILE.
           CLOSE      MALTKEY-CA-O          MSTORERM-CD-I        .
