000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.     SALTVDEL.
000400 AUTHOR.         W.L.MCINTYRE.
000500 DATE-WRITTEN.   5/08/95.
000600 DATE-COMPILED.
000700 INSTALLATION.   THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
000800*REMARKS.
000900*D   THIS SUBPROGRAM DELETES ALL ENTRIES FROM THE CSIS VENDOR
001000*D   ALTERNATE KEY FILE FOR A VENDOR CODE.  THIS SUBROUTINE
001100*D   SHOULD BE CALLED WHENEVER A VENDOR CODE IS DELETED FROM
001200*D   THE VENDOR FILE.
001400
001500 ENVIRONMENT DIVISION.
001600 CONFIGURATION SECTION.
001700 SOURCE-COMPUTER.  HP-3000.
001800 OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MALTVEN
               ASSIGN TO DATABASE-MCFLCS5801
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
               FILE STATUS IS FILE-STAT.
           SELECT MALTVEN-INPUT
               ASSIGN TO DATABASE-MCFLCS5801
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
               FILE STATUS IS FILE-STAT.


       DATA DIVISION.
       FILE SECTION.
       FD  MALTVEN
           LABEL RECORDS ARE STANDARD.
       01  MALTVEN-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS5801.
       FD  MALTVEN-INPUT
           LABEL RECORDS ARE STANDARD.
       01  MALTVEN-INPUT-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS5801.

002100 WORKING-STORAGE SECTION.
002200
002300 77  FILE-STAT            PIC X(02)  VALUE SPACES.
       77  ALTKEY-EXISTS        PIC X(01)  VALUE "N".
       77  BEGIN-VENDCODE-ALT-KEY  PIC X(10)  VALUE SPACES.

       COPY MALTVEN IN COPYLIB.
005500
005600 COPY DBMODES IN COPYLIB.
005700 COPY DBSTAT  IN COPYLIB.
005800
005900 LINKAGE SECTION.
006100 01  VEN-CODE             PIC X(10).
006300 01  BU-DISPLAY-MSG       PIC X(60).
006400 01  BU-DISPLAY-FLDS.
006500     05  BU-DISPLAY-LINE OCCURS 5 TIMES.
006600         10  BU-DISPLAY-FLD  PIC X(14).
006700         10  BU-DISPLAY-FLD9 PIC S9(8).
006800
006900 PROCEDURE DIVISION USING VEN-CODE
007200                          BU-DISPLAY-MSG
007300                          BU-DISPLAY-FLDS.
007400
007500 6-MAIN.
           OPEN I-O MALTVEN.
           OPEN INPUT MALTVEN-INPUT.

008400     PERFORM DELETE-CODE THRU DELETE-CODE-EXIT.

           CLOSE MALTVEN
                 MALTVEN-INPUT.
009300     GOBACK.
009400
016700 DELETE-CODE.
           MOVE SPACES TO VENCALTKEY OF MALTVEN.
           START MALTVEN KEY NOT < VENCALTKEY OF MALTVEN
               INVALID KEY MOVE FILE-STAT TO FILE-STAT.
017000     IF FILE-STAT NOT = "00"
017800         GO TO DELETE-CODE-EXIT.
017900 DELETE-LOOP.
           READ MALTVEN NEXT INTO BUF-MALTVEN
               AT END MOVE FILE-STAT TO FILE-STAT.
018200     IF FILE-STAT = "10" OR "14" OR "46"
018300         GO TO DELETE-CODE-EXIT
018400     ELSE IF FILE-STAT NOT = "00"
018500         MOVE "READ ERROR MALTVEN, DELETE-CODE"
018600            TO BU-DISPLAY-MSG
018700         MOVE "SALTVDEL" TO BU-DISPLAY-FLD (2)
018800         MOVE FILE-STAT TO BU-DISPLAY-FLD (3)
018900         MOVE VEN-CODE TO BU-DISPLAY-FLD (4)
019000         GO TO DELETE-CODE-EXIT.
           IF ALT-VENDOR-CODE NOT = VEN-CODE
               GO TO DELETE-LOOP.
           DELETE MALTVEN
               INVALID KEY MOVE FILE-STAT TO FILE-STAT.
019200     IF FILE-STAT NOT = "00"
019300         MOVE "DELETE ERROR MALTVEN, DELETE-CODE"
019400              TO BU-DISPLAY-MSG
019500         MOVE "SALTVDEL" TO BU-DISPLAY-FLD (2)
019600         MOVE FILE-STAT TO BU-DISPLAY-FLD (3)
019700         MOVE VEN-CODE TO BU-DISPLAY-FLD (4)
019800         MOVE BUF-MALTVEN TO BU-DISPLAY-FLD (5)
019900         GO TO DELETE-CODE-EXIT.
020000     GO TO DELETE-CODE.
020100 DELETE-CODE-EXIT.
020200     EXIT.
