000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          SBINLOCS.
000400 AUTHOR.              C HILLES.
000500 DATE-WRITTEN.        03/07/90.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*D   CHANGE BIN LOCATIONS AND TRANSFER BIN LOCATIONS SUBPROG.
001100*D   THIS NEW SUBPROG REPLACES SMCHGBIN - CHANGE BIN LOCATIONS,
001200*    AND SMTRBQTY - TRANSFER BIN QUANTITIES SUBPROGRAMS.
001300*    FORMS:
001400*      FBINLOC   FATHER FORM (HP ONLY)
001500*      FBINLOC1  CORPORATE CODE ENTRY
001600*      FBINLOC2  LOCATIONS ONLY
001700*      FBINLOC3  TRANSFERS ONLY
001800*      FBINLOC4  LOCATIONS AND TRANSFERS
      ****************************************************************
      *C 06/12/96  JEFF BUNGO
      *C     EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C     RECOMPILE PROGRAM TO PICK UP NEW FILE FORMATS.
      *C
      *C 04/15/97  JEFF BUNGO
      *C     ADD FRANCHISE (OWNER) FOR EACH BIN LOCATION.  USE
      *C     MPLTINFO "FRAN" FOR VALIDATION AND NAME RETRIEVAL.
001900
002000 ENVIRONMENT DIVISION.
002100 CONFIGURATION SECTION.
002200 SOURCE-COMPUTER.  HP-3000.
002300 OBJECT-COMPUTER.  HP-3000.
002400 COPY SPECIALN IN COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MSTORERM-CD-O
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DDAILYTC-DT-O
               ASSIGN TO DATABASE-MCFLCS1601
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DWLITEM-CD-I
               ASSIGN TO DATABASE-MCFLCS1502
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZUDCSTR-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DISPLAY-STATUS
               CONTROL-AREA IS WS-CONTROL.
002600
002700 DATA DIVISION.
002900 FILE SECTION.
003000 FD  MSTORERM-CD-O
003100     LABEL RECORDS ARE STANDARD.
003200 01  MSTORERM-CD-REC-O.
003300     COPY DDS-MCRPCS0200  OF MCFLCS0201.
003400
003500 FD  DDAILYTC-DT-O
003600     LABEL RECORDS ARE STANDARD.
003700 01  DDAILYTC-DT-REC-O.
003800     COPY DDS-MCRPCS1600  OF MCFLCS1601.
003900
004000 FD  DWLITEM-CD-I
004100     LABEL RECORDS ARE STANDARD.
004200 01  DWLITEM-CD-REC-I.
004300     COPY DDS-MCRPCS1500  OF MCFLCS1502.

       FD  MPLTINFO
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

004500 FD  DISPLAY-FILE
004600     LABEL RECORDS ARE OMITTED.
004700 01  DISPLAY-REC        PIC X(1500).
004800
005000 WORKING-STORAGE SECTION.
005100
005200 77  MOD-DEL-FLAG                  PIC X(1).
005300 77  SAVE-QTY                      PIC S9(8)  VALUE ZERO.
005400 77  SUB                           PIC S9(4) BINARY.
005500 77  BIN-TRAN-FLAG                 PIC X(1).
005600 77  TRANSACTION-FLAG              PIC X(1).
005700 77  TEST-BIN                      PIC X(2).
005800
005900 01  HOLD-AREA.
006000     05  HOLD-BIN-INFO.
006100         10  FILLER OCCURS 6 TIMES.
006200             15  HOLD-BIN-LOC  PIC X(12).
006300             15  HOLD-BIN-QTY  PIC S9(8) BINARY.
006400
006500     05  HOLD-BIN-NO.
006600         10  FILLER       PIC X.
006700         10  H-BIN-NO     PIC S9.
006500     05  HOLD-BIN-NO-2.
006600         10  FILLER       PIC X.
006700         10  H-BIN-NO-2   PIC S9.
006800
006900**************************************************************
007000**                                                          **
007100**                S U B P R O G R A M   A R E A S           **
007200**                                                          **
007300**************************************************************
007400
007500 COPY TSHWRDFM   IN COPYLIB.
007600 COPY TDATECHK   IN COPYLIB.
007700 COPY TBLOWUP    IN COPYLIB.
007800 COPY CDESC      IN COPYLIB.
007900 COPY DISPDAT2   IN COPYLIB.
008000 COPY IOFEEDBACK IN COPYLIB.
008100 COPY CATREAD    IN COPYLIB.
008100 COPY FUNCTDEF   IN COPYLIB.
008200 01  SHIFT-FLD                    PIC X(8)  VALUE SPACES.
008300 01  RET-CODE                     PIC X(2)  VALUE SPACES.
008400
008500
008600**************************************************************
008700**                                                          **
008800**                  V I E W   W O R K                       **
008900**                                                          **
009000**************************************************************
009100
009200**  SEE LINKAGE SECTION FOR VIEW-COMAREA
009300
009400 01  MESSAGE-BUFFER.
009500     05  MSG-TEXT.
009600         10  MESSAGE-BUFFER-1        PIC X(1).
009700         10  FILLER                  PIC X(67).
009800     05  MSG-FLD                     PIC X(8)   VALUE SPACES.
009900     05  MSG-FLD-9 REDEFINES MSG-FLD PIC ZZZZZZZ9.
010000
010100 01  MSG-BUFFLEN          PIC S9(4)  COMP VALUE 76.
010200 01  MSG-ACTUALEN         PIC S9(4)  COMP VALUE 76.
010300
010400 01  FIELD-NUMBER         PIC S9(4) COMP VALUE 1.
010500
010600**************************************************************
010700**                                                          **
010800**            D A T A B A S E   W O R K                     **
010900**                                                          **
011000**************************************************************
011100 01  FILE-STATUS.
011200     05  FILE-STATUS-1            PIC X  VALUE "0".
011300     05  FILE-STATUS-2            PIC X  VALUE "0".
011400
011500 COPY DBSTAT     IN COPYLIB.
011600 01  DSET-NAMES.
011700     05  DSET-MSTORERM             PIC X(16) VALUE "MSTORERM;".
011800     05  DSET-DWLITEM              PIC X(16) VALUE "DWLITEM;".
011900     05  DSET-DDAILYTC             PIC X(16) VALUE "DDAILYTC;".
012000     05  DSET-NAME                 PIC X(16).
012100
012200 01  MODE-AREA.
012300     05  MODE1                     PIC S9(4)   BINARY     VALUE 1.
012400     05  MODE3                     PIC S9(4)   BINARY     VALUE 3.
012500     05  MODE5                     PIC S9(4)   BINARY     VALUE 5.
012600     05  MODE7                     PIC S9(4)   BINARY     VALUE 7.
012700
012800 01  ALL-ITEMS                     PIC X(2)  VALUE "@;".
012900 01  CODE-SEARCH                   PIC X(16) VALUE "CORP-CODE;".
013000 01  CODE-ARG                      PIC X(8).
013100
013200 01  MULTI-LOCK.
013300     05  NUMBER-OF-DSETS-LOCKED PIC S9(4) COMP VALUE 1.
013400     05  LOCK1.
013500         10  LENGTH-1           PIC S9(4) COMP VALUE 24.
013600         10  DSET-NAME-1        PIC X(16)  VALUE "MSTORERM;".
013700         10  ITEM-LIST-1        PIC X(16)  VALUE "@;".
013800         10  REL-OP-1           PIC XX     VALUE "= ".
013900         10  LOCK-VALUE-1       PIC X(12)  VALUE SPACES.
014000
014100**************************************************************
014200**                                                          **
014300**           D A T A B A S E   B U F F E R S                **
014400**                                                          **
014500**************************************************************
014600 COPY MSTORERM   IN COPYLIB.
014700 COPY DWLITEM    IN COPYLIB.
014800 COPY DDAILYTC   IN COPYLIB.
014900 COPY TC311      IN COPYLIB.
       COPY MPLT0      IN COPYLIB.
       COPY MPLTFRAN   IN COPYLIB.
015000
015100**************************************************************
015200**                                                          **
015300**                  S C R E E N   D A T A                   **
015400**                                                          **
015500**************************************************************
015600 01  DE-FIELDS.
015700     05  DE-CORP-CODE             PIC X(7).
015800     05  V-INSTRUCTION            PIC X(40).
015900     05  DE-DATA.
016000         10  V-CORP-CODE          PIC X(7).
016100         10  V-DESC-1             PIC X(55).
016200         10  V-UM                 PIC XX.
016300         10  V-DESC-2             PIC X(78).
016400         10  V-DESC-3             PIC X(78).
016500         10  DE-LOC-AREA.
016600             15  DE-LOC-LINE OCCURS 6 TIMES.
016700                 20  DE-LOC       PIC X(12).
016800                 20  V-LOC-ONHAND PIC -------9.
                       20  DE-FRAN-ID   PIC X(1).
                       20  DE-FRAN-NAME PIC X(4).
016900         10  INPUT-TRANSFERS OCCURS 6 TIMES.
017000             15  DE-TRANS-QTY     PIC X(8).
017100             15  DE-TRANS-QTY-9 REDEFINES DE-TRANS-QTY PIC 9(8).
017200             15  DE-FROM-BIN      PIC XX.
017300             15  DE-TO-BIN        PIC XX.
017400     05  DE-COMMAND-LINE          PIC X(79).
017500     05  DE-MESSAGE-LINE          PIC X(79).
017600
017700
017800**************************************************************
017900**                                                          **
018000**            L I N K A G E   S E C T I O N                 **
018100**                                                          **
018200**************************************************************
018300
018400 LINKAGE SECTION.
018500 01  BASE                      PIC X(10).
018600
018700 COPY VCOMLINK   IN COPYLIB.
018800 COPY LANGSUB    IN COPYLIB.
018900
019000 PROCEDURE DIVISION USING BASE
019100                          VIEW-COMAREA,
019200                          LANGUAGE-PARMS.
019300
019400 1-HSK.
019500     PERFORM 9999-OPEN-STUFF.
      *-----04/15/97 JSB, RETRIEVE VALID FRANCHISES
           MOVE "FRAN" TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
              INVALID KEY
                  MOVE SPACES TO MPLTINFO-FRANCHISES.
019600     PERFORM 6000-MAIN THRU 6990-MAIN-X.
019700     PERFORM 9999-CLOSE-STUFF.
019800     GOBACK.
019900
020000 2100-BLOWUP.
020100     MOVE "SBINLOCS"               TO   BU-PGM-NAME.
020200     MOVE CODE-ARG                 TO   BU-DISPLAY-FLD (1).
020300     CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
020400       VIEW-COMAREA FILE-STATUS BU-DISPLAY-MSG
020500       BU-DISPLAY-FLDS.
020600
020700 6000-MAIN.
020800*------ FORM NAMES:
020900*------    FBINLOC:   FATHER FORM
021000*------    FBINLOC1:  ENTER CORP CODE               (SON FORM)
021100*------    FBINLOC2:  LOCATIONS ONLY                (SON FORM)
021200*------    FBINLOC3:  TRANSFERS ONLY                (SON FORM)
021300*------    FBINLOC4:  BOTH LOCATIONS AND TRANSFERS  (SON FORM)
021400     MOVE "FBINLOC"                TO   VIEW-NFNAME.
021500     PERFORM 9951-GETNEXTFORM.
021600     MOVE "FBINLOC1"               TO   VIEW-NFNAME.
021700     PERFORM 9951-GETNEXTFORM.
021800     PERFORM 9955-CLEAR-FORM.
021900
022000*------ "T8: TYPE CORPORATE CODE AND PRESS 'ENTER'"
022100     MOVE 9 TO LANG-SETNUM.
022200     MOVE 23 TO LANG-MSGNUM.
022300     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
022400     MOVE MESSAGE-BUFFER           TO   V-INSTRUCTION.
022500
022700
022800 6010-SHOWFORM-1.
022900     MOVE 1                        TO   SRF-KEYSET.
023000     MOVE 2                        TO   SRF-MODE.
023100     MOVE "I"                      TO   SRF-FKEY (6).
      *------ONLY DISPLAY FIELDS IF FRANCHISES EXIST.
           IF MPLTINFO-FRANCHISES NOT = SPACES
               MOVE B"1" TO IND(90).
022600     PERFORM 9953-PUTBUFFER.
023200     PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
023300     IF MESSAGE-BUFFER-1 NOT = SPACES
023400         PERFORM 9954-SETERROR
023500         GO TO 6010-SHOWFORM-1.
023600
023700     IF VIEW-LASTKEY = EXIT-PROGRAM
023800         GO TO 6990-MAIN-X.
023900
024000     PERFORM 9952-GETBUFFER.
024100
024200     MOVE DE-CORP-CODE TO CODE-ARG.
024300     PERFORM 9999-DBGET7-MSTORERM-CD-O.
024400     IF GOOD-CALL
024500         PERFORM 9999-RESET-MSTORERM-CD-O
024600     ELSE
024700*        "S9: STORES CODE DOES NOT EXIST"
024800         MOVE 19 TO LANG-SETNUM
024900         MOVE 9  TO LANG-MSGNUM
025000         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
025100         MOVE CODE-ARG TO MSG-FLD
025200         MOVE 1 TO FIELD-NUMBER
025300         PERFORM 9954-SETERROR
025400         GO TO 6010-SHOWFORM-1.
025500
025600     IF STR-STATE = "F"
025700*        "C8: CODE FROZEN FOR INVENTORY - NO PROCESSING ALLOWED"
025800         MOVE 3 TO LANG-SETNUM
025900         MOVE 8 TO LANG-MSGNUM
026000         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
026100         MOVE 1 TO FIELD-NUMBER
026200         PERFORM 9954-SETERROR
026300         GO TO 6010-SHOWFORM-1.
026400
026500     PERFORM 9999-DBFIND-DWLITEM-CD-I.
026600     IF GOOD-CALL
026700         PERFORM 9999-DBGET5-DWLITEM-CD-I
026800         IF GOOD-CALL
026900*            "C31: CANNOT PROCESS- CODE ON WORKSHEET #"
027000             MOVE 3 TO LANG-SETNUM
027100             MOVE 31 TO LANG-MSGNUM
027200             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
027300             MOVE WL-KEY TO MSG-FLD
027400             MOVE 1 TO FIELD-NUMBER
027500             PERFORM 9954-SETERROR
027600             GO TO 6010-SHOWFORM-1.
027700
027800     MOVE 3 TO CDESC-LINES-TO-GET.
027900     CALL "CDESC" USING CDESC-RET-CODE, BASE, STATUS-AREA,
028000       BU-DISPLAY-MSG, CODE-ARG, CDESC-DATA.
028100     IF BU-DISPLAY-MSG-1 NOT = SPACES
028200         PERFORM 2100-BLOWUP.
028300
028400     MOVE CDESC (1)   TO  V-DESC-1.
028500     MOVE CDESC (2)   TO  V-DESC-2.
028600     MOVE CDESC (3)   TO  V-DESC-3.
028700
028800     MOVE CODE-ARG TO V-CORP-CODE.
028900     MOVE STR-UM   TO V-UM.
029000     MOVE ZERO TO SUB.
029100     PERFORM 6 TIMES
029200         ADD 1 TO SUB
029300         MOVE STR-LOC (SUB)        TO DE-LOC (SUB)
029400         MOVE STR-LOC-ONHAND (SUB) TO V-LOC-ONHAND (SUB)
      *----------04/15/97 JSB, MOVE FRAN ID AND NAME TO SCREEN
               MOVE STR-BIN-OWNER (SUB)  TO DE-FRAN-ID (SUB)
               IF DE-FRAN-ID(SUB) > SPACES
                SET FRANIDX TO 1
                SEARCH MPLTINFO-FRAN
                  AT END  MOVE SPACES TO DE-FRAN-NAME (SUB)
                  WHEN MPLTINFO-FRAN-ID(FRANIDX) = DE-FRAN-ID (SUB)
                   MOVE MPLTINFO-FRAN-NAME(FRANIDX) TO DE-FRAN-NAME(SUB)
                END-SEARCH
               ELSE
                MOVE SPACES TO DE-FRAN-NAME(SUB)
               END-IF
029500     END-PERFORM.
029600*------ GET FATHER FORM
029700     MOVE "FBINLOC" TO VIEW-NFNAME.
029800     PERFORM 9951-GETNEXTFORM.
029900
030000*------ GET SON FORM BASED ON WHETHER WE ARE MODIFYING
030100*------ BIN LOCATIONS, TRANSFERRING QUANTITIES, OR BOTH
030200     PERFORM 9100-DETERMINE-BIN-TRAN.
030300
030400*------ "M58: MODIFY DATA AND PRESS 'ENTER'"
030500     MOVE 13 TO LANG-SETNUM.
030600     MOVE 58 TO LANG-MSGNUM.
030700     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
030800     MOVE MESSAGE-BUFFER           TO   V-INSTRUCTION.
031100
031200 6200-SHOWFORM-2.
031300     MOVE 2 TO SRF-KEYSET.
031400     MOVE "I" TO SRF-FKEY (6).
      *------ONLY DISPLAY FIELDS IF CODE IS A FRANCHISE CODE.
           IF STR-CODE-OWNER NOT = SPACES
               MOVE B"1" TO IND(90).
031000     PERFORM 9953-PUTBUFFER.
031500     PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
031600     IF MESSAGE-BUFFER-1 NOT = SPACES
031700         PERFORM 9954-SETERROR
031800         GO TO 6200-SHOWFORM-2.
031900
033000     PERFORM 9952-GETBUFFER.
033100
032000     IF VIEW-LASTKEY = EXIT-PROGRAM
032100         GO TO 6990-MAIN-X
032200     ELSE
032300     IF VIEW-LASTKEY = EXIT-AREA
032400         GO TO 6000-MAIN
032500     ELSE
032600     IF VIEW-LASTKEY = 1 OR 2 OR HP-F3-KEY
032700         PERFORM 9100-DETERMINE-BIN-TRAN
032800         GO TO 6200-SHOWFORM-2.
032900
033200     MOVE "N" TO TRANSACTION-FLAG.
033300     PERFORM 9931-LOCK-MSTORERM.
033400     PERFORM 9999-DBGET7-MSTORERM-CD-O.
033500
033600     MOVE STR-LOC-AREA TO HOLD-AREA
033700
PDR   *    IF BIN-TRAN-FLAG = "L" OR "B"
033900         PERFORM 7000-LOC-EDITS THRU 7090-LE-X
034000         IF MESSAGE-BUFFER-1 NOT = SPACES
034100            PERFORM 9954-SETERROR
034200            PERFORM 9941-UNLOCK-MSTORERM
034300            GO TO 6200-SHOWFORM-2.
034400
034500*------ ALWAYS UPDATE IN CASE USER WAS IN, SAY, LOCS ONLY,
034600*------ THEN CHANGED A LOC, THEN SWITCHED TO TRANSFERS ONLY,
034700*------ THEN HIT ENTER...
034800*------ WE UPDATE LOCS BEFORE EDITING TRANSFERS SO YOU CAN
034900*------ ADD A LOCATION AND TRANSFER TO IT ALL IN ONE STEP
035000     MOVE ZERO TO SUB
035100     PERFORM 6 TIMES
035200         ADD 1 TO SUB
035300         MOVE DE-LOC (SUB) TO STR-LOC (SUB)
      *----------4/15/97 JSB SAVE FRANCHISE ID
               MOVE DE-FRAN-ID(SUB) TO STR-BIN-OWNER(SUB)
035400     END-PERFORM.
035500
PDR   *    IF BIN-TRAN-FLAG = "T" OR "B"
035700         PERFORM 7100-TRAN-EDITS THRU 7190-TE-X
035800         IF MESSAGE-BUFFER-1 NOT = SPACES
035900             PERFORM 9954-SETERROR
036000             PERFORM 9941-UNLOCK-MSTORERM
036100             GO TO 6200-SHOWFORM-2.
036200
036300*------ LET'S UPDATE THE TRANSFERS, TOO!
036400     MOVE ZERO TO SUB.
036500     PERFORM 6 TIMES
036600         ADD 1 TO SUB
036700         MOVE HOLD-BIN-QTY (SUB) TO STR-LOC-ONHAND (SUB)
036800     END-PERFORM.

PDR        IF STR-LOC (1)   NOT =   HOLD-BIN-LOC (1)
PDR            MOVE "Y" TO TRANSACTION-FLAG.

037000     PERFORM 9999-DBUPDATE-MSTORERM-CD-O.
037100     PERFORM 9941-UNLOCK-MSTORERM.
037200     IF TRANSACTION-FLAG = "Y"
037300         PERFORM 9000-311-TRANSACTION.
037400
037500     GO TO 6000-MAIN.
037600
037700 6990-MAIN-X.
037800     EXIT.
037900
038000 7000-LOC-EDITS.
038100     IF DE-LOC (1) = SPACES
038200*        "Y3: YOU MAY NOT DELETE THE PRIMARY BIN LOCATION"
038300         MOVE 25 TO LANG-SETNUM
038400         MOVE 3  TO LANG-MSGNUM
038500         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
038600         MOVE 7 TO FIELD-NUMBER
038700         GO TO 7090-LE-X.
038800
038900     MOVE ZERO TO SUB.
039000     PERFORM UNTIL SUB = 6 OR MESSAGE-BUFFER-1 > SPACES
039100         ADD 1 TO SUB
039200         IF DE-LOC (SUB) = SPACES
039300         AND STR-LOC-ONHAND (SUB) NOT = 0
039400*            "Y4: YOU MAY NOT DELETE A LOC THAT HAS A QTY"
039500             MOVE 25 TO LANG-SETNUM
039600             MOVE 4  TO LANG-MSGNUM
039700             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
039800             COMPUTE FIELD-NUMBER = 2 * (SUB - 1) + 7
039900             GO TO 7090-LE-X
040000         END-IF
      *---------LOCATION MUST BE ENTERED WHEN ENTERING FRANCHISE
               IF DE-LOC(SUB) = SPACES
                  AND DE-FRAN-ID(SUB) > SPACES
      *             NO LOCATION EXISTS
                   MOVE 14 TO LANG-SETNUM
                   MOVE 90 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   COMPUTE FIELD-NUMBER = 2 * (SUB - 1) + 8
                   GO TO 7090-LE-X
               END-IF
      *----------VALIDATE FRANCHISE ID
               IF MPLTINFO-FRANCHISES NOT = SPACES
               IF DE-FRAN-ID(SUB) > SPACES
               SET FRANIDX TO 1
               SEARCH MPLTINFO-FRAN
               AT END
      *           INVALID ID
                 MOVE  9 TO LANG-SETNUM
                 MOVE 19 TO LANG-MSGNUM
                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                 COMPUTE FIELD-NUMBER = 2 * (SUB - 1) + 8
                 GO TO 7090-LE-X
               WHEN MPLTINFO-FRAN-ID(FRANIDX) = DE-FRAN-ID (SUB)
                 MOVE MPLTINFO-FRAN-NAME(FRANIDX) TO DE-FRAN-NAME (SUB)
               END-SEARCH
               END-IF
               END-IF
040100     END-PERFORM.
040200
040300 7090-LE-X.
040400     EXIT.
040500
040600 7100-TRAN-EDITS.
040700     MOVE ZERO TO SUB.
040800     PERFORM UNTIL SUB = 6 OR MESSAGE-BUFFER-1 NOT = SPACES
040900      ADD 1 TO SUB
041000      IF DE-FROM-BIN (SUB) > SPACES
041100       MOVE DE-TRANS-QTY (SUB) TO SHIFT-FLD
041200       CALL "TRSHIFT" USING RET-CODE, SHIFT-FLD
041300       MOVE SHIFT-FLD TO DE-TRANS-QTY (SUB)
041400       IF DE-TRANS-QTY (SUB) NOT NUMERIC
041500*        "Q1: QUANTITY MUST BE NUMERIC"
041600         MOVE 17 TO LANG-SETNUM
041700         MOVE 1 TO LANG-MSGNUM
041800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
041900         MOVE DE-TRANS-QTY (SUB) TO MSG-FLD
042000         COMPUTE FIELD-NUMBER = 3 * (SUB - 1) + 19
042100       ELSE
042200         MOVE DE-FROM-BIN (SUB) TO TEST-BIN
042300         PERFORM 9300-CHECK-BIN
042400         IF MESSAGE-BUFFER-1 NOT = SPACES
042500           COMPUTE FIELD-NUMBER = 3 * (SUB - 1) + 20
042600         ELSE
042700           MOVE DE-TO-BIN (SUB) TO TEST-BIN
042800           PERFORM 9300-CHECK-BIN
042900           IF MESSAGE-BUFFER-1 NOT = SPACES
043000             COMPUTE FIELD-NUMBER = 3 * (SUB - 1) + 21
043100           ELSE
                   MOVE DE-FROM-BIN (SUB) TO HOLD-BIN-NO
                   MOVE DE-TO-BIN(SUB) TO HOLD-BIN-NO-2
                   PERFORM 9500-CHECK-BIN-FRAN
                   IF MESSAGE-BUFFER-1 NOT = SPACES
043500               COMPUTE FIELD-NUMBER = 3 * (SUB - 1) + 20
043600             ELSE
043200             MOVE DE-FROM-BIN (SUB) TO HOLD-BIN-NO
043300             PERFORM 9400-CHECK-BIN-SPACES
043400             IF MESSAGE-BUFFER-1 NOT = SPACES
043500               COMPUTE FIELD-NUMBER = 3 * (SUB - 1) + 20
043600             ELSE
043700               MOVE DE-TO-BIN (SUB) TO HOLD-BIN-NO
043800               PERFORM 9400-CHECK-BIN-SPACES
043900               IF MESSAGE-BUFFER-1 NOT = SPACES
044000                 COMPUTE FIELD-NUMBER = 3 * (SUB - 1) + 21
044100               ELSE
044200                 MOVE DE-FROM-BIN (SUB) TO HOLD-BIN-NO
044300                 SUBTRACT DE-TRANS-QTY-9 (SUB)
044400                 FROM HOLD-BIN-QTY (H-BIN-NO)
044500                 IF HOLD-BIN-QTY (H-BIN-NO) < 0
044600*                  "Q21: QTY TRANSFERRED > THAN QTY IN BIN"
044700                   MOVE 17 TO LANG-SETNUM
044800                   MOVE 21 TO LANG-MSGNUM
044900                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
045000                   ADD DE-TRANS-QTY-9 (SUB)
045100                   TO HOLD-BIN-QTY (H-BIN-NO)
045200                   MOVE HOLD-BIN-QTY (H-BIN-NO) TO MSG-FLD-9
045300                   COMPUTE FIELD-NUMBER = 3 * (SUB - 1) + 19
045400                 ELSE
045500                   MOVE DE-TO-BIN (SUB) TO HOLD-BIN-NO
045600                   ADD DE-TRANS-QTY-9 (SUB) TO
045700                   HOLD-BIN-QTY (H-BIN-NO)
045800                 END-IF
045900               END-IF
046000             END-IF
046000             END-IF
046100           END-IF
046200         END-IF
046300       END-IF
046400      END-IF
046500     END-PERFORM.
046600 7190-TE-X.
046700     EXIT.
046800
046900 9000-311-TRANSACTION.
047000**************************************************************
047100**   SINCE THE CORPORATE DATABASE MAINTAINS MAJOR BIN LOC,  **
047200**   IF IT CHANGES CREATE A 311 TYPE 1 TRANSACTION.         **
047300**************************************************************
047400     CALL "TDATECHK" USING DATE-CHECK-AREA.
047500     MOVE DATE-YMD-OUT             TO   DDAILYTC-DATE.
047600     MOVE DATE-UNFORMATTED-TIME-OUT TO  DDAILYTC-TIME.
047700     MOVE "311"                    TO   DDAILYTC-TC.
047800     MOVE SRF-MPLTINFO-COMPANY     TO   DDAILYTC-PLT.
047900     MOVE "1"                      TO   TC311-ID-1.
048000     MOVE CORP-CODE                TO   TC311-CORP-CODE.
048100     MOVE STR-PREV-CODE            TO   TC311-PREV-CODE.
048200     MOVE STR-AUTHOR               TO   TC311-AUTHOR.
048300     MOVE STR-CLASS                TO   TC311-CLASS.
048400     MOVE STR-DIR-CHRG-DEPT        TO   TC311-DIR-CHRG.
048500     MOVE STR-DFLT-DEPT            TO   TC311-DEPT-CHG.
048600     MOVE STR-WR-DOWN              TO   TC311-WR-DOWN.
048700     MOVE STR-STOCK-OT             TO   TC311-STOCK-OT.
048800     MOVE STR-IMPORT-IND           TO   TC311-IMPORT.
048900     MOVE STR-INS-ITM              TO   TC311-INS-ITM.
049000     MOVE STR-ORD-ENG              TO   TC311-ORD-ENG.
049100     MOVE STR-OUT-REP              TO   TC311-OUT-REP.
049200     MOVE STR-MAINT                TO   TC311-MAINT.
049300     MOVE STR-LOC (1)              TO   TC311-STOCK-LOC.
049400
049500     MOVE "DDAILYTC;" TO DSET-NAME.
049600     PERFORM 9930-LOCK.
049700     PERFORM 9999-DBPUT-DDAILYTC-DT-O.
049800     PERFORM 9940-UNLOCK.
049900
050000 9100-DETERMINE-BIN-TRAN.
050100     IF VIEW-LASTKEY = 1
050200         MOVE "L" TO BIN-TRAN-FLAG
050300         MOVE "FBINLOC2" TO VIEW-NFNAME
050400     ELSE
050500     IF VIEW-LASTKEY = 2
050600         MOVE "T" TO BIN-TRAN-FLAG
050700         MOVE "FBINLOC3" TO VIEW-NFNAME
050800     ELSE
050900         MOVE "B" TO BIN-TRAN-FLAG
051000         MOVE "FBINLOC4" TO VIEW-NFNAME.
051100     PERFORM 9951-GETNEXTFORM.
051200
051300 9300-CHECK-BIN.
051400     IF TEST-BIN = "B1" OR "B2" OR "B3" OR "B4" OR "B5" OR "B6"
051500         NEXT SENTENCE
051600     ELSE
051700*        "B19: BIN NUMBER DOES NOT EXIST"
051800         MOVE 2 TO LANG-SETNUM
051900         MOVE 19 TO LANG-MSGNUM
052000         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
052100         MOVE TEST-BIN TO MSG-FLD.
052200
052300 9400-CHECK-BIN-SPACES.
052400     IF STR-LOC (H-BIN-NO) = SPACES
052500*        "N90: NO LOCATION EXISTS AT THIS BIN NUMBER"
052600         MOVE 14 TO LANG-SETNUM
052700         MOVE 90 TO LANG-MSGNUM
052800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
052900         MOVE TEST-BIN TO MSG-FLD.

      *-----BINS MUST BE TRANSFERRED BETWEEN SAME FRANCHISE
       9500-CHECK-BIN-FRAN.
           IF STR-BIN-OWNER(H-BIN-NO) NOT = STR-BIN-OWNER(H-BIN-NO-2)
      *        "BIN FRANCHISERS MUST MATCH ON BIN TRANSFER OF QTY"
               MOVE  2 TO LANG-SETNUM
               MOVE 23 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.

053100 COPY DISPCALL IN COPYLIB.
053200 COPY DISPCAL2 IN COPYLIB.
053300 COPY HCATREAD IN COPYLIB.

       9930-LOCK.
       9931-LOCK-MSTORERM.
       9940-UNLOCK.
       9941-UNLOCK-MSTORERM.
           PERFORM 9999-RESET-MSTORERM-CD-O.

       9951-GETNEXTFORM.
       9952-GETBUFFER.
           MOVE DISPLAY-REC TO DE-FIELDS.

       9953-PUTBUFFER.
           MOVE DE-FIELDS TO DISPLAY-REC.

       9954-SETERROR.
           MOVE B"1" TO IND (99).
           MOVE B"1" TO IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE.

       9955-CLEAR-FORM.
           MOVE SPACES TO DE-FIELDS, MESSAGE-BUFFER.

       9956-PUTWINDOW.
       9957-FIELDEDITS.
       9958-INITFORM.
       9959-SHOWFORM.
       9960-SETKEYLABEL.
       9961-AUTOREAD.
       9962-OPENFORM.
       9963-CLOSEFORM.
       9964-FINISHFORM.

       9999-DBGET7-MSTORERM-CD-O.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-CD-REC-O.
           READ MSTORERM-CD-O INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET7 ERR 9999-DBGET7-MSTORERM-CD-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-RESET-MSTORERM-CD-O.
           MOVE HIGH-VALUES TO CORPCDE OF MSTORERM-CD-REC-O.
           START MSTORERM-CD-O KEY > CORPCDE OF MSTORERM-CD-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-DBUPDATE-MSTORERM-CD-O.
           MOVE 0 TO COND-WORD.
           REWRITE MSTORERM-CD-REC-O FROM BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBUPDATE ERR 9999-DBUPDATE-MSTORERM-CD-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBPUT-DDAILYTC-DT-O.
           MOVE 0 TO COND-WORD.
           WRITE DDAILYTC-DT-REC-O FROM BUF-DDAILYTC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBPUT ERR 9999-DBPUT-DDAILYTC-DT-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBFIND-DWLITEM-CD-I.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DWLITEM-CD-REC-I.
           START DWLITEM-CD-I KEY = CORPCDE OF DWLITEM-CD-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DWLITEM-CD-I"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBGET5-DWLITEM-CD-I.
           MOVE 0 TO COND-WORD.
           READ DWLITEM-CD-I NEXT INTO BUF-DWLITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DWLITEM-CD-I"
                       TO BU-MSG-AREA
                   MOVE 99 TO COND-WORD
                   PERFORM 2100-BLOWUP
           ELSE
           IF CORPCDE OF DWLITEM-CD-REC-I NOT = CODE-ARG
               MOVE 15 TO COND-WORD.

       9999-OPEN-STUFF.
           OPEN I-O   MSTORERM-CD-O        .
           OPEN I-O   DDAILYTC-DT-O        .
           OPEN INPUT DWLITEM-CD-I         .
           OPEN I-O   DISPLAY-FILE.
           OPEN INPUT MPLTINFO.

       9999-CLOSE-STUFF.
           CLOSE      MSTORERM-CD-O        .
           CLOSE      DDAILYTC-DT-O        .
           CLOSE      DWLITEM-CD-I         .
           CLOSE      MPLTINFO.
           CLOSE DISPLAY-FILE.
