       IDENTIFICATION DIVISION.
       PROGRAM-ID.    SCALCEDT.
       AUTHOR.        CA YODER.
       DATE-WRITTEN.  AUGUST 1995.

      ***************************************************************
      *  THIS PROGRAM CALCULATES THE EXPECT DATE FOR REQUISITIONS.  *
      *  THE EXPECT DATE IS CALCULATED AS FOLLOWS:                  *
      *    1)  THE AVERAGE OF THE 3 LEAD TIMES IS FOUND.            *
      *    2)  IF IT IS NOT EQUAL TO ZERO, IT IS ADDED TO           *
      *            CURRENT DATE TO OBTAIN EXPECT DATE.              *
      *    3)  IF IT IS EQUAL TO ZERO, THE SHIP TIME IS ADDED       *
      *            TO THE CURRENT DATE TO OBTAIN EXPECT DATE.       *
      *                                                             *
      *  CALLED BY:   TRELMAN & SREQMAN                             *
      ***************************************************************
      *                                                             *
      *C*  06/17/1996    CA YODER                                   *
      *C*    CHANGED CALLS TO "JULIANDATE" AND "GREGDATE" TO        *
      *C*    NEW "JULGREG" PROGRAM.                                 *
      *                                                             *
      ***************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  DATE-WANTED-JULIAN      PIC S9(4).
       77  LEAD-TIME               PIC S9(4)  COMP-4 VALUE ZEROS.
       77  NO-OF-DLV               PIC S9(4)  COMP-4 VALUE ZEROS.
       77  TOTAL-DLV-TIME          PIC S9(4)  COMP-4 VALUE ZEROS.

       01  DATES-AND-TIMES.
           05  CUR-DATE.
               10  CUR-CC           PIC XX.
               10  CUR-DATE-YMD.
                   15  CUR-YY       PIC XX.
                   15  CUR-MM       PIC XX.
                   15  CUR-DD       PIC XX.

               10  CUR-DATE-9  REDEFINES  CUR-DATE-YMD.
                   15  YY-9         PIC 99.
                   15  MM-9         PIC 99.
                   15  DD-9         PIC 99.

      *--------- PARAMETERS FOR "JULGREG" ROUTINE.
       01  JULGREG-PARMS.
           05  GREG-DATE.
               10  GREG-CC          PIC X(2).
               10  GREG-YMD.
                   15  GREG-YY      PIC X(2).
                   15  GREG-MM      PIC X(2).
                   15  GREG-DD      PIC X(2).
           05  JULIAN-DATE.
               10  JUL-CC           PIC X(2).
               10  JUL-YY           PIC X(2).
               10  JUL-DDD          PIC X(3).
           05  JULIAN-DATE-9  REDEFINES  JULIAN-DATE.
               10  JUL-CCYY-9       PIC 9(4).
               10  JUL-DDD-9        PIC 9(3).
           05  DAY-DIGIT            PIC X.
           05  LEAP-YEAR-FLAG       PIC X.

       LINKAGE SECTION.

       01  PASSED-LEAD-TIMES.
           05  LEAD-TIME-1            PIC 9(4).
           05  LEAD-TIME-2            PIC 9(4).
           05  LEAD-TIME-3            PIC 9(4).
           05  SHIP-TIME              PIC 9(4).
           05  EXPECT-DATE.
               10  EXP-YY             PIC X(2).
               10  EXP-MM             PIC X(2).
               10  EXP-DD             PIC X(2).

       PROCEDURE DIVISION USING  PASSED-LEAD-TIMES.

       6-MAIN.

      *------ THE AVERAGE OF THE 3 LEADTIMES IS SEPARATE FROM
      *------ THE STOREROOM ESTIMATED LEAD TIME (SHIP TIME), SO
      *------ USE THE AVERAGE NO MATTER WHAT TO CALCULATE DATE
      *------ WANTED.

           PERFORM 60-CALCULATE-AVERAGE.

           PERFORM 61-CALCULATE-EXPECT-DATE THRU 61-CED-X.

           GOBACK.

      *------ THIS ROUTINE CALCULATES AN AVERAGE OF THE LAST
      *------ 3 ACTUAL LEAD TIMES.  THIS AVERAGE IS USED WHEN
      *------ CALCULATING DATE WANTED.

       60-CALCULATE-AVERAGE.
           MOVE ZERO                    TO  TOTAL-DLV-TIME
                                            NO-OF-DLV.

           COMPUTE TOTAL-DLV-TIME = LEAD-TIME-1 +
                                    LEAD-TIME-2 +
                                    LEAD-TIME-3.

           IF LEAD-TIME-1 NOT = 0       ADD 1 TO NO-OF-DLV.
           IF LEAD-TIME-2 NOT = 0       ADD 1 TO NO-OF-DLV.
           IF LEAD-TIME-3 NOT = 0       ADD 1 TO NO-OF-DLV.
           IF NO-OF-DLV = ZEROS
               MOVE ZEROS               TO  LEAD-TIME
           ELSE
               DIVIDE TOTAL-DLV-TIME    BY  NO-OF-DLV
                   GIVING LEAD-TIME ROUNDED.

      *----- COMPUTE TODAY'S JULIAN DATE TO USE WHEN COMPUTING DATE WANTED.

       61-CALCULATE-EXPECT-DATE.
           MOVE SPACES          TO JULGREG-PARMS.
           ACCEPT CUR-DATE-YMD      FROM DATE.
           IF CUR-YY > "70"
               MOVE "19"        TO CUR-CC
           ELSE
               MOVE "20"        TO CUR-CC.
           MOVE CUR-DATE        TO GREG-DATE.
           CALL "JULGREG"   USING GREG-DATE, JULIAN-DATE,
                                  DAY-DIGIT, LEAP-YEAR-FLAG.
           MOVE JUL-DDD-9       TO DATE-WANTED-JULIAN.

      *------ IF THE AVERAGE = 0, USE THE SHIP TIME TO OBTAIN AN
      *------ EXPECT DATE.
           IF LEAD-TIME = 0
               ADD SHIP-TIME    TO DATE-WANTED-JULIAN
           ELSE
               ADD LEAD-TIME    TO DATE-WANTED-JULIAN.

       61-CONT-COMPUTE-DATE-WANTED.
           IF DATE-WANTED-JULIAN  <  366
               NEXT SENTENCE
           ELSE
               SUBTRACT 365  FROM  DATE-WANTED-JULIAN
               ADD 1 TO JUL-CCYY-9
               GO TO 61-CONT-COMPUTE-DATE-WANTED.
           MOVE SPACES              TO  GREG-DATE.
           MOVE DATE-WANTED-JULIAN  TO  JUL-DDD-9.
           CALL "JULGREG"   USING GREG-DATE, JULIAN-DATE,
                                  DAY-DIGIT, LEAP-YEAR-FLAG.
           MOVE GREG-YMD      TO EXPECT-DATE.

       61-CED-X.
           EXIT.

