       IDENTIFICATION DIVISION.
       PROGRAM-ID.             SCODEUPD.
       AUTHOR.                 DAVID A. PLUM, JR.
       DATE-WRITTEN.           APRIL - MAY 1985.
       DATE-COMPILED.
      *INSTALLATION.           THE GOODYEAR TIRE AND RUBBER COMPANY.
      *REMARKS.
      **************************************************************
      *D  S C O D E U P D         CODE UPDATE SUBPROGRAM           *
      *                                                            *
      *   THIS SUBPROGRAM IS CALLED BY:                            *
      *       1) TDSCMAIN                                          *
      *                                                            *
      *   SUBPROGRAMS CALLED:                                      *
      *       1) CRFMTKWM - REFORMAT KEYWORD/MODIFIER SUBPROGRAM   *
      *       2) CRFMTMFR - REFORMAT MANUFACTURER SUBPROGRAM       *
      *       3) TPLTMAST - INPLANT DATA SUBPROGRAM                *
      * >>>-->4) TSCRPRT2 - SCREEN PRINT SUBPROGRAM *DELETED*      *
      *       5) TBLOWUP  - BLOWUP SUBPROGRAM                      *
      *       6) TDATECK2 - DATE SUBPROGRAM                        *
      *       7) SDSCTRNS - DESCRIPTION TRANSLATION SUBPROGRAM     *
      *       8) CCODECHK - CODE CHECK SUBPROGRAM                  *
      *       9) SCODEDEL - CODE DELETE SUBPROGRAM                 *
      *                                                            *
      **************************************************************
      *                                                            *
      *D  THIS SUBPROGRAM PERFORMS THE FOLLOWING FUNCTIONS:        *
      *D                                                           *
      *D      1) LOADING OF NEW CODES WITH THEIR KEYWORD/MODIFIER, *
      *D         MANUFACTURERS, MANUFACTURER'S PART NUMBERS,       *
      *D         DESCRIPTION, PRIMARY BIN LOCATION, AND INPLANT    *
      *D         DATA.  A KEYWORD/MODIFIER AND DESCRIPTION IN A    *
      *D         SECOND LANGUAGE CAN ALSO BE ADDED.                *
      *D                                                           *
      *D      2) MODIFYING CODE INFORMATION                        *
      *D         A) KEYWORD/MODIFIER AND/OR DESCRIPTION            *
      *D            (IN ONE AND/OR BOTH LANGUAGES)                 *
      *D         B) MANUFACTURERS AND MANUFACTURER'S PART NUMBERS  *
      *D         C) INPLANT DATA USING "TPLTMAST"                  *
      *D                                                           *
      *D      3) DELETION OF CODES FROM THE DATA BASE USING        *
      *D         "SCODEDEL"                                        *
      *                                                            *
      **************************************************************
      *   PROGRAM CHANGES:                                         *
      *                                                            *
      *   07/31/85  CHANGED PROGRAM AND SCREENS TO ALLOW ENTRY OF  *
      *             THE PRIMARY BIN LOACTION RATHER THAN THE       *
      *             PREVIOUS CODE.  VARIABLE NAMES WERE REVISED TO *
      *             REFLECT THIS CHANGE.      D.A. PLUM            *
      *                                                            *
      *   08/06/85  DATA BASE LOGGING CALLS WERE ADDED TO THIS     *
      *             PROGRAM.                  D.A. PLUM            *
      *                                                            *
      *  10/02/85 THE FOLLOWING PROGRAM CHANGES WERE MADE:         *
      *           1) CALLS TO THE SUBPROGRAM "TRSTRKWM" WERE       *
      *              REPLACED WITH CALLS TO "TRFMTKWM".  KEYWORDS  *
      *              AND MODIFIERS ARE NO LONGER LIMITED TO ONLY   *
      *              THREE WORDS.                                  *
      *           2) CALLS TO THE SUBPROGRAM "TRSTRMFR" WERE       *
      *              REPLACED WITH CALLS TO  "TRFMTMFR".           *
      *              MANUFACTURER NAMES ARE NO LONGER LIMITED TO   *
      *              ONLY SIX WORDS.                               *
      *           3) THE DATE CHECK SUBPROGRAM "TDATECK2" WILL NOW *
      *              BE CALLED IN PLACE OF "TDATECHK".             *
      *           4) CONVERTED PROGRAM TO MULTI-LANGUAGE           *
      *              CAPABILITY USING NSL CALLS.                   *
      *           5) THE SCREEN PRINT SUBPROGRAM "TSCRPRT2" WILL   *
      *              NOW BE CALLED INSTEAD OF "TSCRPRNT".          *
      *                                       D.A. PLUM            *
      *                                                            *
      *  10/08/85 THE FOLLOWING REVISIONS WERE MADE TO PROVIDE     *
      *           FOR THE USE A SECOND LANGUAGE:                   *
      *           1) CODE ADD FUNCTION:                            *
      *              A) PROVIDED FOR THE LINKING OF A SECOND KWM   *
      *                 TO A CODE (KWM IN SECOND LANGUAGE)         *
      *              B) PROVIDED FOR THE ADDITION OF A SECOND      *
      *                 DESCRIPTION FOR A CODE (SECOND LANGUAGE)   *
      *              C) REVISED THE POSITIONING OF DATA WITHIN     *
      *                 DDESC AND DDESC2.  KWM REMAINS IN 00 REC,  *
      *                 DESCRIPTION IS MOVED UP TO RECS 01 THRU 15,*
      *                 LOCAL DESC REMAINS IN REC 99, AND MFR INFO *
      *                 WILL NO LONGER BE STORED AS PART OF THE    *
      *                 DESCRIPTION.                               *
      *           2) MODIFY KWM AND/OR DESC FUNCTION:              *
      *              A) PROVIDED FOR THE MODIFICATION OF THE       *
      *                 SECOND LANGUAGE KWM AND/OR DESCRIPTION     *
      *              B) MADE THE NECESSARY REVISIONS TO HANDLE     *
      *                 THE NEW POSITIONING OF DATA WITHIN DDESC   *
      *                 AND DDESC2                                 *
      *           3) MODIFY MFR INFORMATION FUNCTION:              *
      *              A) REVISED LOGIC TO PLACE MFR INFORMATION IN  *
      *                 DMANPART ONLY                              *
      *           4) CODE DELETE FUNCTION:                         *
      *              A) PROVIDED FOR THE DELETION OF DATA IN       *
      *                 DDESC2 WHEN A CODE IS DELETED              *
      *                                       D.A. PLUM            *
      *                                                            *
      *  10/16/85 ADDED EDIT CHECKS TO INSURE THAT IF A 2ND        *
      *           LANGUAGE KWM IS ENTERED THAT IT IS NOT EQUAL TO  *
      *           THE KWM IN THE FIRST LANGUAGE.                   *
      *                                       D.A. PLUM            *
      *                                                            *
      *  01/14/86 THE FOLLOWING PROGRAM CHANGES WERE MADE:
      *           1) REMOVED THE EDIT CHECKS ADDED ON 10/16/85.    *
      *              THE KWM CAN BE THE SAME IN BOTH LANGUAGES.    *
      *           2) THE FOLLOWING CHANGES RELATED TO CORPORATE    *
      *              CODES VERSUS PLANT CODES WERE ADDED.  FOR     *
      *              PURPOSES OF THESE CHANGES CORPORATE AND PLANT *
      *              CODES ARE DEFINED AS FOLLOWS:                 *
      *                                                            *
      *              CORPORATE CODE - AN INTERPLANT CODE DEFINED   *
      *              TO THE CORPORATE DATABASE IN AKRON.           *
      *              CHARACTERS 5, 6 AND 7 OF THIS 7 CHARACTER     *
      *              CODE DO NOT CONTAIN ANY ALPHABETIC CHARACTERS *
      *              (A THRU Z).                                   *
      *                                                            *
      *              PLANT CODE - AN INTRAPLANT CODE WHICH IS NOT  *
      *              DEFINED TO THE CORPORATE DATABASE.  AT LEAST  *
      *              ONE OF THE LAST 3 CHARACTERS OF THIS 7        *
      *              CHARACTER CODE (BYTES 5 THRU 7) MUST CONTAIN  *
      *              AN ALPHABETIC CHARACTER.                      *
      *                                                            *
      *              A STAND-ALONE-PLANT DOES NOT FOLLOW THESE     *
      *              DEFINITIONS OF CORPORATE AND PLANT CODES,     *
      *              INSTEAD IT USES ANY 7 CHARACTER CODE AS A     *
      *              PLANT CODE (EVEN IF THE ITEM AND CODE MATCH   *
      *              AN EXISTING CORPORATE CODE EXACTLY).  BY      *
      *              DEFINITION A STAND-ALONE-PLANT IS NOT LINKED  *
      *              TO THE CORPORATE DATABASE (NO COMPUTER LINK)  *
      *              AND THEREFORE CONTROLS ALL OF ITS CODES AND   *
      *              THEIR DESCRIPTION(S) USING THIS SUBSYSTEM.    *
      *                                                            *
      *              A) CODE ADD FUNCTION:                         *
      *                 PROHIBITED FOR CORPORATE CODES.            *
      *              B) MODIFY KWM AND/OR DESC FUNCTION:           *
      *                 PROHIBITED THE MODIFICATION OF THE         *
      *                 AMERICAN LANGUAGE KWM AND DESC OF          *
      *                 CORPORATE CODES.                           *
      *              C) MODIFY MFR INFORMATION:                    *
      *                 PROHIBITED FOR CORPORATE CODES.            *
      *              D) CODE DELETE FUNCTION:                      *
      *                 PROHIBITED FOR CORPORATE CODES.            *
      *                                       D.A. PLUM            *
      *                                                            *
      *  02/06/86 CREATED SUBPROGRAM SDSCTRNS IN ORDER TO          *
      *           TRANSLATE/MODIFY THE DESCRIPTION IN DDESC        *
      *           AND DDESC2.                                      *
      *                                        A.M. KRAUSS         *
      *                                                            *
      *   03/24/86 CHANGED CALLS TO "TRFMTKWM" AND "TRFMTMFR" TO   *
      *            "CRFMTKWM" AND "CRFMTMFR" TO REFLECT THE CHANGE *
      *            IN SUBPROGRAM NAMING CONVENTIONS.               *
      *                                  D.A. PLUM                 *
      *                                                            *
      *  04/02/86  BROKE OUT THE CODE DELETION AREA INTO A         *
      *            SUBPROGRAM CALLED "SCODEDEL".  THE CODE DELETE  *
      *            CHECK FOR "CORPORATE CODE" WAS ELIMINATED.      *
      *            THE SUBPROG ALSO CREATES A "CODE DELETE"        *
      *            TRANSACTION 110 FOR EACH CODE DELETED.          *
      *                                  C.I.HILLES                *
      *                                                            *
      *  04/02/86  CHANGED THE FORMSFILE VDSCMAIN TO MAKE THE      *
      *            SECONDARY LANGUAGE KEYWORD/MODIFIER REQUIRED    *
      *            WHENEVER THE SECONDARY LANGUAGE FUNCTIONS ARE   *
      *            USED.  NO LOGIC CHANGES WITHIN THIS PROGRAM     *
      *            WERE MADE.  THE CURRENT LOGIC PROVIDES FOR THE  *
      *            BOTH THE PRESENCE AND THE ABSENCE OF A 2ND KWM, *
      *            SO NO PROGRAM CHANGES WOULD BE REQUIRED IF THIS *
      *            FIELD WAS CHANGED BACK TO BEING OPTIONAL.       *
      *                                  D.A. PLUM.                *
      *                                                            *
      *  04/03/86  ADDED ALTERNATE KEY LOGIC TO THE CODE ADD, AND  *
      *            MODIFY KEYWORD/MODIFIER AND/OR DESCRIPTION      *
      *            FUNCTIONS.  WHENEVER A NEW CODE IS ADDED WITH   *
      *            KEYWORD = "CODE" THE MODIFIER IS ADDED TO THE   *
      *            DATASET "MALTKEY" AS AN ALTERNATE KEY.  IN THE  *
      *            MODIFY KWM FUNCTION IF A KEYWORD IS CHANGED     *
      *            FROM OR TO "CODE" THE NECESSARY ADD AND/OR      *
      *            DELETE TO "MALTKEY" IS PERFORMED.               *
      *                                  D.A. PLUM.                *
      *                                                            *
      *  06/10/86  MADE THE FOLLOWING CHANGES:                     *
      *            1) ADDED LOGIC TO THE ADD AND CHANGE MFR INFO   *
      *               ROUTINES TO PROCESS THE SELECTION FIELD      *
      *               WHICH WAS ADDED TO THESE SCREENS.            *
      *            2) CREATE A DDAILYTC RECORD FOR EACH CODE ADDED *
      *               TO MSTORERM.                                 *
      *                                  D.A. PLUM.                *
      *                                                            *
      *  09/04/86  REVISED THE DESCRIPTION ADD AND DESCRIPTION     *
      *            MODIFY ROUTINES TO BEGIN PUTTING DESCRIPTION    *
      *            TEXT INTO ID-NUM "09" RATHER THAN "01".         *
      *            THIS CHANGE WILL MAKE ALL PROGRAMS WHICH ADD    *
      *            DESCRIPTION TO DDESC AND/OR DDESC2 CONSISTENT.  *
      *            ID NUMBERS "01" THRU "08" ARE NOT BEING USED    *
      *            BY ANY PROGRAM AT THIS TIME.                    *
      *                                  D.A. PLUM.                *
      *                                                            *
      *  11/24/86  EXPANDED PRICE FIELDS FROM S9(6)V9(4) TO        *
      *            S9(11)V9(4).  ALSO ADJUSTED THE CODE ADD        *
      *            ROUTINE TO PROPERLY INITIALIZE ALL MSTORERM     *
      *            FIELDS UNDER THE NEW DATASET LAYOUT.            *
      *                                  D.A. PLUM                 *
      *                                                            *
      *C 10/07/93  JEFF BUNGO            REQUEST #6428             *
      *C           ADDED KSAM FILE KMANPART FOR MFR/PART/CC. WHEN  *
      *C           THE MANUFACTURER INFO CHANGES FOR A CODE, UPDATE*
      *C           THE KSAM FILE.                                  *
      *C                                                           *
      *C 04/05/94  BILL ROXBURY                                    *
      *C           PROGRAM CONVERTED TO AS/400 PLATFORM.           *
      *C                                                           *
      *C 10JUN1994       DAVE PLUM          REQUEST #6512          *
      *C    ADDED "UNLOCK" LOGIC FOR FILES DDESC AND DDESC2 AS     *
      *C    NEEDED TO PREVENT THE POSSIBILITY OF A RECORD          *
      *C    REMAINING LOCKED THROUGH A SCREEN.                     *
      *C                                                           *
      *C 13FEB1995       DAVE PLUM                                 *
      *C    REVISED THE START DDESC2 LOGIC FOUND IN PARAGRAPHS     *
      *C    624-RETRIEVE-DDESC2 AND 6252-REPLACE-DDESC2 TO HANDLE  *
      *C    THE CASE WHERE THERE IS NO SECOND LANGUAGE DESCRIPTION *
      *C    ON FILE WHEN THE USER ATTEMPTS TO MODIFY THIS          *
      *C    DESCRIPTION.                                           *
      *C                                                           *
      *C 15FEB1995       DAVE PLUM                                 *
      *C    REVISED SEVERAL IF STATEMENTS WHICH WERE USING THE     *
      *C    INVALID COMBINATION OF "NOT" AND "OR".  ABENDS WERE    *
      *C    OCCURRING IN CHILE BECAUSE OF SOME OF THESE.           *
      *C                                                           *
      *C 08AUG1995       CA YODER   REQ# 95-022                    *
      *C    ADDED LOGIC TO READ MPLTINFO TO OBTAIN A VALUE FOR     *
      *C    ESTIMATED LEAD TIME IF THE SWITCH IS SET TO YES.       *
      *C
      *C 09/12/96  JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   INCLUDE CENTURY FOR INIT AND ACTIVITY DATES.
      *C                                                           *
      *C   1/14/97    BILL ROXBURY REQ #95-012
      *C     UPDATE ENTRIES FROM NEW RECEIVING FILE (MCFLCSRCPT).
      *C
      *C  11/25/97    JEFF BUNGO   REQ #97-017
      *C     ADD USAGE FIELDS FOR DIRECT DELIVERY.  DD USAGE
      *C     TO BE STORED IN ADDITIONAL FIELD AND TOTAL USAGE.
      *C     STORE ISSUE USAGE CALCULATED BY TOTAL USAGE - DD USAGE.
      *C
      *C   19DEC1997     DAVE PLUM
      *C    RECOMPILED TO PICK REVISED "PLANTS" COPYLIB MEMBER.
      *C
      **************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MSTORERM
                  ASSIGN       TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT DDESC
                  ASSIGN       TO DATABASE-MCFLCS1401
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT DDAILYTC
                  ASSIGN       TO DATABASE-MCFLCS1601
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT MALTKEY
                  ASSIGN       TO DATABASE-MCFLCS3001
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT DDESC2
                  ASSIGN       TO DATABASE-MCFLCS3101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT MKEYADJ
                  ASSIGN       TO DATABASE-MCFLCS3301
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT DCODE
                  ASSIGN       TO DATABASE-MCFLCS3402
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT MMANUFACT
                  ASSIGN       TO DATABASE-MCFLCS3501
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT USAGEFILE
                  ASSIGN       TO DATABASE-MCFLCSUSAG
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT RECEIPTFILE
                  ASSIGN       TO DATABASE-MCFLCSRCPT
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT DMANPART
                  ASSIGN       TO DATABASE-MCFLCS3603
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZDSCMAIN-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  MSTORERM
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  DDESC
           LABEL RECORDS ARE STANDARD.
       01  DDESC-REC.
           COPY DDS-MCRPCS1400  OF MCFLCS1401.

       FD  DDAILYTC
           LABEL RECORDS ARE STANDARD.
       01  DDAILYTC-REC.
           COPY DDS-MCRPCS1600  OF MCFLCS1601.

       FD  MALTKEY
           LABEL RECORDS ARE STANDARD.
       01  MALTKEY-REC.
           COPY DDS-MCRPCS3000  OF MCFLCS3001.

       FD  DDESC2
           LABEL RECORDS ARE STANDARD.
       01  DDESC2-REC.
           COPY DDS-MCRPCS3100  OF MCFLCS3101.

       FD  MKEYADJ
           LABEL RECORDS ARE STANDARD.
       01  MKEYADJ-REC.
           COPY DDS-MCRPCS3300  OF MCFLCS3301.

       FD  DCODE
           LABEL RECORDS ARE STANDARD.
       01  DCODE-REC.
           COPY DDS-MCRPCS3400  OF MCFLCS3402.

       FD  MMANUFACT
           LABEL RECORDS ARE STANDARD.
       01  MMANUFACT-REC.
           COPY DDS-MCRPCS3500  OF MCFLCS3501.

       FD  USAGEFILE
           LABEL RECORDS ARE STANDARD.
       01  USAGEFILE-REC.
           COPY DDS-MCRPCSUSAG  OF MCFLCSUSAG.

       FD  RECEIPTFILE
           LABEL RECORDS ARE STANDARD.
       01  RECEIPTFILE-REC.
           COPY DDS-MCRPCSRCPT  OF MCFLCSRCPT.

       FD  DMANPART
           LABEL RECORDS ARE STANDARD.
       01  DMANPART-REC.
           COPY DDS-MCRPCS3600  OF MCFLCS3603.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0501.

       FD  DISPLAY-FILE
           LABEL RECORDS       ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  PASSED-SPOOL-PRT    PIC S9(2)   VALUE 0     COMP-4.
       77  CALC-ADDR           PIC S9(9)   VALUE 0     COMP-4.
       77  ID-NUM-FOR-DDESC    PIC 9(2)    VALUE ZEROES.
       77  ID-NUM-FOR-DDESC2   PIC 9(2)    VALUE ZEROES.
       77  MFR-EDIT-ERROR-SW   PIC X(1)    VALUE "N".
       77  LINES-DESC          PIC 9(2)    VALUE ZEROES.
       77  CK-RESULT           PIC 9(4)    VALUE ZERO.
       77  NO-DB-SW            PIC X(1)    VALUE "N".
       77  DB-SUB              PIC 9(2)    VALUE 0.
       77  KEY-CTR             PIC 9(2)    VALUE 0.
       77  OTHER-BASE          PIC X(18)   VALUE SPACES.
       77  LINK-PLT-CODE       PIC X(3)    VALUE SPACES.
       77  RETURN-COD          PIC X(1)    VALUE SPACES.
       77  LINK-CORP-CODE      PIC X(7)    VALUE SPACES.
       77  KEY-VALUE           PIC X(8)    VALUE SPACES.
       77  KEY-LOC             PIC S9(4)   VALUE 3     COMP-4.
       77  RECSIZE             PIC S9(4)   VALUE 66    COMP-4.
       77  LOCK-COND           PIC S9(4)   VALUE 1     COMP-4.
       77  LABEL-TYPE          PIC S9(4)   VALUE 1     COMP-4.
       77  KEYNUM              PIC S9(4)               COMP-4.
       77  LABEL-NAME          PIC X(16).
       77  TSCRPRT2-ERROR-SW   PIC X(1)    VALUE "N".
       77  SAVE-KEY-HIT        PIC S9(4)   VALUE 0     COMP-4.
       77  TRUE-VAL            PIC 1       VALUE B"1".

       01  FILE-STAT.
           05  FILE-STAT-1     PIC X  VALUE "0".
           05  FILE-STAT-2     PIC X  VALUE "0".

       01  SAVE-AREA-PICX.
           05  SAVE-CODE-STORES          PIC X(7)  VALUE SPACES.
           05  SAVE-BIN-LOC1             PIC X(12) VALUE SPACES.
           05  SAVE-KWM1.
               10 SAVE-KW1               PIC X(20) VALUE SPACES.
               10 SAVE-MOD1              PIC X(30) VALUE SPACES.
           05  SAVE-KWM2.
               10 SAVE-KW2               PIC X(20) VALUE SPACES.
               10 SAVE-MOD2              PIC X(30) VALUE SPACES.
           05  SAVE-OLD-KWM1.
               10 SAVE-OLD-KW1           PIC X(20) VALUE SPACES.
               10 SAVE-OLD-MOD1          PIC X(30) VALUE SPACES.
           05  SAVE-OLD-KWM2.
               10 SAVE-OLD-KW2           PIC X(20) VALUE SPACES.
               10 SAVE-OLD-MOD2          PIC X(30) VALUE SPACES.
           05  SAVE-NEW-KWM1.
               10 SAVE-NEW-KW1           PIC X(20) VALUE SPACES.
               10 SAVE-NEW-MOD1          PIC X(30) VALUE SPACES.
           05  SAVE-NEW-KWM2.
               10 SAVE-NEW-KW2           PIC X(20) VALUE SPACES.
               10 SAVE-NEW-MOD2          PIC X(30) VALUE SPACES.
           05  SAVE-MFR                  PIC X(26) VALUE SPACES.
           05  SAVE-OLD-MFR              PIC X(26) VALUE SPACES.
           05  SAVE-NEW-MFR              PIC X(26) VALUE SPACES.
           05  SAVE-TYPE-IND             PIC X(1)  VALUE SPACES.
           05  SAVE-PARTNO               PIC X(20) VALUE SPACES.
           05  SAVE-ALTKEY               PIC X(40) VALUE SPACES.

           05  SAVE-DESC-TBL.
               10  SAVE-DESC   OCCURS 15 TIMES
                               INDEXED BY SDESC-INDEX
                               PIC X(79).

           05  SAVE-MFR-DATA-TBL.
               10  SAVE-MFR-DATA OCCURS 8 TIMES
                                 INDEXED BY SMFR-INDEX.
                   15 SAVE-MFR-MFR       PIC X(26).
                   15 SAVE-MFR-TYPE      PIC X(1).
                   15 SAVE-MFR-PARTNO    PIC X(20).
                   15 SAVE-MFR-SELECT    PIC X(1).

      **************************************************************
      *  NOTE THE FOLLOWING CONVENTIONS FOR DESC-ID-NUM,           *
      *                                 AND DESC2-ID-NUM:          *
      *                                                            *
      *  DESC-ID-NUM          CONTENTS OF DESC-DATA                *
      *  DESC2-ID-NUM                     DESC2-DATA               *
      *  ===========          ================================     *
      *      00               KEYWORD/MODIFIER                     *
      *  09 THRU 23           DESCRIPTION TEXT                     *
      *      99               LOCAL PLANT DESCRIPTION (DDESC ONLY) *
      *                                                            *
      *  FOR DESCRIPTION TEXT THE 09 RECORD IS FILLED FIRST, AND   *
      *  THE 10 THRU 23 RECORDS ARE THEN USED IN ORDER AS NEEDED.  *
      *                                                            *
      *  WHEN MODIFYING DESCRIPTION TEXT THE 'OLD' DATA IS SIMPLY  *
      *  DELETED FROM DDESC (OR DDESC2) AND THE 'NEW' DATA ADDED.  *
      *  NO ATTEMPT IS MADE TO MODIFY INDIVIDUAL RECORDS WITHIN    *
      *  DDESC OR DDESC2 WITH THE EXCEPTION OF THE 00 AND THE 99   *
      *  RECORDS OF THESE DATASETS.                                *
      *                                                            *
      *  LOCAL PLANT DESCRIPTION IS CONTROLED BY THE SUBPROGRAM    *
      *  "TPLTMAST".                                               *
      *                                                            *
      **************************************************************

       01 ARG-VALUES.
           05  CODE-ARG        PIC X(8)  VALUE SPACES.
           05  KWM-ARG.
               10  KW-ARG      PIC X(20) VALUE SPACES.
               10  MOD-ARG     PIC X(30) VALUE SPACES.
           05  MFR-ARG         PIC X(26) VALUE SPACES.
           05  PARTNO-ARG      PIC X(20) VALUE SPACES.
           05  ALTKEY-ARG      PIC X(40) VALUE SPACES.

       01  DB-LOG-VALUES.
           05 DB-LOG-TEXT      PIC X(8) VALUE "SCODEUPD".
           05 DB-LOG-TEXT-LEN  PIC S9(4) COMP-4 VALUE -8.

       01  FIELD-NUM-TBL.
           05  FIELD-NUM-REC   OCCURS 8 TIMES
                               INDEXED BY FIELD-INDEX.
               10  FIELD-NUM-MFR    PIC S9(4)    COMP-4.
               10  FIELD-NUM-TYPE   PIC S9(4)    COMP-4.
               10  FIELD-NUM-PART   PIC S9(4)    COMP-4.
               10  FIELD-NUM-SELECT PIC S9(4)    COMP-4.

       01  CODEMENU-SCREEN.
           05 MENU-MSGS.
               10  CMDMSGM     PIC X(79).
               10  ERRMSGM     PIC X(79).

       01  CODE-SCREEN.
           05 CODE-PLT-NUM               PIC X(3).
           05 CODE-STORES.
              10 CODE-STORES-1-4         PIC X(4).
              10 CODE-STORES-5           PIC X(1).
              10 CODE-STORES-6           PIC X(1).
              10 CODE-STORES-7           PIC X(1).
           05 CODE-BIN-LOC1              PIC X(12).
           05 CODE-KW1                   PIC X(19).
           05 CODE-MOD1                  PIC X(30).
           05 CODE-KW2                   PIC X(19).
           05 CODE-MOD2                  PIC X(30).
           05 CODE-TOP-MSG-LINE          PIC X(79).
           05 CODE-DESC-TBL.
              10 CODE-DESC     OCCURS 15 TIMES
                               INDEXED BY DESC-INDEX
                               PIC X(79).
           05 CODE-MSG-LINE1   PIC X(79).
           05 CODE-MSG-LINE2   PIC X(79).
           05 CODE-MSGS.
               10  CMDMSGC     PIC X(79).
               10  ERRMSGC     PIC X(79).

       01  MFR-SCREEN.
           05 MFR-CODE-STORES.
              10 MFR-CODE-STORES-1-4     PIC X(4).
              10 MFR-CODE-STORES-5       PIC X(1).
              10 MFR-CODE-STORES-6       PIC X(1).
              10 MFR-CODE-STORES-7       PIC X(1).
           05 MFR-BIN-LOC1               PIC X(12).
           05 MFR-KW1                    PIC X(19).
           05 MFR-MOD1                   PIC X(30).
           05 MFR-KW2                    PIC X(19).
           05 MFR-MOD2                   PIC X(30).
           05 MFR-TOP-MSG-LINE           PIC X(79).
           05 MFR-DATA-TBL.
              10 MFR-DATA      OCCURS 8 TIMES
                               INDEXED BY MFR-INDEX.
                 15 MFR-DATA-MFR         PIC X(26).
                 15 MFR-DATA-TYPE        PIC X(1).
                 15 MFR-DATA-PARTNO      PIC X(20).
                 15 MFR-DATA-SELECT      PIC X(1).
           05 MFR-MSG-LINE1              PIC X(79).
           05 MFR-MSG-LINE2              PIC X(79).
           05 MFR-MSGS.
               10  CMDMSGMFR   PIC X(79).
               10  ERRMSGMFR   PIC X(79).

       01  CODE-DB-ADD-SCREEN.
           05  CODE-HOME-PLT-NUM         PIC X(4).
           05  CODE-STORES-CODE          PIC X(8).
           05  CODE-BIN-LOCATION         PIC X(12).
           05  FUNCT-KEY-DESC            OCCURS 8 TIMES
                                         PIC X(30).
           05  CODE-DB-ADD-MSGLINE       PIC X(79).
           05 ADD-MSGS.
               10  CMDMSGA     PIC X(79).
               10  ERRMSGA     PIC X(79).

       01  FUNCT-KEY-TBL.
           05  FUNCT-KEY-BASE  OCCURS 8 TIMES
                               PIC X(18).
           05  FUNCT-KEY-PLT   OCCURS 8 TIMES
                               PIC X(3).

      ***** NOTE THAT "TPLTMAST" ALSO USES VIEW-COMAREA,   *****
      ***** BASE, AND LANGUAGE-PARMS AS PARAMETERS IN      *****
      ***** ADDITION TO THOSE LISTED BELOW.                *****

       01  TPLTMAST-PARAMETERS.
           05 TPLTMAST-CORP-CODE         PIC X(8)  VALUE SPACES.
           05 TPLTMAST-COMPANY-CODE      PIC X(3)  VALUE SPACES.

       01  USAGE-REC.
           05  FILLER          PIC X(2).
           05  K-CORP-CODE     PIC X(8).
           05  K-MONTHS        OCCURS 14 TIMES
                               INDEXED BY K-INDEX.
               10  K-MTH-USAGE PIC S9(9) COMP-4.
           05  K-MONTHS-DD     OCCURS 14 TIMES
                               INDEXED BY KDD-INDEX.
               10  K-MTH-USAGE-DD PIC S9(9) COMP-4.

       01  RECEIPT-REC.
           05  R-CORP-CODE     PIC X(8).
           05  R-MONTHS        OCCURS 14 TIMES
                               INDEXED BY R-INDEX.
               10  R-MTH-RECEIPTS PIC S9(9) COMP-4.

      *--- FIELD USED FOR STR-EST-LT (VALUE OBTAINED FROM MPLTINFO).
       01  SHIP-DAYS                     PIC 9(4) VALUE 0.

       COPY MKEYADJ            IN COPYLIB.

       COPY DCODE              IN COPYLIB.

       COPY MMANUFAC           IN COPYLIB.

       COPY DMANPART           IN COPYLIB.

       COPY MSTORERM           IN COPYLIB.

       COPY DDESC              IN COPYLIB.

       COPY DDESC2             IN COPYLIB.

       COPY MALTKEY            IN COPYLIB.

       COPY DDAILYTC           IN COPYLIB.

       COPY TC100              IN COPYLIB.

       COPY DBMODES            IN COPYLIB.

       COPY DBSTAT             IN COPYLIB.

       COPY MULTLOCK           IN COPYLIB.

       COPY CRFMTKWM           IN COPYLIB.

       COPY CRFMTMFR           IN COPYLIB.

       COPY CCODECHK           IN COPYLIB.

       COPY TDATECHK           IN COPYLIB.

       COPY TBLOWUP            IN COPYLIB.

       COPY SCREENIO           IN COPYLIB.

       COPY CATREAD            IN COPYLIB.

       COPY MPLT0              IN COPYLIB.

       COPY MPLTPOPT           IN COPYLIB.

       01  MESSAGE-DATA.
           COPY ERRORLIN       IN COPYLIB.

       LINKAGE SECTION.
       01  BASE                PIC X(10).

       COPY VCOMLINK           IN COPYLIB.

       COPY LANGSUB            IN COPYLIB.

       01  MPLTINFO-PARMS.
           05  MPLTINFO-PLANT-CODE       PIC X(3).
           05  MPLTINFO-DDESC-LANG       PIC X(3).
           05  MPLTINFO-DDESC2-LANG      PIC X(3).

       01  MULTIPLE-DB-PLANT   PIC X(1).

       COPY PLTBASES           IN COPYLIB.

       PROCEDURE DIVISION      USING BASE
                               VIEW-COMAREA
                               LANGUAGE-PARMS
                               MPLTINFO-PARMS
                               MULTIPLE-DB-PLANT
                               BASE-AREA.

       0-SCODEUPD-SEC          SECTION 01.

       0-BEGIN-HERE.
           PERFORM 1-HSK.
           PERFORM 6-MAIN      THRU 6-MAIN-X.
           PERFORM 2-EOJ.
           GOBACK.

       1-HSK.
           MOVE "SCODEUPD"     TO BU-PGM-NAME.
           MOVE MPLTINFO-PLANT-CODE TO TPLTMAST-COMPANY-CODE,
                                       PLANT-CHK.
           MOVE  1             TO DATE-MODE.
           CALL "TDATECK2"     USING DATE-CHECK-AREA LANGUAGE-PARMS.

           OPEN I-O            DISPLAY-FILE.
           OPEN I-O            MSTORERM.
           OPEN I-O            DDESC.
           OPEN I-O            DDAILYTC.
           OPEN I-O            MALTKEY.
           OPEN I-O            DDESC2.
           OPEN INPUT          MKEYADJ.
           OPEN I-O            DCODE.
           OPEN INPUT          MMANUFACT.
           OPEN I-O            USAGEFILE.
           OPEN I-O            RECEIPTFILE.
           OPEN I-O            DMANPART.
           OPEN INPUT          MPLTINFO-I.

      *------ SPACE OUT THE THE CODE-DB-ADD-SCREEN.  THE PROGRAM
      *------ WILL LATER CHECK IF THIS IS SPACES BEFORE READING
      *------ THRU THE PLTCODES FILE TO DETERMINE THE PROPER FUNCTION
      *------ KEY ASSOCIATION.
           MOVE SPACES         TO CODE-DB-ADD-SCREEN.

      *--- CHECK MPLTINFO FOR SWITCH TO USE THE DEFAULT SHIP DAYS.
           MOVE "POPT" TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY    MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE ZEROS                    TO  SHIP-DAYS
           ELSE
               IF    MPLTINFO-SHIP-DAYS-SW = "Y" AND
                     MPLTINFO-SHIP-DAYS NUMERIC
                   MOVE MPLTINFO-SHIP-DAYS-9 TO  SHIP-DAYS
               ELSE
                   MOVE ZEROS                TO  SHIP-DAYS
               END-IF
           END-IF.

       2-EOJ.
           CLOSE               DISPLAY-FILE.
           CLOSE               MSTORERM.
           CLOSE               DDESC.
           CLOSE               DDAILYTC.
           CLOSE               MALTKEY.
           CLOSE               DDESC2.
           CLOSE               MKEYADJ.
           CLOSE               DCODE.
           CLOSE               MMANUFACT.
           CLOSE               USAGEFILE.
           CLOSE               RECEIPTFILE.
           CLOSE               DMANPART.
           CLOSE               MPLTINFO-I.

      *********************************************************
      **                  BLOWUP ROUTINE                     **
      *********************************************************

       2-BLOWUP.
           CALL "TBLOWUP"      USING BASE
                               BU-PGM-NAME
                               STATUS-AREA
                               VIEW-COMAREA
                               FILE-STAT
                               BU-DISPLAY-MSG
                               BU-DISPLAY-AREA.

       4-VIEW-ERROR.
           MOVE TRUE-VAL       TO IND(FIELD-NUMBER) IND(99).

       4-SHOW-FORM.
           MOVE "00"           TO SCREEN-STATUS.
           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO 2-EOJ.

       4-SHOW-FORM-X.          EXIT.

       4-PGM-ERROR.
           MOVE TRUE-VAL       TO IND(FIELD-NUMBER) IND(99).

       4-PGM-ERROR-X.          EXIT.

      *********************************************************
      *                                                       *
      *                      6 - M A I N                      *
      *                                                       *
      *********************************************************

       6-MAIN.
           MOVE "CODEMENU"     TO SCREEN-NAME.

       6-SHOW-FORM.
           MOVE CODEMENU-SCREEN TO DISPLAY-REC.
           MOVE "00"           TO SCREEN-STATUS.
           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO 2-EOJ.

       6-READ-FIELDS.
           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO 2-EOJ.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO CODEMENU-SCREEN.

           IF KEY-HIT = 3
               GO TO 6-MAIN-X.

       6-PERFORM-SELECTION.
           IF KEY-HIT = 1
               MOVE "CODEADD"              TO SCREEN-NAME
               PERFORM 61-ADD-CODE         THRU 61-ADD-CODE-X
           ELSE
           IF KEY-HIT = 2
               MOVE "CODEMOD"              TO SCREEN-NAME
               PERFORM 62-MOD-KWM-OR-DESC  THRU 62-MOD-KWM-OR-DESC-X
           ELSE
           IF KEY-HIT = 8
               PERFORM 63-MOD-MFR-INFO     THRU 63-MOD-MFR-INFO-X
           ELSE
           IF KEY-HIT = 4
               PERFORM 64-MOD-INPLANT-DATA THRU 64-MOD-INPLANT-DATA-X
           ELSE
           IF KEY-HIT = 5
               GO TO 6-SHOW-FORM
           ELSE
           IF KEY-HIT = 6
               CALL "SCODEDEL" USING BASE
                               VIEW-COMAREA
                               LANGUAGE-PARMS
                               MPLTINFO-PARMS
           ELSE
           IF KEY-HIT = 7
               CALL "SDSCTRNS" USING BASE
                               VIEW-COMAREA
                               LANGUAGE-PARMS
                               MPLTINFO-PARMS
                               MULTIPLE-DB-PLANT
                               BASE-AREA
           ELSE
      *****    INVALID FUNCTION KEY   *****
               MOVE   9        TO CATREAD-MSG-SET
               MOVE  10        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSGM
               GO TO 6-SHOW-FORM.

           GO TO 6-MAIN.

       6-MAIN-X.               EXIT.

      *********************************************************
      *                                                       *
      *            A D D   S T O R E S   C O D E              *
      *                                                       *
      *********************************************************

       61-SCODEUPD-SEC         SECTION 02.

       61-ADD-CODE.
           MOVE SPACES         TO SAVE-AREA-PICX.
           MOVE "CODEADD1"     TO SCREEN-NAME.

       61-PUT-BUFFER.
           MOVE SPACES         TO CODE-SCREEN.
           MOVE MPLTINFO-PLANT-CODE TO CODE-PLT-NUM.
      ***** INPUT DATA ABOVE AND THEN PRESS 'ENTER' *****
           MOVE   9            TO CATREAD-MSG-SET.
           MOVE  20            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CODE-MSG-LINE1.

       61-SHOW-FORM.
           MOVE CODE-SCREEN    TO DISPLAY-REC.
           MOVE "00"           TO SCREEN-STATUS.
           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO 2-EOJ.

       61-READ-FIELDS.
           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO 2-EOJ.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO CODE-SCREEN.

           IF KEY-HIT = 3
               MOVE SPACES     TO MESSAGE-BUFFER
               GO TO 61-ADD-CODE-X
           ELSE
           IF KEY-HIT = 1 OR
              KEY-HIT = 2 OR
              KEY-HIT = 8 OR
              KEY-HIT = 4 OR
              KEY-HIT = 5 OR
              KEY-HIT = 6 OR
              KEY-HIT = 7
      *****    INVALID FUNCTION KEY    *****
               MOVE   9        TO CATREAD-MSG-SET
               MOVE  10        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
               GO TO 61-SHOW-FORM.

       61-FIELD-EDITS.
           IF CODE-STORES = SPACES
      *****    INPUT STORES CODE ****
               MOVE  09        TO CATREAD-MSG-SET
               MOVE  15        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
               MOVE 2 TO FIELD-NUMBER
               PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
               GO TO 61-SHOW-FORM.
           IF CODE-KW1 = SPACES
      *****    PRIMARY LANGUAGE KEYWORD MUST BE ENTERED *****
               MOVE  16        TO CATREAD-MSG-SET
               MOVE  166       TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
               MOVE 26 TO FIELD-NUMBER
               PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
               GO TO 61-SHOW-FORM.
           IF CODE-MOD1 = SPACES
      *****    PRIMARY LANGUAGE MODIFIER MUST BE ENTERED *****
               MOVE  16        TO CATREAD-MSG-SET
               MOVE  167       TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
               MOVE 27 TO FIELD-NUMBER
               PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
               GO TO 61-SHOW-FORM.

       61-EDIT-CODE.
           MOVE CODE-STORES    TO CODE-CHK-IN.

           CALL "CCODECHK"     USING CCODECHK-PARMS.

           IF CODE-IS-CORP-CODE
      *****    THIS FUNCTION IS NOT AVAILABLE FOR CORPORATE CODES    ***
               MOVE  20        TO CATREAD-MSG-SET
               MOVE  33        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
               MOVE  2         TO FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 61-SHOW-FORM.

           MOVE CODE-STORES    TO CODE-ARG CORPCDE OF MSTORERM.
           READ MSTORERM       INTO BUF-MSTORERM
               NO LOCK
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT-1 NOT = "2"
               IF FILE-STAT = "00"
      *****    STORES CODE ALREADY EXISTS    *****
                   MOVE  19    TO CATREAD-MSG-SET
                   MOVE   8    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
                   MOVE  2     TO FIELD-NUMBER
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   GO TO 61-SHOW-FORM
               ELSE
                   MOVE "READ MSTORERM ERROR IN 61-EDIT-CODE"
                               TO BU-DISPLAY-MSG
                   PERFORM 2-BLOWUP.

       61-EDIT-KWM1.
           MOVE CODE-KW1       TO SEND-KW.
           MOVE CODE-MOD1      TO SEND-MOD.

           CALL "CRFMTKWM"     USING REFORMAT-KWM-AREA
                               BASE
                               VIEW-COMAREA.

           MOVE RETURN-KW      TO KW-ARG  SAVE-KW1.
           MOVE RETURN-MOD     TO MOD-ARG SAVE-MOD1.
           MOVE KWM-ARG        TO KEYWORDADJ OF MKEYADJ.

           READ MKEYADJ        INTO BUF-MKEYADJ
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT-1 = "2"
      *****    KEYWORD/MODIFIER DOES NOT EXIST    *****
                   MOVE  11    TO CATREAD-MSG-SET
                   MOVE   4    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
                   MOVE  26    TO FIELD-NUMBER
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   MOVE  27    TO FIELD-NUMBER
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   GO TO 61-SHOW-FORM
               ELSE
                   MOVE "READ  ERROR IN 61-EDIT-KWM1"
                               TO BU-DISPLAY-MSG
                   PERFORM 2-BLOWUP.

       61-DATA-BASE-ADDS.
      ***  NOW ADDING CODE TO DATA BASE   ***
           MOVE  14            TO CATREAD-MSG-SET.
           MOVE  24            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA.
           MOVE CODE-SCREEN    TO DISPLAY-REC.
           PERFORM 4-SHOW-FORM THRU 4-SHOW-FORM-X.

           MOVE CODE-ARG       TO SAVE-CODE-STORES,
                                  LINK-CORP-CODE.
           MOVE CODE-BIN-LOC1  TO SAVE-BIN-LOC1.

           INITIALIZE BUF-MSTORERM.
           MOVE +0             TO STR-PHY-INV-CYL-9.

           MOVE SAVE-CODE-STORES TO CORP-CODE.
           MOVE SAVE-BIN-LOC1  TO STR-LOC(1).
           MOVE DATE-YMD-OUT   TO STR-INIT-DATE
                                  STR-ACT-DATE.
      *-----COMPUTE CENTURY FOR INIT AND ACT DATE
           IF STR-ACT-DATE-YY > "70"
               MOVE "19" TO STR-INIT-DATE-CC
                            STR-ACT-DATE-CC
           ELSE
               MOVE "20" TO STR-INIT-DATE-CC
                            STR-ACT-DATE-CC.
           MOVE SHIP-DAYS      TO STR-EST-LT.

           PERFORM 611-ADD-MSTORERM THRU 611-ADD-MSTORERM-X.

           MOVE SPACES         TO BUF-DDAILYTC.
           MOVE  1             TO DATE-MODE.
           CALL "TDATECK2"     USING DATE-CHECK-AREA
                               LANGUAGE-PARMS.

           MOVE DATE-YMD-OUT              TO DDAILYTC-DATE.
           MOVE DATE-UNFORMATTED-TIME-OUT TO DDAILYTC-TIME.
           MOVE "100"                     TO DDAILYTC-TC.
           MOVE MPLTINFO-PLANT-CODE       TO DDAILYTC-PLT.
           MOVE SAVE-CODE-STORES          TO TC100-CORP-CODE.
           PERFORM 612-ADD-DDAILYTC       THRU 612-ADD-DDAILYTC-X.

           MOVE SPACES           TO BUF-DCODE.
           MOVE SAVE-KWM1        TO CODE-KEYWORD-MOD.
           MOVE SAVE-CODE-STORES TO CODE-KEY-CODE.
           MOVE "1"              TO CODE-LANGUAGE-IND.
           PERFORM 613-ADD-DCODE THRU 613-ADD-DCODE-X.

           MOVE SPACES           TO BUF-DDESC.
           MOVE SAVE-CODE-STORES TO DESC-CORP-CODE.
           MOVE "00"             TO DESC-ID-NUM.
           MOVE SAVE-KWM1        TO DESC-DATA.
           PERFORM 614-ADD-KWM1-2-DDESC THRU 614-ADD-KWM1-2-DDESC-X.

      ***** IF THE CODE BEING ADDED IS A RAW MATERIAL *****
      ***** (KEYWORD="CODE") PROVIDE AN ALTERNATE KEY *****
      ***** FOR THIS ITEM USING THE MODIFIER.         *****

           IF SAVE-KW1 = "CODE                "
               MOVE SAVE-MOD1  TO SAVE-ALTKEY
               PERFORM 7-ADD-MALTKEY THRU 7-ADD-MALTKEY-X.

           PERFORM 614-ADD-DESC THRU 614-ADD-DESC-X.
           GO TO 61-ADD-CODE.

       61-ADD-CODE-X.          EXIT.

      *********************************************************
      *              A D D    M S T O R E R M                 *
      *********************************************************

       611-ADD-MSTORERM.
           WRITE MSTORERM-REC  FROM BUF-MSTORERM
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "PUT MSTORERM ERROR IN 611-ADD-MSTORERM"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

      *********************************************************
      *  FOR EACH CODE ADDED TO MSTORERM, AN ENTRY MUST ALSO  *
      *  BE ADDED IN THE KSAM "USAGFIL" WITH ALL USAGE        *
      *  FIGURES INITIALIZED TO ZERO.                         *
      *********************************************************

           MOVE SAVE-CODE-STORES TO K-CORP-CODE.

           PERFORM 6111-INITIALIZE-USAGE
              VARYING K-INDEX FROM 1 BY 1
                UNTIL K-INDEX IS GREATER THAN 14.

           WRITE USAGEFILE-REC FROM USAGE-REC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "WRITE ERROR IN 611-ADD-MSTORERM"
                               TO BU-DISPLAY-MSG
               MOVE "STORES CODE ="  TO BU-DISPLAY-FLD(1)
               MOVE SAVE-CODE-STORES TO BU-DISPLAY-FLD(2)
               PERFORM 2-BLOWUP.

      *********************************************************
      *  FOR EACH CODE ADDED TO MSTORERM, AN ENTRY MUST ALSO  *
      *  BE ADDED IN THE FILE "RECEIPTS" WITH ALL COUNTER     *
      *  FIGURES INITIALIZED TO ZERO.                         *
      *********************************************************

           MOVE SAVE-CODE-STORES TO R-CORP-CODE.

           PERFORM 6111-INITIALIZE-RECEIPT
              VARYING R-INDEX FROM 1 BY 1
                UNTIL R-INDEX IS GREATER THAN 14.

           WRITE RECEIPTFILE-REC FROM RECEIPT-REC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "WRITE ERROR IN 611-ADD-MSTORERM"
                               TO BU-DISPLAY-MSG
               MOVE "STORES CODE ="  TO BU-DISPLAY-FLD(1)
               MOVE SAVE-CODE-STORES TO BU-DISPLAY-FLD(2)
               PERFORM 2-BLOWUP.

       611-ADD-MSTORERM-X.     EXIT.

       6111-INITIALIZE-USAGE.
           MOVE 0              TO K-MTH-USAGE(K-INDEX).
           MOVE 0              TO K-MTH-USAGE-DD(K-INDEX).

       6111-INITIALIZE-RECEIPT.
           MOVE 0              TO R-MTH-RECEIPTS(R-INDEX).

      *********************************************************
      *               A D D   D D A I L Y T C                 *
      *********************************************************

       612-ADD-DDAILYTC.
           WRITE DDAILYTC-REC  FROM BUF-DDAILYTC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "PUT DDAILYTC ERROR IN 612-ADD-DDAILYTC"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

       612-ADD-DDAILYTC-X.     EXIT.

      *********************************************************
      *                A D D   D C O D E                      *
      *********************************************************

       613-ADD-DCODE.
           WRITE DCODE-REC     FROM BUF-DCODE
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "PUT DCODE ERROR IN 613-ADD-DCODE"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

       613-ADD-DCODE-X.        EXIT.

      *********************************************************
      *           ADD KEYWORD/MODIFIER (1) TO DDESC           *
      *********************************************************

       614-ADD-KWM1-2-DDESC.
           WRITE DDESC-REC     FROM BUF-DDESC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "PUT DDESC ERROR IN 614-ADD-KWM1-2-DDESC"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

       614-ADD-KWM1-2-DDESC-X. EXIT.

      *********************************************************
      *                                                       *
      *        A D D   C O D E   D E S C R I P T I O N        *
      *                                                       *
      *********************************************************

       614-ADD-DESC.
           MOVE "CODEADD2"     TO SCREEN-NAME.

       614-PUT-BUFFER.
           MOVE SAVE-KW1       TO CODE-KW1.
           MOVE SAVE-MOD1      TO CODE-MOD1.

      ***  INPUT COMPLETE STORES CODE DESCRIPTION BELOW  ***
           MOVE   9            TO CATREAD-MSG-SET.
           MOVE  21            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CODE-TOP-MSG-LINE.

      ***  PRESS 'ENTER' TO PROCESS DESCRIPTION AND CONTINUE WITH  ***
      ***  MANUFACTURER DATA                                       ***
           MOVE  16            TO CATREAD-MSG-SET.
           MOVE  21            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CODE-MSG-LINE1.

      ***  PRESS 'F2' TO PROCESS - ADD NEXT CODE, 'F8' TO PROCESS - ADD ***
      ***  2ND LANG DATA                                                ***
           MOVE  16            TO CATREAD-MSG-SET.
           MOVE  22            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CODE-MSG-LINE2.

       614-SHOW-FORM.
           MOVE CODE-SCREEN    TO DISPLAY-REC.
           MOVE "00"           TO SCREEN-STATUS.
           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO 2-EOJ.

       614-READ-FIELDS.
           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO 2-EOJ.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO CODE-SCREEN.

           IF KEY-HIT = 3
               MOVE SPACES     TO MESSAGE-BUFFER
               GO TO 614-ADD-DESC-X
           ELSE
           IF KEY-HIT = 5
               GO TO 614-SHOW-FORM
           ELSE
           IF KEY-HIT = 1 OR
              KEY-HIT = 4 OR
              KEY-HIT = 6 OR
              KEY-HIT = 7
      *****   INVALID FUNCTION KEY    *****
              MOVE   9         TO CATREAD-MSG-SET
              MOVE  10         TO CATREAD-MSG-NUM
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
              GO TO 614-SHOW-FORM.

           MOVE KEY-HIT   TO SAVE-KEY-HIT.

       614-PROCESS-DESC.
      ***  NOW ADDING CODE DESCRIPTION TO DATA BASE  ***
           MOVE  14            TO CATREAD-MSG-SET.
           MOVE  25            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA.
           MOVE CODE-SCREEN    TO DISPLAY-REC.
           PERFORM 4-SHOW-FORM THRU 4-SHOW-FORM-X.

           PERFORM 6141-ADD-DESC-TO-DDESC.

           IF SAVE-KEY-HIT = 8
               PERFORM 6142-ADD-LANG2-DATA THRU 6142-ADD-LANG2-DATA-X.

           IF SAVE-KEY-HIT = 2 OR 3
               NEXT SENTENCE
           ELSE
               PERFORM 6143-ADD-MFR-INFO THRU 6143-ADD-MFR-INFO-X
               MOVE "CODEADD"  TO SCREEN-NAME.

       614-ADD-DESC-X.         EXIT.

      *********************************************************
      *             ADD DESCRIPTION TO DDESC                  *
      *********************************************************

       6141-ADD-DESC-TO-DDESC.
           MOVE 9              TO ID-NUM-FOR-DDESC.

           PERFORM 61411-PROCESS-DESC-LINE
              VARYING DESC-INDEX FROM 1 BY 1
              UNTIL DESC-INDEX IS GREATER THAN 15.

       61411-PROCESS-DESC-LINE.
           IF CODE-DESC(DESC-INDEX) = SPACES
               NEXT SENTENCE
           ELSE
               MOVE SPACES                 TO BUF-DDESC
               MOVE SAVE-CODE-STORES       TO DESC-CORP-CODE
               MOVE ID-NUM-FOR-DDESC       TO DESC-ID-NUM
               MOVE CODE-DESC(DESC-INDEX)  TO DESC-DATA
               WRITE DDESC-REC FROM BUF-DDESC
                   INVALID KEY MOVE FILE-STAT TO FILE-STAT
               END-WRITE
               IF FILE-STAT NOT = "00"
                   MOVE "PUT DDESC ERROR IN 61411-PROCESS-DESC-LINE"
                               TO BU-DISPLAY-MSG
                   PERFORM 2-BLOWUP
               ELSE
                   ADD  1      TO ID-NUM-FOR-DDESC.

      *********************************************************
      *                                                       *
      *       A D D   2 N D   L A N G U A G E   D A T A       *
      *                                                       *
      *********************************************************

       6142-ADD-LANG2-DATA.
           MOVE "CODEADD2_LANG2" TO SCREEN-NAME.

       6142-PUT-BUFFER.
      ***  INPUT KEYWORD/MODIFIER AND/OR DESCRIPTION IN THE 2ND LANGUAGE ***
           MOVE   9            TO CATREAD-MSG-SET.
           MOVE  16            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CODE-TOP-MSG-LINE.

           MOVE SPACES TO CODE-DESC-TBL.

      ***  PRESS 'ENTER' TO PROCESS 2ND LANGUAGE DATA AND CONTINUE ***
      ***  WITH MFR DATA                                           ***
           MOVE  16            TO CATREAD-MSG-SET.
           MOVE  19            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CODE-MSG-LINE1.

      ***  PRESS  'f2'   TO PROCESS 2ND LANGUAGE DATA AND ADD NEXT CODE  ***
           MOVE  16            TO CATREAD-MSG-SET.
           MOVE  20            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CODE-MSG-LINE2.

       6142-SHOW-FORM.
           MOVE CODE-SCREEN    TO DISPLAY-REC.
           MOVE "00"           TO SCREEN-STATUS.
           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO 2-EOJ.

       6142-READ-FIELDS.
           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO 2-EOJ.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO CODE-SCREEN.

           IF KEY-HIT = 3
               MOVE KEY-HIT TO SAVE-KEY-HIT
               MOVE SPACES     TO MESSAGE-BUFFER
               GO TO 6142-ADD-LANG2-DATA-X
           ELSE
           IF KEY-HIT = 1 OR
              KEY-HIT = 8 OR
              KEY-HIT = 4 OR
              KEY-HIT = 5 OR
              KEY-HIT = 6 OR
              KEY-HIT = 7
      *****   INVALID FUNCTION KEY    *****
              MOVE   9         TO CATREAD-MSG-SET
              MOVE  10         TO CATREAD-MSG-NUM
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
              GO TO 6142-SHOW-FORM.

           MOVE KEY-HIT   TO SAVE-KEY-HIT.

       6142-EDIT-KWM2.

      ***  EFFECTIVE 04/02/86 THE SECOND KWM IS REQUIRED BY THE     ***
      ***  FORMFILE.  THE FOLLOWING LOGIC IS LEFT IN PLACE IN CASE  ***
      ***  THE SECOND KWM BECOMES OPTIONAL AGAIN IN THE FUTURE.     ***

      ***  IF A SECOND KEYWORD/MODIFIER HAS BEEN ENTERED IT MUST     ***
      ***  BE EDITED, OTHERWISE PROCEED WITH ADDING THE DESCRIPTION  ***
      ***  TO DDESC2.                                                ***

           IF (CODE-KW2 = SPACES) AND (CODE-MOD2 = SPACES)
               MOVE SPACES     TO SAVE-KWM2
               GO TO 6142-DATA-BASE-ADDS
           ELSE
               IF CODE-KW2 = SPACES
      *****  SECONDARY LANGUAGE KEYWORD MUST BE ENTERED *****
                   MOVE  19    TO CATREAD-MSG-SET
                   MOVE  45    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
                   MOVE 28 TO FIELD-NUMBER
                   PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
                   GO TO 6142-SHOW-FORM
               END-IF
               IF CODE-MOD2 = SPACES
      *****  SECONDARY LANGUAGE MODIFIER MUST BE ENTERED *****
                   MOVE  19    TO CATREAD-MSG-SET
                   MOVE  45    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
                   MOVE 29 TO FIELD-NUMBER
                   PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
                   GO TO 6142-SHOW-FORM
               END-IF
           END-IF.

           MOVE CODE-KW2       TO SEND-KW.
           MOVE CODE-MOD2      TO SEND-MOD.

           CALL "CRFMTKWM"     USING REFORMAT-KWM-AREA,
                               BASE, VIEW-COMAREA.

           MOVE RETURN-KW      TO KW-ARG, SAVE-KW2.
           MOVE RETURN-MOD     TO MOD-ARG, SAVE-MOD2.
           MOVE KWM-ARG        TO KEYWORDADJ OF MKEYADJ.

           READ MKEYADJ        INTO BUF-MKEYADJ
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT-1 = "2"
      *****  KEYWORD/MODIFIER DOES NOT EXIST  *****
                   MOVE  11    TO CATREAD-MSG-SET
                   MOVE   4    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
                   MOVE  28    TO FIELD-NUMBER
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   MOVE 29 TO FIELD-NUMBER
                   PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
                   GO TO 6142-SHOW-FORM
               ELSE
                   MOVE "READ ERROR IN 6142-EDIT-KWM2"
                               TO BU-DISPLAY-MSG
                   PERFORM 2-BLOWUP.

       6142-DATA-BASE-ADDS.
      ***  NOW UPDATING DATA DASE  ***
           MOVE  14            TO CATREAD-MSG-SET.
           MOVE  28            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA.
           MOVE CODE-SCREEN    TO DISPLAY-REC.
           PERFORM 4-SHOW-FORM THRU 4-SHOW-FORM-X.

      ***** IF THIS IS A RAW MATERIAL CODE (KEYWORD="CODE") *****
      ***** THE MODIFIER IS ADDED AS AN ALTERNATE KEY.      *****

           IF SAVE-KWM2 IS EQUAL TO SPACES
               NEXT SENTENCE
           ELSE
               PERFORM 61421-ADD-KWM2-TO-DCODE
               PERFORM 61422-ADD-KWM2-TO-DDESC2
               IF SAVE-KW2 = "CODE                "
                   MOVE SAVE-MOD2 TO SAVE-ALTKEY
                   PERFORM 7-ADD-MALTKEY THRU 7-ADD-MALTKEY-X.

           PERFORM 61423-ADD-DESC2-TO-DDESC2.

       6142-ADD-LANG2-DATA-X.  EXIT.

      *********************************************************
      *                A D D   D C O D E                      *
      *********************************************************

       61421-ADD-KWM2-TO-DCODE.
           MOVE SPACES           TO BUF-DCODE.
           MOVE SAVE-KWM2        TO CODE-KEYWORD-MOD.
           MOVE SAVE-CODE-STORES TO CODE-KEY-CODE.
           MOVE "2"              TO CODE-LANGUAGE-IND.

           WRITE DCODE-REC     FROM BUF-DCODE
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "PUT DCODE ERROR IN 61421-ADD-KWM2-TO-DCODE"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

      *********************************************************
      *           ADD KEYWORD/MODIFIER (2) TO DDESC2          *
      *********************************************************

       61422-ADD-KWM2-TO-DDESC2.
           MOVE SPACES           TO BUF-DDESC2.
           MOVE SAVE-CODE-STORES TO DESC2-CORP-CODE.
           MOVE "00"             TO DESC2-ID-NUM.
           MOVE SAVE-KWM2        TO DESC2-DATA.

           WRITE DDESC2-REC    FROM BUF-DDESC2
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "PUT DDESC2 ERROR IN 61422-ADD-KWM2-TO-DDESC2"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

      *********************************************************
      *          ADD DESCRIPTION (2) TO DDESC2                *
      *********************************************************

       61423-ADD-DESC2-TO-DDESC2.
           MOVE  9  TO ID-NUM-FOR-DDESC2.

           PERFORM 614231-PROCESS-DESC-LINE
              VARYING DESC-INDEX FROM 1 BY 1
              UNTIL DESC-INDEX IS GREATER THAN 15.

       614231-PROCESS-DESC-LINE.
           IF CODE-DESC(DESC-INDEX) = SPACES
             NEXT SENTENCE
           ELSE
             MOVE SPACES                 TO BUF-DDESC2
             MOVE SAVE-CODE-STORES       TO DESC2-CORP-CODE
             MOVE ID-NUM-FOR-DDESC2      TO DESC2-ID-NUM
             MOVE CODE-DESC(DESC-INDEX)  TO DESC2-DATA
             WRITE DDESC2-REC  FROM BUF-DDESC2
                 INVALID KEY   MOVE FILE-STAT TO FILE-STAT
             END-WRITE
             IF FILE-STAT NOT = "00"
                 MOVE "PUT DDESC2 ERROR IN 614231-PROCESS-DESC-LINE"
                               TO BU-DISPLAY-MSG
                 PERFORM 2-BLOWUP
             ELSE
                 ADD  1        TO ID-NUM-FOR-DDESC2.

      *********************************************************
      *                                                       *
      *       A D D   M A N U F A C T U R E R   I N F O       *
      *                                                       *
      *********************************************************

       6143-ADD-MFR-INFO.
           MOVE "CODEADD3"     TO SCREEN-NAME.

       6143-PUT-BUFFER.
           MOVE SPACES           TO MFR-SCREEN.
           MOVE SAVE-CODE-STORES TO MFR-CODE-STORES.
           MOVE SAVE-BIN-LOC1    TO MFR-BIN-LOC1.
           MOVE SAVE-KW1         TO MFR-KW1.
           MOVE SAVE-MOD1        TO MFR-MOD1.
           MOVE SAVE-KW2         TO MFR-KW2.
           MOVE SAVE-MOD2        TO MFR-MOD2.

      ***  INPUT MANUFACTURER INFORMATION BELOW  ***
           MOVE   9            TO CATREAD-MSG-SET.
           MOVE  22            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO MFR-TOP-MSG-LINE.

      ***  PRESS 'ENTER' TO PROCESS MANUFACTURER INFO AND CONTINUE  ***
      ***  WITH INPLANT DATA                                        ***
           MOVE  16            TO CATREAD-MSG-SET.
           MOVE  23            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO MFR-MSG-LINE1.

      ***  PRESS  'f2'   TO PROCESS MANUFACTURER INFO AND ADD   ***
      ***  NEXT CODE                                            ***
           MOVE  16            TO CATREAD-MSG-SET.
           MOVE  34            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO MFR-MSG-LINE2.

       6143-SHOW-FORM.
           MOVE MFR-SCREEN     TO DISPLAY-REC.
           MOVE "00"           TO SCREEN-STATUS.
           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO 2-EOJ.

       6143-READ-FIELDS.
           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO 2-EOJ.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO MFR-SCREEN.

           IF KEY-HIT = 3
               MOVE SPACES     TO MESSAGE-BUFFER
               GO TO 6143-ADD-MFR-INFO-X
           ELSE
           IF KEY-HIT = 1 OR
              KEY-HIT = 8 OR
              KEY-HIT = 4 OR
              KEY-HIT = 5 OR
              KEY-HIT = 6 OR
              KEY-HIT = 7
      *****   INVALID FUNCTION KEY    *****
              MOVE   9         TO CATREAD-MSG-SET
              MOVE  10         TO CATREAD-MSG-NUM
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
              GO TO 6143-SHOW-FORM.

           MOVE KEY-HIT   TO SAVE-KEY-HIT.

       6143-EDIT-MFR.
           MOVE  35            TO FIELD-NUM-MFR(1).
           MOVE  39            TO FIELD-NUM-TYPE(1).
           MOVE  40            TO FIELD-NUM-PART(1).
           MOVE  68            TO FIELD-NUM-SELECT(1).
           MOVE  41            TO FIELD-NUM-MFR(2).
           MOVE  42            TO FIELD-NUM-TYPE(2).
           MOVE  43            TO FIELD-NUM-PART(2).
           MOVE  69            TO FIELD-NUM-SELECT(2).
           MOVE  44            TO FIELD-NUM-MFR(3).
           MOVE  45            TO FIELD-NUM-TYPE(3).
           MOVE  46            TO FIELD-NUM-PART(3).
           MOVE  70            TO FIELD-NUM-SELECT(3).
           MOVE  47            TO FIELD-NUM-MFR(4).
           MOVE  48            TO FIELD-NUM-TYPE(4).
           MOVE  49            TO FIELD-NUM-PART(4).
           MOVE  71            TO FIELD-NUM-SELECT(4).
           MOVE  50            TO FIELD-NUM-MFR(5).
           MOVE  51            TO FIELD-NUM-TYPE(5).
           MOVE  52            TO FIELD-NUM-PART(5).
           MOVE  72            TO FIELD-NUM-SELECT(5).
           MOVE  53            TO FIELD-NUM-MFR(6).
           MOVE  54            TO FIELD-NUM-TYPE(6).
           MOVE  55            TO FIELD-NUM-PART(6).
           MOVE  73            TO FIELD-NUM-SELECT(6).
           MOVE  56            TO FIELD-NUM-MFR(7).
           MOVE  57            TO FIELD-NUM-TYPE(7).
           MOVE  58            TO FIELD-NUM-PART(7).
           MOVE  74            TO FIELD-NUM-SELECT(7).
           MOVE  60            TO FIELD-NUM-MFR(8).
           MOVE  61            TO FIELD-NUM-TYPE(8).
           MOVE  62            TO FIELD-NUM-PART(8).
           MOVE  75            TO FIELD-NUM-SELECT(8).
           MOVE "N"            TO MFR-EDIT-ERROR-SW.

           PERFORM 61431-EDIT-A-MFR
              VARYING MFR-INDEX FROM 1 BY 1
                UNTIL MFR-INDEX IS GREATER THAN 8
                   OR MFR-EDIT-ERROR-SW = "Y".

           IF MFR-EDIT-ERROR-SW = "Y"
               PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
               GO TO 6143-SHOW-FORM.

       6143-DATA-BASE-ADDS.
      ***  NOW ADDING MANUFACTURER INFO TO DATA BASE  ***
           MOVE  14            TO CATREAD-MSG-SET.
           MOVE  26            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA.
           MOVE MFR-SCREEN     TO DISPLAY-REC.
           PERFORM 4-SHOW-FORM THRU 4-SHOW-FORM-X.

           PERFORM 61432-ADD-DMANPART THRU 61432-ADD-DMANPART-X
              VARYING MFR-INDEX FROM 1 BY 1
                UNTIL MFR-INDEX IS GREATER THAN 8.

           IF SAVE-KEY-HIT = 1 OR 2
               NEXT SENTENCE
           ELSE
               PERFORM 61433-ADD-INPLANT-DATA
                    THRU 61433-ADD-INPLANT-DATA-X.

       6143-ADD-MFR-INFO-X.    EXIT.

       61431-EDIT-A-MFR.
           IF MFR-DATA-MFR(MFR-INDEX) = SPACES
               IF MFR-DATA-PARTNO(MFR-INDEX) NOT = SPACES
                   MOVE "Y"    TO MFR-EDIT-ERROR-SW
      *****    LEAVE PARTNO BLANK WHEN MANUFACTURER NOT ENTERED *****
                   MOVE  12    TO CATREAD-MSG-SET
                   MOVE  13    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
                   SET FIELD-INDEX TO MFR-INDEX
                   MOVE FIELD-NUM-PART(FIELD-INDEX) TO FIELD-NUMBER
               ELSE
                   NEXT SENTENCE
           ELSE
               IF  MFR-DATA-TYPE(MFR-INDEX) NOT = "B" AND
                                            NOT = "C" AND
                                            NOT = "D" AND
                                            NOT = "K" AND
                                            NOT = "M" AND
                                            NOT = "P" AND
                                            NOT = "S" AND
                                            NOT = SPACES
                   MOVE "Y"    TO MFR-EDIT-ERROR-SW
      *****    INVALID TYPE ENTERED       *****
                   MOVE  9     TO CATREAD-MSG-SET
                   MOVE  108   TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
                   SET FIELD-INDEX TO MFR-INDEX
                   MOVE FIELD-NUM-TYPE(FIELD-INDEX) TO FIELD-NUMBER
               ELSE
               IF  MFR-DATA-SELECT(MFR-INDEX) NOT = "P" AND
                                            NOT = "S" AND
                                            NOT = "B" AND
                                            NOT = SPACES
                   MOVE "Y"    TO MFR-EDIT-ERROR-SW
      *****    INVALID SELECT ENTERED    *****
                   MOVE  9     TO CATREAD-MSG-SET
                   MOVE  109   TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
                   SET FIELD-INDEX TO MFR-INDEX
                   MOVE FIELD-NUM-SELECT(FIELD-INDEX) TO FIELD-NUMBER
               ELSE
               MOVE MFR-DATA-MFR(MFR-INDEX) TO SEND-MFR
               CALL "CRFMTMFR" USING REFORMAT-MFR-AREA,
                               BASE, VIEW-COMAREA
               MOVE RETURN-MFR TO MFR-ARG MFR-DATA-MFR(MFR-INDEX)
               MOVE MFR-ARG    TO MANUFACT OF MMANUFACT
               READ MMANUFACT  INTO BUF-MMANUFACT
                   INVALID KEY MOVE FILE-STAT TO FILE-STAT
               END-READ
               IF FILE-STAT-1 = "2"
                   MOVE "Y"    TO MFR-EDIT-ERROR-SW
      *****    MANUFACTURER DOES NOT EXIST    *****
                   MOVE  13    TO CATREAD-MSG-SET
                   MOVE  10    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
                   SET FIELD-INDEX TO MFR-INDEX
                   MOVE FIELD-NUM-MFR(FIELD-INDEX) TO FIELD-NUMBER
               ELSE
               IF FILE-STAT NOT = "00"
                   MOVE "READ MMANUFACT ERROR IN 61431-EDIT-A-MFR"
                               TO BU-DISPLAY-MSG
                   PERFORM 2-BLOWUP
               ELSE
                   NEXT SENTENCE.

       61432-ADD-DMANPART.
           IF MFR-DATA-MFR(MFR-INDEX) = SPACES
               GO TO 61432-ADD-DMANPART-X.

           MOVE SPACES                      TO BUF-DMANPART.
           MOVE MFR-DATA-MFR(MFR-INDEX)     TO MAN-NAME.
           MOVE MFR-DATA-TYPE(MFR-INDEX)    TO MAN-PARTNO-TYPE.
           MOVE MFR-DATA-PARTNO(MFR-INDEX)  TO MAN-PARTNO.
           MOVE MFR-DATA-SELECT(MFR-INDEX)  TO MAN-PARTNO-SELECT.
           MOVE SAVE-CODE-STORES            TO MAN-CORPCODE.

           WRITE DMANPART-REC  FROM BUF-DMANPART
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "PUT DMANPART ERROR IN 61432-ADD-DMANPART"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

       61432-ADD-DMANPART-X.   EXIT.

      *********************************************************
      *                                                       *
      *          A D D   I N P L A N T   D A T A              *
      *                                                       *
      *********************************************************

       61433-ADD-INPLANT-DATA.
           MOVE SAVE-CODE-STORES  TO TPLTMAST-CORP-CODE.

           CALL "TPLTMAST"     USING BASE
                               VIEW-COMAREA
                               TPLTMAST-CORP-CODE
                               TPLTMAST-COMPANY-CODE
                               LANGUAGE-PARMS.

       61433-ADD-INPLANT-DATA-X.    EXIT.

       6151-READ-PLTCODES.
           IF BASE-PLT-DESC(DB-SUB) = SPACES OR
              BASE-PLT(DB-SUB) = MPLTINFO-PLANT-CODE
               NEXT SENTENCE
           ELSE
               MOVE BASE-PLT-DESC(DB-SUB) TO FUNCT-KEY-DESC(KEY-CTR)
               MOVE BASES(DB-SUB)         TO FUNCT-KEY-BASE(KEY-CTR)
               MOVE BASE-PLT(DB-SUB)      TO FUNCT-KEY-PLT(KEY-CTR)
               ADD  1                     TO KEY-CTR.

           ADD 1 TO DB-SUB.
           IF DB-SUB < 7
               GO TO 6151-READ-PLTCODES.

           MOVE "TO EXIT WITHOUT PROCESSING" TO FUNCT-KEY-DESC(8).

       6151-ALL-FUNCTION-KEYS.
           IF KEY-CTR < 8
               MOVE "INVALID FUNCTION KEY"  TO FUNCT-KEY-DESC(KEY-CTR)
               MOVE SPACES                  TO FUNCT-KEY-BASE(KEY-CTR)
               MOVE SPACES                  TO FUNCT-KEY-PLT(KEY-CTR)
               ADD 1                        TO KEY-CTR
               GO TO 6151-ALL-FUNCTION-KEYS.

       6151-READ-PLTCODES-X.      EXIT.

      *********************************************************
      *                                                       *
      *      MODIFY KEYWORD/MODIFIER AND/OR DESCRIPTION       *
      *                                                       *
      *********************************************************

       62-SCODEUPD-SEC         SECTION 03.

       62-MOD-KWM-OR-DESC.
           MOVE SPACES         TO SAVE-AREA-PICX.
           MOVE "CODEMOD1"     TO SCREEN-NAME.

       62-PUT-BUFFER.
           MOVE SPACES         TO CODE-SCREEN.
           MOVE MPLTINFO-PLANT-CODE TO  CODE-PLT-NUM.

      ***  MODIFY KEYWORD/MODIFIER AND/OR DESCRIPTION  ***
           MOVE  13            TO CATREAD-MSG-SET.
           MOVE  12            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CODE-TOP-MSG-LINE.

      ***  INPUT STORES CODE  ***
           MOVE   9            TO CATREAD-MSG-SET.
           MOVE  15            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CODE-MSG-LINE1.

      ***  PRESS 'ENTER' FOR 1ST LANGUAGE DATA, 'F8' FOR 2ND LANGUAGE ***
      ***  DATA                                                       ***
           MOVE  16            TO CATREAD-MSG-SET.
           MOVE  18            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CODE-MSG-LINE2.

       62-SHOW-FORM.
           MOVE CODE-SCREEN    TO DISPLAY-REC.
           MOVE "00"           TO SCREEN-STATUS.
           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO 2-EOJ.

       62-READ-FIELDS.
           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO 2-EOJ.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO CODE-SCREEN.

           IF KEY-HIT = 3
               MOVE SPACES     TO MESSAGE-BUFFER
               GO TO 62-MOD-KWM-OR-DESC-X
           ELSE
           IF KEY-HIT = 1 OR
              KEY-HIT = 2 OR
              KEY-HIT = 4 OR
              KEY-HIT = 5 OR
              KEY-HIT = 6 OR
              KEY-HIT = 7
      *****    INVALID FUNCTION KEY    *****
               MOVE   9        TO CATREAD-MSG-SET
               MOVE  10        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
               GO TO 62-SHOW-FORM.

           MOVE KEY-HIT   TO SAVE-KEY-HIT.

       62-FIELD-EDITS.
           IF CODE-STORES = SPACES
              MOVE "CODE MUST BE ENTERED" TO ERRMSGC ERRMSGMFR ERRMSGA
      *****  INPUT STORES CODE  *****
                   MOVE  9     TO CATREAD-MSG-SET
                   MOVE  15    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
              MOVE 2 TO FIELD-NUMBER
              PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
              GO TO 62-SHOW-FORM.

       62-EDIT-CODE.
      ***** THE AMERICAN LANGUAGE KWM AND DESCRIPTION ASSOCIATED *****
      ***** WITH A CORPORATE CODE IS NOT TO BE MODIFIED USING    *****
      ***** THIS PROGRAM.   THESE CHANGES MUST BE MADE ON THE    *****
      ***** IBM SYSTEM AND DOWNLOADED TO THE PLANT.              *****
      *****                                                      *****
      ***** THE FOLLOWING EDIT CHECK IS USED TO INSURE THAT      *****
      ***** AMERICAN LANGUAGE DATA (CORPORATE DESC AND KWM) ARE  *****
      ***** NOT ALTERED.                                         *****
      *****                                                      *****
      ***** IF MPLTINFO-DDESC-LANG = "001" (AMERICAN)            *****
      *****   THE CORPORATE DESCRIPTION IS MAINTAINED IN DDESC   *****
      *****   AND THE DCODE ENTRY WITH LANGUAGE-IND = "1 " IS    *****
      *****   THE CORPORATE KEYWORD/MODIFIER.                    *****
      *****                                                      *****
      ***** IF MPLTINFO-DDESC2-LANG = "001" (AMERICAN)           *****
      *****   THE CORPORATE DESCRIPTION IS MAINTAINED IN DDESC2  *****
      *****   AND THE DCODE ENTRY WITH LANGUAGE-IND = "2 " IS    *****
      *****   THE CORPORATE KEYWORD/MODIFIER.                    *****

           MOVE CODE-STORES    TO CODE-CHK-IN.

           CALL "CCODECHK"     USING CCODECHK-PARMS.

           IF CODE-IS-CORP-CODE
             IF  ((SAVE-KEY-HIT = 0
                     AND MPLTINFO-DDESC-LANG = "001")
              OR  (SAVE-KEY-HIT = 8
                     AND MPLTINFO-DDESC2-LANG = "001"))
      *****      THIS FUNCTION IS NOT AVAILABLE FOR CORPORATE CODES  *****
                 MOVE  20      TO CATREAD-MSG-SET
                 MOVE  33      TO CATREAD-MSG-NUM
                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                 MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
                 MOVE  2       TO FIELD-NUMBER
                 PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                 GO TO 62-SHOW-FORM.

           MOVE CODE-STORES    TO CODE-ARG, SAVE-CODE-STORES
                                  CORPCDE OF MSTORERM.


           READ MSTORERM       INTO BUF-MSTORERM
               NO LOCK
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT-1 = "2"
      *****    STORES CODE DOES NOT EXIST   *****
                   MOVE  19    TO CATREAD-MSG-SET
                   MOVE   9    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
                   MOVE  2     TO FIELD-NUMBER
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   GO TO 62-SHOW-FORM
               ELSE
                   MOVE "READ MSTORERM ERROR IN 62-EDIT-CODE"
                               TO BU-DISPLAY-MSG
                   PERFORM 2-BLOWUP.

           MOVE STR-LOC(1)     TO SAVE-BIN-LOC1.

       62-RETRIEVE-DATA.
      ***  NOW RETRIEVING DATA  ***
           MOVE  14            TO CATREAD-MSG-SET.
           MOVE  27            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA.
           MOVE CODE-SCREEN    TO DISPLAY-REC.
           PERFORM 4-SHOW-FORM THRU 4-SHOW-FORM-X.

           MOVE CODE-ARG       TO CORPCDE OF DCODE.
           START DCODE         KEY = CORPCDE OF DCODE
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "START DCODE ERROR IN 62-RETRIEVE-DATA"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

           MOVE SPACES         TO SAVE-KWM1 SAVE-OLD-KWM1
                                  SAVE-KWM2 SAVE-OLD-KWM2
                                  BUF-DCODE.

           MOVE "00" TO FILE-STAT.
           PERFORM 621-GET-DCODE
              UNTIL FILE-STAT NOT = "00"

           IF SAVE-KEY-HIT IS NOT EQUAL TO 8
               PERFORM 622-RETRIEVE-DDESC
               PERFORM 623-ALLOW-MODIFY THRU 623-ALLOW-MODIFY-X
           ELSE
               PERFORM 624-RETRIEVE-DDESC2
               PERFORM 625-ALLOW-MOD-LANG2 THRU 625-ALLOW-MOD-LANG2-X.

           GO TO 62-MOD-KWM-OR-DESC.

       62-MOD-KWM-OR-DESC-X.   EXIT.

       621-GET-DCODE.
           READ DCODE          NEXT INTO BUF-DCODE
               NO LOCK
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      *********** 15FEB1995 REVISED THIS IF STMT TO AVOID USE OF "NOT"
      ***********  WITH "OR".
      *********IF FILE-STAT NOT = "10" OR "14" OR "46"
               IF FILE-STAT = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
                   MOVE "READ DCODE ERROR IN 621-GET-DCODE"
                               TO BU-DISPLAY-MSG
                   PERFORM 2-BLOWUP
               END-IF
           END-IF.

           IF CODE-KEY-CODE NOT = CODE-ARG
               READ DCODE PRIOR INTO BUF-DCODE
                 NO LOCK
                 AT END MOVE FILE-STAT TO FILE-STAT
               END-READ
               MOVE "10" TO FILE-STAT
           END-IF.

           IF CODE-LANGUAGE-IND = "1"
               MOVE CODE-KEYWORD-MOD TO SAVE-KWM1, SAVE-OLD-KWM1
           ELSE
             IF CODE-LANGUAGE-IND = "2"
               MOVE CODE-KEYWORD-MOD TO SAVE-KWM2, SAVE-OLD-KWM2.

       622-RETRIEVE-DDESC.

           MOVE CODE-ARG       TO CORPCDE OF DDESC.
           START DDESC         KEY = CORPCDE OF DDESC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "START DDESC ERROR IN 622-RETRIEVE-DDESC"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

           MOVE SPACES         TO SAVE-DESC-TBL, BUF-DDESC.
           SET SDESC-INDEX     TO 1.
           MOVE  0             TO LINES-DESC.

           MOVE "00" TO FILE-STAT.
           PERFORM 6221-GET-DDESC
              UNTIL LINES-DESC IS EQUAL TO 15
                 OR FILE-STAT NOT = "00".

       6221-GET-DDESC.

           READ DDESC          NEXT INTO BUF-DDESC
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      ********** 15FEB1995 REVISED THIS IF STMT TO AVOID USE OF "NOT"
      **********  WITH "OR".
      *******IF FILE-STAT NOT = "10" OR "14" OR "46"
             IF FILE-STAT = "10" OR "14" OR "46"
               NEXT SENTENCE
             ELSE
               MOVE "GET DDESC ERROR IN 6221-GET-DDESC"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

           IF DESC-CORP-CODE NOT = CODE-ARG
      *---------- DO A START > HIGH-VALUES TO UNLOCK DDESC
               MOVE HIGH-VALUES TO CORPCDE OF DDESC-REC
               START DDESC KEY > CORPCDE OF DDESC-REC
                  INVALID KEY MOVE "00" TO FILE-STAT
               END-START
               MOVE "10" TO FILE-STAT.

           IF FILE-STAT = "00"
               IF DESC-ID-NUM = "00" OR "99"
                   NEXT SENTENCE
               ELSE
                   MOVE DESC-DATA  TO SAVE-DESC(SDESC-INDEX)
                   ADD  1          TO LINES-DESC
                   IF SDESC-INDEX IS LESS THAN 15
                       SET SDESC-INDEX UP BY 1.

       623-ALLOW-MODIFY.
           MOVE "CODEMOD2"     TO SCREEN-NAME.

       623-PUT-BUFFER.
           MOVE SAVE-BIN-LOC1  TO CODE-BIN-LOC1.
           MOVE SAVE-KW1       TO CODE-KW1.
           MOVE SAVE-MOD1      TO CODE-MOD1.
           MOVE SAVE-KW2       TO CODE-KW2.
           MOVE SAVE-MOD2      TO CODE-MOD2.

      ***  MAKE DESIRED CHANGES TO KEYWORD/MODIFER AND DESC (1ST LANGUAGE) ***
           MOVE  13            TO CATREAD-MSG-SET.
           MOVE  13            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CODE-TOP-MSG-LINE.

           MOVE SAVE-DESC-TBL  TO CODE-DESC-TBL.

      ***  PRESS 'ENTER' TO UPDATE KEYWORD/MODIFIER AND/OR DESCRIPTION ***
           MOVE  16            TO CATREAD-MSG-SET.
           MOVE  24            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CODE-MSG-LINE1.

      ***  PRESS   'F3'  TO LEAVE KEYWORD/MODIFIER AND DESCRIPTION  ***
      ***  UNCHANGED                                                ***
           MOVE  16            TO CATREAD-MSG-SET.
           MOVE  25            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CODE-MSG-LINE2.

       623-SHOW-FORM.
           MOVE CODE-SCREEN    TO DISPLAY-REC.
           MOVE "00"           TO SCREEN-STATUS.
           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO 2-EOJ.

       623-READ-FIELDS.
           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO 2-EOJ.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO CODE-SCREEN.

           IF KEY-HIT = 3
               MOVE SPACES     TO MESSAGE-BUFFER
               GO TO 623-ALLOW-MODIFY-X
           ELSE
           IF KEY-HIT = 1 OR
              KEY-HIT = 2 OR
              KEY-HIT = 8 OR
              KEY-HIT = 4 OR
              KEY-HIT = 5 OR
              KEY-HIT = 6 OR
              KEY-HIT = 7
      *****    INVALID FUNCTION KEY    *****
               MOVE   9        TO CATREAD-MSG-SET
               MOVE  10        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
               GO TO 623-SHOW-FORM.

       623-FIELD-EDITS.
           IF CODE-KW1 = SPACES
      *****    PRIMARY LANGUAGE KEYWORD MUST BE ENTERED  *****
               MOVE  16        TO CATREAD-MSG-SET
               MOVE  166       TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
               MOVE 26 TO FIELD-NUMBER
               PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
               GO TO 623-SHOW-FORM.
           IF CODE-MOD1 = SPACES
      *****    PRIMARY LANGUAGE MODIFIER MUST BE ENTERED  *****
               MOVE  16        TO CATREAD-MSG-SET
               MOVE  167       TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
               MOVE 27 TO FIELD-NUMBER
               PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
               GO TO 623-SHOW-FORM.

       623-EDIT-KWM1.
           MOVE CODE-KW1       TO SEND-KW.
           MOVE CODE-MOD1      TO SEND-MOD.

           CALL "CRFMTKWM"     USING REFORMAT-KWM-AREA
                               BASE VIEW-COMAREA.

           MOVE RETURN-KW     TO KW-ARG.
           MOVE RETURN-MOD    TO MOD-ARG.
           MOVE RETURN-KWM    TO SAVE-NEW-KWM1.
           MOVE KWM-ARG       TO KEYWORDADJ OF MKEYADJ.

           READ MKEYADJ        INTO BUF-MKEYADJ
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
             IF FILE-STAT-1 = "2"
      *****    KEYWORD/MODIFIER DOES NOT EXIST    *****
               MOVE  11        TO CATREAD-MSG-SET
               MOVE   4        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
               MOVE  26        TO FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               MOVE  27        TO FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 623-SHOW-FORM
             ELSE
               MOVE "READ ERROR IN 623-EDIT-KWM1"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

       623-CHECK-FOR-CHANGES.
           IF (SAVE-NEW-KWM1 = SAVE-OLD-KWM1)
             AND (CODE-DESC-TBL = SAVE-DESC-TBL)
               GO TO 623-ALLOW-MODIFY-X
           ELSE
      *****    NOW UPDATING DATA BASE    *****
               MOVE  14        TO CATREAD-MSG-SET
               MOVE  28        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
               MOVE CODE-SCREEN    TO DISPLAY-REC
               PERFORM 4-SHOW-FORM THRU 4-SHOW-FORM-X.

           IF SAVE-NEW-KWM1 = SAVE-OLD-KWM1
               NEXT SENTENCE
           ELSE
               PERFORM 6231-REPLACE-KWM1.

           IF CODE-DESC-TBL = SAVE-DESC-TBL
               NEXT SENTENCE
           ELSE
               PERFORM 6232-REPLACE-DESC.

       623-ALLOW-MODIFY-X.

      *********************************************************
      *   REVISE KWM1 IN DCODE, AND IN "00" RECORD OF DDESC   *
      *   ALSO MAKE THE REQUIRED CHANGES (IF ANY) TO MALTKEY   *
      *********************************************************

       6231-REPLACE-KWM1.
           IF SAVE-OLD-KW1 = "CODE                "
               MOVE SAVE-OLD-MOD1 TO SAVE-ALTKEY
               PERFORM 8-DEL-MALTKEY THRU 8-DEL-MALTKEY-X.

           IF SAVE-NEW-KW1 = "CODE                "
               MOVE SAVE-NEW-MOD1 TO SAVE-ALTKEY
               PERFORM 7-ADD-MALTKEY THRU 7-ADD-MALTKEY-X.


           MOVE SAVE-CODE-STORES TO CODE-ARG.
           MOVE CODE-ARG       TO CORPCDE OF DCODE.
           START DCODE         KEY = CORPCDE OF DCODE
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "START DCODE ERROR IN 6231-REPLACE-KWM1"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

           MOVE SPACES         TO BUF-DCODE.

           PERFORM 62311-GET-DCODE
              UNTIL CODE-LANGUAGE-IND = "1"
                 OR FILE-STAT NOT = "00"

           IF CODE-LANGUAGE-IND = "1"
             DELETE DCODE
                 INVALID KEY   MOVE FILE-STAT TO FILE-STAT
             END-DELETE
             IF FILE-STAT NOT = "00"
                 MOVE "DELETE DCODE ERROR IN 6231-REPLACE-KWM1"
                               TO BU-DISPLAY-MSG
                 PERFORM 2-BLOWUP.

           MOVE SPACES            TO BUF-DCODE.
           MOVE SAVE-CODE-STORES  TO CODE-KEY-CODE.
           MOVE SAVE-NEW-KWM1     TO CODE-KEYWORD-MOD.
           MOVE "1"               TO CODE-LANGUAGE-IND.

           WRITE DCODE-REC     FROM BUF-DCODE
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "PUT DCODE ERROR IN 6231-REPLACE-KWM1"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

           MOVE CODE-ARG       TO CORPCDE OF DDESC.
           START DDESC         KEY = CORPCDE OF DDESC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "START DDESC ERROR IN 6231-REPLACE-KWM1"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

           READ DDESC          NEXT INTO BUF-DDESC
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "GET DDESC ERROR IN 6231-REPLACE-KWM1"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

           IF DESC-CORP-CODE NOT = CODE-ARG
               MOVE "GET DDESC ERROR IN 6231-REPLACE-KWM1"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

           IF DESC-ID-NUM NOT = "00"
               MOVE "1ST REC IN DDESC IS NOT 00 IN 6231-REPLACE-KWM1"
                               TO BU-DISPLAY-MSG
               MOVE "CODE =    "   TO BU-DISPLAY-FLD(1)
               MOVE DESC-CORP-CODE TO BU-DISPLAY-FLD(2)
               MOVE "REC ID =  "   TO BU-DISPLAY-FLD(3)
               MOVE DESC-ID-NUM    TO BU-DISPLAY-FLD(4)
               PERFORM 2-BLOWUP.

           MOVE SAVE-NEW-KWM1  TO DESC-KWM.

           REWRITE DDESC-REC   FROM BUF-DDESC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "UPDATE DDESC ERROR IN 6231-REPLACE-KWM1"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

       62311-GET-DCODE.
           READ DCODE          NEXT INTO BUF-DCODE
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      ********** 15FEB1995 REVISED THIS IF STMT TO AVOID USE OF "NOT"
      **********  WITH "OR".
      *******IF FILE-STAT NOT = "10" OR "14" OR "46"
             IF FILE-STAT = "10" OR "14" OR "46"
               NEXT SENTENCE
             ELSE
               MOVE "GET DCODE ERROR IN 62311-GET-DCODE"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

           IF CODE-KEY-CODE NOT = CODE-ARG
               READ DCODE PRIOR INTO BUF-DCODE
                 AT END MOVE FILE-STAT TO FILE-STAT
               END-READ
               MOVE "10" TO FILE-STAT.

      *********************************************************
      * REPLACE DESCRIPTION TEXT IN DDESC (REC-ID=09 THRU 23) *
      *********************************************************

      ***** THIS IS ACCOMPLISHED BY DELETING THE CURRENT DESC *****
      ***** TEXT IN DDESC, AND THEN ADDING THE REVISED DESC   *****
      ***** TEXT ENTERED TO THE SCREEN.                       *****

       6232-REPLACE-DESC.
           MOVE SAVE-CODE-STORES TO CODE-ARG.
           MOVE CODE-ARG       TO CORPCDE OF DDESC.
           START DDESC         KEY = CORPCDE OF DDESC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "START DDESC ERROR IN 6232-REPLACE-DESC"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

           MOVE SPACES         TO BUF-DDESC.

           PERFORM 62321-GET-DELETE-DESC
              UNTIL FILE-STAT NOT = "00"

           MOVE  9             TO ID-NUM-FOR-DDESC.

           PERFORM 62322-PROCESS-DESC-LINE
              VARYING DESC-INDEX FROM 1 BY 1
                UNTIL DESC-INDEX IS GREATER THAN 15.

       62321-GET-DELETE-DESC.
           READ DDESC          NEXT INTO BUF-DDESC
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      ********** 15FEB1995 REVISED THIS IF STMT TO AVOID USE OF "NOT"
      **********  WITH "OR".
      *******IF FILE-STAT NOT = "10" OR "14" OR "46"
             IF FILE-STAT = "10" OR "14" OR "46"
               NEXT SENTENCE
             ELSE
               MOVE "GET DDESC ERROR IN 62321-GET-DELETE-DESC"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

           IF DESC-CORP-CODE NOT = CODE-ARG
      *---------- DO A START > HIGH-VALUES TO UNLOCK DDESC
               MOVE HIGH-VALUES TO CORPCDE OF DDESC-REC
               START DDESC KEY > CORPCDE OF DDESC-REC
                  INVALID KEY MOVE "00" TO FILE-STAT
               END-START
               MOVE "10" TO FILE-STAT.

           IF FILE-STAT = "00"
               IF (DESC-ID-NUM IS EQUAL TO "00" OR "99")
                 NEXT SENTENCE
               ELSE
                 DELETE DDESC
                   INVALID KEY     MOVE FILE-STAT TO FILE-STAT
                 END-DELETE
                 IF FILE-STAT NOT = "00"
                   MOVE "DELETE DDESC ERROR IN 62321-GET-DELETE-DESC"
                               TO BU-DISPLAY-MSG
                   PERFORM 2-BLOWUP.

       62322-PROCESS-DESC-LINE.
           IF CODE-DESC(DESC-INDEX) = SPACES
             NEXT SENTENCE
           ELSE
             MOVE SPACES                 TO BUF-DDESC
             MOVE SAVE-CODE-STORES       TO DESC-CORP-CODE
             MOVE ID-NUM-FOR-DDESC       TO DESC-ID-NUM
             MOVE CODE-DESC(DESC-INDEX)  TO DESC-DATA
             WRITE DDESC-REC   FROM BUF-DDESC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT
             END-WRITE
             IF FILE-STAT NOT = "00"
               MOVE "PUT DDESC ERROR IN 62322-PROCESS-DESC-LINE"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP
             ELSE
               ADD  1          TO ID-NUM-FOR-DDESC.

      ****** 13FEB1995 REVISED THE FOLLOWING "START" LOGIC TO ALLOW FOR
      ******  THE CASE WHERE THERE ARE NO ENTRIES IN DDESC2 FOR THE CODE
      ******  TO BE MODIFIED.  (ADDED THE "IF FILE-STAT-1 = "2").
       624-RETRIEVE-DDESC2.
           MOVE CODE-ARG       TO CORPCDE OF DDESC2.
           START DDESC2        KEY = CORPCDE OF DDESC2
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT-1 = "2"
                   NEXT SENTENCE
               ELSE
                   MOVE "START DDESC2 ERROR IN 624-RETRIEVE-DDESC2"
                      TO BU-DISPLAY-MSG
                   MOVE CODE-ARG TO BU-DISPLAY-FLD (1)
                   PERFORM 2-BLOWUP.

           MOVE SPACES         TO SAVE-DESC-TBL, BUF-DDESC2.
           SET SDESC-INDEX     TO 1.
           MOVE  0             TO LINES-DESC.

           PERFORM 6241-GET-DDESC2
              UNTIL LINES-DESC IS EQUAL TO 15
                 OR FILE-STAT NOT = "00".

       6241-GET-DDESC2.
           READ DDESC2         NEXT INTO BUF-DDESC2
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      ********** 15FEB1995 REVISED THIS IF STMT TO AVOID USE OF "NOT"
      **********  WITH "OR".
      *******IF FILE-STAT NOT = "10" OR "14" OR "46"
             IF FILE-STAT = "10" OR "14" OR "46"
               NEXT SENTENCE
             ELSE
               MOVE "GET DDESC2 ERROR IN 6241-GET-DDESC2"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

           IF DESC2-CORP-CODE NOT = CODE-ARG
      *---------- DO A START > HIGH-VALUES TO UNLOCK DDESC2
               MOVE HIGH-VALUES TO CORPCDE OF DDESC2-REC
               START DDESC2 KEY > CORPCDE OF DDESC2-REC
                  INVALID KEY MOVE "00" TO FILE-STAT
               END-START
               MOVE "10" TO FILE-STAT.

           IF FILE-STAT = "00"
               IF DESC2-ID-NUM = "00" OR "99"
                   NEXT SENTENCE
               ELSE
                   MOVE DESC2-DATA TO SAVE-DESC(SDESC-INDEX)
                   ADD  1          TO LINES-DESC
                   IF SDESC-INDEX IS LESS THAN 15
                       SET SDESC-INDEX UP BY 1.

       625-ALLOW-MOD-LANG2.
           MOVE "CODEMOD2_LANG2" TO SCREEN-NAME.

       625-PUT-BUFFER.
           MOVE SAVE-BIN-LOC1  TO CODE-BIN-LOC1.
           MOVE SAVE-KW1       TO CODE-KW1.
           MOVE SAVE-MOD1      TO CODE-MOD1.
           MOVE SAVE-KW2       TO CODE-KW2.
           MOVE SAVE-MOD2      TO CODE-MOD2.

      ***  MAKE DESIRED CHANGES TO KEYWORD/MODIFER AND DESC (2ND  ***
      ***  LANGUAGE)                                              ***
           MOVE  13            TO CATREAD-MSG-SET.
           MOVE  18            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CODE-TOP-MSG-LINE.

           MOVE SAVE-DESC-TBL  TO CODE-DESC-TBL.

      ***  PRESS 'ENTER' TO UPDATE KEYWORD/MODIFIER AND/OR DESCRIPTION ***
           MOVE  16            TO CATREAD-MSG-SET.
           MOVE  24            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CODE-MSG-LINE1.

      ***  PRESS   'F3'  TO LEAVE KEYWORD/MODIFIER AND DESCRIPTION  ***
      ***  UNCHANGED                                                ***
           MOVE  16            TO CATREAD-MSG-SET.
           MOVE  25            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CODE-MSG-LINE2.

       625-SHOW-FORM.
           MOVE CODE-SCREEN    TO DISPLAY-REC.
           MOVE "00"           TO SCREEN-STATUS.
           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO 2-EOJ.

       625-READ-FIELDS.
           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO 2-EOJ.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO CODE-SCREEN.

           IF KEY-HIT = 3
               MOVE SPACES     TO MESSAGE-BUFFER
               GO TO 625-ALLOW-MOD-LANG2-X
           ELSE
           IF KEY-HIT = 1 OR
              KEY-HIT = 2 OR
              KEY-HIT = 8 OR
              KEY-HIT = 4 OR
              KEY-HIT = 5 OR
              KEY-HIT = 6 OR
              KEY-HIT = 7
      *****    INVALID FUNCTION KEY    *****
               MOVE   9        TO CATREAD-MSG-SET
               MOVE  10        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
               GO TO 625-SHOW-FORM.

       625-EDIT-KWM2.
           IF (CODE-KW2 = SPACES) AND (CODE-MOD2 = SPACES)
               MOVE SPACES     TO SAVE-NEW-KWM2
               GO TO 625-CHECK-FOR-CHANGES.
           IF CODE-KW2 = SPACES
      *****    SECONDARY LANGUAGE KEYWORD MUST BE ENTERED  *****
               MOVE  19        TO CATREAD-MSG-SET
               MOVE  45        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
               MOVE 28 TO FIELD-NUMBER
               PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
               GO TO 625-SHOW-FORM.
           IF CODE-MOD2 = SPACES
      *****    SECONDARY LANGUAGE MODIFIER MUST BE ENTERED  *****
               MOVE  19        TO CATREAD-MSG-SET
               MOVE  46        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
               MOVE 29 TO FIELD-NUMBER
               PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
               GO TO 625-SHOW-FORM.

           MOVE CODE-KW2       TO SEND-KW.
           MOVE CODE-MOD2      TO SEND-MOD.

           CALL "CRFMTKWM"     USING REFORMAT-KWM-AREA
                               BASE VIEW-COMAREA.

           MOVE RETURN-KW      TO KW-ARG.
           MOVE RETURN-MOD     TO MOD-ARG.
           MOVE RETURN-KWM     TO SAVE-NEW-KWM2.
           MOVE KWM-ARG        TO KEYWORDADJ OF MKEYADJ.

           READ MKEYADJ        INTO BUF-MKEYADJ
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
             IF FILE-STAT-1 = "2"
      *****    KEYWORD/MODIFIER DOES NOT EXIST    *****
               MOVE  11        TO CATREAD-MSG-SET
               MOVE   4        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
               MOVE  28        TO FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               MOVE  29        TO FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 625-SHOW-FORM
             ELSE
               MOVE "READ ERROR IN 625-EDIT-KWM2"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

       625-CHECK-FOR-CHANGES.
           IF (SAVE-NEW-KWM2 = SAVE-OLD-KWM2)
             AND (CODE-DESC-TBL = SAVE-DESC-TBL)
               GO TO 625-ALLOW-MOD-LANG2-X
           ELSE
      *****    NOW UPDATING DATA BASE    *****
               MOVE  14        TO CATREAD-MSG-SET
               MOVE  28        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
               MOVE CODE-SCREEN    TO DISPLAY-REC
               PERFORM 4-SHOW-FORM THRU 4-SHOW-FORM-X.

           IF SAVE-NEW-KWM2 = SAVE-OLD-KWM2
               NEXT SENTENCE
           ELSE
               PERFORM 6251-REPLACE-KWM2.

           IF CODE-DESC-TBL = SAVE-DESC-TBL
               NEXT SENTENCE
           ELSE
               PERFORM 6252-REPLACE-DESC2.

       625-ALLOW-MOD-LANG2-X.  EXIT.

      *********************************************************
      *   REVISE KWM2 IN DCODE, AND IN "00" RECORD OF DDESC2  *
      *   ALSO MAKE THE REQUIRED CHANGES (IF ANY) TO MALTKEY  *
      *********************************************************

       6251-REPLACE-KWM2.
           IF SAVE-OLD-KW2 = "CODE                "
               MOVE SAVE-OLD-MOD2    TO SAVE-ALTKEY
               PERFORM 8-DEL-MALTKEY THRU 8-DEL-MALTKEY-X.

           IF SAVE-NEW-KW2 = "CODE                "
               MOVE SAVE-NEW-MOD2    TO SAVE-ALTKEY
               PERFORM 7-ADD-MALTKEY THRU 7-ADD-MALTKEY-X.

           MOVE SAVE-CODE-STORES TO CODE-ARG.
           MOVE CODE-ARG       TO CORPCDE OF DCODE.
           START DCODE         KEY = CORPCDE OF DCODE
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "START DCODE ERROR IN 6251-REPLACE-KWM2"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

           MOVE SPACES         TO BUF-DCODE.

           PERFORM 62511-GET-DCODE
              UNTIL CODE-LANGUAGE-IND = "2"
                 OR FILE-STAT NOT = "00"

      ***** EFFECTIVE 04/02/86 KWM2 IS A REQUIRED FIELD       *****
      ***** WHEN ENTERING 2ND LANGUAGE DATA.  HOWEVER, SINCE  *****
      ***** CODES CAN BE ENTERED WITHOUT 2ND LANGUAGE DATA    *****
      ***** AND LATER MODIFIED (INCLUDING "ADDING" 2ND        *****
      ***** LANGUAGE DATA) MUCH OF THE FOLLOWING LOGIC IS     *****
      ***** NECESSARY.  ALTHOUGH SOME OF THE POSSIBILITIES    *****
      ***** PROVIDED FOR COULD NOT OCCUR THEY ARE LEFT IN     *****
      ***** CASE THIS FIELD BECOMES OPTIONAL IN THE FUTURE.   *****

      ***** SINCE KWM2 IS AN OPTIONAL FIELD THERE MAY NOT BE *****
      ***** AN EXISTING ENTRY IN DCODE.                      *****

           IF CODE-LANGUAGE-IND = "2"
             DELETE DCODE
                 INVALID KEY   MOVE FILE-STAT TO FILE-STAT
             END-DELETE
             IF FILE-STAT NOT = "00"
                 MOVE "DELETE DCODE ERROR IN 6251-REPLACE-KWM2"
                               TO BU-DISPLAY-MSG
                 PERFORM 2-BLOWUP.

           MOVE SPACES            TO BUF-DCODE.
           MOVE SAVE-CODE-STORES  TO CODE-KEY-CODE.
           MOVE SAVE-NEW-KWM2     TO CODE-KEYWORD-MOD.
           MOVE "2"               TO CODE-LANGUAGE-IND.

      ***** SINCE KWM2 IS AN OPTIONAL FIELD, THE NEW KWM2 MAY   *****
      ***** BE EQUAL TO SPACES IN WHICH CASE NO DBPUT IS NEEDED *****

           IF SAVE-NEW-KWM2 IS NOT EQUAL TO SPACES
             WRITE DCODE-REC   FROM BUF-DCODE
                 INVALID KEY   MOVE FILE-STAT TO FILE-STAT
             END-WRITE
             IF FILE-STAT NOT = "00"
                 MOVE "PUT DCODE ERROR IN 6251-REPLACE-KWM2"
                               TO BU-DISPLAY-MSG
                 PERFORM 2-BLOWUP.

           MOVE CODE-ARG       TO CORPCDE OF DDESC2.
           START DDESC2        KEY = CORPCDE OF DDESC2
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
             IF FILE-STAT-1 = "2"
               NEXT SENTENCE
             ELSE
               MOVE "START DDESC2 ERROR IN 6251-REPLACE-KWM2"
                               TO BU-DISPLAY-MSG
               MOVE CODE-ARG TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

            MOVE SPACES        TO BUF-DDESC2.

      ***** SINCE KWM2 IS AN OPTIONAL FIELD, THERE MAY OR MAY NOT *****
      ***** BE AN EXISTING "00" RECORD FOR THIS CODE.  SIMILARLY  *****
      ***** THE NEW KWM2 MIGHT BE EQUAL TO SPACES, OR IT MIGHT    *****
      ***** NOT BE.   THE ACTION TAKEN IN EACH SITUATION IS       *****
      ***** AS FOLLOWS:                                           *****
      *****                                                       *****
      ***** 1. OLD KWM2 EQUAL TO SPACES                           *****
      *****    A. NEW KWM2 EQUAL TO SPACES - NO ACTION REQUIRED   *****
      *****    B. NEW KWM2 NOT EQUAL TO SPACES - ADD 00 RECORD    *****
      *****                                                       *****
      ***** 2. OLD KWM2 NOT EQUAL TO SPACES                       *****
      *****    A. NEW KWM2 EQUAL TO SPACES - DELETE 00 RECORD     *****
      *****    B. NEW KWM2 NOT EQUAL TO SPACES - UPDATE 00 RECORD *****

            READ DDESC2      NEXT INTO BUF-DDESC2
             AT END          MOVE FILE-STAT TO FILE-STAT
            END-READ.
            IF FILE-STAT NOT = "00"
      *********** 15FEB1995 REVISED THIS IF STMT TO AVOID USE OF "NOT"
      ***********  WITH "OR".
      ********IF FILE-STAT NOT = "10" OR "14" OR "46"
      ********  MOVE "GET DDESC2 ERROR IN 6251-REPLACE-KWM2"
      ********                  TO BU-DISPLAY-MSG
      ********  PERFORM 2-BLOWUP
      ********ELSE
      ********  IF SAVE-NEW-KWM2 = SPACES
      ********    NEXT SENTENCE
      ********  ELSE
      ********    PERFORM 62512-ADD-DDESC2-00-REC
      ********  END-IF
      ********END-IF
              IF FILE-STAT = "10" OR "14" OR "46"
                IF SAVE-NEW-KWM2 = SPACES
                  NEXT SENTENCE
                ELSE
                  PERFORM 62512-ADD-DDESC2-00-REC
                END-IF
              ELSE
                MOVE "GET DDESC2 ERROR IN 6251-REPLACE-KWM2"
                                TO BU-DISPLAY-MSG
                PERFORM 2-BLOWUP
              END-IF
            ELSE
              IF DESC2-CORP-CODE NOT = CODE-ARG
                IF SAVE-NEW-KWM2 = SPACES
                  NEXT SENTENCE
                ELSE
                  PERFORM 62512-ADD-DDESC2-00-REC
                END-IF
              ELSE
                IF DESC2-ID-NUM = "00"
                  IF SAVE-NEW-KWM2 IS EQUAL TO SPACES
                    DELETE DDESC2
                      INVALID KEY MOVE FILE-STAT TO FILE-STAT
                    END-DELETE
                    IF FILE-STAT NOT = "00"
                      MOVE "DELETE DDESC2 ERROR IN 6251-REPLACE-KWM2"
                               TO BU-DISPLAY-MSG
                      PERFORM 2-BLOWUP
                    ELSE
                      NEXT SENTENCE
                  ELSE
                    MOVE SAVE-NEW-KWM2 TO DESC2-KWM
                    REWRITE DDESC2-REC FROM BUF-DDESC2
                      INVALID KEY MOVE FILE-STAT TO FILE-STAT
                    END-REWRITE
                    IF FILE-STAT NOT = "00"
                      MOVE "UPDATE DDESC2 ERROR IN 6251-REPLACE-KWM2"
                                TO BU-DISPLAY-MSG
                      PERFORM 2-BLOWUP
                    ELSE
                      NEXT SENTENCE
                ELSE
                  IF SAVE-NEW-KWM2 IS EQUAL TO SPACES
                    NEXT SENTENCE
                  ELSE
                    PERFORM 62512-ADD-DDESC2-00-REC.

       62511-GET-DCODE.
           READ DCODE          NEXT INTO BUF-DCODE
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      ********** 15FEB1995 REVISED THIS IF STMT TO AVOID USE OF "NOT"
      **********  WITH "OR".
      *******IF FILE-STAT NOT = "10" OR "14" OR "46"
             IF FILE-STAT = "10" OR "14" OR "46"
               NEXT SENTENCE
             ELSE
               MOVE "GET DCODE ERROR IN 62511-GET-DCODE"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

           IF CODE-KEY-CODE NOT = CODE-ARG
               READ DCODE PRIOR INTO BUF-DCODE
                 AT END MOVE FILE-STAT TO FILE-STAT
               END-READ
               MOVE "10" TO FILE-STAT.

       62512-ADD-DDESC2-00-REC.
           MOVE SPACES         TO BUF-DDESC2.
           MOVE SAVE-CODE-STORES  TO DESC2-CORP-CODE.
           MOVE "00"           TO DESC2-ID-NUM.
           MOVE SAVE-NEW-KWM2  TO DESC2-DATA.

           WRITE DDESC2-REC    FROM BUF-DDESC2
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "PUT DDESC2 ERROR IN 62512-ADD-DDESC2-00-REC"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

      **********************************************************
      * REPLACE DESCRIPTION TEXT IN DDESC2 (REC-ID=09 THRU 23) *
      **********************************************************

      ***** THIS IS ACCOMPLISHED BY DELETING THE CURRENT DESC *****
      ***** TEXT IN DDESC2, AND THEN ADDING THE REVISED DESC  *****
      ***** TEXT ENTERED TO THE SCREEN.                       *****

      ****** 13FEB1995 REVISED THE FOLLOWING START STMT TO HANDLE THE
      ******  CASE WHERE DDESC2 CONTAINS ZERO ENTIRES (THE USER IS
      ******  ADDING A SECOND LANGUAGE DESCRIPTION FOR THE CODE),
       6252-REPLACE-DESC2.
           MOVE SAVE-CODE-STORES TO CODE-ARG.
           MOVE CODE-ARG       TO CORPCDE OF DDESC2.
           START DDESC2        KEY = CORPCDE OF DDESC2
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
             IF FILE-STAT-1 = "2"
               NEXT SENTENCE
             ELSE
               MOVE "START DDESC2 ERROR IN 6252-REPLACE-DESC2"
                               TO BU-DISPLAY-MSG
               MOVE CODE-ARG TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

           MOVE SPACES         TO BUF-DDESC2.

           PERFORM 62521-GET-DELETE-DESC2
              UNTIL FILE-STAT NOT = "00".

           MOVE  9             TO ID-NUM-FOR-DDESC2.

           PERFORM 62522-PROCESS-DESC2-LINE
              VARYING DESC-INDEX FROM 1 BY 1
                UNTIL DESC-INDEX IS GREATER THAN 15.

       62521-GET-DELETE-DESC2.
           READ DDESC2         NEXT INTO BUF-DDESC2
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      ********** 15FEB1995 REVISED THIS IF STMT TO AVOID USE OF "NOT"
      **********  WITH "OR".
      *******IF FILE-STAT NOT = "10" OR "14" OR "46"
             IF FILE-STAT = "10" OR "14" OR "46"
               NEXT SENTENCE
             ELSE
               MOVE "GET DDESC2 ERROR IN 62521-GET-DELETE-DESC2"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

           IF DESC2-CORP-CODE NOT = CODE-ARG
      *---------- DO A START > HIGH-VALUES TO UNLOCK DDESC2
               MOVE HIGH-VALUES TO CORPCDE OF DDESC2-REC
               START DDESC2 KEY > CORPCDE OF DDESC2-REC
                  INVALID KEY MOVE "00" TO FILE-STAT
               END-START
               MOVE "10" TO FILE-STAT.

           IF FILE-STAT = "00"
             IF (DESC2-ID-NUM IS EQUAL TO "00" OR "99")
               NEXT SENTENCE
             ELSE
               DELETE DDESC2
                 INVALID KEY     MOVE FILE-STAT TO FILE-STAT
               END-DELETE
               IF FILE-STAT NOT = "00"
                 MOVE "DELETE DDESC2 ERROR IN 62521-GET-DELETE-DESC2"
                                 TO BU-DISPLAY-MSG
                 PERFORM 2-BLOWUP.

       62522-PROCESS-DESC2-LINE.
           IF CODE-DESC(DESC-INDEX) = SPACES
             NEXT SENTENCE
           ELSE
             MOVE SPACES                 TO BUF-DDESC2
             MOVE SAVE-CODE-STORES       TO DESC2-CORP-CODE
             MOVE ID-NUM-FOR-DDESC2      TO DESC2-ID-NUM
             MOVE CODE-DESC(DESC-INDEX)  TO DESC2-DATA

             WRITE DDESC2-REC  FROM BUF-DDESC2
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT
             END-WRITE
             IF FILE-STAT NOT = "00"
               MOVE "PUT DDESC2 ERROR IN 62522-PROCESS-DESC2-LINE"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP
             ELSE
               ADD  1          TO ID-NUM-FOR-DDESC2.

      *********************************************************
      *                                                       *
      *    M O D I F Y   M A N U F A C T U R E R   I N F O    *
      *                                                       *
      *********************************************************

       63-SCODEUPD-SEC         SECTION 04.

       63-MOD-MFR-INFO.
           MOVE SPACES         TO SAVE-AREA-PICX.
           MOVE "CODEMODM2" TO SCREEN-NAME.

       63-PUT-BUFFER.
      ***  MODIFY MANUFACTURER INFORMATION  ***
           MOVE  13            TO CATREAD-MSG-SET.
           MOVE  14            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO MFR-TOP-MSG-LINE.

      ***  INPUT STORES CODE AND THEN PRESS 'ENTER'  ***
           MOVE   9            TO CATREAD-MSG-SET.
           MOVE  23            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO MFR-MSG-LINE1.

       63-SHOW-FORM.
           MOVE MFR-SCREEN     TO DISPLAY-REC.
           MOVE "00"           TO SCREEN-STATUS.
           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO 2-EOJ.

       63-READ-FIELDS.
           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO 2-EOJ.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO MFR-SCREEN.

           IF KEY-HIT = 3
               MOVE SPACES     TO MESSAGE-BUFFER
               GO TO 63-MOD-MFR-INFO-X
           ELSE
           IF KEY-HIT = 1 OR
              KEY-HIT = 2 OR
              KEY-HIT = 8 OR
              KEY-HIT = 4 OR
              KEY-HIT = 5 OR
              KEY-HIT = 6 OR
              KEY-HIT = 7
      *****    INVALID FUNCTION KEY    *****
               MOVE   9        TO CATREAD-MSG-SET
               MOVE  10        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
               GO TO 63-SHOW-FORM.

       63-FIELD-EDITS.
           IF MFR-CODE-STORES = SPACES
      *****    INPUT STORES CODE   *****
               MOVE  9         TO CATREAD-MSG-SET
               MOVE  15        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
               MOVE 1 TO FIELD-NUMBER
               PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
               GO TO 63-SHOW-FORM.

       63-EDIT-CODE.
           MOVE MFR-CODE-STORES TO CODE-CHK-IN.

           CALL "CCODECHK"    USING CCODECHK-PARMS.

           IF CODE-IS-CORP-CODE
      *****    THIS FUNCTION IS NOT AVAILABLE FOR CORPORATE CODES    *****
               MOVE  20        TO CATREAD-MSG-SET
               MOVE  33        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
               MOVE  1         TO FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 63-SHOW-FORM.

           MOVE MFR-CODE-STORES TO CODE-ARG, SAVE-CODE-STORES
                                   CORPCDE OF MSTORERM.

           READ MSTORERM       INTO BUF-MSTORERM
               NO LOCK
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
             IF FILE-STAT-1 = "2"
      *****    STORES CODE DOES NOT EXIST    *****
               MOVE  19        TO CATREAD-MSG-SET
               MOVE   9        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
               MOVE  1         TO FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 63-SHOW-FORM
             ELSE
               MOVE "READ MSTORERM ERROR IN 63-EDIT-CODE"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

           MOVE STR-LOC(1)     TO SAVE-BIN-LOC1.

       63-PREPARE-TO-GET-DATA.
      ***  NOW RETRIEVING DATA  ***
           MOVE  14            TO CATREAD-MSG-SET.
           MOVE  27            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA.
           MOVE MFR-SCREEN     TO DISPLAY-REC.
           PERFORM 4-SHOW-FORM THRU 4-SHOW-FORM-X.

           MOVE CODE-ARG       TO CORPCDE OF DMANPART.
           START DMANPART      KEY = CORPCDE OF DMANPART
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO GET-DCODE.

           MOVE SPACES TO BUF-DMANPART, SAVE-MFR-DATA-TBL.
           SET SMFR-INDEX      TO 1.

           PERFORM 631-GET-DMANPART
              UNTIL FILE-STAT NOT = "00".

       GET-DCODE.
           MOVE CODE-ARG       TO CORPCDE OF DCODE.
           START DCODE         KEY = CORPCDE OF DCODE
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "START DCODE ERROR IN 63-PREPARE-TO-GET-DATA"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

           MOVE SPACES TO BUF-DCODE, SAVE-KWM1, SAVE-KWM2.

           PERFORM 632-GET-DCODE
              UNTIL FILE-STAT NOT = "00"

           PERFORM 633-ALLOW-MODIFY THRU 633-ALLOW-MODIFY-X.

           GO TO 63-MOD-MFR-INFO.

       63-MOD-MFR-INFO-X.      EXIT.

       631-GET-DMANPART.
           READ DMANPART       NEXT INTO BUF-DMANPART
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      ********** 15FEB1995 REVISED THIS IF STMT TO AVOID USE OF "NOT"
      **********  WITH "OR"
      *******IF FILE-STAT NOT = "10" OR "14" OR "46"
             IF FILE-STAT = "10" OR "14" OR "46"
               NEXT SENTENCE
             ELSE
               MOVE "GET DMANPART ERROR IN 631-GET-DMANPART"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

           IF MAN-CORPCODE NOT = CODE-ARG
               MOVE "10" TO FILE-STAT.

           IF FILE-STAT = "00"
               MOVE MAN-NAME          TO SAVE-MFR-MFR(SMFR-INDEX)
               MOVE MAN-PARTNO-TYPE   TO SAVE-MFR-TYPE(SMFR-INDEX)
               MOVE MAN-PARTNO-SELECT TO SAVE-MFR-SELECT(SMFR-INDEX)
               MOVE MAN-PARTNO        TO SAVE-MFR-PARTNO(SMFR-INDEX)
               IF SMFR-INDEX IS LESS THAN 8
                   SET SMFR-INDEX UP BY 1
               END-IF
           END-IF.

       632-GET-DCODE.
           READ DCODE          NEXT INTO BUF-DCODE
               NO LOCK
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      ********** 15FEB1995 REVISED THIS IF STMT TO AVOID USE "NOT"
      **********  WITH "OR".
      *******IF FILE-STAT NOT = "10" OR "14" OR "46"
             IF FILE-STAT = "10" OR "14" OR "46"
               NEXT SENTENCE
             ELSE
               MOVE "GET DCODE ERROR IN 632-GET-DCODE"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

           IF CODE-KEY-CODE NOT = CODE-ARG
               READ DCODE PRIOR INTO BUF-DCODE
                 NO LOCK
                 AT END MOVE FILE-STAT TO FILE-STAT
               END-READ
               MOVE "10" TO FILE-STAT.

           IF CODE-LANGUAGE-IND = "1"
             MOVE CODE-KEYWORD-MOD TO SAVE-KWM1
           ELSE
             IF CODE-LANGUAGE-IND = "2"
               MOVE CODE-KEYWORD-MOD TO SAVE-KWM2.

       633-ALLOW-MODIFY.
           MOVE "CODEMODM23" TO SCREEN-NAME.

       633-PUT-BUFFER.
           MOVE SPACES         TO MFR-SCREEN.
           MOVE SAVE-CODE-STORES TO MFR-CODE-STORES.
           MOVE SAVE-BIN-LOC1  TO MFR-BIN-LOC1.
           MOVE SAVE-KW1       TO MFR-KW1.
           MOVE SAVE-MOD1      TO MFR-MOD1.
           MOVE SAVE-KW2       TO MFR-KW2.
           MOVE SAVE-MOD2      TO MFR-MOD2.

      ***  MAKE DESIRED CHANGES TO THE MANUFACTURER INFORMATION  ***
           MOVE  13            TO CATREAD-MSG-SET.
           MOVE  15            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO MFR-TOP-MSG-LINE.

           MOVE SAVE-MFR-DATA-TBL    TO MFR-DATA-TBL.

      ***  PRESS 'ENTER' TO UPDATE THE MANUFACTURER INFORMATION  ***
           MOVE  16            TO CATREAD-MSG-SET.
           MOVE  26            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO MFR-MSG-LINE1.

      ***  PRESS   'F3'  TO LEAVE THE MANUFACTURER INFORMATION  ***
      ***  UNCHANGED                                            ***
           MOVE  16            TO CATREAD-MSG-SET.
           MOVE  27            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO MFR-MSG-LINE2.

       633-SHOW-FORM.
           MOVE MFR-SCREEN     TO DISPLAY-REC.
           MOVE "00"           TO SCREEN-STATUS.
           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO 2-EOJ.

       633-READ-FIELDS.
           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO 2-EOJ.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO MFR-SCREEN.

           IF KEY-HIT = 3
               MOVE SPACES     TO MESSAGE-BUFFER
               GO TO 633-ALLOW-MODIFY-X
           ELSE
           IF KEY-HIT = 1 OR
              KEY-HIT = 2 OR
              KEY-HIT = 8 OR
              KEY-HIT = 4 OR
              KEY-HIT = 5 OR
              KEY-HIT = 6 OR
              KEY-HIT = 7
      *****    INVALID FUNCTION KEY    *****
               MOVE   9        TO CATREAD-MSG-SET
               MOVE  10        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE "* INVALID FUNCTION KEY ENTERED *"
                               TO  MESSAGE-BUFFER
               MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
               GO TO 633-SHOW-FORM.

       633-FIELD-EDITS.

       633-EDIT-MFR.
           MOVE  35            TO FIELD-NUM-MFR(1).
           MOVE  39            TO FIELD-NUM-TYPE(1).
           MOVE  40            TO FIELD-NUM-PART(1).
           MOVE  68            TO FIELD-NUM-SELECT(1).
           MOVE  41            TO FIELD-NUM-MFR(2).
           MOVE  42            TO FIELD-NUM-TYPE(2).
           MOVE  43            TO FIELD-NUM-PART(2).
           MOVE  69            TO FIELD-NUM-SELECT(2).
           MOVE  44            TO FIELD-NUM-MFR(3).
           MOVE  45            TO FIELD-NUM-TYPE(3).
           MOVE  46            TO FIELD-NUM-PART(3).
           MOVE  70            TO FIELD-NUM-SELECT(3).
           MOVE  47            TO FIELD-NUM-MFR(4).
           MOVE  48            TO FIELD-NUM-TYPE(4).
           MOVE  49            TO FIELD-NUM-PART(4).
           MOVE  71            TO FIELD-NUM-SELECT(4).
           MOVE  50            TO FIELD-NUM-MFR(5).
           MOVE  51            TO FIELD-NUM-TYPE(5).
           MOVE  52            TO FIELD-NUM-PART(5).
           MOVE  72            TO FIELD-NUM-SELECT(5).
           MOVE  53            TO FIELD-NUM-MFR(6).
           MOVE  54            TO FIELD-NUM-TYPE(6).
           MOVE  55            TO FIELD-NUM-PART(6).
           MOVE  73            TO FIELD-NUM-SELECT(6).
           MOVE  56            TO FIELD-NUM-MFR(7).
           MOVE  57            TO FIELD-NUM-TYPE(7).
           MOVE  58            TO FIELD-NUM-PART(7).
           MOVE  74            TO FIELD-NUM-SELECT(7).
           MOVE  60            TO FIELD-NUM-MFR(8).
           MOVE  61            TO FIELD-NUM-TYPE(8).
           MOVE  62            TO FIELD-NUM-PART(8).
           MOVE  75            TO FIELD-NUM-SELECT(8).
           MOVE "N"            TO MFR-EDIT-ERROR-SW.

           PERFORM 6331-EDIT-A-MFR
              VARYING MFR-INDEX FROM 1 BY 1
                UNTIL MFR-INDEX IS GREATER THAN 8
                   OR MFR-EDIT-ERROR-SW = "Y".

           IF MFR-EDIT-ERROR-SW = "Y"
               PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
               GO TO 633-SHOW-FORM.

           IF MFR-DATA-TBL = SAVE-MFR-DATA-TBL
               NEXT SENTENCE
           ELSE
      *****    NOW UPDATING DATA BASE   *****
               MOVE  14        TO CATREAD-MSG-SET
               MOVE  28        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
               MOVE MFR-SCREEN     TO DISPLAY-REC
               PERFORM 4-SHOW-FORM THRU 4-SHOW-FORM-X
               PERFORM 6332-REPLACE-MFR-INFO.

       633-ALLOW-MODIFY-X.     EXIT.

       6331-EDIT-A-MFR.
           IF MFR-DATA-MFR(MFR-INDEX) = SPACES
             IF MFR-DATA-PARTNO(MFR-INDEX) NOT = SPACES
                 MOVE "Y" TO MFR-EDIT-ERROR-SW
      *****      LEAVE PART NUMBER BLANK WHEN NO MFR ENTERED *****
                 MOVE  12    TO CATREAD-MSG-SET
                 MOVE  13    TO CATREAD-MSG-NUM
                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                 MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
                 SET FIELD-INDEX TO MFR-INDEX
                 MOVE FIELD-NUM-PART(FIELD-INDEX) TO FIELD-NUMBER
             ELSE
                 NEXT SENTENCE
           ELSE
               IF  MFR-DATA-TYPE(MFR-INDEX) NOT = "B" AND
                                            NOT = "C" AND
                                            NOT = "D" AND
                                            NOT = "K" AND
                                            NOT = "M" AND
                                            NOT = "P" AND
                                            NOT = "S" AND
                                            NOT = SPACES
                   MOVE "Y"    TO MFR-EDIT-ERROR-SW
      *****    INVALID TYPE ENTERED       *****
                   MOVE  9     TO CATREAD-MSG-SET
                   MOVE  108   TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
                   SET FIELD-INDEX TO MFR-INDEX
                   MOVE FIELD-NUM-TYPE(FIELD-INDEX) TO FIELD-NUMBER
               ELSE
               IF  MFR-DATA-SELECT(MFR-INDEX) NOT = "P" AND
                                            NOT = "S" AND
                                            NOT = "B" AND
                                            NOT = SPACES
                   MOVE "Y"    TO MFR-EDIT-ERROR-SW
      *****    INVALID SELECT ENTERED    *****
                   MOVE  9     TO CATREAD-MSG-SET
                   MOVE  109   TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
                   SET FIELD-INDEX TO MFR-INDEX
                   MOVE FIELD-NUM-SELECT(FIELD-INDEX) TO FIELD-NUMBER
               ELSE
             MOVE MFR-DATA-MFR(MFR-INDEX) TO SEND-MFR
             CALL "CRFMTMFR" USING REFORMAT-MFR-AREA,
                               BASE, VIEW-COMAREA
             MOVE RETURN-MFR   TO MFR-ARG, MFR-DATA-MFR(MFR-INDEX)
             MOVE MFR-ARG      TO MANUFACT OF MMANUFACT
             READ MMANUFACT    INTO BUF-MMANUFACT
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT
             END-READ
             IF FILE-STAT-1 = "2"
               MOVE "Y"        TO MFR-EDIT-ERROR-SW
      *****    MANUFACTURER DOES NOT EXIST   *****
               MOVE  13        TO CATREAD-MSG-SET
               MOVE  10        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSGC ERRMSGMFR ERRMSGA
               SET FIELD-INDEX TO MFR-INDEX
               MOVE FIELD-NUM-MFR(FIELD-INDEX) TO FIELD-NUMBER
             ELSE
               IF FILE-STAT NOT = "00"
                 MOVE "READ MMANUFACT ERROR IN 61421-EDIT-A-MFR"
                               TO BU-DISPLAY-MSG
                 PERFORM 2-BLOWUP
               ELSE
                 NEXT SENTENCE.

      *********************************************************
      *      REPLACE MANUFACTURER INFORMATION IN DMANPART      *
      *********************************************************

       6332-REPLACE-MFR-INFO.
           MOVE SAVE-CODE-STORES TO CODE-ARG.
           MOVE CODE-ARG       TO CORPCDE OF DMANPART.
           START DMANPART      KEY = CORPCDE OF DMANPART
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               NEXT SENTENCE
           ELSE
               PERFORM 63321-GET-DEL-DMANPART
                  UNTIL FILE-STAT NOT = "00".

           PERFORM 63322-ADD-NEW-MFR-INFO THRU 63322-ADD-NEW-MFR-INFO-X
              VARYING MFR-INDEX FROM 1 BY 1
                UNTIL MFR-INDEX IS GREATER THAN 8.

       63321-GET-DEL-DMANPART.
           READ DMANPART       NEXT INTO BUF-DMANPART
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      ********** 15FEB1995 REVISED THIS IF STMT TO AVOID USE OF "NOT"
      **********  WITH "OR".
      *******IF FILE-STAT NOT = "10" OR "14" OR "46"
             IF FILE-STAT = "10" OR "14" OR "46"
               NEXT SENTENCE
             ELSE
               MOVE "GET DMANPART ERROR IN 63321-GET-DEL-DMANPART"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

           IF MAN-CORPCODE NOT = CODE-ARG
               MOVE "10" TO FILE-STAT.

           IF FILE-STAT = "00"
           DELETE DMANPART
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT
           END-DELETE
           IF FILE-STAT NOT = "00"
               MOVE "DELETE DMANPART ERROR IN 63321-GET-DEL-DMANPART"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

       63322-ADD-NEW-MFR-INFO.
           IF MFR-DATA-MFR(MFR-INDEX) = SPACES
               GO TO 63322-ADD-NEW-MFR-INFO-X.

           MOVE SPACES                     TO BUF-DMANPART.
           MOVE MFR-DATA-MFR(MFR-INDEX)    TO MAN-NAME.
           MOVE MFR-DATA-TYPE(MFR-INDEX)   TO MAN-PARTNO-TYPE.
           MOVE MFR-DATA-SELECT(MFR-INDEX) TO MAN-PARTNO-SELECT.
           MOVE MFR-DATA-PARTNO(MFR-INDEX) TO MAN-PARTNO.
           MOVE SAVE-CODE-STORES           TO MAN-CORPCODE.
           WRITE DMANPART-REC  FROM BUF-DMANPART
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "PUT DMANPART ERROR IN 63322-ADD-NEW-MFR-INFO"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

       63322-ADD-NEW-MFR-INFO-X.    EXIT.

      *********************************************************
      *                                                       *
      *        M O D I F Y   I N P L A N T   D A T A          *
      *                                                       *
      *********************************************************

       64-SCODEUPD-SEC         SECTION 05.

       64-MOD-INPLANT-DATA.
           MOVE SPACES         TO TPLTMAST-CORP-CODE.

           CALL "TPLTMAST"     USING BASE
                               VIEW-COMAREA
                               TPLTMAST-CORP-CODE
                               TPLTMAST-COMPANY-CODE
                               LANGUAGE-PARMS.

       64-MOD-INPLANT-DATA-X.  EXIT.

      **************************************************************
      *                  A D D   M A L T K E Y                     *
      **************************************************************

       7-ADD-MALTKEY.
           MOVE SAVE-ALTKEY    TO ALTKEY-ARG.

      ***** CHECK TO SEE IF THE ALTERNATE KEY ALREADY EXISTS. *****
      ***** IF IT DOES, THE ADD CANNOT BE PERFORMED.          *****

           MOVE ALTKEY-ARG     TO CORPALTKEY OF MALTKEY.
           READ MALTKEY        INTO BUF-MALTKEY
             INVALID KEY       MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT-1 NOT = "2"
             IF FILE-STAT = "00"
               GO TO 7-ADD-MALTKEY-X
             ELSE
               MOVE "DBGET MALTKEY ERROR IN 7-ADD-MALTKEY"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

           MOVE SAVE-ALTKEY        TO CORPCODE-ALT-KEY.
           MOVE SAVE-CODE-STORES   TO ALT-CORP-CODE.
           WRITE MALTKEY-REC   FROM BUF-MALTKEY
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "PUT MALTKEY ERROR IN 7-ADD-MALTKEY"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

       7-ADD-MALTKEY-X.        EXIT.

      **************************************************************
      *             D E L E T E   M A L T K E Y                    *
      **************************************************************

       8-DEL-MALTKEY.
           MOVE SAVE-ALTKEY    TO ALTKEY-ARG.

      ***** CHECK TO SEE IF THE ALTERNATE KEY ALREADY EXISTS. *****
      ***** IF IT DOES NOT, THE DELETE CANNOT BE PERFORMED.   *****

           MOVE ALTKEY-ARG     TO CORPALTKEY OF MALTKEY.
           READ MALTKEY        INTO BUF-MALTKEY
             INVALID KEY       MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
             IF FILE-STAT-1 = "2"
               GO TO 8-DEL-MALTKEY-X
             ELSE
               MOVE "READ MALTKEY ERROR IN 8-DEL-MALTKEY"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

      ***** DO NOT PERFORM THE DELETE IF THE ALTERNATE KEY    *****
      ***** POINTS TO SOME OTHER CODE.                        *****

           IF ALT-CORP-CODE IS EQUAL TO SAVE-CODE-STORES
               NEXT SENTENCE
           ELSE
               GO TO 8-DEL-MALTKEY-X.

           DELETE MALTKEY
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "DELETE MALTKEY ERROR IN 8-DEL-MALTKEY"
                               TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

       8-DEL-MALTKEY-X.        EXIT.

       999-CATREAD.
           MOVE SPACES         TO MESSAGE-BUFFER.
           CALL "CCATREAD"     USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.       EXIT.

