       IDENTIFICATION DIVISION.
       PROGRAM-ID.     SCODEDEL.
       AUTHOR.         C.I.HILLES.
       DATE-WRITTEN.   4/1/86.
       DATE-COMPILED.
      *INSTALLATION.   THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
      *REMARKS.
      *D   THIS SUBPROGRAM DELETES A CORPORATE CODE FROM THE
      *D   STORES DATABASE AND CREATES A TRANSACTION TO BE PASSED TO
      *D   THE CORPORATE SYSTEM INFORMING OF THE DELETION.
      *
      *    04/09/86.
      *      SINCE ALL DATABASES ARE NOT UP TO DATE, HAD TO CHANGE
      *      PROGRAM TO CHECK FOR COND CODE 52 ON DBDELETE OF "DCODE" -
      *      SINCE OLD VERSIONS OF DATABASE DONT HAVE CORP-CODE AS
      *      A SEARCH ITEM IN THIS DATA SET.  NOTE - WHOEVER MAKES A
      *      DATABASE CHANGE SHOULD BE RESPONSIBLE FOR GETTING ALL
      *      PLANTS UP TO DATE.
      *      CIH.
      *
      *    05/09/86.
      *      CHANGED PROGRAM TO NOT ALLOW CODE DELETION IF THE CODE
      *      IS FROZEN.  THIS CAUSED THE PROCESS INVENTORY WORKSHEET
      *      PROGRAM TO ABEND.  CIH.
      *C
      *C  08/19/92  BK DISMUKES   REQUEST 6525
      *C     1. ADDED LOGIC TO DELETE RESTRICTION TABLE FROM DRESTRIC
      *C        WHEN A CODE IS DELETED FROM MSTORERM.
      *C     2. CHANGED READ SCREEN LOGIC SO IT WOULD WORK.  COPYLIB
      *C        MEMBERS HAD BEEN CHANGED AND NO LONGER WORKED TOGERHER.
      *C
      *C  09/14/93  JS BUNGO      REQUEST 6420
      *C     ADDED CALL TO SJOBPCOD TO DELETE THE CODE FROM THE
      *C     MMISA PM-JOBPLAN WHEN A CODE IS DELETED FROM STORES.
      *C
      *C  09/20/93  JS BUNGO      REQUEST 5643
      *C     ADDED CALL TO SCCLKCHG TO DELETE THE CODE FROM THE
      *C     MMISA CORP-CODE-LINK AND CC-NOTE-MSTR WHEN A CODE IS
      *C     DELETED FROM STORES.
      *C
      *C  01/28/94  JS BUNGO
      *C     ADDED CALL TO SCCALTCH TO DELETE THE CODE FROM THE
      *C     THE ALTERNATE KEY FILE WHEN A CODE IS DELETED.
      *C
      *C  09/12/96  JEFF BUNGO
      *C     EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C     RECOMPILE TO PICK UP COPYLIB CHANGES.
      *C
      *C   1/14/97    BILL ROXBURY REQ #95-012
      *C     DELETE ENTRIES FROM NEW RECEIVING FILE (MCFLCSRCPT).
      *C
      *C  11/25/97    JEFF BUNGO   REQ #97-017
      *C     ADD USAGE FIELDS FOR DIRECT DELIVERY.  DD USAGE
      *C     TO BE STORED IN ADDITIONAL FIELD AND TOTAL USAGE.
      *C     STORE ISSUE USAGE CALCULATED BY TOTAL USAGE - DD USAGE.
      *C
      *C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  AS-400.
       OBJECT-COMPUTER.  AS-400.
       COPY SPECIALN IN COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MSTORERM-CD-O
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT USAGEFIL-CD-O
               ASSIGN TO DATABASE-MCFLCSUSAG
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT RECEIPTFIL-CD-O
               ASSIGN TO DATABASE-MCFLCSRCPT
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DVENDITM-CD-O
               ASSIGN TO DATABASE-MCFLCS0802
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DDESC-CD-O
               ASSIGN TO DATABASE-MCFLCS1401
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DDESC2-CD-O
               ASSIGN TO DATABASE-MCFLCS3101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DMANPART-CD-O
               ASSIGN TO DATABASE-MCFLCS3603
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DCODE-CD-O
               ASSIGN TO DATABASE-MCFLCS3402
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DPOITEM-CD-I
               ASSIGN TO DATABASE-MCFLCS1001
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DRESERVE-CD-I
               ASSIGN TO DATABASE-MCFLCS1301
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DWLITEM-CD-I
               ASSIGN TO DATABASE-MCFLCS1502
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DREQITM-CD-I
               ASSIGN TO DATABASE-MCFLCS2202
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DINVITM-CD-I
               ASSIGN TO DATABASE-MCFLCS2602
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DDAILYTC-DL-O
               ASSIGN TO DATABASE-MCFLCS1601
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZDSCMAIN-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DISPLAY-STATUS
               CONTROL-AREA IS WS-CONTROL.

           SELECT DRESTRIC-O
                  ASSIGN TO DATABASE-MCFLCS5001
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       FD  MSTORERM-CD-O
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-CD-REC-O.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  USAGEFIL-CD-O
           LABEL RECORDS ARE STANDARD.
       01  USAGEFIL-CD-REC-O.
           COPY DDS-MCRPCSUSAG  OF MCFLCSUSAG.

       FD  RECEIPTFIL-CD-O
           LABEL RECORDS ARE STANDARD.
       01  RECEIPTFIL-CD-REC-O.
           COPY DDS-MCRPCSRCPT  OF MCFLCSRCPT.

       FD  DVENDITM-CD-O
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM-CD-REC-O.
           COPY DDS-MCRPCS0800  OF MCFLCS0802.

       FD  DDESC-CD-O
           LABEL RECORDS ARE STANDARD.
       01  DDESC-CD-REC-O.
           COPY DDS-MCRPCS1400  OF MCFLCS1401.

       FD  DDESC2-CD-O
           LABEL RECORDS ARE STANDARD.
       01  DDESC2-CD-REC-O.
           COPY DDS-MCRPCS3100  OF MCFLCS3101.

       FD  DMANPART-CD-O
           LABEL RECORDS ARE STANDARD.
       01  DMANPART-CD-REC-O.
           COPY DDS-MCRPCS3600  OF MCFLCS3603.

       FD  DCODE-CD-O
           LABEL RECORDS ARE STANDARD.
       01  DCODE-CD-REC-O.
           COPY DDS-MCRPCS3400  OF MCFLCS3402.

       FD  DPOITEM-CD-I
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-CD-REC-I.
           COPY DDS-MCRPCS1000  OF MCFLCS1001.

       FD  DRESERVE-CD-I
           LABEL RECORDS ARE STANDARD.
       01  DRESERVE-CD-REC-I.
           COPY DDS-MCRPCS1300  OF MCFLCS1301.

       FD  DWLITEM-CD-I
           LABEL RECORDS ARE STANDARD.
       01  DWLITEM-CD-REC-I.
           COPY DDS-MCRPCS1500  OF MCFLCS1502.

       FD  DREQITM-CD-I
           LABEL RECORDS ARE STANDARD.
       01  DREQITM-CD-REC-I.
           COPY DDS-MCRPCS2200  OF MCFLCS2202.

       FD  DINVITM-CD-I
           LABEL RECORDS ARE STANDARD.
       01  DINVITM-CD-REC-I.
           COPY DDS-MCRPCS2600  OF MCFLCS2602.

       FD  DDAILYTC-DL-O
           LABEL RECORDS ARE STANDARD.
       01  DDAILYTC-DL-REC-O.
           COPY DDS-MCRPCS1600  OF MCFLCS1601.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC        PIC X(2000).

       FD  DRESTRIC-O
           LABEL RECORDS ARE STANDARD.
       01  DRESTRIC-REC-O.
           COPY DDS-MCRPCS5000  OF MCFLCS5001.

      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       WORKING-STORAGE SECTION.

       01  SAVE-AREA-PICX.
           05  SAVE-CODE-STORES          PIC X(7)  VALUE SPACES.
           05  SAVE-BIN-LOC1             PIC X(12) VALUE SPACES.
           05  SAVE-KWM1.
               10 SAVE-KW1               PIC X(20) VALUE SPACES.
               10 SAVE-MOD1              PIC X(30) VALUE SPACES.
           05  SAVE-KWM2.
               10 SAVE-KW2               PIC X(20) VALUE SPACES.
               10 SAVE-MOD2              PIC X(30) VALUE SPACES.
           05  SAVE-OLD-KWM1             PIC X(50) VALUE SPACES.
           05  SAVE-OLD-KWM2             PIC X(50) VALUE SPACES.
           05  SAVE-NEW-KWM1             PIC X(50) VALUE SPACES.
           05  SAVE-NEW-KWM2             PIC X(50) VALUE SPACES.
           05  SAVE-MFR                  PIC X(26) VALUE SPACES.
           05  SAVE-OLD-MFR              PIC X(26) VALUE SPACES.
           05  SAVE-NEW-MFR              PIC X(26) VALUE SPACES.
           05  SAVE-TYPE-IND             PIC X(1)  VALUE SPACES.
           05  SAVE-PARTNO               PIC X(20) VALUE SPACES.

           05  SAVE-DESC-TBL.
               10  SAVE-DESC  OCCURS 15 TIMES
                              INDEXED BY SDESC-INDEX
                                         PIC X(79).

           05  SAVE-MFR-DATA-TBL.
               10  SAVE-MFR-DATA OCCURS 8 TIMES
                                 INDEXED BY SMFR-INDEX.
                   15 SAVE-MFR-MFR       PIC X(26).
                   15 SAVE-MFR-TYPE      PIC X(1).
                   15 SAVE-MFR-PARTNO    PIC X(20).

       01  NEW-CODE                      PIC X(08) VALUE SPACES.
       01  NEW-UM                        PIC X(02) VALUE SPACES.
       01  NEW-UM-CF                     PIC S9(8) VALUE ZEROS.

      **************************************************************
      **************************************************************
      **                                                          **
      **                     DATA BASE WORK                       **
      **                                                          **
      **************************************************************
      **************************************************************

       01  DSET-NAMES.
           05  DSET-NAME             PIC X(16)  VALUE SPACES.
           05  DSET-MKEYADJ          PIC X(16)  VALUE "MKEYADJ;".
           05  DSET-DCODE            PIC X(16)  VALUE "DCODE;".
           05  DSET-MMANUFACT        PIC X(16)  VALUE "MMANUFACT;".
           05  DSET-DMANPART         PIC X(16)  VALUE "DMANPART;".
           05  DSET-MSTORERM         PIC X(16)  VALUE "MSTORERM;".
           05  DSET-DDESC            PIC X(16)  VALUE "DDESC;".
           05  DSET-DDESC2           PIC X(16)  VALUE "DDESC2;".
           05  DSET-DPOITEM          PIC X(16)  VALUE "DPOITEM;".
           05  DSET-DRESERVE         PIC X(16)  VALUE "DRESERVE;".
           05  DSET-DWLITEM          PIC X(16)  VALUE "DWLITEM;".
           05  DSET-DREQITM          PIC X(16)  VALUE "DREQITM;".
           05  DSET-DINVITM          PIC X(16)  VALUE "DINVITM;".
           05  DSET-DVENDITM         PIC X(16)  VALUE "DVENDITM;".
           05  DSET-DDAILYTC         PIC X(16)  VALUE "DDAILYTC;".
           05  DSET-DRESTRIC         PIC X(16)  VALUE "DDAILYTC;".

       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

       COPY DBMODES    IN COPYLIB.
       COPY DBSTAT     IN COPYLIB.

       01 SEARCH-ITEMS.
           05  ALL-ITEMS             PIC X(2)  VALUE "@;".
           05  CODE-SEARCH           PIC X(16) VALUE "CORP-CODE;".
           05  MFR-SEARCH            PIC X(16) VALUE "MANUFACTURER;".
           05  KWM-SEARCH            PIC X(16) VALUE "KEYWORD-ADJ;".
           05  PARTNO-SEARCH         PIC X(16) VALUE "MAN-PARTNO;".

       01 ARG-VALUES.
           05  CODE-ARG                  PIC X(8)  VALUE SPACES.
           05  KWM-ARG.
               10  KW-ARG                PIC X(20) VALUE SPACES.
               10  MOD-ARG               PIC X(30) VALUE SPACES.
           05  MFR-ARG                   PIC X(26) VALUE SPACES.
           05  PARTNO-ARG                PIC X(20) VALUE SPACES.

       01  DB-LOG-VALUES.
           05 DB-LOG-TEXT                PIC X(8) VALUE "SCODEUPD".
           05 DB-LOG-TEXT-LEN            PIC S9(4) BINARY VALUE -8.

       COPY MULTLOCK   IN COPYLIB.

      **************************************************************
      **************************************************************
      **                                                          **
      **                     DATA BASE BUFFERS                    **
      **                                                          **
      **************************************************************
      **************************************************************

       COPY MKEYADJ    IN COPYLIB.
       COPY DCODE      IN COPYLIB.
       COPY MMANUFAC   IN COPYLIB.
       COPY DMANPART   IN COPYLIB.
       COPY MSTORERM   IN COPYLIB.
       COPY DDESC      IN COPYLIB.
       COPY DDESC2     IN COPYLIB.
       COPY DVENDITM   IN COPYLIB.
       COPY DDAILYTC   IN COPYLIB.
       COPY TC110      IN COPYLIB.
       COPY DPOITEM    IN COPYLIB.
       COPY DRESERVE   IN COPYLIB.
       COPY DWLITEM    IN COPYLIB.
       COPY DREQITM    IN COPYLIB.
       COPY DINVITM    IN COPYLIB.

       COPY  DRESTRIC  IN COPYLIB.

      *************************************************************
      *************************************************************
      **                                                         **
      **                VIEW COMMUNICATION AREA                  **
      **                                                         **
      **         ------ ALSO SEE LINKAGE SECTION ------          **
      **                                                         **
      *************************************************************
      *************************************************************

       01  MESSAGE-BUFFER.
           05  MSG-TEXT.
               10  MESSAGE-BUFFER-1      PIC X(1)   VALUE SPACES.
               10  FILLER                PIC X(63)  VALUE SPACES.
           05  MSG-FLD                   PIC X(12)  VALUE SPACES.
           05  MSG-FLD-9  REDEFINES  MSG-FLD PIC 9(12).

       01  MESSAGE-BUFLEN                PIC S9(4)  BINARY VALUE 76.
       01  MESSAGE-ACTLEN                PIC S9(4)  BINARY VALUE 76.
       01  FIELD-NUMBER                  PIC S9(4)  BINARY VALUE 1.

       01  FIELD-NUM-TBL.
           05  FIELD-NUM  OCCURS 8 TIMES
                          INDEXED BY FIELD-INDEX
                                         PIC S9(4)    BINARY.

       01  FORMFILE-FDSCMAIN.
           05  FORM-FNAME-A              PIC X(8) VALUE "FDSCMAIN".
           05  FILLER                    PIC X(1) VALUE ".".
           05  FORM-GNAME-A.
               10  FORM-GNAME1-A         PIC X(5) VALUE "FLANG".
               10  FORM-GNAME2-A         PIC X(3) VALUE SPACES.
           05  FILLER                    PIC X(19) VALUE SPACES.

       01  FORMFILE-FPLTMAST.
           05  FORM-FNAME-B              PIC X(8)  VALUE "FPLTMAST".
           05  FILLER                    PIC X(1)  VALUE ".".
           05  FORM-GNAME-B.
               10  FORM-GNAME1-B         PIC X(5)  VALUE "FLANG".
               10  FORM-GNAME2-B         PIC X(3)  VALUE SPACES.
           05  FILLER                    PIC X(19) VALUE SPACES.

      *************************************************************
      *************************************************************
      **                                                         **
      **                 TERMINAL I/O DATA AREA                  **
      **                                                         **
      *************************************************************
      *************************************************************

       01  DE-FIELDS.
           05 CODE-STORES.
              10 CODE-STORES-1-4         PIC X(4).
              10 CODE-STORES-5           PIC X(1).
              10 CODE-STORES-6           PIC X(1).
              10 CODE-STORES-7           PIC X(1).
           05 CODE-BIN-LOC1              PIC X(12).
           05 CODE-KW1                   PIC X(19).
           05 CODE-MOD1                  PIC X(30).
           05 CODE-KW2                   PIC X(19).
           05 CODE-MOD2                  PIC X(30).
           05 CODE-TOP-MSG-LINE          PIC X(79).
           05 CODE-DESC-TBL.
              10 CODE-DESC  OCCURS 15 TIMES
                            INDEXED BY DESC-INDEX
                                         PIC X(79).
           05 CODE-MSG-LINE1             PIC X(79).
           05 CODE-MSG-LINE2             PIC X(79).
           05 DE-COMMAND-LINE            PIC X(79).
           05 DE-MESSAGE-LINE            PIC X(79).

      *************************************************************
      *************************************************************
      **                                                         **
      **                  COMMUNICATIONS AREAS                   **
      **                                                         **
      *************************************************************
      *************************************************************

       COPY TBLOWUP    IN COPYLIB.
       COPY CCODECHK   IN COPYLIB.
       COPY TDATECHK   IN COPYLIB.
       COPY TSHWRDFM   IN COPYLIB.
       COPY DISPDAT2   IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.
       COPY CATREAD    IN COPYLIB.

      ***** NOTE THAT "TSCRPRT2" ALSO USES PASSED-SPOOL-PRT, *****
      ***** VIEW-COMAREA, AND LANGUAGE-PARMS AS PARAMETERS   *****
      ***** IN ADDITION TO THOSE LISTED BELOW.               *****

       01  TSCRPRT2-PARAMETERS.
           05  TSCRPRT2-PRINTCNTL        PIC S9(4) BINARY VALUE 0.
           05  TSCRPRT2-PAGECNTL         PIC S9(4) BINARY VALUE 49.
           05  TSCRPRT2-SPOOLSW          PIC X(1)  VALUE "N".

       01  TSCRPRT2-ERROR-SW             PIC X(1)  VALUE "N".

       01  TSCRPRT2-DISPLAY-AREA.
           05     FILLER                 PIC X(2).
           05  TSCRPRT2-MSG              PIC X(27).
           05     FILLER                 PIC X(2).
           05  TSCRPRT2-STAT             PIC S9(4).
           05     FILLER                 PIC X(2).
           05  TSCRPRT2-FLD              PIC X(14).
           05     FILLER                 PIC X(2).

       01  PASSED-SPOOL-PRT              PIC S9(2) BINARY VALUE 0.

      *************************************************************
      *************************************************************
      **                                                         **
      **                    KSAM WORK AREA                       **
      **                                                         **
      *************************************************************
      *************************************************************

       01  KEY-VALUE                     PIC X(8)  VALUE SPACES.
       01  KEY-LOC                       PIC S9(4) BINARY VALUE 3.
       01  RECSIZE                       PIC S9(4) BINARY VALUE 66.
       01  LOCK-COND                     PIC S9(4) BINARY VALUE 1.

       01  BUF-USAGEFIL.
           05  FILLER                    PIC X(2).
           05  K-CORP-CODE               PIC X(8).
           05  K-MONTHS   OCCURS 14 TIMES
                          INDEXED BY K-INDEX.
               10  K-MTH-USAGE           PIC S9(9) BINARY.
           05  K-MONTHS-DD OCCURS 14 TIMES
                          INDEXED BY KDD-INDEX.
               10  K-MTH-USAGE-DD        PIC S9(9) BINARY.

       01  BUF-RECEIPTFIL.
           05  R-CORP-CODE               PIC X(8).
           05  R-MONTHS                  OCCURS 14 TIMES.
               10  R-MTH-RECEIPTS        PIC S9(9) COMP-4.

       01  FILE-TABLE.
           05  FILENUMBER                PIC S9(4) BINARY VALUE 0.
           05  FILENAME                  PIC X(8)  VALUE "USAGEFIL".
           05  I-O-TYPE                  PIC S9(4) BINARY VALUE 2.
           05  A-MODE                    PIC S9(4) BINARY VALUE 1.
           05  PREV-OP                   PIC S9(4) BINARY VALUE 0.

       01  KSAM-STATUS.
           05  K-STAT-1                  PIC X(1)  VALUE "0".
           05  FILLER                    PIC X(1)  VALUE "0".

      *************************************************************
      *************************************************************
      **                                                         **
      **           L I N K A G E    S E C T I O N                **
      **                                                         **
      *************************************************************
      *************************************************************

       LINKAGE SECTION.

       01  BASE                          PIC X(10).

      *************************************************************
      *************************************************************
      **                                                         **
      **                VIEW COMMUNICATION AREA                  **
      **                                                         **
      **      ------ ALSO SEE WORKING STORAGE SECTION ------     **
      **                                                         **
      *************************************************************
      *************************************************************

       COPY VCOMLINK   IN COPYLIB.

       COPY LANGSUB    IN COPYLIB.

       01  MPLTINFO-PARMS.
           05  MPLTINFO-PLANT-CODE       PIC X(3).
           05  MPLTINFO-DDESC-LANG       PIC X(3).
           05  MPLTINFO-DDESC2-LANG      PIC X(3).

      *************************************************************
      **#########################################################**
      *************************************************************
      **                                                         **
      **           P R O C E D U R E   D I V I S I O N           **
      **                                                         **
      *************************************************************
      **#########################################################**
      *************************************************************

       PROCEDURE DIVISION USING BASE,
                                VIEW-COMAREA,
                                LANGUAGE-PARMS,
                                MPLTINFO-PARMS.

       1000-HOUSEKEEP.
           MOVE "01" TO BU-DISPLAY-PARA.
           PERFORM 9999-OPEN-STUFF.
           OPEN I-O   DRESTRIC-O.
           MOVE "SCODEDEL"               TO  BU-PGM-NAME.
      *---------- GET THE FATHER FORM.
           MOVE "CODEDEL"                TO  VIEW-NFNAME.
           PERFORM 9951-GETNEXTFORM.
           PERFORM 65-DELETE-CODE THRU 6990-DC-X.
           PERFORM 9999-CLOSE-STUFF.
           CLOSE  DRESTRIC-O.
           GOBACK.

       2100-BLOWUP.
           MOVE CODE-ARG                 TO  BU-DISPLAY-FLD (1).
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
                 VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                 BU-DISPLAY-AREA.

       65-DELETE-CODE.
           MOVE "02" TO BU-DISPLAY-PARA.
           MOVE "CODEDEL1" TO VIEW-NFNAME.
           PERFORM 9951-GETNEXTFORM.
           PERFORM 9956-PUTWINDOW.

       65-PUT-BUFFER.
           MOVE SPACES          TO DE-FIELDS.
           PERFORM 9953-PUTBUFFER.

      ***  INPUT STORES CODE AND THEN PRESS 'ENTER'  ***
           MOVE   9 TO LANG-SETNUM.
           MOVE  23 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CODE-TOP-MSG-LINE.

      ***  IF CODE IS ELIGIBLE FOR DELETION, ITS DESCRIPTION WILL  ***
      ***  BE RETRIEVED                                            ***
           MOVE   9 TO LANG-SETNUM.
           MOVE  24 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CODE-MSG-LINE1.

      ***  OTHERWISE A MESSAGE WILL BE DISPLAYED BELOW  ***
           MOVE 15 TO LANG-SETNUM.
           MOVE  5 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CODE-MSG-LINE2.

       65-SHOWFORM .
           PERFORM 9953-PUTBUFFER.
           MOVE "03" TO BU-DISPLAY-PARA.
           MOVE 7 TO SRF-KEYSET
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           IF MESSAGE-BUFFER-1 NOT = SPACES
               PERFORM 9954-SETERROR
               GO TO 65-SHOWFORM .

           IF VIEW-LASTKEY = 3
               GO TO 6990-DC-X.

           PERFORM 9952-GETBUFFER.

       65-EDIT-CODE.
           MOVE "04" TO BU-DISPLAY-PARA.
           MOVE CODE-STORES TO CODE-CHK-IN.
           MOVE CODE-STORES TO CODE-ARG, SAVE-CODE-STORES.

           PERFORM 9999-DBGET7-MSTORERM-CD-O.
           IF COND-WORD NOT = 0
             IF COND-WORD = 17
      *****    STORES CODE DOES NOT EXIST    *****
               MOVE  19 TO LANG-SETNUM
               MOVE   9 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE  2  TO FIELD-NUMBER
               PERFORM 9954-SETERROR
               GO TO 65-SHOWFORM .
           PERFORM 9999-RESET-MSTORERM-CD-O.

      ***** CHECK TO SEE THAT STR-ONHAND = 0 *****

           IF STR-ONHAND NOT = 0
      *****    CODE IS NOT ELIGIBLE FOR DELETION - ONHAND IS NOT ZERO *****
               MOVE   3 TO LANG-SETNUM
               MOVE 149 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE  2  TO FIELD-NUMBER
               PERFORM 9954-SETERROR
               GO TO 65-SHOWFORM .

      ***** CHECK TO SEE THAT CODE IS NOT FROZEN *****
           IF STR-STATE = "F"
      *****    CODE FROZEN FOR INVENTORY - NO PROCESSING ALLOWED
               MOVE   3 TO LANG-SETNUM
               MOVE   8 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 2  TO FIELD-NUMBER
               PERFORM 9954-SETERROR
               GO TO 65-SHOWFORM .

      ***** CHECK TO SEE THAT CODE IS NOT ON ANY PO'S *****
           PERFORM 9999-DBFIND-DPOITEM-CD-I.
           PERFORM 9999-DBGET5-DPOITEM-CD-I.
           IF GOOD-CALL
      *****    CODE IS NOT ELIGIBLE FOR DELETION - P.O. EXISTS   *****
               MOVE   3 TO LANG-SETNUM
               MOVE 150 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE  2  TO FIELD-NUMBER
               PERFORM 9954-SETERROR
               GO TO 65-SHOWFORM .

      ***** CHECK TO SEE THAT CODE IS NOT ON ANY RESERVATIONS *****
           PERFORM 9999-DBFIND-DRESERVE-CD-I.
           PERFORM 9999-DBGET5-DRESERVE-CD-I.
           IF GOOD-CALL
      *****    CODE IS NOT ELIGIBLE FOR DELETION - RESERVATION EXISTS *****
               MOVE   3 TO LANG-SETNUM
               MOVE 151 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE  2  TO FIELD-NUMBER
               PERFORM 9954-SETERROR
               GO TO 65-SHOWFORM .

      ***** CHECK TO SEE THAT CODE IS NOT ON ANY WORKSHEETS *****
           PERFORM 9999-DBFIND-DWLITEM-CD-I.
           PERFORM 9999-DBGET5-DWLITEM-CD-I.
           IF GOOD-CALL
      *****    CODE IS NOT ELIGIBLE FOR DELETION - WORKSHEET EXISTS   *****
               MOVE   3 TO LANG-SETNUM
               MOVE 152 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE  2  TO FIELD-NUMBER
               PERFORM 9954-SETERROR
               GO TO 65-SHOWFORM .

      ***** CHECK TO SEE THAT CODE IS NOT ON ANY REQUISITIONS *****
           PERFORM 9999-DBFIND-DREQITM-CD-I.
           PERFORM 9999-DBGET5-DREQITM-CD-I.
           IF GOOD-CALL
      *****    CODE IS NOT ELIGIBLE FOR DELETION - REQUISITION EXISTS *****
               MOVE   3 TO LANG-SETNUM
               MOVE 153 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE  2  TO FIELD-NUMBER
               PERFORM 9954-SETERROR
               GO TO 65-SHOWFORM .

      ***** CHECK TO SEE THAT CODE IS NOT ON ANY INVOICES *****
           PERFORM 9999-DBFIND-DINVITM-CD-I.
           PERFORM 9999-DBGET5-DINVITM-CD-I.
           IF GOOD-CALL
      *****    CODE IS NOT ELIGIBLE FOR DELETION - INVOICE EXISTS *****
               MOVE   3 TO LANG-SETNUM
               MOVE 156 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE  2  TO FIELD-NUMBER
               PERFORM 9954-SETERROR
               GO TO 65-SHOWFORM .

       65-PREPARE-TO-GET-DDESC.
           MOVE "05" TO BU-DISPLAY-PARA.
           PERFORM 9999-DBFIND-DDESC-CD-O.

           MOVE SPACES TO BUF-DDESC, SAVE-KWM1, SAVE-DESC-TBL.
           SET SDESC-INDEX TO 1.

           PERFORM 7000-GET-DDESC
              UNTIL DESC-ID-NUM IS GREATER THAN "15"
                 OR NOT GOOD-CALL.
           PERFORM 9999-RESET-DDESC-CD-O.

           PERFORM 9999-DBFIND-DDESC2-CD-O.

           MOVE SPACES TO BUF-DDESC2, SAVE-KWM2.

           PERFORM 7100-GET-DDESC2
              UNTIL DESC2-ID-NUM IS GREATER THAN "00"
                 OR NOT GOOD-CALL.
           PERFORM 9999-RESET-DDESC2-CD-O.

           PERFORM 7150-ALLOW-DELETE THRU 7170-AD-X.

           GO TO 65-DELETE-CODE.

       6990-DC-X.
           EXIT.

       7000-GET-DDESC.
           PERFORM 9999-DBGET5-DDESC-CD-O.
           IF NOT GOOD-CALL
               NEXT SENTENCE
           ELSE
           IF DESC-ID-NUM = "00"
               MOVE DESC-DATA TO SAVE-KWM1
           ELSE
               IF DESC-ID-NUM IS LESS THAN "16"
                   MOVE DESC-DATA TO SAVE-DESC (SDESC-INDEX)
                   IF SDESC-INDEX IS LESS THAN 15
                       SET SDESC-INDEX UP BY 1.

       7100-GET-DDESC2.
           PERFORM 9999-DBGET5-DDESC2-CD-O.
           IF NOT GOOD-CALL
               NEXT SENTENCE
           ELSE
           IF DESC2-ID-NUM = "00"
               MOVE DESC2-KWM TO SAVE-KWM2.

       7150-ALLOW-DELETE.
           MOVE "CODEDEL2" TO VIEW-NFNAME.
           PERFORM 9951-GETNEXTFORM.
           MOVE SPACES TO MESSAGE-BUFFER.
           PERFORM 9956-PUTWINDOW.

           MOVE SPACES           TO DE-FIELDS.
           MOVE SAVE-CODE-STORES TO CODE-STORES.
           MOVE STR-LOC (1)      TO CODE-BIN-LOC1.
           MOVE SAVE-KW1         TO CODE-KW1.
           MOVE SAVE-MOD1        TO CODE-MOD1.
           MOVE SAVE-KW2         TO CODE-KW2.
           MOVE SAVE-MOD2        TO CODE-MOD2.
           MOVE SAVE-DESC-TBL    TO CODE-DESC-TBL.

      ***  PRESS 'ENTER' TO DELETE THIS CODE FROM THE DATA BASE  ***
           MOVE  16 TO LANG-SETNUM.
           MOVE  28 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CODE-MSG-LINE1.

      ***  PRESS   'f8'  TO LEAVE THIS CODE ON THE DATA BASE  ***
           MOVE  16 TO LANG-SETNUM.
           MOVE  29 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CODE-MSG-LINE2.

       7220-SHOWFORM .
           PERFORM 9953-PUTBUFFER.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           IF MESSAGE-BUFFER-1 NOT = SPACES
               PERFORM 9954-SETERROR
               GO TO 7220-SHOWFORM .

           IF VIEW-LASTKEY = 3
               GO TO 7170-AD-X.

           PERFORM 7300-PROCESS-DELETE THRU 7390-PD-X.

       7170-AD-X.
           EXIT.

       7300-PROCESS-DELETE.

      ***** DELETE THE SECONDARY LANGUAGE KEYWORD/MODIFIER *****
      ***** FROM THE DATA BASE IF ONE EXISTS.              *****

           MOVE  5                       TO NUMBER-OF-DSETS-LOCKED.
           MOVE DSET-DVENDITM            TO DSET-NAME-1.
           MOVE DSET-DDESC               TO DSET-NAME-2.
           MOVE DSET-DDESC2              TO DSET-NAME-3.
           MOVE DSET-DMANPART            TO DSET-NAME-4.
           MOVE DSET-DCODE               TO DSET-NAME-5.
           MOVE CODE-SEARCH              TO ITEM-LIST-1,
                                            ITEM-LIST-2,
                                            ITEM-LIST-3,
                                            ITEM-LIST-4,
                                            ITEM-LIST-5.
           MOVE SAVE-CODE-STORES         TO LOCK-VALUE-1,
                                            LOCK-VALUE-2,
                                            LOCK-VALUE-3,
                                            LOCK-VALUE-4,
                                            LOCK-VALUE-5.

           PERFORM 9931-MULTI-LOCK.
      *    CALL "DBBEGIN" USING BASE, DB-LOG-TEXT, MODE1,
      *        STATUS-AREA, DB-LOG-TEXT-LEN.
      *    IF COND-WORD NOT = 0
      *        MOVE "DBBEGIN ERROR IN 7300-PROCESS-DELETE"
      *            TO BU-DISPLAY-MSG
      *        PERFORM 2100-BLOWUP.
      *
           MOVE SAVE-CODE-STORES TO CODE-ARG.

      ***** DELETE ALL ENTRIES FOR THIS CODE IN "DVENDITM" *****
           PERFORM 9999-DBFIND-DVENDITM-CD-O.
           PERFORM 8000-GET-DEL-DVENDITM
              UNTIL NOT GOOD-CALL.

      ***** DELETE ALL ENTRIES FOR THIS CODE IN "DDESC" *****
           PERFORM 9999-DBFIND-DDESC-CD-O.
           PERFORM 8100-GET-DEL-DDESC
              UNTIL NOT GOOD-CALL.

      ***** DELETE ALL ENTRIES FOR THIS CODE IN "DDESC2" *****
           PERFORM 9999-DBFIND-DDESC2-CD-O.
           PERFORM 8200-GET-DEL-DDESC2
              UNTIL NOT GOOD-CALL.

      ***** DELETE ALL ENTRIES FOR THIS CODE IN "DMANPART" *****
           PERFORM 9999-DBFIND-DMANPART-CD-O.
           PERFORM 8210-GET-DEL-DMANPART
              UNTIL NOT GOOD-CALL.

      ***** DELETE ALL ENTRIES FOR THIS CODE IN "DCODE" *****
           PERFORM 9999-DBFIND-DCODE-CD-O.
           PERFORM 8220-GET-DEL-DCODE
              UNTIL NOT GOOD-CALL.

      ***** DELETE RESTRICTION TABLE IN "DRESTRIC" IF RESTRICTED ******
           IF STR-RESTRICTED-FLG = "X"
               PERFORM 9999-DBFIND-DRESTRIC-O
               PERFORM 8230-GET-DEL-DRESTRIC.

       7310-DELETE-MSTORERM.
           PERFORM 9940-UNLOCK.

      ***** DELETE THE "MSTORERM" ENTRY FOR THIS CODE *****

           MOVE "MSTORERM;" TO DSET-NAME.
           PERFORM 9930-LOCK.

           PERFORM 9999-DBGET7-MSTORERM-CD-O.
           PERFORM 9999-DBDELETE-MSTORERM-CD-O.

      *    CALL "DBEND" USING BASE, DB-LOG-TEXT, MODE1,
      *        STATUS-AREA, DB-LOG-TEXT-LEN.
      *    IF COND-WORD NOT = 0
      *        MOVE "DBEND ERROR IN 7300-PROCESS-DELETE"
      *            TO BU-DISPLAY-MSG
      *        PERFORM 2100-BLOWUP.
      *
           PERFORM 9940-UNLOCK.

      ***** DELETE USAGE FILE ENTRY FOR THIS CODE *****
           MOVE CODE-ARG TO KEY-VALUE.
           PERFORM 9999-DBGET7-USAGEFIL-CD-O.
           IF GOOD-CALL
               PERFORM 9999-DBDELETE-USAGEFIL-CD-O.

      ***** DELETE RECEIPT FILE ENTRY FOR THIS CODE *****
           MOVE CODE-ARG TO KEY-VALUE.
           PERFORM 9999-DBGET7-RECEIPTFIL-CD-O.
           IF GOOD-CALL
               PERFORM 9999-DBDELETE-RECEIPTFIL-CD-O.

      ***** DELETE CODE FROM ALTERNATE KEY FILE *****
           MOVE SPACES TO BU-DISPLAY-MSG.
           CALL "SCCALTCH" USING CODE-ARG NEW-CODE
                           BU-DISPLAY-MSG BU-DISPLAY-FLDS.
           IF BU-DISPLAY-MSG NOT = SPACES
               PERFORM 2100-BLOWUP.

      ***** DELETE CODE FROM MMISA PM-JOBPLAN *****
           MOVE SPACES TO BU-DISPLAY-MSG.
           CALL "SJOBPCOD" USING CODE-ARG NEW-CODE NEW-UM NEW-UM-CF
                           BU-DISPLAY-MSG BU-DISPLAY-FLDS.
           IF BU-DISPLAY-MSG NOT = SPACES
               PERFORM 2100-BLOWUP.

      ***** DELETE CODE FROM MMISA CORP-CODE-LINK *****
           MOVE SPACES TO BU-DISPLAY-MSG.
           CALL "SCCLKCHG" USING CODE-ARG NEW-CODE
                           BU-DISPLAY-MSG BU-DISPLAY-FLDS.
           IF BU-DISPLAY-MSG NOT = SPACES
               PERFORM 2100-BLOWUP.

      ***** ADD A 110 TRANSACTION TO THE DATABASE FOR THE CODE DELETE ****

           MOVE "DDAILYTC;" TO DSET-NAME.
           PERFORM 9930-LOCK.

           MOVE SPACES                   TO   BUF-DDAILYTC.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-YMD-OUT             TO   DDAILYTC-DATE.
           MOVE DATE-UNFORMATTED-TIME-OUT TO  DDAILYTC-TIME.
           MOVE "110"                    TO   DDAILYTC-TC.
           MOVE MPLTINFO-PLANT-CODE      TO   DDAILYTC-PLT.
           MOVE CODE-ARG                 TO   TC110-CORP-CODE.

           PERFORM 9999-DBPUT-DDAILYTC-DL-O.

           PERFORM 9940-UNLOCK.

       7390-PD-X.
           EXIT.

       8000-GET-DEL-DVENDITM.
           PERFORM 9999-DBGET5-DVENDITM-CD-O.
           IF GOOD-CALL
               PERFORM 9999-DBDELETE-DVENDITM-CD-O.

       8100-GET-DEL-DDESC.
           PERFORM 9999-DBGET5-DDESC-CD-O.
           IF GOOD-CALL
               PERFORM 9999-DBDELETE-DDESC-CD-O.

       8200-GET-DEL-DDESC2.
           PERFORM 9999-DBGET5-DDESC2-CD-O.
           IF GOOD-CALL
               PERFORM 9999-DBDELETE-DDESC2-CD-O.

       8210-GET-DEL-DMANPART.
           PERFORM 9999-DBGET5-DMANPART-CD-O.
           IF GOOD-CALL
               PERFORM 9999-DBDELETE-DMANPART-CD-O.

       8220-GET-DEL-DCODE.
           PERFORM 9999-DBGET5-DCODE-CD-O.
           IF GOOD-CALL
               PERFORM 9999-DBDELETE-DCODE-CD-O.

       8230-GET-DEL-DRESTRIC.
           PERFORM 9999-DBGET5-DRESTRIC-O.
           IF GOOD-CALL
               PERFORM 9999-DBDELETE-DRESTRIC-O.

       998-WRITE-SCREEN.
           WRITE DISPLAY-REC  FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

       998-READ-SCREEN.
           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO SRF-INDICATORS.

      *------ A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *------ IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.

           MOVE SPACES TO MESSAGE-BUFFER-1.

           IF VIEW-LASTKEY = 3
               GO TO 9989-WS-X.

           IF VIEW-LASTKEY = 1 OR
                           = 2 OR
                           = 4 OR
                           = 5 OR
                           = 6 OR
                           = 7 OR
                           = 8
      *M-----  INVALID FUNCTION KEY
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE   1 TO  FIELD-NUMBER.
               IF MESSAGE-BUFFER-1 = SPACES
                   MOVE SPACES TO SRF-FKEY-AREA, SRF-ENTER-FLAG.

       9989-WS-X.
           EXIT.

       COPY HCATREAD IN COPYLIB.

       9930-LOCK.
       9931-MULTI-LOCK.
       9940-UNLOCK.
       9951-GETNEXTFORM.
       9952-GETBUFFER.
           MOVE DISPLAY-REC TO DE-FIELDS.

       9953-PUTBUFFER.
           MOVE DE-FIELDS TO DISPLAY-REC.

       9954-SETERROR.
           MOVE B"1" TO IND (99).
           MOVE B"1" TO IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE.

       9955-CLEAR-FORM.
           MOVE SPACES TO DE-FIELDS, MESSAGE-BUFFER.

       9956-PUTWINDOW.
       9957-FIELDEDITS.
       9958-INITFORM.
       9959-SHOWFORM.
       9960-SETKEYLABEL.
       9961-AUTOREAD.
       9962-OPENFORM.
       9963-CLOSEFORM.
       9964-FINISHFORM.

       9999-DBGET7-MSTORERM-CD-O.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-CD-REC-O.
           READ MSTORERM-CD-O INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET7 ERR 9999-DBGET7-MSTORERM-CD-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-RESET-MSTORERM-CD-O.
           MOVE HIGH-VALUES TO CORPCDE OF MSTORERM-CD-REC-O.
           START MSTORERM-CD-O KEY > CORPCDE OF MSTORERM-CD-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-DBGET7-USAGEFIL-CD-O.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF USAGEFIL-CD-REC-O.
           READ USAGEFIL-CD-O INTO BUF-USAGEFIL
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET7 ERR 9999-DBGET7-USAGEFIL-CD-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBGET7-RECEIPTFIL-CD-O.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF RECEIPTFIL-CD-REC-O.
           READ RECEIPTFIL-CD-O INTO BUF-RECEIPTFIL
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET7 ERR 9999-DBGET7-RECEIPTFIL-CD-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBDELETE-MSTORERM-CD-O.
           MOVE 0 TO COND-WORD.
           DELETE MSTORERM-CD-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBDELETE ERR 9999-DBDELETE-MSTORERM-CD-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBDELETE-USAGEFIL-CD-O.
           MOVE 0 TO COND-WORD.
           DELETE USAGEFIL-CD-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBDELETE ERR 9999-DBDELETE-USAGEFIL-CD-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBDELETE-RECEIPTFIL-CD-O.
           MOVE 0 TO COND-WORD.
           DELETE RECEIPTFIL-CD-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBDELETE ERR 9999-DBDELETE-RECEIPTFIL-CD-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBFIND-DVENDITM-CD-O.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DVENDITM-CD-REC-O.
           START DVENDITM-CD-O KEY = CORPCDE OF DVENDITM-CD-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DVENDITM-CD-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBGET5-DVENDITM-CD-O.
           MOVE 0 TO COND-WORD.
           READ DVENDITM-CD-O NEXT INTO BUF-DVENDITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DVENDITM-CD-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DVENDITM-CD-O"
                       TO BU-MSG-AREA
                   MOVE 99 TO COND-WORD
                   PERFORM 2100-BLOWUP
           ELSE
           IF CORPCDE OF DVENDITM-CD-REC-O NOT = CODE-ARG
               PERFORM 9999-RESET-DVENDITM-CD-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DVENDITM-CD-O.
           MOVE HIGH-VALUES TO CORPCDE OF DVENDITM-CD-REC-O.
           START DVENDITM-CD-O KEY > CORPCDE OF DVENDITM-CD-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-DBDELETE-DVENDITM-CD-O.
           MOVE 0 TO COND-WORD.
           DELETE DVENDITM-CD-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBDELETE ERR 9999-DBDELETE-DVENDITM-CD-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBFIND-DDESC-CD-O.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DDESC-CD-REC-O.
           START DDESC-CD-O KEY = CORPCDE OF DDESC-CD-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DDESC-CD-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBGET5-DDESC-CD-O.
           MOVE 0 TO COND-WORD.
           READ DDESC-CD-O NEXT INTO BUF-DDESC
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DDESC-CD-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DDESC-CD-O"
                       TO BU-MSG-AREA
                   MOVE 99 TO COND-WORD
                   PERFORM 2100-BLOWUP
           ELSE
           IF CORPCDE OF DDESC-CD-REC-O NOT = CODE-ARG
               PERFORM 9999-RESET-DDESC-CD-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DDESC-CD-O.
           MOVE HIGH-VALUES TO CORPCDE OF DDESC-CD-REC-O.
           START DDESC-CD-O KEY > CORPCDE OF DDESC-CD-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-DBDELETE-DDESC-CD-O.
           MOVE 0 TO COND-WORD.
           DELETE DDESC-CD-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBDELETE ERR 9999-DBDELETE-DDESC-CD-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBFIND-DDESC2-CD-O.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DDESC2-CD-REC-O.
           START DDESC2-CD-O KEY = CORPCDE OF DDESC2-CD-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DDESC2-CD-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBGET5-DDESC2-CD-O.
           MOVE 0 TO COND-WORD.
           READ DDESC2-CD-O NEXT INTO BUF-DDESC2
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DDESC2-CD-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DDESC2-CD-O"
                       TO BU-MSG-AREA
                   MOVE 99 TO COND-WORD
                   PERFORM 2100-BLOWUP
           ELSE
           IF CORPCDE OF DDESC2-CD-REC-O NOT = CODE-ARG
               PERFORM 9999-RESET-DDESC2-CD-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DDESC2-CD-O.
           MOVE HIGH-VALUES TO CORPCDE OF DDESC2-CD-REC-O.
           START DDESC2-CD-O KEY > CORPCDE OF DDESC2-CD-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-DBDELETE-DDESC2-CD-O.
           MOVE 0 TO COND-WORD.
           DELETE DDESC2-CD-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBDELETE ERR 9999-DBDELETE-DDESC2-CD-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBFIND-DMANPART-CD-O.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DMANPART-CD-REC-O.
           START DMANPART-CD-O KEY = CORPCDE OF DMANPART-CD-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DMANPART-CD-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBGET5-DMANPART-CD-O.
           MOVE 0 TO COND-WORD.
           READ DMANPART-CD-O NEXT INTO BUF-DMANPART
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DMANPART-CD-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DMANPART-CD-O"
                       TO BU-MSG-AREA
                   MOVE 99 TO COND-WORD
                   PERFORM 2100-BLOWUP
           ELSE
           IF CORPCDE OF DMANPART-CD-REC-O NOT = CODE-ARG
               PERFORM 9999-RESET-DMANPART-CD-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DMANPART-CD-O.
           MOVE HIGH-VALUES TO CORPCDE OF DMANPART-CD-REC-O.
           START DMANPART-CD-O KEY > CORPCDE OF DMANPART-CD-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-DBDELETE-DMANPART-CD-O.
           MOVE 0 TO COND-WORD.
           DELETE DMANPART-CD-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBDELETE ERR 9999-DBDELETE-DMANPART-CD-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBFIND-DCODE-CD-O.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DCODE-CD-REC-O.
           START DCODE-CD-O KEY = CORPCDE OF DCODE-CD-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DCODE-CD-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBGET5-DCODE-CD-O.
           MOVE 0 TO COND-WORD.
           READ DCODE-CD-O NEXT INTO BUF-DCODE
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DCODE-CD-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DCODE-CD-O"
                       TO BU-MSG-AREA
                   MOVE 99 TO COND-WORD
                   PERFORM 2100-BLOWUP
           ELSE
           IF CORPCDE OF DCODE-CD-REC-O NOT = CODE-ARG
               PERFORM 9999-RESET-DCODE-CD-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DCODE-CD-O.
           MOVE HIGH-VALUES TO CORPCDE OF DCODE-CD-REC-O.
           START DCODE-CD-O KEY > CORPCDE OF DCODE-CD-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-DBDELETE-DCODE-CD-O.
           MOVE 0 TO COND-WORD.
           DELETE DCODE-CD-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBDELETE ERR 9999-DBDELETE-DCODE-CD-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBFIND-DPOITEM-CD-I.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DPOITEM-CD-REC-I.
           START DPOITEM-CD-I KEY = CORPCDE OF DPOITEM-CD-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DPOITEM-CD-I"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBGET5-DPOITEM-CD-I.
           MOVE 0 TO COND-WORD.
           READ DPOITEM-CD-I NEXT INTO BUF-DPOITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DPOITEM-CD-I"
                       TO BU-MSG-AREA
                   MOVE 99 TO COND-WORD
                   PERFORM 2100-BLOWUP
           ELSE
           IF CORPCDE OF DPOITEM-CD-REC-I NOT = CODE-ARG
               MOVE 15 TO COND-WORD.

       9999-DBFIND-DRESERVE-CD-I.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DRESERVE-CD-REC-I.
           START DRESERVE-CD-I KEY = CORPCDE OF DRESERVE-CD-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DRESERVE-CD-I"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBGET5-DRESERVE-CD-I.
           MOVE 0 TO COND-WORD.
           READ DRESERVE-CD-I NEXT INTO BUF-DRESERVE
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DRESERVE-CD-I"
                       TO BU-MSG-AREA
                   MOVE 99 TO COND-WORD
                   PERFORM 2100-BLOWUP
           ELSE
           IF CORPCDE OF DRESERVE-CD-REC-I NOT = CODE-ARG
               MOVE 15 TO COND-WORD.

       9999-DBFIND-DWLITEM-CD-I.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DWLITEM-CD-REC-I.
           START DWLITEM-CD-I KEY = CORPCDE OF DWLITEM-CD-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DWLITEM-CD-I"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBGET5-DWLITEM-CD-I.
           MOVE 0 TO COND-WORD.
           READ DWLITEM-CD-I NEXT INTO BUF-DWLITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DWLITEM-CD-I"
                       TO BU-MSG-AREA
                   MOVE 99 TO COND-WORD
                   PERFORM 2100-BLOWUP
           ELSE
           IF CORPCDE OF DWLITEM-CD-REC-I NOT = CODE-ARG
               MOVE 15 TO COND-WORD.

       9999-DBFIND-DREQITM-CD-I.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DREQITM-CD-REC-I.
           START DREQITM-CD-I KEY = CORPCDE OF DREQITM-CD-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DREQITM-CD-I"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBGET5-DREQITM-CD-I.
           MOVE 0 TO COND-WORD.
           READ DREQITM-CD-I NEXT INTO BUF-DREQITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DREQITM-CD-I"
                       TO BU-MSG-AREA
                   MOVE 99 TO COND-WORD
                   PERFORM 2100-BLOWUP
           ELSE
           IF CORPCDE OF DREQITM-CD-REC-I NOT = CODE-ARG
               MOVE 15 TO COND-WORD.

       9999-DBFIND-DINVITM-CD-I.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DINVITM-CD-REC-I.
           START DINVITM-CD-I KEY = CORPCDE OF DINVITM-CD-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DINVITM-CD-I"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBGET5-DINVITM-CD-I.
           MOVE 0 TO COND-WORD.
           READ DINVITM-CD-I NEXT INTO BUF-DINVITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DINVITM-CD-I"
                       TO BU-MSG-AREA
                   MOVE 99 TO COND-WORD
                   PERFORM 2100-BLOWUP
           ELSE
           IF CORPCDE OF DINVITM-CD-REC-I NOT = CODE-ARG
               MOVE 15 TO COND-WORD.

       9999-DBPUT-DDAILYTC-DL-O.
           MOVE 0 TO COND-WORD.
           WRITE DDAILYTC-DL-REC-O FROM BUF-DDAILYTC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBPUT ERR 9999-DBPUT-DDAILYTC-DL-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-OPEN-STUFF.
           OPEN I-O DISPLAY-FILE.
           OPEN INPUT DPOITEM-CD-I          DRESERVE-CD-I
                      DWLITEM-CD-I          DREQITM-CD-I
                      DINVITM-CD-I                               .
           OPEN I-O   MSTORERM-CD-O         DVENDITM-CD-O
                      DDESC-CD-O            DDESC2-CD-O
                      DMANPART-CD-O         DCODE-CD-O
                      DDAILYTC-DL-O         USAGEFIL-CD-O
                      RECEIPTFIL-CD-O.

       9999-CLOSE-STUFF.
           CLOSE DISPLAY-FILE.
           CLOSE      MSTORERM-CD-O         DVENDITM-CD-O
                      DDESC-CD-O            DDESC2-CD-O
                      DMANPART-CD-O         DCODE-CD-O
                      DPOITEM-CD-I          DRESERVE-CD-I
                      DWLITEM-CD-I          DREQITM-CD-I
                      DINVITM-CD-I          DDAILYTC-DL-O
                      USAGEFIL-CD-O         RECEIPTFIL-CD-O.

       9999-DBFIND-DRESTRIC-O.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DRESTRIC-REC-O.
           START DRESTRIC-O KEY = CORPCDE OF DRESTRIC-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DRESTRIC-O"
                       TO BU-MSG-AREA
               MOVE  99  TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBGET5-DRESTRIC-O.
           MOVE 0 TO COND-WORD.
           READ DRESTRIC-O INTO BUF-DRESTRIC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DRESTRIC-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DRESTRIC-O"
                       TO BU-MSG-AREA
                   MOVE 99 TO COND-WORD
                   PERFORM 2100-BLOWUP
           ELSE
           IF CORPCDE OF DRESTRIC-REC-O NOT = CODE-ARG
               PERFORM 9999-RESET-DRESTRIC-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DRESTRIC-O.
           MOVE HIGH-VALUES TO CORPCDE OF DRESTRIC-REC-O.
           START DRESTRIC-O KEY > CORPCDE OF DRESTRIC-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-DBDELETE-DRESTRIC-O.
           MOVE 0 TO COND-WORD.
           DELETE DRESTRIC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBDELETE ERR 9999-DBDELETE-DRESTRIC-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.




