       IDENTIFICATION DIVISION.
       PROGRAM-ID.    SCORRCVR.
       AUTHOR.        BARBARA WINTER.
      *INSTALLATION.  GOODYEAR.
       DATE-WRITTEN.  SEP 1983 / JAN 1986.
       DATE-COMPILED.
      *REMARKS.         RECEIVING SLIP CORRECTIONS PROGRAM.
      *D  MAIN PROGRAM FOR RECEIVING SLIP CORRECTIONS.
      *************************************************************
      *************************************************************
      ***                   S C O R R C V R                     ***
      ***                                                       ***
      ***        THIS IS THE PROGRAM USED FOR MODIFYING         ***
      ***     RECEIVING SLIPS.  PURCHASE ORDER, RELEASE,        ***
      ***     AND RECEIVING NUMBER IS ENTERED AND VALIDATED.    ***
      ***     SPOOLER NUMBER DEFAULTS ARE DISPLAYED (UP TO 3)   ***
      ***     AND MAY BE MODIFIED BY THE USER.  THIS IS TO      ***
      ***     ALLOW SOME RECEIVING SLIP CORRECTIONS TO BE       ***
      ***     PRINTED IN AREAS OTHER THAN THE DOCK.             ***
      ***     ANY SPOOLER NUMBER CHANGES AREA VALIDATED.        ***
      ***                                                       ***
      ***     SPECIAL CHECKS:                                   ***
      ***        1.  AKRON PLANT - VALIDATE USERS AND           ***
      ***            RECEIVING DEPARTMENTS.                     ***
      *************************************************************
      *************************************************************
      *C  08/31/93 JSB REQ #6422                                  *
      *C      DO NOT ALLOW THE CORRECTED QUANTITY TO BE BELOW ZERO*
      *C      IF BELOW ZERO THEN DISPLAY AN ERROR MESSAGE.        *
      *C
      *C  03/01/94 JEFF BUNGO
      *C      ADDED A RAW MATERIAL LOT NUMBER FIELD SO THAT UPDATES
      *C      TO THE RAW LOT NUMBER MAY BE DONE (WITHOUT CALLING ME)
      *C      THE UPDATED LOT NUMBER MUST NOT EXIST ALREADY FOR THE
      *C      CORP CODE AND SPACING OUT THE LOT NUMBER WILL RESULT
      *C      IN REMOVING THE LOT NUMBER.
      *C
      *C  05/04/94 JEFF BUNGO  REQUEST #6501
      *C      ADDED AN EDIT FOR THE CORRECTED QUANTITY FOR AUTO
      *C      STORE ITEMS SO THAT THE CORRECTED QUANTITY (WHEN LESS
      *C      THAN THE CURRENT RECEIVED QUANTITY) DOES NOT REDUCE
      *C      THE STOREROOM ONHAND BELOW ZERO.
      *C
      *C  06/10/94  JEFF BUNGO  REQUEST #6513
      *C      STORE THE REASON FOR CORRECTION IN A NEW DATASET
      *C      DRCVCORR (MCFPCS5400).
      *C
      *C  09/22/94  JEFF BUNGO
      *C      FOR AUTO STORE ITEMS, ADDED CODE TO HANDLE LOGIC
      *C      FOR CHAT NUMBER MODIFICATION AND TC341 FOR THE
      *C      CHAT INFO TO BE PASSED TO THE CHESS CORPORATE SYSTEM.
      *C
      *C  06/19/95  JEFF BUNGO
      *C      WRITE TC924 FOR CORRECTION QTY DLVR IF THAT QUANTITY
      *C      HAS A DECIMAL VALUE.
      *C
      *C  06/26/95  JEFF BUNGO
      *C      MOVED THE PO CURRENCY CODE TO THE TC324/424 TRANS.
      *C
      *C  06/28/95  JEFF BUNGO
      *C      USE THE PO QTY DLVR FOR THE CORRECTED QUANTITY WHEN
      *C      IT RETURNS FROM CVALITEM TO ENSURE THAT THE CORRECTED
      *C      QTY IS IN PO UM.  BEFORE, THE ADJUSTED QTY COULD HAVE
      *C      BEEN INCORRECT SINCE IT COULD HAVE BEEN CALCULATED
      *C      FROM THE DIFFERENCE OF TWO DIFFERENT UNIT OF MEAS.
      *C
      *C  12/05/95  CA YODER
      *C      COMMENTED OUT LOGIC TO CHECK IF THE RECEIVING SLIP
      *C      HAS A REGISTER NUMBER ASSIGNED FROM THE INVOICELESS
      *C      PROGRAM.  UNION CITY WAS HAVING A PROBLEM WITH
      *C      BACKING OUT A RECEIVING SLIP EVEN IF A CREDIT WAS
      *C      ISSUED TO CANCEL THE INVOICE.  THE RECEIVING SLIP
      *C      COULD NOT BE BACKED OUT SINCE IT JUST CHECKS FOR THE
      *C      EXISTENCE OF A REGISTER NUMBER.
      *C
      *C 06/06/96  JEFF BUNGO
      *C      EXTEND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C
      *C  06/06/96  JEFF BUNGO
      *C      REMOVE ESCAPE SEQUENCES FOR PRINTING MODIFY REPORT.
      *C      NO LONGER COMPRESS THE DATE, TIME, CODE DESC, AND
      *C      MODIFY EXPLANATION.
      *C
      *C 12/10/96   JEFF BUNGO  96-035
      *C      CHANGE QUANTITY ON DRCVTRAK FOR QS9000 TRACKING.
      *C
      *C SEPTEMBER 3, 1997  JEFF BUNGO
      *C      IF STORES RECEIPTS INTERFACE WITH AN EXTERNAL
      *C      SYSTEM (APPLICATION) AND ALL MATERIAL IS TO BE
      *C      AUTOSTORED (BASED ON MPLTINFO KEY SRX), THEN
      *C      MARK CODE AS AUTO STORE.  THEN CALL THE EXTERNAL
      *C      INTERFACE PROGRAM TO PASS THE DATA (RECEIVER,
      *C      ITEM NUMBER, CODE, QTY, UM, DATE, AND TIME).
      *C
      *C  11/25/97    JEFF BUNGO   REQ #97-017
      *C     ADD USAGE FIELDS FOR DIRECT DELIVERY.  DD USAGE
      *C     TO BE STORED IN ADDITIONAL FIELD AND TOTAL USAGE.
      *C     STORE ISSUE USAGE CALCULATED BY TOTAL USAGE - DD USAGE.
      *C     UPDATE THE DD USGAE WHEN THE TOTAL USAGE IS UPDATED
      *C     BY THE RECEIPT CORRECTION.
      *C
      *C  02/18/98     JEFF BUNGO
      *C     ON AN AUTOSTORE CORRECTION OF A FRANCHISE RCVG SLIP AND
      *C     FRANCHISED CODE, INDICATE FRANCHISER ON TC 325/425.
      *C
      *C  07/28/99     CA YODER
      *C     CHANGE TC 324 TO INCLUDE DES MOINES PLANT WHEN MOVING
      *C     NEW QUANTITY TO TC RECORD INSTEAD OF ADJUSTED QTY.
      *C
      *C  06/19/01     CA YODER
      *C     MOVED "04-AFTER-KELLY" PARAGRAPH NAME SO THAT THE "SRX"
      *C     AND "FRAN" SWITCHES WILL BE LOADED AND NOT SKIPPED.
      *C
      *C***********************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.    HP-3000.
       OBJECT-COMPUTER.    HP-3000.
       SPECIAL-NAMES. C01 IS NEW-PAGE
           I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.
            SELECT ACCTG-PRT    ASSIGN TO PRINTER-MCPRT2.
            SELECT THIRD-PRT    ASSIGN TO PRINTER-MCPRT3.
      *SELECT ONLINE-PRT ASSIGN TO "SXXXXXXX,DA,A,DISC(CCTL),1024".
      *SELECT ACCTG-PRT  ASSIGN TO "SXXXXXXX,DA,A,DISC(CCTL),1024".
      *SELECT THIRD-PRT  ASSIGN TO "SXXXXXXX,DA,A,DISC(CCTL),1024".
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZUDCDOCK-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS DYNAMIC
                  RELATIVE KEY IS RELATIVE-RECNO
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.
            SELECT MPLTINFO
              ASSIGN TO DATABASE-MCFLCS0501
              ORGANIZATION IS INDEXED
                ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
              FILE STATUS IS FILE-STATUS.
            SELECT DDAILYTC
              ASSIGN TO DATABASE-MCFLCS1601
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT DVENDOR
              ASSIGN TO DATABASE-MCFLCS0701
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT DVENDITM
              ASSIGN TO DATABASE-MCFLCS0802
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT DPOFREIGHT
               ASSIGN TO DATABASE-MCFLCS2401
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT DPOITEM
               ASSIGN TO DATABASE-MCFLCS1002
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT DPOITEM-O
               ASSIGN TO DATABASE-MCFLCS1002
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT DRCVITEM
               ASSIGN TO DATABASE-MCFLCS1201
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT DRCVITEM-O
               ASSIGN TO DATABASE-MCFLCS1201
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT MSTORERM
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT MSTORERM-O
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT DPODATAITM
               ASSIGN TO DATABASE-MCFLCS1101
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT MPORCV
               ASSIGN TO DATABASE-MCFLCS0101
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT MPORCV-O
               ASSIGN TO DATABASE-MCFLCS0101
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT DREQD
               ASSIGN TO DATABASE-MCFLCS2102
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT MREQ
               ASSIGN TO DATABASE-MCFLCS2001
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT DRAWLOT
               ASSIGN TO DATABASE-MCFLCS4601
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT DTALLY
               ASSIGN TO DATABASE-MCFLCS4702
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT DRAWLOT2
               ASSIGN TO DATABASE-MCFLCS4602
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT USAGEFIL
               ASSIGN TO DATABASE-MCFLCSUSAG
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT DRCVCORR-O
               ASSIGN TO DATABASE-MCFLCS5401
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT DINVRCD-I
               ASSIGN TO DATABASE-MCFLCS2502
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT DRCVTRAK-O
               ASSIGN TO DATABASE-MCFLCS6404
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                   PIC X(2000).

       FD  ONLINE-PRT
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 132 CHARACTERS
           DATA RECORD IS PRINT-RCD.
       01  PRINT-RCD.
           05  PRINT-LINE                PIC X(132).


       FD  ACCTG-PRT
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 132 CHARACTERS
           DATA RECORD IS ACCTG-RCD.
       01  ACCTG-RCD.
           05  PRINT-ACCTG               PIC X(132).

       FD  THIRD-PRT
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 132 CHARACTERS
           DATA RECORD IS THIRD-RCD.
       01  THIRD-RCD.
           05  PRINT-THIRD               PIC X(132).
       FD  MPLTINFO
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC.
           COPY DDS-MCRPCS0500 OF MCFLCS0501.

       FD  DDAILYTC
           LABEL RECORDS ARE STANDARD.
       01  DDAILYTC-REC.
           COPY DDS-MCRPCS1600  OF MCFLCS1601.

       FD  DVENDOR
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-REC.
           COPY DDS-MCRPCS0700  OF MCFLCS0701.

       FD  DVENDITM
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM-REC.
           COPY DDS-MCRPCS0800  OF MCFLCS0802.

       FD  DPOFREIGHT
           LABEL RECORDS ARE STANDARD.
       01  DPOFREIGHT-REC.
           COPY DDS-MCRPCS2400  OF MCFLCS2401.

       FD  DPOITEM
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-REC.
           COPY DDS-MCRPCS1000  OF MCFLCS1002.

       FD  DPOITEM-O
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-REC2.
           COPY DDS-MCRPCS1000  OF MCFLCS1002.

       FD  DRCVITEM
           LABEL RECORDS ARE STANDARD.
       01  DRCVITEM-REC.
           COPY DDS-MCRPCS1200  OF MCFLCS1201.

       FD  DRCVITEM-O
           LABEL RECORDS ARE STANDARD.
       01  DRCVITEM-REC2.
           COPY DDS-MCRPCS1200  OF MCFLCS1201.

       FD  MSTORERM
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  MSTORERM-O
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC2.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  DPODATAITM
           LABEL RECORDS ARE STANDARD.
       01  DPODATAITM-REC.
           COPY DDS-MCRPCS1100  OF MCFLCS1101.

       FD  MPORCV
           LABEL RECORDS ARE STANDARD.
       01  MPORCV-REC.
           COPY DDS-MCRPCS0100  OF MCFLCS0101.

       FD  MPORCV-O
           LABEL RECORDS ARE STANDARD.
       01  MPORCV-REC2.
           COPY DDS-MCRPCS0100  OF MCFLCS0101.

       FD  DREQD
           LABEL RECORDS ARE STANDARD.
       01  DREQD-REC.
           COPY DDS-MCRPCS2100  OF MCFLCS2102.

       FD  MREQ
           LABEL RECORDS ARE STANDARD.
       01  MREQ-REC.
           COPY DDS-MCRPCS2000  OF MCFLCS2001.

       FD  DRAWLOT
           LABEL RECORDS ARE STANDARD.
       01  DRAWLOT-REC.
           COPY DDS-MCRPCS4600  OF MCFLCS4601.

       FD  DRAWLOT2
           LABEL RECORDS ARE STANDARD.
       01  DRAWLOT-REC2.
           COPY DDS-MCRPCS4600  OF MCFLCS4602.

       FD  DTALLY
           LABEL RECORDS ARE STANDARD.
       01  DTALLY-REC.
           COPY DDS-MCRPCS4700  OF MCFLCS4702.

       FD  USAGEFIL
           LABEL RECORDS ARE STANDARD.
       01  USAGEFIL-REC.
           COPY DDS-MCRPCSUSAG OF MCFLCSUSAG.

       FD  DRCVCORR-O
           LABEL RECORDS ARE STANDARD.
       01  DRCVCORR-REC.
           COPY DDS-MCRPCS5400  OF MCFLCS5401.

       FD  DINVRCD-I
           LABEL RECORDS ARE STANDARD.
       01  DINVRCD-REC.
           COPY DDS-MCRPCS2500  OF MCFLCS2502.

       FD  DRCVTRAK-O
           LABEL RECORDS ARE STANDARD.
       01  DRCVTRAK-REC.
           COPY DDS-MCRPCS6400  OF MCFLCS6404.

       WORKING-STORAGE SECTION.
       01  RELATIVE-RECNO                PIC 9(9).
       01  SUB                           PIC S9(4) PACKED-DECIMAL.

       01  OLD-LOT                       PIC X(4)  VALUE SPACES.
       01  LOT-ARG.
           05  LOT-CORP-CODE             PIC X(08).
           05  LOT-LOT                   PIC X(04).

      *------02/18/98, JSB FRANCHISE TABLE
       01  FRAN-SUB                      PIC 99   VALUE ZERO.
       01  FRANCHISE-VENDOR-SW           PIC X(1) VALUE "N".
           88  FRANCHISE-VENDOR                   VALUE "Y".

       01  FRAN-TABLE.
           05  FRAN-ENTRY OCCURS 4 TIMES INDEXED BY FRAN-IDX.
               10  FRAN-ID             PIC X(1).
               10  FRAN-NAME           PIC X(4).
               10  FRAN-VEN-CODE       PIC X(10).

      *------ WS CONTROL AREA
       01  MAJOR-MINOR                   PIC XXXX.
       01  WS-CONTROL.
           02  FUNCTION-NUM              PIC XX.
                   88  EXIT-KEY-F8-USED                     VALUE "08". LVW000LS
                   88  REFRESH-KEY-F4-USED                  VALUE "04". LVW000LS
                   88  ENTER-KEY-USED                       VALUE "00". LVW000LS
                   88  F1-KEY-USED                          VALUE "01". LVW000LS
                   88  F2-KEY-USED                          VALUE "02". LVW000LS
                   88  F3-KEY-USED                          VALUE "03". LVW000LS
                   88  F4-KEY-USED                          VALUE "04". LVW000LS
                   88  F5-KEY-USED                          VALUE "05". LVW000LS
                   88  F6-KEY-USED                          VALUE "06". LVW000LS
                   88  F7-KEY-USED                          VALUE "07". LVW000LS
                   88  F8-KEY-USED                          VALUE "08". LVW000LS
           02 FUN-KEY REDEFINES FUNCTION-NUM PIC XX.
           02 TERMINAL-ID                PIC X(10).
           02 FORMAT-NAME                PIC X(10).

       01  DISPLAY-STATUS                PIC X(2).
       01  SAVE-VIEW-NFNAME              PIC X(16) VALUE SPACES.

       01  SRF-INDICATORS.
           05  IND OCCURS 99 TIMES       PIC 1 INDICATOR 01.

       COPY IOFEEDBACK OF COPYLIB.
       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X.
           05  FILE-STATUS-2             PIC X.
       01  NEED-PRICE-QTY-SW             PIC X      VALUE "N".
       01  STORE-SW                      PIC X.
       01  SAVE-RCV-SEQ                  PIC X(6).
       01  SAVE-UNIT-PRICE               PIC S9(10)V99 VALUE ZERO.
       01  C-ORDER-SW                    PIC X      VALUE "N".
       01  PRINT-EXTRA-TITLES-SW         PIC X      VALUE "N".
       01  LINE-ADV                      PIC 99     VALUE ZEROS.
       01  PRT-SUB                       PIC 99     VALUE ZEROS.

       01  STRIP                         PIC X(5) JUSTIFIED RIGHT.

      *----------  RECEIVED DATE TO COMPARE AGAINST CUTOFF DATE
      *            (KELLY PLANTS ONLY)
       01  RECEIPT-DATE                  PIC 9(6).

       01  DATE-CYMD.
           05  DATE-CYMD-CC              PIC 9(2).
           05  DATE-CYMD-YMD.
               10  DATE-CYMD-YY          PIC 9(2).
               10  DATE-CYMD-MM          PIC 9(2).
               10  DATE-CYMD-DD          PIC 9(2).

       01  SAVE-LAST-CUTOFF-DATE         PIC 9(6).
       01  SAVE-EXTSYS                   PIC X(1) VALUE "N".
       01  SAVE-EXTAUTO                  PIC X(1) VALUE "N".
       01  EXT-QTY                       PIC S9(8) COMP-3 VALUE ZEROS.
       01  EXT-CORRECT                   PIC X(1) VALUE "X".

      *---------- DETERMINES WHICH PLANT IS RUNNING:  AKRON OR SUBPLANT
       01  WHICH-PLANT.
           05  PT-TYPE.
               07  PLT-TYPE-1            PIC X.
               07  FILLER                PIC X.
           05  FILLER                    PIC X.

       01  PLANT-TYPE                    PIC 9    VALUE ZERO.
           88  AKRON                           VALUE 1.
           88  KELLY                           VALUE 2.

       01  CONTAINER-FLAG                PIC 9 VALUE 0.
           88  CONTAINER-ONLY               VALUE 1.

      *----------  CONTAINER ITEM IS SHIFTED LEFT BY 1 AND AN ASTERICK
      *            IS PUT ON THE RIGHT
       01  WORK-ITEM.
           05  FILLER                    PIC X     VALUE SPACES.
           05  SHIFTED-ITEM.
               07  WK-ITEM               PIC X(3)  VALUE SPACES.
               07  WK-ASTERICK           PIC X     VALUE SPACES.

       01  PO-SUB-BREAKDOWN.
           05  PO-SUB-CHAR               PIC X.
           05  FILLER                    PIC X(2).


       01  ITEM-DATA.
       COPY RCVITEM IN COPYLIB.

      *----------  HOLD AREAS FOR UPDATING DATABASE (ALSO PARAMETER
      *            PASSED TO 'CVALITEM')
       01  HOLD-FLDS.
           05  HOLD-PO-PAID              PIC S9(8)V9(4) VALUE ZEROS.
           05  DLVR-TOTAL                PIC S9(8)V9(4) VALUE ZEROS.
           05  HOLD-RS-PREV-DLVR         PIC S9(8)V9(4) VALUE ZEROS.
           05  HOLD-RS-PREV-STORED       PIC S9(8)V9(4) VALUE ZEROS.
           05  HOLD-ADJ-QTY              PIC S9(8)V9(4) VALUE ZEROS.
           05  HOLD-ADJ-QTY-RD REDEFINES HOLD-ADJ-QTY.
               10  FILLER                PIC S9(8).
               10  HOLD-ADJ-QTY-DEC      PIC 9(4).
           05  HOLD-ADJ-QTY-STR-UM       PIC S9(8)V9(4) VALUE ZEROES.
           05  HOLD-ADJ-QTY-STR-UM-RD REDEFINES HOLD-ADJ-QTY-STR-UM.
               10  FILLER                PIC S9(8).
               10  HOLD-ADJ-QTY-STR-UM-DEC PIC 9(4).
           05  KELLY-STR-ADJ-QTY         PIC S9(8)V9(4) VALUE ZEROS.
           05  KELLY-STR-ADJ-QTY-RD REDEFINES KELLY-STR-ADJ-QTY.
               10  FILLER                PIC S9(8).
               10  KELLY-STR-ADJ-QTY-DEC PIC 9(4).
           05  KELLY-STR-NEW-QTY         PIC S9(8)V9(4) VALUE ZEROS.


      *----------  KSAM AREAS FOR USAGEFIL FILE
       01  KEY-VALUE                     PIC X(8)  VALUE SPACES.
       01  RESULT                        PIC 9(4)  VALUE ZEROS.

       01  USAGE-RECORD.
           05  FILLER                    PIC XX.
           05  K-CORP-CODE               PIC X(8).
           05  K-MONTHS                 OCCURS 14 TIMES.
               10  K-MTH-USAGE           PIC S9(9) COMP-4.
           05  K-MONTHS-DD              OCCURS 14 TIMES.
               10  K-MTH-USAGE-DD        PIC S9(9) COMP-4.

       COPY CATREAD IN COPYLIB.
      *----------  PO AND RECEIVING SLIP WORK AREA
       COPY DBPOARG1 IN COPYLIB.
       COPY DBPOARG2 IN COPYLIB.
       COPY CDESC  IN COPYLIB.
       COPY CNDESC IN COPYLIB.
       01  RET-CODE                      PIC X(2)    VALUE SPACES.
       01  WS-SD-ITM                     PIC X(4)   VALUE SPACES.

      *----------  QTY WORK AREA
       01  QTY-WORK-AREA.
           05  WORK-QTY-X.
               10  WORK-QTY-BDP-X        PIC X(8).
               10  WORK-QTY-ADP-X        PIC X(4).
           05  WORK-QTY REDEFINES WORK-QTY-X PIC 9(8)V9(4).
       01  CHECK-ONHAND                  PIC S9(8)  VALUE ZEROS.

      *---------- VSETERROR AND VPUTWINDOW
       01  MESSAGE-BUFFER                PIC X(76)    VALUE SPACES.
       01  MESSAGE-BUFFER-RD REDEFINES MESSAGE-BUFFER.
           05  MSG-BUFFER                PIC X(62).
           05  MSG-VALUE                 PIC X(14).
           05  MSG-VALUE-9 REDEFINES MSG-VALUE PIC ZZZZZZZZZZZZZ9.
       01  MESSAGE-BUFLEN                PIC S9(4)    VALUE 76 COMP-4.
       01  MESSAGE-ACTLEN                PIC S9(4)    VALUE 0  COMP-4.
       01  FIELD-NUMBER                  PIC S9(4)    VALUE 1  COMP-4.

      *--------- CHAT NUMBER PARAMETERS
       01  PASS-CORP-CODE                PIC X(7)     VALUE SPACES.
       01  RETURN-CHAT-NO                PIC X(6)     VALUE SPACES.
       01  OLD-CHATNO                    PIC X(6)     VALUE SPACES.
       01  OLD-DLVR                      PIC S9(8)V9(4) VALUE ZEROS.
       01  OLD-UM                        PIC X(2)     VALUE SPACES.

       COPY TUMCF     IN COPYLIB.
       COPY TBLOWUP   IN COPYLIB.
       COPY TDATECHK  IN COPYLIB.
       COPY OVRPFDATA IN COPYLIB.
       COPY CCHKOBJ   IN COPYLIB.
       COPY TRSHIFT   IN COPYLIB.

       COPY RCVFLAGS IN COPYLIB.

       01  CVR-FILLER                    PIC X(10)    VALUE SPACES.
       01  CDD-PO-ADDL-DATA              PIC X(8).
       01  CDD-PO-PRIME                  PIC X(3).
       01  CDD-INTERNAL-PO               PIC X.
       01  RETURN-FLAGS.
           05  RETURN-DD                 PIC X.
           05  FILLER                    PIC X.

       01  SPOOLER-ERROR-MSG.
           05  FILLER                    PIC X(40)
               VALUE "NO MAIN SPOOLER NUMBER EXISTS FOR USER ".
           05  SP-USER                   PIC X(8).
           05  FILLER                    PIC X     VALUE ".".
           05  SP-ACCT                   PIC X(8).
           05  FILLER                    PIC X(4)  VALUE "DEV=".
           05  SP-DEV                    PIC 9(2).

       01  SPOOLER-PARAMETERS.
           05  SPOOL-STATUS          PIC S9       VALUE ZERO COMP-4.
           05  SPOOL-MESSAGE             PIC X(75)    VALUE SPACES.
           05  FILLER                    PIC X        VALUE SPACES.
           05  SPOOL-COPIES          PIC S9(2)    VALUE 1     COMP-4.
           05  SPOOL-PRIORITY        PIC S9       VALUE ZERO  COMP-4.
           05  ACCTG-STATUS          PIC S9       VALUE ZERO  COMP-4.
           05  ACCTG-MESSAGE             PIC X(75)    VALUE SPACES.
           05  FILLER                    PIC X        VALUE SPACES.
           05  ACCTG-COPIES          PIC S9(2)    VALUE 1     COMP-4.
           05  ACCTG-PRIORITY        PIC S9       VALUE ZERO  COMP-4.
      *----------  THE FOLLOWING DATA IS FOR 3RD PRTR IN SUBPLANTS ONLY
           05  THIRD-STATUS              PIC S9       VALUE ZERO  COMP.
           05  THIRD-MESSAGE             PIC X(75)    VALUE SPACES.
           05  FILLER                    PIC X        VALUE SPACES.
           05  THIRD-COPIES          PIC S9(2)    VALUE 1     COMP-4.
           05  THIRD-PRIORITY        PIC S9       VALUE ZERO  COMP-4.
      *************************************************************
      *               DATABASE LOCK PARAMETERS                    *
      *************************************************************
       COPY DBMODES  IN COPYLIB.
       COPY DBSTAT   IN COPYLIB.

       01  VEN-ARG                       PIC X(10)  VALUE SPACES.
       01  CODE-ARG                      PIC X(8)   VALUE SPACES.
       01  PLT-AG                        PIC X(4)   VALUE "P 02".
       01  PO-SEARCH                     PIC X(10)  VALUE "PO-RCV-NO;".
       01  VEN-SEARCH                    PIC X(9)   VALUE "VEN-CODE;".

      *-----------  KEY IS "%99" FOR SPOOLER NUMBER KEY TO FIND DEVICE #
       01  BUILD-MPLTINFO-ARG.
           05  PLTINFO-ARG1              PIC X        VALUE "%".
           05  AREA-SP                   PIC 9(2).
           05  FILLER                    PIC X        VALUE SPACE.

       COPY MPORCV   IN COPYLIB.
       COPY DPORECD  IN COPYLIB.
       COPY MPLT0    IN COPYLIB.
       COPY MPLTP02  IN COPYLIB.
       COPY MPLTSRX  IN COPYLIB.
       COPY MPLTFRAN IN COPYLIB.
       COPY DPOITEM  IN COPYLIB.
       COPY DRCVITEM IN COPYLIB.
       COPY DTALLY   IN COPYLIB.
       COPY DRAWLOT  IN COPYLIB.
       COPY MSTORERM IN COPYLIB.
       COPY DVENDOR  IN COPYLIB.
       COPY DREQD    IN COPYLIB.
       COPY DREQITM  IN COPYLIB.
       COPY DRCVCORR IN COPYLIB.
       COPY DINVRCD  IN COPYLIB.
       COPY DRCVTRAK IN COPYLIB.
       COPY DDAILYTC IN COPYLIB.
       COPY TC323    IN COPYLIB.
       COPY TC423    IN COPYLIB.
       COPY TC326    IN COPYLIB.
       COPY TC325    IN COPYLIB.
       COPY TC425    IN COPYLIB.
       COPY TC341    IN COPYLIB.
       COPY TC923    IN COPYLIB.

       01  MASTER-MSTORERM.
           05  MASTER-STR-CORP-CODE      PIC X(07).
           05  MASTER-STR-ONHAND         PIC S9(8) BINARY.

      *----------  SCREEN BUFFER
       01  SCREEN-BUFFER                 PIC X(2000).
       01  ENTER-ITEM-BUFFER.
           05 VAL-INSTRUCTION            PIC X(68).
           05  DE-PO-RLSE-RS.
               10  DE-PO                 PIC X(7).
               10  DE-RLSE               PIC 9(3).
               10  DE-RS                 PIC 9(3).
           05  DE-ITM                    PIC 9(4).
           05  DE-SP1                    PIC 9(2).
           05  DE-SP2                    PIC 9(2).
           05  DE-SP3                    PIC 9(2).
           05  BLANK-OUT-AREA.
               07 VAL-ITM                PIC X(4).
               07 VAL-CODE               PIC X(7).
               07 VAL-AREA.
                   10  VAL-QTY-ORD       PIC Z(7)9.9999.
                   10  VAL-ORD-UM        PIC XX.
                   10  VAL-PREV-DLVR     PIC Z(7)9.9999.
               07  DE-QTY                PIC S9(8)V9(4).
               07  DE-UM                 PIC XX.
               07  SCR-C-ORDER-INSTRUCTION        PIC X(39).
               07  SCR-PRICE-QTY-DLVR    PIC 9(11)V9(4).
               07  DE-PRICE-UM           PIC X(2).
               07  CONTAINER-LIT         PIC X(20).
               07  CONTAINER-DLVR        PIC 9(8)V9(4).
               07  CONTAINER-UM          PIC X(2).
               07 DE-REASONS.
                   10 DE-REASON          PIC X(64).
                   10 DE-REASON-CONT     PIC X(77).
               07 DE-CHATNO              PIC X(6).
               07 DE-RAW-LOT             PIC X(4).
               07 DE-TALLY               PIC X(4).
               07 DE-ITEM-COMPLETE       PIC X.
               07 VAL-DESCRIPTION-LINES.
                   10  VAL-DESC OCCURS 8 TIMES   PIC X(79).
           05  DE-COMMAND-LINE           PIC X(79).
           05  DE-MESSAGE-LINE           PIC X(79).

      *----------  BUFFER PASSED TO 'CVALITEM' ROUTINE
       COPY RCVQTY IN COPYLIB.

       01  FORM-NAMES.
           05  CORMAIN                   PIC X(8)  VALUE "COR_MAIN".
           05  CONTAINER-ITEM        PIC X(13) VALUE "COR_CONTAINER".
           05  NO-CONTAINER-ITEM         PIC X(11) VALUE "COR_NO_CONT".
           05  PRICE-CONTAINER       PIC X(15) VALUE "PRICE_CONTAINER".
           05  PRICE-NO-CONTAINER    PIC X(13) VALUE "PRICE_NO_CONT".
      *************************************************************
      *                 PRINT AREAS FOR RECEIVING SLIP            *
      *************************************************************
       01  HDR-1.
           05  FILLER                    PIC X(20)  VALUE SPACES.
           05  FILLER           PIC X(19)  VALUE "R E C E I V I N G  ".
           05  FILLER           PIC X(11)  VALUE "R E C O R D".
           05  FILLER                    PIC X(6)   VALUE SPACES.
           05  FILLER                    PIC X(5)   VALUE "DATE ".
           05  PRT-DATE                  PIC X(8)   VALUE SPACES.
           05  FILLER                    PIC XX     VALUE SPACES.
           05  PRT-TIME                  PIC X(8)   VALUE SPACES.
           05  FILLER                    PIC X      VALUE SPACES.

       01  HDR-2.
           05  FILLER                    PIC X(19)  VALUE SPACES.
           05  FILLER           PIC X(15)  VALUE "ITEM CORRECTION".
           05  FILLER           PIC X(14)  VALUE " ON RECEIVING ".
           05  FILLER           PIC X(13)  VALUE "SLIP NUMBER  ".
           05  DISPLAY-PO-RLSE-RS.
               07  DISP-PO               PIC X(7)   VALUE SPACES.
               07  FILLER                PIC X      VALUE "-".
               07  DISP-RLSE             PIC X(3)   VALUE SPACES.
               07  FILLER                PIC X      VALUE "-".
               07  DISP-RS               PIC X(3)   VALUE SPACES.
           05  FILLER                    PIC X(4)   VALUE SPACES.

       01  HDR-2A.
           05  VEN-LIT                   PIC X(13)  VALUE SPACES.
           05  PRT-VEN-ADDR              PIC X(44)  VALUE SPACES.
           05  FILLER                    PIC X(23)  VALUE SPACES.

       01  HDR-3.
           05  FILLER                    PIC X(4)   VALUE "ITEM".
           05  FILLER                    PIC XXX    VALUE SPACES.
           05  FILLER                    PIC X(9)   VALUE "CORP CODE".
           05  FILLER                    PIC X(20)  VALUE SPACES.
           05  FILLER           PIC X(13)  VALUE "PREV QTY DLVR".
           05  FILLER                    PIC XX     VALUE SPACES.
           05  FILLER                    PIC XX     VALUE "UM".
           05  FILLER                    PIC XXX    VALUE SPACES.
           05  FILLER           PIC X(12)  VALUE "NEW QTY DLVR".
           05  FILLER                    PIC XX     VALUE SPACES.
           05  FILLER                    PIC XX     VALUE "UM".
           05  FILLER                    PIC XX     VALUE SPACES.

       01  PRT-ITM-HDR.
           05  PRT-ITM                   PIC Z(3)9  VALUE ZEROS.
           05  FILLER                    PIC X(4)   VALUE SPACES.
           05  PRT-CODE                  PIC X(7)   VALUE SPACES.
           05  FILLER                    PIC X(21)  VALUE SPACES.
           05  PRT-PREV-DLVR             PIC Z(7)9.9999 VALUE ZEROS.
           05  PRT-PREV-DLVR-R REDEFINES PRT-PREV-DLVR PIC Z(12)9.
           05  FILLER                    PIC XX     VALUE SPACES.
           05  PRT-PREV-DLVR-UM          PIC XX     VALUE SPACES.
           05  FILLER                    PIC XX     VALUE SPACES.
           05  PRT-PRES-DLVR             PIC Z(7)9.9999- VALUE ZEROS.
           05  PRT-PRES-DLVR-R REDEFINES PRT-PRES-DLVR PIC Z(12)9-.
           05  FILLER                    PIC X      VALUE SPACES.
           05  PRT-PRES-DLVR-UM          PIC XX     VALUE SPACES.
           05  FILLER                    PIC XX     VALUE SPACES.

       01  PRT-CONTAINER.
           05  FILLER                    PIC X(44)   VALUE SPACES.
           05  FILLER          PIC X(11)   VALUE "CONTAINER  ".
           05  FILLER                    PIC X(2)    VALUE SPACES.
           05  PRT-CONT-QTY              PIC Z(7)9.9999 VALUE ZEROS.
           05  PRT-CONT-QTY-R REDEFINES PRT-CONT-QTY PIC Z(12)9.
           05  FILLER                    PIC X       VALUE SPACES.
           05  PRT-CONT-UM               PIC X(2)    VALUE SPACES.
           05  FILLER                    PIC X(19)   VALUE SPACES.

       01  PRT-CHG-REASON.
           05  FILLER                    PIC X(5)    VALUE SPACES.
           05  PRT-REASON                PIC X(75).

       01  PRT-DESC-HDR.
           05  PRT-DESC                  PIC X(80)   VALUE SPACES.

       01  PRT-SUB-SUBDETL-ADDLDATA.
           05  FILLER                    PIC X(28)   VALUE SPACES.
           05  FILLER                    PIC X(4)    VALUE "SUB ".
           05  PRT-SUB2                  PIC X(4)    VALUE SPACES.
           05  FILLER          PIC X(11)   VALUE "  SUB-DETL ".
           05  PRT-SUB-DETL2             PIC X(4)    VALUE SPACES.
           05  FILLER          PIC X(12)   VALUE "  ADDL DATA ".
           05  PRT-ADDL-DATA             PIC X(6)    VALUE SPACES.
       LINKAGE SECTION.
       COPY DOCKMISC IN COPYLIB.
       COPY VCOMLINK IN COPYLIB.
       COPY ESCNAME  IN COPYLIB.

      *----------  VALID RECEIVING DEPARTMENTS
       01  USER-AREA                     PIC X(2400).
       01  USER-AREA-RD  REDEFINES USER-AREA.
           02  USER-DATA    OCCURS 200 TIMES
                            INDEXED BY U-X.
               05  USER-NAME-UA          PIC X(8).
               05  RCV-DPT-UA            PIC X(4).

       01  DIRDEL-AREA                   PIC X(60).
       01  DIRDEL-TABLE REDEFINES DIRDEL-AREA.
           02  PLANT-AREA OCCURS 6 TIMES INDEXED BY P-A.
               03  DIRDEL-STR-DEPT       PIC X(4).
               03  DIRDEL-DATE           PIC X(6).

       COPY AUTOSTOR IN COPYLIB.
       COPY LANGSUB IN COPYLIB.

       01 DOCK-OVERSHIPMENT.
          05  CODED-OVERSHIPMENT         PIC 99.
          05  NONCODED-OVERSHIPMENT      PIC 99.
          05  CODED-RAW-OVERSHIPMENT     PIC 99.
          05  RAW-MATERIAL-GROUP.
              07  RM-GROUP OCCURS 6 TIMES PIC X(2).
      **************************************************************
      **************************************************************
      *                                                            *
      *        P R O C E D U R E        D I V I S I O N            *
      *                                                            *
      **************************************************************
      **************************************************************
       PROCEDURE DIVISION USING MISCELLANEOUS-DATA,
                                VIEW-COMAREA,
                                ESC-NAME,
                                USER-AREA,
                                DIRDEL-AREA,
                                AUTOSTORE-AREA,
                                LANGUAGE-PARMS,
                                DOCK-OVERSHIPMENT.
       00-MAIN.
           OPEN INPUT DVENDOR
                      DPOITEM
                      DRCVITEM
                      MPORCV
                      DREQD
                      MSTORERM
                      DPOFREIGHT
                      MPLTINFO
                      MREQ
                      DINVRCD-I.
           OPEN I-O   DDAILYTC
                      DISPLAY-FILE
                      DVENDITM
                      DPOITEM-O
                      DRCVITEM-O
                      MSTORERM-O
                      MPORCV-O
                      DPODATAITM
                      DRAWLOT
                      DRAWLOT2
                      USAGEFIL
                      DTALLY
                      DRCVCORR-O
                      DRCVTRAK-O.

      *----------  DETERMINE WHICH PLANT IS RUNNING THIS PROGRAM.
      *            IF NUMBER STARTS WITH "11", IT IS AN AKRON PLANT.
      *            IF NUMBER STARTS WITH "2", KELLY PLANT IS ASSUMED.
           MOVE PLT-NUMBER               TO  WHICH-PLANT.
           IF PT-TYPE = "11" OR (WHICH-PLANT = "310")
              MOVE 1                     TO  PLANT-TYPE
           ELSE
              MOVE 0                     TO  PLANT-TYPE.

           IF PLT-TYPE-1 = "2"
              MOVE 2                     TO  PLANT-TYPE.

           MOVE 1                        TO  DATE-MODE.
           CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
           MOVE DATE-SLASH-OUT           TO  PRT-DATE.
           MOVE DATE-FORMATTED-TIME-OUT  TO  PRT-TIME.
           MOVE DATE-YMD-OUT             TO  RECEIPT-DATE.
           IF NOT KELLY
              GO TO 04-AFTER-KELLY.

      *----------  GET LAST CUTOFF DATE.  KELLY CORRECTIONS MAY BE
      *            REDUCED ONLY UNTIL A CUTOFF IS DONE ON THE RECEIPT
      *            UNLESS THE USER IS A MATERIALS CONTROL USER.  QTY
      *            CAN BE INCREASED ANYTIME BY ANY USER.
           MOVE 0                        TO  COND-WORD.
           MOVE "P 02"                   TO  PLT-AG.
           MOVE PLT-AG TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY MOVE 17       TO  COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17                   TO  COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99                   TO  COND-WORD.
           IF NOT GOOD-CALL
              MOVE "***  NEED CUTOFF DATE IN MPLTINFO SCORRCVR  ***"
                                         TO  BU-DISPLAY-MSG
              PERFORM 2100-BLOWUP.
           MOVE MPLTINFO-CUTOFF-DATE  TO SAVE-LAST-CUTOFF-DATE.

       04-AFTER-KELLY.
      *----------  GET THE STORES RECEIPT EXTERNAL INTERFACE SWITCHES
      *----------  JSB, 9/3/97 FOR DES MOINES
           MOVE "SRX "                   TO  PLT-AG.
           MOVE PLT-AG TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
      *****    INVALID KEY MOVE 17       TO  COND-WORD.
      *****IF FILE-STATUS-1 = "2"
      *****    MOVE 17                   TO  COND-WORD
      *****ELSE
      *****IF FILE-STATUS NOT = "00"
      *****    MOVE 99                   TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
              MOVE "N"                   TO SAVE-EXTSYS
                                            SAVE-EXTAUTO
           ELSE
               MOVE MPLTINFO-SRX-EXTSYS TO SAVE-EXTSYS
               MOVE MPLTINFO-SRX-AUTO   TO SAVE-EXTAUTO.

           MOVE "FRAN"                   TO  PLT-AG.
           MOVE PLT-AG TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY MOVE 17       TO  COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17                   TO  COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99                   TO  COND-WORD.
           IF NOT GOOD-CALL
              MOVE SPACES                TO FRAN-TABLE
           ELSE
               MOVE MPLTINFO-FRANCHISES TO FRAN-TABLE.

      *------- MOVED THIS PARAGRAPH NAME SO THAT THE "SRX" AND "FRAN"
      *------- SWITCHES CAN BE LOADED.
      *04-AFTER-KELLY.
           MOVE SPACES                   TO  ENTER-ITEM-BUFFER.
      *----------  DISPLAY SPOOLER NUMBERS ON SCREEN
           MOVE SPOOL-PRT-NO             TO  DE-SP1.
           MOVE ACCTG-PRT-NO             TO  DE-SP2.
           MOVE PRINT-PRT-NO             TO  DE-SP3.
       05-LOOP.

           PERFORM 400-MODIFY-RECEIVER  THRU 499-EXIT.
           IF VIEW-LASTKEY NOT = 3
              GO TO 05-LOOP.

           CLOSE      DVENDOR
                      DREQD
                      MREQ
                      DISPLAY-FILE
                      DDAILYTC
                      DVENDITM
                      DPOFREIGHT
                      DPOITEM
                      DPOITEM-O
                      DRCVITEM
                      DRCVITEM-O
                      MPLTINFO
                      MSTORERM
                      MSTORERM-O
                      DPODATAITM
                      MPORCV
                      MPORCV-O
                      DRAWLOT
                      DRAWLOT2
                      USAGEFIL
                      DTALLY
                      DRCVCORR-O
                      DINVRCD-I
                      DRCVTRAK-O.
       09-EXIT.
           GOBACK.

       2100-BLOWUP.
           MOVE "SCORRCVR"               TO  BU-PGM-NAME.
           MOVE VIEW-NFNAME              TO  BU-DISPLAY-FLD (1).
           MOVE CODE-ARG                 TO  BU-DISPLAY-FLD (2).
           MOVE MISC-RS-ARG              TO  BU-DISPLAY-FLD (3).
           MOVE VEN-ARG                  TO  BU-DISPLAY-FLD (4).
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
                 VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                 BU-DISPLAY-FLDS.

      ***********************************************************
      **    THE FORM IS DISPLAYED REQUESTING A PURCHASE        **
      **    ORDER NUMBER.  THE FOLLOWING CHECKS ARE PERFORMED  **
      **    ON THE NUMBER BY THE ROUTINE "CVALRCVR" AFTER THE  **
      **    RECEIVING SLIP NUMBER  HAS BEEN ENTERED.           **
      **       1.  MPORCV IS READ TO SEE IF PO EXISTS          **
      **       2.  AKRON PLANTS CHECK FOR VALID RECEIVING      **
      **           DEPARTMENTS.                                **
      **                                                       **
      ***********************************************************
       400-MODIFY-RECEIVER.
           MOVE CORMAIN                  TO  VIEW-NFNAME.

           MOVE SPACES                   TO  BLANK-OUT-AREA,
                                            DE-FIELDS-2,
                                            ITEM-DATA.
           MOVE ZEROES                   TO  DE-RLSE, DE-RS, DE-ITM,
                          DE-QTY, SCR-PRICE-QTY-DLVR,
                          CONTAINER-DLVR.
      *    "KEY IN THE ITEM NUMBER, THEN DEPRESS 'ENTER'"
           MOVE  11                      TO  LANG-SETNUM.
           MOVE   7                      TO  LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER           TO  VAL-INSTRUCTION.

       402-DISPLAY-RECEIVING-SCREEN.
      *---------- CALL SUBPROG WHICH WILL HANDLE THE SHOWFORM,
      *---------- READFIELDS, SPECIAL KEY LOGIC (FLOP SCREEN, PRINT
      *---------- SCREEN, REFRESH, ETC), AND VIEW EDITS.
           MOVE ENTER-ITEM-BUFFER        TO  SCREEN-BUFFER.
           MOVE SCREEN-BUFFER            TO  DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
              INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0"                 TO  SRF-INDICATORS.

           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0"                 TO  SRF-INDICATORS.
           MOVE DISPLAY-REC              TO  SCREEN-BUFFER.

      *------ A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *------ IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3                    TO  VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM         TO  VIEW-LASTKEY.


           MOVE SCREEN-BUFFER            TO  ENTER-ITEM-BUFFER.
           IF VIEW-LASTKEY = 3
              GO TO 499-EXIT.
           IF VIEW-LASTKEY = 7
              GO TO 400-MODIFY-RECEIVER.
      *************************************************************
      *      VALIDATE THE PO ENTERED TO SEE IF IT EXISTS          *
      *************************************************************
           MOVE DE-PO                    TO  WS-ACCUM-PO.
           MOVE DE-RLSE                  TO  WS-ACCUM-RLSE.
           MOVE DE-RS                    TO  WS-ACCUM-RS.
           MOVE "P"                      TO  WS-ACCUM-PO-INDIC.
           MOVE WS-ACCUMULATOR           TO  MISC-RS-ARG,
                                             WS-RECEIVER.
           MOVE 0                        TO  COND-WORD.
           MOVE WS-ACCUMULATOR           TO  PORCVNO OF MPORCV-REC.
           READ MPORCV INTO BUF-MPORCV
               INVALID KEY MOVE 17       TO  COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17                   TO  COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99                   TO  COND-WORD.
           IF COND-WORD NOT = 0
               IF NO-ENTRY
      *            ***  PURCHASE ORDER DOES NOT EXIST ***
                   MOVE  16              TO  LANG-SETNUM
                   MOVE  45              TO  LANG-MSGNUM
                   MOVE 11               TO  FIELD-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE DE-PO-RLSE-RS    TO  MSG-VALUE
                   PERFORM 940-VSETERROR        THRU 949-EXIT
                   GO TO 402-DISPLAY-RECEIVING-SCREEN
               ELSE
                 MOVE "DBGET MPORCV 305 SCORRCVR " TO BU-DISPLAY-MSG
                 PERFORM 2100-BLOWUP.

           MOVE ZEROES                   TO  LANG-SETNUM.
           CALL "CVALRCVR" USING MISCELLANEOUS-DATA,
                                 USER-AREA, MESSAGE-BUFFER,
                                 LANG-SETNUM, LANG-MSGNUM,
                                 BUF-DPORECD, CVR-FILLER.

           IF LANG-SETNUM NOT = ZEROS
              PERFORM 999-CATREAD               THRU 999-CATREAD-EXIT
              PERFORM 940-VSETERROR             THRU 949-EXIT
              GO TO 402-DISPLAY-RECEIVING-SCREEN.
      **** DPORECD RETRIEVED AND RETURNED FROM CVALRCVR

      **********************************************************
      * FOR INVOICELESS PURCHASE ORDERS, CHECK IF A REGISTER
      * NUMBER WAS ASSIGNED TO THIS RECEIVING SLIP.  IF IT WAS
      * THEN DO NOT ALLOW THE CORRECTION.
      *********************************************************
      ***COMMENTED THIS LOGIC OUT SINCE IT WAS CAUSING PROBLEMS
      ***IN UNION CITY.   12/05/1995
      **********************************************************
      *    PERFORM 500-CHECK-INVOICELESS THRU 500-EXIT.
           IF LANG-SETNUM NOT = ZEROS
              PERFORM 999-CATREAD               THRU 999-CATREAD-EXIT
              PERFORM 940-VSETERROR             THRU 949-EXIT
              GO TO 402-DISPLAY-RECEIVING-SCREEN.

           MOVE PO-INTERNAL-ORDER-INDIC  TO  CDD-INTERNAL-PO.

      *----------  NO CHANGES WERE MADE TO SPOOLER NUMBERS.
           IF DE-SP1 = SPOOL-PRT-NO
              IF DE-SP2 = ACCTG-PRT-NO
                 IF DE-SP3 = PRINT-PRT-NO
                    GO TO 405-MOVE-SPOOLER.

      *----------  VALIDATE SPOOLER NUMBER CHANGES
           IF DE-SP2 NOT = ACCTG-PRT-NO
            IF DE-SP2 NOT = ZEROS
              NEXT SENTENCE
            ELSE
              GO TO 403-CHECK
           ELSE
              GO TO 403-CHECK.
           MOVE DE-SP2                   TO  AREA-SP.
           MOVE 0                        TO  COND-WORD.
           MOVE BUILD-MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO   INTO BUF-MPLTINFO
               INVALID KEY MOVE 17       TO  COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17                   TO  COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99                   TO  COND-WORD.
           IF NO-ENTRY
      *          *** SPOOLER NUMBER DOES NOT EXIST ***
                 MOVE  19                TO  LANG-SETNUM
                 MOVE   2                TO  LANG-MSGNUM
                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                 MOVE DE-SP2             TO  MSG-VALUE
                 MOVE 39                 TO  FIELD-NUMBER
                 PERFORM 940-VSETERROR THRU 949-EXIT
                 GO TO 402-DISPLAY-RECEIVING-SCREEN
              ELSE
                 IF NOT GOOD-CALL
                    MOVE "DBGET MPLTINFO DE-SP2 AT 350 SCORRCVR"
                                         TO  BU-DISPLAY-MSG
                    MOVE "SPOOLER # IS"  TO  BU-DISPLAY-FLD (5)
                    MOVE DE-SP2          TO  BU-DISPLAY-FLD9 (5)
                    PERFORM 2100-BLOWUP.

       403-CHECK.
           IF DE-SP1 NOT = SPOOL-PRT-NO
              NEXT SENTENCE
           ELSE
              GO TO 404-CHECK.
           MOVE DE-SP1                   TO  AREA-SP.
           MOVE 0                        TO  COND-WORD.
           MOVE BUILD-MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO   INTO BUF-MPLTINFO
               INVALID KEY MOVE 17       TO  COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17                   TO  COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99                   TO  COND-WORD.
           IF NO-ENTRY
      *          *** SPOOLER NUMBER DOES NOT EXIST ***
                 MOVE  19                TO  LANG-SETNUM
                 MOVE   2                TO  LANG-MSGNUM
                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                 MOVE DE-SP1             TO  MSG-VALUE
                 MOVE 38                 TO  FIELD-NUMBER
                 PERFORM 940-VSETERROR THRU 949-EXIT
                 GO TO 402-DISPLAY-RECEIVING-SCREEN
           ELSE
                 IF NOT GOOD-CALL
                    MOVE "DBGET MPLTINFO DE-SP1 AT 350 SCORRCVR"
                                         TO  BU-DISPLAY-MSG
                    MOVE "SPOOLER # IS"  TO  BU-DISPLAY-FLD (5)
                    MOVE DE-SP1          TO  BU-DISPLAY-FLD9 (5)
                    PERFORM 2100-BLOWUP.

       404-CHECK.
           IF DE-SP3 NOT = PRINT-PRT-NO
            IF DE-SP3 NOT = ZEROS
               NEXT SENTENCE
            ELSE
               GO TO 405-MOVE-SPOOLER
           ELSE
               GO TO 405-MOVE-SPOOLER.
           MOVE DE-SP3                   TO  AREA-SP.
           MOVE 0                        TO  COND-WORD.
           MOVE BUILD-MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO   INTO BUF-MPLTINFO
               INVALID KEY MOVE 17       TO  COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17                   TO  COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99                   TO  COND-WORD.
           IF NO-ENTRY
      *          *** SPOOLER NUMBER DOES NOT EXIST ***
                 MOVE  19                TO  LANG-SETNUM
                 MOVE   2                TO  LANG-MSGNUM
                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                 MOVE DE-SP3             TO  MSG-VALUE
                 MOVE 40                 TO  FIELD-NUMBER
                 PERFORM 940-VSETERROR THRU 949-EXIT
                 GO TO 402-DISPLAY-RECEIVING-SCREEN
           ELSE
                 IF NOT GOOD-CALL
                    MOVE "DBGET MPLTINFO DE-SP3 AT 350 SCORRCVR"
                                         TO  BU-DISPLAY-MSG
                    MOVE "SPOOLER # IS"  TO  BU-DISPLAY-FLD (5)
                    MOVE DE-SP3          TO  BU-DISPLAY-FLD9 (5)
                    PERFORM 2100-BLOWUP.

       405-MOVE-SPOOLER.
           MOVE DE-SP1                   TO  SPOOL-PRT-NO.
           MOVE DE-SP2                   TO  ACCTG-PRT-NO.
           MOVE DE-SP3                   TO  PRINT-PRT-NO.

      *----------  GET DELIVERED AND STORED QTY FROM RECEIVER ENTRY
           MOVE DE-ITM                   TO  SD-ITM.

           MOVE 0                        TO  COND-WORD.
           MOVE MISC-RS-ARG              TO  PORCVNO OF DRCVITEM-REC.
           START DRCVITEM KEY = PORCVNO OF DRCVITEM-REC
               INVALID KEY MOVE 17       TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17               TO  COND-WORD
               ELSE
                   MOVE 99               TO  COND-WORD.
           IF COND-WORD NOT = 0
      *          "* THIS IS NOT A STOREROOM PURCHASE ORDER *"
                 MOVE  20                TO  LANG-SETNUM
                 MOVE   1                TO  LANG-MSGNUM
                 MOVE 11                 TO  FIELD-NUMBER
                 PERFORM 999-CATREAD   THRU 999-CATREAD-EXIT
                 MOVE MISC-RS-ARG        TO  MSG-VALUE
                 PERFORM 940-VSETERROR THRU 949-EXIT
                 GO TO 402-DISPLAY-RECEIVING-SCREEN.


           MOVE 0                        TO  COND-WORD.
           READ DRCVITEM NEXT INTO BUF-DRCVITEM
               AT END MOVE 15            TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15               TO  COND-WORD
               ELSE
                   MOVE 99               TO  COND-WORD.
           IF PORCVNO OF DRCVITEM-REC NOT = MISC-RS-ARG
               MOVE 15                   TO  COND-WORD.
           IF COND-WORD NOT = 0
      *          "* THIS IS NOT A STOREROOM PURCHASE ORDER *"
                 MOVE  20                TO  LANG-SETNUM
                 MOVE   1                TO  LANG-MSGNUM
                 MOVE 11                 TO  FIELD-NUMBER
                 PERFORM 999-CATREAD   THRU 999-CATREAD-EXIT
                 MOVE MISC-RS-ARG        TO  MSG-VALUE
                 PERFORM 940-VSETERROR THRU 949-EXIT
                 GO TO 402-DISPLAY-RECEIVING-SCREEN.


       410-GET-RIGHT-ITEM.
           IF RCV-ITEM-NUMBER = SD-ITM
               MOVE RCV-QTY-DLVR         TO  HOLD-RS-PREV-DLVR
                                             OLD-DLVR
               MOVE RCV-QTY-STORED       TO  HOLD-RS-PREV-STORED
               MOVE RCV-DATE-RCVD        TO  RECEIPT-DATE
               MOVE RCV-ITEM-UM          TO  OLD-UM
               GO TO 415-FIND-ACCUM.

           MOVE 0                        TO  COND-WORD.
           READ DRCVITEM NEXT INTO BUF-DRCVITEM
               AT END MOVE 15            TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15               TO  COND-WORD
               ELSE
                   MOVE 99               TO  COND-WORD.
           IF PORCVNO OF DRCVITEM-REC NOT = MISC-RS-ARG
               MOVE 15                   TO  COND-WORD.
           IF COND-WORD NOT = 0
             IF COND-WORD = 15
      *        "* ITEM NO. DOES NOT EXIST ON THIS PURCHASE ORDER *"
               MOVE   9                  TO  LANG-SETNUM
               MOVE  11                  TO  LANG-MSGNUM
               MOVE 1                    TO  FIELD-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                 MOVE MISC-RS-ARG        TO  MSG-VALUE
                 PERFORM 940-VSETERROR THRU 949-EXIT
                 GO TO 402-DISPLAY-RECEIVING-SCREEN
             ELSE
                 MOVE "DBGET DRCVITEM 410 SCORRCVR " TO BU-DISPLAY-MSG
                 PERFORM 2100-BLOWUP.

           GO TO 410-GET-RIGHT-ITEM.

      *----------  FIND ACCTING DATA, DELIVERED AND STORED QTY
      *            FROM ACCUMULATOR ENTRY
       415-FIND-ACCUM.
           MOVE ZEROS                    TO  WS-ACCUM-RS.

           MOVE 0                        TO  COND-WORD.
           MOVE WS-ACCUMULATOR           TO  PORCVNO OF DPOITEM-REC.
           START DPOITEM KEY = PORCVNO OF DPOITEM-REC
               INVALID KEY MOVE 17       TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17               TO  COND-WORD
               ELSE
                   MOVE 99               TO  COND-WORD.
           IF COND-WORD NOT = 0
                 MOVE "DBFIND DPOITEM 415 SCORRCVR" TO BU-DISPLAY-MSG
                 PERFORM 2100-BLOWUP.

       420-GET-ITEM.
           MOVE 0                        TO  COND-WORD.
           READ DPOITEM NEXT INTO BUF-DPOITEM
               AT END MOVE 15            TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15               TO  COND-WORD
               ELSE
                   MOVE 99               TO  COND-WORD.
           IF PORCVNO OF DPOITEM-REC NOT = WS-ACCUMULATOR
               MOVE 15                   TO  COND-WORD.
           IF COND-WORD NOT = 0
                 MOVE "DBGET DPOITEM 420 SCORRCVR" TO BU-DISPLAY-MSG
                 PERFORM 2100-BLOWUP.

           IF ITM-NUMBER NOT = SD-ITM
               GO TO 420-GET-ITEM.

           MOVE ITM-CONTAINER            TO  SD-CONTAINER.
           MOVE ITM-PRICE-UM             TO  SD-PRICE-UM.
           MOVE ITM-UNIT-PRICE           TO  SD-UNIT-PRICE.
           MOVE ITM-SUB-DETL             TO  SD-SUB-DETL.
           MOVE ITM-ADDL-DATA            TO  SD-ADDL-DATA.
           MOVE ITM-COMPLETE-FLAG        TO  SD-MATERIAL-COMPLETE.
           MOVE ITM-UM                   TO  SD-UM, DE-UM.
           MOVE ITM-CORP-CODE            TO  SD-CODE.
           MOVE ITM-CLASS                TO  SD-CLASS.
           MOVE ITM-MASTER-STOCK         TO  SD-MASTER-STOCK.

           IF NOT KELLY
              MOVE ITM-QTY-ORD           TO  SD-QTY-ORD
              MOVE ITM-QTY-DLVR          TO  SD-PREV-DLVR
              MOVE ITM-QTY-PAID          TO  HOLD-PO-PAID
              GO TO 425-FIND-DPORECD.

           IF ITM-QTY-ORD = ZERO AND ITM-KELLY-PO-QTY = ZERO
               MOVE 1 TO SD-KELLY-CF
           ELSE
               DIVIDE ITM-QTY-ORD BY ITM-KELLY-PO-QTY
                              GIVING SD-KELLY-CF ROUNDED.
           DIVIDE ITM-QTY-ORD BY SD-KELLY-CF
                    GIVING SD-QTY-ORD ROUNDED.
           DIVIDE ITM-QTY-DLVR BY SD-KELLY-CF
                    GIVING SD-PREV-DLVR ROUNDED.
           DIVIDE HOLD-RS-PREV-DLVR BY SD-KELLY-CF
                    GIVING HOLD-RS-PREV-DLVR ROUNDED.
           DIVIDE HOLD-RS-PREV-STORED BY SD-KELLY-CF
                    GIVING HOLD-RS-PREV-STORED ROUNDED.
           MOVE ITM-KELLY-PO-QTY         TO  SD-PO-QTY-ORD.

       425-FIND-DPORECD.
      *----------  USE DPORECD FOR ACCOUNTING DATA AND VENDOR CODE:
      *            RECORD WAS RETRIEVED IN "CVALRCVR"
           MOVE PO-VEN-CODE              TO  VEN-ARG.
      *-----CHANGED TO MATCH SRCVEXEC PARAMETER SETTINGS FOR PO ITEM.
      *    MOVE PO-ADDL-DATA             TO  CDD-PO-ADDL-DATA.
           MOVE ITM-ADDL-DATA            TO  CDD-PO-ADDL-DATA.
           MOVE PO-PRIME                 TO  CDD-PO-PRIME.

      *----------  GET STOREROOM RECORD TO CHECK IF DIRECT DELIVERY
           MOVE "Y"                      TO  SD-DIRECT-SW.
           IF SD-CODE NOT = "NON-STR"
              PERFORM 810-GET-MSTOREROOM THRU 819-EXIT
              CALL "CDDCHECK" USING PLT-NUMBER, DIRDEL-AREA,
                   ITM-SUB-DETL, CDD-PO-ADDL-DATA, CDD-PO-PRIME,
                   CDD-INTERNAL-PO, PO-CO, SD-CLASS, RETURN-FLAGS
                   PO-SUB
              MOVE RETURN-DD             TO  SD-DIRECT-SW.

      *----------  WRITE THE SCREEN
           MOVE ITM-NUMBER               TO  VAL-ITM.
           MOVE ITM-CORP-CODE            TO  VAL-CODE.
           MOVE SD-QTY-ORD               TO  VAL-QTY-ORD.
           MOVE ITM-UM                   TO  VAL-ORD-UM.
           MOVE HOLD-RS-PREV-DLVR        TO  VAL-PREV-DLVR
                                             DE-QTY.
           MOVE SPACES                   TO  DE-ITEM-COMPLETE,
                                                VAL-DESCRIPTION-LINES.

           MOVE RCV-CHATNO               TO  DE-CHATNO
                                             OLD-CHATNO.
           MOVE RCV-LOT                  TO  DE-RAW-LOT.

           MOVE RCV-TALLY                TO  DE-TALLY.
           IF KELLY
              MOVE ITM-KELLY-PO-UM       TO  DE-UM, VAL-ORD-UM,
                                                     SD-KELLY-PO-UM.
           MOVE 1                        TO  PRT-SUB.

      *----------  FILL IN DESCRIPTION (UP TO 8 LINES)
           IF SD-CODE  = "NON-STR"
              MOVE 8                     TO  CNDESC-LINES-TO-GET
              MOVE 0                     TO  CNDESC-LINES-GOT
              MOVE SPACES                TO  CNDESC-LINE
              MOVE SD-ITM                TO  WS-SD-ITM
              CALL "CNDESC" USING BASE, WS-ACCUMULATOR,
                                  WS-SD-ITM, CNDESC-DATA
              PERFORM  435-MOVE-NONCODED-DESC CNDESC-LINES-GOT TIMES
           ELSE
              MOVE 8                     TO  CDESC-LINES-TO-GET
              MOVE "P"                   TO  CDESC-LANGUAGE-OPTION
              MOVE "F"                   TO  CDESC-DESC-OPTION
              MOVE "S"                   TO  CDESC-MANUFACT-OPTION
              MOVE "R"                   TO  CDESC-LOCAL-DESC-OPTION
              MOVE SD-CODE               TO  CODE-ARG
              CALL "CDESC" USING RET-CODE, BASE, STATUS-AREA,
                           BU-DISPLAY-MSG, CODE-ARG, CDESC-DATA
              PERFORM 430-MOVE-CODED-DESC CDESC-LINES-GOT TIMES.

           GO TO 440-GET-FORM.

       430-MOVE-CODED-DESC.
           MOVE CDESC (PRT-SUB)          TO  VAL-DESC (PRT-SUB).
           ADD 1                         TO  PRT-SUB.

       435-MOVE-NONCODED-DESC.
           MOVE CNDESC (PRT-SUB)         TO  VAL-DESC (PRT-SUB).
           ADD 1                         TO  PRT-SUB.
       440-GET-FORM.
      *    "KEY IN THE TOTAL QUANTITY DELIVERED, THEN DEPRESS 'ENTER'
           MOVE  11                      TO  LANG-SETNUM.
           MOVE  15                      TO  LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE  MESSAGE-BUFFER          TO  VAL-INSTRUCTION.
           IF ITM-CONTAINER = "*"
              MOVE "RETURNABLE CONTAINER"        TO CONTAINER-LIT
              MOVE HOLD-RS-PREV-DLVR     TO  DE-QTY
              MOVE CONTAINER-ITEM        TO  VIEW-NFNAME
           ELSE
              MOVE SPACES                TO  CONTAINER-LIT
              MOVE NO-CONTAINER-ITEM     TO  VIEW-NFNAME.

           IF C-ORDER-SW = "Y"
             IF DE-UM  =  DE-PRICE-UM
                 MOVE "N"                TO  NEED-PRICE-QTY-SW
             ELSE
                MOVE   1                 TO  LANG-SETNUM
                MOVE  23                 TO  LANG-MSGNUM
                PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                MOVE MESSAGE-BUFFER      TO  QTY-C-ORDER-INSTRUCTION
                MOVE SD-PRICE-UM         TO  DE-PRICE-UM
                MOVE "Y"                 TO  PRINT-EXTRA-TITLES-SW
                MOVE "Y"                 TO  NEED-PRICE-QTY-SW
                IF ITM-CONTAINER = "*"
                   MOVE "RETURNABLE CONTAINER" TO CONTAINER-LIT
                   MOVE PRICE-CONTAINER  TO  VIEW-NFNAME
                ELSE
                   MOVE SPACES           TO  CONTAINER-LIT
                   MOVE PRICE-NO-CONTAINER  TO VIEW-NFNAME.

      *----------  GET THE FORM
       445-SHOW-FORM.
      *---------- CALL SUBPROG WHICH WILL HANDLE THE SHOWFORM,
      *---------- READFIELDS, SPECIAL KEY LOGIC (FLOP SCREEN, PRINT
      *---------- SCREEN, REFRESH, ETC), AND VIEW EDITS.
           MOVE ENTER-ITEM-BUFFER        TO  SCREEN-BUFFER.
           MOVE SCREEN-BUFFER            TO  DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
              INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0"                 TO  SRF-INDICATORS.

           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0"                 TO  SRF-INDICATORS.
           MOVE DISPLAY-REC              TO  SCREEN-BUFFER.

      *------ A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *------ IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3                    TO  VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM         TO  VIEW-LASTKEY.
            MOVE SCREEN-BUFFER           TO  ENTER-ITEM-BUFFER.

           IF VIEW-LASTKEY = 3 OR VIEW-LASTKEY = 7
               GO TO  499-EXIT.

      *----------  IF F6 FLAG IS SET, USER WANTS TO MARK ITEM COMPLETE
      *            EVEN THOUGH IT IS < 90% DELIVERED.
           IF VAL-MARK-FLAG = "1" AND VIEW-LASTKEY = 6
              MOVE "C"                   TO  VAL-MARK-FLAG.

           IF VIEW-LASTKEY = 2
               MOVE VIEW-NFNAME  TO SAVE-VIEW-NFNAME
               MOVE VAL-CODE     TO PASS-CORP-CODE
               MOVE DE-CHATNO    TO RETURN-CHAT-NO
               CALL "SCHATREF" USING PASS-CORP-CODE,
                                 RETURN-CHAT-NO,
                                 VIEW-COMAREA
               IF RETURN-CHAT-NO NOT = "NOTFND"
                   IF RETURN-CHAT-NO NOT = SPACES
                       MOVE RETURN-CHAT-NO TO  DE-CHATNO
                   ELSE
      *------------------ CHAT NUMBER MUST BE SELECTED
                       MOVE   3  TO  CATREAD-MSG-SET
                       MOVE 214 TO  CATREAD-MSG-NUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       PERFORM 940-VSETERROR THRU 949-EXIT
                   END-IF
               END-IF
               MOVE SAVE-VIEW-NFNAME  TO VIEW-NFNAME
               GO TO 445-SHOW-FORM
           END-IF.

      *************************************************************
      *          VALIDATE INPUT: THE CORRECT QUANTITY CANNOT      *
      *          BE CHANGED TO LESS THAN THE QUANTITY ALREADY     *
      *          PAID.  AKRON WILL NEVER HAVE THIS CONDITION      *
      *          SINCE INVOICING IS NOT DONE AND THE PAID FIELD   *
      *          IS NEVER USED.  PAID FIELD WILL ALWAYS BE ZEROS.*
      *************************************************************
      *----------  CHECK IF RAW MATL LOT NUMBER CHANGED
           IF DE-RAW-LOT NOT = SPACES
              MOVE DE-RAW-LOT TO RS-SHIFT-FLD
              CALL "TRSHIFT" USING RS-RET-CODE RS-SHIFT-FLD
              MOVE RS-SHIFT-FLD-5-8 TO DE-RAW-LOT
              IF DE-RAW-LOT NOT NUMERIC
      *----------- THIS ENTRY MUST BE NUMERIC
                  MOVE 42                  TO  FIELD-NUMBER
                  MOVE 20                  TO  LANG-SETNUM
                  MOVE 47                  TO  LANG-MSGNUM
                  PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                  PERFORM 940-VSETERROR THRU 949-EXIT
                  GO TO 445-SHOW-FORM
              END-IF
           END-IF.
           IF DE-RAW-LOT NOT = RCV-LOT
              IF DE-RAW-LOT NOT = SPACES
                MOVE RCV-CORP-CODE TO DRAW-CORP-ARG
                MOVE DE-RAW-LOT TO DRAW-LOT-ARG
                MOVE DRAWLOT-ARG TO CORPLOT OF DRAWLOT-REC
                MOVE 0 TO COND-WORD
                START DRAWLOT KEY = EXTERNALLY-DESCRIBED-KEY
                    INVALID KEY MOVE 17 TO COND-WORD
                END-START
                IF FILE-STATUS NOT = "00"
                    MOVE 17 TO COND-WORD
                END-IF
                IF GOOD-CALL
      *-------------- LOT EXISTS; CHOOSE ANOTHER NUMBER
                    MOVE 42                  TO  FIELD-NUMBER
                    MOVE 12                  TO  LANG-SETNUM
                    MOVE  7                  TO  LANG-MSGNUM
                    PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                    PERFORM 940-VSETERROR THRU 949-EXIT
                    GO TO 445-SHOW-FORM
                END-IF
              END-IF
              PERFORM 880-CHANGE-RAWLOT THRU 880-EXIT
           END-IF.

      *----------  CHECK IF TALLY NUMBER CHANGED
           IF DE-TALLY NOT = RCV-TALLY
              PERFORM 870-CHANGE-TALLY THRU 879-EXIT.

      *----------  CHECK IF CHAT NUMBER CHANGED
           IF DE-CHATNO NOT = RCV-CHATNO
              PERFORM 890-CHANGE-CHATNO THRU 890-EXIT.

      *----------  SKIP PROCESSING IF QTY, UM AND CONTAINER
      *            WERE NOT CHANGED
      *----------  IF ITEM WAS BLANK, BUT CONTAINER WAS CORRECTED, ONLY
      *            SEND A TRANSACTION, DO NOT UPDATE ANYTHING.
           MOVE 0                        TO  CONTAINER-FLAG.
           IF DE-QTY = HOLD-RS-PREV-DLVR
              IF KELLY
                 IF CONTAINER-UM = SPACES
                    GO TO 400-MODIFY-RECEIVER
                 ELSE
                    MOVE "N"             TO  SD-DIRECT-SW
                    MOVE 1               TO  CONTAINER-FLAG
                    GO TO 450-COMPLETED-VALIDATION
              ELSE
                 IF DE-UM = ITM-UM
                    IF CONTAINER-UM = SPACES
                       GO TO 400-MODIFY-RECEIVER
                    ELSE
                       MOVE 1            TO  CONTAINER-FLAG
                       MOVE "N"          TO  SD-DIRECT-SW
                       GO TO 450-COMPLETED-VALIDATION.

      *----------  VALIDATE INPUT
           IF DE-UM = SPACES
      *---- YOU MUST ENTER RECEIPT UM
              MOVE 10                    TO  FIELD-NUMBER
              MOVE 66                    TO  LANG-SETNUM
              MOVE 111                   TO  LANG-MSGNUM
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 940-VSETERROR THRU 949-EXIT
              GO TO 445-SHOW-FORM.

           IF CONTAINER-DLVR > ZEROES
             IF CONTAINER-UM = SPACES
      *---- YOU MUST ENTER CONTAINER UM
              MOVE 32                    TO  FIELD-NUMBER
              MOVE 66                    TO  LANG-SETNUM
              MOVE 112                   TO  LANG-MSGNUM
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 940-VSETERROR THRU 949-EXIT
              GO TO 445-SHOW-FORM.

           IF DE-REASON = SPACES
      *---- YOU MUST ENTER REASON FOR CORRECTION
              MOVE 19                    TO  FIELD-NUMBER
              MOVE 66                    TO  LANG-SETNUM
              MOVE 113                   TO  LANG-MSGNUM
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 940-VSETERROR THRU 949-EXIT
              GO TO 445-SHOW-FORM.

           IF DE-SP1 = ZEROES
      *---- YOU MUST ENTER FIRST SPOOLER NUMBER
              MOVE 38                    TO  FIELD-NUMBER
              MOVE 66                    TO  LANG-SETNUM
              MOVE 114                   TO  LANG-MSGNUM
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 940-VSETERROR THRU 949-EXIT
              GO TO 445-SHOW-FORM.

           MOVE "C"                      TO  CALLING-ROUTINE-FLAG.
           MOVE ZEROS                    TO  LANG-SETNUM, LANG-MSGNUM,
                                           FIELD-NUMBER.
           MOVE SPACES                   TO  DE-FIELDS-2.
           MOVE DE-PO                    TO  VAL-PO.
           MOVE DE-RLSE                  TO  VAL-RLSE.
           MOVE DE-ITM                   TO  QTY-ITM.
           MOVE VAL-CODE                 TO  QTY-CODE.
           MOVE VAL-AREA                 TO  QTY-AREA.
           MOVE DE-UM                    TO  QTY-UM.
           MOVE DE-QTY                   TO  QTY-DLVR.
           MOVE DE-ITEM-COMPLETE         TO  QTY-MATERIAL-COMPLETE.
           MOVE HOLD-RS-PREV-DLVR        TO  CORRECTION-RS-PREV-DLVR.
      *------04/16/97 INCLUDE CONTAINER STUFF TO PASS TO CVALITEM
           MOVE CONTAINER-DLVR           TO  QTY-CONT-DLVR.
           MOVE CONTAINER-UM             TO  QTY-CONT-UM.
           CALL    "CVALITEM" USING MISCELLANEOUS-DATA,
                                        FIELD-NUMBER, LANG-SETNUM,
                                        LANG-MSGNUM,
                                        PASSED-FLAGS,
                                        BUF-DPORECD,
                                        DE-FIELDS-2,
                                        ITEM-DATA,
                                        DOCK-OVERSHIPMENT.
           IF LANG-SETNUM NOT = 0
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 940-VSETERROR THRU 949-EXIT
              GO TO 445-SHOW-FORM.

      *-----GET QTY AND UM TO PO UM FROM CVALITEM
           MOVE SD-PO-QTY-DLVR TO DE-QTY.
           MOVE SD-DE-UM TO DE-UM.

           IF DE-QTY < ZEROS
      *-----QUANTITY CANNOT BE BELOW ZERO
              MOVE  8                    TO  FIELD-NUMBER
              MOVE 17                    TO  LANG-SETNUM
              MOVE 11                    TO  LANG-MSGNUM
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 940-VSETERROR THRU 949-EXIT
              GO TO 445-SHOW-FORM.

           SUBTRACT HOLD-RS-PREV-DLVR FROM DE-QTY
                    GIVING HOLD-ADJ-QTY ROUNDED.
           ADD HOLD-ADJ-QTY, SD-PREV-DLVR
                    GIVING DLVR-TOTAL ROUNDED.

      *----------  CONVERT ADJUSTED QTY IN STOREROOM UM
           IF SD-CODE NOT = "NON-STR"
              IF NOT KELLY
           MOVE "00"                     TO  UMCF-RET-CODE
           MOVE SD-UM                    TO  UMCF-DEST-UM
           MOVE QTY-UM                   TO  UMCF-SOURCE-UM
           MOVE HOLD-ADJ-QTY             TO  UMCF-SOURCE-QTY
           CALL "TUMCF" USING UMCF-RET-CODE, STR-UM-AREA,
                              UMCF-QUANTITY-AREA
           IF UMCF-RET-CODE NOT = "00"
              MOVE "CONVERSION ERROR 445 SCORRCVR" TO BU-DISPLAY-MSG
              MOVE UMCF-RET-CODE         TO  BU-DISPLAY-FLD (1)
              PERFORM 2100-BLOWUP.
           MOVE UMCF-QTY-STR-UM-DEC      TO  HOLD-ADJ-QTY-STR-UM.

      *----------  KELLY CANNOT REDUCE QTY AFTER A CUTOFF HAS BEEN
      *            DONE ON THAT RECEIVER UNLESS off MD TRANS.
           IF KELLY
              IF DLVR-TOTAL < SD-PREV-DLVR
                 NEXT SENTENCE
              ELSE
                 GO TO 447-CHECK-QTY.

           IF SD-CODE NOT = "NON-STR"
           IF KELLY
              IF PASS-DOCK-TRANS = "MD"
                 GO TO 447-CHECK-QTY
              ELSE
                 IF RECEIPT-DATE < SAVE-LAST-CUTOFF-DATE
                    OR RECEIPT-DATE = SAVE-LAST-CUTOFF-DATE
      *             "CANNOT REDUCE QTY DELIVERED AFTER CUTOFF DATE"
                    MOVE   3             TO  LANG-SETNUM
                    MOVE   1             TO  LANG-MSGNUM
                    PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                    MOVE 8               TO  FIELD-NUMBER
                    PERFORM 940-VSETERROR THRU 949-EXIT
                    GO TO 445-SHOW-FORM
                 ELSE
                    GO TO 447-CHECK-QTY.

      *----------  NON-KELLY PLANTS CANNOT REDUCE BELOW PAID QTY
           IF DLVR-TOTAL < HOLD-PO-PAID
      *     "*** CANNOT REDUCE QTY DELIVERED BELOW PAID QTY ***"
                 MOVE   3                TO  LANG-SETNUM
                 MOVE   2                TO  LANG-MSGNUM
                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              MOVE 8                     TO  FIELD-NUMBER
              PERFORM 940-VSETERROR THRU 949-EXIT
              GO TO 445-SHOW-FORM.

       447-CHECK-QTY.
           MOVE "N"                      TO  STORE-SW.
           PERFORM 840-CHECK-IF-STORE.

      *----------  QTY DLVR CANNOT BE LESS THAN QTY ALREADY STORED
           IF SD-DIRECT-SW = "Y"  OR SD-CODE = "NON-STR"
           OR STORE-SW = "Y"
               GO TO 448-CHECK-STR-ONHAND.

           IF HOLD-ADJ-QTY < 0
               IF DE-QTY < HOLD-RS-PREV-STORED
      *            "*** CANNOT REDUCE DELIVERED BELOW STORED ***"
                   MOVE   3              TO  LANG-SETNUM
                   MOVE   4              TO  LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE HOLD-RS-PREV-STORED TO   MSG-VALUE-9
                   MOVE 8                TO  FIELD-NUMBER
                   PERFORM 940-VSETERROR THRU 949-EXIT
                   GO TO  445-SHOW-FORM.

       448-CHECK-STR-ONHAND.
           IF STORE-SW = "Y"
               IF HOLD-ADJ-QTY-STR-UM < 0
                 IF SD-MASTER-STOCK = SPACES
                   COMPUTE CHECK-ONHAND ROUNDED =
                       STR-ONHAND + HOLD-ADJ-QTY-STR-UM
                 ELSE
                   COMPUTE CHECK-ONHAND ROUNDED =
                       MASTER-STR-ONHAND + HOLD-ADJ-QTY-STR-UM
                 END-IF
                 IF CHECK-ONHAND < 0
      *           "CANNOT REDUCE STOREROOM ONHAND QUANTITY BELOW ZERO"
                     MOVE   3              TO  LANG-SETNUM
                     MOVE   213            TO  LANG-MSGNUM
                     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                     MOVE 8                TO  FIELD-NUMBER
                     PERFORM 940-VSETERROR THRU 949-EXIT
                     GO TO  445-SHOW-FORM.

       450-COMPLETED-VALIDATION.
      *************************************************************
      *          MPORCV:  UPDATE STATUS IF NEW QTY IS             *
      *                   LESS THAN PREVIOUS QTY.                 *
      *************************************************************
           IF SD-DIRECT-SW = "Y"
             GO TO 460-LOCK-DATA-SETS.

           MOVE 0                        TO  COND-WORD.
           MOVE MISC-RS-ARG              TO  PORCVNO OF MPORCV-REC2.
           READ MPORCV-O INTO BUF-MPORCV
               INVALID KEY MOVE 17       TO  COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17                   TO  COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99                   TO  COND-WORD.
           IF COND-WORD NOT = 0
                 MOVE "DBGET MPORCV AT 260 SCORRCVR " TO BU-DISPLAY-MSG
                 PERFORM 2100-BLOWUP.

           IF M-PO-RCV-STAT = "XX"
              MOVE "MM"                  TO  M-PO-RCV-STAT.
           MOVE 0                        TO  COND-WORD.
           REWRITE MPORCV-REC2 FROM BUF-MPORCV
               INVALID KEY MOVE 99       TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99                   TO  COND-WORD.
           IF COND-WORD NOT = 0
               MOVE "DBUPDATE MPORCV 260 SCORRCVR " TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

           MOVE M-PO-RCV-SEQ             TO  SAVE-RCV-SEQ.

      *************************************************************
      *          LOCK DPOITEM ACCUMULATOR AND RECEIVER ENTRIES.   *
      *          FIND ACCUMULATOR ENTRY FIRST AND UPDATE QTY      *
      *          DELIVERED.  IF ITEM IS A DIRECT DELIVERY,        *
      *          THEN ALSO UPDATE THE QTY STORED.                 *
      *************************************************************
       460-LOCK-DATA-SETS.

           IF CONTAINER-ONLY
              GO TO 470-DBFIND-RCVR.

           MOVE 0                        TO  COND-WORD.
           MOVE WS-ACCUMULATOR           TO  PORCVNO OF DPOITEM-REC2.
           START DPOITEM-O KEY = PORCVNO OF DPOITEM-REC2
               INVALID KEY MOVE 17       TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17               TO  COND-WORD
               ELSE
                   MOVE 99               TO  COND-WORD.
           IF COND-WORD NOT = 0
                 MOVE "DBFIND DPOITEM 460 SCORRCVR" TO BU-DISPLAY-MSG
                 PERFORM 2100-BLOWUP.

       465-GET-ACCUM-QTY-DELIVERED.
           MOVE 0                        TO  COND-WORD.
           READ DPOITEM-O NEXT INTO BUF-DPOITEM
               AT END MOVE 15            TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15               TO  COND-WORD
               ELSE
                   MOVE 99               TO  COND-WORD.
           IF PORCVNO OF DPOITEM-REC2   NOT = WS-ACCUMULATOR
               MOVE 15                   TO  COND-WORD.
           IF COND-WORD NOT = 0
                 MOVE "DBGET DPOITEM 465 SCORRCVR" TO BU-DISPLAY-MSG
                 PERFORM 2100-BLOWUP.

           IF SD-ITM NOT = ITM-NUMBER
               GO TO 465-GET-ACCUM-QTY-DELIVERED.

           IF KELLY
              MOVE DE-UM                 TO  ITM-KELLY-PO-UM
           ELSE
              MOVE DE-UM                 TO  ITM-UM.
      *----------  KELLY MUST UPDATE QTY IN PO UM AND STR UM
           IF NOT KELLY
              ADD HOLD-ADJ-QTY, ITM-QTY-DLVR
                         GIVING  ITM-QTY-DLVR ROUNDED
           ELSE
              MOVE DE-QTY                TO  ITM-QTY-PAID
              MULTIPLY SD-KELLY-CF BY HOLD-ADJ-QTY
                   GIVING KELLY-STR-ADJ-QTY ROUNDED
              ADD KELLY-STR-ADJ-QTY, ITM-QTY-DLVR
                   GIVING ITM-QTY-DLVR ROUNDED.

      *----------  UPDATE QTY STORED IF A DIRECT DELIVERY
           IF SD-DIRECT-SW = "Y" OR STORE-SW = "Y"
              IF KELLY
                 ADD KELLY-STR-ADJ-QTY, ITM-QTY-STORED
                     GIVING ITM-QTY-STORED
              ELSE
                 ADD HOLD-ADJ-QTY, ITM-QTY-STORED
                     GIVING ITM-QTY-STORED ROUNDED.

           IF ITM-QTY-STORED < ZEROS
               MOVE ZEROS                TO  ITM-QTY-STORED.

           IF DE-ITEM-COMPLETE = "X"
              MOVE "X"                   TO  ITM-COMPLETE-FLAG.

           MOVE 0                        TO  COND-WORD.
           REWRITE DPOITEM-REC2  FROM BUF-DPOITEM
               INVALID KEY MOVE 99       TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99                   TO  COND-WORD.
           IF COND-WORD NOT = 0
                 MOVE "DBUPDATE DPOITEM 465 SCORRCVR" TO BU-DISPLAY-MSG
                 PERFORM 2100-BLOWUP.

      *----UPDATE DRCVTRAK IF QS9000 TRACKING.
           IF ITM-QS9000-TRACK NOT = "X"
               GO TO 470-DBFIND-RCVR.
           MOVE MISC-RS-ARG TO RCVSLIP OF DRCVTRAK-REC.
           MOVE SD-ITM      TO ITEMNO  OF DRCVTRAK-REC.
           READ DRCVTRAK-O INTO BUF-DRCVTRAK
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              GO TO 470-DBFIND-RCVR.
           MOVE DE-QTY                 TO  RCVTRAK-DLVR-QTY.
           REWRITE DRCVTRAK-REC  FROM BUF-DRCVTRAK
                 INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99                   TO  COND-WORD
               MOVE "REWRITE DRCVTRAK 465 CORRCVR" TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

      *************************************************************
      *          DRCVITEM:  UPDATE QTY DELIVERED AND, IF A         *
      *                    DIRECT DELIVERY, THE QTY STORED.       *
      *************************************************************
       470-DBFIND-RCVR.
           MOVE 0                        TO  COND-WORD.
           MOVE MISC-RS-ARG              TO  PORCVNO OF DRCVITEM-REC2.
           START DRCVITEM-O KEY = PORCVNO OF DRCVITEM-REC2
               INVALID KEY MOVE 17       TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17               TO  COND-WORD
               ELSE
                   MOVE 99               TO  COND-WORD.
           IF COND-WORD NOT = 0
                 MOVE "DBFIND DRCVITEM 470 SCORRCVR" TO BU-DISPLAY-MSG
                 PERFORM 2100-BLOWUP.

       475-GET-RCVR-QTY-DELIVERED.
           READ DRCVITEM-O NEXT INTO BUF-DRCVITEM
               AT END MOVE 15            TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15               TO  COND-WORD
               ELSE
                   MOVE 99               TO  COND-WORD.
           IF PORCVNO OF DRCVITEM-REC2  NOT = MISC-RS-ARG
               MOVE 15                   TO  COND-WORD.
           IF COND-WORD NOT = 0
                 MOVE "DBGET DRCVITEM 475 SCORRCVR " TO BU-DISPLAY-MSG
                 PERFORM 2100-BLOWUP.

           IF SD-ITM NOT = RCV-ITEM-NUMBER
               GO TO 475-GET-RCVR-QTY-DELIVERED.

           MOVE DE-QTY                   TO  RCV-QTY-DLVR.

           IF RCV-QTY-DLVR < 1 AND RCV-LOT NOT = SPACES
               MOVE RCV-LOT TO OLD-LOT
               MOVE SPACES TO RCV-LOT
           END-IF.

           IF DE-ITEM-COMPLETE = "X"
              MOVE "X"                   TO  RCV-COMPLETE-FLAG.

      *------ FOR DIRECT DELIVER OR AUTO-STORE (RAW MATERIALS), UPDATE
      *------ THE STORED QTY
           IF SD-DIRECT-SW = "Y" OR STORE-SW = "Y"
               MOVE DE-QTY               TO  RCV-QTY-STORED.

           MOVE DE-CHATNO                TO  RCV-CHATNO.

           IF KELLY
              MOVE DE-UM                 TO  RCV-KELLY-PO-UM.

           MOVE ITM-UM                   TO  RCV-ITEM-UM.
           IF KELLY
              MOVE DE-QTY                TO  RCV-KELLY-PO-QTY
              MULTIPLY SD-KELLY-CF BY DE-QTY
                  GIVING KELLY-STR-NEW-QTY ROUNDED
              MOVE KELLY-STR-NEW-QTY     TO  RCV-QTY-DLVR.
           MOVE 0                        TO  COND-WORD.
           MOVE "00"                     TO  FILE-STATUS.
           IF NOT CONTAINER-ONLY
              REWRITE DRCVITEM-REC2  FROM BUF-DRCVITEM
                 INVALID KEY MOVE 99     TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99                   TO  COND-WORD.
           IF COND-WORD NOT = 0
              MOVE "REWRITE DRCVITEM 475 CORRCVR" TO BU-DISPLAY-MSG
              PERFORM 2100-BLOWUP.

       476-UPDATE-LOT.
           IF RCV-QTY-DLVR < 1 AND OLD-LOT NOT = SPACES
               MOVE RCV-CORP-CODE TO LOT-CORP-CODE
               MOVE OLD-LOT TO LOT-LOT
               MOVE LOT-ARG TO CORPLOT OF DRAWLOT
               READ DRAWLOT
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS = "00"
                   DELETE DRAWLOT
                       INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                   END-DELETE
                   IF FILE-STATUS NOT = "00"
                       MOVE "DELETE DRAWLOT 476 SCORRCVR"
                         TO BU-DISPLAY-MSG
                       PERFORM 2100-BLOWUP
                   END-IF
               END-IF
           END-IF.

       476-WRITE-CORRECTION-REASON.
           MOVE SPACES                      TO  BUF-DRCVCORR.
           MOVE MISC-RS-ARG                 TO  CORR-PO-NUMBER.
           MOVE VAL-ITM                     TO  CORR-ITEM.
           MOVE VAL-CODE                    TO  CORR-CORP-CODE.
           MOVE DATE-YMD-OUT TO DATE-CYMD-YMD.
           IF DATE-CYMD-YY > 70
               MOVE 19 TO DATE-CYMD-CC
           ELSE
               MOVE 20 TO DATE-CYMD-CC.
           MOVE DATE-CYMD                   TO  CORR-DATE-CN.
           MOVE DE-REASONS                  TO  CORR-REASON.
           WRITE DRCVCORR-REC FROM BUF-DRCVCORR
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              MOVE "WRITE DRCVCORR 476 SCORRCVR" TO BU-DISPLAY-MSG
              PERFORM 2100-BLOWUP.

      *------ CALCULATE UNIT PRICE IN STOREROOM UNIT OF MEASURE.  TO
      *------ BE USED IN TRANSACTIONS 323, 423, 325, AND 425.
           IF SD-CODE NOT = "NON-STR"
               MOVE "PR"                     TO  UMCF-RET-CODE
               MOVE STR-UM                   TO  UMCF-DEST-UM
               MOVE SD-PRICE-UM              TO  UMCF-SOURCE-UM
               MOVE SD-UNIT-PRICE            TO  UMCF-SOURCE-QTY
               CALL "TUMCF" USING UMCF-RET-CODE, STR-UM-AREA,
                                  UMCF-QUANTITY-AREA
               IF UMCF-RET-CODE NOT = "00"
                 MOVE "CONVERSION ERROR 281 SCORRCVR" TO BU-DISPLAY-MSG
                 MOVE UMCF-RET-CODE TO BU-DISPLAY-FLD (1)
                 PERFORM 2100-BLOWUP
               ELSE
                 MOVE UMCF-QTY-STR-UM-DEC  TO  SAVE-UNIT-PRICE.

      *---------  WRITE TRANSACTIONS
           MOVE SPACES                   TO  BUF-DDAILYTC.
           MOVE DATE-YMD-OUT             TO  DDAILYTC-DATE.
           MOVE DATE-UNFORMATTED-TIME-OUT  TO   DDAILYTC-TIME.
           MOVE PLT-NUMBER-PASS        TO  DDAILYTC-PLT.
      *************************************************************
      *      WRITE A TRANSACTION 324 (DOCK CORRECT) FOR EVERY     *
      *      RECEIVER ON EVERY ITEM.  ALSO WRITE A 324 FOR        *
      *      ANY RETURNABLE CONTAINERS.                           *
      *      IF UNIT PRICE > 9,999,999.99 THEN WRITE TC 423.      *
      *************************************************************
           MOVE SPACES                   TO  DDAILYTC-DATA.

           IF SD-UNIT-PRICE  > 9999999.99
              GO TO 575-CREATE-TC424.

           MOVE SD-CODE                  TO  TC323-CORPCODE.
      *----------  KELLY SEQUENCE NUMBER FOR KELLY PLANTS BY A CALL
      *            TO MPORCV
           IF NOT KELLY
              GO TO 477-PASSED-KELLY.
           MOVE 0                        TO  COND-WORD.
           MOVE MISC-RS-ARG              TO  PORCVNO OF MPORCV-REC.
           READ MPORCV INTO BUF-MPORCV
               INVALID KEY MOVE 17       TO  COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17                   TO  COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99                   TO  COND-WORD.
              IF COND-WORD NOT = 0
                 MOVE "DBGET MPORCV AT 475 SCORRCVR" TO BU-DISPLAY-MSG
                 PERFORM 2100-BLOWUP.

       477-PASSED-KELLY.
           IF SD-CODE = "NON-STR"
              MOVE SD-UM                 TO  TC323-UM
           ELSE
              MOVE STR-UM                TO  TC323-UM.
           MOVE "324"                    TO  DDAILYTC-TC.
           MOVE WS-RECEIVER              TO  TC323-RS.
           MOVE SD-ITM                   TO  TC323-ITEM.
           MOVE SD-TC323-TC-FLAG         TO  TC323-TC-FLAG.
           MOVE PO-CURRENCY-CODE         TO  TC323-CURRENCY-CODE.
      *----------  CHANGE PRICE QTY TO STR UM IF NOT KELLY OR AKRON
           IF AKRON
              MOVE SD-UNIT-PRICE         TO  TC323-UNIT-PRICE
              GO TO 483-MOVE-FIELDS.
           IF KELLY
              GO TO 483-MOVE-FIELDS.

           IF SD-CODE  = "NON-STR"
              MOVE SD-UNIT-PRICE         TO  TC323-UNIT-PRICE
           ELSE
              MOVE SAVE-UNIT-PRICE       TO  TC323-UNIT-PRICE.

       483-MOVE-FIELDS.
           IF KELLY
              MOVE SD-KELLY-PO-UM        TO  TC323-KELLY-PO-UM
              MOVE SD-CLASS              TO  TC323-KELLY-CLASS
              MOVE SD-SUB-DETL           TO  TC323-KELLY-SUBD
              MOVE M-PO-RCV-SEQ          TO  TC323-KELLY-SEQ
              IF KELLY-PO-IND = "B"
                 MOVE HOLD-ADJ-QTY       TO  TC323-KELLY-PRICE
                 IF SD-CODE = "NON-STR"
                    MOVE HOLD-ADJ-QTY    TO  TC323-NONCODED-RCV-QTY
                 ELSE
                    MOVE HOLD-ADJ-QTY    TO  TC323-CODED-RCV-QTY
              ELSE
              IF SD-CODE = "NON-STR"
                 MOVE HOLD-ADJ-QTY       TO  TC323-NONCODED-RCV-QTY
                                                TC323-KELLY-PRICE
              ELSE
                 MOVE KELLY-STR-ADJ-QTY  TO  TC323-CODED-RCV-QTY
                                                TC323-KELLY-PRICE
           ELSE
              MOVE PO-PRIME              TO  TC323-PRIME
              MOVE SD-CLASS              TO  TC323-SUB
              MOVE SD-SUB-DETL           TO  TC323-SUB-DETAIL
              MOVE SD-ADDL-DATA          TO  TC323-ADDL-DATA
           IF AKRON
            IF SD-CODE  = "NON-STR"
              MOVE SD-PO-QTY-DLVR        TO  TC323-NONCODED-RCV-QTY
              MOVE SD-UM                 TO  TC323-UM
            ELSE
              MOVE SD-PO-QTY-DLVR        TO  TC323-CODED-RCV-QTY
              MOVE SD-UM                 TO  TC323-UM
           ELSE
            IF SD-CODE  = "NON-STR"
              MOVE HOLD-ADJ-QTY          TO  TC323-NONCODED-RCV-QTY
              MOVE SD-UM                 TO  TC323-UM
            ELSE
              MOVE HOLD-ADJ-QTY-STR-UM   TO  TC323-CODED-RCV-QTY
              MOVE STR-UM                TO  TC323-UM.

           IF NOT AKRON
              GO TO 486-PUT-TC324.

           IF PO-INTERNAL-ORDER-INDIC = "X"
               MOVE "N"                  TO  TC323-TC-FLAG.
           IF PO-PRIME = "121"
               IF PO-SUB = "102" OR "108"
                   MOVE "N"              TO  TC323-TC-FLAG.

           MOVE PO-SUB                   TO  PO-SUB-BREAKDOWN.
           IF PO-PRIME = "121"
               IF PO-SUB-CHAR = "4"
                   MOVE "N"              TO  TC323-TC-FLAG.

           GO TO 486-PUT-TC324.
       575-CREATE-TC424.
           MOVE SD-CODE                  TO  TC423-CORPCODE.
           IF AKRON
            IF SD-CODE  = "NON-STR"
              MOVE SD-PO-QTY-DLVR        TO  TC423-NONCODED-RCV-QTY
              MOVE SD-UM                 TO  TC423-UM
            ELSE
              MOVE SD-PO-QTY-DLVR        TO  TC423-CODED-RCV-QTY
              MOVE SD-UM                 TO  TC423-UM
           ELSE
            IF SD-CODE  = "NON-STR"
              MOVE HOLD-ADJ-QTY          TO  TC423-NONCODED-RCV-QTY
              MOVE SD-UM                 TO  TC423-UM
            ELSE
              MOVE HOLD-ADJ-QTY-STR-UM   TO  TC423-CODED-RCV-QTY
              MOVE STR-UM                TO  TC423-UM.


           MOVE "424"                    TO  DDAILYTC-TC.
           MOVE WS-RECEIVER-2-14         TO  TC423-RS.
           MOVE SD-ITM                   TO  TC423-ITEM.
           MOVE SD-TC323-TC-FLAG         TO  TC423-TC-FLAG.
           MOVE PO-CURRENCY-CODE         TO  TC423-TC-FLAG.

      *----------  CHANGE PRICE QTY TO STR UM IF NOT KELLY OR AKRON
           IF AKRON
              MOVE SD-UNIT-PRICE         TO  TC423-UNIT-PRICE
              GO TO 576-MOVE-FIELDS.
           IF KELLY
              GO TO 576-MOVE-FIELDS.

           IF SD-CODE  = "NON-STR"
              MOVE SD-UNIT-PRICE         TO  TC423-UNIT-PRICE
           ELSE
              MOVE SAVE-UNIT-PRICE       TO  TC423-UNIT-PRICE.

       576-MOVE-FIELDS.
           IF KELLY
              MOVE SD-PO-QTY-DLVR        TO  TC423-KELLY-PRICE
              MOVE SD-KELLY-PO-UM        TO  TC423-KELLY-PO-UM
              MOVE SD-CLASS              TO  TC423-KELLY-CLASS
              MOVE SD-SUB-DETL           TO  TC423-SUB-DETAIL
              MOVE M-PO-RCV-SEQ          TO  TC423-KELLY-SEQ
              IF SD-CODE = "NON-STR"
                 MOVE SD-STR-QTY-DLVR    TO  TC423-NONCODED-RCV-QTY
              ELSE
                 MOVE SD-STR-QTY-DLVR    TO  TC423-CODED-RCV-QTY
           ELSE
              MOVE PO-PRIME              TO  TC423-PRIME
              MOVE SD-CLASS              TO  TC423-SUB
              MOVE SD-SUB-DETL           TO  TC423-SUB-DETAIL
              MOVE SD-ADDL-DATA          TO  TC423-ADDL-DATA.



       486-PUT-TC324.
           IF CONTAINER-ONLY
              GO TO 487-CONTAINERS.
           MOVE 0                        TO  COND-WORD.
           WRITE DDAILYTC-REC FROM BUF-DDAILYTC
               INVALID KEY MOVE 99       TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99                   TO  COND-WORD.
              IF COND-WORD NOT = 0
                 MOVE "DBPUT DDAILYTC 282 SCORRCVR " TO BU-DISPLAY-MSG
                 PERFORM 2100-BLOWUP.
       487-CONTAINERS.
           IF CONTAINER-LIT = SPACES
              GO TO 487-PUT-TC924.

           IF CONTAINER-DLVR = ZEROS
              AND CONTAINER-UM = SPACES
                 GO TO 487-PUT-TC924.

      *----------  PUT 324 FOR CONTAINER CORRECTION
           MOVE CONTAINER-UM             TO  TC323-UM.
           MOVE CONTAINER-DLVR           TO  TC323-CODED-RCV-QTY.
           MOVE DE-ITM                   TO  WORK-ITEM.
           MOVE "*"                      TO  WK-ASTERICK.
           MOVE SHIFTED-ITEM             TO  TC323-ITEM.
           IF KELLY
              MOVE ZEROS                 TO  TC323-KELLY-PRICE
           ELSE
              MOVE ZEROS                 TO  TC323-UNIT-PRICE
           MOVE 0                        TO  COND-WORD.
           WRITE DDAILYTC-REC FROM BUF-DDAILYTC
               INVALID KEY MOVE 99       TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99                   TO  COND-WORD.
           IF NOT GOOD-CALL
                 MOVE "DBPUT DDAILYTC2 AT 270 324 SCORRCVR"
                                         TO  BU-DISPLAY-MSG
                 PERFORM 2100-BLOWUP.

      *---CREATE TC924 IF QTY DLVR HAS DECIMAL VALUE
       487-PUT-TC924.
           IF SD-CODE = "NON-STR"
             IF HOLD-ADJ-QTY-DEC NOT = 0
               MOVE SPACES TO DDAILYTC-DATA
               MOVE "924" TO DDAILYTC-TC
               MOVE SD-CODE TO TC923-CORPCODE
               MOVE WS-RECEIVER TO TC923-RS
               MOVE SD-ITM TO TC923-ITEM
               MOVE HOLD-ADJ-QTY TO TC923-RCV-QTY
               MOVE SD-UM TO TC923-UM
               WRITE DDAILYTC-REC FROM BUF-DDAILYTC
                   INVALID KEY MOVE 99 TO COND-WORD
               END-WRITE
               IF FILE-STATUS NOT = "00"
                   MOVE 99 TO COND-WORD
               END-IF
               IF NOT GOOD-CALL
                   MOVE "WRITE DDAILYTC AT 477 TC924 SCORRCVR"
                                        TO BU-DISPLAY-MSG
                   PERFORM 2100-BLOWUP
               END-IF
             END-IF
           ELSE
             IF A-KELLY-PLANT
              IF KELLY-STR-ADJ-QTY-DEC NOT = 0
               MOVE SPACES TO DDAILYTC-DATA
               MOVE "924" TO DDAILYTC-TC
               MOVE SD-CODE TO TC923-CORPCODE
               MOVE WS-RECEIVER TO TC923-RS
               MOVE SD-ITM TO TC923-ITEM
               MOVE KELLY-STR-ADJ-QTY TO TC923-RCV-QTY
               MOVE SD-KELLY-PO-UM TO TC923-UM
               WRITE DDAILYTC-REC FROM BUF-DDAILYTC
                   INVALID KEY MOVE 99 TO COND-WORD
               END-WRITE
               IF FILE-STATUS NOT = "00"
                   MOVE 99 TO COND-WORD
               END-IF
               IF NOT GOOD-CALL
                   MOVE "WRITE DDAILYTC AT 477 TC924 SCORRCVR"
                                        TO BU-DISPLAY-MSG
                   PERFORM 2100-BLOWUP
               END-IF
              END-IF
             ELSE
               IF HOLD-ADJ-QTY-STR-UM-DEC NOT = 0
                 MOVE SPACES TO DDAILYTC-DATA
                 MOVE "924" TO DDAILYTC-TC
                 MOVE SD-CODE TO TC923-CORPCODE
                 MOVE WS-RECEIVER TO TC923-RS
                 MOVE SD-ITM TO TC923-ITEM
                 MOVE HOLD-ADJ-QTY-STR-UM TO TC923-RCV-QTY
                 MOVE STR-UM TO TC923-UM
                 WRITE DDAILYTC-REC FROM BUF-DDAILYTC
                     INVALID KEY MOVE 99 TO COND-WORD
                 END-WRITE
                 IF FILE-STATUS NOT = "00"
                     MOVE 99 TO COND-WORD
                 END-IF
                 IF NOT GOOD-CALL
                     MOVE "WRITE DDAILYTC AT 477 TC924 SCORRCVR"
                                        TO BU-DISPLAY-MSG
                     PERFORM 2100-BLOWUP
                 END-IF
               END-IF
             END-IF
           END-IF.

       487-PUT-TC326.
           IF MISC-P326-SW = "Y"
               MOVE SPACES TO DDAILYTC-DATA
               MOVE "326" TO DDAILYTC-TC
               MOVE SD-CODE TO TC326-CORPCODE
               MOVE WS-RECEIVER TO TC326-RS
               MOVE SD-ITM TO TC326-ITEM
               MOVE ITM-COMPANY TO TC326-COMPANY
               WRITE DDAILYTC-REC FROM BUF-DDAILYTC
                   INVALID KEY MOVE 99 TO COND-WORD
               END-WRITE
               IF FILE-STATUS NOT = "00"
                   MOVE 99 TO COND-WORD
               END-IF
               IF NOT GOOD-CALL
                   MOVE "DBPUT DDAILYTC AT 477 TC326 SCORRCVR"
                                        TO BU-DISPLAY-MSG
                   PERFORM 2100-BLOWUP.

       488-UNLOCK.
      *------ UPDATE ONHAND AND CREATE A RECEIPT INTO STORES
      *------ TRANSACTION IF THE ITEM IS TO BE AUTO-STORED
           IF STORE-SW = "Y"
               IF FRAN-TABLE NOT = SPACES
                   SET FRAN-IDX TO 1
                   SEARCH FRAN-ENTRY
                     AT END
                         MOVE "N" TO FRANCHISE-VENDOR-SW
                     WHEN FRAN-VEN-CODE(FRAN-IDX) = PO-VEN-CODE
                         MOVE "Y" TO FRANCHISE-VENDOR-SW
                   END-SEARCH
               ELSE
                   MOVE "N" TO FRANCHISE-VENDOR-SW
               END-IF
               IF SD-MASTER-STOCK > SPACES
                   MOVE SD-MASTER-STOCK   TO  CODE-ARG
               ELSE
                   MOVE SD-CODE           TO  CODE-ARG
               END-IF
               MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC2
               READ MSTORERM-O INTO BUF-MSTORERM
                  INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS NOT = "00"
                   MOVE "READ ERR MSTORERM" TO BU-DISPLAY-MSG
                   PERFORM 2100-BLOWUP
               END-IF
               COMPUTE STR-ONHAND ROUNDED =
                   STR-ONHAND + HOLD-ADJ-QTY-STR-UM
      *----------IF FRANCHISE CODE AND FRANCHISE VENDOR THEN UPDATE
      *----------  PRIMARY FRANCHISE BIN, OTHERWISE UPDATE PRIMARY BIN
               IF STR-CODE-OWNER = SPACES OR NOT FRANCHISE-VENDOR
                   COMPUTE STR-LOC-ONHAND (1) ROUNDED =
                       STR-LOC-ONHAND (1) + HOLD-ADJ-QTY-STR-UM
               ELSE
                   MOVE 1 TO FRAN-SUB
                   PERFORM UNTIL FRAN-SUB > 6 OR
                     STR-CODE-OWNER = STR-BIN-OWNER(FRAN-SUB)
                          ADD 1 TO FRAN-SUB
                   END-PERFORM
                   IF FRAN-SUB > 6
                       MOVE 1 TO FRAN-SUB
                   END-IF
                   COMPUTE STR-LOC-ONHAND (FRAN-SUB) ROUNDED =
                       STR-LOC-ONHAND (FRAN-SUB) + HOLD-ADJ-QTY-STR-UM
               END-IF
               MOVE 1                     TO  DATE-MODE
               CALL "TDATECHK" USING DATE-CHECK-AREA
               MOVE DATE-YMD-OUT TO DATE-CYMD-YMD
               IF DATE-CYMD-YY > 70
                   MOVE 19 TO DATE-CYMD-CC
               ELSE
                   MOVE 20 TO DATE-CYMD-CC
               END-IF
               MOVE DATE-CYMD TO STR-ACT-DATE-CN
               REWRITE MSTORERM-REC2 FROM BUF-MSTORERM
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-REWRITE
               IF FILE-STATUS NOT = "00"
                   MOVE "REWRITE ERR MSTORERM" TO BU-DISPLAY-MSG
                   PERFORM 2100-BLOWUP
               END-IF
               MOVE DATE-YMD-OUT TO DDAILYTC-DATE
               MOVE DATE-UNFORMATTED-TIME-OUT TO DDAILYTC-TIME
               MOVE PLT-NUMBER-PASS TO DDAILYTC-PLT
               IF SD-UNIT-PRICE > 99999.99
                   MOVE "425" TO DDAILYTC-TC
                   MOVE CODE-ARG TO TC425-CORPCODE
                   MOVE WS-RECEIVER-2-14 TO TC425-RS
                   MOVE SD-ITM TO TC425-ITEM
                   COMPUTE TC425-STORED-QTY ROUNDED =
                     HOLD-ADJ-QTY-STR-UM + ZERO
                   MOVE TC425-STORED-QTY TO EXT-QTY
                   MOVE STR-UM TO TC425-UM
                   MOVE SD-UNIT-PRICE TO TC425-PO-UNIT-PRICE
                   MOVE SAVE-RCV-SEQ TO TC425-KELLY-SEQ
                   MOVE PO-CURRENCY-CODE TO TC425-CURRENCY-CODE
                   MOVE SD-CLASS TO TC425-CLASS
                   IF FRANCHISE-VENDOR
                       MOVE STR-CODE-OWNER TO TC425-FRAN-ID
                   ELSE
                       MOVE SPACES TO TC425-FRAN-ID
                   END-IF
               ELSE
                   MOVE "325" TO DDAILYTC-TC
                   MOVE CODE-ARG TO TC325-CORPCODE
                   MOVE WS-RECEIVER TO TC325-RS
                   MOVE SD-ITM TO TC325-ITEM
                   COMPUTE TC325-STORED-QTY ROUNDED =
                     HOLD-ADJ-QTY-STR-UM + ZERO
                   MOVE TC325-STORED-QTY TO EXT-QTY
                   MOVE STR-UM TO TC325-UM
                   MOVE SAVE-UNIT-PRICE TO TC325-PO-UNIT-PRICE
                   MOVE SAVE-RCV-SEQ TO TC325-KELLY-SEQ
                   MOVE PO-CURRENCY-CODE TO TC325-CURRENCY-CODE
                   MOVE STR-CLASS TO TC325-CLASS
                   IF FRANCHISE-VENDOR
                       MOVE STR-CODE-OWNER TO TC325-FRAN-ID
                   ELSE
                       MOVE SPACES TO TC325-FRAN-ID
                   END-IF
               END-IF
               WRITE DDAILYTC-REC FROM BUF-DDAILYTC
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-WRITE
               IF FILE-STATUS NOT = "00"
                   MOVE "WRITE ERR DDAILYTC" TO BU-DISPLAY-MSG
                   PERFORM 2100-BLOWUP
               END-IF.

      *------9/3/97, JSB - FOR DES MOINES
      *------IF STORES RECEIPTS INTERFACES WITH AN EXTERNAL SYSTEM
      *------  CALL THE EXTERNAL INTERFACE PROGRAM TO PASS THE DATA.
           IF SAVE-EXTSYS = "Y"
               MOVE "X" TO EXT-CORRECT
               CALL "BSTRRCVIFC" USING WS-RECEIVER-2-14
                                       SD-ITM
                                       CODE-ARG
                                       EXT-QTY
                                       STR-UM
                                       DATE-YMD-OUT
                                       DATE-UNFORMATTED-TIME-OUT
                                       EXT-CORRECT.

           IF STORE-SW = "Y" OR SD-DIRECT-SW = "Y"
               PERFORM 901-WRITE-TC341 THRU 901-EXIT.

      *----------  DOES USAGE FILE NEED TO BE UPDATED?
           IF SD-DIRECT-SW NOT = "Y"
              GO TO 489-PRINTOUT.

           MOVE SD-CODE                  TO  KEY-VALUE.
           MOVE KEY-VALUE                TO  CORPCDE OF USAGEFIL-REC.
           READ USAGEFIL INTO USAGE-RECORD
                INVALID KEY MOVE 17      TO  COND-WORD.
           IF FILE-STATUS-1 = "2"
              MOVE 17                    TO  COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
              MOVE 99                    TO  COND-WORD.
           IF NO-ENTRY
               GO TO 489-PRINTOUT
           ELSE
              IF COND-WORD NOT = 0
                  MOVE "CKREADBYKEY ERR 488 SCORRCVR" TO BU-DISPLAY-MSG
                  MOVE KEY-VALUE         TO  BU-DISPLAY-FLD (5)
                  PERFORM 2100-BLOWUP.

           IF KELLY
              ADD KELLY-STR-ADJ-QTY, K-MTH-USAGE (13)
                  GIVING K-MTH-USAGE (13) ROUNDED
              ADD KELLY-STR-ADJ-QTY, K-MTH-USAGE-DD (13)
                  GIVING K-MTH-USAGE-DD (13) ROUNDED
            ELSE
              ADD HOLD-ADJ-QTY-STR-UM, K-MTH-USAGE (13)
                      GIVING K-MTH-USAGE (13) ROUNDED
              ADD HOLD-ADJ-QTY-STR-UM, K-MTH-USAGE-DD (13)
                      GIVING K-MTH-USAGE-DD (13) ROUNDED.

           MOVE 0                        TO  COND-WORD.
           REWRITE USAGEFIL-REC FROM USAGE-RECORD
              INVALID KEY MOVE 99        TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
              MOVE 99                    TO  COND-WORD.
           IF COND-WORD NOT = 0
               MOVE "CKREWRITE ERR 488 SCORRCVR" TO BU-DISPLAY-MSG
               MOVE K-CORP-CODE          TO  BU-DISPLAY-FLD (5)
               PERFORM 2100-BLOWUP.
      *************************************************************
      *             PRINT RECEIVING SLIP                          *
      *************************************************************
       489-PRINTOUT.
           MOVE SPOOL-PRT-NO             TO  OVRPRTF-TOFILE-NUM.
           MOVE "MCPRT"                  TO  OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT ONLINE-PRT.

           IF ACCTG-PRT-NO NOT = ZEROES
              MOVE ACCTG-PRT-NO          TO  OVRPRTF-TOFILE-NUM
              MOVE "MCPRT2"              TO  OVRPRTF-FILE
              PERFORM 996-OVERRIDE-PRINT-FILE
              OPEN OUTPUT ACCTG-PRT.

           IF PRINT-PRT-NO NOT = ZEROES
              MOVE PRINT-PRT-NO          TO  OVRPRTF-TOFILE-NUM
              MOVE "MCPRT3"              TO  OVRPRTF-FILE
              PERFORM 996-OVERRIDE-PRINT-FILE
              OPEN OUTPUT THIRD-PRT.
      *
           MOVE SPACES                   TO  PRINT-RCD.
           MOVE 1                        TO  LINE-ADV.
           PERFORM 800-PRT-LINE.

           MOVE HDR-1                    TO  PRINT-LINE.
           MOVE 3                        TO  LINE-ADV.
           PERFORM 800-PRT-LINE.

           MOVE DE-PO                    TO  DISP-PO.
           MOVE DE-RLSE                  TO  DISP-RLSE.
           MOVE DE-RS                    TO  DISP-RS.
           MOVE  HDR-2                   TO  PRINT-LINE.
           MOVE 3                        TO  LINE-ADV.
           PERFORM 800-PRT-LINE.

      *----------  GET VENDOR INFORMATION
           MOVE "VENDOR-CODE  "          TO  VEN-LIT.
           MOVE VEN-ARG                  TO  PRT-VEN-ADDR.
           MOVE 1                        TO  LINE-ADV.
           MOVE HDR-2A                   TO  PRINT-LINE.
           PERFORM 800-PRT-LINE.

           MOVE 0                        TO  COND-WORD.
           MOVE VEN-ARG                  TO  VENCDE OF DVENDOR-REC.
           START DVENDOR KEY = VENCDE OF DVENDOR-REC
               INVALID KEY MOVE 17       TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17               TO  COND-WORD
               ELSE
                   MOVE 99               TO  COND-WORD.
           IF COND-WORD NOT = 0
                 MOVE "DBFIND DVENDOR 282 SCORRCVR " TO BU-DISPLAY-MSG
                 PERFORM 2100-BLOWUP.

           PERFORM 860-LOAD-VEN-DATA THRU 869-EXIT.

           MOVE  HDR-3                   TO  PRINT-LINE.
           MOVE 2                        TO  LINE-ADV.
           PERFORM 800-PRT-LINE.

           IF CONTAINER-ONLY
              GO TO 490-PRINT-CONTAINER.
           MOVE SD-ITM                   TO  PRT-ITM.
           MOVE ITM-CORP-CODE            TO  PRT-CODE.
           MOVE ITM-UM                   TO  PRT-PREV-DLVR-UM.
           MOVE DE-UM                    TO  PRT-PRES-DLVR-UM.
           IF KELLY
              MOVE DE-UM                 TO  PRT-PREV-DLVR-UM,
                                                PRT-PRES-DLVR-UM.

           MOVE HOLD-RS-PREV-DLVR        TO  WORK-QTY-X.
           IF WORK-QTY-ADP-X = ZEROS
               MOVE WORK-QTY             TO  PRT-PREV-DLVR-R
           ELSE
               MOVE WORK-QTY             TO  PRT-PREV-DLVR.


           MOVE DE-QTY                   TO  WORK-QTY-X.
           IF WORK-QTY-ADP-X = ZEROS
               MOVE DE-QTY               TO  PRT-PRES-DLVR-R
           ELSE
               MOVE DE-QTY               TO  PRT-PRES-DLVR.

           MOVE PRT-ITM-HDR              TO  PRINT-LINE.
           MOVE 2                        TO  LINE-ADV.
           PERFORM 800-PRT-LINE.

       490-PRINT-CONTAINER.
           IF CONTAINER-UM = SPACES
              GO TO 492-PRT-REASON.
           MOVE CONTAINER-UM             TO  PRT-CONT-UM.
           MOVE CONTAINER-DLVR           TO  WORK-QTY.
           IF WORK-QTY-ADP-X = ZEROS
              MOVE CONTAINER-DLVR        TO  PRT-CONT-QTY-R
           ELSE
              MOVE CONTAINER-DLVR        TO  PRT-CONT-QTY.

           MOVE 1                        TO  LINE-ADV.
           MOVE PRT-CONTAINER            TO  PRINT-LINE.
           PERFORM 800-PRT-LINE.

       492-PRT-REASON.
      *----------  PRINT REASON FOR CHANGE, BUT DO NOT KEEP
           MOVE DE-REASON                TO  PRT-REASON.
           MOVE 1                        TO  LINE-ADV.
           MOVE PRT-CHG-REASON           TO  PRINT-LINE.
           PERFORM 800-PRT-LINE.
           IF DE-REASON-CONT = SPACES
              MOVE SPACES                TO  PRT-REASON
           ELSE
              MOVE DE-REASON-CONT        TO  PRT-REASON.
           MOVE 2                        TO  LINE-ADV.
           MOVE 1                        TO  PRT-SUB.
           MOVE PRT-CHG-REASON           TO  PRINT-LINE.
           PERFORM 800-PRT-LINE.

      *----------  FILL IN DESCRIPTION (UP TO 8 LINES)
           IF SD-CODE  = "NON-STR"
              MOVE 8                     TO  CNDESC-LINES-TO-GET
              MOVE 0                     TO  CNDESC-LINES-GOT
              MOVE SPACES                TO  CNDESC-LINE
              MOVE SD-ITM                TO  WS-SD-ITM
              CALL "CNDESC" USING BASE, WS-ACCUMULATOR,
                                  WS-SD-ITM, CNDESC-DATA
              PERFORM  494-MOVE-NONCODED-DESC CNDESC-LINES-GOT TIMES
           ELSE
              MOVE 8                     TO  CDESC-LINES-TO-GET
              MOVE SD-CODE               TO  CODE-ARG
              CALL "CDESC" USING RET-CODE, BASE, STATUS-AREA,
                           BU-DISPLAY-MSG, CODE-ARG, CDESC-DATA
              PERFORM 493-MOVE-CODED-DESC CDESC-LINES-GOT TIMES.

           GO TO 495-PRT-ACCTNG.

       493-MOVE-CODED-DESC.
           MOVE CDESC (PRT-SUB)          TO  PRT-DESC.
           MOVE PRT-DESC-HDR             TO  PRINT-LINE.
           PERFORM 800-PRT-LINE.
           MOVE 1                        TO  LINE-ADV.
           ADD 1                         TO  PRT-SUB.

       494-MOVE-NONCODED-DESC.
           MOVE CNDESC (PRT-SUB)         TO  PRT-DESC.
           MOVE PRT-DESC-HDR             TO  PRINT-LINE.
           PERFORM 800-PRT-LINE.
           MOVE 1                        TO  LINE-ADV.
           ADD 1                         TO  PRT-SUB.

       495-PRT-ACCTNG.
           MOVE ITM-SUB-DETL             TO  PRT-SUB-DETL2.
           MOVE ITM-ADDL-DATA            TO  PRT-ADDL-DATA.
           MOVE ITM-CLASS                TO  PRT-SUB2.
           MOVE PRT-SUB-SUBDETL-ADDLDATA TO  PRINT-LINE.
           PERFORM 800-PRT-LINE.
      *************************************************************
      *                 CLOSE PRINT FILES                         *
      *************************************************************
       498-CLOSE-PRINT-FILES.
           CLOSE ONLINE-PRT.
           IF ACCTG-PRT-NO NOT = ZEROES
                   CLOSE ACCTG-PRT.

           IF PRINT-PRT-NO NOT = ZEROES
                   CLOSE THIRD-PRT.
           GO TO 400-MODIFY-RECEIVER.

       499-EXIT.  EXIT.

      ****COMMENTED OUT ON 12/05/1995.  REFER BACK TO THE PROGRAM
      ****COMMENTS FOR DETAILS.
      *500-CHECK-INVOICELESS.
      *    IF PO-INVOICELESS-IND NOT = "X"
      *        GO TO 500-EXIT.
      *    MOVE PO-RCV-NO               TO  PORCVNO OF DINVRCD-REC.
      *    START DINVRCD-I KEY = PORCVNO OF DINVRCD-REC
      *        INVALID KEY MOVE 17       TO  COND-WORD.
      *    IF FILE-STATUS NOT = "00"
      *        GO TO 500-EXIT.
      *500-INV-LOOP.
      *    READ DINVRCD-I NEXT INTO BUF-DINVRCD
      *        AT END MOVE FILE-STATUS TO FILE-STATUS
      *    END-READ.
      *    IF FILE-STATUS = "00"
      *      IF INV-PO-RCV-NO = PO-RCV-NO
      *        IF INV-RCVR-NO = WS-ACCUM-RS
      *          ***  INVLESS RECEIVING SLIP HAS A REGISTER NUMBER ***
      *          MOVE   3              TO  LANG-SETNUM
      *          MOVE 216              TO  LANG-MSGNUM
      *          MOVE 11               TO  FIELD-NUMBER
      *        ELSE
      *          GO TO 500-INV-LOOP
      *        END-IF
      *      END-IF
      *    END-IF.
      *500-EXIT.
      *    EXIT.

       800-PRT-LINE.
           WRITE PRINT-RCD BEFORE ADVANCING LINE-ADV LINES.

           IF ACCTG-PRT-NO NOT = ZEROS
               MOVE PRINT-LINE           TO  PRINT-ACCTG
               WRITE ACCTG-RCD BEFORE ADVANCING LINE-ADV LINES.

           IF PRINT-PRT-NO NOT = ZEROS
              MOVE PRINT-LINE            TO  PRINT-THIRD
               WRITE THIRD-RCD BEFORE ADVANCING LINE-ADV LINES.

       810-GET-MSTOREROOM.
           IF SD-MASTER-STOCK NOT = SPACES
               MOVE SD-MASTER-STOCK TO CORPCDE OF MSTORERM-REC
               READ MSTORERM INTO BUF-MSTORERM
                  INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS = "00"
                   MOVE SPACES TO MASTER-MSTORERM
                   MOVE SD-MASTER-STOCK TO MASTER-STR-CORP-CODE
                   MOVE STR-ONHAND TO MASTER-STR-ONHAND.
           MOVE ITM-CORP-CODE            TO  CODE-ARG.
           MOVE 0                        TO  COND-WORD.
           MOVE CODE-ARG                 TO  CORPCDE OF MSTORERM-REC.
           READ MSTORERM INTO BUF-MSTORERM
               INVALID KEY MOVE 17       TO  COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17                   TO  COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99                   TO  COND-WORD.
           IF NOT GOOD-CALL
              MOVE "DBGET MSTORERM 810 SCORRCVR" TO BU-DISPLAY-MSG
              PERFORM 2100-BLOWUP.
           IF SD-CLASS = SPACES
              MOVE STR-CLASS             TO  SD-CLASS.
       819-EXIT.  EXIT.

       840-CHECK-IF-STORE.
           MOVE "N"  TO STORE-SW.
           IF SD-DIRECT-SW NOT = "Y"
      *------IF STORE RECEIPT INTERFACES WITH EXTERNAL SYSTEM AND
      *------   ALL MATERIALS TO BE AUTO STORED THEN SET SWITCH TO Y
      *------   JSB, 9/3/97 FOR DES MOINES
             IF SAVE-EXTSYS = "Y" AND SAVE-EXTAUTO = "Y"
               MOVE "Y" TO STORE-SW
             ELSE
               MOVE 1       TO SUB
               PERFORM UNTIL SUB > 4
               OR AUTOSTORE-GRP (SUB) = SD-MAJOR-GROUP
                   ADD 1    TO SUB
               END-PERFORM
               IF SUB < 5 AND AUTOSTORE-GRP (SUB) = SD-MAJOR-GROUP
               AND AUTOSTORE-SW (SUB) = "Y"
                   MOVE "Y"              TO  STORE-SW.

      ************************************************************
      *                                                          *
      *  LOAD THE VENDOR DATA INTO THE HEADER FOR PRINT PURPOSES *
      *                                                          *
      ************************************************************
       860-LOAD-VEN-DATA.
           MOVE 0                        TO  COND-WORD.
           READ DVENDOR NEXT INTO BUF-DVENDOR
               AT END MOVE 15            TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15               TO  COND-WORD
               ELSE
                   MOVE 99               TO  COND-WORD.
           IF VENCDE OF DVENDOR-REC NOT = VEN-ARG
               MOVE 15                   TO  COND-WORD.
           IF COND-WORD NOT = 0
               GO TO 869-EXIT.
           IF VEN-ITM-NO = "00" OR "07"
             IF VEN-ITM-NO = "00"
               MOVE "SELLER       "      TO  VEN-LIT
               MOVE VEN-NAME             TO  PRT-VEN-ADDR
               MOVE 1                    TO  LINE-ADV
             ELSE
               MOVE SPACES               TO  VEN-LIT
               MOVE VEN-07-RCD           TO  PRT-VEN-ADDR
               MOVE 3                    TO  LINE-ADV
           ELSE
             GO TO 860-LOAD-VEN-DATA.

           MOVE HDR-2A                   TO  PRINT-LINE.
           PERFORM 800-PRT-LINE.
           GO TO 860-LOAD-VEN-DATA.
       869-EXIT.  EXIT.

       870-CHANGE-TALLY.
           MOVE 0                        TO  COND-WORD.
           MOVE MISC-RS-ARG              TO  PORCVNO OF DTALLY-REC.
           START DTALLY KEY = PORCVNO OF DTALLY-REC
               INVALID KEY MOVE 17       TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17               TO  COND-WORD
               ELSE
                   MOVE 99               TO  COND-WORD.
           IF COND-WORD NOT = 0
              GO TO 875-ADD-TALLY.

       872-LOOP-FOR-TALLY.
           MOVE 0                        TO  COND-WORD.
           READ DTALLY NEXT INTO BUF-DTALLY
               AT END MOVE 15            TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15               TO  COND-WORD
               ELSE
                   MOVE 99               TO  COND-WORD.
           IF PORCVNO OF DTALLY-REC NOT = MISC-RS-ARG
               MOVE 15                   TO  COND-WORD.
           IF NOT GOOD-CALL
              GO TO 875-ADD-TALLY.
           IF DTAL-ITEM NOT = RCV-ITEM-NUMBER
              GO TO 872-LOOP-FOR-TALLY.

           MOVE 0                        TO  COND-WORD.
           DELETE DTALLY INVALID KEY MOVE "2" TO FILE-STATUS-1.
           IF FILE-STATUS NOT = "00"
               MOVE 99                   TO  COND-WORD.
           IF NOT GOOD-CALL
              MOVE "DBDELETE DTALLY 872 SCORRCVR" TO BU-DISPLAY-MSG
              PERFORM 2100-BLOWUP.

           IF DE-TALLY = SPACES
              GO TO 877-UPDATE-DRCVITEM.

       875-ADD-TALLY.
           MOVE DE-TALLY                 TO  DTAL-TALLY.
           MOVE MISC-RS-ARG              TO  DTAL-PO.
           MOVE RCV-ITEM-NUMBER          TO  DTAL-ITEM.
           MOVE RCV-CORP-CODE            TO  DTAL-CODE.
           MOVE 0                        TO  COND-WORD.
           WRITE DTALLY-REC FROM BUF-DTALLY
               INVALID KEY MOVE 99       TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99                   TO  COND-WORD.
           IF NOT GOOD-CALL
              MOVE "DBPUT TALLY SCORRCVR 875" TO BU-DISPLAY-MSG
              PERFORM 2100-BLOWUP.

       877-UPDATE-DRCVITEM.
      *****************************************************************
      *  THE FOLLOWING START AND READ LOOP IS DONE BECAUSE THE LOGICAL*
      *  VIEW OF DRCVITEM WHICH IS OPENED I-O HAS NOT PREVIOUSLY BEEN *
      *  READ, AND WE NEED TO UPDATE IT HERE. <<<IBM ONLY>>>          *
      *****************************************************************
           MOVE RCV-PO-RCV-NO TO  PORCVNO OF DRCVITEM-REC2.
           START DRCVITEM-O KEY = PORCVNO OF DRCVITEM-REC2
               INVALID KEY
                 MOVE "START DRCVITEM 470 SCORRCVR" TO BU-DISPLAY-MSG
                 PERFORM 2100-BLOWUP.
           READ DRCVITEM-O NEXT
               AT END MOVE 15            TO  COND-WORD.
           PERFORM UNTIL( PORCVNO OF DRCVITEM-REC2 = RCV-PO-RCV-NO
                   AND   ITEMNO  OF DRCVITEM-REC2 = RCV-ITEM-NUMBER)
                   OR    COND-WORD NOT = 0
               READ DRCVITEM-O NEXT
                   AT END MOVE 15            TO  COND-WORD
               END-READ
           END-PERFORM.
           IF COND-WORD NOT = 0
                 MOVE "DBGET DRCVITEM 475 SCORRCVR " TO BU-DISPLAY-MSG
                 PERFORM 2100-BLOWUP.
      *****************************************************************
      *  AND NOW BACK TO OUR REGULARLY SCHEDULED PROGRAM              *
      *****************************************************************
           MOVE DE-TALLY                 TO  RCV-TALLY.
           MOVE 0                        TO  COND-WORD.
           REWRITE DRCVITEM-REC2  FROM BUF-DRCVITEM
               INVALID KEY MOVE 99       TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99                   TO  COND-WORD.
           IF NOT GOOD-CALL
              MOVE "DBUPDATE DRCVITEM 877 SCORRCVR" TO BU-DISPLAY-MSG
              PERFORM 2100-BLOWUP.
       879-EXIT.  EXIT.

       880-CHANGE-RAWLOT.
           MOVE RCV-CORP-CODE            TO  DRAW-CORP-ARG.
           MOVE RCV-LOT                  TO  DRAW-LOT-ARG.
           MOVE 0                        TO  COND-WORD.
           MOVE MISC-RS-ARG              TO  PORCVNO OF DRAWLOT-REC2.
           START DRAWLOT2 KEY = PORCVNO OF DRAWLOT-REC2
               INVALID KEY MOVE 17       TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17               TO  COND-WORD
               ELSE
                   MOVE 99               TO  COND-WORD.
           IF COND-WORD NOT = 0
              GO TO 880-ADD-RAWLOT.

       880-LOOP-FOR-RAWLOT.
           MOVE 0                        TO  COND-WORD.
           READ DRAWLOT2 NEXT INTO BUF-DRAWLOT
               AT END MOVE 15            TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15               TO  COND-WORD
               ELSE
                   MOVE 99               TO  COND-WORD.
           IF PORCVNO OF DRAWLOT-REC2 NOT = MISC-RS-ARG
               MOVE 15                   TO  COND-WORD.
           IF NOT GOOD-CALL
              GO TO 880-ADD-RAWLOT.
           IF DRAWLOT-CORP-LOT NOT = DRAWLOT-ARG
              GO TO 880-LOOP-FOR-RAWLOT.

           MOVE 0                        TO  COND-WORD.
           DELETE DRAWLOT2 INVALID KEY MOVE "2" TO FILE-STATUS-1.
           IF FILE-STATUS NOT = "00"
               MOVE 99                   TO  COND-WORD.
           IF NOT GOOD-CALL
              MOVE "DELETE DRAWLOT2 880 SCORRCVR" TO BU-DISPLAY-MSG
              PERFORM 2100-BLOWUP.

           IF DE-RAW-LOT = SPACES
              GO TO 880-UPDATE-DRCVITEM.

       880-ADD-RAWLOT.
           MOVE DE-RAW-LOT               TO  DRAW-LOT-ARG.
           MOVE DRAWLOT-ARG              TO  DRAWLOT-CORP-LOT.
           MOVE MISC-RS-ARG              TO  DRAWLOT-PO.
           MOVE 0                        TO  COND-WORD.
           WRITE DRAWLOT-REC2 FROM BUF-DRAWLOT
               INVALID KEY MOVE 99       TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99                   TO  COND-WORD.
           IF NOT GOOD-CALL
              MOVE "WRITE DRAWLOT2 SCORRCVR 880" TO BU-DISPLAY-MSG
              PERFORM 2100-BLOWUP.

       880-UPDATE-DRCVITEM.
      *****************************************************************
      *  THE FOLLOWING START AND READ LOOP IS DONE BECAUSE THE LOGICAL*
      *  VIEW OF DRCVITEM WHICH IS OPENED I-O HAS NOT PREVIOUSLY BEEN *
      *  READ, AND WE NEED TO UPDATE IT HERE. <<<IBM ONLY>>>          *
      *****************************************************************
           MOVE RCV-PO-RCV-NO TO  PORCVNO OF DRCVITEM-REC2.
           START DRCVITEM-O KEY = PORCVNO OF DRCVITEM-REC2
               INVALID KEY
                 MOVE "START DRCVITEM 470 SCORRCVR" TO BU-DISPLAY-MSG
                 PERFORM 2100-BLOWUP.
           READ DRCVITEM-O NEXT
               AT END MOVE 15            TO  COND-WORD.
           PERFORM UNTIL( PORCVNO OF DRCVITEM-REC2 = RCV-PO-RCV-NO
                   AND   ITEMNO  OF DRCVITEM-REC2 = RCV-ITEM-NUMBER)
                   OR    COND-WORD NOT = 0
               READ DRCVITEM-O NEXT
                   AT END MOVE 15            TO  COND-WORD
               END-READ
           END-PERFORM.
           IF COND-WORD NOT = 0
                 MOVE "DBGET DRCVITEM 880 SCORRCVR " TO BU-DISPLAY-MSG
                 PERFORM 2100-BLOWUP.
           MOVE DE-RAW-LOT               TO  RCV-LOT.
           MOVE 0                        TO  COND-WORD.
           REWRITE DRCVITEM-REC2  FROM BUF-DRCVITEM
               INVALID KEY MOVE 99       TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99                   TO  COND-WORD.
           IF NOT GOOD-CALL
              MOVE "DBUPDATE DRCVITEM 880 SCORRCVR" TO BU-DISPLAY-MSG
              PERFORM 2100-BLOWUP.
       880-EXIT.
           EXIT.

       890-CHANGE-CHATNO.
      *****************************************************************
      *  THE FOLLOWING START AND READ LOOP IS DONE BECAUSE THE LOGICAL*
      *  VIEW OF DRCVITEM WHICH IS OPENED I-O HAS NOT PREVIOUSLY BEEN *
      *  READ, AND WE NEED TO UPDATE IT HERE. <<<IBM ONLY>>>          *
      *****************************************************************
           MOVE RCV-PO-RCV-NO TO  PORCVNO OF DRCVITEM-REC2.
           START DRCVITEM-O KEY = PORCVNO OF DRCVITEM-REC2
               INVALID KEY
                 MOVE "START DRCVITEM 470 SCORRCVR" TO BU-DISPLAY-MSG
                 PERFORM 2100-BLOWUP.
           MOVE 0 TO COND-WORD.
           READ DRCVITEM-O NEXT
               AT END MOVE 15            TO  COND-WORD.
           PERFORM UNTIL( PORCVNO OF DRCVITEM-REC2 = RCV-PO-RCV-NO
                   AND   ITEMNO  OF DRCVITEM-REC2 = RCV-ITEM-NUMBER)
                   OR    COND-WORD NOT = 0
               READ DRCVITEM-O NEXT
                   AT END MOVE 15            TO  COND-WORD
               END-READ
           END-PERFORM.
           IF COND-WORD NOT = 0
                 MOVE "DBGET DRCVITEM 890 SCORRCVR " TO BU-DISPLAY-MSG
                 PERFORM 2100-BLOWUP.
           MOVE DE-CHATNO                TO  RCV-CHATNO.
           MOVE 0                        TO  COND-WORD.
           REWRITE DRCVITEM-REC2  FROM BUF-DRCVITEM
               INVALID KEY MOVE 99       TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99                   TO  COND-WORD.
           IF NOT GOOD-CALL
              MOVE "DBUPDATE DRCVITEM 890 SCORRCVR" TO BU-DISPLAY-MSG
              PERFORM 2100-BLOWUP.
           IF DE-QTY = OLD-DLVR
               MOVE OLD-DLVR TO SD-PO-QTY-DLVR
               MOVE OLD-UM TO SD-UM
               MOVE "N" TO STORE-SW
               PERFORM 840-CHECK-IF-STORE
               IF STORE-SW = "Y" OR SD-DIRECT-SW = "Y"
                   PERFORM 900-WRITE-TC341 THRU 900-EXIT.
       890-EXIT.
           EXIT.

       900-WRITE-TC341.
      *----------  WRITE TC341 FOR CHAT NUMBER IF AUTO-STORE ITEM
      *----------    AND CHAT NUMBER HAS CHANGED
           MOVE SPACES                   TO  BUF-DDAILYTC.
           MOVE DATE-YMD-OUT             TO  DDAILYTC-DATE.
           MOVE DATE-UNFORMATTED-TIME-OUT  TO   DDAILYTC-TIME.
           MOVE PLT-NUMBER-PASS        TO  DDAILYTC-PLT.
           MOVE SPACES TO BUF-TC341.
      *----- IF ADD CHATNO WRITE TC341 FOR ADDED CHAT
           IF OLD-CHATNO = SPACES AND DE-CHATNO NOT = SPACES
               MOVE "341" TO DDAILYTC-TC
               MOVE CODE-ARG TO TC341-CORPCODE
               MOVE DE-CHATNO TO TC341-CHAT-NO
               MOVE SD-PO-QTY-DLVR TO TC341-QTY-RCVD
               MOVE SD-UM TO TC341-UM-RCVD
      *-----TRY TO CONVERT QTY TO LB
               MOVE "00" TO UMCF-RET-CODE
               IF SD-UM = "LB"
                   MOVE TC341-QTY-RCVD TO TC341-QTY-UM-LB
               ELSE
                   MOVE "LB" TO UMCF-DEST-UM
                   MOVE TC341-UM-RCVD TO UMCF-SOURCE-UM
                   MOVE TC341-QTY-RCVD TO UMCF-SOURCE-QTY
                   CALL "TUMCF" USING UMCF-RET-CODE STR-UM-AREA
                                  UMCF-QUANTITY-AREA
                   IF UMCF-RET-CODE = "00"
                       MOVE UMCF-DEST-QTY TO TC341-QTY-UM-LB
                   ELSE
                       MOVE ZEROS TO TC341-QTY-UM-LB
                   END-IF
               END-IF
      *-----TRY TO CONVERT UM TO GL
               MOVE "00" TO UMCF-RET-CODE
               IF SD-UM = "GL"
                   MOVE TC341-QTY-RCVD TO TC341-QTY-UM-GAL
               ELSE
                   MOVE "GL" TO UMCF-DEST-UM
                   MOVE TC341-UM-RCVD TO UMCF-SOURCE-UM
                   MOVE TC341-QTY-RCVD TO UMCF-SOURCE-QTY
                   CALL "TUMCF" USING UMCF-RET-CODE STR-UM-AREA
                                  UMCF-QUANTITY-AREA
                   IF UMCF-RET-CODE = "00"
                       MOVE UMCF-DEST-QTY TO TC341-QTY-UM-GAL
                   ELSE
                       MOVE ZEROS TO TC341-QTY-UM-GAL
                   END-IF
               END-IF
           ELSE
      *----- IF DIFFERENT CHATNO WRITE NEGATIVE TC341 FOR OLD CHATNO
      *-----    AND POSITIVE TC341 FOR NEW CHATNO
           IF OLD-CHATNO NOT = SPACES AND
              OLD-CHATNO NOT = DE-CHATNO
               MOVE "341" TO DDAILYTC-TC
               MOVE CODE-ARG TO TC341-CORPCODE
               MOVE OLD-CHATNO TO TC341-CHAT-NO
               COMPUTE TC341-QTY-RCVD = OLD-DLVR * -1
               MOVE OLD-UM TO TC341-UM-RCVD
      *-----TRY TO CONVERT QTY TO LB
               MOVE "00" TO UMCF-RET-CODE
               IF OLD-UM = "LB"
                   MOVE TC341-QTY-RCVD TO TC341-QTY-UM-LB
               ELSE
                   MOVE "LB" TO UMCF-DEST-UM
                   MOVE TC341-UM-RCVD TO UMCF-SOURCE-UM
                   MOVE TC341-QTY-RCVD TO UMCF-SOURCE-QTY
                   CALL "TUMCF" USING UMCF-RET-CODE STR-UM-AREA
                                  UMCF-QUANTITY-AREA
                   IF UMCF-RET-CODE = "00"
                       MOVE UMCF-DEST-QTY TO TC341-QTY-UM-LB
                   ELSE
                       MOVE ZEROS TO TC341-QTY-UM-LB
                   END-IF
               END-IF
      *-----TRY TO CONVERT UM TO GL
               MOVE "00" TO UMCF-RET-CODE
               IF OLD-UM = "GL"
                   MOVE TC341-QTY-RCVD TO TC341-QTY-UM-GAL
               ELSE
                   MOVE "GL" TO UMCF-DEST-UM
                   MOVE TC341-UM-RCVD TO UMCF-SOURCE-UM
                   MOVE TC341-QTY-RCVD TO UMCF-SOURCE-QTY
                   CALL "TUMCF" USING UMCF-RET-CODE STR-UM-AREA
                                  UMCF-QUANTITY-AREA
                   IF UMCF-RET-CODE = "00"
                       MOVE UMCF-DEST-QTY TO TC341-QTY-UM-GAL
                   ELSE
                       MOVE ZEROS TO TC341-QTY-UM-GAL
                   END-IF
               END-IF
               WRITE DDAILYTC-REC FROM BUF-DDAILYTC
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-WRITE
               IF FILE-STATUS NOT = "00"
                   MOVE "WRITE ERR DDAILYTC" TO BU-DISPLAY-MSG
                   PERFORM 2100-BLOWUP
               END-IF
      *--------- WRITE SECOND TC341
               MOVE DE-CHATNO TO TC341-CHAT-NO
               MOVE SD-PO-QTY-DLVR TO TC341-QTY-RCVD
               MOVE SD-UM TO TC341-UM-RCVD
      *-----TRY TO CONVERT QTY TO LB
               MOVE "00" TO UMCF-RET-CODE
               IF SD-UM = "LB"
                   MOVE TC341-QTY-RCVD TO TC341-QTY-UM-LB
               ELSE
                   MOVE "LB" TO UMCF-DEST-UM
                   MOVE TC341-UM-RCVD TO UMCF-SOURCE-UM
                   MOVE TC341-QTY-RCVD TO UMCF-SOURCE-QTY
                   CALL "TUMCF" USING UMCF-RET-CODE STR-UM-AREA
                                  UMCF-QUANTITY-AREA
                   IF UMCF-RET-CODE = "00"
                       MOVE UMCF-DEST-QTY TO TC341-QTY-UM-LB
                   ELSE
                       MOVE ZEROS TO TC341-QTY-UM-LB
                   END-IF
               END-IF
      *-----TRY TO CONVERT UM TO GL
               MOVE "00" TO UMCF-RET-CODE
               IF SD-UM = "GL"
                   MOVE TC341-QTY-RCVD TO TC341-QTY-UM-GAL
               ELSE
                   MOVE "GL" TO UMCF-DEST-UM
                   MOVE TC341-UM-RCVD TO UMCF-SOURCE-UM
                   MOVE TC341-QTY-RCVD TO UMCF-SOURCE-QTY
                   CALL "TUMCF" USING UMCF-RET-CODE STR-UM-AREA
                                  UMCF-QUANTITY-AREA
                   IF UMCF-RET-CODE = "00"
                       MOVE UMCF-DEST-QTY TO TC341-QTY-UM-GAL
                   ELSE
                       MOVE ZEROS TO TC341-QTY-UM-GAL
                   END-IF
               END-IF
           END-IF
           END-IF
           IF TC341-CHAT-NO NOT = SPACES
               WRITE DDAILYTC-REC FROM BUF-DDAILYTC
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-WRITE
               IF FILE-STATUS NOT = "00"
                   MOVE "WRITE ERR DDAILYTC" TO BU-DISPLAY-MSG
                   PERFORM 2100-BLOWUP
               END-IF
           END-IF.
       900-EXIT.
           EXIT.

       901-WRITE-TC341.
      *----------  WRITE TC341 FOR CHAT NUMBER IF AUTO-STORE ITEM
      *----- IF SAME CHATNO WRITE TC341 FOR CHANGED QTY FOR CHATNO
           IF OLD-CHATNO NOT = SPACES AND
              OLD-CHATNO = DE-CHATNO
               MOVE SPACES                   TO  BUF-DDAILYTC
               MOVE DATE-YMD-OUT             TO  DDAILYTC-DATE
               MOVE DATE-UNFORMATTED-TIME-OUT  TO   DDAILYTC-TIME
               MOVE PLT-NUMBER-PASS        TO  DDAILYTC-PLT
               MOVE "341" TO DDAILYTC-TC
               MOVE CODE-ARG TO TC341-CORPCODE
               MOVE DE-CHATNO TO TC341-CHAT-NO
               COMPUTE TC341-QTY-RCVD ROUNDED =
                     HOLD-ADJ-QTY-STR-UM + ZERO
               MOVE STR-UM TO TC341-UM-RCVD
      *-----TRY TO CONVERT QTY TO LB
               MOVE "00" TO UMCF-RET-CODE
               IF STR-UM = "LB"
                   MOVE TC341-QTY-RCVD TO TC341-QTY-UM-LB
               ELSE
                   MOVE "LB" TO UMCF-DEST-UM
                   MOVE TC341-UM-RCVD TO UMCF-SOURCE-UM
                   MOVE TC341-QTY-RCVD TO UMCF-SOURCE-QTY
                   CALL "TUMCF" USING UMCF-RET-CODE STR-UM-AREA
                                  UMCF-QUANTITY-AREA
                   IF UMCF-RET-CODE = "00"
                       MOVE UMCF-DEST-QTY TO TC341-QTY-UM-LB
                   ELSE
                       MOVE ZEROS TO TC341-QTY-UM-LB
                   END-IF
               END-IF
      *-----TRY TO CONVERT UM TO GL
               MOVE "00" TO UMCF-RET-CODE
               IF STR-UM = "GL"
                   MOVE TC341-QTY-RCVD TO TC341-QTY-UM-GAL
               ELSE
                   MOVE "GL" TO UMCF-DEST-UM
                   MOVE TC341-UM-RCVD TO UMCF-SOURCE-UM
                   MOVE TC341-QTY-RCVD TO UMCF-SOURCE-QTY
                   CALL "TUMCF" USING UMCF-RET-CODE STR-UM-AREA
                                  UMCF-QUANTITY-AREA
                   IF UMCF-RET-CODE = "00"
                       MOVE UMCF-DEST-QTY TO TC341-QTY-UM-GAL
                   ELSE
                       MOVE ZEROS TO TC341-QTY-UM-GAL
                   END-IF
               END-IF
               IF TC341-CHAT-NO NOT = SPACES
                   WRITE DDAILYTC-REC FROM BUF-DDAILYTC
                       INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                   END-WRITE
                   IF FILE-STATUS NOT = "00"
                       MOVE "WRITE ERR DDAILYTC" TO BU-DISPLAY-MSG
                       PERFORM 2100-BLOWUP
                   END-IF
               END-IF
           ELSE
               PERFORM 900-WRITE-TC341 THRU 900-EXIT
           END-IF.
       901-EXIT.
           EXIT.

      *************************************************************
       940-VSETERROR.
           MOVE B"1"                     TO  IND (99).
           MOVE B"1"                     TO  IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER           TO  DE-MESSAGE-LINE.

       949-EXIT.  EXIT.
       COPY OVRPFCALL IN COPYLIB.
       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM          TO  CATREAD-MSG-SET
               MOVE LANG-MSGNUM          TO  CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT         TO  MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.
