       IDENTIFICATION DIVISION.
       PROGRAM-ID.     SCURRRPT.
       AUTHOR.         ANNETTE M. KRAUSS.
       INSTALLATION.   GOODYEAR TIRE & RUBBER CO.
       DATE-WRITTEN.   JULY 14, 1986.
      *REMARKS.
      *          REPORT OF VALID CURRENCY CODES.
      *
      *************************************************************
      *************************************************************
      *                     SCURRRPT                              *
      *                                                           *
      *         THIS PROGRAM WILL PRINT A REPORT OF VALID         *
      *         CURRENCY CODES.                                   *
      *                                                           *
      *************************************************************
      *************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.    IBM-AS400.
       OBJECT-COMPUTER.    IBM-AS400.
       SPECIAL-NAMES.
           C01 IS NEW-PAGE.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT SORT-FILE      ASSIGN TO DISK-SORT.
           SELECT PRINT-FILE     ASSIGN TO PRINTER-MCPRT.
           SELECT MVALIDUM-I
                  ASSIGN TO DATABASE-MCFLCS0401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  PRINT-FILE
           RECORD CONTAINS 132 CHARACTERS.
       01  PRINT-REC                              PIC X(132).

       SD  SORT-FILE
           RECORD CONTAINS 14 CHARACTERS.
       01  SORT-RECORD.
           05  SORT-CURRENCY-KEY                  PIC X(2).
           05  SORT-CURRENCY-EDI                  PIC X(3).
           05  SORT-CURRENCY-DESC                 PIC X(12).

       FD  MVALIDUM-I
           LABEL RECORDS ARE STANDARD.
       01  MVALIDUM-REC-I.
           COPY DDS-MCRPCS0400  OF MCFLCS0401.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       WORKING-STORAGE SECTION.
       01  WS-EDI-INSTAL              PIC X      VALUE SPACE.
       01  FILE-STATUS.
           05  FILE-STATUS-1          PIC X      VALUE SPACES.
           05  FILE-STATUS-2          PIC X      VALUE SPACES.
       01  PAGE-NUM                   PIC 9(3)   VALUE 0.
       01  LINE-CTR                   PIC 9(3)   VALUE 0.
       01  END-OF-SORT-FILE           PIC X(1)   VALUE "N".
           88  ALL-SORTED-RECORDS-PROCESSED      VALUE "Y".
       01  END-OF-INPUT-FILE          PIC X(1)   VALUE "N".
           88  ALL-INPUT-RECORDS-PROCESSED       VALUE "Y".
       01  NO-SORTED-RECORDS          PIC X(132) VALUE
           "   ****   NO SORTED RECORDS FOUND   ****".
       COPY TBLOWUP IN COPYCSIS.
       01  VIEW-COMAREA.
           05  FILLER                  PIC X(118)  VALUE ALL "0".
           05  FILLER                  PIC S9(4)   COMP-4 VALUE 9999.
       01  KSAM-STATUS                 PIC X(2)    VALUE SPACES.

       COPY TDATECHK IN COPYCSIS.

      *------------- PRINT AREAS
       01  PRINT-LINE                 PIC X(132)  VALUE SPACES.

       01  HEAD1 REDEFINES PRINT-LINE.
           05  FILLER                 PIC X(29).
           05  HEAD1-TITLE1           PIC X(39).
           05  HEAD1-TITLE2           PIC X(37).
           05  FILLER                 PIC X(15).
           05  HEAD1-PLANT            PIC X(6).
           05  HEAD1-PLANT-OUT        PIC X(3).
           05  FILLER                 PIC X(3).

       01  HEAD2 REDEFINES PRINT-LINE.
           05  FILLER                 PIC X(1).
           05  HEAD2-DATE             PIC X(8).
           05  FILLER                 PIC X(5).
           05  HEAD2-TIME             PIC X(8).
           05  FILLER                 PIC X(10).
           05  HEAD2-TITLE1           PIC X(30).
           05  HEAD2-TITLE2           PIC X(42).
           05  FILLER                 PIC X(14).
           05  HEAD2-PAGE             PIC X(6).
           05  HEAD2-PAGE-NO          PIC Z,ZZ9.
           05  FILLER                 PIC X(3).

       01  HEAD4 REDEFINES PRINT-LINE.
           05  FILLER                  PIC X(43).
           05  HEAD4-CODE              PIC X(13).
           05  FILLER                  PIC X(2).
           05  HEAD4-EDI               PIC X(17).
           05  FILLER                  PIC X(2).
           05  HEAD4-DESC              PIC X(11).
           05  FILLER                  PIC X(44).

       01  LINE1 REDEFINES PRINT-LINE.
           05  FILLER                  PIC X(48).
           05  LINE1-CURRENCY-KEY      PIC X(2).
           05  FILLER                  PIC X(08).
           05  LINE1-CURRENCY-EDI      PIC B(7)X(3)B(4).
           05  FILLER                  PIC X(05).
           05  LINE1-CURRENCY-DESC     PIC X(12).
           05  FILLER                  PIC X(43).

       01  DOT-LINE.
           05  FILLER                  PIC X(132)  VALUE ALL "-".

      *------------- DATABASE AREA
       COPY DBMODES IN COPYCSIS.

       COPY DBSTAT  IN COPYCSIS.


       01  DSET-NAME-AREA.
           05  DSET-NAME               PIC X(16)  VALUE SPACES.
           05  DSET-MVALIDUM           PIC X(16)  VALUE "MVALIDUM;".

       01  DATABASE-ARGS.
           05  DUMMY-ARG               PIC X(4)   VALUE SPACES.

       01  SEARCH-ITEMS.
           05  ALL-ITEM-LIST           PIC X(2)   VALUE "@;".

      *------------- DATABASE BUFFERS
       COPY MVALIDUM IN COPYCSIS.
       COPY MPLTINFO IN COPYCSIS.
      *------------------------------------------------------------
       LINKAGE SECTION.

       01  BASE                       PIC X(10).
       01  PLANT-NUMBER               PIC X(3).
       01  ESC-INFO.
           05  COMPRESS-PRINT         PIC X(8).
           05  NORMAL-PRINT           PIC X(8).
           05  EXPAND-PRINT           PIC X(8).
       01  HD-PAPER-FLAG              PIC X(1).
           88  PAPER-IS-132-COL                VALUE "X".

      *************************************************************
      *************************************************************
      *           P R O C E D U R E     D I V I S I O N           *
      *************************************************************
      *************************************************************
       PROCEDURE DIVISION USING BASE, PLANT-NUMBER, ESC-INFO,
                                HD-PAPER-FLAG.
       0-BEGIN-SORT SECTION.

       10-OPEN-FILES.
           MOVE "SCURRRPT"  TO BU-PGM-NAME.
           OPEN OUTPUT PRINT-FILE.
           OPEN INPUT MVALIDUM-I.
           OPEN INPUT MPLTINFO-I.

       60-MAIN.
           SORT SORT-FILE
               ON ASCENDING KEY SORT-CURRENCY-KEY
               INPUT  PROCEDURE IS 8-INPUT-RECORDS
               OUTPUT PROCEDURE IS 9-WRITE-RECORDS.

           WRITE PRINT-REC FROM NORMAL-PRINT AFTER ADVANCING 0.

           CLOSE MVALIDUM-I.
           CLOSE MPLTINFO-I.
           GOBACK.

       8-INPUT-RECORDS SECTION.
           READ MVALIDUM-I FIRST RECORD INTO BUF-MVALIDUM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
                GO TO 89-EXIT.
           MOVE SPACES TO BUF-MPLTINFO.
           MOVE "N"    TO WS-EDI-INSTAL.
           MOVE "EDI " TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO.
           IF FILE-STATUS = "00"
               IF EDI-INSTAL = "Y"
                   MOVE "Y" TO WS-EDI-INSTAL.
           PERFORM 81-PROCESS-INPUT-RECORDS THRU 81-PIR-EXIT.
           GO TO 89-EXIT.

       81-PROCESS-INPUT-RECORDS.
           IF VALID-UM IS NUMERIC
               MOVE VALID-UM       TO SORT-CURRENCY-KEY
               MOVE VALID-EDI-UM   TO SORT-CURRENCY-EDI
               MOVE VALID-UM-DESC  TO SORT-CURRENCY-DESC
               RELEASE SORT-RECORD.

           READ MVALIDUM-I NEXT INTO BUF-MVALIDUM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO 81-PIR-EXIT
               ELSE
               MOVE "DBGET MVALIDUM AT 81-P-I-R"
                   TO BU-DISPLAY-MSG
               PERFORM 82-BLOWUP.

           GO TO 81-PROCESS-INPUT-RECORDS.
       81-PIR-EXIT.
           EXIT.


      *************************************************************
      *                    BLOWUP   ROUTINE                       *
      *************************************************************
       82-BLOWUP.
           WRITE PRINT-REC FROM NORMAL-PRINT AFTER ADVANCING 0.

           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
                 VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                 BU-DISPLAY-AREA.


       89-EXIT.
           EXIT.

       9-WRITE-RECORDS SECTION.
           IF PAPER-IS-132-COL
               NEXT SENTENCE
           ELSE
              WRITE PRINT-REC FROM COMPRESS-PRINT
                   AFTER ADVANCING 0 LINES.

           PERFORM 94-NEW-PAGE.
           RETURN SORT-FILE AT END
               MOVE "Y"               TO END-OF-SORT-FILE
               WRITE PRINT-REC FROM NO-SORTED-RECORDS
                   AFTER ADVANCING 1 LINES
               GO TO 99-EXIT.
           PERFORM 91-PROCESS-SORTED-RECORDS THRU 91-PSR-EXIT
               UNTIL ALL-SORTED-RECORDS-PROCESSED.
           GO TO 99-EXIT.

       91-PROCESS-SORTED-RECORDS.
           MOVE SORT-CURRENCY-KEY  TO LINE1-CURRENCY-KEY.
           IF WS-EDI-INSTAL = "Y"
               MOVE SORT-CURRENCY-EDI TO LINE1-CURRENCY-EDI.
           MOVE SORT-CURRENCY-DESC TO LINE1-CURRENCY-DESC.
           WRITE PRINT-REC FROM LINE1 AFTER ADVANCING 1 LINES.
           ADD   1  TO LINE-CTR.
           RETURN SORT-FILE AT END
               MOVE "Y"               TO END-OF-SORT-FILE.
           IF LINE-CTR > 50 AND NOT ALL-SORTED-RECORDS-PROCESSED
               PERFORM 94-NEW-PAGE.

       91-PSR-EXIT.
           EXIT.


       94-NEW-PAGE.
           MOVE SPACES                TO PRINT-LINE.
           ADD 1                      TO PAGE-NUM.
           MOVE "G O O D Y E A R   C O R P O R A T E   "
                                      TO HEAD1-TITLE1.
           MOVE " I N F O R M A T I O N   S Y S T E M"
                                      TO HEAD1-TITLE2.
           MOVE "PLANT "              TO HEAD1-PLANT.
           MOVE PLANT-NUMBER          TO HEAD1-PLANT-OUT.
           WRITE PRINT-REC FROM PRINT-LINE AFTER ADVANCING NEW-PAGE.
           MOVE SPACES                TO PRINT-LINE.
           MOVE 1                     TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-FORMATTED-TIME-OUT TO HEAD2-TIME.
           MOVE DATE-SLASH-OUT        TO HEAD2-DATE.
           MOVE "PAGE: "              TO HEAD2-PAGE.
           MOVE PAGE-NUM              TO HEAD2-PAGE-NO.
           MOVE "                V A L I D   C "  TO HEAD2-TITLE1.
           MOVE "U R R E N C Y   C O D E S                "
                                                 TO HEAD2-TITLE2.
           WRITE PRINT-REC FROM PRINT-LINE AFTER ADVANCING 2 LINES.
           WRITE PRINT-REC FROM DOT-LINE AFTER ADVANCING 1 LINES.
           MOVE SPACES                 TO PRINT-LINE.
           MOVE "CURRENCY CODE"        TO HEAD4-CODE.
           IF WS-EDI-INSTAL = "Y"
               MOVE "EDI CURRENCY-CODE" TO HEAD4-EDI.
           MOVE "DESCRIPTION"          TO HEAD4-DESC.
           WRITE PRINT-REC FROM PRINT-LINE AFTER ADVANCING 2 LINES.
           MOVE SPACES                 TO PRINT-LINE.
           WRITE PRINT-REC FROM PRINT-LINE AFTER ADVANCING 1 LINES.
           MOVE  7                     TO LINE-CTR.

       99-EXIT.
           EXIT.
