000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    SDELSITM.
000500 AUTHOR.        KURT MOVSESIAN/JIM COFFMAN (MAINTAINER).
000800
000900******************************************************
001000*                                                    *
001100*   S D E L S I T M                   PU2-5          *
001200*                                                    *
001300*   THIS SUB PROGRAM DELETES ITEMS FROM PO           *
001400*                                                    *
001500******************************************************
001600*   N O T E    T H I S   S U B R O U T I N E   I S   *
001700*         C A L L E D    B Y :                       *
001800*      1. SPOMOD                                     *
001900******************************************************
      *C  07/17/1996   CA YODER
      *C    RE-COMPILED TO PICK UP CENTURY DATABASE CHANGES.
      *C
      *C  11/22/96  JEFF BUNGO
      *C    DELETE DRCVTRAK RECORDS FOR DELETED ITEM.
      *C
      *C   05/21/98  CA YODER
      *C   ADDED CALL TO "SCALCBGT" TO CALCULATE THE CORRECT
      *C   BUDGET AMOUNT FOR THE PO.  DECATUR FOUND THAT THE
      *C   TAX WAS NOT BEING INCLUDED IN THE CALCULATION.
      *C
      *C   09/18/03  CA YODER
      *C   ADDED LOGIC TO CHECK FOR INVOICES FOR NON-RECEIVABLE
      *C   PURCHASE ORDERS.
      *C
      *C   09/23/03  CA YODER
      *C   FOR TMS PLANTS, DO NOT ALLOW DELETE OF LAST ITEM ON PO.
      *C   NEED TO DELETE ENTIRE PO.
      *C
002000
008600
008700 ENVIRONMENT DIVISION.
008800 CONFIGURATION SECTION.
008900 SOURCE-COMPUTER.  IBM-AS400.
009000 OBJECT-COMPUTER.  IBM-AS400.
       SPECIAL-NAMES.  I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
009100
009200 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
009300
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZPURORD-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

           SELECT MSTORERM-I
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MREQ-O
                  ASSIGN TO DATABASE-MCFLCS2001
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
003500
           SELECT DREQD-I
                  ASSIGN TO DATABASE-MCFLCS2102
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DREQD-O
                  ASSIGN TO DATABASE-MCFLCS2101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPOITEM-O
                  ASSIGN TO DATABASE-MCFLCS1002
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPODATAITM-O
                  ASSIGN TO DATABASE-MCFLCS1101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DRCVTRAK-O
                  ASSIGN TO DATABASE-MCFLCS6402
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DDAILYTC-O
                  ASSIGN TO DATABASE-MCFLCS1601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DINVRCD
                  ASSIGN TO DATABASE-MCFLCS2506
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DINVITM
                  ASSIGN TO DATABASE-MCFLCS2601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC.
           COPY DD-POMOD5-O OF ZPURORD.

       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0201.

       FD  MREQ-O
           LABEL RECORDS ARE STANDARD.
       01  MREQ-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLCS2001.

       FD  DREQD-I
           LABEL RECORDS ARE STANDARD.
       01  DREQD-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS2102.

       FD  DREQD-O
           LABEL RECORDS ARE STANDARD.
       01  DREQD-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLCS2101.

       FD  DPOITEM-O
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLCS1002.

       FD  DPODATAITM-O
           LABEL RECORDS ARE STANDARD.
       01  DPODATAITM-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLCS1101.

       FD  DRCVTRAK-O
           LABEL RECORDS ARE STANDARD.
       01  DRCVTRAK-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLCS6402.

       FD  DDAILYTC-O
           LABEL RECORDS ARE STANDARD.
       01  DDAILYTC-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLCS1601.

       FD  DINVRCD
           LABEL RECORDS ARE STANDARD.
       01  DINVRCD-REC.
           COPY DDS-MCRPCS2500  OF MCFLCS2506.

       FD  DINVITM
           LABEL RECORDS ARE STANDARD.
       01  DINVITM-REC.
           COPY DDS-MCRPCS2600  OF MCFLCS2601.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0501.

003700
003800 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
009700
010000 77  BUDGET-AMT-SAVED            PIC S9(11) VALUE ZEROS.
010200 77  LINE-SUB                    PIC S9(4) VALUE ZEROS COMP-4.
       77  INVOICE-FOUND-SW            PIC X     VALUE "N".
       77  DELETE-LAST-ITEM-SW         PIC X     VALUE "Y".
010300
010400*************************************************************
010500**                                                         **
010600**      V I E W   C O M M U N I C A T I O N   A R E A      **
010700**                                                         **
010800*************************************************************
010900
011000
011100 01  MESSAGE-BUFFER.
011200     05  MSG-TEXT              PIC X(66)    VALUE SPACE.
011300     05  MSG-FLD               PIC X(10)     VALUE SPACE.
011400     05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC Z(9)9.
011500
012000 01  FIELD-NUMBER      PIC S9(4)    VALUE 1       COMP-4.
012100
012200 COPY CATREAD IN COPYLIB.
012300
       COPY DISPDATA IN COPYLIB.
012400
012500 COPY IOFEEDBACK IN COPYLIB.

012600**************************************************************
012700**************************************************************
012800**                                                          **
012900**             TERMINAL I/O DATA AREA                       **
013000**                                                          **
013100**************************************************************
013200**************************************************************
013300
013400 01  SCREEN-5.
           05  DE5-EDILIT                 PIC X(6).
013500     05  DE5-PO                     PIC X(7).
013600     05  DE5-REL                    PIC XXX.
013700     05  DE5-MSG-TOP                PIC X(60).
013800     05  DE5-ITEM                   PIC X(4).
013900     05  DE5-REQ-NO                 PIC X(12).
014000     05  DE5-CODE                   PIC X(7).
014100     05  DE5-UNIT-PRICE             PIC 9(11)V9(4).
014200     05  DE5-PRICE-UM               PIC XX.
014300     05  DE5-ORD-QTY                PIC 9(8)V9(4).
014400     05  DE5-ORD-UM                 PIC XX.
014500     05  DE5-SUBDTL                 PIC X(4).
014600     05  DE5-SUB                    PIC X(3).
014700     05  DE5-ADDTL-DATA             PIC X(6).
014800     05  DE5-TAX-CODE               PIC X(2).
014900     05  DE5-DESC.
015000         10  DE5-DESC-LINES  OCCURS 7 TIMES  PIC X(79).
015100     05  DE5-MSG-BOTTOM             PIC X(34).
           05  DE5-COMMAND-LINE           PIC X(79).
           05  DE5-MESSAGE-LINE           PIC X(79).
015200
015300**************************************************************
015400**************************************************************
015500**                                                          **
015600**                DATABASE I/O BUFFER AREA                  **
015700**                                                          **
015800**************************************************************
015900**************************************************************
016000
016100 COPY MSTORERM IN COPYLIB.
016200
016300 COPY DPOITEM IN COPYLIB.
016400
016500 COPY DPODATA IN COPYLIB.

       COPY DRCVTRAK IN COPYLIB.
016600
016700 COPY DDAILYTC IN COPYLIB.
016800
016900 COPY TC32D IN COPYLIB.
017000
017100 COPY MREQ IN COPYLIB.
017200
017300 COPY DREQD IN COPYLIB.
017400
       COPY DINVRCD IN COPYLIB.

       COPY DINVITM IN COPYLIB.

       COPY MPLT0    IN COPYLIB.
       COPY MPLTPODL IN COPYLIB.
017500
017600*********************
017700*                   *
017800*   DATA SET NAMES  *
017900*                   *
018000*********************
018100
018200 01  DSET-NAMES.
018300     05  DSET-NAME              PIC X(16)  VALUE SPACES.
018400     05  DSET-MSTORERM          PIC X(16)  VALUE "MSTORERM;".
018500     05  DSET-MREQ              PIC X(16)  VALUE "MREQ;".
018600     05  DSET-DREQD             PIC X(16)  VALUE "DREQD;".
018700     05  DSET-DPOITEM           PIC X(16)  VALUE "DPOITEM;".
018800     05  DSET-DDAILYTC          PIC X(16)  VALUE "DDAILYTC;".
018900     05  DSET-DPODATAITM        PIC X(16) VALUE "DPODATAITM;".
019000
019300 COPY DBSTAT IN COPYLIB.
019400
019500
019600 01 ITEMS-LISTING.
019700     05  ALL-ITEMS              PIC XX    VALUE "@;".
019800     05  CODE-SEARCH            PIC X(10) VALUE "CORP-CODE;".
019900     05  REQ-SEARCH             PIC X(12) VALUE "REQ-NUMBER;".
020000     05  PO-SEARCH              PIC X(10) VALUE "PO-RCV-NO;".
020100
020200 01 ARG-VALUES.
020300     05  CODE-ARG               PIC X(8)  VALUE SPACES.
020400     05  REQ-ARG                PIC X(12) VALUE SPACES.
020500     05  PO-ARG                 PIC X(14) VALUE SPACES.
           05  PLT-ARG                PIC X(4)  VALUE SPACES.
023100
023200************************************
023300*
023400*  PARAMETERS FOR CALLING
023500*  STC320.SOURCE
023600*
023700************************************
023800
023900 COPY STC320 IN COPYLIB.
024000
034400************************************
034500*
034600*  PARAMETERS FOR CALLING
034700*  SEDIPOLG.SOURCE
034800*
034900************************************
035000
       COPY SEDIPOLG IN COPYLIB.

034400************************************
034500*
034600*  PARAMETERS FOR CALLING
034700*  SEDIVNCK.SOURCE
034800*
034900************************************
035000
       COPY SEDIVNCK IN COPYLIB.

024100************************************
024200*
024300*  PARAMETERS FOR CALLING
024400*  SVENPRC.SOURCE
024500*
024600************************************
024700
024800 COPY SVENPRC IN COPYLIB.
024900
025000************************************
025100*
025200*  PARAMETERS FOR CALLING
025300*  SRCVDELT.SOURCE
025400*
025500************************************
025600
025700 COPY SRCVDELT IN COPYLIB.
025800
025900************************************
026000*
026100*  PARAMETERS FOR CALLING
026200*  SMODBDGT.SOURCE
026300*
026400************************************
026500
026600 COPY SMODBDGT IN COPYLIB.
027300
       COPY SCALCBGT IN COPYLIB.

       COPY CNUMITMS IN COPYLIB.

027400 COPY TBLOWUP IN COPYLIB.
027500
027600 LINKAGE SECTION.
027700
027800 01  BASE             PIC X(10).
028000
028100 01  BUILD-PO-SEARCH.
028200     05  PO-PREFIX           PIC X.
028300     05  PO-NO               PIC X(7).
028400     05  PO-REL              PIC X(3).
028500     05  PO-RCV              PIC X(3).
028600
028700 COPY VCOMLINK IN COPYLIB.
028800
028900 COPY DPORECD IN COPYLIB.
029000
029100
029200 01  SWITCH-PARAMETERS.
029300     05  FATAL-ERR-SW            PIC X.
029400     05  COMPANY-SAVE            PIC X(3).
029500
029600
029700**************************************
029800*                                    *
029900*  PRINTCNTL IS SET TO 1 THIS CAUSES *
030000*  THE FIELD ON A SCREEN PRINTOUT    *
030100*  TO BE UNDERLINED                  *
030200*                                    *
030300*  PAGECNTL IS SET TO 49 (OCTAL 61)  *
030400*  THIS CAUSE THE LP TO EJECT AFTER  *
030500*  THE SCREEN IS PRINTED             *
030600*                                    *
030700**************************************
030800
030900 01  SCREEN-PRINT-PARMS.
031000     05  PRINTCNTL             PIC S9(4)    COMP-4.
031100     05  PAGECNTL              PIC S9(4)    COMP-4.
031200     05  SPOOLFIL-OPEN-SW      PIC X.
031300
031400 01  PASSED-SPOOL-PRT          PIC S9(2)    COMP-4.
031500
031600 COPY LANGSUB IN COPYLIB.
031700
031800
031900
032000 PROCEDURE DIVISION USING  BASE,
032100                           BUILD-PO-SEARCH,
032200                           VIEW-COMAREA,
032300                           BUF-DPORECD,
032400                           SWITCH-PARAMETERS,
032500                           SCREEN-PRINT-PARMS,
032600                           PASSED-SPOOL-PRT,
032700                           LANGUAGE-PARMS.
032800
032900
033000 DELETE-STORERM-ITEM SECTION 30.
       BEGIN.
           OPEN INPUT DREQD-I, MSTORERM-I, MPLTINFO-I,
                      DINVRCD, DINVITM.
           OPEN I-O DISPLAY-FILE, DPOITEM-O, DPODATAITM-O,
                    DDAILYTC-O, DREQD-O, MREQ-O, DRCVTRAK-O.

           MOVE "Y"              TO  DELETE-LAST-ITEM-SW.
           MOVE "PODL"           TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               IF MPLTINFO-LAST-ITEM-SW > SPACE
                   MOVE MPLTINFO-LAST-ITEM-SW TO DELETE-LAST-ITEM-SW.

           MOVE SPACES           TO  SEDIVNCK-PARMS.
033100     MOVE BUILD-PO-SEARCH  TO  PO-ARG,
                                     SEDIVNCK-PO-NUMBER,
033200                               BU-DISPLAY-FLD (1).
           CALL "SEDIVNCK" USING BASE,
                                 SEDIVNCK-PARMS.
033300     PERFORM 66-DELETE-ITEM  THRU  66-DI-X.
033400
           CLOSE DISPLAY-FILE, DPOITEM-O, DPODATAITM-O,
                 DDAILYTC-O, DREQD-O, MREQ-O, DREQD-I, MSTORERM-I
                 DRCVTRAK-O, DINVRCD, DINVITM.
033500     GOBACK.
033600
033700******************************************************
033800**                                                  **
033900**   BLOWUP ROUTINE                                 **
034000**                                                  **
034100******************************************************
034200
034300 2-BLOWUP.
           IF FILE-STATUS NUMERIC
               MOVE FILE-STATUS TO COND-WORD.
034400     MOVE "SDELSITM"  TO  BU-PGM-NAME.
034500     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
034600         VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
034700             BU-DISPLAY-FLDS.
037900
038000 4-PGM-ERROR.
           MOVE B"1" TO IND (FIELD-NUMBER), IND (99).
           MOVE MESSAGE-BUFFER TO DE5-MESSAGE-LINE.
038800
038900 4-PGM-ERROR-X.
039000     EXIT.
039100
041000
041100 66-DELETE-ITEM.
041300     MOVE "POMOD5"  TO  VIEW-NFNAME.
041800
042800     MOVE SPACES           TO  SCREEN-5.
042900     MOVE PO-NO            TO  DE5-PO.
043000     MOVE PO-REL           TO  DE5-REL.
           IF SEDIVNCK-EDI-IND = "Y"
               MOVE "EDI PO"     TO  DE5-EDILIT.
           MOVE ZEROS TO DE5-ITEM, DE5-UNIT-PRICE, DE5-ORD-QTY.
043100*    *** ENTER ITEM# TO DELETE AND PRESS 'ENTER' ***
043200     MOVE   5 TO LANG-SETNUM.
043300     MOVE  12 TO LANG-MSGNUM.
043400     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
043500     MOVE MESSAGE-BUFFER TO DE5-MSG-TOP.
044200
044300 66-SHOWFORM-SCREEN-5.
           MOVE SCREEN-5       TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC    TO SCREEN-5.
045000
045100     IF VIEW-LASTKEY = 3
045200         GO TO 66-DI-X
045300     ELSE
046600     IF VIEW-LASTKEY = 1 OR
046700        VIEW-LASTKEY = 2 OR
046800        VIEW-LASTKEY = 4 OR
046900        VIEW-LASTKEY = 5 OR
047000        VIEW-LASTKEY = 6 OR
047100        VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
047300*        *** INVALID FUNCTION KEY ***
047400         MOVE   9 TO LANG-SETNUM
047500         MOVE  10 TO LANG-MSGNUM
047600         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
047700         MOVE 3  TO  FIELD-NUMBER
047800         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
047900         GO TO 66-SHOWFORM-SCREEN-5.
048000
           IF DE5-ITEM = ZEROS
      *         YOU MUST ENTER AN ITEM NUMBER
               MOVE 66110 TO CATREAD-MSG-NUMBER
069800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
069900         MOVE 3  TO FIELD-NUMBER
070000         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
070100         GO TO 66-SHOWFORM-SCREEN-5.
049800
049900     MOVE BUILD-PO-SEARCH  TO  PO-ARG.
           MOVE PO-ARG           TO  PORCVNO OF DPOITEM-REC-O.
           MOVE DE5-ITEM         TO  ITEMNO OF DPOITEM-REC-O.
           READ DPOITEM-O INTO BUF-DPOITEM
               INVALID KEY MOVE "2" TO FILE-STATUS-1.
           IF FILE-STATUS-1 = "2"
069500*        *** ITEM NUMBER DOES NOT EXIST ON THIS P.O. ***
069600         MOVE   9 TO LANG-SETNUM
069700         MOVE  11 TO LANG-MSGNUM
069800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
069900         MOVE 3  TO FIELD-NUMBER
070000         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
070100         GO TO 66-SHOWFORM-SCREEN-5
070200     ELSE
           IF FILE-STATUS NOT = "00"
070300         MOVE "GET DPOITEM * 66-GL" TO BU-DISPLAY-MSG
070400         GO TO 2-BLOWUP.
067800
      *------ DO A START TO UNLOCK DPOITEM
           MOVE HIGH-VALUES TO PORCVNO OF DPOITEM-REC-O.
           START DPOITEM-O KEY > PORCVNO OF DPOITEM-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.
053200
053400     MOVE "POMOD5B"  TO  VIEW-NFNAME.
054000
054200     MOVE ITM-NUMBER          TO  DE5-ITEM.
054300*    *** ENTER ZEROS IN THE PRICE & QTY FIELDS & HIT ENTER ***
054400     MOVE   5 TO LANG-SETNUM.
054500     MOVE  11 TO LANG-MSGNUM.
054600     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
054700     MOVE MESSAGE-BUFFER      TO DE5-MSG-TOP.
054800     IF ITM-CORP-CODE = "NON-STR"
054900         MOVE "NC"            TO  DE5-CODE
055000     ELSE
055100         MOVE ITM-CORP-CODE   TO  DE5-CODE.
055200     MOVE ITM-QTY-ORD         TO  DE5-ORD-QTY.
055300     MOVE ITM-UM              TO  DE5-ORD-UM.
055400     MOVE ITM-UNIT-PRICE      TO  DE5-UNIT-PRICE.
055500     MOVE ITM-PRICE-UM        TO  DE5-PRICE-UM.
055600     MOVE ITM-CLASS           TO  DE5-SUB
055700     MOVE ITM-SUB-DETL        TO  DE5-SUBDTL.
055800     MOVE ITM-ADDL-DATA       TO  DE5-ADDTL-DATA.
055900     MOVE ITM-TAX-CODE        TO  DE5-TAX-CODE.
056000     MOVE "NONE"              TO  DE5-REQ-NO.
056100     PERFORM 661-CHECK-FOR-REQ  THRU  661-CFR-X.
056200*    *** 'f7' TO REQUEST ANOTHER ITEM ***
056300     MOVE   6 TO LANG-SETNUM.
056400     MOVE   7 TO LANG-MSGNUM.
056500     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
056600     MOVE MESSAGE-BUFFER TO DE5-MSG-BOTTOM.
056700
      *------ LOAD DESC. UP TO 6 LINES ONLY
056900     MOVE ZEROS                   TO  LINE-SUB.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPODATAITM-REC-O.
           START DPODATAITM-O KEY = PORCVNO OF DPODATAITM-REC-O
               INVALID KEY MOVE "2" TO FILE-STATUS-1.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 66-SHOWFORM-SCREEN-5B
               ELSE
                   MOVE 99 TO COND-WORD.
057000*A   CALL "DBFIND" USING BASE, DSET-DPODATAITM, MODE1,
057100*A       STATUS-AREA, PO-SEARCH, PO-ARG.
057200     IF COND-WORD NOT = 0
057300         MOVE "FIND DPODATA * 66-FD" TO BU-DISPLAY-MSG
057400         GO TO 2-BLOWUP.
057700
057800 66-GET-DESC.
           MOVE 0 TO COND-WORD.
           READ DPODATAITM-O NEXT INTO BUF-DPODATAITM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPODATAITM-REC-O NOT = PO-ARG
               MOVE 15 TO COND-WORD.
057900*A   CALL "DBGET" USING BASE, DSET-DPODATAITM, MODE5,
058000*A       STATUS-AREA, ALL-ITEMS, BUF-DPODATAITM, PO-ARG.
058100     IF COND-WORD NOT = 0
058200         IF COND-WORD = 15
058300             GO TO 66-START-DPODATAITM
058400         ELSE
058500             MOVE "GET DPODATA * 66-GD" TO BU-DISPLAY-MSG
058600             GO TO 2-BLOWUP.
058700     IF DATAITM-ITEM-NO = DE5-ITEM
058800         ADD 1 TO LINE-SUB
058900         MOVE DATAITM-INFO  TO  DE5-DESC-LINES (LINE-SUB)
059000         IF LINE-SUB > 6
059100             GO TO 66-START-DPODATAITM
059200         ELSE
059300             GO TO 66-GET-DESC
059400     ELSE
059500         IF DATAITM-ITEM-NO < DE5-ITEM
059600             GO TO 66-GET-DESC.
059700
059800 66-START-DPODATAITM.
      *------ DO A START ON DPODATAITM TO FREE UP LOCKS
           MOVE HIGH-VALUES TO PORCVNO OF DPODATAITM-REC-O.
           START DPODATAITM-O KEY > PORCVNO OF DPODATAITM-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.
060500
061500 66-SHOWFORM-SCREEN-5B.
           MOVE SCREEN-5       TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC    TO SCREEN-5.
062700
062800     IF VIEW-LASTKEY = 3
062900         GO TO 66-DI-X
063000     ELSE
063100     IF VIEW-LASTKEY = 7
063200         GO TO 66-DELETE-ITEM
063300     ELSE
064600     IF VIEW-LASTKEY = 1 OR
064700        VIEW-LASTKEY = 2 OR
064800        VIEW-LASTKEY = 4 OR
064900        VIEW-LASTKEY = 5 OR
065000        VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 8
065200*        *** INVALID FUNCTION KEY ***
065300         MOVE   9 TO LANG-SETNUM
065400         MOVE  10 TO LANG-MSGNUM
065500         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
065600         MOVE 9  TO  FIELD-NUMBER
065700         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
065800         GO TO 66-SHOWFORM-SCREEN-5B.
067600
           IF DE5-UNIT-PRICE NOT = ZEROS
      *         ITEM PRICE MUST BE ZERO FOR DELETION
               MOVE 66116 TO CATREAD-MSG-NUMBER
069800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
069900         MOVE 9  TO FIELD-NUMBER
070000         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
070100         GO TO 66-SHOWFORM-SCREEN-5B.

           IF DE5-ORD-QTY NOT = ZEROS
      *         ITEM QUANTITY MUST BE ZERO FOR DELETION
               MOVE 66117 TO CATREAD-MSG-NUMBER
069800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
069900         MOVE 6  TO FIELD-NUMBER
070000         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
070100         GO TO 66-SHOWFORM-SCREEN-5B.

      *----- IF SWITCH SET, DO NOT ALLOW DELETE OF LAST ITEM ON PO.
      *----- NEED TO DELETE ENTIRE PO.
           IF DELETE-LAST-ITEM-SW = "N"
               MOVE ITM-PO-RCV-NO TO CNUMITMS-PO-NUMBER
               MOVE 0             TO CNUMITMS-NUM-ITEMS
               CALL "CNUMITMS" USING CNUMITMS-PARMS
               IF CNUMITMS-NUM-ITEMS = 1
      *        *** CANNOT DELETE LAST ITEM ON PO; DELETE ENTIRE PO ***
                   MOVE   3 TO LANG-SETNUM
                   MOVE 642 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 9  TO FIELD-NUMBER
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   GO TO 66-SHOWFORM-SCREEN-5B.

      *-------- IF NON-RECEIVABLE PO, CHECK TO SEE IF INVOICES EXIST
      *-------- FOR THE ITEM.
           IF PO-NON-RCV-INDIC > SPACES
               PERFORM 663-CHECK-FOR-INVOICES THRU 663-CFI-X
               IF INVOICE-FOUND-SW = "Y"
      *            *** INVOICE EXISTS FOR THIS ITEM; CANNOT DELETE ***
                   MOVE   9 TO LANG-SETNUM
                   MOVE 117 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 9  TO FIELD-NUMBER
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   GO TO 66-SHOWFORM-SCREEN-5B
               END-IF
           ELSE
067700*----- CHECK IF NO DELIVERY; CANT DELETE IN NO DELIVERY
067800     IF ITM-QTY-DLVR = 0
067900         NEXT SENTENCE
068000     ELSE
068100*        *** MAY NOT BE DELETED BECAUSE OF DELIVERY ***
068200         MOVE  13 TO LANG-SETNUM
068300         MOVE  16 TO LANG-MSGNUM
068400         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
068500         MOVE 9  TO FIELD-NUMBER
068600         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
068700         GO TO 66-SHOWFORM-SCREEN-5B.
068800
069300 66-PROCESS-DELETE.
070000     IF DE5-CODE = "NC"
070100         GO TO 66-DELETE-DPOITEM.
070200
070300********************************************
070400**   GET MSTORERM BUFFER FOR USE LATER
070500**   WHEN CUTTING ITEM TCs
070600********************************************
070700     MOVE ITM-CORP-CODE       TO  CODE-ARG.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC-I.
           READ MSTORERM-I INTO BUF-MSTORERM
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
070800*A   CALL "DBGET" USING BASE, DSET-MSTORERM, MODE7,
070900*A          STATUS-AREA, ALL-ITEMS, BUF-MSTORERM, CODE-ARG.
071000     IF COND-WORD NOT = 0
071100         MOVE "GET MSTORERM * 66-PD" TO BU-DISPLAY-MSG
071200         GO TO 2-BLOWUP.
071300
071400**********************************************************
071500**  CALL 'SVENPRC' TO DELETE THE VENDOR PRICE SEGMENT
071600**  'DVENDITM' IF THIS ENTRY CONTAINS NO RECEIVING
071700**  HISTORY (ALL 3 LTs = ZEROS)
071800**********************************************************
071900
072000     MOVE SPACES                  TO  SVENPRC-PARMS.
072100     MOVE "D"                     TO  SVENPRC-FLAG.
072200     MOVE CODE-ARG                TO  SVENPRC-CODE.
072300     MOVE PO-VEN-CODE             TO  SVENPRC-VEN-CODE.
072400     MOVE ZEROS                   TO  SVENPRC-PRICE.
072500     CALL "SVENPRC" USING BASE,
072600                          SVENPRC-PARMS,
072700                          STATUS-AREA,
072800                          BU-DISPLAY-MSG,
072900                          BU-DISPLAY-FLDS.
073000     IF BU-DISPLAY-MSG-1  NOT = SPACES
073100         GO TO 2-BLOWUP.
073200
073300 66-DELETE-DPOITEM.
      *********************************************************
      **   GET THE ITEM FOR UPDATE AFTER SCREEN READ
      *********************************************************
           MOVE PO-ARG           TO  PORCVNO OF DPOITEM-REC-O.
           MOVE DE5-ITEM         TO  ITEMNO OF DPOITEM-REC-O.
           READ DPOITEM-O INTO BUF-DPOITEM
               INVALID KEY MOVE "2" TO FILE-STATUS-1.
           IF FILE-STATUS-1 = "2"
069500*        *** ITEM NO LONGER EXISTS; PLEASE EXIT AND TRY ANOTHER
069600         MOVE  66109 TO CATREAD-MSG-NUMBER
069800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
069900         MOVE 9  TO FIELD-NUMBER
070000         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
070100         GO TO 66-SHOWFORM-SCREEN-5B
070200     ELSE
           IF FILE-STATUS NOT = "00"
070300         MOVE "READ DPOITEM * 62-GL" TO BU-DISPLAY-MSG
070400         GO TO 2-BLOWUP.

           MOVE 0 TO COND-WORD.
           DELETE DPOITEM-O INVALID KEY MOVE "2" TO FILE-STATUS-1.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
074300*A   CALL "DBDELETE" USING BASE, DSET-DPOITEM, MODE1,
074400*A       STATUS-AREA.
074500     IF COND-WORD NOT = 0
074600         MOVE "DELETE DPOITEM * 66-DD" TO BU-DISPLAY-MSG
074700         GO TO 2-BLOWUP.
075300
075400**************************
075500*                        *
075600*  FIND ALL DPODATAITM   *
075700*  RECORDS FOR THE ITEM  *
075800*  AND DELETE THEM       *
075900*                        *
076000**************************
076100
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPODATAITM-REC-O.
           START DPODATAITM-O KEY = PORCVNO OF DPODATAITM-REC-O
               INVALID KEY MOVE "2" TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 66-UNLOCK-DPODATAITM
               ELSE
                   MOVE 99 TO COND-WORD.
076300*A   CALL "DBFIND" USING BASE, DSET-DPODATAITM, MODE1,
076400*A       STATUS-AREA, PO-SEARCH, PO-ARG.
076500     IF COND-WORD NOT = 0
076600         MOVE "FIND DPODATA * 66-FD" TO BU-DISPLAY-MSG
076700         GO TO 2-BLOWUP.
076800
077900 66-GET-DPODATAITM.
           MOVE 0 TO COND-WORD.
           READ DPODATAITM-O NEXT INTO BUF-DPODATAITM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPODATAITM-REC-O NOT = PO-ARG
               MOVE 15 TO COND-WORD.
078000*A   CALL "DBGET" USING BASE, DSET-DPODATAITM, MODE5,
078100*A       STATUS-AREA, ALL-ITEMS, BUF-DPODATAITM, PO-ARG.
078200     IF COND-WORD = ZERO
078300         IF DATAITM-ITEM-NO = DE5-ITEM
                   DELETE DPODATAITM-O INVALID KEY
                       MOVE "2" TO FILE-STATUS-1 END-DELETE
                   IF FILE-STATUS NOT = "00"
078700                 MOVE "DELETE DPODATA * 66-GD" TO BU-DISPLAY-MSG
078900                 GO TO 2-BLOWUP
079000             ELSE
079100                 GO TO 66-GET-DPODATAITM
079200         ELSE
079300             IF DATAITM-ITEM-NO < DE5-ITEM
079400                 GO TO 66-GET-DPODATAITM
079500             ELSE
079600                 NEXT SENTENCE
079700     ELSE
079800         IF COND-WORD = 15
079900              NEXT SENTENCE
080000         ELSE
080100            MOVE "GET DPODATA * 66-GD" TO BU-DISPLAY-MSG
080200             GO TO 2-BLOWUP.
080300
080400 66-UNLOCK-DPODATAITM.
      *------ DO A START ON DPODATAITM TO FREE UP LOCKS
           MOVE HIGH-VALUES TO PORCVNO OF DPODATAITM-REC-O.
           START DPODATAITM-O KEY > PORCVNO OF DPODATAITM-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.
081100     IF DE5-REQ-NO  =  "NONE  "
081200         NEXT SENTENCE
081300     ELSE
081400         PERFORM 662-MODIFY-REQ THRU 662-MR-X.
081500
081600
081700****************************************************
081800**  CALL "STC320"  TO CUT THE TC 321 AND 322 THEN
081900**  RETURN AND CUT THE 32D TC
082000****************************************************
082100
082200     MOVE SPACES                  TO  STC320-PARMS.
082300     MOVE COMPANY-SAVE            TO  STC320-COMPANY-SAVE.
082400     MOVE "21"                    TO  STC320-ITEM-TC-ID.
082500     MOVE BUILD-PO-SEARCH         TO  STC320-PO-NUM.
082600     MOVE ITM-NUMBER              TO  STC320-ITEM.
082700     MOVE DE5-CODE                TO  STC320-CODE.
082800     IF DE5-CODE = "NC"
082900         MOVE ITM-UM              TO  STC320-QTY-UM,
083000                                      STC320-PRICE-UM
083100     ELSE
083200         MOVE STR-UM              TO  STC320-QTY-UM,
083300                                      STC320-PRICE-UM.
083400     MOVE ZEROS                   TO  STC320-QTY,
083500                                      STC320-PRICE.
083600     IF DE5-REQ-NO  =  "NONE  "
083700         NEXT SENTENCE
083800     ELSE
083900         MOVE DE5-REQ-NO          TO  STC320-REQ-NO.
084000     MOVE ITM-TAX-CODE            TO  STC320-TAX-CODE.
084100
084200     IF DE5-CODE = "NC"
084300         NEXT SENTENCE
084400     ELSE
084500         IF ITM-UM = STR-UM
084600             MOVE ITM-QTY-ORD     TO  ITM-QTY-ORD
084700         ELSE
084800         IF ITM-UM = STR-UM1
084900             MULTIPLY ITM-QTY-ORD BY  STR-UM1-CF
085000                                 GIVING ITM-QTY-ORD ROUNDED
085100         ELSE
085200         IF ITM-UM = STR-UM2
085300             MULTIPLY ITM-QTY-ORD BY  STR-UM2-CF
085400                                 GIVING ITM-QTY-ORD ROUNDED
085500         ELSE
085600             MOVE ZEROS           TO  ITM-QTY-ORD.
085700
085800     IF DE5-CODE  = "NC"
085900         NEXT SENTENCE
086000     ELSE
086100         IF ITM-PRICE-UM = STR-UM
086200             MOVE ITM-UNIT-PRICE  TO  ITM-UNIT-PRICE
086300         ELSE
086400         IF ITM-PRICE-UM = STR-UM1
086500             DIVIDE ITM-UNIT-PRICE  BY  STR-UM1-CF
086600                                     GIVING ITM-UNIT-PRICE ROUNDED
086700         ELSE
086800         IF ITM-PRICE-UM = STR-UM2
086900             DIVIDE ITM-UNIT-PRICE  BY  STR-UM2-CF
087000                                     GIVING ITM-UNIT-PRICE ROUNDED
087100         ELSE
087200             MOVE ZEROS           TO  ITM-UNIT-PRICE.
087300
087400**** MULTIPLY ITM-QTY-ORD  BY  ITM-UNIT-PRICE
087500****                     GIVING BUDGET-AMT-SAVED ROUNDED.

           MOVE ITM-QTY-ORD      TO  SCALCBGT-QTY.
           MOVE ITM-UNIT-PRICE   TO  SCALCBGT-PRICE.
           MOVE ITM-TAX-CODE     TO  SCALCBGT-TAX-CODE.
           MOVE 0                TO  SCALCBGT-BUDGET.
           CALL "SCALCBGT"  USING  SCALCBGT-PARMS.
           MOVE SCALCBGT-BUDGET  TO  BUDGET-AMT-SAVED.

087600     MOVE BUDGET-AMT-SAVED        TO  STC320-OLD-BUDGET-AMT.
087700     MOVE ITM-CLASS               TO  STC320-SUB.
087800     MOVE ITM-SUB-DETL            TO  STC320-SUBD.
087900     MOVE ITM-ADDL-DATA           TO  STC320-ADDTL-DATA.
088000     MOVE PO-BUDGET-NUMBER        TO  STC320-BUDGET-NO.
088100     MOVE PO-CURRENCY-CODE        TO  STC320-CUR-CODE.
088200     CALL "STC320" USING BASE,
088300                         STC320-PARMS,
088400                         STATUS-AREA,
088500                         BU-DISPLAY-MSG,
088600                         BU-DISPLAY-FLDS.
088700     IF BU-DISPLAY-MSG-1  NOT = SPACES
088800         GO TO 2-BLOWUP.
088900
089000**********************************************************
089100**   CUT A '32D' TRANSACTIONS WHICH IS THE ITEM DELETE
089200**   TRANSACTION.
089300**********************************************************
089400
089500     MOVE SPACES                    TO  BUF-DDAILYTC.
           ACCEPT DDAILYTC-DATE FROM DATE.
           ACCEPT DDAILYTC-TIME FROM TIME.
090000     MOVE COMPANY-SAVE              TO  DDAILYTC-PLT.
090100     MOVE "32D"                     TO  DDAILYTC-TC.
090200     MOVE ITM-CORP-CODE             TO  TC32D-CORP-CODE.
090300     MOVE BUILD-PO-SEARCH           TO  TC32D-PO-RLS.
090400     MOVE ITM-NUMBER                TO  TC32D-ITEM-NO.
091000
           MOVE 0 TO COND-WORD.
           WRITE DDAILYTC-REC-O FROM BUF-DDAILYTC
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
091100*A   CALL "DBPUT" USING BASE, DSET-DDAILYTC, MODE1,
091200*A        STATUS-AREA, ALL-ITEMS, BUF-DDAILYTC.
091300     IF COND-WORD NOT = 0
091400         MOVE "PUT DDAILYTC * 66-CT3" TO BU-DISPLAY-MSG
091500         GO TO 2-BLOWUP.
092100
      ***********************************************************
      **   CALL "SEDIPOLG" TO WRITE AN EDILOG RECORD IF THE
      **   ITEM DELETED AFFECTS AN EDI PURCHASE ORDER AGREEMENT
      ***********************************************************
           IF SEDIVNCK-EDI-IND = "Y"
               MOVE SPACES           TO  SEDIPOLG-PARMS
               MOVE BUILD-PO-SEARCH  TO  PO-NUMBER-EDI
               MOVE PO-VEN-CODE      TO  VENDOR-CODE-EDI
               MOVE "X"              TO  FLAG-EDI-D
               MOVE ITM-NUMBER       TO  PO-ITEM-NO-EDI
               MOVE "SDELSITM"       TO  CALLING-PGM-EDI
               CALL "SEDIPOLG" USING BASE,
                                     SEDIPOLG-PARMS,
                                     LANGUAGE-PARMS.

092200***********************************************************
092300**   CALL 'SMODBDGT' TO UPDATE THE TOTAL BUDGET AMOUNT IN
092400**   THE HEADER 'DPORECD' TO REFLECT THE DELETION OF THE
092500**   ITEM.
092600***********************************************************
092700
092800     IF STC320-BUDGET-AMT-NET-CHG = ZEROS
092900         NEXT SENTENCE
093000     ELSE
093100         MOVE BUILD-PO-SEARCH         TO SMODBDGT-PO-NUMBER
093200         MOVE STC320-BUDGET-AMT-NET-CHG
093300                                      TO SMODBDGT-BUDGET-NET-CHG
093400         MOVE "Y"                     TO SMODBDGT-GET-DPORECD-SW
093500         CALL "SMODBDGT" USING BASE,
093600                               SMODBDGT-PARMS,
093700                               BUF-DPORECD,
093800                               STATUS-AREA,
093900                               BU-DISPLAY-MSG,
094000                               BU-DISPLAY-FLDS
094100         IF BU-DISPLAY-MSG-1 NOT = SPACES
094200             GO TO 2-BLOWUP.
094300
094400**********************************************************
094500**   CALL 'SRCVDELT' TO DELETE ANY RECEIVING SLIP ITEMS
094600**   FOR THE PO ITEM THAT WAS DELETED.
094700**********************************************************
094800
094900     MOVE PO-ARG                  TO SRCVDELT-PO-NUMBER.
095000     MOVE ITM-NUMBER              TO SRCVDELT-ITEM-NUMBER.
095100     CALL "SRCVDELT" USING BASE,
095200                           SRCVDELT-PARMS,
095300                           STATUS-AREA,
095400                           BU-DISPLAY-MSG,
095500                           BU-DISPLAY-FLDS.
095600     IF BU-DISPLAY-MSG NOT = SPACES
095700         GO TO 2-BLOWUP.
096500
      **************************
      *                        *
      *  FIND ALL DRCVTRAK     *
      *  RECORDS FOR THE ITEM  *
      *  AND DELETE THEM       *
      *                        *
      **************************

           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DRCVTRAK-REC-O.
           MOVE DE5-ITEM TO ITEMNO OF DRCVTRAK-REC-O.
           MOVE ZEROS TO SEQNO OF DRCVTRAK-REC-O.
           START DRCVTRAK-O KEY NOT < EXTERNALLY-DESCRIBED-KEY.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 66-UNLOCK-DRCVTRAK
               ELSE
                   MOVE "FIND DRCVTRAK * 66-FD" TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP.

       66-GET-DRCVTRAK.
           MOVE 0 TO COND-WORD.
           READ DRCVTRAK-O NEXT INTO BUF-DRCVTRAK.
           IF FILE-STATUS = "00"
              IF RCVTRAK-PO-RCV-NO NOT = PO-ARG OR
                 RCVTRAK-ITEM-NUMBER NOT = DE5-ITEM
                    MOVE "10" TO FILE-STATUS.
           IF FILE-STATUS = "00"
               DELETE DRCVTRAK-O
               IF FILE-STATUS NOT = "00"
                 MOVE "DELETE DRCVTRAK * 66-GD" TO BU-DISPLAY-MSG
                 GO TO 2-BLOWUP
               ELSE
                 GO TO 66-GET-DRCVTRAK
           ELSE
               IF FILE-STATUS = "10" OR "14" OR "46"
                    NEXT SENTENCE
               ELSE
                  MOVE "GET DRCVTRAK * 66-GD" TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP.

       66-UNLOCK-DRCVTRAK.
      *------ DO A START ON DRCVTRAK TO FREE UP LOCKS
           MOVE HIGH-VALUES TO PORCVNO OF DRCVTRAK-REC-O
                               ITEMNO OF DRCVTRAK-REC-O
                               SEQNO OF DRCVTRAK-REC-O.
           START DRCVTRAK-O KEY > EXTERNALLY-DESCRIBED-KEY
               INVALID KEY MOVE "00" TO FILE-STATUS.

096600     GO TO 66-DELETE-ITEM.
096700
096800 66-DI-X.
096900     EXIT.
097100
097200
097300**********************************************
097400*                                            *
097500*  THIS ROUTINES SEARCHES FOR A REQ WITH     *
097600*  THE SPECIFIED ITEM ON IT BY USING         *
097700*  DREQD TO SEE IF THE PO NUMBER AND ITEM    *
097800*  NUMBER ARE A MATCH                        *
097900*                                            *
098000**********************************************
098100
098200 661-CHECK-FOR-REQ.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DREQD-REC-I.
           START DREQD-I KEY = PORCVNO OF DREQD-REC-I
               INVALID KEY GO TO 661-CFR-X.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 661-CFR-X
               ELSE
                   MOVE 99 TO COND-WORD.
098300*A   CALL "DBFIND" USING BASE, DSET-DREQD, MODE1,
098400*A       STATUS-AREA, PO-SEARCH, PO-ARG.
098500     IF COND-WORD  NOT = 0
098600         MOVE "FIND DREQD * 661-CFR" TO BU-DISPLAY-MSG
098700         GO TO 2-BLOWUP.
098800
098900 661-GET-DREQD.
           MOVE 0 TO COND-WORD.
           READ DREQD-I NEXT INTO BUF-DREQD
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DREQD-REC-I NOT = PO-ARG
               MOVE 15 TO COND-WORD.
099000*A   CALL "DBGET" USING BASE, DSET-DREQD, MODE5,
099100*A       STATUS-AREA, ALL-ITEMS, BUF-DREQD, PO-ARG.
099200     IF COND-WORD  NOT = 0
099300         IF COND-WORD = 15
099400             GO TO 661-CFR-X
099500         ELSE
099600             MOVE "GET DREQD * 661-GD" TO BU-DISPLAY-MSG
099700             GO TO 2-BLOWUP.
099800
099900     IF DREQD-PO-ITM-NO  =  ITM-NUMBER
100000         MOVE DREQD-REQ-NUMBER  TO  DE5-REQ-NO
100100     ELSE
100200         GO TO 661-GET-DREQD.
100300
100400 661-CFR-X.
100500     EXIT.
100600
100700***********************************************
100800*                                             *
100900*  THIS ROUTINE REMOVES THE LINK BETWEEN THE  *
101000*  PO AND THE REQ. NUMBER SINCE THE ITEM IS   *
101100*  DELETED FROM THE P.O.                      *
101200*                                             *
101300***********************************************
101400
101500 662-MODIFY-REQ.
101600     MOVE DE5-REQ-NO       TO  REQ-ARG.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DREQD-REC-O.
           START DREQD-O KEY = REQNO OF DREQD-REC-O
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
101700*A   CALL "DBFIND" USING BASE, DSET-DREQD, MODE1,
101800*A       STATUS-AREA, REQ-SEARCH, REQ-ARG.
101900     IF COND-WORD NOT = 0
102000         MOVE "FIND DREQD * 662-MR" TO BU-DISPLAY-MSG
102100         GO TO 2-BLOWUP.
102200
           MOVE 0 TO COND-WORD.
           READ DREQD-O NEXT INTO BUF-DREQD
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF REQNO OF DREQD-REC-O NOT = REQ-ARG
               MOVE 15 TO COND-WORD.
103500*A   CALL "DBGET" USING BASE, DSET-DREQD, MODE5,
103600*A       STATUS-AREA, ALL-ITEMS, BUF-DREQD, REQ-ARG.
103700     IF COND-WORD NOT = 0
103800         MOVE "GET DREQD * 662-MR"  TO  BU-DISPLAY-MSG
103900         GO TO 2-BLOWUP.
104500
104600     MOVE SPACES               TO  DREQD-PO-RCV-NO,
104700                                   DREQD-VEN-CODE,
104800                                   DREQD-PO-ITM-NO.
           REWRITE DREQD-REC-O FROM BUF-DREQD
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "REWRITE DREQD *662-MR" TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.
105400
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF MREQ-REC-O.
           READ MREQ-O INTO BUF-MREQ
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
105500*A   CALL "DBGET" USING BASE, DSET-MREQ, MODE7, STATUS-AREA,
105600*A       ALL-ITEMS, BUF-MREQ, REQ-ARG.
105700     IF COND-WORD NOT =  0
105800         MOVE "GET MREQ * 662-GM" TO BU-DISPLAY-MSG
105900         GO TO 2-BLOWUP.
106000     MOVE SPACES   TO  REQ-PURCH-RELEASE.
106100     MOVE "X "     TO  REQ-RELEASE-STAT.
           MOVE 0 TO COND-WORD.
           REWRITE MREQ-REC-O FROM BUF-MREQ
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
106200*A   CALL "DBUPDATE" USING BASE, DSET-MREQ, MODE1,
106300*A       STATUS-AREA, ALL-ITEMS, BUF-MREQ.
106400     IF COND-WORD NOT = 0
106500         MOVE "UPDATE MREQ * 662-GM" TO BU-DISPLAY-MSG
106600         GO TO 2-BLOWUP.
107200
107300 662-MR-X.
107400     EXIT.

       663-CHECK-FOR-INVOICES.
           MOVE "N" TO INVOICE-FOUND-SW.
           MOVE ITM-PO-RCV-NO TO PORCVNO OF DINVRCD-REC.
           START DINVRCD KEY = PORCVNO OF DINVRCD-REC
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00" GO TO 663-CFI-X.
       663-CFI-LOOP1.
           READ DINVRCD NEXT INTO BUF-DINVRCD
               AT END    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00" GO TO 663-CFI-X.
           IF INV-PO-RCV-NO NOT = ITM-PO-RCV-NO
               GO TO 663-CFI-X.
           MOVE INV-REG-NO-9 TO REGISTERNO OF DINVITM-REC.
           MOVE ITM-NUMBER   TO ITEMNO OF DINVITM-REC.
           START DINVITM KEY = REGISTERNO OF DINVITM-REC
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00" GO TO 663-CFI-X.
       663-CFI-LOOP2.
           READ DINVITM NEXT INTO BUF-DINVITM
               AT END    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00" GO TO 663-CFI-X.
           IF INVITM-REG-NO NOT = INV-REG-NO-9 GO TO 663-CFI-LOOP1.
           IF INVITM-ITEM-NO NOT = ITM-NUMBER GO TO 663-CFI-LOOP2.
           MOVE "Y" TO INVOICE-FOUND-SW.
       663-CFI-X.
           EXIT.

       COPY DISPCALL IN COPYLIB.
107500
107600 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
109200 999-CATREAD-EXIT.
109300     EXIT.
