000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.     SDSCINQ.
000400 AUTHOR.         DAVID A. PLUM, JR.
000500 DATE-WRITTEN.   MAY 1985.
000600 DATE-COMPILED.
000700 INSTALLATION.   THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
000800*REMARKS.
000900**************************************************************
001000*D  S D S C I N Q      DESCRIPTION INQUIRY SUBPROGRAM        *
001100*D                                                           *
001200*   THIS SUBPROGRAM IS CALLED BY:                            *
001300*       1) TDSCINQM - DESCRIPTION INQUIRY MAIN PROGRAM       *
001400*       2) TDSCMAIN - DESCRIPTION MAIN PROGRAM               *
001500*                                                            *
001600*   SUBPROGRAMS CALLED:                                      *
001700*       1) TMTLSTAT - MATERIAL STATUS BY CODE SUBPROGRAM     *
001800*       2) SINQMFR  - INQUIRY BY MANUFACTURER OR KEYWORD/MOD *
001900*       3) TBLOWUP  - BLOWUP SUBPROGRAM                      *
002000*                                                            *
002100**************************************************************
002200*                                                            *
002300*D  THIS SUBPROGRAM PERFORMS THE FOLLOWING FUNCTIONS:        *
002400*D                                                           *
002500*D    1) MATERIAL STATUS BY STORES CODE USING "TMTLSTAT"     *
002600*D    2) INQUIRY BY KEYWORD/MODIFIER USING "SINQKWM"         *
002700*D    3) INQUIRY BY MANUFACTURER USING "SINQMFR"             *
002800*                                                            *
002900*        FOR INFORMATION ON ANY OF THE FIRST THREE           *
003000*     FUNCTIONS SEE THE APPROPRIATE SUBPROGRAM.              *
003100*                                                            *
003200**************************************************************
003300*               P R O G R A M    C H A N G E S               *
003400*                                                            *
003500*   09/19/85  ADDED CALLS TO FINDJCW, NLAPPEND, CATOPEN, AND *
003600*             CATCLOSE IN ORDER TO ACCOMODATE THE NATIVE     *
003700*             LANGUAGE SUPPORT FACILITY.  ADDED LINKAGES AND *
003800*             ALSO MADE THE CHANGE TO THE FORMFILE NAMES.    *
003900*                                    PD RAGLOW               *
004000*                                                            *
004100*   09/25/85  REPLACED CALLS TO THE SUBPROGRAM TRSTRMFR      *
004200*             WITH CALLS TO TRFMTMFR.  MANUFACTURER NAMES    *
004300*             ARE NO LONGER LIMITED TO ONLY 6 WORDS.         *
004400*                                    D.A. PLUM               *
004500*                                                            *
004600*   03/25/86  CHANGED CALL TO "TRFMTMFR" TO READ "CRFMTMFR"  *
004700*             ALSO CHANGED CALLS TO "TINQKWM" AND "TINQMFR"  *
004800*             TO READ "SINQKWM" AND "SINQMFR".  THESE        *
004900*             CHANGES REFLECT OUR NEW NAMING CONVENTIONS.    *
005000*             ALSO ADDED MPLTINFO-PARMS AS A PARAMETER       *
005100*             PASSED TO THIS SUBPROGRAM (AND ON TO SINQKWM   *
005200*             AND SINQMFR) FROM THE CALLING PROGRAM.         *
005300*                                  D.A. PLUM                 *
005400*                                                            *
005500*   04/17/86  REVISED LOGIC WITHIN THE INQUIRY BY MFR AND    *
005600*             PART NUMBER TO PROVIDE THE USER WITH A CHOICE  *
005700*             OF VIEWING EITHER PRIMARY OR SECONDARY         *
005800*             LANGUAGE CODE DESCRIPTIONS.                    *
005900*                                  D.A. PLUM                 *
006000*                                                            *
006100*   08/26/86  REVISED LOGIC WITHIN THE INQUIRY BY MFR AND    *
006200*             PART NUMBER TO HAVE THE PROGRAM DISPLAY A      *
006300*             MESSAGE ON THE USER'S SCREEN WHEN THE NUMBER   *
006400*             OF ENTRIES FOUND EXCEEDS THE SIZE OF THE       *
006500*             SAVE-CODE-TBL INSTEAD OF BLOWING UP.  THE      *
006600*             POSSIBILITY OF EXCEEDING THE TABLE SIZE HAS    *
006700*             BEEN INCREASED SINCE "SPACES" HAS BECOME A     *
006800*             VALID PART NUMBER.                             *
006900*                                  D.A. PLUM.                *
007000*                                                            *
      *   11/21/86  ELIMINATED ALL FORMFILE REFERENCES FROM THIS   *
      *             PROGRAM.  THIS PROGRAM AND THE SUBPROGRAM      *
      *             WHICH IT CALLS STAY WITHIN THE FORMFILE WHICH  *
      *             IS ALREADY OPEN WHEN THIS SUBPROGRAM IS CALLED.*
      *                                  D.A. PLUM.                *
      *                                                            *
      **************************************************************
      *C  11/23/1992       DAVE PLUM        REQUEST #6316
      *C  REVISED THE DEFINITION OF THE WORKING-STORAGE VARIABLE
      *C  SINQMFR-PARMS TO INCLUDE A TABLE OF RETURN CODES.  THIS
      *C  WILL ALLOW THIS PROGRAM TO MATCH THE CALLED PROGRAM,
      *C  SINQMFR.
      *C
      *C  12/03/1992       DAVE PLUM        REQUEST #6316
      *C  REVISED TO INCLUDE THE COPYLIB MEMBER "SINQMFR".  THIS
      *C  SHOULD HELP CLEAR UP PROBLEMS WITH THE PARMS IN THIS
      *C  PGM MATCHING THOSE IN THE CALLED PGM "SINQMGR".
      *C
      *C  07APR1994        DAVE PLUM        REQUEST #6490
      *C  REMOVED ALL REFERENCES TO "C O P Y D B" TYPE COPYLIBS.
      *C---------------------------------------------------------------
DCR01 *C MAR 10, 2005  D.RAUCH       DCR01    REQUEST# 2005-78515
DCR01 *C    DISPLAY FILE PROCESSING CHANGED FROM USING ZCSISINQ
DCR01 *C    NEW DISPLAY FILE ZDSCINQ  CREATED - FORMATS COPIED
DCR01 *C    FROM ZCSISINQ.
DCR01 *****************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  HP-3000.
       OBJECT-COMPUTER.  HP-3000.
       COPY SPECIALN IN COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZSDSCINQ-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DISPLAY-STATUS
               CONTROL-AREA IS WS-CONTROL.

       DATA DIVISION.
       FILE SECTION.
      ***IBM ONLY***
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
*******01  DISPLAY-REC            PIC X(1500).  *REPLACED 16FEB93 DAP*
       01  DISPLAY-REC                 PIC X(2000).

       WORKING-STORAGE SECTION.

       01  HANDLE-BLOWUP-FLAG      PIC X.
       01  DE-FIELDS-1.
           05  DE-COMMAND-LINE-1   PIC X(79).
           05  DE-MESSAGE-LINE-1   PIC X(79).

       COPY CATREAD    IN COPYLIB.
       COPY HMSGBUF    IN COPYLIB.
       COPY FUNCTDEF   IN COPYLIB.
       COPY DISPDAT2   IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.
       COPY TSHWRDFM   IN COPYLIB.
       COPY DBSTAT     IN COPYLIB.
008800
010900*************************************************************
011000*************************************************************
011100**                                                         **
011200**                  SUBPROGRAM AREAS                       **
011300**                                                         **
011400*************************************************************
011500*************************************************************
011600
011700***** NOTE THAT "TMTLSTAT" ALSO USES PASSED-SPOOL-PRT, *****
011800***** BASE, VIEW-COMAREA, AND LANGUAGE-PARMS AS        *****
011900***** PARAMETERS IN ADDITION TO THOSE LISTED BELOW.    *****
012000
012100 01  PASS-SPOOL-PRT                PIC S9(2) COMP VALUE 0.
012200 01  TMTLSTAT-PARAMETERS.
012300     05  TMTLSTAT-COMPANY          PIC X(4)  VALUE SPACES.
012400     05  TMTLSTAT-CODE             PIC X(7).
012500
      *##############################################################
      *###### REPLACED THE FOLLOWING DEFINITION OF SINQMFR-PARMS    #
      *###### WITH THE COPYLIB MEMBER NAMED SINQMFR.  12/03/1992    #
      *######                                                       #
      *--- HAD TO ADD THE 05 FOR "RETURN-CODES" TO THE DEFINITION   #
      *--- OF SINQMFR-PARMS BELLOW.   11/23/1992  DAVE PLUM         #
      *                                                             #
012600*01  SINQMFR-PARMS.                                           #
012700*    05  SINQMFR-MFR-KWM-FLAG      PIC X(1).                  #
      *    05  RETURN-CODES.                                        #
      *        10  RET-CODE OCCURS 15 TIMES PIC X(7).               #
012800*    05  FILLER                    PIC X(15).                 #
      *##############################################################
012900
       COPY SINQMFR    IN COPYLIB.

013000 COPY TBLOWUP    IN COPYLIB.
013200
013300*************************************************************
013400*************************************************************
013500**                                                         **
013600**           L I N K A G E    S E C T I O N                **
013700**                                                         **
013800*************************************************************
013900*************************************************************
014000
014100 LINKAGE SECTION.
014200
014300 01  BASE                          PIC X(10).
014400
014500*************************************************************
014600*************************************************************
014700**                                                         **
014800**                VIEW COMMUNICATION AREA                  **
014900**                                                         **
015000**      ------ ALSO SEE WORKING STORAGE SECTION ------     **
015100**                                                         **
015200*************************************************************
015300*************************************************************
015400
015500 COPY VCOMLINK   IN COPYLIB.
015600 COPY LANGSUB    IN COPYLIB.
015700
015800 01  MPLTINFO-PARMS.
015900     05  MPLTINFO-PLANT-CODE       PIC X(3).
016000     05  MPLTINFO-DDESC-LANG       PIC X(3).
016100     05  MPLTINFO-DDESC2-LANG      PIC X(3).
016200
016300*************************************************************
016400**#########################################################**
016500*************************************************************
016600**                                                         **
016700**           P R O C E D U R E   D I V I S I O N           **
016800**                                                         **
016900*************************************************************
017000**#########################################################**
017100*************************************************************
017200
017300 PROCEDURE DIVISION USING BASE,
017400                          VIEW-COMAREA,
017500                          LANGUAGE-PARMS
017600                          MPLTINFO-PARMS.
017700
017800 INQUIRY SECTION.
017900
018000 BEGIN-HERE.
018100     PERFORM 1-HSK.
018200     PERFORM 6-MAIN THRU 6-MAIN-X.
           PERFORM 9999-CLOSES.
018300     GOBACK.
018400
018500 1-HSK.
018800     MOVE MPLTINFO-PLANT-CODE      TO   TMTLSTAT-COMPANY.
           PERFORM 9999-OPENS.
018900
019000 2100-BLOWUP.
018600     MOVE "SDSCINQ"                TO   BU-PGM-NAME.
019100     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
019200           VIEW-COMAREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
019300           BU-DISPLAY-AREA.
019400
      *********************************************************
      *                      6 - M A I N                      *
      *********************************************************
       6-MAIN.
           MOVE "INQMENU" TO VIEW-NFNAME.

       6-PUT-WINDOW.
       6-SHOW-FORM.
      *----- f1,f2,f3, APPLICATION, f4 REFRESH,f5 PRT, f6,f7 INVALID, f8 EXIT
           MOVE 1                        TO   SRF-KEYSET.
           MOVE "I" TO SRF-FKEY (6), SRF-FKEY (7).
           PERFORM 9999-DO-SCREEN-1.

           IF VIEW-LASTKEY = EXIT-PROGRAM
               GO TO 6-MAIN-X.

       6-PERFORM-SELECTION.
           IF VIEW-LASTKEY = F1-KEY
               MOVE SPACES TO TMTLSTAT-CODE
               CALL "TMTLSTAT" USING BASE,
                                     VIEW-COMAREA,
                                     TMTLSTAT-COMPANY,
023800                               PASS-SPOOL-PRT,
023900                               TMTLSTAT-CODE,
024000                               LANGUAGE-PARMS
024100     ELSE
024200     IF VIEW-LASTKEY = F2-KEY
024300         MOVE "K"                  TO   SINQMFR-MFR-KWM-FLAG
024400         CALL "SINQMFR" USING BASE,
024500                              VIEW-COMAREA,
024600                              LANGUAGE-PARMS,
024700                              MPLTINFO-PARMS,
024800                              SINQMFR-PARMS
024900     ELSE
024200     IF VIEW-LASTKEY = HP-F3-KEY
025100         MOVE "M"                  TO   SINQMFR-MFR-KWM-FLAG
025200         CALL "SINQMFR" USING BASE,
025300                              VIEW-COMAREA,
025400                              LANGUAGE-PARMS,
025500                              MPLTINFO-PARMS,
025600                              SINQMFR-PARMS.
025700     GO TO 6-MAIN.
025800
025900 6-MAIN-X.
026000     EXIT.

       9999-OPENS.
           OPEN I-O DISPLAY-FILE.

       9999-CLOSES.
           CLOSE DISPLAY-FILE.

       999-CATREAD.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
           IF MESSAGE-BUFFER-1  = SPACES
               MOVE "* ERROR ON THIS FIELD *" TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.

       COPY SCRNCALL OF COPYLIB.
       COPY SCRNCL1  OF COPYLIB.
