000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.     SEAAPPIQ.
000400 AUTHOR.         C HILLES/JIM COFFMAN (MAINTAINER).
000500 DATE-WRITTEN.   11/5/87.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*D   ELECTRONIC APPROVAL SYSTEM - APPROVAL STATUS INQUIRY.
001100*D   THIS SHOWS FOR ANY REQ ALL THE APPROVALS IT IS WAITING FOR.
      *C
      *C   05/05/94  JE COFFMAN  WRITTEN REQUEST 94-001/SLS REQ 6487
      *C     ADDED THE ABILITY TO ALLOW 'SS' STATUS REQUISITIONS
      *C     THAT HAVE THE AUTHORIZATION FLAG SET VIA MP1 TO BE
      *C     HANDLED.
      *C
      *C   10/08/2002   GEISER
      *C     ADDED THE ABILITY TO PRINT A KICKSTART REPORT TO A
      *C     PRINTER NUMBER AS SUPPLIED BY THE USER.
      *C---------------------------------------------------------------
DCR01 *C MAR 10, 2005  D.RAUCH       DCR01    REQUEST# 2005-78515
DCR01 *C    DISPLAY FILE PROCESSING CHANGED FROM USING ZCSISINQ
DCR01 *C    NEW DISPLAY FILE ZSEAAPPIQ CREATED - FORMATS COPIED
DCR01 *C    FROM ZCSISINQ.
DCR01 *****************************************************************
      *C
001200
001300 ENVIRONMENT DIVISION.
001400 CONFIGURATION SECTION.
001500 SOURCE-COMPUTER.  HP-3000.
001600 OBJECT-COMPUTER.  HP-3000.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DREQQUE-I
                  ASSIGN TO DATABASE-MCFLCS4401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT PER-PERSONNEL-I
                  ASSIGN TO DATABASE-MCFLMM0301
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DISPLAY-FILE
DCR01             ASSIGN TO WORKSTATION-ZSEAAPPIQ-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

001700
001800 DATA DIVISION.
       FILE SECTION.
       FD  DREQQUE-I
           LABEL RECORDS ARE STANDARD.
       01  DREQQUE-REC-I.
           COPY DDS-MCRPCS4400  OF MCFLCS4401.

       FD  PER-PERSONNEL-I
           LABEL RECORDS ARE STANDARD.
       01  PER-PERSONNEL-REC-I.
           COPY DDS-MCRPMM0300  OF MCFLMM0301.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC        PIC X(2000).

001900 WORKING-STORAGE SECTION.
002000
002100 77  SUB                           PIC S9(4) COMP-4 VALUE 0.
002200 77  SUB1                          PIC S9(4) COMP-4 VALUE 0.
002300 77  SUB2                          PIC S9(4) COMP-4 VALUE 0.
002400 77  SWITCH-FLAG                   PIC X(1)  VALUE SPACES.
002500 77  MORE-ENTRIES-FLAG             PIC X(1)  VALUE "N".
002600 77  FIRST-SCRN-FLAG               PIC X(1)  VALUE "Y".
002700 77  REQ-DELETED-FLAG              PIC X(1)  VALUE "N".
002800
002900**************************************************************
003000**                                                          **
003100**                S U B P R O G R A M   A R E A S           **
003200**                                                          **
003300**************************************************************
003400
003500 COPY TDATECHK   IN COPYLIB.
003600 COPY TBLOWUP    IN COPYLIB.
003700 COPY SEAUSEIQ   IN COPYLIB.
       COPY SREQPRNT   IN COPYLIB.
       COPY TLSHIFT    IN COPYLIB.
       COPY TRSHIFT    IN COPYLIB.
       01  HOLD-PRINT-FILE               PIC X(10).
       01  FILE-TYPE                     PIC X(7)  VALUE "*FILE".
       01  CHKOBJ-STATUS                 PIC X(2)  VALUE SPACES.
      *------ WS CONTROL AREA
       01  MAJOR-MINOR                   PIC XXXX.
       01  WS-CONTROL.
           05  FUNCTION-NUM              PIC XX.
               88  EXIT-KEY-F8-USED                 VALUE "08".
               88  REFRESH-KEY-F4-USED              VALUE "04".
               88  ENTER-KEY-USED                   VALUE "00".
               88  F1-KEY-USED                      VALUE "01".
               88  F2-KEY-USED                      VALUE "02".
               88  F3-KEY-USED                      VALUE "03".
               88  F4-KEY-USED                      VALUE "04".
               88  F5-KEY-USED                      VALUE "05".
               88  F6-KEY-USED                      VALUE "06".
               88  F7-KEY-USED                      VALUE "07".
               88  F8-KEY-USED                      VALUE "08".
           05  FUN-KEY REDEFINES FUNCTION-NUM  PIC XX.
           05  TERMINAL-ID               PIC X(10).
           05  FORMAT-NAME               PIC X(10).

       01  DISPLAY-STATUS                PIC X(2).

       COPY IOFEEDBACK IN COPYLIB.
       COPY CATREAD    IN COPYLIB.
003800
003900**************************************************************
004000**                                                          **
004100**                  V I E W   W O R K                       **
004200**                                                          **
004300**************************************************************
004400
004500**  SEE LINKAGE SECTION FOR VIEW-COMAREA
004600
004700 01  MESSAGE-BUFFER.
004800     05  MSG-TEXT.
               10  MESSAGE-BUFFER-1      PIC X(1)   VALUE SPACES.
               10  FILLER                PIC X(67)  VALUE SPACES.
004900     05  MSG-FLD                   PIC X(8)   VALUE SPACES.
005000     05  MSG-FLD-9 REDEFINES MSG-FLD PIC ZZZZZZZ9.
005100
005500 01  FIELD-NUMBER                  PIC S9(4) COMP-4 VALUE 1.
005600
005700 01  HELP-FORM-PREFIX              PIC X(6).
005800
005900**************************************************************
006000**                                                          **
006100**            D A T A B A S E   W O R K                     **
006200**                                                          **
006300**************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
006400
006500 COPY DBSTAT     IN COPYLIB.
006600 01  DSET-NAMES.
006700     05  DSET-DREQQUE        PIC X(16) VALUE "DREQQUE;".
006800     05  DSET-PER-PERSONNEL  PIC X(16) VALUE "PER-PERSONNEL;".
006900
007000 01  MODE-AREA.
007100     05  MODE1                     PIC S9(4)   COMP       VALUE 1.
007200     05  MODE5                     PIC S9(4)   COMP       VALUE 5.
007300     05  MODE7                     PIC S9(4)   COMP       VALUE 7.
007400
007500 01  ALL-ITEMS                     PIC X(2)  VALUE "@;".
007600 01  REQ-SEARCH                    PIC X(11) VALUE "REQ-NUMBER;".
007700 01  REQ-ARG                       PIC X(12) VALUE SPACES.
007800 01  EMPL-ARG                      PIC X(4)  VALUE SPACES.
007900
008000**************************************************************
008100**                                                          **
008200**           D A T A B A S E   B U F F E R S                **
008300**                                                          **
008400**************************************************************
008500
008600 COPY DREQQUE    IN COPYLIB.
008700 01  BUF-PER-PERSONNEL.            COPY MPERSONL IN COPYLIB.
008800
008900**************************************************************
009000**                                                          **
009100**                  S C R E E N   D A T A                   **
009200**                                                          **
009300**************************************************************
009400
009500 01  DE-FIELDS.
009600     05  V-REQ-NUMBER              PIC X(10).
009700     05  V-REQ-DATE                PIC X(8).
009800     05  V-CORP-CODE               PIC X(8).
009900     05  V-QTY-TO-ORD              PIC Z(7)9.
010000     05  V-UM                      PIC X(2).
010100     05  V-UNIT-PRICE              PIC Z(10)9V9(4).
010200     05  V-DATE-WANTED             PIC X(8).
010300     05  V-REQ-STATUS              PIC X(30).
010400     05  V-RELEASE-STATUS          PIC X(29).
010500     05  V-HOLD-STATUS             PIC X(24).
010600     05  V-PATH                    PIC ZZ9.
010700     05  V-APPROVALS-LEFT          PIC -9.
           05  V-PRINTER                 PIC X(2).
010800     05  V-RET-EMPL                PIC X(4).
010900     05  V-REASON-1                PIC X(36).
011000     05  V-REASON-2                PIC X(36).
011100     05  V-APP-LINE OCCURS 12 TIMES.
011200         10  V-LEVEL-NUM           PIC X(2).
011300         10  V-INORD-SIMEL         PIC X(1).
011400         10  V-QUEUED-DATE         PIC X(8).
011500         10  V-APPROVE-DATE        PIC X(8).
011600         10  V-EMPL                PIC X(4).
011700         10  V-EMPL-NAME           PIC X(16).
011800         10  V-Q-COMMENT           PIC X(33).
           05  DE-COMMAND-LINE           PIC X(79).
           05  DE-MESSAGE-LINE           PIC X(79).
011900
012000 01  HOLD-STATUS-MSG.
012100     10  HOLD-STAT-MSG1      PIC X(14) VALUE "HOLD STATUS : ".
012200     10  HOLD-STAT-MSG2      PIC X(10) VALUE SPACES.
012300
012400**************************************************************
012500**                                                          **
012600**            L I N K A G E   S E C T I O N                 **
012700**                                                          **
012800**************************************************************
012900
013000 LINKAGE SECTION.
013100 01  BASE                      PIC X(10).
013200 01  BASE-MMISA                PIC X(13).
013300
013400 COPY VCOMLINK   IN COPYLIB.
       COPY TSHWSUB2   IN COPYLIB.
013600 COPY LANGSUB    IN COPYLIB.
013700 COPY MREQ       IN COPYLIB.
013800 COPY DREQITM    IN COPYLIB.
013900 PROCEDURE DIVISION USING          BASE,
014000                                   BASE-MMISA,
014100                                   VIEW-COMAREA,
014200                                   SRF-COMAREA,
014300                                   LANGUAGE-PARMS,
014400                                   BUF-MREQ,
014500                                   BUF-DREQITM.
014600
014700 1-HSK.
           MOVE 0 TO SUB, SUB1, SUB2.
           MOVE SPACES TO SWITCH-FLAG.
           MOVE "N" TO MORE-ENTRIES-FLAG, REQ-DELETED-FLAG.
           MOVE "Y" TO FIRST-SCRN-FLAG.
           MOVE SPACES TO DE-FIELDS.
           MOVE ZERO TO V-QTY-TO-ORD, V-UNIT-PRICE, V-PATH,
             V-APPROVALS-LEFT.
           OPEN INPUT DREQQUE-I, PER-PERSONNEL-I.
           OPEN I-O DISPLAY-FILE.
014800     PERFORM 6000-MAIN THRU 6990-MAIN-X.
           CLOSE DREQQUE-I, PER-PERSONNEL-I, DISPLAY-FILE.
014900     GOBACK.
015000
015100 2100-BLOWUP.
015200     MOVE "SEAAPPIQ"               TO   BU-PGM-NAME.
015300     CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
015400       VIEW-COMAREA FILE-STATUS BU-DISPLAY-MSG
015500       BU-DISPLAY-FLDS.
015600
017700 4030-SETERROR.
           MOVE B"1" TO IND (99).
           MOVE B"1" TO IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE.
051300
018800 4040-CLEAR-FORM.
018900     MOVE SPACES TO MESSAGE-BUFFER.
019200     MOVE SPACES                   TO   DE-FIELDS.
019500
022100 6000-MAIN.
022200     MOVE "EAAPPINQ"               TO   VIEW-NFNAME.
022500
022600     PERFORM 7000-LOAD-SCREEN THRU 7090-LS-X.
022700     IF REQ-DELETED-FLAG = "Y"
022800         GO TO 6990-MAIN-X.
022900
023000     MOVE MREQ-NUMBER              TO   V-REQ-NUMBER.
023100     MOVE 4                        TO   DATE-MODE.
023200     MOVE REQ-DATE                 TO   DATE-VALIDATE-IN.
023300     CALL "TDATECHK" USING DATE-CHECK-AREA.
023400     MOVE DATE-SLASH-OUT           TO   V-REQ-DATE.
023500     MOVE REQITM-CORP-CODE         TO   V-CORP-CODE.
023600     MOVE REQITM-QTY-TO-ORD        TO   V-QTY-TO-ORD.
023700     MOVE REQITM-UM                TO   V-UM.
023800     MOVE REQITM-UNIT-PRICE        TO   V-UNIT-PRICE.
023900     CALL "TDATECHK" USING DATE-CHECK-AREA.
024000     MOVE REQ-DATE-WANTED          TO   DATE-VALIDATE-IN.
024100     MOVE DATE-SLASH-OUT           TO   V-DATE-WANTED.
024200     IF REQ-STATUS = "SS" OR "S"
024300*        "CODED STOREROOM ITEM"
024400         MOVE  3  TO LANG-SETNUM
024500         MOVE 162 TO LANG-MSGNUM
024600         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
024700     ELSE
024800     IF REQ-STATUS = "SN"
024900*        "CODED NON-STOREROOM ITEM"
025000         MOVE   3 TO LANG-SETNUM
025100         MOVE 163 TO LANG-MSGNUM
025200         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
025300     ELSE
025400     IF REQ-STATUS = "NM"
025500*        "NON CODED ITEM"
025600         MOVE  14 TO LANG-SETNUM
025700         MOVE 108 TO LANG-MSGNUM
025800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
025900     ELSE
026000     IF REQ-STATUS = "NI"
026100*        "NON-CODED INTERNATIONAL REQ"
026200         MOVE  14 TO LANG-SETNUM
026300         MOVE 109 TO LANG-MSGNUM
026400         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
026500     ELSE
026600        MOVE SPACES                TO   MESSAGE-BUFFER.
026700
026800     MOVE MESSAGE-BUFFER           TO   V-REQ-STATUS.
026900
130000     IF REQ-RELEASE-STAT = "  "
130100         IF REQ-STATUS = "SS" OR "S"
                   IF REQ-AUTH-CODE-FLAG = "X"
                       IF REQ-APPROVALS-LEFT = "  "
                           MOVE 0 TO REQ-APPROVALS-LEFT-9
                       END-IF
                       IF REQ-APPROVALS-LEFT-9 > 0
130700*                "AWAITING APPROVALS"
130800                     MOVE   1 TO LANG-SETNUM
130900                     MOVE  30 TO LANG-MSGNUM
131000                     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       ELSE
130200*                "IN MATERIALS CONTROL"
130300                 MOVE   9 TO LANG-SETNUM
130400                 MOVE  85 TO LANG-MSGNUM
130500                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   ELSE
130200*            "IN MATERIALS CONTROL"
130300             MOVE   9 TO LANG-SETNUM
130400             MOVE  85 TO LANG-MSGNUM
130500             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
130600         ELSE
130700*        "AWAITING APPROVALS"
130800         MOVE   1 TO LANG-SETNUM
130900         MOVE  30 TO LANG-MSGNUM
131000         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
131100     ELSE
131200     IF REQ-RELEASE-STAT = "X "
131300*        "IN PURCHASING"
131400         MOVE   9 TO LANG-SETNUM
131500         MOVE  86 TO LANG-MSGNUM
131600         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
131700     ELSE
131800     IF REQ-RELEASE-STAT = "XX"
131900*        "ASSIGNED TO A PURCHASE ORDER"
132000         MOVE   1 TO LANG-SETNUM
132100         MOVE  29 TO LANG-MSGNUM
132200         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
132300     ELSE
132400     IF REQ-RELEASE-STAT = "U"
132500*        "REQ CURRENTLY BEING PROCESSED"
132600         MOVE  19 TO LANG-SETNUM
132700         MOVE  37 TO LANG-MSGNUM
132800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
132900     ELSE
133000        MOVE SPACES                TO   MESSAGE-BUFFER.
030100
030200     MOVE MESSAGE-BUFFER           TO   V-RELEASE-STATUS.
030300
030400     IF REQ-HOLD-STATUS = SPACES
030500         MOVE SPACES               TO   V-HOLD-STATUS
030600     ELSE
030700         MOVE REQ-HOLD-STATUS      TO   HOLD-STAT-MSG2
030800         MOVE HOLD-STATUS-MSG      TO   V-HOLD-STATUS.
030900
031000     IF REQ-PATH NUMERIC
031100         MOVE REQ-PATH             TO   V-PATH
031200     ELSE
031300         MOVE ZERO                 TO   V-PATH.
031400     IF REQ-APPROVALS-LEFT NUMERIC
031500         MOVE REQ-APPROVALS-LEFT   TO   V-APPROVALS-LEFT
031600     ELSE
031700         MOVE ZERO                 TO   V-APPROVALS-LEFT.

           IF V-PRINTER = SPACES
               MOVE "00"                 TO   V-PRINTER.
           MOVE B"1"                     TO   IND (50).

           IF REQ-RET-EMPL < " "
               MOVE SPACES               TO   V-RET-EMPL
           ELSE
031800         MOVE REQ-RET-EMPL         TO   V-RET-EMPL.
031900
032000 6010-PUTBUFFER.
032500     MOVE 2                        TO   SRF-KEYSET.
032600     MOVE "N"                      TO   SRF-ENTER-FLAG.
       6012-SHOWFORM.
           MOVE DE-FIELDS TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC TO DE-FIELDS.
      *    IF MESSAGE-BUFFER-1 NOT = SPACES
      *        PERFORM 4030-SETERROR
      *        GO TO 6012-SHOWFORM.

033300     IF VIEW-LASTKEY = 3
033400         GO TO 6990-MAIN-X.
033500
033600     IF VIEW-LASTKEY = 1
               MOVE "ZCSISINQ"           TO   VIEW-CFNAME
033700         MOVE "HAPPIQ"             TO   HELP-FORM-PREFIX
033800         CALL "SHELPSCR" USING VIEW-COMAREA, LANGUAGE-PARMS,
033900           HELP-FORM-PREFIX
034000         MOVE "EAAPPINQ"           TO   VIEW-NFNAME
034200         GO TO 6010-PUTBUFFER
034300     ELSE
034400     IF VIEW-LASTKEY = 2
034500         CALL "SEAPHIQ2" USING BASE, BASE-MMISA, VIEW-COMAREA,
034600           SRF-COMAREA, LANGUAGE-PARMS
034700         MOVE "EAAPPINQ"           TO   VIEW-NFNAME
034900         GO TO 6010-PUTBUFFER
035000     ELSE
035100     IF VIEW-LASTKEY = 8
035200         CALL "SEAPHIQ1" USING BASE, BASE-MMISA, VIEW-COMAREA,
035300           SRF-COMAREA, LANGUAGE-PARMS
035400         GO TO 6000-MAIN
035500     ELSE
           IF VIEW-LASTKEY = 5
               PERFORM 6500-CALL-KICKSTART
               GO TO 6010-PUTBUFFER
           ELSE
035600     IF VIEW-LASTKEY = 6
035700         CALL "SEAUSEIQ" USING BASE, BASE-MMISA, VIEW-COMAREA,
035800           SRF-COMAREA, LANGUAGE-PARMS, EAUSE-PARMS
035900         MOVE "EAAPPINQ"           TO   VIEW-NFNAME
036100         GO TO 6010-PUTBUFFER
036200     ELSE
036300     IF VIEW-LASTKEY = 7
036400         CALL "SEALEVIQ" USING BASE, BASE-MMISA, VIEW-COMAREA,
036500           SRF-COMAREA, LANGUAGE-PARMS
036600         MOVE "EAAPPINQ"           TO   VIEW-NFNAME
036800         GO TO 6010-PUTBUFFER.
036900
037000 6990-MAIN-X.
037100     EXIT.
037200
       6500-CALL-KICKSTART.
      *------ VALIDATE THAT THE PRINTER ENTERED BY THE USER EXISTS
      *------ AS AN FILE OBJECT STARTING WITH MCPRT AT THE PLANT.
           MOVE V-PRINTER                TO  LS-SHIFT-FLD.
           CALL "TLSHIFT" USING LS-RET-CODE, LS-SHIFT-FLD.
           MOVE LS-SHIFT-FLD             TO  RS-SHIFT-FLD.
           CALL "TRSHIFT" USING LS-RET-CODE, RS-SHIFT-FLD.
           MOVE SPACES                   TO  HOLD-PRINT-FILE
                                             CHKOBJ-STATUS.
           STRING "MCPRT" DELIMITED BY SIZE,
                  RS-SHIFT-FLD-7-8 DELIMITED BY SPACES,
             INTO HOLD-PRINT-FILE.
           CALL "CCHKOBJ3" USING HOLD-PRINT-FILE, FILE-TYPE,
                                 CHKOBJ-STATUS.
           IF CHKOBJ-STATUS NOT = "00"
      *        "I91: INVALID PRTR: USE ANOTHER OR 'LP' FOR LINE PRTR"
               MOVE 9                    TO  LANG-SETNUM
               MOVE 91                   TO  LANG-MSGNUM
               MOVE 50                   TO  FIELD-NUMBER
               PERFORM 999-CATREAD
               PERFORM 4030-SETERROR
               GO TO 6012-SHOWFORM.

           MOVE MREQ-NUMBER              TO   REQ-NUMBER.
           MOVE V-REASON-1               TO   REQ-FREE-VERB-LINE (1).
           MOVE V-REASON-2               TO   REQ-FREE-VERB-LINE (2).
           MOVE RS-SHIFT-FLD-7-8         TO   REQ-SPOOL-PRT.
           CALL "CEAKICK" USING BASE, BASE-MMISA, SREQPRNT-PARMS,
                                LANGUAGE-PARMS, STATUS-AREA,
                                BU-DISPLAY-MSG, BU-DISPLAY-FLDS,
                                VIEW-COMAREA.
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               PERFORM 2100-BLOWUP.

037300 7000-LOAD-SCREEN.
037400     PERFORM 7100-DBFIND.
037500     IF NOT GOOD-CALL
037600         MOVE "Y"                  TO   REQ-DELETED-FLAG
037700         GO TO 7090-LS-X.
037800
037900     MOVE ZERO                     TO   SUB.
038000     MOVE "Y"                      TO   MORE-ENTRIES-FLAG.
038100
038200 7010-GET-DREQQUE-LOOP.
038300*    CALL "DBGET" USING BASE, DSET-DREQQUE, MODE5, STATUS-AREA,
038400*      ALL-ITEMS, BUF-DREQQUE, MREQ-NUMBER.
           MOVE 0 TO COND-WORD.
           READ DREQQUE-I NEXT INTO BUF-DREQQUE
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF REQNO OF DREQQUE-REC-I NOT = MREQ-NUMBER
               MOVE 15 TO COND-WORD.
038500     IF END-OF-CHAIN
038600         MOVE "N"                  TO   MORE-ENTRIES-FLAG
038700         GO TO 7090-LS-X
038800     ELSE
038900     IF NOT GOOD-CALL
039000         MOVE "DBGET ERR DREQQUE 7010-SGL" TO BU-DISPLAY-MSG
039100         PERFORM 2100-BLOWUP.
039200
039300     ADD 1                         TO   SUB.
039400     IF SUB > 12
039500         GO TO 7090-LS-X.
039600
039700     MOVE DRQQ-LEVEL-NUM           TO   V-LEVEL-NUM (SUB).
039800     MOVE DRQQ-INORD-SIMEL         TO   V-INORD-SIMEL (SUB).
039900     MOVE 4                        TO   DATE-MODE.
040000     MOVE DRQQ-APPROVE-DATE        TO   DATE-VALIDATE-IN.
040100     CALL "TDATECHK" USING DATE-CHECK-AREA.
040200     MOVE DATE-SLASH-OUT           TO   V-APPROVE-DATE (SUB).
040300     MOVE DRQQ-QUEUED-DATE         TO   DATE-VALIDATE-IN.
040400     CALL "TDATECHK" USING DATE-CHECK-AREA.
040500     MOVE DATE-SLASH-OUT           TO   V-QUEUED-DATE (SUB).
040600     MOVE DRQQ-EMPL-QUEUED         TO   V-EMPL (SUB).
040700     PERFORM 7200-GET-EMPLOYEE-MMIS.
040800     MOVE PER-EMP-NAME             TO   V-EMPL-NAME (SUB).
040900     IF DRQQ-COMMENT-1 > SPACES
041000         MOVE DRQQ-COMMENT-1       TO   V-Q-COMMENT (SUB)
041100     ELSE
041200         MOVE SPACES               TO   V-Q-COMMENT (SUB).
041300     IF DRQQ-LEVEL-NUM = "00"
041400         IF DRQQ-COMMENT-1 > SPACES
041500             MOVE DRQQ-COMMENT-1   TO   V-REASON-1
041600         ELSE
041700             MOVE SPACES           TO   V-REASON-1.
041800
041900     IF DRQQ-LEVEL-NUM = "00"
042000         IF DRQQ-COMMENT-2 > SPACES
042100             MOVE DRQQ-COMMENT-2   TO   V-REASON-2
042200         ELSE
042300             MOVE SPACES           TO   V-REASON-2.
042400
042500     GO TO 7010-GET-DREQQUE-LOOP.
042600
042700 7090-LS-X.
042800     EXIT.
042900
043000 7100-DBFIND.
043100*------ IN CASE REQ FROM REQ INQUIRY WAS DELETED BY SOMEONE ELSE,
043200*------ EXIT FROM THE INQUIRY WITHOUT DOING ANYTHING
043300*    CALL "DBFIND" USING BASE, DSET-DREQQUE, MODE1, STATUS-AREA,
043400*      REQ-SEARCH, MREQ-NUMBER.
           MOVE 0 TO COND-WORD.
           MOVE MREQ-NUMBER TO REQNO OF DREQQUE-REC-I.
           START DREQQUE-I KEY = REQNO OF DREQQUE-REC-I
               INVALID KEY MOVE 0 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 0 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
043500     IF NO-ENTRY
043600         NEXT SENTENCE
043700     ELSE
043800     IF NOT GOOD-CALL
043900         MOVE "DBFIND ERR DREQQUE 7100-D" TO BU-DISPLAY-MSG
044000         PERFORM 2100-BLOWUP.
044100
044200     MOVE "Y"                      TO   FIRST-SCRN-FLAG.
044300
044400 7200-GET-EMPLOYEE-MMIS.
044500     MOVE DRQQ-EMPL-QUEUED         TO   EMPL-ARG.
044600*    CALL "DBGET" USING BASE-MMISA, DSET-PER-PERSONNEL, MODE7,
044700*      STATUS-AREA, ALL-ITEMS, BUF-PER-PERSONNEL, EMPL-ARG.
           MOVE EMPL-ARG TO PERCCNUM OF PER-PERSONNEL-REC-I.
           READ PER-PERSONNEL-I INTO BUF-PER-PERSONNEL
               INVALID KEY MOVE 17 TO COND-WORD.
044800     IF FILE-STATUS-1 = "2"
044900         MOVE SPACES               TO   PER-EMP-NAME
045000     ELSE
045100     IF FILE-STATUS NOT = "00"
045200         MOVE "DBGET ERR PERSONNEL 7100-GEM" TO BU-DISPLAY-MSG
045300         PERFORM 2100-BLOWUP.
045400
       COPY DISPCALL IN COPYLIB.

045500 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
047100 999-CATREAD-EXIT.
047200     EXIT.
