000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          SEALEVIQ.
000400 AUTHOR.              C HILLES/JIM COFFMAN (MAINTAINER).
000500 DATE-WRITTEN.        7/1/87.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*D   ELECTRONIC APPROVAL SYSTEM - APPROVAL LEVEL INQUIRY.

      *****************************************************************
      **          M O D I F I C A T I O N    H I S T O R Y
      *****************************************************************
DCR01 *  MAR 10, 2005  D.RAUCH       DCR01    REQUEST# 2005-78515
DCR01 *     DISPLAY FILE PROCESSING CHANGED FROM USING ZCSISINQ
DCR01 *     NEW DISPLAY FILE ZSEALEVIQ CREATED - FORMATS COPIED
DCR01 *     FROM ZCSISINQ.
      *----------------------------------------------------------------
DCR01 *  MMM DD, CCYY  XXNAMEXX      XXX01    REQUEST# 2005-XXXXX
DCR01 *****************************************************************

001300 ENVIRONMENT DIVISION.
001400 CONFIGURATION SECTION.
001500 SOURCE-COMPUTER.  HP-3000.
001600 OBJECT-COMPUTER.  HP-3000.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
001800 INPUT-OUTPUT SECTION.
001900 FILE-CONTROL.
002000     SELECT SORT-FILE ASSIGN TO DISK-SORT.
002100     SELECT LEV-FILE ASSIGN TO DISK-DEALEVIQ.
           SELECT MLEVEL-I
                  ASSIGN TO DATABASE-MCFLCS4101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT PER-PERSONNEL-I
                  ASSIGN TO DATABASE-MCFLMM0301
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZSEALEVIQ-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.
001700
002200
002300 DATA DIVISION.
002400 FILE SECTION.
002500 FD  LEV-FILE.
002600 01  LEV-REC.
002700     05  LV-LEVEL-NUM              PIC X(2).
002800     05  LV-LEVEL-DESC             PIC X(36).
002900     05  LV-ACTIVE-EMPL            PIC X(4).
003000
003100 SD  SORT-FILE.
003200 01  SORT-REC.
003300     05  SORT-LV                   PIC X(2).
003400     05  SORT-DESC                 PIC X(36).
           05  SORT-ACTIVE-EMPL          PIC X(4).
003500
       FD  MLEVEL-I
           LABEL RECORDS ARE STANDARD.
       01  MLEVEL-REC-I.
           COPY DDS-MCRPCS4100  OF MCFLCS4101.

       FD  PER-PERSONNEL-I
           LABEL RECORDS ARE STANDARD.
       01  PER-PERSONNEL-REC-I.
           COPY DDS-MCRPMM0300  OF MCFLMM0301.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC        PIC X(2000).

003600 WORKING-STORAGE SECTION.
003700
003800 77  SUB                           PIC S9(4) COMP-4 VALUE 0.
004200 77  END-OF-LEVS-FLAG              PIC X(1)  VALUE SPACES.
004300
004400**************************************************************
004500**                                                          **
004600**                S U B P R O G R A M   A R E A S           **
004700**                                                          **
004800**************************************************************
004900
005000 COPY TDATECHK   IN COPYLIB.
005100 COPY TBLOWUP    IN COPYLIB.
       COPY CATREAD    IN COPYLIB.
       COPY DISPDAT2   IN COPYLIB.
       COPY FUNCTDEF   IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.
       COPY CCRTFILE IN COPYLIB.
005200
005300**************************************************************
005400**                                                          **
005500**                  V I E W   W O R K                       **
005600**                                                          **
005700**************************************************************
005800
005900**  SEE LINKAGE SECTION FOR VIEW-COMAREA
006000
006100 01  MESSAGE-BUFFER.
006200     05  MSG-TEXT.
               10  MESSAGE-BUFFER-1 PIC X(1).
               10  FILLER           PIC X(67).
006300     05  MSG-FLD          PIC X(8)   VALUE SPACES.
006400     05  MSG-FLD-9 REDEFINES MSG-FLD PIC ZZZZZZZ9.
006500
006900 01  FIELD-NUMBER         PIC S9(4) COMP-4 VALUE 1.
007000
007600**************************************************************
007700**                                                          **
007800**            D A T A B A S E   W O R K                     **
007900**                                                          **
008000**************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
008100
008200 COPY DBSTAT     IN COPYLIB.
008300 01  DSET-NAMES.
008400     05  DSET-MLEVEL               PIC X(16) VALUE "MLEVEL;".
008500     05  DSET-PER-PERSONNEL  PIC X(16) VALUE "PER-PERSONNEL;".
008600
008700 01  MODE-AREA.
008800     05  MODE2                     PIC S9(4)   COMP       VALUE 2.
008900     05  MODE3                     PIC S9(4)   COMP       VALUE 3.
009000     05  MODE7                     PIC S9(4)   COMP       VALUE 7.
009100
009200 01  ALL-ITEMS                     PIC X(2)  VALUE "@;".
009300 01  LEVEL-SEARCH                  PIC X(10) VALUE "LEVEL-NUM;".
009400 01  LEVEL-ARG                     PIC X(2).
009500
009600**************************************************************
009700**                                                          **
009800**           D A T A B A S E   B U F F E R S                **
009900**                                                          **
010000**************************************************************
010100
010200 COPY MLEVEL     IN COPYLIB.
010300 01  BUF-PER-PERSONNEL.            COPY MPERSONL IN COPYLIB.
010400
010500**************************************************************
010600**                                                          **
010700**                  S C R E E N   D A T A                   **
010800**                                                          **
010900**************************************************************
011000
011100 01  DE-FIELDS.
011200     05  DE-AREA                   PIC X(870).
011300     05  V-LEVEL-AREA REDEFINES DE-AREA.
011400         10  V-LEVEL-LINE OCCURS 15 TIMES.
011500             15  V-LEVEL-NUM       PIC X(2).
011600             15  V-LEVEL-DESC      PIC X(36).
011700             15  V-LV-ACT-EMPL     PIC X(4).
011800             15  V-LV-ACT-EMPL-NM  PIC X(16).
           05  DE-COMMAND-LINE           PIC X(79).
           05  DE-MESSAGE-LINE           PIC X(79).
011900
012000 01  SAVE-LEVEL-LINE               PIC X(41).
012100
012200**************************************************************
012300**                                                          **
012400**            L I N K A G E   S E C T I O N                 **
012500**                                                          **
012600**************************************************************
012700
012800 LINKAGE SECTION.
012900 01  BASE                      PIC X(10).
013000 01  BASE-MMISA                 PIC X(13).
013100
013200 COPY VCOMLINK   IN COPYLIB.
013300 COPY TSHWSUB2   IN COPYLIB.
013400 COPY LANGSUB    IN COPYLIB.
013500
013600 PROCEDURE DIVISION USING BASE
013700                          BASE-MMISA,
013800                          VIEW-COMAREA,
013900                          SRF-COMAREA,
014000                          LANGUAGE-PARMS.
014100
014200 1-HSK.
           MOVE "N" TO END-OF-LEVS-FLAG.
           MOVE "QTEMP" TO CCRTFILE-LIBRARY.
           MOVE "DEALEVIQ" TO CCRTFILE-FILE.
           MOVE "0042" TO CCRTFILE-RECORD-LENGTH.
           MOVE "01000" TO CCRTFILE-NO-RECORDS.
           MOVE "01000" TO CCRTFILE-INCREMENT-AMT.
           MOVE "99"    TO CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               MOVE "CCRTFILE CREATE OF 'DEALEVIQ' FAILED"
                 TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

           OPEN INPUT MLEVEL-I, PER-PERSONNEL-I.
           OPEN I-O DISPLAY-FILE.
014300     PERFORM 7300-LOAD-FILE THRU 7390-LF-X.
014400     SORT SORT-FILE ON ASCENDING KEY SORT-LV
014500         USING LEV-FILE
014600         GIVING LEV-FILE.
014700
014800     OPEN INPUT LEV-FILE.
014900     PERFORM 6000-MAIN THRU 6990-MAIN-X.
015000     CLOSE LEV-FILE.
           CLOSE MLEVEL-I, PER-PERSONNEL-I.
015100     GOBACK.
015200
015300 2100-BLOWUP.
015400     MOVE "SEALEVIQ"               TO   BU-PGM-NAME.
015500     CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
015600       VIEW-COMAREA FILE-STATUS BU-DISPLAY-MSG
015700       BU-DISPLAY-FLDS.
015800
017200 4020-CLEAR-FORM.
017300     MOVE SPACES TO MESSAGE-BUFFER.
018500     MOVE SPACES                   TO   DE-FIELDS.
018600     MOVE SPACES                   TO   DE-AREA.
018800
       4030-SETERROR.
           MOVE B"1" TO IND (99).
           MOVE B"1" TO IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE.
051300
018900 6000-MAIN.
019000     MOVE "EALEVINQ"               TO   VIEW-NFNAME.
019200     PERFORM 4020-CLEAR-FORM.
019300
019400     PERFORM 7000-LOAD-SCREEN THRU 7090-LS-X.
019500
019600     IF END-OF-LEVS-FLAG = "Y"
019700         MOVE "I"                  TO   SRF-FKEY (2)
019900     ELSE
020000         MOVE SPACES TO SRF-FKEY (2).
021200
021300     MOVE 2                        TO   SRF-KEYSET.
021400     MOVE "I"                      TO   SRF-FKEY (6),
021600                                        SRF-FKEY (7),
                                              SRF-FKEY (8).
021700     MOVE "N"                      TO   SRF-ENTER-FLAG.
       6010-SHOWFORM.
           MOVE DE-FIELDS TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           MOVE DISPLAY-REC TO DE-FIELDS.
           IF MESSAGE-BUFFER-1 NOT = SPACES
               PERFORM 4030-SETERROR
               GO TO 6010-SHOWFORM.

022400*------- SHOW NEXT SCREEN
022500     IF VIEW-LASTKEY = 2
022600         GO TO 6000-MAIN.
022700
022800     IF VIEW-LASTKEY = 1
022900         PERFORM 7100-RESTART
023000         GO TO 6000-MAIN.
023100
023200 6990-MAIN-X.
023300     EXIT.
023400
023500 7000-LOAD-SCREEN.
023600     MOVE 0                        TO   SUB.
023700 7010-SERIAL-GET-LOOP.
023800     ADD 1                         TO   SUB.
023900     IF SUB > 15
024000         GO TO 7090-LS-X.
024100
024200     READ LEV-FILE AT END
024300         MOVE "Y"                  TO   END-OF-LEVS-FLAG
024400         GO TO 7090-LS-X.
024500
024600     MOVE LV-LEVEL-NUM             TO   V-LEVEL-NUM (SUB).
024700     MOVE LV-LEVEL-DESC            TO   V-LEVEL-DESC (SUB).
024800     MOVE LV-ACTIVE-EMPL           TO   V-LV-ACT-EMPL (SUB).
024900
025000*------ THE MMISA DATABASE MAY HAVE AN EMPL ENTRY OF SPACES,
025100*------ WITH NULL ITEMS FOR PERSONS NAME. THE FOLLOWING
      *------ STATEMENTS ALSO DISALLOW SUPERVISORY PERSONNEL NAMES
      *------ FROM APPEARING ON THE INQUIRY.
025200     IF LV-ACTIVE-EMPL < "0"
025300         MOVE SPACES               TO   V-LV-ACT-EMPL-NM (SUB)
025400         GO TO 7010-SERIAL-GET-LOOP.
025500
025600*    CALL "DBGET" USING BASE-MMISA, DSET-PER-PERSONNEL, MODE7,
025700*      STATUS-AREA, ALL-ITEMS, BUF-PER-PERSONNEL, LV-ACTIVE-EMPL.
           MOVE 0 TO COND-WORD.
           MOVE LV-ACTIVE-EMPL TO PERCCNUM OF PER-PERSONNEL-REC-I.
           READ PER-PERSONNEL-I INTO BUF-PER-PERSONNEL
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
025800     IF FILE-STATUS = "00"
025900*        *** THIS AVOIDS BAD DATA IN MMIS DATABASE
026000         IF PER-EMP-NAME < "A"
026100             MOVE SPACES           TO   V-LV-ACT-EMPL-NM (SUB)
026200         ELSE
026300             MOVE PER-EMP-NAME     TO   V-LV-ACT-EMPL-NM (SUB)
026400     ELSE
026500     IF FILE-STATUS = "23"
026600         MOVE SPACES               TO   V-LV-ACT-EMPL-NM (SUB)
026700     ELSE
026800         MOVE "DBGET ERR MMISA 7010-SGL" TO BU-DISPLAY-MSG
026900         PERFORM 2100-BLOWUP.
027000
027100     GO TO 7010-SERIAL-GET-LOOP.
027200
027300 7090-LS-X.
027400     EXIT.
027500
027600
027700 7100-RESTART.
027800     MOVE "N"                      TO   END-OF-LEVS-FLAG.
027900     CLOSE LEV-FILE.
028000     OPEN INPUT LEV-FILE.
028100
028200 7300-LOAD-FILE.
028300*------- REWIND THE MASTER DATASET (START FROM BEGINNING)
028400*    CALL "DBCLOSE" USING BASE, DSET-MLEVEL, MODE3,
028500*      STATUS-AREA.
           MOVE SPACES TO LEVELNUM OF MLEVEL-REC-I.
           START MLEVEL-I KEY > LEVELNUM OF MLEVEL-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE "REWIND ERROR OF MLEVEL" TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.
029000     OPEN OUTPUT LEV-FILE.
029100
029200 7310-GET-MLEV-LOOP.
029300*    CALL "DBGET" USING BASE, DSET-MLEVEL, MODE2, STATUS-AREA,
029400*      ALL-ITEMS, BUF-MLEVEL, LEVEL-ARG.
           READ MLEVEL-I NEXT INTO BUF-MLEVEL
               AT END MOVE 15 TO COND-WORD.
029500     IF FILE-STATUS NOT = "00"
029600         GO TO 7380-CLOSE-FILE.

030200     MOVE MLEVEL-LEVEL-NUM         TO   LV-LEVEL-NUM.
030300     MOVE MLEVEL-LEVEL-DESC        TO   LV-LEVEL-DESC.
030400     MOVE MLEVEL-ACTIVE-EMPL       TO   LV-ACTIVE-EMPL.
030500
030600     WRITE LEV-REC.
030700
030800     GO TO 7310-GET-MLEV-LOOP.
030900
031000 7380-CLOSE-FILE.
031100     CLOSE LEV-FILE.
031200
031300 7390-LF-X.
031400     EXIT.
031500
       COPY DISPCALL IN COPYLIB.
       COPY DISPCAL2 IN COPYLIB.
031600 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
032700 999-CATREAD-EXIT.
032800     EXIT.
