000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          SEAPHIQ1.
000400 AUTHOR.              C HILLES/JIM COFFMAN (MAINTAINER).
000500 DATE-WRITTEN.        8/21/87.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
      *****************************************************************
      *D   PATH INQUIRY NUMBER 1.  THIS INQUIRY SHOWS UP TO 15 PATHS
      *D   ON THE SCREEN.  SHOWS PATH NUM, PATH DESC, MIN AND MAX
      *D   MAX VALUES, AND WHETHER WORKORDER REQUIRED.
      *****************************************************************


      *****************************************************************
      **          M O D I F I C A T I O N    H I S T O R Y
      *****************************************************************
      *C  1-17-93    BK DISMUKES    NAPANEE CONV
      *C    ADDED "MOVE SPACES TO MESSAGE-BUFFER" IN 4030 TO
      *C    PREVENT CRT LOCK UP.
      *----------------------------------------------------------------
DCR01 *  MAR 10, 2005  D.RAUCH       DCR01    REQUEST# 2005-78515
DCR01 *     DISPLAY FILE PROCESSING CHANGED FROM USING ZCSISINQ
DCR01 *     NEW DISPLAY FILE ZSEAPHIQ1 CREATED - FORMATS COPIED
DCR01 *     FROM ZCSISINQ.
      *----------------------------------------------------------------

001400 ENVIRONMENT DIVISION.
001500 CONFIGURATION SECTION.
001600 SOURCE-COMPUTER.  HP-3000.
001700 OBJECT-COMPUTER.  HP-3000.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

001800 INPUT-OUTPUT SECTION.
001900 FILE-CONTROL.
002000     SELECT SORT-FILE ASSIGN TO DISK-SORT.
002100     SELECT PH-FILE   ASSIGN TO DISK-DEAPHIQ1.
002200
           SELECT MPATH-I
                  ASSIGN TO DATABASE-MCFLCS3901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DISPLAY-FILE
DCR01             ASSIGN TO WORKSTATION-ZSEAPHIQ1-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

002300 DATA DIVISION.
002400 FILE SECTION.
002500 FD  PH-FILE.
002600 01  PH-REC.
002700     05  PH-PATH-NUMBER            PIC X(4).
002800     05  PH-PATH-DESC              PIC X(30).
002900     05  PH-MIN-VAL                PIC X(14).
003000     05  PH-MAX-VAL                PIC X(14).
003100     05  PH-WO-APPROVE             PIC X(1).
003200
003300 SD  SORT-FILE.
003400 01  SORT-REC.
003500     05  SORT-PATH-NUMBER          PIC X(4).
003600     05  SORT-PATH-DESC            PIC X(30).
003700     05  SORT-MIN-VAL              PIC X(14).
003800     05  SORT-MAX-VAL              PIC X(14).
003900     05  SORT-WO-APPROVE           PIC X(1).
004000
       FD  MPATH-I
           LABEL RECORDS ARE STANDARD.
       01  MPATH-REC-I.
           COPY DDS-MCRPCS3900  OF MCFLCS3901.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC        PIC X(2000).

004100 WORKING-STORAGE SECTION.
004200
004300 77  SUB                           PIC S9(4) COMP-4 VALUE 0.
004400 77  END-OF-PHS-FLAG               PIC X(1)  VALUE "N".
004500
004600**************************************************************
004700**                                                          **
004800**                S U B P R O G R A M   A R E A S           **
004900**                                                          **
005000**************************************************************
005100
005200 COPY TBLOWUP    IN COPYLIB.
      *------ WS CONTROL AREA
       01  MAJOR-MINOR                   PIC XXXX.
       01  WS-CONTROL.
           05  FUNCTION-NUM              PIC XX.
               88  EXIT-KEY-F8-USED                 VALUE "08".
               88  REFRESH-KEY-F4-USED              VALUE "04".
               88  ENTER-KEY-USED                   VALUE "00".
               88  F1-KEY-USED                      VALUE "01".
               88  F2-KEY-USED                      VALUE "02".
               88  F3-KEY-USED                      VALUE "03".
               88  F4-KEY-USED                      VALUE "04".
               88  F5-KEY-USED                      VALUE "05".
               88  F6-KEY-USED                      VALUE "06".
               88  F7-KEY-USED                      VALUE "07".
               88  F8-KEY-USED                      VALUE "08".
           05  FUN-KEY REDEFINES FUNCTION-NUM  PIC XX.
           05  TERMINAL-ID               PIC X(10).
           05  FORMAT-NAME               PIC X(10).

       01  DISPLAY-STATUS                PIC X(2).

       COPY IOFEEDBACK IN COPYLIB.
       COPY CATREAD    IN COPYLIB.
       COPY CCRTFILE   IN COPYLIB.
005300
005400**************************************************************
005500**                                                          **
005600**                  V I E W   W O R K                       **
005700**                                                          **
005800**************************************************************
005900
006000**  SEE LINKAGE SECTION FOR VIEW-COMAREA
006100
006200 01  MESSAGE-BUFFER.
006300     05  MSG-TEXT.
006400         10  MESSAGE-BUFFER-1      PIC X(1)  VALUE SPACES.
006500         10  FILLER                PIC X(67) VALUE SPACES.
006600     05  MSG-FLD                   PIC X(8)  VALUE SPACES.
006700     05  MSG-FLD-9 REDEFINES MSG-FLD PIC ZZZZZZZ9.
006800
007200 01  FIELD-NUMBER                  PIC S9(4) COMP-4 VALUE 1.
007300
007900**************************************************************
008000**                                                          **
008100**            D A T A B A S E   W O R K                     **
008200**                                                          **
008300**************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
008400
008500 COPY DBSTAT     IN COPYLIB.
008600 01  DSET-NAMES.
008700     05  DSET-NAME                 PIC X(16) VALUE SPACES.
008800     05  DSET-MPATH                PIC X(16) VALUE "MPATH;".
008900
009000 01  MODE-AREA.
009100     05  DB-MODE                   PIC S9(4)   COMP       VALUE 0.
009200     05  MODE1                     PIC S9(4)   COMP       VALUE 1.
009300     05  MODE2                     PIC S9(4)   COMP       VALUE 2.
009400     05  MODE3                     PIC S9(4)   COMP       VALUE 3.
009500     05  MODE5                     PIC S9(4)   COMP       VALUE 5.
009600     05  MODE7                     PIC S9(4)   COMP       VALUE 7.
009700
009800 01  ALL-ITEMS                     PIC X(2)  VALUE "@;".
009900 01  LEVEL-SEARCH                  PIC X(10) VALUE "LEVEL-NUM;".
010000 01  LEVEL-ARG                     PIC X(2).
010100 01  PATH-SEARCH                   PIC X(16) VALUE "PATH-NUM;".
010200 01  PATH-ARG.
010300     05  PATH-ARG-PREFIX           PIC X(1).
010400     05  PATH-ARG-NUMBER           PIC 9(3).
010500
010600**************************************************************
010700**                                                          **
010800**           D A T A B A S E   B U F F E R S                **
010900**                                                          **
011000**************************************************************
011100
011200 COPY MPATH      IN COPYLIB.
011300
011400**************************************************************
011500**                                                          **
011600**                  S C R E E N   D A T A                   **
011700**                                                          **
011800**************************************************************
011900
012000 01  DE-FIELDS.
012100     05  V-PATH-LINE OCCURS 15 TIMES.
012200         10  V-PATH-NUMBER         PIC X(4).
012300         10  V-PATH-DESC           PIC X(30).
012400         10  V-MIN-VAL             PIC Z(13)9.
012500         10  V-MAX-VAL             PIC Z(13)9.
012600         10  V-WO-APPROVE          PIC X(1).
           05  DE-COMMAND-LINE           PIC X(79).
           05  DE-MESSAGE-LINE           PIC X(79).
012700
012800**************************************************************
012900**                                                          **
013000**            L I N K A G E   S E C T I O N                 **
013100**                                                          **
013200**************************************************************
013300
013400 LINKAGE SECTION.
013500 01  BASE                      PIC X(10).
013600 01  MMIS-BASE                 PIC X(13).
013700
013800 COPY VCOMLINK   IN COPYLIB.
013900 COPY TSHWSUB2   IN COPYLIB.
014000 COPY LANGSUB    IN COPYLIB.
014100
014200 PROCEDURE DIVISION USING BASE
014300                          MMIS-BASE,
014400                          VIEW-COMAREA,
014500                          SRF-COMAREA,
014600                          LANGUAGE-PARMS.
014700
014800 1-HSK.
      *------ CALL CCRTFILE TO CREATE A TEMPORARY FILE 'DEAPHIQ1'
           MOVE "QTEMP"       TO CCRTFILE-LIBRARY.
           MOVE "DEAPHIQ1"    TO CCRTFILE-FILE.
           MOVE "0063"        TO CCRTFILE-RECORD-LENGTH.
           MOVE "01000"       TO CCRTFILE-NO-RECORDS.
           MOVE "01000"       TO CCRTFILE-INCREMENT-AMT.
           MOVE "99"          TO CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               MOVE "CCRTFILE CREATE OF 'DEAPHIQ1' FAILED"
                  TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

           OPEN INPUT MPATH-I.
           OPEN I-O DISPLAY-FILE.
014900     MOVE "N"                      TO   END-OF-PHS-FLAG.
015000     PERFORM 7300-LOAD-FILE THRU 7390-LF-X.
015100     SORT SORT-FILE ON ASCENDING KEY SORT-PATH-NUMBER
015200         USING PH-FILE
015300         GIVING PH-FILE.
015400     OPEN INPUT PH-FILE.
015500     PERFORM 6000-MAIN THRU 6990-MAIN-X.
015600     CLOSE PH-FILE.
           CLOSE MPATH-I, DISPLAY-FILE.
015700     GOBACK.
015800
015900 2100-BLOWUP.
016000     MOVE "SEAPHIQ1"               TO   BU-PGM-NAME.
016100     CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
016200       VIEW-COMAREA FILE-STATUS BU-DISPLAY-MSG
016300       BU-DISPLAY-FLDS.
016400
017800 4020-CLEAR-FORM.
017900     MOVE SPACES TO MESSAGE-BUFFER.
019100     MOVE SPACES                   TO   DE-FIELDS.

       4030-SETERROR.
           MOVE B"1" TO IND (99).
           MOVE B"1" TO IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE.
           MOVE SPACES  TO MESSAGE-BUFFER.
051300
020100******************************************************************
020200**                                                              **
020300**             M A I N   P R O G R A M                          **
020400**                                                              **
020500******************************************************************
020600 6000-MAIN.
020700     MOVE "EAPHIQ1"                TO   VIEW-NFNAME.
020900     PERFORM 4020-CLEAR-FORM.
021000     PERFORM 7000-LOAD-SCREEN THRU 7090-LS-X.
021100
021200     IF END-OF-PHS-FLAG = "Y"
021300         MOVE "I"                  TO   SRF-FKEY (2)
021500     ELSE
021900         MOVE SPACES               TO   SRF-FKEY (2).
022000
023100 6010-SHOW-FORM.
023200     MOVE 2                        TO   SRF-KEYSET.
023300     MOVE "I"                      TO   SRF-FKEY (3),
023400                                        SRF-FKEY (6),
023500                                        SRF-FKEY (7).
023600     MOVE "N"                      TO   SRF-ENTER-FLAG.
       6010-SHOWFORM.
           MOVE DE-FIELDS TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           MOVE DISPLAY-REC TO DE-FIELDS.
           IF MESSAGE-BUFFER-1 NOT = SPACES
               PERFORM 4030-SETERROR
               GO TO 6010-SHOWFORM.

024300     IF VIEW-LASTKEY = 2
024400         GO TO 6000-MAIN.
024500
024600     IF VIEW-LASTKEY = 1
024700         PERFORM 7100-RESTART
024800         GO TO 6000-MAIN.
024900
025000     GO TO 6990-MAIN-X.
025100
025200 6990-MAIN-X.
025300     EXIT.
025400
025500******************************************************************
025600**                                                              **
025700**      P E R F O R M E D   R O U T I N E S                     **
025800**                                                              **
025900******************************************************************
026000 7000-LOAD-SCREEN.
026100     MOVE 0                        TO   SUB.
026200 7010-SERIAL-GET-LOOP.
026300     ADD 1                         TO   SUB.
026400     IF SUB > 15
026500         GO TO 7090-LS-X.
026600
026700     READ PH-FILE AT END
026800         MOVE "Y"                  TO   END-OF-PHS-FLAG
026900         GO TO 7090-LS-X.
027000
027100     MOVE PH-PATH-NUMBER           TO   V-PATH-NUMBER (SUB).
027200     MOVE PH-PATH-DESC             TO   V-PATH-DESC (SUB).
027300     MOVE PH-MIN-VAL               TO   V-MIN-VAL (SUB).
027400     MOVE PH-MAX-VAL               TO   V-MAX-VAL (SUB).
027500     MOVE PH-WO-APPROVE            TO   V-WO-APPROVE (SUB).
027600     GO TO 7010-SERIAL-GET-LOOP.
027700
027800 7090-LS-X.
027900     EXIT.
028000
028100
028200 7100-RESTART.
028300     MOVE "N"                      TO   END-OF-PHS-FLAG.
028400     CLOSE PH-FILE.
028500     OPEN INPUT PH-FILE.
028600
028700 7300-LOAD-FILE.
028800*    CALL "DBCLOSE" USING BASE, DSET-MPATH, MODE3,
028900*      STATUS-AREA.
           MOVE SPACES TO PATHNUM OF MPATH-REC-I.
           START MPATH-I KEY > PATHNUM OF MPATH-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.

029400     OPEN OUTPUT PH-FILE.
029500 7310-GET-PATH-LOOP.
029600*    CALL "DBGET" USING BASE, DSET-MPATH, MODE2, STATUS-AREA,
029700*      ALL-ITEMS, BUF-MPATH, PATH-ARG.
           READ MPATH-I NEXT INTO BUF-MPATH
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
029900         GO TO 7380-CLOSE-FILE.
030400
030500     MOVE MPATH-PATH-NUMBER        TO   PH-PATH-NUMBER.
030600     MOVE MPATH-PATH-DESC          TO   PH-PATH-DESC.
030700     MOVE MPATH-MIN-VAL            TO   PH-MIN-VAL.
030800     MOVE MPATH-MAX-VAL            TO   PH-MAX-VAL.
030900     MOVE MPATH-WO-APPROVE         TO   PH-WO-APPROVE.
031000
031100     WRITE PH-REC.
031200
031300     GO TO 7310-GET-PATH-LOOP.
031400
031500 7380-CLOSE-FILE.
031600     CLOSE PH-FILE.
031700
031800 7390-LF-X.
031900     EXIT.
032000
       COPY DISPCALL IN COPYLIB.
            IF VIEW-LASTKEY = 3
                MOVE 8 TO VIEW-LASTKEY
            ELSE
            IF VIEW-LASTKEY = 8
                MOVE 3 TO VIEW-LASTKEY.
            IF SRF-KEYSET = 1 OR 3 OR 5 OR 7
                MOVE "I" TO SRF-FKEY (7).
            IF SRF-KEYSET > 0
                MOVE "I" TO SRF-FKEY (5).
            IF SRF-KEYSET = 1 OR 2 OR 5 OR 6 OR 7 OR 8
                MOVE "I" TO SRF-FKEY (4).
            IF SRF-KEYSET = 5 OR 6
                MOVE "I" TO SRF-FKEY (8), SRF-FKEY (6)
            ELSE
            IF SRF-KEYSET = 7 OR 8
                MOVE "I" TO SRF-FKEY (1), SRF-FKEY (2), SRF-FKEY (8).
            MOVE SPACES TO MESSAGE-BUFFER-1.
            IF VIEW-LASTKEY = 0
                IF SRF-ENTER-FLAG = "I"
      *M            "E28: 'ENTER' NOT VALID HERE"
                    MOVE 5 TO LANG-SETNUM
                    MOVE 28 TO LANG-MSGNUM
                    MOVE 1 TO FIELD-NUMBER, SRF-ERROR-FLD
                    PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                ELSE
                NEXT SENTENCE
            ELSE
            IF SRF-FKEY (VIEW-LASTKEY) = "I"
      *M        "I10: INVALID FUNCTION KEY"
                MOVE 9 TO LANG-SETNUM
                MOVE 10 TO LANG-MSGNUM
                MOVE 1 TO FIELD-NUMBER, SRF-ERROR-FLD
                PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
            IF MESSAGE-BUFFER-1 = SPACES
                MOVE SPACES TO SRF-FKEY-AREA, SRF-ENTER-FLAG.
        9989-WS-X.
            EXIT.

032100 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
033200 999-CATREAD-EXIT.
033300     EXIT.
