       IDENTIFICATION DIVISION.
       PROGRAM-ID.          SEARETRN.
       AUTHOR.              C HILLES/JIM COFFMAN(MAINTAINER).
       DATE-WRITTEN.        10/21/87.
       DATE-COMPILED.
      *INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
      *SECURITY.
      *REMARKS.
      *****************************************************************
      *C   ELECTRONIC REQUISITION APPROVALS - RETURN A REQ SUBPROGRAM.
      *C   RETURN A REQ TO THE ORIGINATOR FOR MODIFICATION.  THIS SUB-
      *C   PROG WILL DELETE ALL ENTRIES IN THE QUEUE AND THEN CALL
      *C   'CEAQUE' TO RE-QUEUE THEM. THUS ALL PREVIOUS APPRVLS WILL BE
      *C   CANCELED.  REQ WILL BE PLACED IN HOLD STATUS 'RETURNED', AND
      *C   WILL NOT BE ABLE TO BE APPROVED UNTIL ORIGINATOR MAKES
      *C   MODIFICATION.
      *****************************************************************


      *****************************************************************
      **          M O D I F I C A T I O N    H I S T O R Y
      *****************************************************************
      *C MAR 26, 1996  JIM COFFMAN
      *C      CALL PGM MCXSNDMSG TO SNDUSRMSG TO A USERID FOUND
      *C      ON A REQUISTION TO NOTIFY THE ORIGINATOR THAT THE
      *C      REQUISITION HAS BEEN RETURNED TO THEM.
      *C
      *C 15DEC1997     WL  MCINTYRE
      *C      REVISED PROGRAM TO LINK TO FILE MCFLCS4201 (MEMPL) TO
      *C      OBTAIN AS/400 USERID OF RETURNEE FOR THE SNDUSRMSG.
      *C---------------------------------------------------------------
DCR01 *C MAR 10, 2005  D.RAUCH       DCR01    REQUEST# 2005-78515
DCR01 *C    DISPLAY FILE PROCESSING CHANGED FROM USING ZCSISINQ
DCR01 *C    NEW DISPLAY FILE ZSEARETRN CREATED - FORMATS COPIED
DCR01 *C    FROM ZCSISINQ.
DCR01 *****************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  HP-3000.
       OBJECT-COMPUTER.  HP-3000.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
DCR01          ASSIGN TO WORKSTATION-ZSEARETRN-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DISPLAY-STATUS
               CONTROL-AREA IS WS-CONTROL.

           SELECT DREQQUE-RQ-I
               ASSIGN TO DATABASE-MCFLCS4401
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT PER-PERSON-PC-I
               ASSIGN TO DATABASE-MCFLMM0301
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MEMPL-I
               ASSIGN TO DATABASE-MCFLCS4201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
      *------ FD STATEMENTS FOR IBM ONLY ------*
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                   PIC X(2000).

       FD  DREQQUE-RQ-I
           LABEL RECORDS ARE STANDARD.
       01  DREQQUE-RQ-REC-I.
           COPY DDS-MCRPCS4400  OF MCFLCS4401.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0501.

       FD  PER-PERSON-PC-I
           LABEL RECORDS ARE STANDARD.
       01  PER-PERSON-PC-REC-I.
           COPY DDS-MCRPMM0300  OF MCFLMM0301.

       FD  MEMPL-I
           LABEL RECORDS ARE STANDARD.
       01  MEMPL-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCS4201.

      *------ FD STATEMENTS FOR IBM ONLY ------*

       WORKING-STORAGE SECTION.
       01  HANDLE-BLOWUP-FLAG            PIC X(1)  VALUE "Y".
       01  SUB                           PIC S9(4) BINARY.
      **************************************************************
      **                                                          **
      **            D A T A B A S E   W O R K                     **
      **                                                          **
      **************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X  VALUE "0".
           05  FILE-STATUS-2             PIC X  VALUE "0".

       01  DSET-NAMES.
           05  DSET-DREQQUE              PIC X(16) VALUE "DREQQUE;".

       01  REQ-SEARCH                    PIC X(16) VALUE "REQ-NUMBER;".
       01  REQ-ARG                       PIC X(12).

       01  WS-NOTIFY                     PIC X(10) VALUE SPACES.
       01  REQ-NOTIFICATION.
           05  FILLER                    PIC X(19) VALUE
            "Requisition Number ".
           05  REQ-NOTIFY-REQ-NUMBER     PIC X(12) VALUE SPACES.
           05  FILLER                    PIC X(40) VALUE
            " has been returned to you by approver ".
           05  REQ-APPROVER              PIC X(4)  VALUE SPACES.
           05  FILLER                    PIC X(04) VALUE " on ".
           05  REQ-NOTIFY-DATE           PIC X(08) VALUE SPACES.
           05  FILLER                    PIC X(04) VALUE " at ".
           05  REQ-NOTIFY-TIME           PIC X(08) VALUE SPACES.
           05  FILLER                    PIC X(2)  VALUE SPACES.
           05  FILLER                    PIC X(41) VALUE
            "the reasons recorded by the returner are ".
           05  FILLER                    PIC X(2)  VALUE SPACES.
           05  REQ-REASON-1              PIC X(36) VALUE SPACES.
           05  FILLER                    PIC X(2)  VALUE SPACES.
           05  REQ-REASON-2              PIC X(36) VALUE SPACES.
           05  FILLER                    PIC X(294) VALUE SPACES.

       01  EMPL-ARG                      PIC X(4).
       01  PER-CC-ARG                    PIC X(4).

       01  MODE-AREA.
           05  MODE1                     PIC S9(4)   COMP       VALUE 1.
           05  MODE5                     PIC S9(4)   COMP       VALUE 5.

       01  ALL-ITEMS                     PIC X(2)  VALUE "@;".

       COPY DREQQUE    IN COPYLIB.
       01  BUF-PER-PERSONNEL.
       COPY MPERSONL IN COPYLIB.
       COPY MEMPL      IN COPYLIB.

       COPY MPLTINFO IN COPYLIB.

      ******************************************************************
      **                                                              **
      **          S U B P R O G R A M   A R E A S                     **
      **                                                              **
      ******************************************************************
       COPY TSHWRDFM   IN COPYLIB.
       COPY DISPDAT2   IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.
       COPY CATREAD    IN COPYLIB.
       COPY TBLOWUP    IN COPYLIB.
       COPY TDATECHK   IN COPYLIB.
       COPY CEAREQUE   IN COPYLIB.

      *************************************************************
      **                                                         **
      **           D A T A   E N T R Y   B U F F E R S           **
      **                                                         **
      *************************************************************

       01  DE-FIELDS-1.
           05  DE-EMPL                   PIC X(4).
           05  DE-REASON-1               PIC X(36).
           05  DE-REASON-2               PIC X(36).
           05  V-APP-LINE OCCURS 12 TIMES.
               10  DE-LEVEL-TO-RETURN-TO PIC X(1).
               10  V-LEVEL-NUM           PIC X(2).
               10  V-INORD-SIMEL         PIC X(1).
               10  V-QUEUED-DATE         PIC X(8).
               10  V-APPROVE-DATE        PIC X(8).
               10  V-EMPL                PIC X(4).
               10  V-EMPL-NAME           PIC X(16).
           05  DE-COMMAND-LINE-1         PIC X(76).
           05  DE-MESSAGE-LINE-1         PIC X(76).

       01  FIELD-NUMBER                  PIC S9(4) BINARY.

       01  FUNCTION-KEY-VALUES COMP-4.
           05 F1-KEY       VALUE 1     PIC S9(4).
           05 F2-KEY       VALUE 2     PIC S9(4).
           05 F3-KEY       VALUE 3     PIC S9(4).
           05 F4-KEY       VALUE 4     PIC S9(4).
           05 F5-KEY       VALUE 5     PIC S9(4).
           05 F6-KEY       VALUE 6     PIC S9(4).
           05 F7-KEY       VALUE 7     PIC S9(4).
           05 F8-KEY       VALUE 8     PIC S9(4).
           05 EXIT-PROGRAM VALUE 3     PIC S9(4).
           05 EXIT-AREA    VALUE 7     PIC S9(4).
           05 ENTER-KEY    VALUE 0     PIC S9(4).
           05 HP-F3-KEY    VALUE 8     PIC S9(4).

       COPY HMSGBUF  IN COPYLIB.

      **************************************************************
      **                                                          **
      **            L I N K A G E   S E C T I O N                 **
      **                                                          **
      **************************************************************

       LINKAGE SECTION.
       01  BASE                          PIC X(10).
       01  BASE-MMISA                    PIC X(24).
       01  BASE-BUDGET                   PIC X(24).
       COPY DBSTAT     IN COPYLIB.
       COPY MREQ       IN COPYLIB.
       COPY DREQITM    IN COPYLIB.
       COPY DREQD      IN COPYLIB.
       COPY REQGLOBS   IN COPYLIB.
       COPY SEARETRN   IN COPYLIB.
       COPY LANGSUB    IN COPYLIB.
       COPY VCOMLINK   IN COPYLIB.

       PROCEDURE DIVISION USING          BASE,
                                         BASE-MMISA,
                                         BASE-BUDGET,
                                         STATUS-AREA,
                                         BUF-MREQ,
                                         BUF-DREQITM,
                                         BUF-DREQD,
                                         REQ-GLOBALS,
                                         EARET-PARMS,
                                         LANGUAGE-PARMS,
                                         VIEW-COMAREA.

       1000-CONTROL.
           PERFORM 9999-OPEN-STUFF.
           MOVE "P 01" TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "111" TO MPLTINFO-COMPANY.
           PERFORM 6000-MAIN THRU 6990-MAIN-X.
           PERFORM 9999-CLOSE-STUFF.
           GOBACK.

       2100-BLOWUP.
           MOVE "SEARETRN"               TO  BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
             VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
             BU-DISPLAY-FLDS.

       6000-MAIN.
      *------ FIRST LOAD UP THE DATA FOR THE SCREEN.
           MOVE SPACES                   TO  DE-FIELDS-1.
           MOVE MREQ-NUMBER              TO  REQ-ARG.
           MOVE ZERO                     TO  SUB.
           PERFORM 9999-CHAINHD-DREQQUE-RQ-I.
           PERFORM 9999-GETNEXT-DREQQUE-RQ-I.
           PERFORM UNTIL NOT GOOD-CALL
               ADD 1                     TO  SUB
               MOVE DRQQ-LEVEL-NUM       TO  V-LEVEL-NUM (SUB)
               MOVE DRQQ-INORD-SIMEL     TO  V-INORD-SIMEL (SUB)
               MOVE 4                    TO  DATE-MODE
               MOVE DRQQ-QUEUED-DATE     TO  DATE-VALIDATE-IN
               CALL "TDATECHK" USING DATE-CHECK-AREA
               MOVE DATE-SLASH-OUT       TO  V-QUEUED-DATE (SUB)
               MOVE DRQQ-APPROVE-DATE    TO  DATE-VALIDATE-IN
               CALL "TDATECHK" USING DATE-CHECK-AREA
               MOVE DATE-SLASH-OUT       TO  V-APPROVE-DATE (SUB)
               MOVE DRQQ-EMPL-QUEUED     TO  V-EMPL (SUB)
               MOVE DRQQ-EMPL-QUEUED     TO  PER-CC-ARG
               PERFORM 9999-GETKEY-PER-PERSON-PC-I
               MOVE PER-EMP-NAME         TO  V-EMPL-NAME (SUB)
               PERFORM 9999-GETNEXT-DREQQUE-RQ-I
           END-PERFORM.

               IF MPLTINFO-COMPANY = "153"
                   MOVE "X"              TO  DE-LEVEL-TO-RETURN-TO (2)
               ELSE
               MOVE "X"                  TO  DE-LEVEL-TO-RETURN-TO (1).

           MOVE "FEARETRN"               TO  VIEW-NFNAME.
           MOVE EARET-EMPL               TO  DE-EMPL.

       6010-SHOWFORM-1.
           MOVE 7                        TO  SRF-KEYSET.
           PERFORM 9999-DO-SCREEN-1.

           IF VIEW-LASTKEY = EXIT-PROGRAM
               GO TO 6990-MAIN-X.

           IF DE-REASON-1 = SPACES
      *        "T62: THIS FIELD IS REQUIRED"
               MOVE 20062         TO  CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD
               MOVE 2             TO  SRF-ERROR-FLD
               GO TO 6010-SHOWFORM-1.

      *------ THE USER PUTS AN 'X' NEXT TO THE LEVEL HE WANTS
      *------ TO RETURN TO.  THE DEFAULT IS THE FIRST APPROVER.
           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 12
           OR DE-LEVEL-TO-RETURN-TO (SUB) = "X"
               MOVE "00"          TO  LEVEL-TO-RE-Q-TO
           END-PERFORM.
           IF SUB < 13 AND DE-LEVEL-TO-RETURN-TO (SUB) = "X"
               MOVE V-LEVEL-NUM (SUB) TO LEVEL-TO-RE-Q-TO.

           MOVE DE-REASON-1       TO  RETURN-REASON-1.
           MOVE DE-REASON-2       TO  RETURN-REASON-2.
           MOVE DE-EMPL           TO  RETURNING-EMPL.
           MOVE "N"               TO  CHECK-RE-Q-NECCESSARY.
           CALL "CEAREQUE" USING BASE, BASE-MMISA, STATUS-AREA,
             LANGUAGE-PARMS, REQ-GLOBALS, BUF-MREQ, BUF-DREQD,
             BU-DISPLAY-MSG, CEAREQUE-PARMS.

      *------- NOTIFY ORIGINATOR OF RETURNED REQUISITION
      *    IF LEVEL-TO-RE-Q-TO = "00"
      *      IF REQ-DOCK-NOTIFY NOT = SPACES

      *-----  READ MEMPL FILE TO OBTAIN AS/400 USERID OF USER THE
      *-----  REQ IS BEING RETURNED TO FOR USE IN MCXSNDMSG.
      *-----  IF NO USERID IS ENTERED FOR THE USER OR THE USER DOESN'T
      *-----  HAVE A ENTRY IN MEMPL, CAN'T SEND MESSAGE, EXIT LOGIC.

           MOVE V-EMPL  TO EMPLOYID OF MEMPL-REC-I.
           READ MEMPL-I INTO BUF-MEMPL
             AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              GO TO 6990-MAIN-X
           ELSE
              IF MEMPL-USERID NOT = SPACES
                 MOVE MEMPL-USERID   TO WS-NOTIFY
              ELSE
                 GO TO 6990-MAIN-X.

           MOVE REQ-ARG TO REQ-NOTIFY-REQ-NUMBER.
           MOVE DE-EMPL TO REQ-APPROVER.
           MOVE 1       TO  DATE-MODE.
           CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
           MOVE DATE-SLASH-OUT TO  REQ-NOTIFY-DATE.
           MOVE DATE-FORMATTED-TIME-OUT TO REQ-NOTIFY-TIME.
           MOVE DE-REASON-1 TO REQ-REASON-1.
           MOVE DE-REASON-2 TO REQ-REASON-2.
           CALL "MCXSNDMSG" USING REQ-NOTIFICATION WS-NOTIFY.

       6990-MAIN-X.
           EXIT.

      *------ THIS VERSION OF CATREAD ASSUMES THE SET/MSG NUMBER
      *------ WILL BE IN CATREAD-MSG-NUMBER.
       999-CATREAD.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
           IF MESSAGE-BUFFER-1  = SPACES
               MOVE "* ERROR ON THIS FIELD *" TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.

       COPY SCRNCALL IN COPYLIB.
       COPY SCRNCL1  IN COPYLIB.

       9999-CHAINHD-DREQQUE-RQ-I.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DREQQUE-RQ-REC-I.
           START DREQQUE-RQ-I KEY = REQNO OF DREQQUE-RQ-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DREQQUE-RQ-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CLOSE-STUFF.
           CLOSE DISPLAY-FILE.
           CLOSE DREQQUE-RQ-I.
           CLOSE MPLTINFO-I.
           CLOSE PER-PERSON-PC-I.
           CLOSE MEMPL-I.

       9999-GETKEY-PER-PERSON-PC-I.
           MOVE 0 TO COND-WORD.
           MOVE PER-CC-ARG TO PERCCNUM OF PER-PERSON-PC-REC-I.
           READ PER-PERSON-PC-I INTO BUF-PER-PERSONNEL
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-PER-PERSON-PC-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DREQQUE-RQ-I.
           MOVE 0 TO COND-WORD.
           READ DREQQUE-RQ-I NEXT INTO BUF-DREQQUE
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DREQQUE-RQ-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF REQNO OF DREQQUE-RQ-REC-I NOT = REQ-ARG
               MOVE 15 TO COND-WORD.

       9999-OPEN-STUFF.
           OPEN I-O DISPLAY-FILE.
           OPEN INPUT DREQQUE-RQ-I.
           OPEN INPUT MPLTINFO-I.
           OPEN INPUT PER-PERSON-PC-I.
           OPEN INPUT MEMPL-I.
