       IDENTIFICATION DIVISION.
       PROGRAM-ID.          SEARQADD.
       AUTHOR.              C HILLES.
       DATE-WRITTEN.        9/14/87.
       DATE-COMPILED.
      *INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
      *SECURITY.
      *REMARKS.
      *D   ELECTRONIC APPROVAL SYSTEM - ADD/MOD/CREATE REQ:
      *D   THIS IS FOR NON-STOREROOM, NON-MMIS REQUISITIONS.
      *C
      *C   05/05/94  JE COFFMAN  WRITTEN REQUEST 94-001/SLS REQ 6487
      *C     ADDED THE ABILITY TO ALLOW 'SS' STATUS REQUISITIONS
      *C     THAT HAVE THE AUTHORIZATION FLAG SET VIA MP1 TO BE
      *C     HANDLED.
      *C
      *C   FEB. 1995 JE COFFMAN  WRITTEN REQUEST 94-041/SLS #6558
      *C     ADDED LOGIC TO ALLOW A CHECK OF MVALIDPLTDATA TO DETERMINE
      *C     IF THE DEPARTMENT ENTERED BY THE USER ON THE REQUISITION
      *C     WAS ONE THAT WAS DESIGNATED AS A DEPARTMENT FOR WHICH
      *C     REQUISITIONS ARE TO BE EXPLODED (I.E. THE DEPARTMENT
      *C     ENTERED TRIGGERS REQUISITIONS FOR OTHER DEPARTMENTS).
      *C
      *C   OCT/NOV 1995 JE COFFMAN
      *C     INCORPORATED NEW LOGIC TO NOT ALLOW AN "EXPLODE FROM"
      *C     DEPARTMENT TO BE VALID EXCEPT IF THE USER IS FLAGGED
      *C     AS CAPABLE OF EXPLODING REQUISITIONS.
      *C
      *C   APR 1996     JE COFFMAN
      *C     ADDED CODE TO NOT ALLOW AN EXPLODE DEPARTMENT TO BE
      *C     ENTERED ON A MODIFY OF A REQUISITION.
      *C
      *C   15APR1996    DAVE PLUM
      *C     MODIFIED THE LOGIC ADDED ON 11APR1996 TO ONLY DISALLOW
      *C     THE ENTRY OF "EXPLODED DEPARTMENTS" (KEY = ED**** IN
      *C     MVALIDPLTDATA (WHERE "****" IS THE DEPT NUMBER).  WE DO
      *C     WANT TO ALLOW REQUISITIONS TO BE MODIFIED TO ONE OF THE
      *C     DEPT VALUES THAT THE "ED***" DEPT IS EXPLODED TO.  FOR
      *C     EXAMPLE, IF THE KEY "ED1579" EXISTS IN MVALIDPLTDATA
      *C     WITH THE V-E-D VALUES "1517" AND "1519", THEN A REQ
      *C     SHOULD NOT BE MODIFIED TO DEPT 1579.  IT CAN, HOWEVER,
      *C     BE MODIFIED TO DEPT 1517 OR DEPT 1519.
      *C
      *C
      *C   SEPTEMBER 1996 JE COFFMAN  REQ# 6619
      *C     EXPANDED DATE FIELDS TO YEAR 2000 COMPLIANCE.
      *C     INCLUDED IS THE REQUIRED DATE PASSED TO CMANREQ.
      *C
      *C   DECEMBER 1996  CA YODER    REQ# 96-027
      *C     ADDED NEW FIELDS TO DREQITM DATASET AND TO THE
      *C     REQ ADD/MODIFY SCREENS TO SHOW CURRENCY CODE.
      *C     IF A VALUE IS ENTERED IN THE "OTHER CURRENCY" FIELD,
      *C     THE VALUE IS CONVERTED INTO THE HOME CURRENCY AND
      *C     STORED IN THE UNIT-PRICE FIELD IN DREQITM.  THE OTHER
      *C     CURRENCY VALUE AND CODE ARE THEN STORED IN THE
      *C     TWO NEW FIELDS ADDED TO DREQITM.
      *C
      *C   DECEMBER 1996  CA YODER    REQ#96-040
      *C     ADDED LOGIC TO VALIDATE COMPANY AND PRIME ON THE
      *C     REQUISITION.  ALSO CORRECTED HOW CLASS IS VALIDATED.
      *C     IT WAS USING MVALIDPLTDATA, BUT IT WAS CHANGED TO
      *C     USE MCLASS.
      *C
      *C   MARCH 1997     JE COFFMAN  REQ# 96-045
      *C     ADDED LOGIC TO ALLOW THE USER TO LINK A REQUISITION
      *C     TO A WORK ORDER. THIS REQUIRES THAT WE CREATE A
      *C     WO-PARTS RECORD ON THE MMIS SIDE.
      *C
      *C   OCTOBER 1997   JEFF BUNGO
      *C     ADDED LOGIC TO CHECK IF DOCK NOTIFY USERID IS REQUIRED
      *C     AND THAT THE ENTERED USERID IS A VALID SYSTEM USERID.
      *C
      *C   NOVEMBER 5, 1997 JEFF BUNGO
      *C     DEFAULT NOTIFY USERID ON REQUISITION ADD TO THE USERID
      *C     FOUND FOR THE CLOCK CARD ENTERED.
      *C
      *C   02FEB1998  WL MCINTYRE
      *C     REVISE PROGRAM TO PASS "M" FOR MODIFY OR "D" FOR DELETE
      *C     TO THE EDIT SUBPROGRAM CEAEDIT.  PREVIOUSLY, A "M" WAS
      *C     PASSED TO THE CEAEDIT FOR BOTH MODIFY AND DELETE REQUESTS.
      *C
      *C   02FEB1998  JE COFFMAN
      *C     ADDED PROGRAM LOGIC TO SET A NEW SWITCH (CMR-MREQFILE-FLAG)
      *C     WHICH WILL TELL CMANREQ THAT A USER HAS MODIFIED A "M"
      *C     REQUISITIONED ITEM AND CHANGED THE CORPORATE CODE VALUE
      *C     FROM 'NON-STR' TO A LEGITIMATE CORPORATE CODE. THE NEWLY
      *C     CREATED REQS INDICATED THAT THEY WERE IN MATERIALS CONTROL
      *C     BUT COULD NOT BE PROCESSED AS THERE WAS NO MREQFILE ENTRY
      *C     FOR THE CODE/REQUISITION COMBINATION THAT MA1 COULD USE.
      *C
      *C   20OCT1998  JE COFFMAN
      *C     ADDED A CHECK PRIOR TO CALL TO SMREQINQ TO VALIDATE THAT
      *C     THE USER CLOCK CARD IS ALLOWED TO FREELY LOOK AT SYSTEM
      *C     REQS.
      *C
      *C   20JAN2000  JE COFFMAN
      *C     ADDED LOGIC TO EDIT CHECK THE CLASS ENTRY FOR TYLER PER
      *C     JIM RUSH'S VERBAL REQUEST.
      *C
      *C   22MAR2000  JE COFFMAN
      *C     ADDED AN EDIT CHECK TO THE PROGRAM TO HANDLE A SITUATION
      *C     WHERE AN 'M' REQUISITION WAS CREATED FOR A CORPORATE CODE
      *C     BUT THE ORIGINATOR REALIZED THAT THE WRONG CODE HAD BEEN
      *C     ENTERED AND MODIFIED THE REQUISITION TO THE CORRECT CODE.
      *C     THE REQUISITION WAS GETTING "HUNG' IIN MATERIAL CONTROL
      *C     BECAUSE THE MREQFILE ENTRY WRITTEN ORIGINALLY FOR THE
      *C     CODE WAS NOT GETTING ALTERED.
      *C
      *C   15DEC2000  JE COFFMAN
      *C     ADDED CALL TO CHECKBOOK PROGRAM PXBVA006 VIA FUNCTION KEY
      *C     F6 WHEN CREATING REQS (GADSDEN REQUEST). THE INTENT IS SO
      *C     USERS CAN BETTER MONITOR THE DOLLARS THAT ARE ACCRUING
      *C     FOR THEIR TEAM/LOCATIONS.
      *C
      *C   16JAN2001  JE COFFMAN
      *C     ADDED LOGIC AT STEVE STEPP'S REQUEST IN TYLER TO MAKE
      *C     EXPENSE CLASS A REQUIRED FIELD.
      *C
      *C   11DEC2001  BE GEISER
      *C     ADDED LOGIC AT JIM THOMAS'S REQUEST TO MAKE UNIT OF MEASURE
      *C     A REQUIRED FIELD FOR SAP/R3 PLANTS. ALSO, CHECK MPLTINFO
      *C     SYNR3 SWITCH TO DETERMINE IF PLANT IS USING SAP/R3 TO AVOID
      *C     MAINTAINING A HARD-CODED LIST OF SAP/R3 PLANTS.
      *C
      *C   21JAN2002  BE GEISER
      *C     FORCE VALID UNIT OF MEASURE ON REQ MODIFY FUNCTION FOR
      *C     SAP/R3 PLANTS. INCLUDES CODED AND NON CODED ITEMS.
      *C
      *C   04APR2002  CA YODER
      *C     FOR SAP/R3 PLANTS, FORCE STOREROOM REQS TO GO ON APPROVAL
      *C     PATH BY USING STR-AUTH-FLAG.
      *C
      *C   23APR2002  CA YODER
      *C     FOR SAP/R3 PLANTS, CHANGE ADDITIONAL INFO FIELD TO BE THE
      *C     SAP INTERNAL ORDER NUMBER.  VALIDATE THE ENTRY AGAINST
      *C     "NW" ENTRY IN MVALIDPLTDATA.
      *C
      *C     ALSO HAD TO CREATE NEW FIELDS FOR SEVERAL OF THE HEADINGS
      *C     ON THE E1 SCREEN.  THE HEADINGS ARE NOW VARIABLE, DEPENDING
      *C     ON WHICH PLANT SWITCHES ARE SET.
      *C
      *C   16MAY03  BE GEISER
      *C     ADD FIELD TO SCREEN TO IDENTIFY SERVICE REQS. THIS WILL
      *C     BE PASSED OVER TO SAP. ADD MANF NAME/PART TO FIRST LINE
      *C     OF COMMENTS (LAWTON REQUEST).
      *C
      *C   16JUL03  BE GEISER
      *C     RESTRICT MANF NAME/PART COMMENT OVERLAY TO LAWTON ONLY.
      *C
      *C   10SEP03  BE GEISER
      *C     ADD REPAIR & RETURN OPTION IN ADDTION TO SERVICE AND
      *C     MATERIAL REQS.
      *C
      *C   15MAR2004  H PROCTOR
      *C     ADDED LOGIC TO NOT CALL PROGRAM PXBVA006 WHEN FUNCTION KEY
      *C     F6 IS PRESSED IF THE PLANT IS RUNNING SAP R3.
      *C
      *C   08JUL2004  GEISER
      *C     ADDED LOGIC TO ALLOW CALL FROM PROGRAM TMODMATL. THAT IS
      *C     THE MMIS WORK ORDER REQUISITION CREATE PROGRAM. SAP REQUEST.
      *C
      *C   JULY 2004  GEISER
      *C     DEFAULT UM TO STORES BASE UM IF NOT ENTERED.
      *C

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  AS400.
       OBJECT-COMPUTER.  AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MCLASS-I
                  ASSIGN TO DATABASE-MCFLCS4901
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-I
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MVALIDPLTDATA-I
                  ASSIGN TO DATABASE-MCFLCS1701
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MVALIDUM-I
                  ASSIGN TO DATABASE-MCFLCS0401
                  ORGANIZATION IS INDEXED
                   ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DREQITM-I
                  ASSIGN TO DATABASE-MCFLCS2202
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT MREQ-I
                  ASSIGN TO DATABASE-MCFLCS2001
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DREQD-I
                  ASSIGN TO DATABASE-MCFLCS2101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT PER-PERSONNEL-I
                  ASSIGN TO DATABASE-MCFLMM0301
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZEAREQ-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.


       DATA DIVISION.
       FILE SECTION.
       FD  MCLASS-I
           LABEL RECORDS ARE STANDARD.
       01  MCLASS-REC.
           COPY DDS-MCRPCS4900  OF MCFLCS4901.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-I-REC.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  MVALIDPLTDATA-I
           LABEL RECORDS ARE STANDARD.
       01  MVALIDPLTDATA-REC.
           COPY DDS-MCRPCS1700  OF MCFLCS1701.

       FD  MVALIDUM-I
           LABEL RECORDS ARE STANDARD.
       01  MVALIDUM-I-REC.
           COPY DDS-MCRPCS0400 OF MCFLCS0401.

       FD  DREQITM-I
           LABEL RECORDS ARE STANDARD.
       01  DREQITM-I-REC.
           COPY DDS-MCRPCS2200  OF MCFLCS2202.

       FD  MREQ-I
           LABEL RECORDS ARE STANDARD.
       01  MREQ-I-REC.
           COPY DDS-MCRPCS2000  OF MCFLCS2001.

       FD  DREQD-I
           LABEL RECORDS ARE STANDARD.
       01  DREQD-I-REC.
           COPY DDS-MCRPCS2100  OF MCFLCS2101.

       FD  PER-PERSONNEL-I
           LABEL RECORDS ARE STANDARD.
       01  PER-PERSONNEL-I-REC.
           COPY DDS-MCRPMM0300  OF MCFLMM0301.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                   PIC X(2000).

       WORKING-STORAGE SECTION.
       77  EXPLODE-SW                    PIC 9.
       77  LINK-TO-WO-SW                 PIC 9.
       77  MPLT-COMP-4                   PIC X(4).
       77  MOD-DEL-FLAG                  PIC X(1).
       77  NO-MATCH-DEPT                 PIC S9(4) COMP.
       77  OPEN-REQ-SW                   PIC X(1).
       77  SAVE-CMR-REQ-NUMBER           PIC X(12).
       77  SAVE-WO-ITEM-NUMBER           PIC X(4).
       77  SAVE-CORP-CODE                PIC X(7).
       77  SAVE-DEPT                     PIC X(4).
       77  SAVE-EXPLODE-DEPT             PIC X(4).
       77  SAVE-PACD-SW                  PIC X(1).
       77  SAVE-REQ-CURR-SW              PIC X(1).
       77  SAVE-REQ-SYNR3-SW             PIC X(1).
       77  SAVE-HOME-CUR-CODE            PIC X(2).
       77  SUB                           PIC S9(4) COMP-4.
       77  SUB1                          PIC S9(4) COMP-4.
       77  SAVE-EST-PRICE                PIC 9(11)V9(4)   VALUE 0.
       77  SAVE-OTHER-EST-PRICE          PIC 9(11)V9(4)   VALUE 0.
       77  SAVE-OTHER-CURRENCY           PIC X(2)         VALUE SPACES.
       77  SAVE-REQ-USERID               PIC X(1).
       77  VALID-USER                    PIC X(1).
       77  SAVE-AUTH-FLAG                PIC X.
       77  SAVE-HDG1                     PIC X(28).
       77  SAVE-HDG2                     PIC X(28).


       01  CLASS-WORKAREA.
           05  CLASS-DIG OCCURS 3        PIC X.

      *------ HOLD MESSAGES FOR SCREEN FUNCTION
       01  HOLD-CREATE-MSG               PIC X(8).
       01  HOLD-MODIFY-MSG               PIC X(8).
       01  HOLD-DELETE-MSG               PIC X(8).
       01  HOLD-COPY-MSG                 PIC X(8) VALUE "COPY    ".

      **************************************************************
      **                                                          **
      **                S U B P R O G R A M   A R E A S           **
      **                                                          **
      **************************************************************

       COPY CDESC      IN COPYLIB.
       COPY DBSTAT     IN COPYLIB.
       COPY DISPDAT2   IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.
       COPY ISSPARTS   IN COPYLIB.
       COPY TDATECHK   IN COPYLIB.
       COPY TSHWRDFM   IN COPYLIB.
       COPY TBLOWUP    IN COPYLIB.
       COPY CMANREQ    IN COPYLIB.
       COPY SMREQINQ   IN COPYLIB.
       COPY MULTSTR    IN COPYLIB.
       COPY CEAEDIT    IN COPYLIB.
       COPY CATREAD    IN COPYLIB.
       COPY CGENHELP   IN COPYLIB.
       COPY SCURCONV   IN COPYLIB.

       01  EAVALID-PARMS.
           05  EAVALID-TYPE              PIC X(1).
           05  EAVALID-OK                PIC X(1).
           05  EAVALID-LASTKEY           PIC S9(4) COMP-4 VALUE 0.
           05  FILLER                    PIC X(30).

       01  REQI-RET-CODE                 PIC S9(4) COMP-4 VALUE 0.

       01  SCREEN-BUFFER                 PIC X(2000).

       COPY TIREDIT    IN COPYLIB.
       01  TIREDIT-RET-CODE              PIC X(2).
       COPY STCOM      IN COPYLIB.

       01  DUMMY-EXP-CLASS               PIC X(8)  VALUE SPACES.

       01  MMIS-WORK.
           05  MMIS-WO                   PIC X(10).
           05  MMIS-ST-CODE              PIC X(8).
           05  MMIS-QTY                  PIC S9(8).
           05  MMIS-AVGCST               PIC S9(11)V9(4).
           05  MMIS-CHRG-DEPT            PIC X(4).
           05  MMIS-EXP-CLASS.
               10  MMIS-EXP-CLASS-1-2    PIC X(2).
               10  MMIS-EXP-CLASS-3-8    PIC X(6).
           05  MMIS-DESC                 PIC X(46).
           05  MMIS-STAT                 PIC XX.
           05  MMIS-UM                   PIC XX.
           05  MMIS-EMP-ID               PIC X(4).

      *------ PARMS FOR CALL TO REQ DESCRIPTION MODIFY SUBPROGRAM
      *------ 'SREQDESC'
       01  DESCRIPTION-SW.
           05  DESC-BLOWUP-SW        PIC X VALUE SPACES.
           05  DESC-UPDATE-SW        PIC X VALUE SPACES.

       01  SCREEN-PRINT-PARMS.
           05  PRINT-CTL                 PIC S9(4) VALUE ZERO COMP-4.
           05  PAGE-CTL                  PIC S9(4) VALUE 49 COMP-4.
           05  SPOOLFIL-OPEN-SW          PIC X(1)  VALUE "N".

       01  RET-CODE                      PIC XX.

       01  SHIFT-FIELD.
           05  SHIFT8.
               10  FILLER                PIC XX.
               10  SHIFT-EXP             PIC X(6).
           05  SHIFT8-9 REDEFINES SHIFT8 PIC 9(8).

       01  ARGUMENT-VALUES.
           05  PLT-ARG                   PIC X(4).
           05  PO-ARG                    PIC X(14).
           05  VEN-ARG                   PIC X(10).
           05  REQ-ARG                   PIC X(12).
           05  CODE-ARG.
               10  CODE-ARG-7            PIC X(7).
               10  FILLER                PIC X.
           05  WO-ARG                    PIC X(10).
           05  BUYER-ARG                 PIC X(4).
           05  MPLTINFO-ARG              PIC X(4).
           05  VALID-ARG.
               10  VALID-ARG-1-2         PIC XX.
               10  VALID-ARG-3-10.
                   15  VALID-ARG-3-8     PIC 9(6).
                   15  FILLER            PIC XX.
           05  UM-ARG                    PIC X(2).
           05  REQ-PRINTER-SPOOL-PRT     PIC 9(2).

      ******************************************************************
      **                                                              **
      **             D A T A B A S E   W O R K                        **
      **                                                              **
      ******************************************************************
       01  EMPLOYEE-ARG                  PIC X(4).
       01  DSET-MPLTINFO                 PIC X(16) VALUE "MPLTINFO;".
       01  DSET-DREQITM                  PIC X(16) VALUE "DREQITM;".
       01  DSET-MREQ                     PIC X(16) VALUE "MREQ;".
       01  DSET-DREQD                    PIC X(16) VALUE "DREQD;".
       01  DSET-PER-PERSONNEL   PIC X(16) VALUE "PER-PERSONNEL;".
       01  MODE1                         PIC S9(4) COMP-4 VALUE 1.
       01  MODE5                         PIC S9(4) COMP-4 VALUE 5.
       01  MODE7                         PIC S9(4) COMP-4 VALUE 7.
       01  ALL-ITEMS                     PIC X(2)  VALUE "@;".
       01  REQ-SEARCH                    PIC X(11) VALUE "REQ-NUMBER;".
       01  CODE-SEARCH                   PIC X(10) VALUE "CORP-CODE;".

       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

      ******************************************************************
      **                                                              **
      **       D A T A B A S E   B U F F E R S                        **
      **                                                              **
      ******************************************************************
       COPY MCLASS     IN COPYLIB.
       COPY MPLTINFO   IN COPYLIB.
       COPY MREQ       IN COPYLIB.
       COPY MREQFILE   IN COPYLIB.
       COPY MSTORERM   IN COPYLIB.
       COPY MVALDPLT   IN COPYLIB.
       COPY DREQD      IN COPYLIB.
       COPY DREQITM    IN COPYLIB.

       01  BUF-PER-PERSONNEL.            COPY MPERSONL IN COPYLIB.

      **************************************************************
      **                                                          **
      **                  V I E W   W O R K                       **
      **                                                          **
      **************************************************************
       COPY FUNCTDEF IN COPYLIB.
      **  SEE LINKAGE SECTION FOR VIEW-COMAREA

       01  SAVE-VIEW-LASTKEY             PIC S9(4) COMP-4 VALUE 0.

       01  MESSAGE-BUFFER.
           05  MSG-TEXT.
               10  MESSAGE-BUFFER-1      PIC X(1).
               10  FILLER                PIC X(63).
           05  MSG-TEXT-2 REDEFINES MSG-TEXT.
               10  FILLER                PIC X(31).
               10  MESSAGE-DEPT          PIC X(4).
               10  FILLER                PIC X(29).
           05  MSG-FLD                   PIC X(12)  VALUE SPACES.
           05  MSG-FLD-9 REDEFINES MSG-FLD PIC ZZZZZZZZZZZ9.

       01  CMANREQ-MESSAGE-BUFFER.
           05  CMANREQ-MESSAGE-BUFFER-1  PIC X(1)   VALUE SPACES.
           05  FILLER                    PIC X(75)  VALUE SPACES.

       01  MSG-BUFFLEN                   PIC S9(4)  COMP-4 VALUE 76.
       01  MSG-ACTUALEN                  PIC S9(4)  COMP-4 VALUE 76.

       01  FIELD-NUMBER                  PIC S9(4)  COMP-4 VALUE 1.

      **************************************************************
      **                                                          **
      **                  S C R E E N   D A T A                   **
      **                                                          **
      **************************************************************

       01  DE-FIELDS.
           05  V-FUNCTION                PIC X(8).
           05  DE-REQ-NUMBER.
               10  DE-REQ-NUMBER-EP      PIC X.
               10  FILLER                PIC X(11).
           05  DE-CORP-CODE              PIC X(7).
           05  DE-QTY                    PIC 9(8).
           05  DE-UM                     PIC X(2).
           05  DE-EST-UNIT-PRICE         PIC 9(11)V9(4).
           05  DE-CURRENCY               PIC X(2).
           05  V-WO-NUMBER               PIC X(10).
           05  DE-EST-UNIT-PRICE-2       PIC 9(11)V9(4).
           05  DE-CURRENCY-2             PIC X(2).
           05  DE-STAGING-AREA           PIC X(4).
           05  DE-DATE-WANTED.
               10  DE-DATE-WANTED-MMDD   PIC X(4).
               10  DE-DATE-WANTED-CCYY.
                   15  DE-DATE-WANTED-CC.
                       20  FILLER        PIC X.
                       20  DDWCC-SLASH   PIC X.
                   15  DE-DATE-WANTED-YY PIC X(2).
           05  DE-SUGGESTED-VENDOR       PIC X(30).
           05  DE-SERVICE-FLAG           PIC X(01).
           05  DE-HDG1                   PIC X(28).
           05  DE-HDG2                   PIC X(28).
           05  DE-BUDGET-NUMBER.
               10  DE-BUDGET1            PIC X(3).
               10  DE-BUDGET2            PIC X(2).
               10  DE-BUDGET3            PIC X(2).
               10  DE-BUDGET4            PIC X(3).
           05  DE-COMPANY                PIC X(3).
           05  DE-PRIME                  PIC X(3).
           05  DE-CLASS                  PIC X(3).
           05  DE-CLASS-9 REDEFINES DE-CLASS  PIC 9(3).
           05  DE-DEPT                   PIC X(4).
           05  DE-EXP-CLASS              PIC X(6).
           05  DE-EXP-CLASS-9 REDEFINES DE-EXP-CLASS
                                         PIC 9(6).
           05  DE-ADDTL-INFO             PIC X(14).
           05  DE-DESC.
               10  DE-DESC-1             PIC X(78).
               10  DE-DESC-2             PIC X(78).
               10  DE-DESC-3             PIC X(78).
               10  DE-DESC-4             PIC X(78).
               10  DE-DESC-5             PIC X(78).
           05  DE-REMARKS.
               10  DE-REMARK-1           PIC X(78).
               10  DE-REMARK-2.
                   15  FILLER            PIC X(64).
                   15  DE-EXP-DATA.
                       20  DE-EXP-LIT1   PIC XX.
                       20  FILLER        PIC X.
                       20  DE-EXP-CTR1   PIC Z9.
                       20  FILLER        PIC X.
                       20  DE-EXP-LIT2   PIC XX.
                       20  FILLER        PIC X.
                       20  DE-EXP-CTR2   PIC Z9.
                       20  FILLER        PIC X.
                       20  DE-EXP-LIT3   PIC XX.
           05  DE-DOCK-NOTIFY            PIC X(10).
           05  DE-WO                     PIC X(10).
           05  DE-COMMAND-LINE-1         PIC X(79).
           05  DE-MESSAGE-LINE-1         PIC X(79).

       01  SAVE-DE-FIELDS.
           05  SAVE-DE-FIELDS-1          PIC X(1)  VALUE SPACES.
           05  FILLER                    PIC X(881).

       01  DE-MFR-DESC.
           05  FILLER                    PIC X(10) VALUE "MANF NAME-".
           05  FILLER                    PIC X(25) VALUE SPACES.
           05  FILLER                    PIC X(10) VALUE "MANF PART-".
           05  FILLER                    PIC X(33) VALUE SPACES.

       01  SAVE-DE-REQ-NUMBER            PIC X(12).

       01  DE-FIELDS-2.
           05  V-REQ-NUMBER              PIC X(12).
           05  V-CORP-CODE               PIC X(7).
           05  V-RELEASE-STATUS          PIC X(29).
           05  V-REQ-DATE                PIC X(8).
           05  V-DATE-WANTED             PIC X(8).
           05  V-QTY                     PIC ZZZZZZZ9.
           05  V-UM                      PIC X(2).
           05  V-ORIG                    PIC X(4).
           05  V-ORIG-NAME               PIC X(16).
           05  V-DEPT                    PIC X(4).
           05  V-WO-NUMBER-2             PIC X(10).
           05  DE-COMMAND-LINE-2         PIC X(79).
           05  DE-MESSAGE-LINE-2         PIC X(79).

       01  DE-FIELDS-M.
           05  DE-COMMAND-LINE-M         PIC X(79).
           05  DE-MESSAGE-LINE-M         PIC X(79).

       01  WO-NUMBER-WORK                PIC X(10).
      **************************************************************
      **                                                          **
      **            L I N K A G E   S E C T I O N                 **
      **                                                          **
      **************************************************************

       LINKAGE SECTION.
       01  BASE                          PIC X(10).
       01  WO-NUM REDEFINES BASE         PIC X(10).
       01  BASE-STHIST                   PIC X(10).
       01  BASE-MMISA                    PIC X(24).
       01  BASE-BUDGET                   PIC X(24).
       01  BASE-DUMMY                    PIC X(24).
       COPY SEARQADD   IN COPYLIB.
       COPY REQGLOBS   IN COPYLIB.
       COPY MEMPL      IN COPYLIB.
       COPY VCOMLINK   IN COPYLIB.
       COPY LANGSUB    IN COPYLIB.
       COPY ESCNAME   IN COPYLIB.

       PROCEDURE DIVISION USING          BASE
                                         BASE-STHIST,
                                         BASE-MMISA,
                                         BASE-BUDGET,
                                         BASE-DUMMY,
                                         RQADD-PARMS,
                                         REQ-GLOBALS,
                                         BUF-MEMPL,
                                         VIEW-COMAREA,
                                         LANGUAGE-PARMS,
                                         ESC-NAME.

       1-HSK.
           MOVE "COPY" TO HOLD-COPY-MSG.
           OPEN INPUT MPLTINFO-I, DREQITM-I, MREQ-I, MVALIDUM-I,
             DREQD-I, PER-PERSONNEL-I, MCLASS-I, MVALIDPLTDATA-I.
           OPEN INPUT MSTORERM-I.
           OPEN I-O DISPLAY-FILE.
           MOVE "RQ"                     TO   STORES-COMAREA.
           MOVE SPACES                   TO   SAVE-DE-FIELDS.
           MOVE SPACES                   TO   SAVE-DE-REQ-NUMBER.
           MOVE SPACES                   TO   CMR-DATA,
                                              CMR-COMPANY,
                                              CMR-PRIME,
                                              SAVE-CMR-REQ-NUMBER
                                              SAVE-WO-ITEM-NUMBER.

      *    "CREATE"
           MOVE   3 TO LANG-SETNUM.
           MOVE 165 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER           TO   HOLD-CREATE-MSG.
      *    "DELETE"
           MOVE   4 TO LANG-SETNUM.
           MOVE  40 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER           TO   HOLD-DELETE-MSG.
      *    "MODIFY"
           MOVE  13 TO LANG-SETNUM.
           MOVE  53 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER           TO   HOLD-MODIFY-MSG.

      *------ USER HAS TO ENTER HIS ID AND PASSWORD BEFORE HE CAN
      *------ CREATE REQS. "R" TELLS VALIDATE FOR ADDING REQ
      *    IF RQADD-REQ-NO = SPACES
           IF RQADD-FUNCTION = SPACES
               MOVE "R"                  TO   EAVALID-TYPE
               CALL "SEAVALID" USING     BASE,
                                         BASE-MMISA,
                                         EAVALID-PARMS,
                                         VIEW-COMAREA,
                                         LANGUAGE-PARMS,
                                         BUF-MEMPL
               IF EAVALID-OK NOT = "Y"
                   GO TO 1900-QUIT.

      *-------- FIND OUT IF PLANT WANTS CURRENCY CODE TO BE SHOWN
      *-------- ON SCREENS.
           MOVE "PREQ"                   TO  MPLTINFO-ARG.
           MOVE 0 TO COND-WORD.
           MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-I-REC.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF COND-WORD NOT = 0
               MOVE "N"                        TO SAVE-REQ-CURR-SW
                                                  SAVE-REQ-SYNR3-SW
           ELSE
               MOVE MPLTINFO-REQ-SYNR3-SW      TO SAVE-REQ-SYNR3-SW
               IF MPLTINFO-REQ-CURR-SW = SPACES
                   MOVE "N"                    TO SAVE-REQ-CURR-SW
               ELSE
                   MOVE MPLTINFO-REQ-CURR-SW   TO SAVE-REQ-CURR-SW.

      *-------- GET PLANT'S HOME CURRENCY CODE
           MOVE "CCHM"                   TO  MPLTINFO-ARG.
           MOVE 0 TO COND-WORD.
           MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-I-REC.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF COND-WORD NOT = 0
               MOVE SPACES               TO   SAVE-HOME-CUR-CODE
           ELSE
               MOVE MPLTINFO-HOME-CUR-CODE  TO   SAVE-HOME-CUR-CODE.

           MOVE "Y"                      TO  SAVE-PACD-SW.
           MOVE "PACD"                   TO  MPLTINFO-ARG.
           MOVE 0 TO COND-WORD.
           MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-I-REC.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF COND-WORD NOT = 0
               MOVE "Y"                  TO   SAVE-PACD-SW
           ELSE
           MOVE MPLTINFO-PACD-SW         TO   SAVE-PACD-SW.

      *-------- FIND OUT IF PLANT REQUIRES USERID ON REQ NOTIFY
      *-------- MOVED THIS LOGIC BEFORE FIND OF "P 01" BECAUSE THESE
      *-------- FIELDS ARE NOT MOVED TO SAVE AREAS.
           MOVE "PDER"                   TO  MPLTINFO-ARG.
           MOVE 0 TO COND-WORD.
           MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-I-REC.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF COND-WORD NOT = 0
               MOVE "N"                  TO   SAVE-REQ-USERID
           ELSE
               IF MPLTINFO-PDER-USERID = SPACES
                   MOVE "N"              TO   SAVE-REQ-USERID
               ELSE
                   MOVE MPLTINFO-PDER-USERID   TO   SAVE-REQ-USERID.

           MOVE "P 01"                   TO   MPLTINFO-ARG.
      *    CALL "DBGET" USING BASE, DSET-MPLTINFO, MODE7, STATUS-AREA,
      *      ALL-ITEMS, BUF-MPLTINFO, MPLTINFO-ARG.
           MOVE 0 TO COND-WORD.
           MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-I-REC.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF NOT GOOD-CALL
               MOVE "DBGET ERR MPLTINFO P 01 1000-H" TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

           IF SAVE-REQ-SYNR3-SW = "Y"
               MOVE "  EXPENSE     SAP INT ORD # " TO SAVE-HDG1
               MOVE "   CODE        (CWIP/EWIP)  " TO SAVE-HDG2
           ELSE
           IF SAVE-PACD-SW = "N"
               MOVE " NEW WORK                   " TO SAVE-HDG1
               MOVE "(ADDL DATA)  ADDITIONAL INFO" TO SAVE-HDG2
           ELSE
               MOVE "  EXP/NW                    " TO SAVE-HDG1
               MOVE "(ADDL DATA)  ADDITIONAL INFO" TO SAVE-HDG2.

           MOVE SPACES                   TO   CMR-REQ-NUMBER.
           PERFORM 6000-MAIN THRU 6990-MAIN-X
               UNTIL VIEW-LASTKEY = 3.
           CLOSE MPLTINFO-I, DREQITM-I, MREQ-I, DREQD-I,
             PER-PERSONNEL-I MCLASS-I, MVALIDPLTDATA-I, MVALIDUM-I.
           CLOSE MSTORERM-I.
           CLOSE DISPLAY-FILE.
       1900-QUIT.
           GOBACK.

       2100-BLOWUP.
           MOVE "SEARQADD"               TO   BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
             VIEW-COMAREA FILE-STATUS BU-DISPLAY-MSG
             BU-DISPLAY-FLDS.

       4030-SETERROR.
           MOVE B"1" TO IND (99).
           MOVE B"1" TO IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE-1, DE-MESSAGE-LINE-2.

       4040-CLEAR-FORM.
           MOVE SPACES TO MESSAGE-BUFFER.
           MOVE SPACES                   TO   DE-FIELDS.
           MOVE ZERO TO DE-QTY, DE-EST-UNIT-PRICE, DE-EXP-CLASS,
                        DE-EST-UNIT-PRICE-2.

      ******************************************************************
      **                                                              **
      **                      M A I N   M E N U                       **
      **                                                              **
      ******************************************************************
       6000-MAIN.
      *------ IF CALLING PROGRAM PASSED A REQ NUMBER, GO STRAIGHT TO
      *------ THE MODIFY SCREEN.
           IF RQADD-REQ-NO NOT = SPACES
               MOVE 2                    TO   VIEW-LASTKEY
               GO TO 6010-CHOOSE-FUNCTION.

      *------ IF CALLING PROGRAM PASSED A WORK ORDER, GO STRAIGHT TO
      *------ THE ADD SCREEN.
           IF WO-NUM = "  STORES;" OR SPACES
               NEXT SENTENCE
           ELSE
               MOVE 1                    TO   VIEW-LASTKEY
               GO TO 6010-CHOOSE-FUNCTION.

       6005-GETNEXTFORM.
           MOVE "    "                   TO   SAVE-DEPT.
           MOVE "EARQMENU"               TO   VIEW-NFNAME.
           PERFORM 4040-CLEAR-FORM.

       6010-SHOWFORM.
           PERFORM 998-SET-FUNCTION-KEYS THRU 998-SFK-X.
           MOVE DE-FIELDS-M TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC TO DE-FIELDS-M.

       6010-CHOOSE-FUNCTION.
           IF VIEW-LASTKEY = 1
               PERFORM 6300-ADD THRU 6390-A-X
           ELSE
           IF VIEW-LASTKEY = 2
               MOVE "M"                  TO   MOD-DEL-FLAG
               PERFORM 6500-MOD-DEL THRU 6590-MD-X
               IF RQADD-FUNCTION = "E2"
                   GO TO 6990-MAIN-X
               ELSE
               NEXT SENTENCE
           ELSE
           IF VIEW-LASTKEY = 3
               GO TO 6990-MAIN-X
           ELSE
           IF VIEW-LASTKEY = 6
               MOVE SPACES           TO   REQI-DATA
               MOVE MEMPL-EMPL       TO   INQ-CC-INPUT
               MOVE "N"              TO   INQ-INQ-FLAG
               IF MEMPL-INQUIRE-CAP = "Y"
                   MOVE SPACES       TO   INQ-CC-INPUT
                   MOVE "Y"          TO   INQ-INQ-FLAG
               END-IF
               MOVE SRF-MPLTINFO-COMPANY  TO   MPLT-COMP-4
      *------ NOTE: F3 OUT OF SMREQINQ COMES BACK TO MENU
               CALL "SMREQINQ" USING REQI-RET-CODE,
                                     BASE,
                                     BASE-STHIST,
                                     BASE-MMISA,
                                     BASE-BUDGET,
                                     STATUS-AREA,
                                     VIEW-COMAREA,
                                     LANGUAGE-PARMS,
                                     REQI-DATA,
                                     REQ-GLOBALS,
                                     MPLT-COMP-4,
                                     SRF-SPOOL-PRT-NO,
                                     ESC-NAME
           ELSE
           IF VIEW-LASTKEY = 8
               MOVE "D"                  TO   MOD-DEL-FLAG
               PERFORM 6500-MOD-DEL THRU 6590-MD-X.

           GO TO 6005-GETNEXTFORM.

      ******************************************************************
      **                                                              **
      **                    A D D   R E Q                             **
      **                                                              **
      ******************************************************************
       6300-ADD.
           IF SAVE-PACD-SW = "N"
               IF MPLTINFO-COMPANY = "692"
                   MOVE "EARQADDLE"      TO   VIEW-NFNAME
               ELSE
               MOVE "EARQADDL"           TO   VIEW-NFNAME
           ELSE
           MOVE "EARQADD"                TO   VIEW-NFNAME.
           MOVE SPACES                   TO   MESSAGE-BUFFER.
           PERFORM 4040-CLEAR-FORM.
       6305-PUTBUFFER.
           MOVE HOLD-CREATE-MSG          TO   V-FUNCTION.
           MOVE SAVE-HDG1                TO   DE-HDG1.
           MOVE SAVE-HDG2                TO   DE-HDG2.
           IF MPLTINFO-COMPANY = "153"
               MOVE DE-MFR-DESC          TO   DE-DESC-1.
           MOVE "M"                      TO   DE-SERVICE-FLAG.
           IF SAVE-PACD-SW = "N"
               IF VIEW-NFNAME = "EARQADDLEP"
                   MOVE "E"              TO   DE-REQ-NUMBER-EP
                   MOVE "NON-STR"        TO   DE-CORP-CODE
               ELSE
               MOVE "NON-STR"            TO   DE-CORP-CODE
           ELSE
           MOVE "NON-STR"                TO   DE-CORP-CODE
           MOVE CMR-REQ-NUMBER           TO   DE-REQ-NUMBER
           MOVE MPLTINFO-COMPANY         TO   DE-COMPANY
           MOVE MPLTINFO-PRIME           TO   DE-PRIME.
           MOVE SAVE-HOME-CUR-CODE       TO   DE-CURRENCY.

      *USE PASSED WORK ORDER FROM TMODMADD, IF AVAILABLE.
           IF WO-NUM = SPACES OR "  STORES;"
               NEXT SENTENCE
           ELSE
               MOVE WO-NUM               TO   DE-WO
                                              V-WO-NUMBER.

       6310-SHOW-ADD-FORM.

      *------- IF THE PLANT DOES NOT WANT THE CURRENCY CODE TO BE
      *------- SHOWN, HIDE THE FIELDS.
           IF SAVE-REQ-CURR-SW = "N"
               MOVE B"1" TO IND (40).

      *----11/5/97 JSB, DEFAULT NOTIFY USER TO CLOCK CARD'S USER ID
           MOVE MEMPL-USERID TO DE-DOCK-NOTIFY.

           PERFORM 998-SET-FUNCTION-KEYS THRU 998-SFK-X.
           MOVE DE-FIELDS TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC TO DE-FIELDS.

           MOVE VIEW-LASTKEY             TO   SAVE-VIEW-LASTKEY.

           IF VIEW-LASTKEY = 3
               GO TO 6390-A-X.

      *----------  F1=COPY AN OLD REQ TO THE SCREEN
           IF VIEW-LASTKEY = 1
               MOVE "C"            TO MOD-DEL-FLAG
               PERFORM 6500-MOD-DEL THRU 6590-MD-X
               MOVE CMR-REQ-NUMBER TO SAVE-CMR-REQ-NUMBER
               MOVE SPACES         TO DE-REQ-NUMBER CMR-REQ-NUMBER
               IF VIEW-LASTKEY = 3
                  GO TO 6300-ADD
               ELSE
               MOVE "EARQADD"      TO VIEW-NFNAME
               GO TO 6310-SHOW-ADD-FORM.

           IF VIEW-NFNAME = "EARQADD" OR "EARQADDL"
      *M       IF VIEW-LASTKEY = 2 OR
               IF (VIEW-LASTKEY = 4 AND SAVE-REQ-CURR-SW = "N") OR
                  VIEW-LASTKEY = 5 OR
                  VIEW-LASTKEY = 7
                   MOVE  9 TO LANG-SETNUM
                   MOVE 10 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 32 TO FIELD-NUMBER
                   PERFORM 4030-SETERROR
                   GO TO 6310-SHOW-ADD-FORM
               ELSE
               IF VIEW-LASTKEY = 6
                   IF SAVE-REQ-SYNR3-SW NOT = "Y"
                       CALL "PXBVA006"
                       GO TO 6310-SHOW-ADD-FORM
                   ELSE
      *M               "INVALID FUNCTION KEY SELECTED"
                       MOVE  9 TO LANG-SETNUM
                       MOVE 10 TO LANG-MSGNUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE 32 TO FIELD-NUMBER
                       PERFORM 4030-SETERROR
                       GO TO 6310-SHOW-ADD-FORM
                   END-IF
               ELSE
               IF VIEW-LASTKEY = 8
                   IF SAVE-DE-FIELDS-1 = SPACES
      *M               "INVALID FUNCTION KEY SELECTED"
                       MOVE  9 TO LANG-SETNUM
                       MOVE 10 TO LANG-MSGNUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE 32 TO FIELD-NUMBER
                       PERFORM 4030-SETERROR
                       GO TO 6310-SHOW-ADD-FORM.

           IF VIEW-NFNAME = "EARQADDLE" OR "EARQADDLEP"
               IF VIEW-LASTKEY = 2 OR
                  (VIEW-LASTKEY = 4 AND SAVE-REQ-CURR-SW = "N") OR
                  VIEW-LASTKEY = 5 OR
                  VIEW-LASTKEY = 7 OR
                  VIEW-LASTKEY = 8
                   MOVE  9 TO LANG-SETNUM
                   MOVE 10 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 32 TO FIELD-NUMBER
                   PERFORM 4030-SETERROR
                   GO TO 6310-SHOW-ADD-FORM
               ELSE
               IF VIEW-LASTKEY = 8
                   IF SAVE-DE-FIELDS-1 = SPACES
      *M               "INVALID FUNCTION KEY SELECTED"
                       MOVE  9 TO LANG-SETNUM
                       MOVE 10 TO LANG-MSGNUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE 32 TO FIELD-NUMBER
                       PERFORM 4030-SETERROR
                       GO TO 6310-SHOW-ADD-FORM.

      *------ f2 ALLOWS THE USER TO MODIFY THE LONG DESCRIPTION FOR THE
      *------ REQ: WHATEVER REQ NUMBER IS ENTERED IN THE 'REQ NUM' BOX.
      *------ WE USE THE DISPLAY ONLY FIELD CONTAINING LAST REQ CREATED.
      *------ IF NO REQ HAS BEEN CREATED, GIVE ERROR
           IF VIEW-LASTKEY = 2
               IF DE-REQ-NUMBER = SPACES
      *            "R5: REQUISITION NUMBER DOES NOT EXIST"
                   MOVE  18 TO LANG-SETNUM
                   MOVE   5 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 32               TO   FIELD-NUMBER
                   PERFORM 4030-SETERROR
                   GO TO 6310-SHOW-ADD-FORM
               ELSE
               PERFORM 7500-CALL-REQ-DESC THRU 7510-CRD-X
               GO TO 6300-ADD.

           IF VIEW-LASTKEY = 6
               IF SAVE-PACD-SW = "N"
                   MOVE "EARQADDLEP"     TO   VIEW-NFNAME
                   GO TO 6305-PUTBUFFER.

      *------ f8 ALLOWS THE USER TO DUPLICATE THE LAST ENTERED REQ
      *------ BUT KEEP CURRENT REQ NUMBER ON SCREEN.
           IF VIEW-LASTKEY = 8
               IF SAVE-DE-FIELDS-1 = SPACES
      *            "R5: REQUISITION NUMBER DOES NOT EXIST"
                   MOVE 18               TO   LANG-SETNUM
                   MOVE  5               TO   LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 32               TO   FIELD-NUMBER
                   PERFORM 4030-SETERROR
                   GO TO 6310-SHOW-ADD-FORM
               ELSE
               MOVE DE-REQ-NUMBER        TO   SAVE-DE-REQ-NUMBER
               MOVE SAVE-DE-FIELDS       TO   DE-FIELDS
               MOVE SAVE-DE-REQ-NUMBER   TO   DE-REQ-NUMBER
               GO TO 6310-SHOW-ADD-FORM.

      *----------- SHOW CURRENCY HELP.
           IF VIEW-LASTKEY = 4 AND SAVE-REQ-CURR-SW = "Y"
               MOVE SPACES TO CGENHELP-PARMS, BU-DISPLAY-MSG
               MOVE "CURRCO" TO CGENHELP-TYPE
               CALL "CGENHELP" USING BU-DISPLAY-AREA,
                                     BU-DISPLAY-MSG,
                                     CGENHELP-PARMS,
                                     VIEW-COMAREA
               IF BU-DISPLAY-MSG NOT = SPACES
                   PERFORM 2100-BLOWUP
               END-IF
               IF CGENHELP-CODE NOT = SPACES
                   MOVE CGENHELP-CODE    TO   DE-CURRENCY-2
                   PERFORM 9030-CALL-SCURCONV
               END-IF
               GO TO 6310-SHOW-ADD-FORM.

           MOVE DE-FIELDS                TO   SAVE-DE-FIELDS.
           MOVE SPACES                   TO   SAVE-DE-REQ-NUMBER.

           IF VIEW-NFNAME = "EARQADDLEP"
      *M   "REQUISITION ALREADY EXISTS"
                MOVE DE-REQ-NUMBER       TO   REQ-ARG
                MOVE REQ-ARG             TO   REQNO OF MREQ-I-REC
                PERFORM 6392-READ-MREQ
                IF COND-WORD = 0
                    MOVE 18              TO   LANG-SETNUM
                    MOVE 74              TO   LANG-MSGNUM
                    PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                    MOVE 32              TO   FIELD-NUMBER
                    PERFORM 4030-SETERROR
                    GO TO 6310-SHOW-ADD-FORM.

           IF SAVE-PACD-SW = "N" OR SAVE-REQ-SYNR3-SW = "Y"
               MOVE "  "          TO RET-CODE
               MOVE DE-EXP-CLASS  TO SHIFT-FIELD
               CALL "TRSHIFT" USING RET-CODE, SHIFT-FIELD
               IF SHIFT8-9 NUMERIC
                   MOVE SHIFT-EXP TO DE-EXP-CLASS.

      *----------- FOR R3 PLANTS, EXPENSE CLASS HAS TO BE BETWEEN
      *----------- 100 AND 999.
           IF SAVE-REQ-SYNR3-SW = "Y"
               IF DE-EXP-CLASS < "000100" OR DE-EXP-CLASS > "000999"
      *M           "INVALID EXPENSE CLASS; MUST BE BETWEEN 100 - 999"
                   MOVE   9 TO LANG-SETNUM
                   MOVE 116 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE  21 TO FIELD-NUMBER
                   PERFORM 4030-SETERROR
                   GO TO 6310-SHOW-ADD-FORM.

           IF SAVE-REQ-SYNR3-SW = "Y"
               IF DE-DATE-WANTED = "        "
      *M           "DATE WANTED IS A REQUIRED FIELD FOR SAP"
                   MOVE   4 TO LANG-SETNUM
                   MOVE  57 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE   9 TO FIELD-NUMBER
                   PERFORM 4030-SETERROR
                   GO TO 6310-SHOW-ADD-FORM.

      *    IF SAVE-REQ-SYNR3-SW = "Y"
      *        IF DE-UM = "  "
      *M           "NO UNIT OF MEASURE GIVEN"
      *            MOVE  14 TO LANG-SETNUM
      *            MOVE  34 TO LANG-MSGNUM
      *            PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
      *            MOVE   4 TO FIELD-NUMBER
      *            PERFORM 4030-SETERROR
      *            GO TO 6310-SHOW-ADD-FORM.

           IF MPLTINFO-COMPANY = "285"
               IF DE-CLASS NOT = "    "
                   IF DE-EXP-CLASS = "      " OR "000000"
      *M             "EXPENSE CLASS/NEW WORK IS REQUIRED"
                     MOVE   5 TO LANG-SETNUM
                     MOVE  67 TO LANG-MSGNUM
                     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                     MOVE DE-CLASS TO MSG-FLD
                     MOVE  21 TO FIELD-NUMBER
                     PERFORM 4030-SETERROR
                     GO TO 6310-SHOW-ADD-FORM
                   END-IF
                   MOVE DE-EXP-CLASS  TO SHIFT-FIELD
                   CALL "TRSHIFT" USING RET-CODE, SHIFT-FIELD
                   IF SHIFT8-9 NUMERIC
                       MOVE SHIFT-EXP TO DE-EXP-CLASS
                   END-IF
                   MOVE "NW" TO VALID-ARG-1-2
                   MOVE DE-EXP-CLASS TO VALID-ARG-3-8
                   PERFORM 9000-START-MVALIDPLTDATA
                   IF COND-WORD = 17
                       MOVE "EC" TO VALID-ARG-1-2
                       PERFORM 9000-START-MVALIDPLTDATA
                       IF COND-WORD = 17
      *M                 "EXP CLASS/NEW WORK INVALID"
                         MOVE   5 TO LANG-SETNUM
                         MOVE  68 TO LANG-MSGNUM
                         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                         MOVE  21 TO FIELD-NUMBER
                         PERFORM 4030-SETERROR
                         GO TO 6310-SHOW-ADD-FORM
                       END-IF
                   END-IF
               END-IF
               IF DE-CLASS = "   "
      *M           "CLASS IS A REQUIRED FIELD
                   MOVE   3 TO LANG-SETNUM
                   MOVE 198 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE  34 TO FIELD-NUMBER
                   PERFORM 4030-SETERROR
                   GO TO 6310-SHOW-ADD-FORM
               ELSE
               MOVE DE-CLASS-9 TO PLT-ARG
               PERFORM 9020-START-MCLASS
               IF COND-WORD = 17
      *M           "CLASS ENTERED IS INVALID
                   MOVE   3 TO LANG-SETNUM
                   MOVE 199 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE DE-CLASS TO MSG-FLD
                   MOVE  34 TO FIELD-NUMBER
                   PERFORM 4030-SETERROR
                   GO TO 6310-SHOW-ADD-FORM
               END-IF.

           IF DE-DEPT = "    "
               NEXT SENTENCE
           ELSE
           IF MPLTINFO-COMPANY = "631"
               IF DE-DEPT = "1210"
      *M       "DEPARTMENT ENTERED IS INVALID CHARGE DEPARTMENT"
                   MOVE  4 TO LANG-SETNUM
                   MOVE 54 TO LANG-MSGNUM
                   MOVE 20 TO FIELD-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   PERFORM 4030-SETERROR
                   GO TO 6310-SHOW-ADD-FORM
               ELSE
               IF DE-EXP-CLASS = "000000"
      *M       "EXPENSE CLASS/NEW WORK INVALID - CHECK MATERIALS CTL"
                   MOVE  5 TO LANG-SETNUM
                   MOVE 68 TO LANG-MSGNUM
                   MOVE 21 TO FIELD-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   PERFORM 4030-SETERROR
                   GO TO 6310-SHOW-ADD-FORM
               ELSE
               IF DE-EXP-CLASS > "010000"
      *M       "NEW WORK ORDERED ITEMS MUST BE TIED TO A W/O
                   MOVE 14  TO LANG-SETNUM
                   MOVE 137 TO LANG-MSGNUM
                   MOVE 21 TO FIELD-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   PERFORM 4030-SETERROR
                   GO TO 6310-SHOW-ADD-FORM
               ELSE
               NEXT SENTENCE
           ELSE
           IF VIEW-NFNAME = "EARQADDLE" OR "EARQADDLEP"
               MOVE "DP"             TO   VALID-ARG-1-2
               MOVE DE-DEPT          TO   VALID-ARG-3-10
               PERFORM 9000-START-MVALIDPLTDATA
               IF COND-WORD = 17
      *M       "DEPARTMENT CODE DOES NOT EXIST"
                   MOVE   4 TO LANG-SETNUM
                   MOVE  12 TO LANG-MSGNUM
                   MOVE  20 TO FIELD-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   PERFORM 4030-SETERROR
                   GO TO 6310-SHOW-ADD-FORM
               ELSE
               PERFORM 9000-GET-MVALIDPLTDATA
               IF COND-WORD = 15
      *M       "DEPARTMENT CODE DOES NOT EXIST"
                   MOVE   4 TO LANG-SETNUM
                   MOVE  12 TO LANG-MSGNUM
                   MOVE  20 TO FIELD-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   PERFORM 4030-SETERROR
                   GO TO 6310-SHOW-ADD-FORM
               ELSE
               MOVE VALID-DATA-CO TO DE-COMPANY
               MOVE VALID-DATA-PR TO DE-PRIME
               MOVE DE-FIELDS TO DISPLAY-REC
               MOVE B"1" TO IND (98)
               PERFORM 998-WRITE-SCREEN
               PERFORM 998-AUTO-READ-SCREEN.

      *------ EDIT DEPARTMENTS, EXP CLASS, WORKORDER, ETC.
           MOVE SPACES                   TO   MESSAGE-BUFFER-1.
           PERFORM 7400-EDITS THRU 7490-E-X.
           IF MESSAGE-BUFFER-1 NOT = SPACES
               GO TO 6310-SHOW-ADD-FORM.

      *------ 10/15/97 JSB,
      *------ EDIT NOTIFY USER ID
           IF DE-DOCK-NOTIFY = SPACES
               IF SAVE-REQ-USERID = "Y"
      *            *** A VALID USERID IS REQUIRED ***
                   MOVE  22 TO LANG-SETNUM
                   MOVE  27 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 29  TO  FIELD-NUMBER
                   PERFORM 4030-SETERROR
                   GO TO 6310-SHOW-ADD-FORM
               END-IF
           ELSE
               CALL "MCXCHKUSR" USING DE-DOCK-NOTIFY VALID-USER
               IF VALID-USER = "N"
      *            *** A VALID USERID IS REQUIRED ***
                   MOVE  22 TO LANG-SETNUM
                   MOVE  27 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 29  TO  FIELD-NUMBER
                   PERFORM 4030-SETERROR
                   GO TO 6310-SHOW-ADD-FORM
               END-IF
           END-IF.


      *--------- IF ANOTHER CURRENCY IS ENTERED, CONVERT TO HOME
      *--------- CURRENCY AND RE-DISPLAY SCREEN.
           IF SAVE-REQ-CURR-SW = "Y"
               IF (DE-CURRENCY-2 > SPACES AND DE-EST-UNIT-PRICE = 0) OR
                  (DE-CURRENCY-2 NOT = SAVE-OTHER-CURRENCY) OR
                  (DE-EST-UNIT-PRICE-2 NOT = SAVE-OTHER-EST-PRICE)
                    PERFORM 9030-CALL-SCURCONV
                    GO TO 6310-SHOW-ADD-FORM.

      *------ ADDED THE FOLLOWING CODE 2-13-95 TO CHECK TO
      *------ SEE IF THE DEPARTMENT THAT WAS ENTERED WAS AN
      *------ "EXPLODE FROM" DEPARTMENT. IF IT IS, THEN THE
      *------ MVALIDPLTDATA BUFFER SHOULD CONTAIN A NUMBER
      *------ OF DEPARTMENTS THAT THE REQUISITION CAN BE
      *------ "EXPLODED TO". IF IT IS NOT AN "EXPLODE FROM"
      *------ CHECK THE "EXPLODE TO" DEPTS TO SEE IF THE
      *------ THE DEAPRTMENT THAT WAS ENTERED IS ONE. IF IT
      *------ IS THE DEPARTMENT IS FLAGGED AS INVALID.
           MOVE 0                        TO   EXPLODE-SW.
           MOVE "ED"                     TO   VALID-ARG-1-2.
           MOVE DE-DEPT                  TO   VALID-ARG-3-10.
           PERFORM 9000-START-MVALIDPLTDATA.
           IF COND-WORD = 0
               PERFORM 9000-GET-MVALIDPLTDATA
               IF COND-WORD = 15
                   NEXT SENTENCE
               ELSE
               IF MEMPL-EXPLODE-CAP = "Y"
                   MOVE 0                TO   SUB
                   PERFORM 6391-SET-CTRS THRU 6391-SC-X
                   MOVE "**"             TO   DE-EXP-LIT1
                                              DE-EXP-LIT3
                   MOVE "OF"             TO   DE-EXP-LIT2
                   MOVE SPACES           TO   MESSAGE-BUFFER
                   MOVE 1                TO   SUB
                                              DE-EXP-CTR1
                   MOVE DE-DEPT          TO   SAVE-EXPLODE-DEPT
                   MOVE V-E-D (SUB)      TO   DE-DEPT
                   MOVE 1                TO   EXPLODE-SW
               ELSE
               MOVE 40                   TO   LANG-SETNUM
               MOVE 85                   TO   LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 20                   TO   FIELD-NUMBER
               PERFORM 4030-SETERROR
               GO TO 6310-SHOW-ADD-FORM.

           IF SAVE-PACD-SW = "N"
               MOVE DE-FIELDS TO DISPLAY-REC
               MOVE B"1" TO IND (98)
               PERFORM 998-WRITE-SCREEN
               PERFORM 998-AUTO-READ-SCREEN.

      *------ IF A CODED ITEM, AND THERE IS ANOTHER OPEN REQ FOR THAT
      *------ CODE, BRING UP A WARNING SCREEN.
           IF DE-CORP-CODE = "NON-STR"
               GO TO 6310-SHOW-ADD-LOOP
           ELSE
           PERFORM 7600-CHECK-FOR-OPEN-REQ THRU 7690-CFOR-X
           IF OPEN-REQ-SW = "Y"
               PERFORM 8000-READ-SCREEN-FOR-ENTER THRU 8090-RSFE-X
               IF VIEW-LASTKEY = 0
                   NEXT SENTENCE
               ELSE
               GO TO 6310-SHOW-ADD-FORM.
      **************************************************************
      *    ADDED CODE TO CHECK THAT A UNIT PRICE IS ENTERED FOR    *
      *    A CODED REQUISITION IF NO MARKET COST EXISTS ON THE     *
      *    STOREROOM MASTER.....    J.E.C. 10/26/99                *
      **************************************************************
           MOVE DE-CORP-CODE TO CORPCDE OF MSTORERM-REC.
           PERFORM 6392-READ-MSTORERM.
           MOVE SPACE          TO  SAVE-AUTH-FLAG.
           MOVE STR-AUTH-FLAG  TO  SAVE-AUTH-FLAG.
           IF STR-MKT-COST-X = SPACES
               MOVE 0 TO STR-MKT-COST.
           IF STR-MKT-COST = 0
               IF DE-EST-UNIT-PRICE > 0
                   MOVE DE-EST-UNIT-PRICE TO  CMR-EST-UNIT-PRICE
                                              CMR-EST-UNIT-PRICE-CURR
               ELSE
      *    NO MKT COST SET FOR CODE - INPUT AND PRESS 'ENTER'
               MOVE 14138 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 5 TO FIELD-NUMBER
               PERFORM 4030-SETERROR
               GO TO 6310-SHOW-ADD-FORM.

       6310-SHOW-ADD-LOOP.
           MOVE "CR"                     TO   CMR-CALL-MODE.
           MOVE SPACES                   TO   MESSAGE-BUFFER.
           PERFORM 7000-MOVE-TO-CMANREQ THRU 7010-MTC-X.
           IF MESSAGE-BUFFER-1 NOT = SPACES
               GO TO 6310-SHOW-ADD-FORM.

           IF VIEW-NFNAME = "EARQADDLEP"
               MOVE DE-REQ-NUMBER        TO   CMR-REQ-NUMBER
           ELSE
           IF MOD-DEL-FLAG = "C"
               IF SAVE-CMR-REQ-NUMBER NOT = "            "
                   IF CMR-DESC-LINE (5) = SPACES
                       MOVE SPACES       TO   CMR-REQ-NUMBER
                   ELSE
                   MOVE SAVE-CMR-REQ-NUMBER  TO   CMR-REQ-NUMBER
               ELSE
               MOVE SPACES               TO   CMR-REQ-NUMBER
           ELSE
           MOVE SPACES                   TO   CMR-REQ-NUMBER.

      *    IF DE-WO = SPACES
      *        MOVE SPACES               TO   CMR-WO-NUMBER
      *    ELSE
           MOVE DE-WO                    TO   CMR-WO-NUMBER.
           CALL "CMANREQ" USING          BASE,
                                         BASE-MMISA,
                                         BASE-BUDGET,
                                         BASE-DUMMY,
                                         MESSAGE-BUFFER,
                                         CMR-CALL-MODE,
                                         CMR-DATA,
                                         CMR-DESC,
                                         CMR-REMARKS,
                                         CMR-RETURNED-DATA,
                                         CMR-MISC-PARMS,
                                         REQ-GLOBALS,
                                         LANGUAGE-PARMS,
                                         ESC-NAME,
                                         VIEW-COMAREA.
           IF CMR-RETURN-STATUS = "BC"
      *        "INVALID CORPORATE CODE"
               MOVE 1                    TO   FIELD-NUMBER
               PERFORM 4030-SETERROR
               GO TO 6310-SHOW-ADD-FORM
           ELSE
           IF CMR-RETURN-STATUS = "BU"
      *        "BAD UNIT OF MEASURE"
               MOVE 4                    TO   FIELD-NUMBER
               PERFORM 4030-SETERROR
               GO TO 6310-SHOW-ADD-FORM.

           IF DE-WO NOT = SPACES
               NEXT SENTENCE
           ELSE
           IF EXPLODE-SW = 1
               NEXT SENTENCE
           ELSE
           PERFORM 4040-CLEAR-FORM.
           MOVE CMR-REQ-NUMBER           TO   DE-REQ-NUMBER.
           MOVE "            "           TO   SAVE-CMR-REQ-NUMBER.

      *------ SHOW THE USER THE REQ NUMBER CREATED.
      *    "R41: REQUISITION HAS BEEN CREATED.  REQ NUMBER:"
           MOVE  18 TO LANG-SETNUM.
           MOVE  41 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE CMR-REQ-NUMBER           TO   MSG-FLD.
           MOVE MESSAGE-BUFFER           TO   DE-COMMAND-LINE-1.
           MOVE DE-FIELDS                TO   DISPLAY-REC.
           MOVE B"1" TO IND (98).
           PERFORM 998-WRITE-SCREEN.
           PERFORM 998-AUTO-READ-SCREEN,
           CALL "CLPAUSE2"
      *    MOVE SPACES TO CMR-REQ-NUMBER.

           IF EXPLODE-SW = 1
               ADD 1                     TO   SUB
               IF SUB > 10
                   PERFORM 4040-CLEAR-FORM
               ELSE
               MOVE V-E-D (SUB)          TO   DE-DEPT
               MOVE SUB                  TO   DE-EXP-CTR1
               IF DE-DEPT = SPACES
                   PERFORM 4040-CLEAR-FORM
               ELSE
               MOVE 05101 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE SAVE-EXPLODE-DEPT    TO   MESSAGE-DEPT
               MOVE MESSAGE-BUFFER       TO   DE-COMMAND-LINE-1
               MOVE DE-FIELDS            TO   DISPLAY-REC
               MOVE B"1"                 TO   IND (98)
               PERFORM 998-WRITE-SCREEN
               PERFORM 998-AUTO-READ-SCREEN
               CALL "CLPAUSE2"
               GO TO 6310-SHOW-ADD-LOOP.

           IF DE-WO = SPACES
               PERFORM 4040-CLEAR-FORM
               GO TO 6305-PUTBUFFER.
           MOVE SPACES                   TO   PART-WORKAREA.
           MOVE DE-WO                    TO   WO-NUMBER-WORK.
           CALL "TALWONO" USING WO-NUMBER-WORK,
                                RETURN-STATUS.
           MOVE WO-NUMBER-WORK           TO   WO-NUMBER.
           IF DE-CORP-CODE = "NON-STR"
               MOVE SPACES               TO   STORES-CODE
           ELSE
           MOVE DE-CORP-CODE             TO   STORES-CODE
                                              CORPCDE OF MSTORERM-REC.
           IF DE-CORP-CODE = "NON-STR"
               MOVE DE-EST-UNIT-PRICE    TO   AVERAGE-COST
           ELSE
           PERFORM 6392-READ-MSTORERM
           MOVE STR-MKT-COST             TO   AVG-COST.
           MOVE DE-QTY                   TO   QTY-ISSUED.
           MOVE DE-STAGING-AREA          TO   PART-STAGE.
           MOVE DE-PRIME                 TO   PART-PRIME.
           MOVE DE-CLASS                 TO   PART-SUB.
           MOVE DE-DEPT                  TO   DEPT-CHARGED.
           MOVE DE-EXP-CLASS             TO   EXP-CLASSIFICATION.
           MOVE DE-UM                    TO   UNIT-OF-MEAS.
           MOVE MEMPL-EMPL               TO   EMPLOYEE-ID.
           MOVE DE-REQ-NUMBER            TO   ISSREQ-NUMBER.
           IF DE-CORP-CODE = "NON-STR"
                MOVE DE-DESC-1           TO   PART-DESC-1
                MOVE DE-DESC-2           TO   PART-DESC-2
                MOVE DE-DESC-3           TO   PART-DESC-3
                MOVE DE-DESC-4           TO   PART-DESC-4
                MOVE DE-DESC-5           TO   PART-DESC-5
           ELSE
           MOVE "F"                      TO   CDESC-DESC-OPTION
           MOVE 5                        TO   CDESC-LINES-TO-GET
           MOVE "N"                      TO   CDESC-LOCAL-DESC-OPTION
           MOVE DE-CORP-CODE             TO   CODE-ARG
           CALL "CDESC" USING CDESC-RET-CODE, BASE, STATUS-AREA,
                          BU-DISPLAY-MSG, CODE-ARG, CDESC-DATA
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               PERFORM 2100-BLOWUP
           ELSE
           MOVE CDESC (1)                TO   PART-DESC-1
           MOVE CDESC (2)                TO   PART-DESC-2
           MOVE CDESC (3)                TO   PART-DESC-3
           MOVE CDESC (4)                TO   PART-DESC-4
           MOVE CDESC (5)                TO   PART-DESC-5.
           MOVE DE-REMARK-1              TO   PART-REMARK-1.
           MOVE DE-REMARK-2              TO   PART-REMARK-2.
           MOVE "SEARQADD"               TO   CALLING-PGM.
           MOVE "A"                      TO   CALLING-MODE.
           MOVE "  "                     TO   RETURN-STATUS.
           CALL "ISSPARTS" USING PART-WORKAREA,
                                 BASE,
                                 LANGUAGE-PARMS,
                                 MESSAGE-BUFFER.
           MOVE "        "               TO   CALLING-PGM.
           PERFORM 4040-CLEAR-FORM.
           GO TO 6305-PUTBUFFER.

       6390-A-X.    EXIT.

       6391-SET-CTRS.
           ADD 1 TO SUB.
           IF SUB > 10
               MOVE 10                   TO   DE-EXP-CTR2
               GO TO 6391-SC-X
           ELSE
           IF V-E-D (SUB) = "    "
               SUBTRACT 1 FROM SUB GIVING DE-EXP-CTR2
               GO TO 6391-SC-X
           ELSE
           GO TO 6391-SET-CTRS.
       6391-SC-X.    EXIT.

       6392-READ-MREQ.
           MOVE 0                        TO   COND-WORD.
           READ MREQ-I INTO BUF-MREQ
               INVALID KEY    MOVE 17 TO COND-WORD.

       6392-READ-MSTORERM.
           READ MSTORERM-I INTO BUF-MSTORERM
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 0                    TO   AVG-COST
           ELSE
           MOVE STR-AVG-COST             TO   AVG-COST.

      ******************************************************************
      **                                                              **
      **             M O D I F Y / D E L E T E   R E Q                **
      **                                                              **
      ******************************************************************
       6500-MOD-DEL.
      *------- GET THE FATHER FORM FOR MODIFY OR DELETE
           IF SAVE-PACD-SW = "N"
               MOVE "EARQADDL"           TO   VIEW-NFNAME
           ELSE
           MOVE "EARQADD"                TO   VIEW-NFNAME.
           MOVE SPACES TO CMANREQ-MESSAGE-BUFFER-1.
           MOVE 0                        TO   LINK-TO-WO-SW.

       6505-MOD-DEL-GETFORM-1.
      *------- GET SON FORM FOR LEVEL NUMBER TO MODIFY ENTRY
           IF SAVE-PACD-SW = "N"
               MOVE "EARQADD1L"          TO   VIEW-NFNAME
           ELSE
           MOVE "EARQADD1"               TO   VIEW-NFNAME.
           PERFORM 4040-CLEAR-FORM.
           IF MOD-DEL-FLAG = "M"
               MOVE HOLD-MODIFY-MSG      TO   V-FUNCTION
           ELSE
           MOVE HOLD-DELETE-MSG          TO   V-FUNCTION.

           MOVE SAVE-HDG1                TO   DE-HDG1.
           MOVE SAVE-HDG2                TO   DE-HDG2.

           IF MOD-DEL-FLAG = "C"
              MOVE HOLD-COPY-MSG TO V-FUNCTION
              GO TO 6515-REQUEST-REQ.

      *------ 'CMANREQ' MAY HAVE RETURNED ERROR MESSAGE: "WARNING:
      *------  MODIFICATION CHANGED REQ PATH: HAS BEEN RE-QUEUED"
           IF CMANREQ-MESSAGE-BUFFER-1 NOT = SPACES
               MOVE CMANREQ-MESSAGE-BUFFER    TO   MESSAGE-BUFFER
               PERFORM 4030-SETERROR.

       6510-SHOW-MOD-FORM-1.
      *------ IF CALLING PGM PASSED REQ# TO MOD, SKIP 1ST SCRN
           IF RQADD-REQ-NO NOT = SPACES
               MOVE RQADD-REQ-NO         TO   DE-REQ-NUMBER
               MOVE SPACES               TO   RQADD-REQ-NO
               MOVE 0                    TO   VIEW-LASTKEY
               GO TO 6520-GET-REQ-DATA.

      *------- IF THE PLANT DOES NOT WANT THE CURRENCY CODE TO BE
      *------- SHOWN, HIDE THE FIELDS.
           IF SAVE-REQ-CURR-SW = "N"
               MOVE B"1" TO IND (40).


       6515-REQUEST-REQ.

      *------- IF THE PLANT DOES NOT WANT THE CURRENCY CODE TO BE
      *------- SHOWN, HIDE THE FIELDS.
           IF SAVE-REQ-CURR-SW = "N"
               MOVE B"1" TO IND (40).

           PERFORM 998-SET-FUNCTION-KEYS THRU 998-SFK-X.
           MOVE DE-FIELDS TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC TO DE-FIELDS.

           IF VIEW-LASTKEY = 3
               MOVE SPACES TO DE-REQ-NUMBER
               GO TO 6590-MD-X.

       6520-GET-REQ-DATA.
           MOVE DE-REQ-NUMBER            TO   CMR-REQ-NUMBER.
           CALL "CMANINQ" USING          BASE,
                                         BASE-MMISA,
                                         CMR-DATA,
                                         CMR-DESC,
                                         CMR-REMARKS,
                                         CMR-RETURNED-DATA,
                                         CMR-MISC-PARMS,
                                         LANGUAGE-PARMS,
                                         ESC-NAME,
                                         STATUS-AREA,
                                         BU-DISPLAY-MSG.
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               PERFORM 2100-BLOWUP.

           IF CMR-RETURN-STATUS NOT = "OK"
      *        "R5: REQUISITION NUMBER DOES NOT EXIST"
               MOVE  18 TO LANG-SETNUM
               MOVE   5 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 32                   TO   FIELD-NUMBER
               PERFORM 4030-SETERROR
               MOVE SPACES TO CMR-REQ-NUMBER
               GO TO 6510-SHOW-MOD-FORM-1.

      *----------  IF COPYING A REQ, ALLOW ANY
      *            REQ TO BE COPIED, EVEN IF ITS ON A PO, ETC.
           IF MOD-DEL-FLAG = "C"
              NEXT SENTENCE
           ELSE
      *    MOVE "M"                      TO   EAEDIT-MODE
      *
      *-----  PASS APPROPRIATE CODE TO SUBPROGRAM
      *
           IF MOD-DEL-FLAG = "M"
              MOVE "M"                   TO   EAEDIT-MODE
           ELSE
              IF MOD-DEL-FLAG = "D"
                 MOVE "D"                TO   EAEDIT-MODE
              END-IF
           END-IF
           MOVE CMR-REQ-STATUS           TO   EAEDIT-STATUS
           MOVE CMR-REQ-RELEASE-STAT     TO   EAEDIT-RELEASE-STAT
           MOVE MEMPL-EMPL               TO   EAEDIT-EMPL
           MOVE CMR-REQ-ORIG             TO   EAEDIT-ORIG
           MOVE CMR-REQ-HOLD-STATUS      TO   EAEDIT-HOLD-STATUS
           MOVE SPACES                   TO   EAEDIT-QUEUED-FLAG
           MOVE SPACES                   TO   EAEDIT-APPROVE-DATE
           MOVE CMR-AUTH-FLAG            TO   EAEDIT-AUTH-FLAG
           MOVE SPACES                   TO   MESSAGE-BUFFER
           CALL "CEAEDIT" USING          EAEDIT-PARMS,
                                         REQ-GLOBALS,
                                         BUF-MEMPL,
                                         MESSAGE-BUFFER,
                                         LANGUAGE-PARMS,
                                         BU-DISPLAY-MSG
           IF MESSAGE-BUFFER-1 NOT = SPACES
               MOVE 32                   TO   FIELD-NUMBER
               PERFORM 4030-SETERROR
               GO TO 6510-SHOW-MOD-FORM-1.

      *------ CANT DELETE MMIS REQS SINCE THEN YOU WOULD HAVE IT ON WO
      *------ BUT NOT IN CSIS.  THEY MUST DELETE FROM THE WO PROGRAM.
           IF CMR-WO-NUMBER > SPACES AND MOD-DEL-FLAG = "D"
      *        "C188: CANT DELETE MMIS REQS: MUST USE WO PROGRAM"
               MOVE   3 TO LANG-SETNUM
               MOVE 188 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE CMR-WO-NUMBER        TO   MSG-FLD
               MOVE 32                   TO   FIELD-NUMBER
               PERFORM 4030-SETERROR
               GO TO 6510-SHOW-MOD-FORM-1.

      *------ MODIFY LONG DESCRIPTION OF ENTERED REQ
           IF VIEW-LASTKEY = 2
               PERFORM 7500-CALL-REQ-DESC THRU 7510-CRD-X.

           IF SAVE-PACD-SW = "N"
               MOVE "EARQADD2L"          TO   VIEW-NFNAME
           ELSE
           MOVE "EARQADD2"               TO   VIEW-NFNAME.
           IF MOD-DEL-FLAG = "M"
               MOVE HOLD-MODIFY-MSG      TO   V-FUNCTION
           ELSE
           MOVE HOLD-DELETE-MSG          TO   V-FUNCTION.

           IF MOD-DEL-FLAG = "C"
              MOVE HOLD-CREATE-MSG TO V-FUNCTION.

           MOVE SAVE-HDG1                TO   DE-HDG1.
           MOVE SAVE-HDG2                TO   DE-HDG2.

           MOVE 4                        TO   DATE-MODE.
           MOVE CMR-DATE-REQUIRED        TO   DATE-VALIDATE-IN.
           CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
           MOVE DATE-SLASH-OUT           TO   DE-DATE-WANTED.
      *------ IF COPYING, DON'T WANT TO MOVE IN THE WO NUMBER.
      *------ OTHERWISE IT WOULD GET ADDED TO DREQD
           IF MOD-DEL-FLAG = "C"
               MOVE SPACES               TO   V-WO-NUMBER,
                                              DE-WO
           ELSE
           MOVE CMR-WO-NUMBER            TO   V-WO-NUMBER,
                                              DE-WO.
           MOVE CMR-CORP-CODE            TO   DE-CORP-CODE,
                                              SAVE-CORP-CODE.
           MOVE CMR-FOR-DEPT             TO   DE-DEPT.
           MOVE CMR-STAGING-AREA         TO   DE-STAGING-AREA.
           MOVE CMR-QTY                  TO   DE-QTY.
           MOVE CMR-UM                   TO   DE-UM.
           MOVE CMR-BUDNUM-NODASH        TO   DE-BUDGET-NUMBER.
           MOVE CMR-EST-UNIT-PRICE       TO   DE-EST-UNIT-PRICE
                                              SAVE-EST-PRICE.
           MOVE CMR-SUB                  TO   DE-CLASS.
           MOVE CMR-EXP-CLS-6DIG         TO   DE-EXP-CLASS.
           MOVE CMR-SUGGESTED-VENDOR     TO   DE-SUGGESTED-VENDOR.
           MOVE CMR-SERVICE-FLAG         TO   DE-SERVICE-FLAG.
           MOVE CMR-ADDTL-INFO           TO   DE-ADDTL-INFO.
           MOVE CMR-DESC-LINE (1)        TO   DE-DESC-1.
           MOVE CMR-DESC-LINE (2)        TO   DE-DESC-2.
           MOVE CMR-DESC-LINE (3)        TO   DE-DESC-3.
           MOVE CMR-DESC-LINE (4)        TO   DE-DESC-4.
           MOVE CMR-DESC-LINE (5)        TO   DE-DESC-5.
           MOVE CMR-REMARK-1             TO   DE-REMARK-1.
           MOVE CMR-REMARK-2             TO   DE-REMARK-2.
           MOVE CMR-DOCK-NOTIFY          TO   DE-DOCK-NOTIFY.
           MOVE CMR-COMPANY              TO   DE-COMPANY.
           MOVE CMR-PRIME                TO   DE-PRIME.
           MOVE SAVE-HOME-CUR-CODE       TO   DE-CURRENCY.
           MOVE CMR-CURRENCY             TO   DE-CURRENCY-2
                                              SAVE-OTHER-CURRENCY.
           MOVE CMR-EST-UNIT-PRICE-CURR  TO   DE-EST-UNIT-PRICE-2
                                              SAVE-OTHER-EST-PRICE.
           MOVE CMR-WO-ITEM-NUMBER       TO   SAVE-WO-ITEM-NUMBER.
           IF SAVE-PACD-SW = "N"
               MOVE DE-DEPT              TO   SAVE-DEPT.

           IF MOD-DEL-FLAG = "C"
              GO TO 6590-MD-X.

       6530-SHOW-MOD-FORM-2.

      *------- IF THE PLANT DOES NOT WANT THE CURRENCY CODE TO BE
      *------- SHOWN, HIDE THE FIELDS.
           IF SAVE-REQ-CURR-SW = "N"
               MOVE B"1" TO IND (40).

           IF MOD-DEL-FLAG = "D"
      *        "P123: PRESS 'ENTER' TO DELETE OR 'f8' TO EXIT
               MOVE  16                  TO   LANG-SETNUM
               MOVE 123                  TO   LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE-COMMAND-LINE-1
      *        PERFORM 4030-SETERROR.
           ELSE
           PERFORM 998-SET-FUNCTION-KEYS THRU 998-SFK-X.
           MOVE DE-FIELDS TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC TO DE-FIELDS.

           IF VIEW-LASTKEY = 7
               PERFORM 4040-CLEAR-FORM
               GO TO 6505-MOD-DEL-GETFORM-1
           ELSE
           IF VIEW-LASTKEY = 3
               GO TO 6590-MD-X.

      *------ MODIFY LONG DESCRIPTION OF ENTERED REQ
      *------ AFTERWARDS RE-GET THE REQ SO THEY WILL PICK UP THE MODIFIED
      *------ DATA
           IF VIEW-LASTKEY = 2
               PERFORM 7500-CALL-REQ-DESC THRU 7510-CRD-X
               MOVE 0 TO VIEW-LASTKEY
               GO TO 6520-GET-REQ-DATA.

           IF VIEW-NFNAME = "EARQADD2"
               IF VIEW-LASTKEY = 1 OR
                  (VIEW-LASTKEY = 4 AND SAVE-REQ-CURR-SW = "N") OR
                  (VIEW-LASTKEY = 4 AND MOD-DEL-FLAG = "D"    ) OR
                  VIEW-LASTKEY = 5 OR
                  VIEW-LASTKEY = 6 OR
                  VIEW-LASTKEY = 7 OR
                  VIEW-LASTKEY = 8
                   MOVE  9 TO LANG-SETNUM
                   MOVE 10 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 32 TO FIELD-NUMBER
                   PERFORM 4030-SETERROR
                   GO TO 6530-SHOW-MOD-FORM-2.

           IF VIEW-LASTKEY = 4 AND SAVE-REQ-CURR-SW = "Y"
                               AND MOD-DEL-FLAG = "M"
               MOVE SPACES TO CGENHELP-PARMS, BU-DISPLAY-MSG
               MOVE "CURRCO" TO CGENHELP-TYPE
               CALL "CGENHELP" USING BU-DISPLAY-AREA,
                                     BU-DISPLAY-MSG,
                                     CGENHELP-PARMS,
                                     VIEW-COMAREA
               IF BU-DISPLAY-MSG NOT = SPACES
                   PERFORM 2100-BLOWUP
               END-IF
               IF CGENHELP-CODE NOT = SPACES
                   MOVE CGENHELP-CODE    TO   DE-CURRENCY-2
                   PERFORM 9030-CALL-SCURCONV
               END-IF
               GO TO 6530-SHOW-MOD-FORM-2.

           IF SAVE-PACD-SW = "N" OR SAVE-REQ-SYNR3-SW = "Y"
               MOVE "  "          TO RET-CODE
               MOVE DE-EXP-CLASS  TO SHIFT-FIELD
               CALL "TRSHIFT" USING RET-CODE, SHIFT-FIELD
               IF SHIFT8-9 NUMERIC
                   MOVE SHIFT-EXP TO DE-EXP-CLASS.

      *------ ADDED THE FOLLOWING EDIT AND ERROR TO PREVENT
      *------ A CORPORATE CODE CHANGE ONCE A STORES REQUISITION
      *------ HAS BEEN CREATED.

           IF DE-CORP-CODE NOT = SAVE-CORP-CODE
      *M      "CORPORATE CODE MAY NOT BE CHANGED ONCE A REQ'S CREATED
               MOVE 03641 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 1 TO FIELD-NUMBER
               PERFORM 4030-SETERROR
               MOVE SAVE-CORP-CODE TO DE-CORP-CODE
               GO TO 6530-SHOW-MOD-FORM-2.

      *------ DONT DO EDITS IF DELETING THE REQ
           IF MOD-DEL-FLAG = "M"
              MOVE SPACES                TO   MESSAGE-BUFFER-1
               PERFORM 7400-EDITS THRU 7490-E-X
               IF MESSAGE-BUFFER-1 NOT = SPACES
                   GO TO 6530-SHOW-MOD-FORM-2
               ELSE
               MOVE 0                    TO   FIELD-NUMBER
               PERFORM 6531-CHECK-EXPLODE-DEPS THRU 6531-CED-X
               IF FIELD-NUMBER > 0
                   MOVE 04041            TO   CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   PERFORM 4030-SETERROR
                   GO TO 6530-SHOW-MOD-FORM-2
               ELSE
               MOVE 1 TO FIELD-NUMBER.

      *--------- IF ANOTHER CURRENCY IS ENTERED, CONVERT TO HOME
      *--------- CURRENCY AND RE-DISPLAY SCREEN.
           IF SAVE-REQ-CURR-SW = "Y" AND MOD-DEL-FLAG = "M"
               IF (DE-CURRENCY-2 > SPACES AND DE-EST-UNIT-PRICE = 0) OR
                  (DE-CURRENCY-2 NOT = SAVE-OTHER-CURRENCY) OR
                  (DE-EST-UNIT-PRICE-2 NOT = SAVE-OTHER-EST-PRICE)
                    PERFORM 9030-CALL-SCURCONV
                    GO TO 6530-SHOW-MOD-FORM-2.

           IF SAVE-PACD-SW = "N"
               MOVE DE-FIELDS TO DISPLAY-REC
               MOVE B"1" TO IND (98)
               PERFORM 998-WRITE-SCREEN
               PERFORM 998-AUTO-READ-SCREEN.

           MOVE SPACES TO MESSAGE-BUFFER.
           PERFORM 7000-MOVE-TO-CMANREQ THRU 7010-MTC-X.
           IF MESSAGE-BUFFER-1 NOT = SPACES
               GO TO 6530-SHOW-MOD-FORM-2.

           IF MOD-DEL-FLAG = "M"
               MOVE "UP"                 TO   CMR-CALL-MODE
               PERFORM 6532-CHECK-MOD-FIELDS THRU 6532-CMF-X
           ELSE
           MOVE "DT"                     TO   CMR-CALL-MODE.

           MOVE SPACES                   TO   CMANREQ-MESSAGE-BUFFER-1.

           CALL "CMANREQ" USING          BASE,
                                         BASE-MMISA,
                                         BASE-BUDGET,
                                         BASE-DUMMY,
                                         CMANREQ-MESSAGE-BUFFER,
                                         CMR-CALL-MODE,
                                         CMR-DATA,
                                         CMR-DESC,
                                         CMR-REMARKS,
                                         CMR-RETURNED-DATA,
                                         CMR-MISC-PARMS,
                                         REQ-GLOBALS,
                                         LANGUAGE-PARMS,
                                         ESC-NAME,
                                         VIEW-COMAREA.
           IF CMR-RETURN-STATUS = "BC"
      *        "INVALID CORPORATE CODE"
               MOVE 1                    TO   FIELD-NUMBER
               MOVE CMANREQ-MESSAGE-BUFFER TO MESSAGE-BUFFER
               PERFORM 4030-SETERROR
               GO TO 6530-SHOW-MOD-FORM-2
           ELSE
           IF CMR-RETURN-STATUS = "BU"
      *        "BAD UNIT OF MEASURE"
               MOVE 4                    TO   FIELD-NUMBER
               MOVE CMANREQ-MESSAGE-BUFFER TO MESSAGE-BUFFER
               PERFORM 4030-SETERROR
               GO TO 6530-SHOW-MOD-FORM-2
           ELSE
           IF CMR-RETURN-STATUS NOT = "OK"
               MOVE 1                    TO   FIELD-NUMBER
               MOVE CMANREQ-MESSAGE-BUFFER TO MESSAGE-BUFFER
               PERFORM 4030-SETERROR
               GO TO 6530-SHOW-MOD-FORM-2.

      *------ MODIFY DESCRIPTION (LONG DESCRIPTION)
           IF SAVE-VIEW-LASTKEY = 2
               PERFORM 7500-CALL-REQ-DESC THRU 7510-CRD-X
               GO TO 6530-SHOW-MOD-FORM-2.

           IF MOD-DEL-FLAG = "D"
               MOVE SPACES TO DE-FIELDS, CMR-REQ-NUMBER
               GO TO 6505-MOD-DEL-GETFORM-1.

           IF MOD-DEL-FLAG = "M"
               IF LINK-TO-WO-SW = 0
                   GO TO 6505-MOD-DEL-GETFORM-1.

           MOVE 0            TO LINK-TO-WO-SW.
           MOVE SPACES       TO PART-WORKAREA.
           MOVE DE-WO        TO WO-NUMBER-WORK.
           CALL "TALWONO" USING WO-NUMBER-WORK,
                                RETURN-STATUS.
           MOVE WO-NUMBER-WORK TO WO-NUMBER.
           IF DE-CORP-CODE = "NON-STR"
               MOVE SPACES   TO STORES-CODE
           ELSE
           MOVE DE-CORP-CODE TO STORES-CODE
                                CORPCDE OF MSTORERM-REC.
           IF DE-CORP-CODE = "NON-STR"
               MOVE DE-EST-UNIT-PRICE  TO AVERAGE-COST
           ELSE
           PERFORM 6392-READ-MSTORERM
           MOVE STR-MKT-COST TO AVG-COST.
           MOVE DE-QTY       TO QTY-ISSUED.
           MOVE DE-STAGING-AREA TO PART-STAGE.
           MOVE DE-PRIME     TO PART-PRIME.
           MOVE DE-CLASS     TO PART-SUB.
           MOVE DE-DEPT      TO DEPT-CHARGED.
           MOVE DE-EXP-CLASS TO EXP-CLASSIFICATION.
           MOVE DE-UM        TO UNIT-OF-MEAS.
           MOVE MEMPL-EMPL   TO EMPLOYEE-ID.
           MOVE DE-REQ-NUMBER   TO ISSREQ-NUMBER.
           IF DE-CORP-CODE = "NON-STR"
               MOVE DE-DESC-1  TO PART-DESC-1
               MOVE DE-DESC-2  TO PART-DESC-2
               MOVE DE-DESC-3  TO PART-DESC-3
               MOVE DE-DESC-4  TO PART-DESC-4
               MOVE DE-DESC-5  TO PART-DESC-5
           ELSE
           MOVE "F"          TO CDESC-DESC-OPTION
           MOVE 5            TO   CDESC-LINES-TO-GET
           MOVE "N"          TO   CDESC-LOCAL-DESC-OPTION
           MOVE DE-CORP-CODE TO   CODE-ARG
           CALL "CDESC" USING CDESC-RET-CODE, BASE,
                          STATUS-AREA, BU-DISPLAY-MSG,
                          CODE-ARG, CDESC-DATA
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               PERFORM 2100-BLOWUP
           ELSE
           MOVE CDESC (1)    TO   PART-DESC-1
           MOVE CDESC (2)    TO   PART-DESC-2
           MOVE CDESC (3)    TO   PART-DESC-3
           MOVE CDESC (4)    TO   PART-DESC-4
           MOVE CDESC (5)    TO   PART-DESC-5.
           MOVE DE-REMARK-1  TO   PART-REMARK-1.
           MOVE DE-REMARK-2  TO   PART-REMARK-2.
           MOVE "SEARQADD"   TO   CALLING-PGM.
           MOVE "M"          TO   CALLING-MODE.
           MOVE "  "         TO   RETURN-STATUS.
           CALL "ISSPARTS" USING PART-WORKAREA,
                                 BASE,
                                 LANGUAGE-PARMS,
                                 MESSAGE-BUFFER.
           MOVE "        "   TO   CALLING-PGM.

           GO TO 6505-MOD-DEL-GETFORM-1.

       6531-CHECK-EXPLODE-DEPS.
           MOVE SPACES               TO   VALID-ARG.
           MOVE "ED"                 TO   VALID-ARG-1-2.
           MOVE VALID-ARG TO VALDTAKEY OF MVALIDPLTDATA-REC.
           START MVALIDPLTDATA-I KEY > VALDTAKEY OF MVALIDPLTDATA-REC
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00" GO TO 6531-CED-X.
       6531-CED-LOOP.
           READ MVALIDPLTDATA-I NEXT INTO BUF-MVALIDPLTDATA
               AT END    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00" GO TO 6531-CED-X.
           IF VDK-1-2 NOT = "ED" GO TO 6531-CED-X.
           IF DE-DEPT = VDK-3-6
               MOVE 20               TO   FIELD-NUMBER
               GO TO 6531-CED-X.

      *------ 15APR1996 COMMENTED OUT THE FOLLOWING 5 LINES TO
      *------  PREVENT ANY CHECKING OF THE V-E-D VALUES.  -DAP
      *    MOVE 0                    TO   SUB.
      *    PERFORM 6591-CK-10-EXPLODE-DEPTS THRU 6591-C1ED-X.
      *    IF SUB > 0
      *        MOVE 20               TO   FIELD-NUMBER
      *        GO TO 6531-CED-X.

           GO TO 6531-CED-LOOP.
       6531-CED-X.    EXIT.

       6532-CHECK-MOD-FIELDS.
           MOVE 0                    TO   LINK-TO-WO-SW.
           IF DE-WO = SPACES
               MOVE SPACES           TO   CMR-WO-NUMBER
           ELSE
           MOVE DE-WO                TO   CMR-WO-NUMBER
           MOVE 1                    TO   LINK-TO-WO-SW.
           IF SAVE-CORP-CODE = DE-CORP-CODE
               MOVE SPACES           TO   SAVE-CORP-CODE
                                          CMR-MREQFILE-FLAG
           ELSE
           IF SAVE-CORP-CODE = "NON-STR"
               MOVE SPACES           TO   SAVE-CORP-CODE
               MOVE "1"              TO   CMR-MREQFILE-FLAG.
       6532-CMF-X.    EXIT.

       6590-MD-X.    EXIT.

      *------ 15APR1996 COMMENTED OUT THE FOLLOWING PARAGRAPH TO
      *------  PREVENT ANY CHECKING OF THE V-E-D VALUES.  -DAP
      *6591-CK-10-EXPLODE-DEPTS.
      *    ADD 1 TO SUB.
      *    IF SUB > 10
      *        MOVE 0 TO SUB
      *        GO TO 6591-C1ED-X.
      *    IF V-E-D (SUB) = SPACES
      *        MOVE 10 TO SUB
      *        GO TO 6591-CK-10-EXPLODE-DEPTS.
      *    IF DE-DEPT = V-E-D (SUB) GO TO 6591-C1ED-X.
      *    GO TO 6591-CK-10-EXPLODE-DEPTS.
      *6591-C1ED-X.    EXIT.

       6990-MAIN-X.    EXIT.

      ******************************************************************
      **                                                              **
      **      P E R F O R M E D   R O U T I N E S                     **
      **                                                              **
      ******************************************************************
       7000-MOVE-TO-CMANREQ.
           MOVE SRF-SPOOL-PRT-NO         TO   CMR-SPOOL-PRT.
           MOVE 3                        TO   DATE-MODE.
           IF SAVE-REQ-SYNR3-SW = "Y"
               IF DDWCC-SLASH = "/"
                   NEXT SENTENCE
               ELSE
               IF DE-DATE-WANTED-CCYY NOT LESS THAN "2000"
                   MOVE DE-DATE-WANTED-YY TO DE-DATE-WANTED-CC
                   MOVE "  "              TO DE-DATE-WANTED-YY.
           MOVE DE-DATE-WANTED           TO   DATE-VALIDATE-IN.
           CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
           IF DATE-RET-CODE = 0
               MOVE DATE-YMD-OUT         TO   CMR-DATE-REQUIRED
               IF CMR-DATE-REQUIRED = "      "
                   NEXT SENTENCE
               ELSE
               IF CMR-DATE-REQUIRED-YY > "70"
                   MOVE "19"             TO   CMR-DATE-REQUIRED-CC
               ELSE
               MOVE "20"                 TO   CMR-DATE-REQUIRED-CC
           ELSE
           MOVE DATE-MSG                 TO   MESSAGE-BUFFER
           MOVE 9                        TO   FIELD-NUMBER
           PERFORM 4030-SETERROR
           GO TO 7010-MTC-X.

           MOVE V-WO-NUMBER              TO   CMR-WO-NUMBER.
           MOVE DE-CORP-CODE             TO   CMR-CORP-CODE.
           MOVE DE-DEPT                  TO   CMR-FOR-DEPT.
           MOVE DE-STAGING-AREA          TO   CMR-STAGING-AREA.
           MOVE DE-QTY                   TO   CMR-QTY.
           MOVE DE-UM                    TO   CMR-UM.
      *------- PARTS OF THE BUDGET NUMBER WAS BEING OMITTED BY MOVING
      *------- THE BUDGET NUMBER TO THE HYPHENATED CMR FIELD.  CORRECTED
      *------- THE PROBLEM.
      *    MOVE DE-BUDGET-NUMBER         TO   CMR-BUDGET-NUMBER.
           MOVE SPACES                   TO   CMR-BUDNUM-NODASH.
           MOVE DE-BUDGET1               TO   CMR-BUDGET1.
           MOVE DE-BUDGET2               TO   CMR-BUDGET2.
           MOVE DE-BUDGET3               TO   CMR-BUDGET3.
           MOVE DE-BUDGET4               TO   CMR-BUDGET4.
           MOVE MEMPL-EMPL               TO   CMR-REQ-ORIG.
           MOVE DE-EST-UNIT-PRICE        TO   CMR-EST-UNIT-PRICE.
           MOVE DE-CLASS                 TO   CMR-SUB.
           MOVE "00"                     TO   CMR-EXP-CLS-2DIG.
           MOVE DE-EXP-CLASS             TO   CMR-EXP-CLS-6DIG.
           MOVE DE-SUGGESTED-VENDOR      TO   CMR-SUGGESTED-VENDOR.
           MOVE DE-SERVICE-FLAG          TO   CMR-SERVICE-FLAG.
           MOVE SPACES                   TO   CMR-WO-ITEM-NUMBER.
           MOVE DE-ADDTL-INFO            TO   CMR-ADDTL-INFO.
           MOVE DE-DESC-1                TO   CMR-DESC-LINE (1).
           MOVE DE-DESC-2                TO   CMR-DESC-LINE (2).
           MOVE DE-DESC-3                TO   CMR-DESC-LINE (3).
           MOVE DE-DESC-4                TO   CMR-DESC-LINE (4).
           MOVE DE-DESC-5                TO   CMR-DESC-LINE (5).
           MOVE DE-REMARK-1              TO   CMR-REMARK-1.
           MOVE DE-REMARK-2              TO   CMR-REMARK-2.
           MOVE DE-COMPANY               TO   CMR-COMPANY.
           MOVE DE-PRIME                 TO   CMR-PRIME.
           MOVE DE-DOCK-NOTIFY           TO   CMR-DOCK-NOTIFY.
           MOVE DE-CURRENCY-2            TO   CMR-CURRENCY.
           MOVE DE-EST-UNIT-PRICE-2      TO   CMR-EST-UNIT-PRICE-CURR.
           MOVE SAVE-WO-ITEM-NUMBER      TO   CMR-WO-ITEM-NUMBER.
           MOVE SPACE                    TO   CMR-AUTH-FLAG.
           IF SAVE-REQ-SYNR3-SW = "Y" AND SAVE-AUTH-FLAG = "X"
               MOVE "X"                  TO   CMR-AUTH-FLAG
           ELSE
           IF MPLTINFO-COMPANY = "631"
               IF DE-CORP-CODE = "NON-STR"
                   NEXT SENTENCE
               ELSE
               MOVE "X"                  TO   CMR-AUTH-FLAG.
       7010-MTC-X.    EXIT.

       7400-EDITS.
           MOVE 0                        TO   EDIT-SUB.
           IF SAVE-PACD-SW = "N"
               MOVE DE-COMPANY           TO   EDIT-PLANT-CODE
           ELSE
           MOVE SRF-MPLTINFO-COMPANY     TO   EDIT-PLANT-CODE.
           MOVE DE-CORP-CODE             TO   EDIT-CODE.
           MOVE MEMPL-EMPL               TO   EDIT-EMPL.
           IF DE-WO NOT = SPACES
               MOVE DE-WO                TO   EDIT-WO
           ELSE
           MOVE SPACES                   TO   EDIT-WO.
           MOVE DE-DEPT                  TO   EDIT-REQ-DEPT.
           MOVE DE-DEPT                  TO   EDIT-CHARGE-DEPT.
           MOVE DE-EXP-CLASS             TO   EDIT-EXP-CLASS.
           IF DE-QTY = ZEROES
      *M   "QTY IS A REQUIRED FIELD"
               MOVE 17 TO LANG-SETNUM
               MOVE 19 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE  2 TO FIELD-NUMBER
               PERFORM 4030-SETERROR
               GO TO 7490-E-X.

      *----- ADDED CHANGE REQUESTED BY STEPHEN SEYMOUR THAT A CODED
      *----- STOREROOM REQUISITION ALLOW THE USER TO ENTER AN ALTERNATE
      *----- UNIT OF MEASURE FOR THE CODE. CURRENTLY, IT DEFALUTS TO
      *----- ONLY ONE THAT IS VALID.
      *----- IF NO UM ENTERED, DEFAULT TO BASE STORES UM.
           IF DE-CORP-CODE = "NON-STR"
               NEXT SENTENCE
           ELSE
           MOVE DE-CORP-CODE TO CORPCDE OF MSTORERM-REC
           READ MSTORERM-I INTO BUF-MSTORERM
           IF DE-UM = SPACES
               MOVE STR-UM       TO DE-UM
           ELSE
           IF DE-UM = STR-UM OR STR-UM1 OR STR-UM2
               NEXT SENTENCE
           ELSE
      *M   " INVALID UNIT OF MEASURE"
               MOVE  9 TO LANG-SETNUM
               MOVE 12 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE  4 TO FIELD-NUMBER
               PERFORM 4030-SETERROR
               GO TO 7490-E-X.

           MOVE DE-UM TO VALIDUM OF MVALIDUM-I-REC.
           START MVALIDUM-I KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
      *M   " INVALID UNIT OF MEASURE"
               MOVE  9 TO LANG-SETNUM
               MOVE 12 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE  4 TO FIELD-NUMBER
               PERFORM 4030-SETERROR
               GO TO 7490-E-X.

           IF SAVE-REQ-SYNR3-SW = "Y"
               IF DE-UM = "  "
      *M           "NO UNIT OF MEASURE GIVEN"
                   MOVE  14 TO LANG-SETNUM
                   MOVE  34 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE   4 TO FIELD-NUMBER
                   PERFORM 4030-SETERROR
                   GO TO 7490-E-X.

           IF DE-SERVICE-FLAG = "S" OR "M" OR "R"
               NEXT SENTENCE
           ELSE
      *M       "REQ TYPE MUST BE S-SERVICE OR M-MATERIAL OR R-REPAIR"
               MOVE  19 TO LANG-SETNUM
               MOVE  49 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE  51 TO FIELD-NUMBER
               PERFORM 4030-SETERROR
               GO TO 7490-E-X.

      *----- IF A UNIT PRICE IS ENTERED FOR A STOREROOM REQ., PRINT
      *----- MESSAGE TO SAY THAT MARKET COST WILL BE USED.
           IF SAVE-REQ-CURR-SW = "Y"
               IF DE-CORP-CODE NOT = "NON-STR"
                 IF (DE-EST-UNIT-PRICE > 0 OR DE-EST-UNIT-PRICE-2 > 0)
      *M   "MARKET COST WILL BE USED FOR STOREROOM REQS"
                   MOVE  13 TO LANG-SETNUM
                   MOVE  69 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE   5 TO FIELD-NUMBER
                   PERFORM 4030-SETERROR
                   MOVE 0        TO  DE-EST-UNIT-PRICE
                                     DE-EST-UNIT-PRICE-2
                   MOVE SPACES   TO  DE-CURRENCY-2
                   GO TO 7490-E-X.

      *----- IF ANOTHER CURRENCY ENTERED, MAKE SURE A VALUE IS ENTERED.
           IF SAVE-REQ-CURR-SW = "Y"
               IF DE-CURRENCY-2 NOT = SPACES AND
                  DE-EST-UNIT-PRICE-2 = 0
      *M       "UNIT PRICE MUST BE ENTERED FOR OTHER CURRENCY"
                   MOVE  21 TO LANG-SETNUM
                   MOVE  28 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE  41 TO FIELD-NUMBER
                   PERFORM 4030-SETERROR
                   GO TO 7490-E-X.

      *----- IF THE "OTHER CURRENCY" PRICE IS ENTERED, A CURRENCY CODE
      *----- MUST ALSO BE ENTERED.
           IF SAVE-REQ-CURR-SW = "Y"
               IF DE-EST-UNIT-PRICE-2 > 0    AND
                  DE-CURRENCY-2 = SPACES
      *M       "CURRENCY COST MUST BE ENTERED"
                   MOVE   3 TO LANG-SETNUM
                   MOVE 624 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE  43 TO FIELD-NUMBER
                   PERFORM 4030-SETERROR
                   GO TO 7490-E-X.

      *----- IF THE ANOTHER CURRENCY IS ENTERED, IT CANNOT BE THE HOME
      *----- CURRENCY.
           IF SAVE-REQ-CURR-SW = "Y"
               IF DE-CURRENCY-2 = SAVE-HOME-CUR-CODE
      *M   "CURRENCY CODE OTHER THAN THE HOME CURRENCY MUST BE ENTERED"
                   MOVE   3 TO LANG-SETNUM
                   MOVE 625 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE  43 TO FIELD-NUMBER
                   PERFORM 4030-SETERROR
                   GO TO 7490-E-X.

      *----- THE HOME CURRENCY UNIT PRICE CANNOT BE MODIFIED IF ANOTHER
      *----- CURRENCY/UNIT PRICE HAS BEEN ENTERED.
           IF SAVE-REQ-CURR-SW = "Y"
               IF   (DE-EST-UNIT-PRICE NOT = SAVE-EST-PRICE) AND
                    (DE-EST-UNIT-PRICE > 0) AND
                    (DE-CURRENCY-2 NOT = SPACES)
                   MOVE SAVE-EST-PRICE   TO  DE-EST-UNIT-PRICE
      *M  "CANNOT MODIFY HOME CURRENCY PRICE IF OTHER CURRENCY IS ENTERED"
                   MOVE   3 TO LANG-SETNUM
                   MOVE 626 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE   5 TO FIELD-NUMBER
                   PERFORM 4030-SETERROR
                   GO TO 7490-E-X.

           IF DE-CURRENCY-2 > SPACES
               MOVE DE-CURRENCY-2 TO VALIDUM OF MVALIDUM-I-REC
               START MVALIDUM-I KEY = EXTERNALLY-DESCRIBED-KEY
                   INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS
               END-START
               IF FILE-STATUS NOT = "00"
      *M   " INVALID CURRENCY CODE"
                   MOVE  3 TO LANG-SETNUM
                   MOVE 70 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 43 TO FIELD-NUMBER
                   PERFORM 4030-SETERROR
                   GO TO 7490-E-X.

      *--------- VALIDATE COMPANY.
           IF SAVE-PACD-SW = "Y"
               IF DE-COMPANY = SPACES
      *M   "COMPANY IS A REQUIRED FIELD"
                   MOVE  36 TO FIELD-NUMBER
                   MOVE   3 TO LANG-SETNUM
                   MOVE 196 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   PERFORM 4030-SETERROR
                   GO TO 7490-E-X.

           IF SAVE-PACD-SW = "Y"
               MOVE "CO" TO VALID-ARG-1-2
               MOVE DE-COMPANY TO VALID-ARG-3-10
               PERFORM 9000-START-MVALIDPLTDATA
               IF COND-WORD = 17
      *M   "COMPANY IS INVALID"
                   MOVE  36 TO FIELD-NUMBER
                   MOVE   3 TO LANG-SETNUM
                   MOVE 197 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   PERFORM 4030-SETERROR
                   GO TO 7490-E-X.

      *--------- VALIDATE PRIME.
           IF SAVE-PACD-SW = "Y"
               IF DE-PRIME = SPACES
      *M   "PRIME IS A REQUIRED FIELD"
                   MOVE  37 TO FIELD-NUMBER
                   MOVE  16 TO LANG-SETNUM
                   MOVE 149 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   PERFORM 4030-SETERROR
                   GO TO 7490-E-X.

           IF SAVE-PACD-SW = "Y"
               MOVE "PR" TO VALID-ARG-1-2
               MOVE DE-PRIME TO VALID-ARG-3-10
               PERFORM 9000-START-MVALIDPLTDATA
               IF COND-WORD = 17
      *M   "PRIME IS INVALID"
                   MOVE  37 TO FIELD-NUMBER
                   MOVE  16 TO LANG-SETNUM
                   MOVE 150 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   PERFORM 4030-SETERROR
                   GO TO 7490-E-X.

      *--------- VALIDATE SAP INTERNAL ORDER NUMBER.
           IF SAVE-REQ-SYNR3-SW = "Y"
               IF DE-ADDTL-INFO > SPACES
                   MOVE "NW" TO VALID-ARG-1-2
                   MOVE DE-ADDTL-INFO TO VALID-ARG-3-10
                   PERFORM 9000-START-MVALIDPLTDATA
                   IF COND-WORD = 17
      *M                   "INVALID ACCOUNT"
                       MOVE  22 TO FIELD-NUMBER
                       MOVE   9 TO LANG-SETNUM
                       MOVE  71 TO LANG-MSGNUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       PERFORM 4030-SETERROR
                       GO TO 7490-E-X.

           IF DE-DOCK-NOTIFY = SPACES
               IF SAVE-REQ-USERID = "Y"
      *            *** A VALID USERID IS REQUIRED ***
                   MOVE  22 TO LANG-SETNUM
                   MOVE  27 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 29  TO  FIELD-NUMBER
                   PERFORM 4030-SETERROR
                   GO TO 7490-E-X
               END-IF
           ELSE
               CALL "MCXCHKUSR" USING DE-DOCK-NOTIFY VALID-USER
               IF VALID-USER = "N"
      *            *** A VALID USERID IS REQUIRED ***
                   MOVE  22 TO LANG-SETNUM
                   MOVE  27 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 29  TO  FIELD-NUMBER
                   PERFORM 4030-SETERROR
                   GO TO 7490-E-X
               END-IF
           END-IF.

           CALL "TIREDIT" USING TIREDIT-RET-CODE, BASE, BASE-MMISA,
               PART-WORKAREA, STATUS-AREA, EDIT-DATA, MESSAGE-BUFFER,
               MULTIPLE-STR-DATA, STORES-COMAREA,
               DUMMY-EXP-CLASS, LANGUAGE-PARMS.
           IF TIREDIT-RET-CODE = "BU"
               MOVE "TIREDIT ERR 7400-E" TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

           MOVE EDIT-EXP-CLASS TO DE-EXP-CLASS.

      *------ ON WITHDRAWALS, EXP CLASS IS REQUIRED, BUT FOR REQS
      *------ DONT REQUIRE IT UNLESS USER TURNS PLANT SWITCH ON
      *------ REQUESTING IT (MPLTINFO-PACD-SW SET IN USER OPTIONS
      *------ OF PLANT STARTUP).
           IF DE-EXP-CLASS = SPACES OR "000000"
               IF SAVE-PACD-SW = "N"
                   NEXT SENTENCE
               ELSE
               IF EDIT-SUB = 6
                   MOVE SPACES           TO   MESSAGE-BUFFER
                   GO TO 7490-E-X.

           IF EDIT-SUB > 0
               IF SAVE-PACD-SW = "N"
      *------ BYPASS INVALID ACCOUNT ERROR FROM TIREDIT AS LUX
      *------ HAS SPECIAL WAY TO EDIT
                   IF EDIT-SUB = 6 OR 8
                       MOVE 0 TO EDIT-SUB
                       MOVE SPACES TO MESSAGE-BUFFER
                       PERFORM 74900-LUX-EDITS THRU 74900-LE-X
                   ELSE
                   NEXT SENTENCE
               ELSE
               NEXT SENTENCE
           ELSE
           IF SAVE-PACD-SW = "N"
               PERFORM 74900-LUX-EDITS THRU 74900-LE-X.

           IF MESSAGE-BUFFER-1 = SPACES
               GO TO 7490-E-X.

      *------ 1=EMPL, 2=WO, 3/4 = DEPT, 5 = CHARGE TYPE, 6= ACCOUNT,
      *______ 7=COMP, 8=PRIME, 9=CLASS
           IF EDIT-SUB = 1
               MOVE 1                    TO   FIELD-NUMBER
           ELSE
           IF EDIT-SUB = 2
               MOVE 50                   TO   FIELD-NUMBER
           ELSE
           IF EDIT-SUB = 3 OR 4
               MOVE 20                   TO   FIELD-NUMBER
           ELSE
           IF EDIT-SUB = 6
               MOVE 21                   TO   FIELD-NUMBER
           ELSE
           IF EDIT-SUB = 7
               MOVE 36                   TO   FIELD-NUMBER
           ELSE
           IF EDIT-SUB = 8
               MOVE 37                   TO   FIELD-NUMBER
           ELSE
           IF EDIT-SUB = 9
               MOVE 34                   TO   FIELD-NUMBER.

           PERFORM 4030-SETERROR.

       7490-E-X.    EXIT.

       74900-LUX-EDITS.
           IF VIEW-CFNAME = "EARQADDL" OR "EARQADDLEP"
               MOVE "DP" TO VALID-ARG-1-2
               MOVE DE-DEPT TO VALID-ARG-3-10
               PERFORM 9000-START-MVALIDPLTDATA
               IF COND-WORD = 17
                   NEXT SENTENCE
               ELSE
               PERFORM 9000-GET-MVALIDPLTDATA
               IF COND-WORD = 0
                   IF VALID-DATA-CO NOT = "   "
                       MOVE VALID-DATA-CO TO DE-COMPANY
                                             EDIT-PLANT-CODE
                       MOVE VALID-DATA-PR TO DE-PRIME
                       GO TO 74900-LE-CONT
                   ELSE
                   NEXT SENTENCE
               ELSE
               NEXT SENTENCE
           ELSE
           IF DE-DEPT NOT = SAVE-DEPT
               MOVE "DP" TO VALID-ARG-1-2
               MOVE DE-DEPT TO VALID-ARG-3-10
               PERFORM 9000-START-MVALIDPLTDATA
               IF COND-WORD = 17
                   NEXT SENTENCE
               ELSE
               PERFORM 9000-GET-MVALIDPLTDATA
               IF COND-WORD = 0
                   IF VALID-DATA-CO NOT = "   "
                       MOVE VALID-DATA-CO TO DE-COMPANY
                                             EDIT-PLANT-CODE
                      MOVE VALID-DATA-PR TO DE-PRIME
                      GO TO 74900-LE-CONT.

           IF VIEW-NFNAME = "EARQADDL" OR "EARQADDLEP"
               NEXT SENTENCE
           ELSE
           IF EDIT-PLANT-CODE = "   "
      *M   "COMPANY CODE IS A REQUIRED FIELD"
               MOVE   3 TO LANG-SETNUM
               MOVE 196 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 7 TO EDIT-SUB
               GO TO 74900-LE-X
           ELSE
           MOVE "CO" TO VALID-ARG-1-2
           MOVE EDIT-PLANT-CODE TO VALID-ARG-3-10
           PERFORM 9000-START-MVALIDPLTDATA
           IF COND-WORD = 17
      *M   "COMPANY CODE ENTERED IS INVALID
               MOVE   3 TO LANG-SETNUM
               MOVE 197 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 7 TO EDIT-SUB
               GO TO 74900-LE-X.

           IF VIEW-NFNAME = "EARQADDL" OR "EARQADDLEP"
               NEXT SENTENCE
           ELSE
           IF DE-PRIME = "   "
      *M   "PRIME IS A REQUIRED FIELD"
               MOVE  16 TO LANG-SETNUM
               MOVE 149 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 8 TO EDIT-SUB
               GO TO 74900-LE-X
           ELSE
           MOVE "PR" TO VALID-ARG-1-2
           MOVE DE-PRIME TO VALID-ARG-3-10
           PERFORM 9000-START-MVALIDPLTDATA
           IF COND-WORD = 17
      *M   "PRIME ENTERED IS INVALID
               MOVE  16 TO LANG-SETNUM
               MOVE 150 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE   8 TO EDIT-SUB
               GO TO 74900-LE-X.

       74900-LE-CONT.
           IF DE-CLASS = "   "
      *M   "CLASS IS A REQUIRED FIELD
               MOVE   3 TO LANG-SETNUM
               MOVE 198 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE   9 TO EDIT-SUB
               GO TO 74900-LE-X
           ELSE
           IF DE-CLASS = "CNS"
               IF DE-EXP-CLASS = "      " OR "000000"
                   GO TO 74900-LE-X
               ELSE
               MOVE "NW"           TO    VALID-ARG-1-2
               MOVE DE-EXP-CLASS   TO    VALID-ARG-3-10
               PERFORM 9000-START-MVALIDPLTDATA
               IF COND-WORD = 0
      *M       "EXP/NW IS INVALID FOR CLASS"
                   MOVE   5 TO LANG-SETNUM
                   MOVE  62 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE DE-EXP-CLASS TO MSG-FLD
                   MOVE 6 TO EDIT-SUB
                   GO TO 74900-LE-X
               ELSE
               GO TO 74900-LE-X
           ELSE
           MOVE DE-CLASS TO CLASS-WORKAREA
           PERFORM 749000-CHECK-CLASS THRU 749000-CC-X
           MOVE CLASS-WORKAREA TO DE-CLASS
           MOVE SPACES TO VALID-ARG
      *    MOVE "EC" TO VALID-ARG-1-2
      *    MOVE DE-CLASS-9 TO VALID-ARG-3-8
      *    PERFORM 9000-START-MVALIDPLTDATA
           MOVE DE-CLASS-9 TO PLT-ARG
           PERFORM 9020-START-MCLASS
           IF COND-WORD = 17
      *M   "CLASS ENTERED IS INVALID
               MOVE   3 TO LANG-SETNUM
               MOVE 199 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE DE-CLASS TO MSG-FLD
               MOVE   9 TO EDIT-SUB
               GO TO 74900-LE-X.

           IF DE-CLASS NOT < "000" AND DE-CLASS NOT > "099"
               MOVE "NW"           TO    VALID-ARG-1-2
               MOVE DE-EXP-CLASS   TO    VALID-ARG-3-10
               PERFORM 9000-START-MVALIDPLTDATA
               IF COND-WORD = 17
      *M           "EXP/NW ENTERED IS INVALID FOR CLASS"
                   MOVE   5 TO LANG-SETNUM
                   MOVE  62 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE DE-CLASS TO MSG-FLD
                   MOVE   6 TO EDIT-SUB
                   GO TO 74900-LE-X
               ELSE
               GO TO 74900-LE-X.

           IF DE-CLASS NOT LESS THAN "100"
               IF DE-CLASS NOT GREATER THAN "999"
                   IF DE-EXP-CLASS = "      " OR "000000"
                       MOVE DE-CLASS-9 TO DE-EXP-CLASS-9
                   ELSE
                   MOVE "NW"           TO    VALID-ARG-1-2
                   MOVE DE-EXP-CLASS   TO    VALID-ARG-3-10
                   PERFORM 9000-START-MVALIDPLTDATA
                   IF COND-WORD = 0
      *M           "EXP/NW IS INVALID FOR CLASS"
                       MOVE   5 TO LANG-SETNUM
                       MOVE  62 TO LANG-MSGNUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE DE-EXP-CLASS TO MSG-FLD
                       MOVE 6 TO EDIT-SUB
                       GO TO 74900-LE-X
                   ELSE
                   GO TO 74900-LE-X.

           MOVE "NW"           TO    VALID-ARG-1-2.
           MOVE DE-EXP-CLASS   TO    VALID-ARG-3-10.
           PERFORM 9000-START-MVALIDPLTDATA.
           IF COND-WORD = 0
               IF DE-CLASS NOT < "000" AND DE-CLASS NOT > "099"
                   NEXT SENTENCE
               ELSE
      *M       "CLASS ENTERED IS INVALID"
               MOVE   3 TO LANG-SETNUM
               MOVE 199 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE DE-EXP-CLASS TO MSG-FLD
               MOVE   9 TO EDIT-SUB
               GO TO 74900-LE-X
           ELSE
           IF DE-CLASS NOT < "000" AND DE-CLASS NOT > "099"
      *M   "EXP/NW IS INVALID FOR CLASS"
               MOVE   5 TO LANG-SETNUM
               MOVE  62 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE DE-EXP-CLASS TO MSG-FLD
               MOVE 6 TO EDIT-SUB.

       74900-LE-X.    EXIT.

       749000-CHECK-CLASS.
           IF CLASS-DIG (3) = " "
               IF CLASS-DIG (2) = " "
                   IF CLASS-DIG (1) = " "
                       MOVE "0" TO CLASS-DIG (1), CLASS-DIG (2),
                           CLASS-DIG (3)
                   ELSE
                   MOVE CLASS-DIG (1) TO CLASS-DIG (3)
                   MOVE "0" TO CLASS-DIG (1), CLASS-DIG (2)
               ELSE
               MOVE CLASS-DIG (2) TO CLASS-DIG (3)
               MOVE CLASS-DIG (1) TO CLASS-DIG (2)
               MOVE "0" TO CLASS-DIG (1).
           IF CLASS-DIG (2) = " "
               MOVE "0" TO CLASS-DIG (2).
           IF CLASS-DIG (1) = " "
               MOVE "0" TO CLASS-DIG (1).
       749000-CC-X.    EXIT.

       7500-CALL-REQ-DESC.
           MOVE "FCSISINQ"               TO   VIEW-CFNAME.
           MOVE CMR-REQ-NUMBER           TO   REQ-ARG.
           MOVE CMR-CORP-CODE            TO   CODE-ARG.
           MOVE "Y"                      TO   DESC-UPDATE-SW.
           MOVE "N"                      TO   DESC-BLOWUP-SW.
           CALL "SREQDESC" USING         BASE,
                                         DESCRIPTION-SW,
                                         VIEW-COMAREA,
                                         SCREEN-PRINT-PARMS,
                                         SRF-SPOOL-PRT-NO,
                                         STATUS-AREA,
                                         ARGUMENT-VALUES.

       7510-CRD-X.    EXIT.

       7600-CHECK-FOR-OPEN-REQ.
           MOVE "N"   TO  OPEN-REQ-SW.
           MOVE DE-CORP-CODE             TO   CODE-ARG.
      *    CALL "DBFIND" USING BASE, DSET-DREQITM, MODE1,
      *        STATUS-AREA, CODE-SEARCH, CODE-ARG.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DREQITM-I-REC.
           START DREQITM-I KEY = CORPCDE OF DREQITM-I-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
               MOVE 99 TO COND-WORD.
           IF NO-ENTRY
      *        "INVALID CORPORATE CODE"
               MOVE 1                    TO   FIELD-NUMBER
               GO TO 7690-CFOR-X
           ELSE
           IF COND-WORD NOT =  0
               MOVE "FIND DREQITM 7600-CFOR"  TO  BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

       7610-GET-DREQITM.
      *    CALL "DBGET" USING BASE, DSET-DREQITM, MODE5,
      *        STATUS-AREA, ALL-ITEMS, BUF-DREQITM, CODE-ARG.
           MOVE 0 TO COND-WORD.
           READ DREQITM-I NEXT INTO BUF-DREQITM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF CORPCDE OF DREQITM-I-REC NOT = CODE-ARG
               MOVE 15 TO COND-WORD.
           IF COND-WORD NOT = 0
               IF COND-WORD = 15
                   GO TO 7690-CFOR-X
               ELSE
               MOVE "GET DREQITM 7610-GD" TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

           MOVE REQITM-REQ-NUMBER  TO  REQ-ARG.
      *    CALL "DBGET" USING BASE, DSET-MREQ, MODE7, STATUS-AREA,
      *        ALL-ITEMS, BUF-MREQ, REQ-ARG.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF MREQ-I-REC.
           READ MREQ-I INTO BUF-MREQ
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF COND-WORD NOT =  0
               MOVE "GET MREQ 7610-GD"  TO  BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

           IF REQ-RELEASE-STAT = "XX"
               IF REQ-HOLD-STATUS NOT = "BATCHFILE"
                   GO TO 7610-GET-DREQITM.

           MOVE SPACES                   TO   MESSAGE-BUFFER.
           IF REQ-RELEASE-STAT = "  "
               IF REQ-STATUS = "SS" OR "S"
                   IF REQ-AUTH-CODE-FLAG = "X"
      *            "AWAITING APPROVALS"
                       MOVE   1 TO LANG-SETNUM
                       MOVE  30 TO LANG-MSGNUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   ELSE
      *            "IN MATERIALS CONTROL"
                   MOVE   9 TO LANG-SETNUM
                   MOVE  85 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               ELSE
      *        "AWAITING APPROVALS"
               MOVE   1 TO LANG-SETNUM
               MOVE  30 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           ELSE
           IF REQ-RELEASE-STAT = "X "
      *        "IN PURCHASING"
               MOVE   9 TO LANG-SETNUM
               MOVE  86 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           ELSE
           IF REQ-RELEASE-STAT = "XX"
      *        "ASSIGNED TO A PURCHASE ORDER"
               MOVE   1 TO LANG-SETNUM
               MOVE  29 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           ELSE
           IF REQ-RELEASE-STAT = "U"
      *        "REQ CURRENTLY BEING PROCESSED"
               MOVE  19 TO LANG-SETNUM
               MOVE  37 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           ELSE
           MOVE SPACES                TO   MESSAGE-BUFFER.

      *    CALL "DBFIND" USING BASE, DSET-DREQD, MODE1, STATUS-AREA,
      *      REQ-SEARCH, REQ-ARG.
      *    IF NOT GOOD-CALL
      *        MOVE "DBFIND ERR DREQD 7610-GD" TO BU-DISPLAY-MSG
      *        PERFORM 2100-BLOWUP.
      *
      *    CALL "DBGET" USING BASE, DSET-DREQD, MODE5, STATUS-AREA,
      *      ALL-ITEMS, BUF-DREQD, REQ-ARG.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DREQD-I-REC.
           READ DREQD-I INTO BUF-DREQD
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF NO-ENTRY
               MOVE SPACES               TO   BUF-DREQD
           ELSE
           IF NOT GOOD-CALL
               MOVE "DBGET ERR DREQD 7610-GD" TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

           MOVE "Y"                      TO   OPEN-REQ-SW.
           MOVE MESSAGE-BUFFER           TO   V-RELEASE-STATUS.
           MOVE MREQ-NUMBER              TO   V-REQ-NUMBER.
           MOVE DE-CORP-CODE             TO   V-CORP-CODE.
           MOVE 4                        TO   DATE-MODE.
           MOVE REQ-DATE                 TO   DATE-VALIDATE-IN.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT           TO   V-REQ-DATE.
           MOVE REQ-DATE-WANTED          TO   DATE-VALIDATE-IN.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT           TO   V-DATE-WANTED.
           MOVE REQITM-QTY-TO-ORD        TO   V-QTY.
           MOVE REQITM-UM                TO   V-UM.
           MOVE REQ-ORIGINATOR           TO   V-ORIG.
      *-------- GET THE EMPLOYEE NAME FROM THE MMIS DATABASE
           MOVE REQ-ORIGINATOR           TO   EMPLOYEE-ARG.
      *    CALL "DBGET" USING BASE-MMISA, DSET-PER-PERSONNEL, MODE7,
      *      STATUS-AREA, ALL-ITEMS, BUF-PER-PERSONNEL, EMPLOYEE-ARG.
           MOVE 0 TO COND-WORD.
           MOVE EMPLOYEE-ARG TO PERCCNUM OF PER-PERSONNEL-I-REC.
           READ PER-PERSONNEL-I INTO BUF-PER-PERSONNEL
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF GOOD-CALL
               MOVE PER-EMP-NAME         TO   V-ORIG-NAME
           ELSE
           IF NO-ENTRY
               MOVE SPACES               TO   V-ORIG-NAME
           ELSE
           MOVE "DBGET ERR PERSONNEL 7610-CFO" TO BU-DISPLAY-MSG
           PERFORM 2100-BLOWUP.
           MOVE REQ-SUBD                 TO   V-DEPT.
           MOVE DREQD-WO-NUMBER          TO   V-WO-NUMBER-2.

       7690-CFOR-X.    EXIT.

       8000-READ-SCREEN-FOR-ENTER.
           MOVE "FEARQEXIST"             TO   VIEW-NFNAME.

       8080-SHOWFORM.
           MOVE DE-FIELDS-2 TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC TO DE-FIELDS-2.
           IF VIEW-LASTKEY = 3
               IF SAVE-PACD-SW = "N"
                   MOVE "EARQADDL"           TO   VIEW-NFNAME
                   GO TO 8090-RSFE-X
               ELSE
               MOVE "EARQADD"                TO   VIEW-NFNAME
               GO TO 8090-RSFE-X.
      *    IF MESSAGE-BUFFER-1 NOT = SPACES
      *        PERFORM 4030-SETERROR
      *        GO TO 8080-SHOWFORM.

           IF SAVE-PACD-SW = "N"
               MOVE "EARQADDL"           TO   VIEW-NFNAME
           ELSE
           MOVE "EARQADD"                TO   VIEW-NFNAME.

       8090-RSFE-X.    EXIT.

       9000-START-MVALIDPLTDATA.
           MOVE 0              TO COND-WORD.
           MOVE VALID-ARG      TO VALDTAKEY OF MVALIDPLTDATA-REC.
           START MVALIDPLTDATA-I KEY = VALDTAKEY OF MVALIDPLTDATA-REC
               INVALID KEY     MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17     TO COND-WORD
               ELSE
                   MOVE 99     TO COND-WORD.

       9000-GET-MVALIDPLTDATA.
           MOVE 0              TO COND-WORD.
           READ MVALIDPLTDATA-I NEXT INTO BUF-MVALIDPLTDATA
               AT END    MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 15     TO COND-WORD
               ELSE
                   MOVE 99     TO COND-WORD.

       9020-START-MCLASS.
           MOVE 0              TO COND-WORD.
           MOVE PLT-ARG        TO ACTGCLASS OF MCLASS-REC.
           START MCLASS-I      KEY = ACTGCLASS OF MCLASS-REC
               INVALID KEY     MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17     TO COND-WORD
               ELSE
               MOVE 99         TO COND-WORD.

      *-------- CONVERT TO HOME CURRENCY.
       9030-CALL-SCURCONV.
           MOVE DE-CURRENCY-2          TO  SCURCONV-CUR-CODE
                                           SAVE-OTHER-CURRENCY.
           MOVE DE-EST-UNIT-PRICE-2    TO  SCURCONV-PRICE-DEC
                                           SAVE-OTHER-EST-PRICE.
           MOVE "Y"                    TO  SCURCONV-OVERRIDE-CONV-SW.
           MOVE ZEROS                  TO  SCURCONV-PRICE-WHL.
           CALL "SCURCONV" USING BASE,
                                 SCURCONV-PARMS,
                                 STATUS-AREA,
                                 BU-DISPLAY-MSG,
                                 BU-DISPLAY-FLDS.
           IF BU-DISPLAY-MSG NOT = SPACES
               MOVE "CALL SCURCONV * 9030-CS" TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.
           MOVE SCURCONV-PRICE-DEC     TO  DE-EST-UNIT-PRICE
                                           SAVE-EST-PRICE.

       998-SET-FUNCTION-KEYS.
           IF VIEW-NFNAME = "EARQMENU"
      *M   "f1-ADD REQ f2-MOD REQ f3-END PROGRAM f6-REQ INQUIRY f8-DEL REQ"
               MOVE 06033 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE-COMMAND-LINE-M
           ELSE
           IF VIEW-NFNAME = "EARQADD" OR "EARQADDL"
      *        IF SAVE-DE-FIELDS-1 NOT = SPACES
      *M       "f1-COPY REQ f3-END PROGRAM f7-EXIT f8-DUPL.LAST REQ"
      *            MOVE 06034 TO CATREAD-MSG-NUMBER
      *            PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
      *            MOVE MESSAGE-BUFFER TO DE-COMMAND-LINE-1
      *        ELSE
               IF DE-REQ-NUMBER = "            "
      *M       "f1-COPY REQ  f3-END PROGRAM "
      *---------------- IF CURRENCY IS ON THE SCREEN, DISPLAY FUNCTION
      *---------------- KEYS INCLUDING F4 FOR CURRENCY HELP.
                   IF SAVE-REQ-CURR-SW = "N"
                       MOVE 06028 TO CATREAD-MSG-NUMBER
                   ELSE
                       MOVE 06044 TO CATREAD-MSG-NUMBER
                   END-IF
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE-COMMAND-LINE-1
               ELSE
      *M       "f1-COPY REQ f3-END PROGRAM f8-DUPL.LAST REQ"
                   IF SAVE-REQ-CURR-SW = "N"
                       MOVE 06034 TO CATREAD-MSG-NUMBER
                   ELSE
                       MOVE 06047 TO CATREAD-MSG-NUMBER
                   END-IF
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE-COMMAND-LINE-1
      *        ELSE
      *M       "f1-COPY REQ f2-MORE DESC. f3-END PROGRAM f8-DUPL."
      *        MOVE 06029 TO CATREAD-MSG-NUMBER
      *        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
      *        MOVE MESSAGE-BUFFER TO DE-COMMAND-LINE-1
           ELSE
           IF VIEW-NFNAME = "EARQADDLE" OR "EARQADDLEP"
      *M   "f1-COPY REQ  f3-END PROGRAM  f6-EXPORT PURCH. "
               IF SAVE-REQ-CURR-SW = "N"
                   MOVE 06032 TO CATREAD-MSG-NUMBER
               ELSE
                   MOVE 06046 TO CATREAD-MSG-NUMBER
               END-IF
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE-COMMAND-LINE-1
           ELSE
           IF VIEW-NFNAME = "EARQADD1" OR "EARQADD1L"
      *M   "f3-END PROGRAM  "
               MOVE 06031 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE-COMMAND-LINE-1
           ELSE
           IF VIEW-NFNAME = "EARQADD2" OR "EARQADD2L"
               IF MOD-DEL-FLAG = "D"
      *M           "f3-END PROGRAM "
                   MOVE 06031 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE-COMMAND-LINE-1
               ELSE
      *M      "f2-MORE DESC.  f3-END PROGRAM  "
               IF SAVE-REQ-CURR-SW = "N"
                   MOVE 06030 TO CATREAD-MSG-NUMBER
               ELSE
                   MOVE 06048 TO CATREAD-MSG-NUMBER
               END-IF
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE-COMMAND-LINE-1
           ELSE
      *M   "f1-COPY REQ f2-MORE DESC. f3-END PROGRAM f8-DUPL.REQ"
           IF SAVE-REQ-CURR-SW = "N"
               MOVE 06029 TO CATREAD-MSG-NUMBER
           ELSE
               MOVE 06045 TO CATREAD-MSG-NUMBER
           END-IF
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE MESSAGE-BUFFER TO DE-COMMAND-LINE-1.
       998-SFK-X.    EXIT.

       COPY DISPCALL IN COPYLIB.
       998-AUTO-READ-SCREEN.
           READ  DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC ARE SRF-INDICATORS
                   NO DATA MOVE DISPLAY-STATUS TO DISPLAY-STATUS.
           MOVE ALL B"0" TO SRF-INDICATORS.

       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.    EXIT.
