000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          SEASETGB.
000400 AUTHOR.              C HILLES/JIM COFFMAN (MAINTAINER).
000500 DATE-WRITTEN.        7/1/87.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*D   ELECTRONIC APPROVAL SYSTEM - GLOBAL PARAMETER SETUP.
001100
      *C   JULY 1995  JE COFFMAN - WRITTEN REQUEST 95-017
      *C   ADD AN OPTION TO ALLOW THE PLANTS TO REQUIRE THAT
      *C   USERS ENTER A PASSWORD FOR THE Q8/REQUISITION INQUIRY
      *C
001200
001300 ENVIRONMENT DIVISION.
001400 CONFIGURATION SECTION.
001500 SOURCE-COMPUTER.  HP-3000.
001600 OBJECT-COMPUTER.  HP-3000.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MPLTINFO-O
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZEASETUP-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

001700
001800 DATA DIVISION.
       FILE SECTION.
       FD  MPLTINFO-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-O.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC        PIC X(500).

001900 WORKING-STORAGE SECTION.
002000
002100**************************************************************
002200**                                                          **
002300**                S U B P R O G R A M   A R E A S           **
002400**                                                          **
002500**************************************************************
002600
002700 COPY TBLOWUP    IN COPYLIB.
      *------ WS CONTROL AREA
       01  MAJOR-MINOR                   PIC XXXX.
       01  WS-CONTROL.
           05  FUNCTION-NUM              PIC XX.
               88  EXIT-KEY-F8-USED                 VALUE "08".
               88  REFRESH-KEY-F4-USED              VALUE "04".
               88  ENTER-KEY-USED                   VALUE "00".
               88  F1-KEY-USED                      VALUE "01".
               88  F2-KEY-USED                      VALUE "02".
               88  F3-KEY-USED                      VALUE "03".
               88  F4-KEY-USED                      VALUE "04".
               88  F5-KEY-USED                      VALUE "05".
               88  F6-KEY-USED                      VALUE "06".
               88  F7-KEY-USED                      VALUE "07".
               88  F8-KEY-USED                      VALUE "08".
           05  FUN-KEY REDEFINES FUNCTION-NUM  PIC XX.
           05  TERMINAL-ID               PIC X(10).
           05  FORMAT-NAME               PIC X(10).

       01  DISPLAY-STATUS                PIC X(2).

       COPY IOFEEDBACK IN COPYLIB.
       COPY CATREAD    IN COPYLIB.
002800
002900**************************************************************
003000**                                                          **
003100**                  V I E W   W O R K                       **
003200**                                                          **
003300**************************************************************
003400
003500**  SEE LINKAGE SECTION FOR VIEW-COMAREA
003600
003700 01  MESSAGE-BUFFER.
           05  MSG-TEXT.
               10  MESSAGE-BUFFER-1        PIC X(1)  VALUE SPACES.
               10  FILLER                  PIC X(67) VALUE SPACES.
003900     05  MSG-FLD                     PIC X(8)   VALUE SPACES.
004000     05  MSG-FLD-9 REDEFINES MSG-FLD PIC ZZZZZZZ9.
004100
004500 01  FIELD-NUMBER         PIC S9(4) COMP-4 VALUE 1.
004600
004700**************************************************************
004800**                                                          **
004900**            D A T A B A S E   W O R K                     **
005000**                                                          **
005100**************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
005200
005300 COPY DBSTAT     IN COPYLIB.
005400 01  DSET-NAMES.
005500     05  DSET-NAME               PIC X(16) VALUE SPACES.
005600     05  DSET-MPLTINFO           PIC X(16) VALUE "MPLTINFO;".
005700
005800 01  MODE-AREA.
005900     05  MODE1                     PIC S9(4) COMP-4 VALUE 1.
006000     05  MODE7                     PIC S9(4) COMP-4 VALUE 7.
006100
006200 01  ALL-ITEMS                     PIC X(2)  VALUE "@;".
006300 01  MPLTINFO-ARG                  PIC X(4)  VALUE "RQGB".
006400
006500**************************************************************
006600**                                                          **
006700**           D A T A B A S E   B U F F E R S                **
006800**                                                          **
006900**************************************************************
007000
007100 COPY MPLT0      IN COPYLIB.
007200 COPY MPLTRQGB   IN COPYLIB.
007300
007400**************************************************************
007500**                                                          **
007600**                  S C R E E N   D A T A                   **
007700**                                                          **
007800**************************************************************
007900
008000 01  DE-FIELDS.
008100     05  DE-PRINT-WO-REQPK         PIC X(1).
008200     05  DE-WOAP-TO-CUT-REQ        PIC X(1).
008300     05  DE-WOAP-TO-APP-REQ        PIC X(1).
008400     05  DE-DISP-WO-AMTS           PIC X(1).
008500     05  DE-PRINT-REQ-AMTS         PIC X(1).
           05  DE-DISPLAY-APP-AMTS       PIC X(1).
           05  DE-INQ-PASS-REQD          PIC X(1).
008600     05  DE-RE-Q-ANY               PIC X(1).
008700     05  DE-RE-Q-VALUE             PIC X(1).
008800     05  DE-RE-Q-QTY               PIC X(1).
008900     05  DE-RE-Q-DESC              PIC X(1).
009000     05  DE-RE-Q-PATH              PIC X(1).
           05  DE-COMMAND-LINE           PIC X(79).
           05  DE-MESSAGE-LINE           PIC X(79).
009100
009200**************************************************************
009300**                                                          **
009400**            L I N K A G E   S E C T I O N                 **
009500**                                                          **
009600**************************************************************
009700
009800 LINKAGE SECTION.
009900 01  BASE                      PIC X(10).
010000 01  MMIS-BASE                 PIC X(13).
010100
010200 COPY VCOMLINK   IN COPYLIB.
010300 COPY TSHWSUB2   IN COPYLIB.
010400 COPY LANGSUB    IN COPYLIB.
010500
010600 PROCEDURE DIVISION USING BASE
010700                          MMIS-BASE,
010800                          VIEW-COMAREA,
010900                          SRF-COMAREA,
011000                          LANGUAGE-PARMS.
011100
011200 1-HSK.
           OPEN I-O MPLTINFO-O, DISPLAY-FILE.
011300     PERFORM 6000-MAIN THRU 6990-MAIN-X.
           CLOSE MPLTINFO-O, DISPLAY-FILE.
011400     GOBACK.
011500
011600 2100-BLOWUP.
011700     MOVE "SEASETGB"               TO   BU-PGM-NAME.
011800     CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
011900       VIEW-COMAREA FILE-STATUS BU-DISPLAY-MSG
012000       BU-DISPLAY-FLDS.
012100
012200 4030-SETERROR.
           MOVE B"1" TO IND (99).
           MOVE B"1" TO IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE.
051300
014200 4020-CLEAR-FORM.
014300     MOVE SPACES TO MESSAGE-BUFFER.
015500     MOVE SPACES                   TO   DE-FIELDS.
015700
015800******************************************************************
015900**                                                              **
016000**                      M A I N                                 **
016100**                                                              **
016200******************************************************************
016300 6000-MAIN.
016400     MOVE "EASETGB"                TO   VIEW-NFNAME.
016800     PERFORM 7000-GET-OR-PUT-MPLTINFO.
      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO PLTINFOKEY OF MPLTINFO-REC-O.
           START MPLTINFO-O KEY > PLTINFOKEY OF MPLTINFO-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.
016900
017000     MOVE MPLT-PRINT-WO-REQPK      TO   DE-PRINT-WO-REQPK.
017100     MOVE MPLT-WOAP-TO-CUT-REQ     TO   DE-WOAP-TO-CUT-REQ.
017200     MOVE MPLT-WOAP-TO-APP-REQ     TO   DE-WOAP-TO-APP-REQ.
017300     MOVE MPLT-DISP-WO-AMTS        TO   DE-DISP-WO-AMTS.
017400     MOVE MPLT-RE-Q-ANY            TO   DE-RE-Q-ANY.
017500     MOVE MPLT-RE-Q-VALUE          TO   DE-RE-Q-VALUE.
017600     MOVE MPLT-RE-Q-QTY            TO   DE-RE-Q-QTY.
017700     MOVE MPLT-RE-Q-DESC           TO   DE-RE-Q-DESC.
017800     MOVE MPLT-RE-Q-PATH           TO   DE-RE-Q-PATH.
017900     MOVE MPLT-PRINT-REQ-AMTS      TO   DE-PRINT-REQ-AMTS.
           MOVE MPLT-DISPLAY-APP-AMTS    TO   DE-DISPLAY-APP-AMTS.
           MOVE MPLT-INQ-PASS-REQD       TO   DE-INQ-PASS-REQD.
018000
018300     MOVE 7                        TO   SRF-KEYSET.
       6010-SHOWFORM.
           MOVE DE-FIELDS TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC TO DE-FIELDS.
           IF MESSAGE-BUFFER-1 NOT = SPACES
               PERFORM 4030-SETERROR
               GO TO 6010-SHOWFORM.

019000     IF VIEW-LASTKEY = 3
019100         GO TO 6990-MAIN-X.
019200
           PERFORM 7000-GET-OR-PUT-MPLTINFO.

019500     MOVE DE-PRINT-WO-REQPK        TO   MPLT-PRINT-WO-REQPK.
019600     MOVE DE-WOAP-TO-CUT-REQ       TO   MPLT-WOAP-TO-CUT-REQ.
019700     MOVE DE-WOAP-TO-APP-REQ       TO   MPLT-WOAP-TO-APP-REQ.
019800     MOVE DE-DISP-WO-AMTS          TO   MPLT-DISP-WO-AMTS.
019900     MOVE DE-RE-Q-ANY              TO   MPLT-RE-Q-ANY.
020000     MOVE DE-RE-Q-VALUE            TO   MPLT-RE-Q-VALUE.
020100     MOVE DE-RE-Q-QTY              TO   MPLT-RE-Q-QTY.
020200     MOVE DE-RE-Q-DESC             TO   MPLT-RE-Q-DESC.
020300     MOVE DE-RE-Q-PATH             TO   MPLT-RE-Q-PATH.
020400     MOVE DE-PRINT-REQ-AMTS        TO   MPLT-PRINT-REQ-AMTS.
           MOVE DE-DISPLAY-APP-AMTS      TO   MPLT-DISPLAY-APP-AMTS.
           MOVE DE-INQ-PASS-REQD         TO   MPLT-INQ-PASS-REQD.
020500
020700*    CALL "DBUPDATE" USING BASE, DSET-MPLTINFO, MODE1,
020800*      STATUS-AREA, ALL-ITEMS, BUF-MPLTINFO.
           REWRITE MPLTINFO-REC-O FROM BUF-MPLTINFO
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
021000         MOVE "DBUPDATE ERR MPLTINFO" TO BU-DISPLAY-MSG
021100         PERFORM 2100-BLOWUP.
021300
021400
021500 6990-MAIN-X.
021600     GOBACK.
021700
021800 7000-GET-OR-PUT-MPLTINFO.
022000*    CALL "DBGET" USING BASE, DSET-MPLTINFO, MODE7, STATUS-AREA,
022100*      ALL-ITEMS, BUF-MPLTINFO, MPLTINFO-ARG.
           MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-REC-O.
           READ MPLTINFO-O INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
022200     IF FILE-STATUS-1 = "2"
022300         PERFORM 7005-PUT-MPLTINFO
022400     ELSE
022500     IF FILE-STATUS NOT = "00"
022600         MOVE "DBGET ERR MPLTINFO 7000-GOPM" TO BU-DISPLAY-MSG
022700         PERFORM 2100-BLOWUP.
022900
023000 7005-PUT-MPLTINFO.
023100     MOVE SPACES                   TO   MPLTINFO-DATA.
023200     MOVE "RQGB"                   TO   MPLTINFO-KEY.
023300     MOVE "Y"                      TO   MPLT-PRINT-WO-REQPK.
023400     MOVE "N"                      TO   MPLT-WOAP-TO-CUT-REQ.
023500     MOVE "N"                      TO   MPLT-WOAP-TO-APP-REQ.
023600     MOVE "N"                      TO   MPLT-DISP-WO-AMTS.
           MOVE "N"                      TO   MPLT-DISPLAY-APP-AMTS.
           MOVE "N"                      TO   MPLT-INQ-PASS-REQD.
023700     MOVE "N"                      TO   MPLT-RE-Q-ANY.
023800     MOVE "Y"                      TO   MPLT-RE-Q-VALUE.
023900     MOVE "N"                      TO   MPLT-RE-Q-QTY.
024000     MOVE "N"                      TO   MPLT-RE-Q-DESC.
024100     MOVE "Y"                      TO   MPLT-RE-Q-PATH.
024200*    CALL "DBPUT" USING BASE, DSET-MPLTINFO, MODE1, STATUS-AREA,
024300*      ALL-ITEMS, BUF-MPLTINFO.
           WRITE MPLTINFO-REC-O FROM BUF-MPLTINFO
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
024500         MOVE "DBPUT ERR 7005-PM" TO BU-DISPLAY-MSG
024600         PERFORM 2100-BLOWUP.

       COPY DISPCALL IN COPYLIB.
       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
