000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          SEAUSEIQ.
000400 AUTHOR.              C HILLES.
000500 DATE-WRITTEN.        7/1/87.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
      *****************************************************************
      *    ELECTRONIC APPROVAL SYSTEM - USER AUTHORIZATION INQUIRY.
      *****************************************************************

      *****************************************************************
      **          M O D I F I C A T I O N    H I S T O R Y
      *****************************************************************
DCR01 *  MAR 10, 2005  D.RAUCH       DCR01    REQUEST# 2005-78515
DCR01 *     DISPLAY FILE PROCESSING CHANGED FROM USING ZCSISINQ
DCR01 *     NEW DISPLAY FILE ZSEAUSEIQ CREATED - FORMATS COPIED
DCR01 *     FROM ZCSISINQ.
      *----------------------------------------------------------------
DCR01 *  MMM DD, CCYY  XXNAMEXX      XXX01    REQUEST# 2005-XXXXX
DCR01 *****************************************************************
001200
001300 ENVIRONMENT DIVISION.
001400 CONFIGURATION SECTION.
001500 SOURCE-COMPUTER.  HP-3000.
001600 OBJECT-COMPUTER.  HP-3000.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

001800 INPUT-OUTPUT SECTION.
001900 FILE-CONTROL.
002000     SELECT SORT-FILE ASSIGN TO DISK-SORT.
002100     SELECT EMPL-FILE ASSIGN TO DISK-DEAUSEIQ.
002200
           SELECT MLEVEL-I
                  ASSIGN TO DATABASE-MCFLCS4101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MEMPL-I
                  ASSIGN TO DATABASE-MCFLCS4201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT PER-PERSONNEL-I
                  ASSIGN TO DATABASE-MCFLMM0301
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DISPLAY-FILE
DCR01             ASSIGN TO WORKSTATION-ZSEAUSEIQ-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.
001700
002300 DATA DIVISION.
002400 FILE SECTION.
002500 FD  EMPL-FILE.
002600 01  EMPL-REC.
002700     05  ER-EMPL                   PIC X(4).
002800     05  ER-LEVEL                  PIC X(2).
002900     05  ER-ACTIVE-FLAG            PIC X(1).
003000     05  ER-EMPL-NAME              PIC X(16).
003100
003200 SD  SORT-FILE.
003300 01  SORT-REC.
003400     05  SORT-EMPL-ID              PIC X(4).
003500     05  SORT-LEVEL                PIC X(2).
003600     05  SORT-ACTIVE-FLAG          PIC X(1).
003700     05  SORT-EMPL-NAME            PIC X(16).
003800
       FD  MLEVEL-I
           LABEL RECORDS ARE STANDARD.
       01  MLEVEL-REC-I.
           COPY DDS-MCRPCS4100  OF MCFLCS4101.

       FD  MEMPL-I
           LABEL RECORDS ARE STANDARD.
       01  MEMPL-REC-I.
           COPY DDS-MCRPCS4200  OF MCFLCS4201.

       FD  PER-PERSONNEL-I
           LABEL RECORDS ARE STANDARD.
       01  PER-PERSONNEL-REC-I.
           COPY DDS-MCRPMM0300  OF MCFLMM0301.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC        PIC X(2000).

003900 WORKING-STORAGE SECTION.
004000
004100 77  SUB                           PIC S9(4) COMP VALUE 0.
004300 77  SUB2                          PIC S9(4) COMP VALUE 0.
004400 77  END-OF-EMPLS-FLAG             PIC X(1)  VALUE SPACES.
004500
004600**************************************************************
004700**                                                          **
004800**                S U B P R O G R A M   A R E A S           **
004900**                                                          **
005000**************************************************************
005100
005200 COPY TDATECHK   IN COPYLIB.
005300 COPY TBLOWUP    IN COPYLIB.
      *------ WS CONTROL AREA
       01  MAJOR-MINOR                   PIC XXXX.
       01  WS-CONTROL.
           05  FUNCTION-NUM              PIC XX.
               88  EXIT-KEY-F8-USED                 VALUE "08".
               88  REFRESH-KEY-F4-USED              VALUE "04".
               88  ENTER-KEY-USED                   VALUE "00".
               88  F1-KEY-USED                      VALUE "01".
               88  F2-KEY-USED                      VALUE "02".
               88  F3-KEY-USED                      VALUE "03".
               88  F4-KEY-USED                      VALUE "04".
               88  F5-KEY-USED                      VALUE "05".
               88  F6-KEY-USED                      VALUE "06".
               88  F7-KEY-USED                      VALUE "07".
               88  F8-KEY-USED                      VALUE "08".
           05  FUN-KEY REDEFINES FUNCTION-NUM  PIC XX.
           05  TERMINAL-ID               PIC X(10).
           05  FORMAT-NAME               PIC X(10).

       01  DISPLAY-STATUS                PIC X(2).

       COPY IOFEEDBACK IN COPYLIB.
       COPY CATREAD    IN COPYLIB.
       COPY CCRTFILE   IN COPYLIB.
005400
005500**************************************************************
005600**                                                          **
005700**                  V I E W   W O R K                       **
005800**                                                          **
005900**************************************************************
006000
006100**  SEE LINKAGE SECTION FOR VIEW-COMAREA
006200
006300 01  MESSAGE-BUFFER.
006400     05  MSG-TEXT.
               10  MESSAGE-BUFFER-1      PIC X(1)  VALUE SPACES.
               10  FILLER                PIC X(67) VALUE SPACES.
006500     05  MSG-FLD                   PIC X(8)  VALUE SPACES.
006600     05  MSG-FLD-9 REDEFINES MSG-FLD PIC ZZZZZZZ9.
006700
007100 01  FIELD-NUMBER                  PIC S9(4) COMP VALUE 1.
007200
007800**************************************************************
007900**                                                          **
008000**            D A T A B A S E   W O R K                     **
008100**                                                          **
008200**************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
008300
008400 COPY DBSTAT     IN COPYLIB.
008500 01  DSET-NAMES.
008600     05  DSET-MEMPL            PIC X(16) VALUE "MEMPL;".
008700     05  DSET-PER-PERSONNEL    PIC X(16) VALUE "PER-PERSONNEL;".
008800     05  DSET-MLEVEL           PIC X(16) VALUE "MLEVEL;".
008900
009000 01  MODE-AREA.
009100     05  MODE1                 PIC S9(4)   COMP       VALUE 1.
009200     05  MODE2                 PIC S9(4)   COMP       VALUE 2.
009300     05  MODE3                 PIC S9(4)   COMP       VALUE 3.
009400     05  MODE5                 PIC S9(4)   COMP       VALUE 5.
009500     05  MODE7                 PIC S9(4)   COMP       VALUE 7.
009600
009700 01  ALL-ITEMS                 PIC X(2)  VALUE "@;".
009800 01  EMPLOYEE-SEARCH           PIC X(12) VALUE "EMPLOYEE-ID;".
009900 01  EMPLOYEE-ARG              PIC X(4).
010000 01  LEVEL-ARG                 PIC X(2).
010100
010200**************************************************************
010300**                                                          **
010400**           D A T A B A S E   B U F F E R S                **
010500**                                                          **
010600**************************************************************
010700
010800 COPY MEMPL      IN COPYLIB.
010900 COPY MLEVEL     IN COPYLIB.
011000 01  BUF-PER-PERSONNEL.            COPY MPERSONL IN COPYLIB.
011100
011200**************************************************************
011300**                                                          **
011400**                  S C R E E N   D A T A                   **
011500**                                                          **
011600**************************************************************
011700
011800 01  DE-FIELDS.
011900     05  V-EMPLOYEE-LINE OCCURS 15 TIMES.
012000         10  DE-SELECT-EMPL        PIC X(1).
012100         10  V-EMPLOYEE-ID         PIC X(4).
012200         10  V-LEVEL               PIC X(2).
012300         10  V-EMPL-NAME           PIC X(16).
012400         10  V-LEVEL-DESC          PIC X(36).
012500         10  V-ACTIVE-FLAG         PIC X(1).
           05  DE-COMMAND-LINE           PIC X(79).
           05  DE-MESSAGE-LINE           PIC X(79).
012600
012700**************************************************************
012800**                                                          **
012900**            L I N K A G E   S E C T I O N                 **
013000**                                                          **
013100**************************************************************
013200
013300 LINKAGE SECTION.
013400 01  BASE                      PIC X(10).
013500 01  MMIS-BASE                 PIC X(13).
013600
013700 COPY VCOMLINK   IN COPYLIB.
013800 COPY TSHWSUB2   IN COPYLIB.
013900 COPY LANGSUB    IN COPYLIB.
014000 COPY SEAUSEIQ   IN COPYLIB.
014100
014200 PROCEDURE DIVISION USING          BASE
014300                                   MMIS-BASE,
014400                                   VIEW-COMAREA,
014500                                   SRF-COMAREA,
014600                                   LANGUAGE-PARMS,
014700                                   EAUSE-PARMS.
014800
014900
015000
015100 1-HSK.
           MOVE "N" TO END-OF-EMPLS-FLAG.
      *------ CALL CCRTFILE TO CREATE A TEMPORARY FILE 'REQTEMPX'
           MOVE "QTEMP"       TO CCRTFILE-LIBRARY.
           MOVE "DEAUSEIQ"    TO CCRTFILE-FILE.
           MOVE "0023"        TO CCRTFILE-RECORD-LENGTH.
           MOVE "01000"       TO CCRTFILE-NO-RECORDS.
           MOVE "01000"       TO CCRTFILE-INCREMENT-AMT.
           MOVE "99"          TO CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               MOVE "CCRTFILE CREATE OF 'DEAUSEIQ' FAILED"
                  TO BU-DISPLAY-MSG
               MOVE CCRTFILE-STATUS TO BU-DISPLAY-FLD (1)
               PERFORM 2100-BLOWUP.

           OPEN INPUT MLEVEL-I, MEMPL-I, PER-PERSONNEL-I.
           OPEN I-O DISPLAY-FILE.
015200     PERFORM 7300-LOAD-FILE THRU 7390-LF-X.
015300
015400     SORT SORT-FILE ON ASCENDING KEY SORT-EMPL-NAME
015500         USING EMPL-FILE
015600         GIVING EMPL-FILE.
015700
015800     OPEN INPUT EMPL-FILE.
015900     PERFORM 6000-MAIN THRU 6990-MAIN-X.
016000     CLOSE EMPL-FILE.
           CLOSE MLEVEL-I, MEMPL-I, PER-PERSONNEL-I.
016100     GOBACK.
016200
016300 2100-BLOWUP.
016400     MOVE "SEAUSEIQ"               TO   BU-PGM-NAME.
016500     CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
016600       VIEW-COMAREA FILE-STATUS BU-DISPLAY-MSG
016700       BU-DISPLAY-FLDS.
016800
018900 4020-CLEAR-FORM.
019000     MOVE SPACES TO MESSAGE-BUFFER.
020200     MOVE SPACES                   TO   DE-FIELDS.
020400
       4030-SETERROR.
           MOVE B"1" TO IND (99).
           MOVE B"1" TO IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE.
051300
020500 6000-MAIN.
020600     MOVE "EAUSERINQ"              TO   VIEW-NFNAME.
020800     PERFORM 4020-CLEAR-FORM.
020900
021000     PERFORM 7000-LOAD-SCREEN THRU 7090-LS-X.
021100
021200     IF END-OF-EMPLS-FLAG = "Y"
021300         MOVE "I"                  TO   SRF-FKEY (2)
           ELSE
               MOVE SPACES TO SRF-FKEY (2).

022500     MOVE 2                        TO   SRF-KEYSET.
022600     MOVE "I"                      TO   SRF-FKEY (3),
022700                                        SRF-FKEY (6),
022800                                        SRF-FKEY (7).
022900     MOVE "N"                      TO   SRF-ENTER-FLAG.
023000*------ f8 MUST AUTOREAD TO GET SELECTED EMPL
023100     MOVE " AF"                    TO   SRF-FKEY (8).
       6010-SHOWFORM.
           MOVE DE-FIELDS TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           MOVE DISPLAY-REC TO DE-FIELDS.
           IF MESSAGE-BUFFER-1 NOT = SPACES
               PERFORM 4030-SETERROR
               GO TO 6010-SHOWFORM.

023800*------ THE USER CAN SELECT ANY OF THE DISPLAYED EMPLOYEES, AND
023900*------ THE EMPLOYEE ID WILL BE RETURNED TO CALLING PROGRAM.
024100     MOVE 0                        TO   SUB.
024200     MOVE SPACES                   TO   EAUSE-RETURNED-EMPL.
024300 6010-GET-SELECTED-EMPL-LOOP.
024400     ADD 1                         TO   SUB.
024500     IF SUB > 15
024600         GO TO 6020-CONTINUE.
024700
024800     IF DE-SELECT-EMPL (SUB) > " "
024900         MOVE V-EMPLOYEE-ID (SUB)  TO   EAUSE-RETURNED-EMPL
025000         GO TO 6020-CONTINUE.
025100
025200     GO TO 6010-GET-SELECTED-EMPL-LOOP.
025300
025400 6020-CONTINUE.
025500*------- SHOW NEXT SCREEN
025600     IF VIEW-LASTKEY = 2
025700         GO TO 6000-MAIN.
025800
025900     IF VIEW-LASTKEY = 1
026000         PERFORM 7100-RESTART
026100         GO TO 6000-MAIN.
026200
026300 6990-MAIN-X.
026400     EXIT.
026500
026600 7000-LOAD-SCREEN.
026700     MOVE 0                        TO   SUB.
026800 7010-SERIAL-GET-LOOP.
026900     ADD 1                         TO   SUB.
027000     IF SUB > 15
027100         GO TO 7090-LS-X.
027200
027300     READ EMPL-FILE AT END
027400         MOVE "Y"                  TO   END-OF-EMPLS-FLAG
027500         GO TO 7090-LS-X.
027600
027700     MOVE ER-EMPL                  TO   V-EMPLOYEE-ID (SUB).
027800     MOVE ER-LEVEL                 TO   V-LEVEL (SUB).
027900     MOVE ER-EMPL-NAME             TO   V-EMPL-NAME (SUB).
028000
028100*------- GET DESC OF THAT EMPL'S LEVEL FROM LEVEL MASTER DATASET
028200     MOVE ER-LEVEL                 TO   LEVEL-ARG.
028300*    CALL "DBGET" USING BASE, DSET-MLEVEL, MODE7, STATUS-AREA,
028400*      ALL-ITEMS, BUF-MLEVEL, LEVEL-ARG.
           MOVE LEVEL-ARG TO LEVELNUM OF MLEVEL-REC-I.
           READ MLEVEL-I INTO BUF-MLEVEL
               INVALID KEY MOVE 17 TO COND-WORD.
028500     IF FILE-STATUS = "00"
028600         MOVE MLEVEL-LEVEL-DESC    TO   V-LEVEL-DESC (SUB)
028700     ELSE
028800     IF FILE-STATUS-1 = "2"
028900         MOVE SPACES               TO   V-LEVEL-DESC (SUB)
029000     ELSE
029100         MOVE "DBGET ERR MLEVEL 7010-SGL" TO BU-DISPLAY-MSG
029200         PERFORM 2100-BLOWUP.
029300
029400     MOVE ER-ACTIVE-FLAG           TO   V-ACTIVE-FLAG (SUB).
029500
029600     GO TO 7010-SERIAL-GET-LOOP.
029700
029800 7090-LS-X.
029900     EXIT.
030000
030100 7100-RESTART.
030200     MOVE "N"                      TO   END-OF-EMPLS-FLAG.
030300     CLOSE EMPL-FILE.
030400     OPEN INPUT EMPL-FILE.
030500
030600
030700
030800
030900 7300-LOAD-FILE.
031000*------- REWIND THE MASTER DATASET (START FROM BEGINNING)
031100*    CALL "DBCLOSE" USING BASE, DSET-MEMPL, MODE3,
031200*      STATUS-AREA.
           MOVE SPACES TO EMPLOYID OF MEMPL-REC-I.
           START MEMPL-I KEY > EMPLOYID OF MEMPL-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
031300     IF FILE-STATUS NOT = "00"
031400         MOVE "DBCLOSE ERROR (REWIND) 7000-LS" TO BU-DISPLAY-MSG
031500         PERFORM 2100-BLOWUP.
031600
031700     OPEN OUTPUT EMPL-FILE.
031800
031900 7310-GET-MEMPL-LOOP.
032000*    CALL "DBGET" USING BASE, DSET-MEMPL, MODE2, STATUS-AREA,
032100*      ALL-ITEMS, BUF-MEMPL, EMPLOYEE-ARG.
           READ MEMPL-I NEXT INTO BUF-MEMPL
               AT END MOVE 15 TO COND-WORD.
032200     IF FILE-STATUS NOT = "00"
032300         GO TO 7380-CLOSE-FILE.
032900
033000     MOVE MEMPL-EMPL               TO   ER-EMPL.
033100     MOVE MEMPL-LEVEL              TO   ER-LEVEL.
033200     MOVE MEMPL-ACTIVE-FLAG        TO   ER-ACTIVE-FLAG.
033300
033400*-------- GET THE EMPLOYEE NAME FROM THE MMIS DATABASE
033500     MOVE ER-EMPL                  TO   EMPLOYEE-ARG.
033600*    CALL "DBGET" USING MMIS-BASE, DSET-PER-PERSONNEL, MODE7,
033700*      STATUS-AREA, ALL-ITEMS, BUF-PER-PERSONNEL, EMPLOYEE-ARG.
           MOVE EMPLOYEE-ARG TO PERCCNUM OF PER-PERSONNEL-REC-I.
           READ PER-PERSONNEL-I INTO BUF-PER-PERSONNEL
               INVALID KEY MOVE 17 TO COND-WORD.
033800     IF FILE-STATUS = "00"
033900         MOVE PER-EMP-NAME         TO   ER-EMPL-NAME
034000     ELSE
034100     IF FILE-STATUS-1 = "2"
034200         MOVE SPACES               TO   ER-EMPL-NAME
034300     ELSE
034400         MOVE "DBGET ERR PERSONNEL 7310-GML" TO BU-DISPLAY-MSG
034500         PERFORM 2100-BLOWUP.
034600
034700     WRITE EMPL-REC.
034800
034900     GO TO 7310-GET-MEMPL-LOOP.
035000
035100 7380-CLOSE-FILE.
035200     CLOSE EMPL-FILE.
035300
035400 7390-LF-X.
035500     EXIT.
       COPY DISPCALL IN COPYLIB.
            IF VIEW-LASTKEY = 3
                MOVE 8 TO VIEW-LASTKEY
            ELSE
            IF VIEW-LASTKEY = 8
                MOVE 3 TO VIEW-LASTKEY.
            IF SRF-KEYSET = 1 OR 3 OR 5 OR 7
                MOVE "I" TO SRF-FKEY (7).
            IF SRF-KEYSET > 0
                MOVE "I" TO SRF-FKEY (5).
            IF SRF-KEYSET = 1 OR 2 OR 5 OR 6 OR 7 OR 8
                MOVE "I" TO SRF-FKEY (4).
            IF SRF-KEYSET = 5 OR 6
                MOVE "I" TO SRF-FKEY (8), SRF-FKEY (6)
            ELSE
            IF SRF-KEYSET = 7 OR 8
                MOVE "I" TO SRF-FKEY (1), SRF-FKEY (2), SRF-FKEY (8).
            MOVE SPACES TO MESSAGE-BUFFER-1.
            IF VIEW-LASTKEY = 0
                IF SRF-ENTER-FLAG = "I"
      *M            "E28: 'ENTER' NOT VALID HERE"
                    MOVE 5 TO LANG-SETNUM
                    MOVE 28 TO LANG-MSGNUM
                    MOVE 1 TO FIELD-NUMBER, SRF-ERROR-FLD
                    PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                ELSE
                NEXT SENTENCE
            ELSE
            IF SRF-FKEY (VIEW-LASTKEY) = "I"
      *M        "I10: INVALID FUNCTION KEY"
                MOVE 9 TO LANG-SETNUM
                MOVE 10 TO LANG-MSGNUM
                MOVE 1 TO FIELD-NUMBER, SRF-ERROR-FLD
                PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
            IF MESSAGE-BUFFER-1 = SPACES
                MOVE SPACES TO SRF-FKEY-AREA, SRF-ENTER-FLAG.
        9989-WS-X.
            EXIT.

       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
