000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          SEAVACA.
000400 AUTHOR.              C HILLES/JIM COFFMAN (MAINTAINER).
000500 DATE-WRITTEN.        1/25/88.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
      *****************************************************************
      *D   REQUISITION APPROVAL SYSTEM - GO ON VACATION.
      *D   THIS PROGRAM IS USED WHEN AN APPROVER GOES "INACTIVE" -
      *D   VACATION, TRAVELLING, ETC.  THE APPROVER MUST ASSIGN AN
      *D   ALTERNATE BEFORE HE CAN GO ON VACATION.
      *D   THIS PROGRAM IN CALLED EXCLUSIVELY BY SMREQINQ. IT IS
      *D   ACTIVATED THRU THE E2 (TREQRLSE) FUNCTION BY X'ING THE
      *D   FIELD MARKED UNAVAIL.
      *****************************************************************


      *****************************************************************
      **          M O D I F I C A T I O N    H I S T O R Y
      *****************************************************************
DCR01 *  MAR 10, 2005  D.RAUCH       DCR01    REQUEST# 2005-78515
DCR01 *     DISPLAY FILE PROCESSING CHANGED FROM USING ZCSISINQ
DCR01 *     NEW DISPLAY FILE ZSEAVACA  CREATED - FORMATS COPIED
DCR01 *     FROM ZCSISINQ.
      *----------------------------------------------------------------
DCR01 *  MMM DD, CCYY  XXNAMEXX      XXX01    REQUEST# 2005-XXXXX
DCR01 *****************************************************************
001500 ENVIRONMENT DIVISION.
001600 CONFIGURATION SECTION.
001700 SOURCE-COMPUTER.  HP-3000.
001800 OBJECT-COMPUTER.  HP-3000.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZSEAVACA-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

           SELECT MEMPL-I
                  ASSIGN TO DATABASE-MCFLCS4201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

001900
002000 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC        PIC X(2000).

       FD  MEMPL-I
           LABEL RECORDS ARE STANDARD.
       01  MEMPL-REC-I.
           COPY DDS-MCRPCS4200  OF MCFLCS4201.

002100 WORKING-STORAGE SECTION.
002200
002300 01  ALL-LEVELS                    PIC X(2)  VALUE "AL".
002400
002500**************************************************************
002600**                                                          **
002700**                S U B P R O G R A M   A R E A S           **
002800**                                                          **
002900**************************************************************
003000
003100 COPY TBLOWUP    IN COPYLIB.
003200 COPY SEAUSEIQ   IN COPYLIB.
003300 COPY CEAUPEMP   IN COPYLIB.
003400 COPY TSHWRDFM   IN COPYLIB.
      *------ WS CONTROL AREA
       01  MAJOR-MINOR                   PIC XXXX.
       01  WS-CONTROL.
           05  FUNCTION-NUM              PIC XX.
               88  EXIT-KEY-F8-USED                 VALUE "08".
               88  REFRESH-KEY-F4-USED              VALUE "04".
               88  ENTER-KEY-USED                   VALUE "00".
               88  F1-KEY-USED                      VALUE "01".
               88  F2-KEY-USED                      VALUE "02".
               88  F3-KEY-USED                      VALUE "03".
               88  F4-KEY-USED                      VALUE "04".
               88  F5-KEY-USED                      VALUE "05".
               88  F6-KEY-USED                      VALUE "06".
               88  F7-KEY-USED                      VALUE "07".
               88  F8-KEY-USED                      VALUE "08".
           05  FUN-KEY REDEFINES FUNCTION-NUM  PIC XX.
           05  TERMINAL-ID               PIC X(10).
           05  FORMAT-NAME               PIC X(10).

       01  DISPLAY-STATUS                PIC X(2).

       COPY IOFEEDBACK IN COPYLIB.
       COPY CATREAD    IN COPYLIB.
003500
003600**************************************************************
003700**                                                          **
003800**                  V I E W   W O R K                       **
003900**                                                          **
004000**************************************************************
004100
004200**  SEE LINKAGE SECTION FOR VIEW-COMAREA
004300
004400 01  MESSAGE-BUFFER.
004500     05  MSG-TEXT.
004600         10  MESSAGE-BUFFER-1      PIC X(1).
004700         10  FILLER                PIC X(67).
004800     05  MSG-FLD          PIC X(8)   VALUE SPACES.
004900     05  MSG-FLD-9 REDEFINES MSG-FLD PIC ZZZZZZZ9.
005000
005400 01  FIELD-NUMBER         PIC S9(4) COMP-4 VALUE 1.
005500
005600**************************************************************
005700**                                                          **
005800**            D A T A B A S E   W O R K                     **
005900**                                                          **
006000**************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
006100
006200 01  ALL-ITEMS                     PIC X(2)  VALUE "@;".
006300 01  EMPL-SEARCH                PIC X(16) VALUE "EMPLOYEE-ID;".
006400 COPY DBSTAT     IN COPYLIB.
006500
006600 01  MODE-AREA.
006700     05  MODE1                     PIC S9(4)   COMP       VALUE 1.
006800     05  MODE3                     PIC S9(4)   COMP       VALUE 3.
006900     05  MODE5                     PIC S9(4)   COMP       VALUE 5.
007000     05  MODE7                     PIC S9(4)   COMP       VALUE 7.
007100
007200 01  DSET-NAMES.
007300     05  DSET-MEMPL                PIC X(16) VALUE "MEMPL;".
007400
007500 01  EMPL-ARG                      PIC X(4)  VALUE SPACES.
007600
008600******************************************************************
008700**                                                              **
008800**             D A T A B A S E   B U F F E R S                  **
008900**                                                              **
009000******************************************************************
009100 COPY MEMPL      IN COPYLIB.
009200
009300**************************************************************
009400**                                                          **
009500**                  S C R E E N   D A T A                   **
009600**                                                          **
009700**************************************************************
009800
009900 01  DE-FIELDS.
010000     05  DE-EMPL                   PIC X(4).
           05  DE-COMMAND-LINE           PIC X(79).
           05  DE-MESSAGE-LINE           PIC X(79).
010100
010200**************************************************************
010300**                                                          **
010400**            L I N K A G E   S E C T I O N                 **
010500**                                                          **
010600**************************************************************
010700
010800 LINKAGE SECTION.
010900 01  BASE.
011000     05  BASE-1-2                  PIC X(2).
011100     05  FILLER                    PIC X(6).
011200
011300 01  BASE-MMISA.
011400     05  BASE-MMISA-1-2            PIC X(2).
011500     05  FILLER                    PIC X(24).
011600
011700 01  EAVACA-PARMS.
011800     05  EAVACA-EMPL               PIC X(4).
011900     05  EAVACA-EMPL-LEVEL         PIC X(2).
012000     05  FILLER                    PIC X(30).
012100
012200 COPY VCOMLINK   IN COPYLIB.
012300 COPY LANGSUB    IN COPYLIB.
012400 PROCEDURE DIVISION USING          BASE,
012500                                   BASE-MMISA,
012600                                   EAVACA-PARMS,
012700                                   VIEW-COMAREA,
012800                                   LANGUAGE-PARMS.
012900
013000
013100 1-HSK.
           MOVE "AL" TO ALL-LEVELS.
           OPEN INPUT MEMPL-I.
           OPEN I-O DISPLAY-FILE.
013200     PERFORM 6000-MAIN THRU 6990-MAIN-X.
           CLOSE MEMPL-I, DISPLAY-FILE.
013300     GOBACK.
013400
015500 4030-SETERROR.
           MOVE B"1" TO IND (99).
           MOVE B"1" TO IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE.
051300
017800 2100-BLOWUP.
017900     MOVE "SEAVACA"                TO   BU-PGM-NAME.
018000     MOVE EAVACA-EMPL              TO   BU-DISPLAY-FLD (1).
018100     MOVE DE-EMPL                  TO   BU-DISPLAY-FLD (2).
018200     CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
018300       VIEW-COMAREA FILE-STATUS BU-DISPLAY-MSG
018400       BU-DISPLAY-FLDS.
018500
018600 6000-MAIN.
018700     MOVE "FEAVACA"                TO   VIEW-NFNAME.
019000
019100 6010-READ-SCREEN.
019200*----- f1 f2 f3 f6 INVALID, f4 REFRESH, f5 PRT, f7 APL, f8 EXIT
019300     MOVE 8                        TO   SRF-KEYSET.
       6010-SHOWFORM.
           MOVE DE-FIELDS TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC TO DE-FIELDS.
      *    IF MESSAGE-BUFFER-1 NOT = SPACES
      *        PERFORM 4030-SETERROR
      *        GO TO 6010-SHOWFORM.

020000     IF VIEW-LASTKEY = 3
020100         GO TO 6990-MAIN-X.
020200
020300     IF VIEW-LASTKEY = 7
020400         CALL "SEAUSEIQ" USING     BASE,
020500                                   BASE-MMISA,
020600                                   VIEW-COMAREA,
020700                                   SRF-COMAREA,
020800                                   LANGUAGE-PARMS,
020900                                   EAUSE-PARMS
021000         IF EAUSE-RETURNED-EMPL = SPACES
021100             MOVE "FEAVACA"        TO   VIEW-NFNAME
021400             GO TO 6010-READ-SCREEN
021500         ELSE
021600             MOVE "FEAVACA"        TO   VIEW-NFNAME
021800             MOVE EAUSE-RETURNED-EMPL TO DE-EMPL
022000             GO TO 6010-READ-SCREEN.
022100
022400 6020-VALIDATE-USER.
022500     MOVE DE-EMPL                  TO   EMPL-ARG.
022600*    CALL "DBGET" USING BASE, DSET-MEMPL, MODE7, STATUS-AREA,
022700*      ALL-ITEMS, BUF-MEMPL, EMPL-ARG.
           MOVE EMPL-ARG TO EMPLOYID OF MEMPL-REC-I.
           READ MEMPL-I INTO BUF-MEMPL
               INVALID KEY MOVE 17 TO COND-WORD.
022800     IF FILE-STATUS-1 = "2"
022900*        "E17: EMPLOYEE ID DOES NOT EXIST"
023000         MOVE   5 TO LANG-SETNUM
023100         MOVE  17 TO LANG-MSGNUM
023200         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
023300         PERFORM 4030-SETERROR
023400         GO TO 6010-READ-SCREEN
023500     ELSE
023600     IF FILE-STATUS NOT = "00"
023700         MOVE "DBGET ERR MEMPL 6020-VU" TO BU-DISPLAY-MSG
023800         PERFORM 2100-BLOWUP.
023900
      *M---USER MUST HAVE APPROVE REQ CAPABILITY TO BE A LEGITIMATE
      *M---ALTERNATE APPROVER
024000     IF MEMPL-APP-RQ-FLAG NOT = "Y"
024100*        "E50: EMPLOYEE DOES NOT HAVE APPROVAL CAPABILITY"
024200         MOVE   5 TO LANG-SETNUM
024300         MOVE  50 TO LANG-MSGNUM
024400         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
024500         PERFORM 4030-SETERROR
024600         GO TO 6010-READ-SCREEN.
024700
024800*------ CHANGE THE OLD EMPLOYEE TO INACTIVE.
           MOVE SPACES                   TO   CEAUPEMP-PARMS.
024900     MOVE EAVACA-EMPL              TO   EMPL-ARG.
025000     MOVE EAVACA-EMPL              TO   CEAU-EMPL.
025100     MOVE "Y"                      TO   CEAU-OLD-ACTIVE.
025200     MOVE "N"                      TO   CEAU-CURRENT-ACTIVE.
025300     MOVE EAVACA-EMPL-LEVEL        TO   CEAU-OLD-LEVEL,
025400                                        CEAU-CURRENT-LEVEL.
025500     MOVE "Y"                      TO   CEAU-UPDATE-MEMPL-FLAG.
025600     CALL "CEAUPEMP" USING BASE, STATUS-AREA, CEAUPEMP-PARMS,
025700       BU-DISPLAY-MSG.
025800     IF BU-DISPLAY-MSG-1 NOT = SPACES
025900         PERFORM 2100-BLOWUP.
026000
026100*------ CHANGE THE NEW EMPLOYEE TO ACTIVE, BUT ALSO LEAVE HIM
026200*------ ACTIVE AT HIS OLD LEVEL.
           MOVE SPACES                   TO   CEAUPEMP-PARMS.
026300     MOVE DE-EMPL                  TO   EMPL-ARG.
026400     MOVE DE-EMPL                  TO   CEAU-EMPL.
026500     MOVE "N"                      TO   CEAU-OLD-ACTIVE.
026600     MOVE "Y"                      TO   CEAU-CURRENT-ACTIVE.
026700     MOVE EAVACA-EMPL-LEVEL        TO   CEAU-OLD-LEVEL,
026800                                        CEAU-CURRENT-LEVEL.
026900     CALL "CEAUPEMP" USING BASE, STATUS-AREA, CEAUPEMP-PARMS,
027000       BU-DISPLAY-MSG.
027100     IF BU-DISPLAY-MSG-1 NOT = SPACES
027200         PERFORM 2100-BLOWUP.
027300
027400*------ NOW CHANGE ALL UNAPPROVED REQS IN EMPL'S QUEUE TO THE
027500*------ ALTERNATE EMPL.
027600     CALL "CEAQCHG" USING BASE, STATUS-AREA, BU-DISPLAY-MSG,
027700       EAVACA-EMPL, DE-EMPL, ALL-LEVELS.
027800     IF BU-DISPLAY-MSG-1 NOT = SPACES
027900         PERFORM 2100-BLOWUP.
028000
028100 6990-MAIN-X.
028200     EXIT.
028300
       COPY DISPCALL IN COPYLIB.
028400 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
030000 999-CATREAD-EXIT.
030100     EXIT.
