000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          SEAVALID.
000400 AUTHOR.              C HILLES/JIM COFFMAN (MAINTAINER).
000500 DATE-WRITTEN.        7/1/87.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*D   REQUISITION CREATE OR APPROVE - USER IDENTIFICATION.
001100*D   TO CREATE OR APPROVE A REQ, THE USER HAS TO BE AUTHORIZED
001200*D   WITH AN ID AND PASSWORD.  HE ENTERS HIS ID, AND PASSWORD
001300*D   THRU THIS SCREEN, WHICH THEN BRINGS HIM TO THE APPROPRIATE
001400*D   SUBPROGRAM (REQ CREATE/MOD/DELETE OR REQ APPROVE).

      *C   03/11/1998   CA YODER   REQ #97-1125
      *C     CHANGED PASSWORD FROM 6 TO 8 FOR CALL TO "TPERPASS."
      *C
001500
001600 ENVIRONMENT DIVISION.
001700 CONFIGURATION SECTION.
001800 SOURCE-COMPUTER.  HP-3000.
001900 OBJECT-COMPUTER.  HP-3000.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MEMPL
                  ASSIGN TO DATABASE-MCFLCS4201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZEAREQ-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

002000
002100 DATA DIVISION.
       FILE SECTION.
       FD  MEMPL
           LABEL RECORDS ARE STANDARD.
       01  MEMPL-REC.
           COPY DDS-MCRPCS4200  OF MCFLCS4201.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC        PIC X(1500).

002200 WORKING-STORAGE SECTION.
002300
003200**************************************************************
003300**                                                          **
003400**                S U B P R O G R A M   A R E A S           **
003500**                                                          **
003600**************************************************************
003700
003800 COPY TBLOWUP    IN COPYLIB.
       COPY CATREAD IN COPYLIB.
       COPY TSHWRDFM   IN COPYLIB.
      *------ WS CONTROL AREA
       01  MAJOR-MINOR                   PIC XXXX.
       01  WS-CONTROL.
           05  FUNCTION-NUM              PIC XX.
               88  EXIT-KEY-F8-USED                 VALUE "08".
               88  REFRESH-KEY-F4-USED              VALUE "04".
               88  ENTER-KEY-USED                   VALUE "00".
               88  F1-KEY-USED                      VALUE "01".
               88  F2-KEY-USED                      VALUE "02".
               88  F3-KEY-USED                      VALUE "03".
               88  F4-KEY-USED                      VALUE "04".
               88  F5-KEY-USED                      VALUE "05".
               88  F6-KEY-USED                      VALUE "06".
               88  F7-KEY-USED                      VALUE "07".
               88  F8-KEY-USED                      VALUE "08".
           05  FUN-KEY REDEFINES FUNCTION-NUM  PIC XX.
           05  TERMINAL-ID               PIC X(10).
           05  FORMAT-NAME               PIC X(10).

       01  DISPLAY-STATUS                PIC X(2).

       COPY IOFEEDBACK IN COPYLIB.
003900
004000*------ PARMS FOR CALL TO "TPERPASS" - PASSWORD SUBPROGRAM
004100 01  CC-BUFFER                     PIC X(4)  VALUE SPACES.
004200 01  NAME-BUFFER                   PIC X(16) VALUE SPACES.
004300*01  PWORD-BUFFER                  PIC X(8)  VALUE SPACES.
004300 01  PWORD-BUFFER                  PIC X(10) VALUE SPACES.
004400 01  PWORD-SWITCH                  PIC X(1)  VALUE SPACES.
004500
       01  ANY-CHAR                      PIC X(1).
004600**************************************************************
004700**                                                          **
004800**                  V I E W   W O R K                       **
004900**                                                          **
005000**************************************************************
005100
005200**  SEE LINKAGE SECTION FOR VIEW-COMAREA
005300
005400 01  MESSAGE-BUFFER.
005500     05  MSG-TEXT.
005600         10  MESSAGE-BUFFER-1      PIC X(1).
005700         10  FILLER                PIC X(67).
005800     05  MSG-FLD          PIC X(8)   VALUE SPACES.
005900     05  MSG-FLD-9 REDEFINES MSG-FLD PIC ZZZZZZZ9.
006000
006100 01  MSG-BUFFLEN          PIC S9(4)  COMP-4 VALUE 76.
006200 01  MSG-ACTUALEN         PIC S9(4)  COMP-4 VALUE 76.
006300
006400 01  FIELD-NUMBER         PIC S9(4) COMP-4 VALUE 1.
006500
006600**************************************************************
006700**                                                          **
006800**            D A T A B A S E   W O R K                     **
006900**                                                          **
007000**************************************************************
007100
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

007600 COPY DBSTAT     IN COPYLIB.
007700
007800 01  MODE-AREA.
007900     05  MODE1                     PIC S9(4)   COMP       VALUE 1.
008000     05  MODE3                     PIC S9(4)   COMP       VALUE 3.
008100     05  MODE5                     PIC S9(4)   COMP       VALUE 5.
008200     05  MODE7                     PIC S9(4)   COMP       VALUE 7.
008300
008400 01  DSET-NAMES.
008500     05  DSET-MEMPL                PIC X(16) VALUE "MEMPL;".
008600     05  DSET-DTERM                PIC X(16) VALUE "DTERM;".
008700     05  DSET-PER-PERSONNEL   PIC X(16) VALUE "PER-PERSONNEL;".
008800
008900 01  EMPL-ARG                      PIC X(4)  VALUE SPACES.
009000
010000******************************************************************
010100**                                                              **
010200**             D A T A B A S E   B U F F E R S                  **
010300**                                                              **
010400******************************************************************
010500 01  BUF-PER-PERSONNEL.            COPY MPERSONL IN COPYLIB.
010600
010700**************************************************************
010800**                                                          **
010900**                  S C R E E N   D A T A                   **
011000**                                                          **
011100**************************************************************
011200
011300 01  DE-FIELDS.
011400     05  DE-COMMAND-LINE           PIC X(79).
           05  DE-MESSAGE-LINE           PIC X(79).
011500
011600**************************************************************
011700**                                                          **
011800**            L I N K A G E   S E C T I O N                 **
011900**                                                          **
012000**************************************************************
012100
012200 LINKAGE SECTION.
012300 01  BASE.
012400     05  BASE-1-2                  PIC X(2).
012500     05  FILLER                    PIC X(6).
012600
012700 01  BASE-MMISA.
012800     05  BASE-MMISA-1-2            PIC X(2).
012900     05  FILLER                    PIC X(24).
013000
013100 01  EAVALID-PARMS.
013200     05  EAVALID-TYPE              PIC X(1).
013300     05  EAVALID-OK                PIC X(1).
013400     05  EAVALID-LASTKEY           PIC S9(4) COMP-4.
013500     05  FILLER                    PIC X(30).
013600
013700 COPY VCOMLINK   IN COPYLIB.
013800 COPY LANGSUB    IN COPYLIB.
013900 COPY MEMPL      IN COPYLIB.
014000 PROCEDURE DIVISION USING          BASE,
014100                                   BASE-MMISA,
014200                                   EAVALID-PARMS,
014300                                   VIEW-COMAREA,
014400                                   LANGUAGE-PARMS,
014500                                   BUF-MEMPL.
014600
014700
014800 1-HSK.
           MOVE SPACES TO CC-BUFFER, NAME-BUFFER,
             PWORD-BUFFER, PWORD-SWITCH.
           OPEN INPUT MEMPL.
014900     MOVE "N"                      TO   EAVALID-OK.
015000
015100*    IF BASE-MMISA-1-2 = SPACES
015200*        CALL "DBOPEN" USING BASE-MMISA, PASSWORD-MMISA,
015300*          MODE1, STATUS-AREA
015400*        IF COND-WORD NOT = 0
015500*            MOVE "DBOPEN ERROR MMISA" TO BU-DISPLAY-MSG
015600*            PERFORM 2100-BLOWUP.
015700*
015800*    IF BASE-1-2 = SPACES
015900*        CALL "DBOPEN" USING BASE, PASSWORD,
016000*          MODE1, STATUS-AREA
016100*        IF COND-WORD NOT = 0
016200*            MOVE "DBOPEN ERROR STORES" TO BU-DISPLAY-MSG
016300*            PERFORM 2100-BLOWUP.
016400*
016500     PERFORM 6000-MAIN THRU 6990-MAIN-X.
           CLOSE MEMPL.
016600     GOBACK.
016700
016800 2100-BLOWUP.
016900     MOVE "SEAVALID"               TO   BU-PGM-NAME.
017000     CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
017100       VIEW-COMAREA FILE-STATUS BU-DISPLAY-MSG
017200       BU-DISPLAY-FLDS.
017300
       4030-SETERROR.
           MOVE B"1" TO IND (99).
           MOVE B"1" TO IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE.
051300
017400 6000-MAIN.
017500 6020-VALIDATE-USER.
017600     MOVE "N"                      TO   EAVALID-OK.
017700
017800     CALL "TPERPASS" USING CC-BUFFER, NAME-BUFFER,
017900       PWORD-BUFFER, PWORD-SWITCH.
018000     IF PWORD-SWITCH = "N"
018100         GO TO 6990-MAIN-X.
018200
018300     MOVE CC-BUFFER                TO   EMPL-ARG.
018400*    CALL "DBET" USING BASE, DSET-MEMPL, MODE7, STATUS-AREA,
018500*      ALL-ITEMS, BUF-MEMPL, EMPL-ARG.
           MOVE 0 TO COND-WORD.
           MOVE EMPL-ARG TO EMPLOYID OF MEMPL-REC.
           READ MEMPL INTO BUF-MEMPL
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
018600     IF NO-ENTRY
018700*        PERFORM 7000-NOT-AUTHORIZED-ERROR THRU 7090-NAE-X
018800         GO TO 6990-MAIN-X
018900     ELSE
019000     IF GOOD-CALL
019100         IF EAVALID-TYPE = "R" AND (MEMPL-CRT-RQ-FLAG NOT = "Y")
019200             PERFORM 7000-NOT-AUTHORIZED-ERROR THRU 7090-NAE-X
019300             GO TO 6990-MAIN-X
019400         ELSE
019500         IF EAVALID-TYPE = "A" AND (MEMPL-APP-RQ-FLAG NOT = "Y")
019600             PERFORM 7000-NOT-AUTHORIZED-ERROR THRU 7090-NAE-X
019700             GO TO 6990-MAIN-X
019800         ELSE
019900             NEXT SENTENCE
020000     ELSE
020100         MOVE "DBGET ERR MEMPL 6020-VU" TO BU-DISPLAY-MSG
020200         PERFORM 2100-BLOWUP.
020300
020400*------ AT THIS POINT, HE IS OK TO SIGN ONTO THE PROGRAM
020500     MOVE "Y"                      TO   EAVALID-OK.
020600
020700 6990-MAIN-X.
020800     EXIT.
020900
021000 7000-NOT-AUTHORIZED-ERROR.
           OPEN I-O DISPLAY-FILE.
           MOVE "NOTAUTH" TO VIEW-NFNAME.
       7010-SHOWFORM.
           MOVE DE-FIELDS TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           MOVE DISPLAY-REC TO DE-FIELDS.
           IF MESSAGE-BUFFER-1 NOT = SPACES
               PERFORM 4030-SETERROR
               GO TO 7010-SHOWFORM.

           CLOSE DISPLAY-FILE.
       7090-NAE-X.
           EXIT.

       COPY DISPCALL IN COPYLIB.
            IF VIEW-LASTKEY = 3
                MOVE 8 TO VIEW-LASTKEY
            ELSE
            IF VIEW-LASTKEY = 8
                MOVE 3 TO VIEW-LASTKEY.
            IF SRF-KEYSET = 1 OR 3 OR 5 OR 7
                MOVE "I" TO SRF-FKEY (7).
            IF SRF-KEYSET > 0
                MOVE "I" TO SRF-FKEY (5).
            IF SRF-KEYSET = 1 OR 2 OR 5 OR 6 OR 7 OR 8
                MOVE "I" TO SRF-FKEY (4).
            IF SRF-KEYSET = 5 OR 6
                MOVE "I" TO SRF-FKEY (8), SRF-FKEY (6)
            ELSE
            IF SRF-KEYSET = 7 OR 8
                MOVE "I" TO SRF-FKEY (1), SRF-FKEY (2), SRF-FKEY (8).
            MOVE SPACES TO MESSAGE-BUFFER-1.
            IF VIEW-LASTKEY = 0
                IF SRF-ENTER-FLAG = "I"
      *M            "E28: 'ENTER' NOT VALID HERE"
                    MOVE 5 TO LANG-SETNUM
                    MOVE 28 TO LANG-MSGNUM
                    MOVE 1 TO FIELD-NUMBER, SRF-ERROR-FLD
                    PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                ELSE
                NEXT SENTENCE
            ELSE
            IF SRF-FKEY (VIEW-LASTKEY) = "I"
      *M        "I10: INVALID FUNCTION KEY"
                MOVE 9 TO LANG-SETNUM
                MOVE 10 TO LANG-MSGNUM
                MOVE 1 TO FIELD-NUMBER, SRF-ERROR-FLD
                PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
            IF MESSAGE-BUFFER-1 = SPACES
                MOVE SPACES TO SRF-FKEY-AREA, SRF-ENTER-FLAG.
        9989-WS-X.
            EXIT.

022200 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
023800 999-CATREAD-EXIT.
023900     EXIT.
