000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.     SEDIQUES.
000400 AUTHOR.         ABID H. KHATRI/JIM COFFMAN (MAINTAINER).
000500 DATE-WRITTEN.   AUG 30, 1990.
000600 DATE-COMPILED.
000700 INSTALLATION.   THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
000800*REMARKS.
000900**************************************************************
001000*                                                            *
001100*C   SEDIQUES               EDI QUESTIONS SUBPROGRAM         *
001200*                                                            *
001300*C    THIS PROGRAM IS USED TO GET THE EDI-INSTAL AND         *
      *C    EDI-SEND-BLKTS KEYS. THESE TWO VALUES ARE STORED       *
001400*C    IN THE MPLTINFO DATASET WITH 'EDI ' AS THE KEY.        *
001500*C    EDI-INSTAL IS USED TO DETERMINE WHETHER THE PLANT      *
      *C    IS USING EDI OR NOT. EDI-SEND-BLKTS IS THE FIELD       *
      *C    USED BY THE EDI ABSTRACT PROGRAMS TO DETERMINE IF      *
      *C    REQUIREMENT ORDERS ARE TO BE SENT ON AN EDI            *
      *C    TRANSMISSION.                                          *
      *C                                                           *
001600*C    THIS PROGRAM IS CALLED BY:                             *
001700*C                      1.  SPOMENU                          *
001800*C                                                           *
001900*C    THIS PROGRAM CALLS NONE.                               *
002000*C                                                           *
002100**************************************************************
002200
002300 ENVIRONMENT DIVISION.
002400 CONFIGURATION SECTION.
002500 SOURCE-COMPUTER.  AS400.
002600 OBJECT-COMPUTER.  AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZPLTSTUP-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

            SELECT MPLTINFO-PK-O
                ASSIGN TO DATABASE-MCFLCS0501
                ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                FILE STATUS IS FILE-STATUS.
002700
002800 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                   PIC X(2000).

       FD  MPLTINFO-PK-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-PK-REC-O.
           COPY DDS-MCRPCS0500 OF MCFLCS0501.
002900
003000 WORKING-STORAGE SECTION.
003200 77  HANDLE-BLOWUP-FLAG           PIC X(1)  VALUE "Y".
003300 77  PASSED-SPOOL-PRT             PIC S9(2) COMP VALUE 0.
003400 01  DE-FIELDS-1.
003500     05  WS-EDI-INSTAL            PIC X(1).
           05  WS-EDI-SEND-BLKTS        PIC X(1).
003600     05  DE-COMMAND-LINE-1        PIC X(79).
           05  DE-ERRLINE-1             PIC X(79).
       01  DISPLAY-STATUS               PIC XX.
       01  FILE-STATUS                  PIC XX.
003700*************************************************************
003800*************************************************************
003900**                                                         **
004000**              D A T A    B A S E    A R E A              **
004100**                                                         **
004200*************************************************************
004300*************************************************************
004400
004500 COPY MPLTINFO   IN COPYLIB.
004600
004700 01  DSET-NAMES.
004800     05  DSET-NAME                PIC X(16)  VALUE SPACES.
004900     05  DSET-MPLTINFO            PIC X(16)  VALUE "MPLTINFO;".
005000
005100 01  ARG-VALUES.
005200     05  MPLTINFO-ARG             PIC X(4)   VALUE SPACES.
005300     05  PLT-ARG                  PIC X(4)   VALUE SPACES.
005400
005500 01  SEARCH-ITEMS.
005600     05 ALL-ITEMS                 PIC X(2)  VALUE "@;".
005700     05 MPLTINFO-SEARCH-ITEM      PIC X(16) VALUE "PLTINFO-KEY;".
005800
005900 01  DB-LOG-VALUES.
006000     05  DB-LOG-TEXT              PIC X(8)  VALUE "SEDIQUES".
006100     05  DB-LOG-TEXT-LEN          PIC S9(4) COMP  VALUE -8.
006200
006300 01  MESSAGE-BUFLEN               PIC S9(4) COMP VALUE 78.
006400 01  MSG-ACTUALEN                 PIC S9(4) COMP VALUE 78.
006500 01  FIELD-NUMBER                 PIC S9(4) COMP VALUE 1.
006600
006700 01  MESSAGE-BUFFER.
006800     05  MSG-TEXT                 PIC X(66)  VALUE SPACES.
006900     05  MSG-FLD                  PIC X(12)  VALUE SPACES.
007000
006700 01  MESSAGE-BUFFER-1.
006800     05  MSG-TEXT-1               PIC X(66)  VALUE SPACES.
           05  MSG-FLD-1                PIC X(12)  VALUE SPACES.
007000
007100 COPY DBMODES    IN COPYLIB.
007200
007300 COPY DBSTAT     IN COPYLIB.
007400
007500 COPY MULTLOCK   IN COPYLIB.
007600
007700*************************************************************
007800*************************************************************
007900**                                                         **
008000**                 TERMINAL I/O DATA AREA                  **
008100**                                                         **
008200*************************************************************
008300*************************************************************
008400
008500 COPY FUNCTDEF   OF COPYLIB.
008600
008700*************************************************************
008800*************************************************************
008900**                                                         **
009000**                 COMMUNICATIONS AREAS                    **
009100**                                                         **
009200*************************************************************
009300*************************************************************
       COPY CATREAD    OF COPYLIB.

       COPY IOFEEDBACK OF COPYLIB.
009400
009500 COPY TSHWRDFM   OF COPYLIB.
009600
009700***** NOTE THAT "TSCRPRT2" ALSO USES PASSED-SPOOL-PRT, *****
009800***** AND VIEW-COMAREA AS PARAMETERS IN ADDITION TO    *****
009900***** THOSE LISTED BELOW.                              *****
010000
010100 01  TSCRPRT2-PARAMETERS.
010200     05  TSCRPRT2-PRINTCNTL        PIC S9(4) COMP VALUE 0.
010300     05  TSCRPRT2-PAGECNTL         PIC S9(4) COMP VALUE 49.
010400     05  TSCRPRT2-SPOOLSW          PIC X(1)  VALUE "N".
010500
010600 01  TSCRPRT2-ERROR-SW             PIC X(1)  VALUE "N".
010700
010800 01  TSCRPRT2-DISPLAY-AREA.
010900     05     FILLER                 PIC X(2).
011000     05  TSCRPRT2-MSG              PIC X(27).
011100     05     FILLER                 PIC X(2).
011200     05  TSCRPRT2-STAT             PIC S9(4).
011300     05     FILLER                 PIC X(2).
011400     05  TSCRPRT2-FLD              PIC X(14).
011500     05     FILLER                 PIC X(2).
011600
011700 COPY TBLOWUP    IN COPYLIB.
011800
       COPY WSCONTROL  IN COPYLIB.
011900*************************************************************
012000*************************************************************
012100**                                                         **
012200**               LINKAGE   SECTION                         **
012300**                                                         **
012400*************************************************************
012500*************************************************************
012600
012700 LINKAGE SECTION.
012800
012900 01  BASE                          PIC X(10).
013000
013100 COPY VCOMLINK   IN COPYLIB.
013200
013300 COPY LANGSUB    IN COPYLIB.
013400
013500
013600*************************************************************
013700**#########################################################**
013800*************************************************************
013900**                                                         **
014000**          P R O C E D U R E    D I V I S I O N           **
014100**                                                         **
014200*************************************************************
014300**#########################################################**
014400*************************************************************
014500
014600 PROCEDURE DIVISION USING BASE,
014700                          VIEW-COMAREA,
014800                          LANGUAGE-PARMS.
014900
015000 0-SCURCODE-SEC SECTION 1.
015100
015200 0-BEGIN-HERE.
015300     PERFORM 1-HSK.
015400     PERFORM 6-MAIN THRU 6-MAIN-X.
           CLOSE DISPLAY-FILE, MPLTINFO-PK-O.
015500     GOBACK.
015600
015700 1-HSK.
015800     MOVE "SEDIQUES" TO BU-PGM-NAME.
015900     OPEN I-O DISPLAY-FILE, MPLTINFO-PK-O.
016000     MOVE SPACES             TO  BUF-MPLTINFO.
016100     MOVE "EDI "             TO  MPLTINFO-ARG, PLT-ARG.
016200     PERFORM  9999-GETKEY-MPLTINFO-PK-O.
016300     IF  COND-WORD = 0
               PERFORM 1-SET-EDI-SWITCHES
016800     ELSE
016900     MOVE PLT-ARG            TO  MPLTINFO-KEY
017000     MOVE "N"                TO  EDI-INSTAL
                                       EDI-SEND-BLKTS
017100     MOVE DSET-MPLTINFO      TO  DSET-NAME
017200     PERFORM 9999-DSET-LOCK
017300     PERFORM 9999-PUT-MPLTINFO-PK-O
017400     PERFORM 9999-UNLOCK.
017500
017600     MOVE SPACES             TO  BUF-MPLTINFO.
017700     MOVE "PEDI"             TO  MPLTINFO-ARG, PLT-ARG.
017800     PERFORM  9999-GETKEY-MPLTINFO-PK-O.
017900     IF  COND-WORD = 0
018000         NEXT SENTENCE
018100     ELSE
018200     MOVE PLT-ARG            TO  MPLTINFO-KEY
018300     MOVE ZEROES             TO  MPLTINFO-LOG-BATCH-NO
018400     MOVE DSET-MPLTINFO      TO  DSET-NAME
018500     PERFORM 9999-DSET-LOCK
018600     PERFORM 9999-PUT-MPLTINFO-PK-O
018700     PERFORM 9999-UNLOCK.
018800
       1-SET-EDI-SWITCHES.
016400     IF  EDI-INSTAL = "Y"
016500         MOVE  "Y"           TO  WS-EDI-INSTAL
016600     ELSE
016700     MOVE  "N"               TO  WS-EDI-INSTAL.

016400     IF  EDI-SEND-BLKTS = "Y"
016500         MOVE  "Y"           TO  WS-EDI-SEND-BLKTS
016600     ELSE
016700     MOVE  "N"               TO  WS-EDI-SEND-BLKTS.

018900******************************************************
019000**                 BLOWUP ROUTINE                   **
019100******************************************************
019200
019300 2100-BLOWUP.
019400     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
019500           VIEW-COMAREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
019600           BU-DISPLAY-AREA.
019700
019800
019900**************************************************
020000*                                                *
020100*                  6 - M A I N                   *
020200*                                                *
020300**************************************************
020400 6-MAIN.
020500     MOVE "EDIQUES" TO VIEW-NFNAME.
020600     PERFORM 9999-GETNEXTFORM.
020700*** INPUT DATA ABOVE AND THEN PRESS ENTER
020800     MOVE 9                  TO LANG-SETNUM.
020900     MOVE 20                 TO LANG-MSGNUM.
021000     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
021100     MOVE MESSAGE-BUFFER     TO DE-COMMAND-LINE-1.
021200     MOVE SPACES             TO MESSAGE-BUFFER.
021300     PERFORM 9999-PUTWINDOW.
021400     MOVE 8                  TO SRF-KEYSET.
021500     MOVE "I"                TO SRF-FKEY(7).
021600     PERFORM 9999-PUTBUFFER-1.
021700     PERFORM 9999-DO-SCREEN-1.
021800     PERFORM 9999-GETBUFFER-1.
021900
022000     IF VIEW-LASTKEY = ENTER-KEY
022100        PERFORM UPDATE-EDI-KEY THRU UPDATE-EDI-KEY-X.
022200
022300 6-MAIN-X.
022400     EXIT.
022500
022600 UPDATE-EDI-KEY.
022700     MOVE DSET-MPLTINFO      TO  DSET-NAME.
022800     PERFORM 9999-DSET-LOCK.
023000     MOVE "EDI "             TO  MPLTINFO-ARG, PLT-ARG.
023100     PERFORM  9999-GETKEY-MPLTINFO-PK-O.
023300     MOVE WS-EDI-INSTAL      TO EDI-INSTAL.
           MOVE WS-EDI-SEND-BLKTS  TO EDI-SEND-BLKTS.
023500     PERFORM 9999-UPDATE-MPLTINFO-PK-O.
023700     PERFORM 9999-UNLOCK.
023900 UPDATE-EDI-KEY-X.
024000     EXIT.
024100
024300 999-CATREAD.
024400     MOVE SPACES             TO MESSAGE-BUFFER.
024500     CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
025900
026000 999-CATREAD-EXIT.
026100     EXIT.
026200
       9999-GETKEY-MPLTINFO-PK-O.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-O.
           READ MPLTINFO-PK-O INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MPLTINFO-PK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-RESET-MPLTINFO-PK-O.
           MOVE HIGH-VALUES TO PLTINFOKEY OF MPLTINFO-PK-REC-O.
           START MPLTINFO-PK-O KEY > PLTINFOKEY OF MPLTINFO-PK-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-PUT-MPLTINFO-PK-O.
           MOVE 0 TO COND-WORD.
           WRITE MPLTINFO-PK-REC-O FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-MPLTINFO-PK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

026500 COPY MLOCKCAL IN COPYLIB.
026600 COPY UNLOCK   IN COPYLIB.
026700 COPY DLOCKCAL IN COPYLIB.
026800 COPY SCRNCALL IN COPYLIB.
026900 COPY SCRNCL1  IN COPYLIB.
       9999-UPDATE-MPLTINFO-PK-O.
           MOVE 0 TO COND-WORD.
           REWRITE MPLTINFO-PK-REC-O FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "UPDATE ERR 9999-UPDATE-MPLTINFO-PK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

