000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.     SEDIABST.
000400 DATE-WRITTEN.   13 MAY 1991.
000500 DATE-COMPILED.
000600 INSTALLATION.   THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
000700*REMARKS.
000800**************************************************************
000900*                                                            *
001000*     SEDIABST   EXECUTIVE PROGRAM FOR ABSTRACTING EDI DATA  *
001100*                                                            *
001200*     SELECTION CRITERIA BASED ON PO-NUMBER,                 *
001300*                                 BATCH-NUMBER.              *
001400*                                                            *
001500*     THIS PROGRAM ACCEPTS SELECTION CRITERIA,               *
001600*     ABSTRACTS RELATED DATA FROM DATA SETS AND CREATES A    *
001700*     FLAT FILE THAT IS TO BE TRANSMITTED VIA RJE. THERE     *
001800*     ARE SEVERAL RECORD FORMATS AS WELL AS HEADER AND       *
001900*     TRAILER RECORDS PER PO AND BATCH WRITTEN TO THIS FILE. *
002000*                                                            *
002100**************************************************************
      *C
      *C MAY 26, 1998    CA YODER
      *C    CHANGED "222" TO BE A STAND-ALONE ORDER (SA) AND
      *C    "225" TO BE A REPAIR ORDER (RR).
      *C
      *C 06/17/1998   CA YODER
      *C    ADDED THE FOLLOWING SUB-TRANSACTIONS TO THE 850:
      *C       04=CHANGE/MODIFY
      *C
      *C  06/02/99   CA YODER   (DECATUR REQUEST)
      *C    EXPANDED TAX RATE PERCENTAGE FROM 2 DECIMAL
      *C    PLACES TO 4.
      *C
      *C  04/24/00   JE COFFMAN
      *C    ADDED SAME CHANGES THAT WERE MADE TO TEDIABST TO
      *C    PREVENT THE PLANTS FROM SENDING A PURCHASE ORDER
      *C    THAT DOES NOT HAVE ANY ITEM SEGMENTS. EDI SUPPORT
      *C    HAS REPORTED THIS SEVERAL TIMES AND EACH TIME I
      *C    FIND A HEADER RECORD BUT NO ITEM SEGMENT AT THE
      *C    PLANT.
      *C
002200
002300 ENVIRONMENT DIVISION.
002400 CONFIGURATION SECTION.
002500 SOURCE-COMPUTER.  HP3000.
002600 OBJECT-COMPUTER.  HP3000.
002700 SPECIAL-NAMES. C01 IS NEW-PAGE.
002800 INPUT-OUTPUT SECTION.
002900 FILE-CONTROL.
003000     SELECT EDI-ERROR-FILE
               ASSIGN TO DISK-EDIERRFL.
      *        ASSIGN TO "EDIERRFL,,,DISC".
003100*
003200     SELECT EDI-REPORT-FILE
               ASSIGN TO DISK-EDIRPTFL.
      *        ASSIGN TO "EDIRPTFL,,,DISC".
003300*
003400     SELECT EDI-FILEABS
               ASSIGN TO DISK-EDIABST.
      *        ASSIGN TO "EDIABST,,,DISC".
003500*
           SELECT DCOMMENT-MC-I
               ASSIGN TO DATABASE-MCFLCS1901
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

003700
           SELECT DPODATAITM-PO-I
               ASSIGN TO DATABASE-MCFLCS1101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

003900
           SELECT DPOITEM-PO-I
               ASSIGN TO DATABASE-MCFLCS1002
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

004100
           SELECT DPORECD-PO-O
               ASSIGN TO DATABASE-MCFLCS0901
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

004300
           SELECT DEDILOG-LK-O
               ASSIGN TO DATABASE-MCFLCS4802
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

004500
           SELECT MBUYER-BY-I
               ASSIGN TO DATABASE-MCFLCS0601
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

004700
           SELECT DVENDOR-VN-I
               ASSIGN TO DATABASE-MCFLCS0701
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

004900
           SELECT MCOMMENT-MC-I
               ASSIGN TO DATABASE-MCFLCS1801
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

005100
           SELECT MPLTINFO-PK-I
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

005300
           SELECT MPLTINFO-PK-O
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

005500
           SELECT MTAX-TX-I
               ASSIGN TO DATABASE-MCFLCS3701
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.


           SELECT MVALIDUM-UM-I
               ASSIGN TO DATABASE-MCFLCS0401
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

005700
005800*    SELECT OUT-FILE  ASSIGN TO "EDIPORPT,,,DISC"
           SELECT OUT-FILE
               ASSIGN TO DATABASE-EDIPORPT
               ORGANIZATION IS RELATIVE
005900         ACCESS IS RANDOM
006000         RELATIVE KEY IS ACT-KEY
               FILE STATUS IS FILE-STATUS.
006100
006200     SELECT PRINT-REPORT-FILE
               ASSIGN TO PRINTER-QPRINT.
006300*        ASSIGN TO "PRNT1,UR,A,LP(CCTL)".
006400*
006500     SELECT SORT-FILE
               ASSIGN TO DISK-SORTFILE.
      *        ASSIGN TO "SORT,DA,,,22000".
006600*
006700     SELECT SPOOL-ERROR-FILE
               ASSIGN TO PRINTER-QPRINT.
006800*        ASSIGN TO "PRNT2,UR,A,LP(CCTL)".
006900*        ASSIGN TO "SXXXXXXX,DA,A,DISC(CCTL),1024".
007000
007100 DATA DIVISION.
007200 FILE SECTION.
007300 FD  DCOMMENT-MC-I
007400     LABEL RECORDS ARE STANDARD.
007500 01  DCOMMENT-MC-REC-I.
007600     COPY DDS-MCRPCS1900 OF MCFLCS1901.
007700
007800 FD  DEDILOG-LK-O
007900     LABEL RECORDS ARE STANDARD.
008000 01  DEDILOG-LK-REC-O.
008100     COPY DDS-MCRPCS4800 OF MCFLCS4802.
008200
008300 FD  DPODATAITM-PO-I
008400     LABEL RECORDS ARE STANDARD.
008500 01  DPODATAITM-PO-REC-I.
008600     COPY DDS-MCRPCS1100 OF MCFLCS1101.
008700
008800 FD  DPOITEM-PO-I
008900     LABEL RECORDS ARE STANDARD.
009000 01  DPOITEM-PO-REC-I.
009100     COPY DDS-MCRPCS1000 OF MCFLCS1002.
009200
009300 FD  DPORECD-PO-O
009400     LABEL RECORDS ARE STANDARD.
009500 01  DPORECD-PO-REC-O.
009600     COPY DDS-MCRPCS0900 OF MCFLCS0901.
009700
009800 FD  DVENDOR-VN-I
009900     LABEL RECORDS ARE STANDARD.
010000 01  DVENDOR-VN-REC-I.
010100     COPY DDS-MCRPCS0700 OF MCFLCS0701.
010200
010300 FD  EDI-ERROR-FILE
010400     LABEL RECORDS ARE OMITTED
010500     RECORD CONTAINS 133 CHARACTERS
010600     DATA RECORD IS EDI-ERR-REC.
010700 01  EDI-ERR-REC.
010800     05  CTL-E                     PIC X.
010900     05  EDI-ERROR-LINE.
011000         10  CONTROL-DATE-E        PIC X(6).
011100         10  FILLER                PIC X(126).
011200
011300 FD  EDI-FILEABS
011400     LABEL RECORDS ARE STANDARD
011500     RECORD CONTAINS 160 CHARACTERS.
011600 01  EDI-RECORD.
011700     05  FILLER                    PIC X(160).
011800
011900 FD  EDI-REPORT-FILE
012000     LABEL RECORDS ARE OMITTED
012100     RECORD CONTAINS 133 CHARACTERS
012200     DATA RECORD IS EDI-REP-REC.
012300 01  EDI-REP-REC.
012400     05  CTL                       PIC X.
012500     05  EDI-REPORT-LINE.
012600         10  CONTROL-DATE          PIC X(6).
012700         10  FILLER                PIC X(126).
012800
012900 FD  MBUYER-BY-I
013000     LABEL RECORDS ARE STANDARD.
013100 01  MBUYER-BY-REC-I.
013200     COPY DDS-MCRPCS0600 OF MCFLCS0601.
013300
013400 FD  MCOMMENT-MC-I
013500     LABEL RECORDS ARE STANDARD.
013600 01  MCOMMENT-MC-REC-I.
013700     COPY DDS-MCRPCS1800 OF MCFLCS1801.
013800
013900 FD  MPLTINFO-PK-I
014000     LABEL RECORDS ARE STANDARD.
014100 01  MPLTINFO-PK-REC-I.
014200     COPY DDS-MCRPCS0500 OF MCFLCS0501.
014300
014400 FD  MPLTINFO-PK-O
014500     LABEL RECORDS ARE STANDARD.
014600 01  MPLTINFO-PK-REC-O.
014700     COPY DDS-MCRPCS0500 OF MCFLCS0501.
014800
       FD  MTAX-TX-I
           LABEL RECORDS ARE STANDARD.
       01  MTAX-TX-REC-I.
           COPY DDS-MCRPCS3700 OF MCFLCS3701.

014900 FD  MVALIDUM-UM-I
015000     LABEL RECORDS ARE STANDARD.
015100 01  MVALIDUM-UM-REC-I.
015200     COPY DDS-MCRPCS0400 OF MCFLCS0401.
015300
015400 FD  OUT-FILE
015500     LABEL RECORDS ARE OMITTED
015600     RECORD CONTAINS 80 CHARACTERS
015700     DATA RECORD IS OUTF.
015800 01  OUTF.
015900     05  OUT-BUYER                 PIC X(15).
016000     05  OUT-PO                    PIC X(14).
016100     05  OUT-BGTAMT                PIC 9(11).
016200     05  OUT-BGTNO                 PIC X(12).
016300     05  OUT-VENDOR                PIC X(10).
016400     05  OUT-PODATE                PIC X(6).
           05  OUT-FUNCTION              PIC X(2).
           05  FILLER                    PIC X(10).
016500**** 05  FILLER                    PIC X(12).
016600
016700 FD  PRINT-REPORT-FILE
016800     LABEL RECORD IS OMITTED
016900     RECORD CONTAINS 132 CHARACTERS.
017000 01  PRINT-RECORD.
017100     05  C-CTL                  PIC X.
017200     05  PRINT-AREA             PIC X(131).
017300
017400 SD  SORT-FILE
017500     RECORD CONTAINS 80 CHARACTERS
017600     DATA RECORD IS SORTF.
017700 01  SORTF.
017800     05  SORT-KEY.
017900         10  SORT-BUYER            PIC X(15).
018000         10  SORT-PO               PIC X(14).
018100     05  SORT-BGTAMT               PIC 9(11).
018200     05  SORT-BGTNO                PIC X(12).
018300     05  SORT-VENDOR               PIC X(10).
018400     05  SORT-PODATE               PIC X(6).
           05  SORT-FUNCTION             PIC X(2).
           05  FILLER                    PIC X(10).
018500**** 05  FILLER                    PIC X(12).
018600
018700 FD  SPOOL-ERROR-FILE
018800     LABEL RECORD IS OMITTED
018900     RECORD CONTAINS 80 CHARACTERS.
019000 01  SPOOL-RECORD               PIC X(80).
019100
019200 WORKING-STORAGE SECTION.
       77  BATCH-SW                      PIC 9.
019300 77  NO-SEND-SW                    PIC 9.
019400 77  LINE-CTR                      PIC 99.
      *77  MTAX-TOTAL                    PIC S9(3)V9(2).
       77  MTAX-TOTAL                    PIC S9(3)V9(4).
019500 77  REL-RECS-CTR                  PIC 9(5).
019600 77  OPEN-RPT1-SW                  PIC 9.
       77  SAVE-COMPANY                  PIC X(3).
019700 77  SAVE-ITEM-TAX-CODE            PIC XX.
019800 77  SUB                           PIC 99.
019900 77  TAB-SUB                       PIC S9(4) COMP-4.
       77  TAX-SWITCH                    PIC 9.
       77  HOLD-SUB-TRANS                PIC XX.
020000
020100 01  ACT-KEY                       PIC 9(9).
020200
020300 01  BUF-MPLTINFO-SAVE.
020400     05  MPLTINFO-KEY-S            PIC X(4).
020500     05  MPLTINFO-LOG-REC-NO-S     PIC 9(8).
020600     05  MPLTINFO-LOG-BATCH-NO-S   PIC 9(8).
020700     05  FILLER                    PIC X(44).
020800
020900 01  BUILD-COMMENT-NO.
021000     05  BUILD-COM-PREFIX          PIC X     VALUE "C".
021100     05  BUILD-COM-NO              PIC X(3)  VALUE SPACES.
021200
021300 01  CENTURY-DATE.
021400     05  WS-CENTURY                PIC XX.
021500     05  WS-DATE.
021600         10  WS-YY                 PIC 99.
021700         10  WS-MM                 PIC 99.
021800         10  WS-DD                 PIC 99.
021900
       01  ZBILL-PO-SW                   PIC X       VALUE SPACE.
           88  ZBILL-PO                              VALUE "1".

       01  PO-ARRAY.
           05  PO-ARR OCCURS 7 TIMES INDEXED BY P-INDEX.
               10  PO-CHAR               PIC X.

       01  SAVE-EDI-FLAGS.
           05  SAVE-NEW                  PIC X.
           05  SAVE-CHANGE               PIC X.
           05  SAVE-REPAIR               PIC X.
           05  SAVE-CONFIRM              PIC X.
           05  SAVE-FOLLOWUP             PIC X.

022000 01  COMMENT-ARG                   PIC X(4).
022100 01  COM-SEARCH    PIC X(16) VALUE "MCOM-COMMENT-NO;".
022200
022300 COPY CCRTFILE IN COPYLIB.
022400
022500 COPY CCHKOBJ IN COPYLIB.
022600
022700 COPY CCHKOBJM IN COPYLIB.
022800
022900 01  OVRDBF-PARM1  PIC X(80) VALUE SPACES.
023000 01  OVRDBF-PARM2  PIC S9(10)V9(5) COMP-3 VALUE 80.
023100
023200 01  DETAIL-1.
023300     05  FILLER                    PIC X(9).
023400     05  DET-UL-1                  PIC X(10).
023500     05  FILLER                    PIC X(4).
023600     05  DET-BUYER-1               PIC X(15).
023700     05  FILLER                    PIC X(4).
023800     05  DET-PO-1                  PIC X(14).
023900     05  FILLER                    PIC X(4).
024000     05  DET-BGT-AMT-1             PIC 9(11).
024100     05  FILLER                    PIC X(4).
024200     05  DET-BGT-NUMBER            PIC X(12).
024300     05  FILLER                    PIC X(4).
024400     05  DET-VEN-CODE-1            PIC X(10).
024500     05  FILLER                    PIC X(4).
024600     05  DET-PO-DATE-1             PIC X(6).
           05  FILLER                    PIC X(4).
           05  DET-FUNCTION              PIC X(8).
           05  FILLER                    PIC X(9).
024700**** 05  FILLER                    PIC X(15).
024800
024900 01  DETAIL-X.
025000     05  FILLER                    PIC X(10).
025100     05  DET-PO                    PIC X(14).
025200     05  FILLER                    PIC X(04).
025300     05  DET-REASON                PIC X(52).
025400
025500 01  FILE-STATUS.
025600     05  FILE-STATUS-1             PIC X     VALUE "0".
025700     05  FILE-STATUS-2             PIC X     VALUE "0".
025800
025900 01  HANDLE-BLOWUP-FLAG            PIC X(1)  VALUE "Y".
026000
026100 01  HEADER-1.
026200     05  FILLER                    PIC X(29) VALUE SPACES.
026300     05  FILLER                    PIC X(34)
026400          VALUE "THE FOLLOWING PURCHASE ORDERS ARE ".
026500     05  FILLER                    PIC X(36)
026600          VALUE "TO BE RE-TRANSMITTED VIA EDI BATCH# ".
           05  H-1-BATCH                 PIC Z(8).
026700     05  FILLER                    PIC X(26) VALUE SPACES.
026800
026900 01  HEADER-2.
027000     05  FILLER                    PIC X(28) VALUE SPACES.
027100     05  FILLER                    PIC X(05) VALUE "BUYER".
027200     05  FILLER                    PIC X(10) VALUE SPACES.
027300     05  FILLER                    PIC X(11) VALUE "P.O. NUMBER".
027400     05  FILLER                    PIC X(07) VALUE SPACES.
027500     05  FILLER                    PIC X(10) VALUE "BUDGET AMT".
027600     05  FILLER                    PIC X(06) VALUE SPACES.
027700     05  FILLER                    PIC X(09) VALUE "BUDGET NO".
027800     05  FILLER                    PIC X(07) VALUE SPACES.
027900     05  FILLER                    PIC X(06) VALUE "VENDOR".
028000     05  FILLER                    PIC X(06) VALUE SPACES.
028100     05  FILLER                    PIC X(06) VALUE "PODATE".
           05  FILLER                    PIC X(04) VALUE SPACES.
           05  FILLER                    PIC X(08) VALUE "FUNCTION".
           05  FILLER                    PIC X(09) VALUE SPACES.
028200**** 05  FILLER                    PIC X(15) VALUE SPACES.
028300
028400 01  HEADER-X.
028500     05  FILLER                    PIC X(11) VALUE SPACES.
028600     05  FILLER                    PIC X(35)
028700          VALUE "THE FOLLOWING PURCHASE ORDERS WERE ".
028800     05  FILLER                    PIC X(24)
028900          VALUE "NOT TRANSMITTED VIA EDI ".
029000     05  FILLER                    PIC X(10) VALUE SPACES.
029100
029200 01  OPTION-SELECTION              PIC X(1)  VALUE SPACES.
029300     88 OPTION-SELECTED                      VALUE "Y".
029400
029500 COPY OVRPFDATA IN COPYLIB.
029600
029700 01  PASSED-SPOOL-PRT              PIC S9(2) COMP-4 VALUE 0.
029800
029900 01  PO-STD-INSTRUCTIONS.
030000     05  PO-STD-INST-1             PIC X(3)  VALUE SPACES.
030100     05  PO-STD-INST-2-7           PIC X(18) VALUE SPACES.
030200 01  PO-STD-INST-TABLE  REDEFINES  PO-STD-INSTRUCTIONS.
030300     05  PO-STD-INST  OCCURS 7 TIMES   PIC X(3).
030400
030500 01  RECORD-TABLE.
030600     05  RECORD-ENTRY OCCURS 200 TIMES.
030700         10  R-E                   PIC 9(8).
030800
030900 01  RET-CODE                      PIC XX    VALUE SPACES.
031000
031100 01  STAR-80                       PIC X(80) VALUE ALL "*".
031200 01  STAR-132                      PIC X(132) VALUE ALL "*".
031300
031400 01  STD-INST-SAVED.
031500     05  SAVE-STD-INST-BEFORE      PIC X(18).
031600     05  SAVE-STD-INST-AFTER       PIC X(18).
031700     05  SAVE-CONFIRM-FLAG         PIC X.
031800     05  SAVE-CONFIRM-VERBAGE      PIC X(34).

       01  TAX-ARG                       PIC X(4).
031900
       01  UM-ARG                        PIC XX.

032000 01  WS-PLTINFO-ARG.
032100     05  FILLER                    PIC XX    VALUE "TM".
032200     05  WS-PO-TERMS               PIC XX.
032300
032400 01  WS-ERROR-FLAG                 PIC X(1)  VALUE SPACES.
032500     88 NO-ERRORS                             VALUE " ".
032600
032700 01  WS-PO-FORMAT.
032800     05 FILLER                     PIC X(1)  VALUE "P".
032900     05 WS-PO-NUMBER               PIC X(7)  VALUE SPACES.
033000     05 WS-PO-REL                  PIC X(3)  VALUE SPACES.
033100     05 FILLER                     PIC X(3)  VALUE "000".
033200
033300*************************************************************
033400*************************************************************
033500**                                                         **
033600**              D A T A    B A S E    A R E A              **
033700**                                                         **
033800*************************************************************
033900*************************************************************
034000
034100 COPY DBMODES  IN COPYLIB.
034200
034300 COPY DBSTAT   IN COPYLIB.
034400
034500 COPY DATAB3   IN COPYLIB.
034600
034700 COPY MULTLOCK IN COPYLIB.
034800
034900 COPY DCOMMENT IN COPYLIB.
035000
035100 COPY DEDILOG  IN COPYLIB.
035200
035300 COPY DPODATA  IN COPYLIB.
035400
035500 COPY DPOITEM  IN COPYLIB.
035600
035700 COPY DPORECD  IN COPYLIB.
035800
035900 COPY DVENDOR  IN COPYLIB.
036000
036100 COPY MBUYER   IN COPYLIB.
036200
036300 COPY MCOMMENT IN COPYLIB.
036400
036500 COPY MPLTINFO IN COPYLIB.
036600
036700 COPY MPORCV   IN COPYLIB.
036800
036900 COPY MSTORERM IN COPYLIB.
037000
       COPY MTAX     IN COPYLIB.

037100 COPY MVALIDUM IN COPYLIB.
037200
037300 COPY EREC000  IN COPYLIB.
037400
037500 COPY EREC010  IN COPYLIB.
037600
037700 COPY EREC011  IN COPYLIB.
037800
037900 COPY EREC012  IN COPYLIB.
038000
038100 COPY EREC014  IN COPYLIB.
038200
038300 COPY EREC015  IN COPYLIB.
038400
038500 COPY EREC020  IN COPYLIB.
038600
038700 COPY EREC021  IN COPYLIB.
038800
038900 COPY EREC023  IN COPYLIB.
039000
039100 COPY EREC090  IN COPYLIB.
039200
039300 COPY EREC999  IN COPYLIB.
039400
039500 COPY IOFEEDBACK IN COPYLIB.
039600
039700********************************************
039800*                                          *
039900*  DATE/TIME AREAS                         *
040000*                                          *
040100********************************************
040200
040300 01  TODAY-DATE-WITH-CENTURY.
040400     05  TODAY-CENTURY.
040500         10  T-C                   PIC X(2)   VALUE "20".
040600     05  TODAY-DATE.
040700         10  YY                    PIC X(2)   VALUE SPACES.
040800         10  MM                    PIC X(2)   VALUE SPACES.
040900         10  DD                    PIC X(2)   VALUE SPACES.
041000
041100 01  TODAY-TIME                    PIC X(6)   VALUE SPACES.
041200
041300 COPY TBLOWUP  IN COPYLIB.
041400
041500 COPY TDATECHK IN COPYLIB.
041600
041700 COPY VCOMLINK IN COPYLIB.
041800
041900 COPY CDESC    IN COPYLIB.
042000*****************************************
042100*   PARAMETERS FOR CALLING 'SEDIVNCK'
042200*   WHICH IS THE ROUTINE TO DETERMINE
042300*   IF VENDOR IS EDI OR NOT
042400*****************************************
042500
042600 COPY SEDIVNCK IN COPYLIB.
042900
       01  SUBMIT-PGM              PIC X(10).
       01  SUBMIT-PARM             PIC X(220).
       01  SUBMIT-JOB              PIC X(10).
       01  SUBMIT-JOBD             PIC X(10).
       01  SUBMIT-OUTQ             PIC X(10).
       01  SUBMIT-USER             PIC X(10).

043000 LINKAGE SECTION.
043100
043200 01  BASE                          PIC X(10).
043300
043400 01  PASSED-PARMS.
043500     05  PASSED-PO                 PIC X(14).
043600     05  PASSED-IND                PIC X.
043700     05  PASSED-BATCHNO            PIC 9(8).
           05  PASSED-BATCHNO-X REDEFINES PASSED-BATCHNO
                                         PIC X(8).
043800
043900 COPY LANGSUB  IN COPYLIB.
044000
044100*************************************************************
044200**#########################################################**
044300*************************************************************
044400**                                                         **
044500**          P R O C E D U R E    D I V I S I O N           **
044600**                                                         **
044700*************************************************************
044800**#########################################################**
044900*************************************************************
045000
045100 PROCEDURE DIVISION USING BASE, PASSED-PARMS, LANGUAGE-PARMS.
045200 START-PGM.
           OPEN INPUT DCOMMENT-MC-I.
           OPEN I-O DEDILOG-LK-O.
           OPEN INPUT DPODATAITM-PO-I.
           OPEN INPUT DPOITEM-PO-I.
           OPEN I-O DPORECD-PO-O.
           OPEN INPUT DVENDOR-VN-I.
047900***************************************************************
048000**   DO A CLEAR PHYSICAL FILE MEMBER ON EDIABST              **
      **   TO CLEAR IT FOR NEXT BATCH TRANSMISSION                 **
048500***************************************************************
048600     MOVE "CLRPFM FILE(*LIBL/EDIABST)" TO OVRDBF-PARM1.
048700     CALL "QCMDEXC" USING OVRDBF-PARM1, OVRDBF-PARM2.
048800     OPEN OUTPUT EDI-FILEABS.
      ***************************************************************
      **   CHECK FOR EXISTANCE OF THE CIRCULAR ERROR FILE 'EDIERRFL'*  '.
      **       IF NOT THERE, BUILD IT.                              *
      **      CALL CCRTFILE TO CREATE A TEMPORARY FILE 'EDIERRFL'   *
      ***************************************************************
           MOVE "*LIBL"       TO CCRTFILE-LIBRARY.
           MOVE "EDIERRFL"    TO CCRTFILE-FILE.
           MOVE "0133"        TO CCRTFILE-RECORD-LENGTH.
           MOVE "01000"       TO CCRTFILE-NO-RECORDS.
           MOVE "01000"       TO CCRTFILE-INCREMENT-AMT.
           MOVE "01"          TO CCRTFILE-NO-INCREMENTS.
           SET CIRCULAR-FILE TO TRUE.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               MOVE "CCRTFILE CREATE OF 'DPOERFIL' FAILED"
                  TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.
048900     OPEN EXTEND EDI-ERROR-FILE.
      ***************************************************************
      **   CHECK FOR EXISTANCE OF THE CIRCULAR ERROR FILE 'EDIRPTFL'*  '.
      **       IF NOT THERE, BUILD IT.                              *
      **      CALL CCRTFILE TO CREATE A TEMPORARY FILE 'EDIRPTFL'   *
      ***************************************************************
           MOVE "*LIBL"       TO CCRTFILE-LIBRARY.
           MOVE "EDIRPTFL"    TO CCRTFILE-FILE.
           MOVE "0133"        TO CCRTFILE-RECORD-LENGTH.
           MOVE "01000"       TO CCRTFILE-NO-RECORDS.
           MOVE "01000"       TO CCRTFILE-INCREMENT-AMT.
           MOVE "01"          TO CCRTFILE-NO-INCREMENTS.
           SET CIRCULAR-FILE TO TRUE.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
049000     OPEN EXTEND EDI-REPORT-FILE.
           OPEN INPUT MBUYER-BY-I.
           OPEN INPUT MCOMMENT-MC-I.
           OPEN INPUT MPLTINFO-PK-I.
           OPEN I-O MPLTINFO-PK-O.
           OPEN INPUT MTAX-TX-I.
           OPEN INPUT MVALIDUM-UM-I.
      ***************************************************************
      **      CALL CCRTFILE TO CREATE A TEMPORARY FILE 'EDIPORPT'   *
      ***************************************************************
           MOVE "*LIBL"       TO CCRTFILE-LIBRARY.
           MOVE "EDIPORPT"    TO CCRTFILE-FILE.
           MOVE "0080"        TO CCRTFILE-RECORD-LENGTH.
           MOVE "01000"       TO CCRTFILE-NO-RECORDS.
           MOVE "01000"       TO CCRTFILE-INCREMENT-AMT.
           MOVE "01"          TO CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
049600     OPEN OUTPUT OUT-FILE.
049700     OPEN OUTPUT PRINT-REPORT-FILE.
060400     MOVE DSET-MPLTINFO           TO DSET-NAME.
060500     MOVE "EPOR"                  TO MPLTINFO-ARG, PLT-ARG.
060900     PERFORM  9999-GETKEY-MPLTINFO-PK-O.
061000     MOVE BUF-MPLTINFO            TO BUF-MPLTINFO-SAVE.
061100     ADD  1                       TO MPLTINFO-LOG-BATCH-NO-S.
           IF PASSED-BATCHNO-X NOT = SPACES
               MOVE PASSED-BATCHNO      TO H-1-BATCH
           ELSE
           MOVE MPLTINFO-LOG-BATCH-NO-S TO H-1-BATCH.
049800     MOVE 0                       TO OPEN-RPT1-SW.
049900     MOVE 0                       TO TAB-SUB
050000                                     REL-RECS-CTR.
050100     MOVE "20"                    TO WS-CENTURY.
050200     MOVE SPACES                  TO RECORD-TABLE.
050300     MOVE 1                       TO DATE-MODE.
050400     CALL "TDATECHK" USING DATE-CHECK-AREA.
050500     MOVE DATE-YMD-OUT            TO WS-DATE
050600                                     TODAY-DATE.
050700     SORT SORT-FILE ON ASCENDING KEY SORT-KEY
050800         INPUT PROCEDURE  7-SORT-PODATA
050900         OUTPUT PROCEDURE 8-WRITE-POINFO.
051000*    MOVE A CONTROL DATE TO THE EDI REPORT FILE, SO THAT
051100*    "XPRTRPT" CAN RETRIEVE A RANGE OF DATES AND PRINT
051200     MOVE SPACES                  TO EDI-REP-REC.
051300     MOVE "*"                     TO CTL.
051400     MOVE TODAY-DATE              TO CONTROL-DATE.
051500     WRITE EDI-REP-REC.
051600     IF REL-RECS-CTR > 0
051700         NEXT SENTENCE
051800     ELSE
051900     MOVE "NO RECORDS SELECTED TO BE TRANSMITTED"
052000         TO PRINT-AREA EDI-REPORT-LINE
052100     WRITE PRINT-RECORD AFTER ADVANCING 1 LINES
052200     MOVE 1 TO CTL
052300     WRITE EDI-REP-REC
052400     GO TO 2-EOJ.
           CLOSE OUT-FILE.
           OPEN INPUT OUT-FILE.
052500     MOVE 1 TO ACT-KEY.
052600     MOVE 59 TO LINE-CTR.
052700 1-READ-OUTF-LOOP.
052800     IF ACT-KEY > REL-RECS-CTR GO TO 2-EOJ.
052900     READ OUT-FILE    INVALID KEY GO TO 2-EOJ.
053000     MOVE SPACES TO DETAIL-1.
053100     MOVE "__________"   TO DET-UL-1.
053200     MOVE OUT-BUYER      TO DET-BUYER-1.
053300     MOVE OUT-PO         TO DET-PO-1.
053400     MOVE OUT-BGTAMT     TO DET-BGT-AMT-1.
053500     MOVE OUT-BGTNO      TO DET-BGT-NUMBER.
053600     MOVE OUT-VENDOR     TO DET-VEN-CODE-1.
053700     MOVE OUT-PODATE     TO DET-PO-DATE-1.
           EVALUATE OUT-FUNCTION
               WHEN "00"
                   MOVE "NEW"       TO DET-FUNCTION
               WHEN "04"
                   MOVE "MODIFY"    TO DET-FUNCTION
               WHEN "05"
                   MOVE "REPLACE"   TO DET-FUNCTION
           END-EVALUATE.
053800     ADD 1 TO LINE-CTR.
053900     IF LINE-CTR > 59 PERFORM 10-WRITE-HEADERS.
054000     MOVE DETAIL-1       TO PRINT-AREA.
054100     WRITE PRINT-RECORD FROM DETAIL-1 AFTER ADVANCING 1.
054200     MOVE 1              TO CTL.
054300     MOVE DETAIL-1       TO EDI-REPORT-LINE.
054400     WRITE EDI-REP-REC.
054500     ADD 1               TO ACT-KEY.
054600     GO TO 1-READ-OUTF-LOOP.
054700
054800 10-WRITE-HEADERS.
054900     MOVE 0              TO LINE-CTR.
055000     WRITE PRINT-RECORD FROM HEADER-1 AFTER ADVANCING NEW-PAGE.
055100     MOVE SPACES TO PRINT-AREA.
055200     WRITE PRINT-RECORD AFTER ADVANCING 1.
055300     WRITE PRINT-RECORD FROM HEADER-2 AFTER ADVANCING 1.
055400     WRITE PRINT-RECORD FROM STAR-132 AFTER ADVANCING 1.
055500     MOVE 0              TO CTL.
055600     MOVE HEADER-1       TO EDI-REPORT-LINE.
055700     WRITE EDI-REP-REC.
055800     MOVE 1              TO CTL.
055900     MOVE SPACES         TO EDI-REPORT-LINE.
056000     WRITE EDI-REP-REC.
056100     MOVE 1              TO CTL.
056200     MOVE HEADER-2       TO EDI-REPORT-LINE.
056300     WRITE EDI-REP-REC.
056400     MOVE 1              TO CTL.
056500     MOVE STAR-132       TO EDI-REPORT-LINE.
056600     WRITE EDI-REP-REC.
056700     MOVE 4              TO LINE-CTR.
056800
056900 2-EOJ.
           CLOSE DCOMMENT-MC-I.
           CLOSE DEDILOG-LK-O.
           CLOSE DPODATAITM-PO-I.
           CLOSE DPOITEM-PO-I.
           CLOSE DPORECD-PO-O.
           CLOSE DVENDOR-VN-I.
057600     CLOSE EDI-ERROR-FILE.
057700     CLOSE EDI-FILEABS.
057800     CLOSE EDI-REPORT-FILE.
           CLOSE MBUYER-BY-I.
           CLOSE MCOMMENT-MC-I.
           CLOSE MPLTINFO-PK-I.
           CLOSE MPLTINFO-PK-O.
           CLOSE MTAX-TX-I.
           CLOSE MVALIDUM-UM-I.
058400     CLOSE OUT-FILE.
058500     IF OPEN-RPT1-SW > 0 CLOSE SPOOL-ERROR-FILE.
058600     CLOSE PRINT-REPORT-FILE.
058700     CALL "TFORMRJE".
      *    MOVE "CLSENDEDI"    TO  SUBMIT-PGM.
      *    MOVE SPACES         TO  SUBMIT-PARM.
      *    MOVE "SEDIABST"     TO  SUBMIT-JOB.
      *    MOVE "MCMGR"        TO  SUBMIT-JOBD.
      *    MOVE "*JOBD"        TO  SUBMIT-OUTQ.
      *    MOVE "*JOBD"        TO  SUBMIT-USER.
      *    CALL "CLSUBMIT" USING   SUBMIT-PGM
      *                            SUBMIT-PARM
      *                            SUBMIT-JOB
      *                            SUBMIT-JOBD
      *                            SUBMIT-OUTQ
      *                            SUBMIT-USER.
058800     GOBACK.
058900
059000******************************************************
059100**                 BLOWUP ROUTINE                   **
059200******************************************************
059300
059400 2100-BLOWUP.
059500     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
059600           VIEW-COMAREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
059700           BU-DISPLAY-AREA.
059800
059900
060000 7-SORT-PODATA.
           MOVE 0 TO BATCH-SW.
060100     PERFORM 7-SORT-DATA THRU 7-S-D-X.
060300 7-SORT-DATA.
           IF BATCH-SW = 0
               MOVE 1 TO BATCH-SW
061200         PERFORM 7000-CREATE-HEADER-RECORD.
061300     IF PASSED-PARMS = SPACES
061400         PERFORM 9999-BEGFIL-DEDILOG-LK-O
061500         PERFORM 70-READ-EDILOG-SERIAL THRU 70-RES-X
061600     ELSE
061700     IF PASSED-PO = SPACES
061800         PERFORM 9999-BEGFIL-DEDILOG-LK-O
061900         PERFORM 70-READ-EDILOG-SERIAL THRU 70-RES-X
062000     ELSE
062100     PERFORM  71-FIND-AND-GET-PO THRU 71-FAGP-X.
062200     PERFORM  7099-CREATE-TRAILER-RECORD.
062900*************************************************************
063000*    RE-READ "EPOR" RECORD OF MPLTINFO AND UPDATE DEDILOG
063100*    BY RETRIEVING EACH RECORD THAT WAS STORED IN THE TABLE
063200*    TO UPDATE BATCH NUMBER AND SEND FLAG AS WELL AS THE
063300*    DPORECD SEGMENT WITH THE INDICATOR THAT THE P.O. IS
063400*    AN EDI P.O.
063500*************************************************************
063600     IF TAB-SUB > 0
               IF PASSED-BATCHNO-X NOT = SPACES
                   NEXT SENTENCE
               ELSE
062300         MOVE DSET-MPLTINFO       TO DSET-NAME, DSET-NAME-1
062400         MOVE "EPOR"              TO MPLTINFO-ARG, PLT-ARG,
                                           LOCK-VALUE-1
               MOVE 1                   TO NUMBER-OF-DSETS-LOCKED
               PERFORM 9999-MULTI-LOCK
062500         PERFORM 9999-GETKEY-MPLTINFO-PK-O
061000         MOVE BUF-MPLTINFO        TO BUF-MPLTINFO-SAVE
061100         ADD  1                   TO MPLTINFO-LOG-BATCH-NO-S
062600         MOVE BUF-MPLTINFO-SAVE   TO BUF-MPLTINFO
062700         PERFORM  9999-UPDATE-MPLTINFO-PK-O
062800         PERFORM  9999-UNLOCK
063700         MOVE 0                   TO TAB-SUB
063800         MOVE DSET-DEDILOG        TO DSET-NAME
057100         CLOSE DEDILOG-LK-O
               OPEN I-O  DEDILOG-LK-O
061800         PERFORM 9999-BEGFIL-DEDILOG-LK-O
063900*        CALL "DBCLOSE" USING BASE, DSET-NAME, MODE3, STATUS-AREA
064000         PERFORM  72-UPDATE-DATA THRU 72-UD-EXIT.
064100 7-S-D-X.    EXIT.
064200
064300 70-READ-EDILOG-SERIAL.
064400     PERFORM 9999-GETSER-DEDILOG-LK-O.
064500     IF END-OF-FILE GO TO 70-RES-X.
           IF LOG-REL-NO = "999"
               MOVE "EDI "              TO PLT-ARG
               PERFORM 9999-GETKEY-MPLTINFO-PK-I
               IF GOOD-CALL
                   IF EDI-SEND-BLKTS = "Y"
                       NEXT SENTENCE
                   ELSE
071800             PERFORM 79-HEADER-ROUTINE
071900             MOVE SPACES          TO DETAIL-X
072000             MOVE LOG-KEY         TO DET-PO
072100             MOVE "BLANKET ORDER SEND FLAG NOT SET - NO SEND"
072200                                  TO DET-REASON
072300             WRITE SPOOL-RECORD FROM DETAIL-X AFTER ADVANCING 1
072400             MOVE 1 TO CTL-E
072500             MOVE DETAIL-X        TO EDI-ERROR-LINE
072600             WRITE EDI-ERR-REC
                   GO TO 70-READ-EDILOG-SERIAL
               ELSE
071800         PERFORM 79-HEADER-ROUTINE
071900         MOVE SPACES              TO DETAIL-X
072000         MOVE LOG-KEY             TO DET-PO
072100         MOVE "BLANKET ORDER SEND FLAG NOT SET - NO SEND"
072200                                  TO DET-REASON
072300         WRITE SPOOL-RECORD FROM DETAIL-X AFTER ADVANCING 1
072400         MOVE 1 TO CTL-E
072500         MOVE DETAIL-X            TO EDI-ERROR-LINE
072600         WRITE EDI-ERR-REC
               GO TO 70-READ-EDILOG-SERIAL.
064600     IF PASSED-BATCHNO NUMERIC
064700         IF PASSED-BATCHNO-X = LOG-BATCHNO-X
064800             NEXT SENTENCE
064900         ELSE
065000         GO TO 70-READ-EDILOG-SERIAL
065100     ELSE
065200     IF LOG-BATCHNO NUMERIC
065300         IF LOG-FLAG-SEND = " "
065400             NEXT SENTENCE
065500         ELSE
065600         GO TO 70-READ-EDILOG-SERIAL.
065700     MOVE LOG-KEY                 TO SEDIVNCK-PO-NUMBER.
065800     MOVE SPACES                  TO SEDIVNCK-VEN-CODE
065900                                     SEDIVNCK-EDI-IND.
066000     CALL "SEDIVNCK" USING BASE,
066100                           SEDIVNCK-PARMS.
066400     IF SEDIVNCK-EDI-IND = "Y"
066500         NEXT SENTENCE
066600     ELSE
066700     PERFORM 79-HEADER-ROUTINE
066800     MOVE SPACES                  TO DETAIL-X
066900     MOVE LOG-KEY                 TO DET-PO
067000     MOVE "VENDOR IS NO LONGER AN EDI VENDOR" TO DET-REASON
067100     WRITE SPOOL-RECORD FROM DETAIL-X AFTER ADVANCING 1
067200     MOVE 1 TO CTL-E
067300     MOVE DETAIL-X TO EDI-ERROR-LINE
067400     WRITE EDI-ERR-REC
067500     GO TO 70-READ-EDILOG-SERIAL.
067600     MOVE 0                       TO NO-SEND-SW.
067700     PERFORM 7010-CREATE-TRANS-CONT-RECORD.
067800     IF NO-SEND-SW > 0 GO TO 70-READ-EDILOG-SERIAL.
067900     PERFORM 7011-CREATE-PAYMENT-RECORD.
068000     IF NO-SEND-SW > 0 GO TO 70-READ-EDILOG-SERIAL.
068100     PERFORM 7012-CREATE-SHIP-TO-RECORD.
068200****************************************************************
068300*    MULTIPLE REC014 RECORDS MAY BE WRITTEN DEPENDING ON THE   *
068400*    NUMBER OF STANDARD INSTRUCTIONS TIED TO THE HEADER        *
068500*    SO THEY WILL BE CREATED WHEN ALL THE RECORDS ARE WRITTEN  *
068600*    TO THE FLATFILE                                           *
068700****************************************************************
068800     PERFORM 7015-CREATE-MISC-INFO-RECORD.
068900     IF NO-SEND-SW > 0 GO TO 70-READ-EDILOG-SERIAL.
069000****************************************************************
069100*    MULTIPLE REC020, REC021, AND REC023 TYPES MAY BE WRITTEN  *
069200*    TO THE FLATFILE BASED ON THE NUMBER OF ITEMS TIED TO THE  *
069300*    PURCHASE ORDER SO THEY WILL BE HANDLED AT RECORD          *
069400*    GENERATION TIME
069500****************************************************************
069600     PERFORM 7090-CREATE-TRAILER-PO-RECORD.
069700     PERFORM 7999-WRITE-EDI-FLATFILE.
069800     GO TO 70-READ-EDILOG-SERIAL.
069900 70-RES-X.    EXIT.
070000
070100 71-FIND-AND-GET-PO.
070200     MOVE 0                       TO NO-SEND-SW.
070300     MOVE PASSED-PO               TO PO-ARG.
070400     PERFORM 9999-CHAINHD-DEDILOG-LK-O.
070500     IF NOT GOOD-CALL
070600         PERFORM 79-HEADER-ROUTINE
070700         MOVE SPACES              TO DETAIL-X
070800         MOVE PASSED-PO           TO DET-PO
070900         MOVE "PURCHASE ORDER RECORD NON-RETRIEVABLE"
071000                                  TO DET-REASON
071100         WRITE SPOOL-RECORD FROM DETAIL-X AFTER ADVANCING 1
071200         MOVE 1 TO CTL-E
071300         MOVE DETAIL-X TO EDI-ERROR-LINE
071400         WRITE EDI-ERR-REC
071500         GO TO 71-FAGP-X.
071600     PERFORM 9999-GETNEXT-DEDILOG-LK-O.
071700     IF NOT GOOD-CALL
071800         PERFORM 79-HEADER-ROUTINE
071900         MOVE SPACES              TO DETAIL-X
072000         MOVE PASSED-PO           TO DET-PO
072100         MOVE "PURCHASE ORDER RECORD NON-RETRIEVABLE"
072200                                  TO DET-REASON
072300         WRITE SPOOL-RECORD FROM DETAIL-X AFTER ADVANCING 1
072400         MOVE 1 TO CTL-E
072500         MOVE DETAIL-X TO EDI-ERROR-LINE
072600         WRITE EDI-ERR-REC
072700         GO TO 71-FAGP-X.
           IF LOG-REL-NO = "999"
               MOVE "EDI "              TO PLT-ARG
               PERFORM 9999-GETKEY-MPLTINFO-PK-I
               IF GOOD-CALL
                   IF EDI-SEND-BLKTS = "Y"
                       NEXT SENTENCE
                   ELSE
071800             PERFORM 79-HEADER-ROUTINE
071900             MOVE SPACES          TO DETAIL-X
072000             MOVE PASSED-PO       TO DET-PO
072100             MOVE "BLANKET ORDER SEND FLAG NOT SET - NO SEND"
072200                                  TO DET-REASON
072300             WRITE SPOOL-RECORD FROM DETAIL-X AFTER ADVANCING 1
072400             MOVE 1 TO CTL-E
072500             MOVE DETAIL-X TO EDI-ERROR-LINE
072600             WRITE EDI-ERR-REC
072700             GO TO 71-FAGP-X
               ELSE
071800         PERFORM 79-HEADER-ROUTINE
071900         MOVE SPACES              TO DETAIL-X
072000         MOVE PASSED-PO           TO DET-PO
072100         MOVE "BLANKET ORDER SEND FLAG NOT SET - NO SEND"
072200                                  TO DET-REASON
072300         WRITE SPOOL-RECORD FROM DETAIL-X AFTER ADVANCING 1
072400         MOVE 1 TO CTL-E
072500         MOVE DETAIL-X TO EDI-ERROR-LINE
072600         WRITE EDI-ERR-REC
072700         GO TO 71-FAGP-X.
           PERFORM 7005-PRECHECK-FOR-ITEMS THRU 7005-PFI-X.
           IF GOOD-CALL
               NEXT SENTENCE
           ELSE
           PERFORM 79-HEADER-ROUTINE
           MOVE SPACES          TO DETAIL-X
           MOVE PASSED-PO       TO DET-PO
           MOVE "PURCHASE ORDER HAS NO ACTIVE ITEMS - NO SEND"
                                TO DET-REASON
           WRITE SPOOL-RECORD FROM DETAIL-X AFTER ADVANCING 1 LINES
           MOVE 1               TO CTL-E
           MOVE DETAIL-X        TO EDI-ERROR-LINE
           WRITE EDI-ERR-REC
           GO TO 71-FAGP-X.
072800     PERFORM 7010-CREATE-TRANS-CONT-RECORD.
072900     IF NO-SEND-SW > 0 GO TO 71-FAGP-X.
073000     PERFORM 7011-CREATE-PAYMENT-RECORD.
073100     IF NO-SEND-SW > 0 GO TO 71-FAGP-X.
073200     PERFORM 7012-CREATE-SHIP-TO-RECORD.
073300****************************************************************
073400*    MULTIPLE REC014 RECORDS MAY BE WRITTEN DEPENDING ON THE   *
073500*    NUMBER OF STANDARD INSTRUCTIONS TIED TO THE HEADER        *
073600*    SO THEY WILL BE CREATED WHEN ALL THE RECORDS ARE WRITTEN  *
073700*    TO THE FLATFILE                                           *
073800****************************************************************
073900     PERFORM 7015-CREATE-MISC-INFO-RECORD.
074000     IF NO-SEND-SW > 0 GO TO 71-FAGP-X.
074100****************************************************************
074200*    MULTIPLE REC020, REC021, AND REC023 TYPES MAY BE WRITTEN  *
074300*    TO THE FLATFILE BASED ON THE NUMBER OF ITEMS TIED TO THE  *
074400*    PURCHASE ORDER SO THEY WILL BE HANDLED AT RECORD          *
074500*    GENERATION TIME
074600****************************************************************
074700     PERFORM 7090-CREATE-TRAILER-PO-RECORD.
074800     PERFORM 7999-WRITE-EDI-FLATFILE.
074900
075000 71-FAGP-X.    EXIT.
075100
075200 72-UPDATE-DATA.
075300     ADD 1                        TO TAB-SUB.
075400     IF TAB-SUB > 200 OR RECORD-ENTRY (TAB-SUB) = SPACES
075500         GO TO 72-UD-EXIT.
075600 72-UD-CONT.
075700     PERFORM 9999-GETSER-DEDILOG-LK-O.
075800     IF END-OF-FILE GO TO 72-UD-EXIT.
075900     IF R-E (TAB-SUB) = LOG-RECORD-NO
076000         NEXT SENTENCE
076100     ELSE
076200     GO TO 72-UD-CONT.
076300     PERFORM 9999-DSET-LOCK.
076400     MOVE MPLTINFO-LOG-BATCH-NO-S TO LOG-BATCHNO.
076500     MOVE DATE-YMD-OUT            TO LOG-SEND-DATE.
           IF LOG-SEND-DATE-YY > "70"
               MOVE "19"                TO LOG-SEND-DATE-CC
           ELSE
           MOVE "20"                    TO LOG-SEND-DATE-CC.
076600     ACCEPT LOG-SEND-TIME FROM TIME.
076700     MOVE "X"                     TO LOG-FLAG-SEND.
076800     IF PASSED-IND = "M" MOVE "X" TO LOG-FLAG-M.
           PERFORM 70113-FIND-SUB-TRANSACTION.
           MOVE HOLD-SUB-TRANS          TO LOG-SUB-TRANS-NUM.
076900     PERFORM 9999-UPDATE-DEDILOG-LK-O.
077000     PERFORM 9999-UNLOCK.
077100     MOVE DSET-DPORECD            TO DSET-NAME, DSET-NAME-1.
077200     MOVE LOG-KEY                 TO PO-ARG, LOCK-VALUE-1.
077300     MOVE 1                       TO NUMBER-OF-DSETS-LOCKED.
077400     PERFORM 9999-MULTI-LOCK.
077500     PERFORM 9999-CHAINHD-DPORECD-PO-O.
077600     PERFORM 9999-GETNEXT-DPORECD-PO-O.
077700     MOVE "Y"                     TO PO-EDI-FLAG.
077800     PERFORM 9999-UPDATE-DPORECD-PO-O.
077900     PERFORM 9999-UNLOCK.
078000     MOVE DSET-DEDILOG        TO DSET-NAME.
           CLOSE DEDILOG-LK-O.
           OPEN I-O DEDILOG-LK-O.
061800     PERFORM 9999-BEGFIL-DEDILOG-LK-O.
078100*    CALL "DBCLOSE" USING BASE, DSET-NAME, MODE3, STATUS-AREA.
078200     GO TO 72-UPDATE-DATA.
078300 72-UD-EXIT.    EXIT.
078400
078500 79-HEADER-ROUTINE.
078600     IF OPEN-RPT1-SW = 0
078700         MOVE 1               TO OPEN-RPT1-SW
078800*        MOVE 0               TO OVRPRTF-TOFILE-NUM
078900*        PERFORM 996-OVERRIDE-PRINT-FILE
079000         OPEN OUTPUT SPOOL-ERROR-FILE
079100         MOVE SPACES          TO EDI-ERROR-LINE
079200         MOVE "*"             TO CTL-E
079300         MOVE TODAY-DATE      TO CONTROL-DATE-E
079400         WRITE EDI-ERR-REC
079500         MOVE HEADER-X        TO SPOOL-RECORD
079600                                 EDI-ERROR-LINE
079700         WRITE SPOOL-RECORD AFTER ADVANCING NEW-PAGE
079800         MOVE 0               TO CTL-E
079900         WRITE EDI-ERR-REC
080000         MOVE STAR-80         TO SPOOL-RECORD
080100                                 EDI-ERROR-LINE
080200         WRITE SPOOL-RECORD AFTER ADVANCING 1
080300         MOVE 1               TO CTL-E
080400         WRITE EDI-ERR-REC.
080500
080600*COPY OVRPFCALL IN COPYLIB.
080700
080800 7000-CREATE-HEADER-RECORD.
080900     MOVE SPACES                  TO REC000 REC010 REC011 REC012
081000                                     REC014 REC015 REC090 REC999.
081100     MOVE ZEROES                  TO PO-RECS-CTR-090
081200                                     BATCH-TOTAL-RECS-999.
081300     MOVE "000"                   TO TRANSACTION-ID-000.
081400     MOVE "PO"                    TO BATCH-TYPE-ID-000.
081500     MOVE "02"                    TO BATCH-SYSTEM-ID-000.
081600     MOVE "P 01"                  TO MPLTINFO-ARG PLT-ARG.
081700     PERFORM 9999-GETKEY-MPLTINFO-PK-I.
081800     IF GOOD-CALL
081900         MOVE MPLTINFO-COMPANY    TO BATCH-PLANT-ID-000
                                           SAVE-COMPANY.
           IF PASSED-BATCHNO-X NOT = SPACES
               MOVE PASSED-BATCHNO      TO BATCH-NUMBER-000
           ELSE
082200     MOVE MPLTINFO-LOG-BATCH-NO-S TO BATCH-NUMBER-000.
082300     MOVE  TODAY-DATE-WITH-CENTURY TO BATCH-DATE-000.
082400     ACCEPT TODAY-TIME FROM TIME.
082500     MOVE  TODAY-TIME             TO BATCH-TIME-000.
115800     MOVE REC000                  TO EDI-RECORD.
115900     WRITE EDI-RECORD.
116000     ADD 1                        TO PO-RECS-CTR-090
116100                                     BATCH-TOTAL-RECS-999.
082600
       7005-PRECHECK-FOR-ITEMS.
           PERFORM 9999-CHAINHD-DPOITEM-PO-I.
           IF NOT GOOD-CALL GO TO 7005-PFI-X.
           PERFORM 9999-GETNEXT-DPOITEM-PO-I.
       7005-PFI-X.    EXIT.

082700 7010-CREATE-TRANS-CONT-RECORD.
           MOVE SPACES                  TO REC010.
082800     MOVE "010"                   TO TRANSACTION-ID-010.
082900     MOVE LOG-PO-NO               TO DOC-PO-NO-010.
083000     MOVE LOG-REL-NO              TO DOC-PO-REL-010.
           MOVE SAVE-COMPANY            TO DOC-COMPANY-ID-010.
      *--------- IS IT REPAIR ORDER?
           MOVE SPACE TO ZBILL-PO-SW.
           MOVE LOG-PO-NO TO PO-ARRAY.
           PERFORM VARYING P-INDEX FROM 7 BY -1 UNTIL
                           P-INDEX = 0 OR ZBILL-PO
               IF PO-CHAR (P-INDEX) = "M"
                   MOVE "1" TO ZBILL-PO-SW
               ELSE
                   IF PO-CHAR (P-INDEX) NOT = SPACE
                       SET P-INDEX TO 1
                   END-IF
               END-IF
           END-PERFORM.
083800     MOVE LOG-VENDOR              TO VEN-ARG.
           MOVE SPACES                  TO SAVE-EDI-FLAGS.
083900     PERFORM 9999-CHAINHD-DVENDOR-VN-I.
084000     IF GOOD-CALL
084100         MOVE 0 TO VEN-ITM-NO
084200         PERFORM 9999-GETNEXT-DVENDOR-VN-I UNTIL
084300             VEN-ITM-NO = 14 OR END-OF-CHAIN
084400         IF END-OF-CHAIN
084500             PERFORM 79-HEADER-ROUTINE
084600             MOVE SPACES          TO DETAIL-X
084700             MOVE LOG-KEY         TO DET-PO
084800             MOVE "VENDOR INFORMATION WAS NON-RETRIEVABLE"
084900                                  TO DET-REASON
085000             WRITE SPOOL-RECORD FROM DETAIL-X
085100                 AFTER ADVANCING 1
085200             MOVE 1 TO CTL-E
085300             MOVE DETAIL-X TO EDI-ERROR-LINE
085400             WRITE EDI-ERR-REC
085500             MOVE 1               TO NO-SEND-SW
085600         ELSE
               MOVE SAVE-COMPANY        TO T-P-ID-COMPANY-010
               MOVE "0000CSIS0000"      TO T-P-ID-PREFIX-010
085700         MOVE VEN-TRADING-ID      TO T-P-ID-010
085800         MOVE VEN-EDIFACT-ID      TO X12-EDIFACT-ID-010
085900         MOVE VEN-GOODYEAR-CODE   TO GDYR-CODE-AT-SUPPLIER-010
086000     ELSE
086100     PERFORM 79-HEADER-ROUTINE
086200     MOVE SPACES                  TO DETAIL-X
086300     MOVE LOG-KEY                 TO DET-PO
086400     MOVE "VENDOR CODE UNLOCATEABLE " TO DET-REASON
086500     WRITE SPOOL-RECORD FROM DETAIL-X AFTER ADVANCING 1
086600     MOVE 1 TO CTL-E
086700     MOVE DETAIL-X TO EDI-ERROR-LINE
086800     WRITE EDI-ERR-REC
086900     MOVE 1                       TO NO-SEND-SW.
087000     IF NO-SEND-SW = 1
087100         NEXT SENTENCE
087200     ELSE
087300     MOVE LOG-KEY                 TO PO-ARG
087400     PERFORM 9999-CHAINHD-DPORECD-PO-O
087500     IF GOOD-CALL
087600         PERFORM 9999-GETNEXT-DPORECD-PO-O
087700         IF GOOD-CALL
087800             MOVE PO-DATE         TO WS-DATE
087900             MOVE CENTURY-DATE    TO DOCUMENT-DATE-010
088000             IF PO-VEN-CODE8-10 = "000"
088100                 MOVE PO-VEN-CODE TO PAYTO-VENDOR-CODE-010
088200                                     ORDERFROM-VENDOR-CODE-010
088300             ELSE
088400             MOVE PO-VEN-CODE     TO ORDERFROM-VENDOR-CODE-010
088500         ELSE
088600         PERFORM 79-HEADER-ROUTINE
088700         MOVE SPACES              TO DETAIL-X
088800         MOVE LOG-KEY             TO DET-PO
088900         MOVE "NUMBER NON-RETRIEVABLE" TO DET-REASON
089000         WRITE SPOOL-RECORD FROM DETAIL-X AFTER ADVANCING 1
089100         MOVE 1 TO CTL-E
089200         MOVE DETAIL-X TO EDI-ERROR-LINE
089300         WRITE EDI-ERR-REC
089400         MOVE 1                   TO NO-SEND-SW
089500     ELSE
089600     PERFORM 79-HEADER-ROUTINE
089700     MOVE SPACES                  TO DETAIL-X
089800     MOVE LOG-KEY                 TO DET-PO
089900     MOVE "NUMBER NON-RETRIEVABLE" TO DET-REASON
090000     WRITE SPOOL-RECORD FROM DETAIL-X AFTER ADVANCING 1
090100     MOVE 1 TO CTL-E
090200     MOVE DETAIL-X TO EDI-ERROR-LINE
090300     WRITE EDI-ERR-REC
090400     MOVE 1                       TO NO-SEND-SW.
090500**** IF LOG-FLAG-A = "X"
090600****     MOVE "00"                TO MESSAGE-FUNCTION-010
090700**** ELSE
090800**** MOVE "05"                    TO MESSAGE-FUNCTION-010.
           PERFORM 70113-FIND-SUB-TRANSACTION.
           MOVE HOLD-SUB-TRANS          TO MESSAGE-FUNCTION-010.
      **************************************************************
      **   '221' EQUATES TO 'BE' IN BEG02 SEGMENT                 **
      **   '222' EQUATES TO 'SA' IN BEG02 SEGMENT                 **
      **   '225' EQUATES TO 'RR' IN BEG02 SEGMENT                 **
      **   '226' EQUATES TO 'RL' IN BEG02 SEGMENT                 **
      **   '227' EQUATES TO 'CN' IN BEG02 SEGMENT                 **
      **************************************************************
           IF PO-NONPAY-IND = "X"
               MOVE "227"               TO DOCUMENT-NAME-010
           ELSE
083100     IF DOC-PO-REL-010 = "999"
083200         MOVE "221"               TO DOCUMENT-NAME-010
083300     ELSE
083400     IF DOC-PO-REL-010 = "000"
083500******** MOVE "225"               TO DOCUMENT-NAME-010
083500         MOVE "222"               TO DOCUMENT-NAME-010
083600     ELSE
083700     MOVE "226"                   TO DOCUMENT-NAME-010.
           IF ZBILL-PO AND SAVE-REPAIR = "X"
               MOVE "225"               TO DOCUMENT-NAME-010.
090900
091000 7011-CREATE-PAYMENT-RECORD.
           MOVE SPACES                  TO REC011.
091100     MOVE "011"                   TO TRANSACTION-ID-011.
091200     PERFORM 70110-GET-MOVE-BUYER-INFO.
091300     IF PO-CURRENCY-CODE = "  " MOVE "01" TO PO-CURRENCY-CODE.
091400     PERFORM 70111-GET-MOVE-CURRENCY.
091500     PERFORM 70112-GET-MOVE-PAYTERMS.
091600     MOVE PO-TRANSPORT-MODE
091700                                  TO MODE-OF-TRANSPORT-011.
091800     MOVE PO-VIA                  TO MEANS-OF-TRANSPORT-011.
091900     MOVE PO-TRANSPORT-CHGPAY
092000                                  TO TRANS-CHARGE-PAY-METHOD-011.
092100     MOVE PO-TRANSPORT-TERMS-OF-DEL
092200                                  TO TERMS-OF-DELIVERY-011.
092300     MOVE PO-FOB                  TO DELIVERY-LOCATION-011.
           IF PO-EXPECT-DATE = "      "
               MOVE ZEROES              TO WS-DATE
           ELSE
092400     MOVE PO-EXPECT-DATE          TO WS-DATE.
092500     MOVE CENTURY-DATE            TO PO-DELIVERY-DATE-011
092600                                     PO-EXPIRATION-DATE-011.
           IF PO-SHIP-DATE = "      "
               MOVE ZEROES TO WS-DATE
           ELSE
           IF PO-SHIP-DATE NOT NUMERIC
               MOVE ZEROES TO WS-DATE
           ELSE
092700     MOVE PO-SHIP-DATE            TO WS-DATE.
092800     MOVE CENTURY-DATE            TO PO-SHIP-DATE-011.
           IF PO-INVOICELESS-IND = " "
               NEXT SENTENCE
           ELSE
           MOVE "Y"                     TO INVOICELESS-IND-011.
092900
093000 70110-GET-MOVE-BUYER-INFO.
093100     MOVE PO-BUYER-CODE           TO BUYER-ARG.
093200     PERFORM 9999-GETKEY-MBUYER-BY-I.
093300     IF GOOD-CALL
093400         MOVE BUYER-NAME          TO BUYER-NAME-011
093500         MOVE BUYER-PHONE-NO      TO BUYER-PHONE-NO-011.
093600
093700 70111-GET-MOVE-CURRENCY.
093800     MOVE PO-CURRENCY-CODE        TO UM-ARG.
093900     PERFORM 9999-GETKEY-MVALIDUM-UM-I.
094000     IF GOOD-CALL
094100         IF X12-EDIFACT-ID-010 = 1
094200             MOVE VALID-EDI-UM    TO CURRENCY-CODE-011
094300         ELSE
094400         MOVE VALID-UM            TO CURRENCY-CODE-011
094500     ELSE
094600     PERFORM 79-HEADER-ROUTINE
094700     MOVE SPACES                  TO DETAIL-X
094800     MOVE LOG-KEY                 TO DET-PO
094900     MOVE "CURRENCY CODE IS NON-RETRIEVABLE" TO DET-REASON
095000     WRITE SPOOL-RECORD FROM DETAIL-X AFTER ADVANCING 1
095100     MOVE 1 TO CTL-E
095200     MOVE DETAIL-X TO EDI-ERROR-LINE
095300     WRITE EDI-ERR-REC
095400     MOVE 1                       TO NO-SEND-SW.
095500
095600 70112-GET-MOVE-PAYTERMS.
095700     MOVE PO-TERMS                TO WS-PO-TERMS.
095800     MOVE WS-PLTINFO-ARG          TO MPLTINFO-ARG PLT-ARG.
095900     PERFORM 9999-GETKEY-MPLTINFO-PK-I.
096000     IF GOOD-CALL
096100         MOVE MPLTINFO-PAY-TERMS-TYPE
096200                                  TO PAYMENT-TERMS-TYPE-011
096300         MOVE MPLTINFO-PAY-TIME-REF
096400                                  TO PAYMENT-TIME-REF-CODE-011
096500         MOVE MPLTINFO-TIME-RELATION
096600                                  TO PAYMENT-TIME-REL-CODE-011
096700         MOVE MPLTINFO-TYPE-OF-PERIOD
096800                                  TO PAYMENT-TYPE-OF-PERIOD-011
096900         MOVE MPLTINFO-NO-OF-PERIODS
097000                                  TO PAYMENT-NO-OF-PERIODS-011
097100                                     PAYMENT-DAY-OF-MONTH-011
097200         MOVE MPLTINFO-NO-OF-PERIODS-P
097300                                  TO PAYMENT-DAY-OF-MONTH-2-011
097400         MOVE MPLTINFO-PERCENT-DISCOUNT
097500                                  TO PAYMENT-PERCENT-011
097600         MOVE MPLTINFO-PAYMENT-NET-DAYS
097700                                  TO PAYMENT-NET-DAYS-011
097800     ELSE
097900     PERFORM 79-HEADER-ROUTINE
098000     MOVE SPACES                  TO DETAIL-X
098100     MOVE LOG-KEY                 TO DET-PO
098200     MOVE "PAYMENT TERMS NON-RETRIEVABLE" TO DET-REASON
098300     WRITE SPOOL-RECORD FROM DETAIL-X AFTER ADVANCING 1
098400     MOVE 1 TO CTL-E
098500     MOVE DETAIL-X TO EDI-ERROR-LINE
098600     WRITE EDI-ERR-REC
098700     MOVE 1                       TO NO-SEND-SW.
098800
       70113-FIND-SUB-TRANSACTION.
           MOVE SPACES                  TO HOLD-SUB-TRANS.

      *--------- IS IT A NEW PO OR REPLACEMENT?
           IF LOG-FLAG-A = "X"
               MOVE "00"                TO HOLD-SUB-TRANS
           ELSE
               MOVE "05"                TO HOLD-SUB-TRANS.

      *----- IF PLANT IS USING OTHER EDI OPTIONS (IN DVENDOR), FIND
      *----- OUT WHICH ONES APPLY.

      *--------- IS IT A MODIFIED PO?
           IF SAVE-CHANGE = "X"
             IF LOG-FLAG-M = "X" OR
                   (LOG-FLAG-D = "X" AND LOG-ITEM-NO-X > "0000")
               MOVE "04"                TO HOLD-SUB-TRANS.

098900 7012-CREATE-SHIP-TO-RECORD.
           MOVE SPACES                  TO REC012.
099000     MOVE "012"                   TO TRANSACTION-ID-012.
099100     MOVE "ST"                    TO ADDRESS-QUALIFIER-012.
082100     MOVE SAVE-COMPANY            TO ADDR-CODE-012.
099300     MOVE "P 00"                  TO MPLTINFO-ARG PLT-ARG.
099400     PERFORM 9999-GETKEY-MPLTINFO-PK-I.
099500     IF NOT GOOD-CALL
099600         MOVE "GET2 PLTINFO * 71-BP"  TO  BU-DISPLAY-MSG
099700         MOVE PLT-ARG                 TO  BU-DISPLAY-FLD (2)
099800         GO TO 2100-BLOWUP.
099900     MOVE MPLTINFO-DATA           TO  NAME-012.
100000     IF PO-ALT-REMIT-INDIC = "X"
100100         MOVE "PA00"              TO  MPLTINFO-ARG PLT-ARG
100200         PERFORM 9999-GETKEY-MPLTINFO-PK-I
100300         IF NOT GOOD-CALL
100400             MOVE "GET2A PLTINFO * 71-BP" TO  BU-DISPLAY-MSG
100500             MOVE PLT-ARG         TO  BU-DISPLAY-FLD (2)
100600             GO TO 2100-BLOWUP
100700         ELSE
100800         MOVE MPLTINFO-DATA       TO NAME-012.
100900
101000     MOVE "P 01"                  TO  MPLTINFO-ARG PLT-ARG.
101100     PERFORM 9999-GETKEY-MPLTINFO-PK-I.
101200     IF NOT GOOD-CALL
101300         MOVE "GET3 PLTINFO * 71-BP"  TO  BU-DISPLAY-MSG
101400         MOVE PLT-ARG                 TO  BU-DISPLAY-FLD (2)
101500         GO TO 2100-BLOWUP.
101600     MOVE MPLTINFO-PLT-NAME       TO  ADDR-1-012 (1).
101700     IF PO-ALT-REMIT-INDIC = "X"
101800         MOVE "PA01"              TO  MPLTINFO-ARG PLT-ARG
101900         PERFORM 9999-GETKEY-MPLTINFO-PK-I
102000         IF NOT GOOD-CALL
102100             MOVE "GET4 PLTINFO * 71-BP" TO  BU-DISPLAY-MSG
102200             MOVE PLT-ARG         TO  BU-DISPLAY-FLD (2)
102300             GO TO 2100-BLOWUP
102400         ELSE
102500         MOVE MPLTINFO-DATA       TO ADDR-1-012 (1).
102600     MOVE "P 10"                  TO MPLTINFO-ARG PLT-ARG.
102700     PERFORM 9999-GETKEY-MPLTINFO-PK-I.
102800     IF NOT GOOD-CALL
102900         MOVE "GET6 PLTINFO * 61-BP" TO  BU-DISPLAY-MSG
103000         MOVE PLT-ARG                TO  BU-DISPLAY-FLD (2)
103100         GO TO 2100-BLOWUP.
103200     MOVE MPLTINFO-DATA           TO ADDR-1-012 (1).
103300     IF PO-ALT-REMIT-INDIC = "X"
103400         MOVE "PA10"              TO MPLTINFO-ARG PLT-ARG
103500         PERFORM 9999-GETKEY-MPLTINFO-PK-I
103600         IF NOT GOOD-CALL
103700             MOVE "GET6 PLTINFO * 71-BP" TO  BU-DISPLAY-MSG
103800             MOVE PLT-ARG         TO  BU-DISPLAY-FLD (2)
103900             GO TO 2100-BLOWUP
104000         ELSE
104100         MOVE MPLTINFO-DATA       TO ADDR-1-012 (1).
104200
104300     MOVE "P 11"                  TO MPLTINFO-ARG PLT-ARG.
104400     PERFORM 9999-GETKEY-MPLTINFO-PK-I.
104500     IF NOT GOOD-CALL
104600         MOVE "GET7 PLTINFO * 71-BP"  TO  BU-DISPLAY-MSG
104700         MOVE PLT-ARG                 TO  BU-DISPLAY-FLD (2)
104800         GO TO 2100-BLOWUP.
104900     MOVE MPLTINFO-DATA           TO ADDR-1-012 (2).
105000     IF PO-ALT-REMIT-INDIC = "X"
105100         MOVE "PA11"              TO MPLTINFO-ARG PLT-ARG
105200         PERFORM 9999-GETKEY-MPLTINFO-PK-I
105300         IF NOT GOOD-CALL
105400             MOVE "GET8 PLTINFO * 71-BP" TO  BU-DISPLAY-MSG
105500             MOVE PLT-ARG         TO  BU-DISPLAY-FLD (2)
105600             GO TO 2100-BLOWUP
105700         ELSE
105800         MOVE MPLTINFO-DATA       TO ADDR-1-012 (2).
105900
106000 7015-CREATE-MISC-INFO-RECORD.
           MOVE SPACES                  TO REC015.
106100     MOVE "015"                   TO TRANSACTION-ID-015.
106200     MOVE "P 13"                  TO MPLTINFO-ARG PLT-ARG.
106300     PERFORM 9999-GETKEY-MPLTINFO-PK-I.
106400     IF GOOD-CALL
106500         MOVE MPLTINFO-PLANT-FAX-NO
106600                                  TO FAX-NO-015
106700         MOVE MPLTINFO-PLANT-TELEX-NO
106800                                  TO TELEX-NO-015.
106900     PERFORM 70151-CHECK-TAX-ITEMS THRU 70151-CTI-X.
107000
107100 70151-CHECK-TAX-ITEMS.
107200     MOVE SPACES                  TO SAVE-ITEM-TAX-CODE.
           MOVE 0                       TO TAX-SWITCH.
107300     PERFORM 9999-CHAINHD-DPOITEM-PO-I.
107400     IF NOT GOOD-CALL
               PERFORM 79-HEADER-ROUTINE
               MOVE SPACES              TO DETAIL-X
               MOVE PO-ARG              TO DET-PO
               MOVE "PURCHASE ORDER HAS NO ACTIVE ITEMS - NO SEND"
                                        TO DET-REASON
               WRITE SPOOL-RECORD FROM DETAIL-X AFTER ADVANCING 1 LINES
               MOVE 1                   TO CTL-E
               MOVE DETAIL-X            TO EDI-ERROR-LINE
               WRITE EDI-ERR-REC
               MOVE 1                   TO NO-SEND-SW
               GO TO 70151-CTI-X.
107500 70151-CTI-LOOP.
107600     PERFORM 9999-GETNEXT-DPOITEM-PO-I.
107700     IF GOOD-CALL
107800         NEXT SENTENCE
107900     ELSE
108000     IF END-OF-CHAIN
               IF TAX-SWITCH = 0
                   MOVE SAVE-ITEM-TAX-CODE TO TAX-ARG
                   PERFORM 9999-GETKEY-MTAX-TX-I
                   IF NO-ENTRY
                       MOVE "1" TO TAX-EXEMPT-CODE-015
                       GO TO 70151-CTI-X
                   ELSE
                   IF MTAX-PERCENT-LIST = SPACES
                       MOVE "1" TO TAX-EXEMPT-CODE-015
                   ELSE
                   MOVE ZEROES          TO MTAX-TOTAL
                   ADD MTAX-PERCENT (1) TO MTAX-TOTAL
                   ADD MTAX-PERCENT (2) TO MTAX-TOTAL
                   ADD MTAX-PERCENT (3) TO MTAX-TOTAL
                   ADD MTAX-PERCENT (4) TO MTAX-TOTAL
                   IF MTAX-TOTAL = ZEROES
                       MOVE "1" TO TAX-EXEMPT-CODE-015
                       GO TO 70151-CTI-X
                   ELSE
                   MOVE "2" TO TAX-EXEMPT-CODE-015
                   GO TO 70151-CTI-X
               ELSE
               MOVE "2" TO TAX-EXEMPT-CODE-015
               GO TO 70151-CTI-X
108200     ELSE
108300     MOVE "GET DPOITEM *70151 PARA" TO BU-DISPLAY-MSG
108400     MOVE PO-ARG                    TO BU-DISPLAY-FLD (2)
108500     GO TO 2100-BLOWUP.
108600     PERFORM 701510-CHECK-ORDER-UM.
108700     PERFORM 701511-CHECK-PRICE-UM.
108800     IF SAVE-ITEM-TAX-CODE = SPACES
108900         MOVE ITM-TAX-CODE        TO SAVE-ITEM-TAX-CODE
109000         GO TO 70151-CTI-LOOP.
           IF SAVE-ITEM-TAX-CODE NOT = ITM-TAX-CODE
               MOVE 1 TO TAX-SWITCH
           ELSE
           GO TO 70151-CTI-LOOP.
109600
109700 70151-CTI-X.    EXIT.
109800
109900 701510-CHECK-ORDER-UM.
110000     MOVE ITM-UM                  TO UM-ARG.
110100     PERFORM 9999-GETKEY-MVALIDUM-UM-I.
110200     IF GOOD-CALL
110300         NEXT SENTENCE
110400     ELSE
110500     PERFORM 79-HEADER-ROUTINE
110600     MOVE SPACES                  TO DETAIL-X
110700     MOVE LOG-KEY                 TO DET-PO
110800     MOVE "ORDER UNIT OF MEASURE NON-RETRIEVABLE" TO DET-REASON
110900     WRITE SPOOL-RECORD FROM DETAIL-X AFTER ADVANCING 1
111000     MOVE 1 TO CTL-E
111100     MOVE DETAIL-X TO EDI-ERROR-LINE
111200     WRITE EDI-ERR-REC
111300     MOVE 1                       TO NO-SEND-SW.
111400
111500 701511-CHECK-PRICE-UM.
111600     MOVE ITM-PRICE-UM            TO UM-ARG.
111700     PERFORM 9999-GETKEY-MVALIDUM-UM-I.
111800     IF GOOD-CALL
111900         IF X12-EDIFACT-ID-010 = 1
112000             MOVE VALID-EDI-UM    TO LINE-PRICE-UM-020
112100         ELSE
112200         MOVE ITM-UM              TO LINE-PRICE-UM-020
112300     ELSE
112400     PERFORM 79-HEADER-ROUTINE
112500     MOVE SPACES                  TO DETAIL-X
112600     MOVE LOG-KEY                 TO DET-PO
112700     MOVE "PRICE UNIT OF MEASURE NON-RETRIEVABLE" TO DET-REASON
112800     WRITE SPOOL-RECORD FROM DETAIL-X AFTER ADVANCING 1
112900     MOVE 1 TO CTL-E
113000     MOVE DETAIL-X TO EDI-ERROR-LINE
113100     WRITE EDI-ERR-REC
113200     MOVE 1                       TO NO-SEND-SW.
113300
113400 7090-CREATE-TRAILER-PO-RECORD.
113500     MOVE "090"                   TO TRANSACTION-ID-090.
113600     MOVE LOG-PO-NO               TO DOC-PO-NO-090.
113700     MOVE LOG-REL-NO              TO DOC-PO-REL-090.
113800     MOVE SAVE-COMPANY            TO DOC-COMPANY-ID-090.
113900     MOVE TRADING-PARTNER-ID-010  TO TRADING-PARTNER-ID-090.
114000     MOVE DOCUMENT-DATE-010       TO DOCUMENT-DATE-090.
114100
114200 7099-CREATE-TRAILER-RECORD.
114300     MOVE "999"                   TO TRANSACTION-ID-999.
114400     MOVE "PO"                    TO BATCH-TYPE-ID-999.
114500     MOVE "02"                    TO BATCH-SYSTEM-ID-999.
114600     MOVE SAVE-COMPANY            TO BATCH-PLANT-ID-999.
114700     MOVE BATCH-NUMBER-000        TO BATCH-NUMBER-999.
114800     MOVE  TODAY-DATE-WITH-CENTURY TO BATCH-DATE-999.
114900     ACCEPT TODAY-TIME FROM TIME.
115000     MOVE  TODAY-TIME             TO BATCH-TIME-999.
115100     IF BATCH-TOTAL-RECS-999 = 0
115200         NEXT SENTENCE
115300     ELSE
115400     ADD 1                        TO BATCH-TOTAL-RECS-999
115500     WRITE EDI-RECORD             FROM REC999.
115600
115700 7999-WRITE-EDI-FLATFILE.
116200     MOVE REC010                  TO EDI-RECORD.
116300     WRITE EDI-RECORD.
116400     ADD 1                        TO PO-RECS-CTR-090
116500                                     BATCH-TOTAL-RECS-999.
116600     MOVE REC011                  TO EDI-RECORD.
116700     WRITE EDI-RECORD.
116800     ADD 1                        TO PO-RECS-CTR-090
116900                                     BATCH-TOTAL-RECS-999.
117000     MOVE REC012                  TO EDI-RECORD.
117100     WRITE EDI-RECORD.
117200     ADD 1                        TO PO-RECS-CTR-090
117300                                     BATCH-TOTAL-RECS-999.
117400     MOVE LOG-KEY                 TO PO-ARG.
117500     PERFORM 79990-GET-STD-INST THRU 79990-GSI-X.
117600*    IF PO-PRINT-TYPE = "S"
117700*        MOVE "REL"               TO PO-STD-INST-1
117800*        MOVE SAVE-STD-INST-BEFORE
117900*                                 TO PO-STD-INST-2-7
118000*    ELSE
118100*    MOVE SAVE-STD-INST-BEFORE    TO PO-STD-INSTRUCTIONS.
118200     MOVE SAVE-STD-INST-BEFORE    TO PO-STD-INSTRUCTIONS.
118300     IF PO-STD-INST-TABLE NOT = SPACES
118400         PERFORM 79991-WRITE-REC014S THRU 79991-WR-X.
118500     MOVE SAVE-STD-INST-AFTER     TO PO-STD-INSTRUCTIONS.
118600     IF PO-STD-INST-TABLE NOT = SPACES
118700         PERFORM 79991-WRITE-REC014S THRU 79991-WR-X.
      **********************************************************
      *    I REMOVED THE WRITE OF THIS FLATFILE RECORD 015     *
      *    WHEN I WAS IN DANVILLE 3/5/92 AS IT WAS CAUSING     *
      *    HAVOC IN THE TRANSLATOR SINCE WE WERE FLAGGING      *
      *    ITEMS AS TAX EXEMPT BUT COULD NOT SUPPLY THE CODE   *
      *    AS CSIS DOES NOT MAINTAIN IT ANYWHERE               *
      **********************************************************
118800*    IF REC015-DATA = SPACES
118900*        NEXT SENTENCE
119000*    ELSE
119100*    MOVE REC015                  TO EDI-RECORD
119200*    WRITE EDI-RECORD
119300*    ADD 1                        TO PO-RECS-CTR-090
119400*                                    BATCH-TOTAL-RECS-999.
119500     PERFORM 79992-WRITE-REC020S THRU 79992-WR-X.
119600****************************************************************
119700*    REC022 IS NOT WRITTEN SIMPLY BECAUSE CSIS DOES NOT        *
119800*    CURRENTLY CONTAIN THIS INFORMATION                        *
119900****************************************************************
120000*    MOVE REC022                  TO EDI-RECORD.
120100*    WRITE EDI-RECORD.
120200     ADD 1                        TO PO-RECS-CTR-090
120300                                     BATCH-TOTAL-RECS-999.
120400     MOVE REC090                  TO EDI-RECORD.
120500     WRITE EDI-RECORD.
120600     ADD 1                        TO TAB-SUB.
120700     MOVE LOG-RECORD-NO           TO RECORD-ENTRY (TAB-SUB).
120800     MOVE SPACES                  TO REC090.
120900     MOVE 0                       TO PO-RECS-CTR-090.
121000****************************************************************
121100*    WRITE EDI REPORT FILE RECORD OF FLATFILE-WRITTEN PO'S     *
121200****************************************************************
121300     MOVE SPACES                  TO SORTF.
121400     MOVE PO-BUYER                TO SORT-BUYER.
121500     MOVE LOG-KEY                 TO SORT-PO.
121600     MOVE PO-BUDGET-AMT           TO SORT-BGTAMT.
121700     MOVE PO-BUDGET-NUMBER        TO SORT-BGTNO.
121800     MOVE PO-VEN-CODE             TO SORT-VENDOR.
121900     MOVE PO-DATE                 TO SORT-PODATE.
           MOVE HOLD-SUB-TRANS          TO SORT-FUNCTION.
122000     RELEASE SORTF.
122100     ADD 1                        TO REL-RECS-CTR.
122200
122300 79990-GET-STD-INST.
122400     MOVE SPACES                  TO STD-INST-SAVED
122500                                     PO-STD-INST-TABLE.
122600     PERFORM 9999-CHAINHD-DPODATAITM-PO-I.
122700     IF NOT GOOD-CALL GO TO 79990-GSI-X.
122800 79990-GSI-LOOP.
122900     PERFORM 9999-GETNEXT-DPODATAITM-PO-I.
123000     IF END-OF-CHAIN GO TO 79990-GSI-X.
123100     IF DATAITM-LINE = "000001"
123200         MOVE DATAITM-INFO        TO STD-INST-SAVED
123300     ELSE
123400     IF DATAITM-LINE > "000001"
123500         GO TO 79990-GSI-X
123600     ELSE
123700     GO TO 79990-GSI-LOOP.
123800
123900 79990-GSI-X.    EXIT.
124000
124100 79991-WRITE-REC014S.
124200     MOVE 0                       TO SUB.
124300 79991-WR-CONT.
124400     ADD 1                        TO SUB.
124500     IF SUB > 7 GO TO 79991-WR-X.
124600     IF PO-STD-INST (SUB) = SPACES GO TO 79991-WR-CONT.
124700     MOVE SPACES                  TO REC014.
124800     MOVE "014"                   TO TRANSACTION-ID-014.
124900     MOVE SAVE-COMPANY            TO PLANT-ID-NO-014.
125000     MOVE PO-STD-INST (SUB)       TO BUILD-COM-NO
125100                                     FTX-INSTRUCTION-NO-014.
125200     MOVE BUILD-COMMENT-NO        TO COMMENT-ARG.
125300     PERFORM 9999-CHAINHD-DCOMMENT-MC-I.
125400     IF NOT GOOD-CALL GO TO 79991-WR-CONT.
125500     PERFORM 9999-GETNEXT-DCOMMENT-MC-I.
125600     IF NOT GOOD-CALL
125700         IF END-OF-CHAIN
125800             GO TO 79991-WR-CONT
125900         ELSE
126000         MOVE "GET DCOMMENT FAILED " TO BU-DISPLAY-MSG
126100         MOVE COMMENT-ARG            TO BU-DISPLAY-FLD (2)
126200         GO TO 2100-BLOWUP.
126300     MOVE DCOM-DATA-LINE          TO FTX-DESCRIPTION-014 (1).
126400     PERFORM 9999-GETKEY-MCOMMENT-MC-I.
126500     IF GOOD-CALL
126600         MOVE MCOM-SUBJECT-CODE   TO FTX-SUBJECT-CODE-014.
126700     MOVE REC014                  TO EDI-RECORD.
126800     WRITE EDI-RECORD.
126900     ADD 1                        TO PO-RECS-CTR-090
127000                                     BATCH-TOTAL-RECS-999.
127100     GO TO 79991-WR-CONT.
127200
127300 79991-WR-X.    EXIT.
127400
127500 79992-WRITE-REC020S.
127600     PERFORM 9999-CHAINHD-DPOITEM-PO-I.
127700     IF NOT GOOD-CALL GO TO 79992-WR-X.
127800 79992-WR-LOOP.
127900     MOVE SPACES                  TO REC020 REC021.
128000     MOVE "020"                   TO TRANSACTION-ID-020.
128100     IF LOG-FLAG-A = "X"
128200         MOVE "1"                 TO LINE-ACTION-REQUEST-CODE-020
128300     ELSE
128400     IF LOG-FLAG-M = "X"
128500         MOVE "3"                TO LINE-ACTION-REQUEST-CODE-020.
128600     PERFORM 9999-GETNEXT-DPOITEM-PO-I.
128700     IF NOT GOOD-CALL GO TO 79992-WR-X.
128800     MOVE ITM-NUMBER              TO LINE-ITEM-NO-020.
128900     MOVE ITM-CORP-CODE           TO LINE-CSIS-PROD-CODE-020.
129000     MOVE ITM-QTY-ORD             TO LINE-ORDER-QTY-020.
129100     MOVE ITM-UM                  TO UM-ARG.
129200     PERFORM 9999-GETKEY-MVALIDUM-UM-I.
129300     IF GOOD-CALL
129400         IF X12-EDIFACT-ID-010 = 1
129500             MOVE VALID-EDI-UM    TO LINE-ORDER-UM-020
129600         ELSE
129700         MOVE ITM-UM              TO LINE-ORDER-UM-020.
129800     MOVE ITM-UNIT-PRICE          TO LINE-UNIT-PRICE-020.
129900     MOVE ITM-PRICE-UM            TO UM-ARG.
130000     PERFORM 9999-GETKEY-MVALIDUM-UM-I.
130100     IF GOOD-CALL
130200         IF X12-EDIFACT-ID-010 = 1
130300             MOVE VALID-EDI-UM    TO LINE-PRICE-UM-020
130400         ELSE
130500         MOVE ITM-UM              TO LINE-PRICE-UM-020.
           IF TAX-EXEMPT-CODE-015 = "   "
               IF ITM-TAX-CODE = "  " OR "N " OR "NO"
                   MOVE "1  "           TO LINE-TAX-EXEMPT-CODE-020
               ELSE
               MOVE ITM-TAX-CODE TO TAX-ARG
               PERFORM 9999-GETKEY-MTAX-TX-I
               IF NO-ENTRY
                   MOVE "1  " TO LINE-TAX-EXEMPT-CODE-020
               ELSE
               IF MTAX-PERCENT-LIST = SPACES
                   MOVE "1  " TO LINE-TAX-EXEMPT-CODE-020
               ELSE
               MOVE ZEROES          TO MTAX-TOTAL
               ADD MTAX-PERCENT (1) TO MTAX-TOTAL
               ADD MTAX-PERCENT (2) TO MTAX-TOTAL
               ADD MTAX-PERCENT (3) TO MTAX-TOTAL
               ADD MTAX-PERCENT (4) TO MTAX-TOTAL
               IF MTAX-TOTAL = ZEROES
                   MOVE "1  " TO LINE-TAX-EXEMPT-CODE-020
               ELSE
               MOVE "2  " TO LINE-TAX-EXEMPT-CODE-020.
131100     IF ITM-CORP-CODE = "NON-STR" OR "       "
131200         MOVE "        "          TO LINE-CSIS-PROD-CODE-020.
131300     MOVE REC020                  TO EDI-RECORD.
131400     WRITE EDI-RECORD.
131500     ADD 1                        TO PO-RECS-CTR-090
131600                                     BATCH-TOTAL-RECS-999.
131700 79992-WR-REC021.
131800     MOVE "021"                   TO TRANSACTION-ID-021.
131900     IF ITM-CORP-CODE = "NON-STR" OR "       "
132000         PERFORM 799920-GET-NON-CODED-INFO THRU 799920-GNCI-X
132100     ELSE
132200     PERFORM 799921-GET-CODED-INFO THRU 799921-GCI-X.
132300     IF ITM-STD-INST = SPACES
132400         NEXT SENTENCE
132500     ELSE
132600     MOVE ITM-STD-INST            TO PO-STD-INSTRUCTIONS
132700     PERFORM 799929-WRITE-REC023S THRU 799929-WR-X.
132800     GO TO 79992-WR-LOOP.
132900
133000 79992-WR-X.    EXIT.
133100
133200 799920-GET-NON-CODED-INFO.
133300     PERFORM 9999-CHAINHD-DPODATAITM-PO-I.
133400     IF NOT GOOD-CALL GO TO 799920-GNCI-X.
133500 799920-DPODATAITM-LOOP.
133600     PERFORM 9999-GETNEXT-DPODATAITM-PO-I.
133700     IF END-OF-CHAIN
133800         GO TO 799920-GNCI-X
133900     ELSE
134000     IF DATAITM-PO-RCV-NO NOT = PO-ARG
134100         MOVE 15                  TO COND-WORD
134200         IF NOT GOOD-CALL
134300             IF END-OF-CHAIN
134400                 MOVE 9999        TO DATAITM-ITEM-NO
134500             ELSE
134600             MOVE "GET DPODATAITM *62-DL"  TO  BU-DISPLAY-MSG
134700             GO TO 2100-BLOWUP.
134800
134900 799920-CONT-DPODATAITM-LOOP.
135000     IF DATAITM-ITEM-NO < ITM-NUMBER
135100         GO TO 799920-DPODATAITM-LOOP
135200     ELSE
135300     IF DATAITM-ITEM-NO > ITM-NUMBER
135400         NEXT SENTENCE
135500     ELSE
135600*****************************************************
135700**   WHEN A DESCRIPTION LINE FOR THE ITEM CONTAINS
135800**   AN '@' IN THE FIRST COLUMN THIS DENOTES LOCAL
135900**   OR INTERNAL DESCRIPTION AND THEREFORE IT WILL
136000**   BE SKIPPED WHEN PRINTING THE ITEM ON A PO
136100*****************************************************
136200     IF DATAITM-INFO-FIRST-CHAR = "@"
136300         GO TO 799920-DPODATAITM-LOOP
136400     ELSE
136500     MOVE DATAITM-INFO            TO ITEM-DESCRIPTION-021
136600     MOVE REC021                  TO EDI-RECORD
136700     WRITE EDI-RECORD
136800     ADD 1                        TO PO-RECS-CTR-090
136900                                     BATCH-TOTAL-RECS-999.
137000     GO TO 799920-DPODATAITM-LOOP.
137100 799920-GNCI-X.    EXIT.
137200
137300 799921-GET-CODED-INFO.
137400     MOVE ITM-CORP-CODE           TO CODE-ARG.
137500     IF ITM-SECOND-DESC-INDIC  =  "X"
137600         MOVE "S"                 TO CDESC-LANGUAGE-OPTION
137700     ELSE
137800     MOVE "P"                     TO CDESC-LANGUAGE-OPTION.
137900     CALL "CDESC" USING RET-CODE,
138000                        BASE,
138100                        STATUS-AREA,
138200                        BU-DISPLAY-MSG,
138300                        CODE-ARG,
138400                        CDESC-DATA.
138500     IF BU-DISPLAY-MSG-1  NOT = SPACES
138600         MOVE CODE-ARG            TO  BU-DISPLAY-FLD (2)
138700         GO TO 2100-BLOWUP.
138800     MOVE ZEROS                   TO  SUB.
138900
139000 799921-DESC-LOOP.
139100     ADD 1                        TO  SUB.
139200     IF SUB > CDESC-LINES-GOT
139300         NEXT SENTENCE
139400     ELSE
139500     MOVE CDESC (SUB)             TO  ITEM-DESCRIPTION-021
139600     MOVE REC021                  TO  EDI-RECORD
139700     WRITE EDI-RECORD
139800     ADD 1                        TO  PO-RECS-CTR-090
139900                                      BATCH-TOTAL-RECS-999
140000     GO TO 799921-DESC-LOOP.
140100
140200 799921-GCI-X.    EXIT.
140300
140400 799929-WRITE-REC023S.
140500     MOVE 0                       TO SUB.
140600 799929-WR-CONT.
140700     ADD 1                        TO SUB.
140800     IF SUB > 7 GO TO 799929-WR-X.
140900     IF PO-STD-INST (SUB) = SPACES GO TO 799929-WR-CONT.
141000     MOVE SPACES                  TO REC023.
141100     MOVE "023"                   TO TRANSACTION-ID-023.
141200     MOVE SAVE-COMPANY            TO PLANT-ID-NO-023.
141300     MOVE PO-STD-INST (SUB)       TO BUILD-COM-NO
141400                                     FTX-INSTRUCTION-NO-023.
141500     MOVE BUILD-COMMENT-NO        TO COMMENT-ARG.
141600     PERFORM 9999-CHAINHD-DCOMMENT-MC-I.
141700     IF NOT GOOD-CALL GO TO 799929-WR-CONT.
141800     PERFORM 9999-GETNEXT-DCOMMENT-MC-I.
141900     IF NOT GOOD-CALL
142000         IF END-OF-CHAIN
142100             GO TO 799929-WR-CONT
142200         ELSE
142300         MOVE "GET DCOMMENT FAILED " TO BU-DISPLAY-MSG
142400         MOVE COMMENT-ARG            TO BU-DISPLAY-FLD (2)
142500         GO TO 2100-BLOWUP.
142600     MOVE DCOM-DATA-LINE          TO FTX-DESCRIPTION-023 (1).
142700     PERFORM 9999-GETKEY-MCOMMENT-MC-I.
142800     IF GOOD-CALL
142900         MOVE MCOM-SUBJECT-CODE   TO FTX-SUBJECT-CODE-023.
143000     MOVE REC023                  TO EDI-RECORD.
143100     WRITE EDI-RECORD.
143200     ADD 1                        TO PO-RECS-CTR-090
143300                                     BATCH-TOTAL-RECS-999.
143400     GO TO 799929-WR-CONT.
143500 799929-WR-X.    EXIT.
143600
       9999-CHAINHD-DCOMMENT-MC-I.
           MOVE 0 TO COND-WORD.
           MOVE COMMENT-ARG TO MCOMCOMMNT OF DCOMMENT-MC-REC-I.
           START DCOMMENT-MC-I KEY = MCOMCOMMNT OF DCOMMENT-MC-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DCOMMENT-MC-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CHAINHD-DEDILOG-LK-O.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO EDILOGKEY OF DEDILOG-LK-REC-O.
           START DEDILOG-LK-O KEY = EDILOGKEY OF DEDILOG-LK-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DEDILOG-LK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CHAINHD-DPODATAITM-PO-I.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPODATAITM-PO-REC-I.
           START DPODATAITM-PO-I KEY = PORCVNO OF DPODATAITM-PO-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DPODATAITM-PO-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CHAINHD-DPOITEM-PO-I.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPOITEM-PO-REC-I.
           START DPOITEM-PO-I KEY = PORCVNO OF DPOITEM-PO-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
      *    IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
      *    REPLACED ABOVE LINE WITH THE FOLLOWING LINES AS DANVILLE
      *    SEEMED TO BE REPEATEDLY SENDING PO'S WITH NO ITEM SEGMENTS
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 99 TO COND-WORD
               ELSE
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DPOITEM-PO-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CHAINHD-DPORECD-PO-O.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPORECD-PO-REC-O.
           START DPORECD-PO-O KEY = PORCVNO OF DPORECD-PO-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DPORECD-PO-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CHAINHD-DVENDOR-VN-I.
           MOVE 0 TO COND-WORD.
           MOVE VEN-ARG TO VENCDE OF DVENDOR-VN-REC-I.
           START DVENDOR-VN-I KEY = VENCDE OF DVENDOR-VN-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DVENDOR-VN-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-DELETE-MPLTINFO-PK-O.
           MOVE 0 TO COND-WORD.
           DELETE MPLTINFO-PK-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "DELETE ERR 9999-DELETE-MPLTINFO-PK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

144400 COPY DLOCKCAL IN COPYLIB.
       9999-GETKEY-MBUYER-BY-I.
           MOVE 0 TO COND-WORD.
           MOVE BUYER-ARG TO BUYERCDE OF MBUYER-BY-REC-I.
           READ MBUYER-BY-I INTO BUF-MBUYER
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MBUYER-BY-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETKEY-MCOMMENT-MC-I.
           MOVE 0 TO COND-WORD.
           MOVE COMMENT-ARG TO MCOMCOMMNT OF MCOMMENT-MC-REC-I.
           READ MCOMMENT-MC-I INTO BUF-MCOMMENT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MCOMMENT-MC-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETKEY-MPLTINFO-PK-I.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-I.
           READ MPLTINFO-PK-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MPLTINFO-PK-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETKEY-MPLTINFO-PK-O.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-O.
           READ MPLTINFO-PK-O INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MPLTINFO-PK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-RESET-MPLTINFO-PK-O.
           MOVE HIGH-VALUES TO PLTINFOKEY OF MPLTINFO-PK-REC-O.
           START MPLTINFO-PK-O KEY > PLTINFOKEY OF MPLTINFO-PK-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-GETKEY-MTAX-TX-I.
           MOVE 0 TO COND-WORD.
           MOVE TAX-ARG TO TAXCDE OF MTAX-TX-REC-I.
           READ MTAX-TX-I INTO BUF-MTAX
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MTAX-TX-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETKEY-MVALIDUM-UM-I.
           MOVE 0 TO COND-WORD.
           MOVE UM-ARG TO VALIDUM OF MVALIDUM-UM-REC-I.
           READ MVALIDUM-UM-I INTO BUF-MVALIDUM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MVALIDUM-UM-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DCOMMENT-MC-I.
           MOVE 0 TO COND-WORD.
           READ DCOMMENT-MC-I NEXT INTO BUF-DCOMMENT
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DCOMMENT-MC-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF MCOMCOMMNT OF DCOMMENT-MC-REC-I NOT = COMMENT-ARG
               MOVE 15 TO COND-WORD.

       9999-GETNEXT-DEDILOG-LK-O.
           MOVE 0 TO COND-WORD.
           READ DEDILOG-LK-O NEXT INTO BUF-DEDILOG
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DEDILOG-LK-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DEDILOG-LK-O"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF EDILOGKEY OF DEDILOG-LK-REC-O NOT = PO-ARG
               PERFORM 9999-RESET-DEDILOG-LK-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DEDILOG-LK-O.
           MOVE HIGH-VALUES TO EDILOGKEY OF DEDILOG-LK-REC-O.
           START DEDILOG-LK-O KEY > EDILOGKEY OF DEDILOG-LK-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-GETNEXT-DPODATAITM-PO-I.
           MOVE 0 TO COND-WORD.
           READ DPODATAITM-PO-I NEXT INTO BUF-DPODATAITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DPODATAITM-PO-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF PORCVNO OF DPODATAITM-PO-REC-I NOT = PO-ARG
               MOVE 15 TO COND-WORD.

       9999-GETNEXT-DPOITEM-PO-I.
           MOVE 0 TO COND-WORD.
           READ DPOITEM-PO-I NEXT INTO BUF-DPOITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DPOITEM-PO-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF PORCVNO OF DPOITEM-PO-REC-I NOT = PO-ARG
               MOVE 15 TO COND-WORD.

       9999-GETNEXT-DPORECD-PO-O.
           MOVE 0 TO COND-WORD.
           READ DPORECD-PO-O NEXT INTO BUF-DPORECD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DPORECD-PO-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DPORECD-PO-O"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF PORCVNO OF DPORECD-PO-REC-O NOT = PO-ARG
               PERFORM 9999-RESET-DPORECD-PO-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DPORECD-PO-O.
           MOVE HIGH-VALUES TO PORCVNO OF DPORECD-PO-REC-O.
           START DPORECD-PO-O KEY > PORCVNO OF DPORECD-PO-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-GETNEXT-DVENDOR-VN-I.
           MOVE 0 TO COND-WORD.
           READ DVENDOR-VN-I NEXT INTO BUF-DVENDOR
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DVENDOR-VN-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF VENCDE OF DVENDOR-VN-REC-I NOT = VEN-ARG
               MOVE 15 TO COND-WORD
           ELSE
           IF VEN-ITM-NO = 8
               MOVE VEN-EDI-FLAGS TO SAVE-EDI-FLAGS.

       9999-GETSER-DEDILOG-LK-O.
           MOVE 0 TO COND-WORD.
           READ DEDILOG-LK-O NEXT INTO BUF-DEDILOG
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETSER ERR 9999-GETSER-DEDILOG-LK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-BEGFIL-DEDILOG-LK-O.
           MOVE SPACES TO EDILOGKEY OF DEDILOG-LK-REC-O.
           START DEDILOG-LK-O KEY >= EDILOGKEY OF DEDILOG-LK-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

145700 COPY MLOCKCAL IN COPYLIB.
       9999-PUT-MPLTINFO-PK-O.
           MOVE 0 TO COND-WORD.
           WRITE MPLTINFO-PK-REC-O FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-MPLTINFO-PK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

145900 COPY UNLOCK   IN COPYLIB.
       9999-UPDATE-MPLTINFO-PK-O.
           MOVE 0 TO COND-WORD.
           REWRITE MPLTINFO-PK-REC-O FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "UPDATE ERR 9999-UPDATE-MPLTINFO-PK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-UPDATE-DEDILOG-LK-O.
           MOVE 0 TO COND-WORD.
           REWRITE DEDILOG-LK-REC-O FROM BUF-DEDILOG
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "UPDATE ERR 9999-UPDATE-DEDILOG-LK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-UPDATE-DPORECD-PO-O.
           MOVE 0 TO COND-WORD.
           REWRITE DPORECD-PO-REC-O FROM BUF-DPORECD
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "UPDATE ERR 9999-UPDATE-DPORECD-PO-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

146300
146600 8-WRITE-POINFO.
146700     MOVE 1 TO ACT-KEY.
146800     PERFORM 8-WP-CONT THRU 8-WP-X.
146900 8-WP-CONT.
147000     RETURN SORT-FILE AT END GO TO 8-WP-X.
147100     MOVE SPACES TO OUTF.
147200     MOVE SORTF TO OUTF.
147300     WRITE OUTF    INVALID KEY GO TO 8-WP-X.
147400     ADD 1 TO ACT-KEY.
147500     GO TO 8-WP-CONT.
147600 8-WP-X.    EXIT.
