000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.     SEDIPOLG.
000400 DATE-WRITTEN.   APR 24, 1990.
000500 DATE-COMPILED.
000600 INSTALLATION.   THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
000700*REMARKS.
000800**************************************************************
000900*                                                            *
001000*    SEDIPOLG                EDI LOG SUBPROGRAM              *
001100*                                                            *
001200*     THIS PROGRAM IS USED TO WRITE AN EDI LOG               *
001300*     ENTRY TO DEDILOG DATASET IN STORES                     *
001400*     DATABASE. IT IS CALLED BY ALL PROGRAMS                 *
001500*     THAT INTERFACE TO EDI TRANSACTIONS.                    *
001600*                                                            *
001700**************************************************************
      *C*                                                          *
      *C*  06/18/1996    CA YODER                                  *
      *C*    MODIFIED FOR CENTURY DATABASE CHANGES.                *
      *C*                                                          *
      **************************************************************
001800
001900 ENVIRONMENT DIVISION.
002000 CONFIGURATION SECTION.
002100 SOURCE-COMPUTER.  IBM-AS400.
002200 OBJECT-COMPUTER.  IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT DEDILOG-PK-O
                ASSIGN TO DATABASE-MCFLCS4801
                ORGANIZATION IS INDEXED
                ACCESS MODE IS DYNAMIC
                RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                FILE STATUS IS FILE-STATUS.

            SELECT MPLTINFO-PK-O
                ASSIGN TO DATABASE-MCFLCS0501
                ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                FILE STATUS IS FILE-STATUS.
002300
002400 DATA DIVISION.
       FILE SECTION.
       FD  DEDILOG-PK-O
           LABEL RECORDS ARE STANDARD.
       01  DEDILOG-LK-REC-O.
           COPY DDS-MCRPCS4800 OF MCFLCS4801.

       FD  MPLTINFO-PK-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-PK-REC-O.
           COPY DDS-MCRPCS0500 OF MCFLCS0501.
002500
002600 WORKING-STORAGE SECTION.
002700
002800 77  HANDLE-BLOWUP-FLAG           PIC X(1)  VALUE "Y".
002900 77  PASSED-SPOOL-PRT             PIC S9(2) COMP VALUE 0.
       77  SAVE-EDI-SEND-BLKTS          PIC X.

       01  CUR-DATE-CN.
           05  CUR-DATE-CC              PIC X(2).
           05  CUR-DATE.
               10  CUR-YY               PIC X(2).
               10  CUR-MM               PIC X(2).
               10  CUR-DD               PIC X(2).
       01  CUR-TIME                     PIC X(6).
003000*************************************************************
003100*************************************************************
003200**                                                         **
003300**              D A T A    B A S E    A R E A              **
003400**                                                         **
003500*************************************************************
003600*******************************************************************
003700
003800 COPY DEDILOG    IN COPYLIB.
003900
004000 COPY MPLTINFO   IN COPYLIB.
004100
004200 01  DSET-NAMES.
004300     05  DSET-NAME                PIC X(16)  VALUE SPACES.
004400     05  DSET-MPLTINFO            PIC X(16)  VALUE "MPLTINFO;".
004500     05  DSET-DEDILOG             PIC X(16)  VALUE "DEDILOG;".
004600
004700 01  ARG-VALUES.
004800     05  MPLTINFO-ARG             PIC X(4)   VALUE SPACES.
004900     05  PLT-ARG                  PIC X(4)   VALUE SPACES.
005000     05  DEDILOG-ARG              PIC X(16)  VALUE SPACES.
005100
005200 01  SEARCH-ITEMS.
005300     05  ALL-ITEMS                PIC X(2)  VALUE "@;".
005400     05  MPLTINFO-SEARCH-ITEM     PIC X(16) VALUE "PLTINFO-KEY;".
005500     05  DEDILOG-SEARCH-ITEM      PIC X(16) VALUE "LOG-KEY;".
005600
005700 01  DB-LOG-VALUES.
005800     05  DB-LOG-TEXT              PIC X(8)  VALUE "SEDIPOLG".
005900     05  DB-LOG-TEXT-LEN          PIC S9(4) COMP  VALUE -8.
006000
       01  FILE-STATUS                  PIC XX.

006100 01  MESSAGE-BUFLEN               PIC S9(4) COMP VALUE 78.
006200 01  MSG-ACTUALEN                 PIC S9(4) COMP VALUE 78.
006300 01  FIELD-NUMBER                 PIC S9(4) COMP VALUE 1.
006400
006500 01  MESSAGE-BUFFER.
006600     05  MSG-TEXT                 PIC X(66)  VALUE SPACES.
006700     05  MSG-FLD                  PIC X(12)  VALUE SPACES.
006800
006900 COPY DBMODES    IN COPYLIB.
007000
007100 COPY DBSTAT     IN COPYLIB.
007200
007300 COPY MULTLOCK   IN COPYLIB.
007400
007500*************************************************************
007600*************************************************************
007700**                                                         **
007800**                 TERMINAL I/O DATA AREA                  **
007900**                                                         **
008000*************************************************************
008100*************************************************************

       COPY CATREAD  IN COPYLIB.
008200
008300 COPY FUNCTDEF IN COPYLIB.
008400
008500*************************************************************
008600*************************************************************
008700**                                                         **
008800**                 COMMUNICATIONS AREAS                    **
008900**                                                         **
009000*************************************************************
009100*************************************************************
009200
009300 COPY TBLOWUP    IN COPYLIB.
009400
009500 COPY VCOMLINK   IN COPYLIB.
009600
009700*************************************************************
009800*************************************************************
009900**                                                         **
010000**               LINKAGE   SECTION                         **
010100**                                                         **
010200*************************************************************
010300*************************************************************
010400
010500 LINKAGE SECTION.
010600
010700 01  BASE                          PIC X(10).
010800
       COPY SEDIPOLG IN COPYLIB.

012100 COPY LANGSUB  IN COPYLIB.
012200
012300*************************************************************
012400**#########################################################**
012500*************************************************************
012600**                                                         **
012700**          P R O C E D U R E    D I V I S I O N           **
012800**                                                         **
012900*************************************************************
013000**#########################################################**
013100*************************************************************
013200
013300 PROCEDURE DIVISION USING BASE,
013400                          SEDIPOLG-PARMS,
013500                          LANGUAGE-PARMS.
013600
013700 0-SEDIPOLG-SEC SECTION 1.
013800
013900 0-BEGIN-HERE.
014000     PERFORM 1-HSK.
014100     PERFORM 6-MAIN THRU 6-MAIN-X.
           CLOSE DEDILOG-PK-O MPLTINFO-PK-O.
014200     GOBACK.
014300
014400 1-HSK.
014500     MOVE "SEDIPOLG" TO BU-PGM-NAME.
           OPEN I-O   DEDILOG-PK-O.
           OPEN I-O   MPLTINFO-PK-O.
014600
014700******************************************************
014800**                 BLOWUP ROUTINE                   **
014900******************************************************
015000
015100 2100-BLOWUP.
015200     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
015300           VIEW-COMAREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
015400           BU-DISPLAY-AREA.
015500
015600**************************************************
015700*                                                *
015800*                  6 - M A I N                   *
015900*                                                *
016000**************************************************
016100 6-MAIN.
016200     MOVE SPACES             TO  BUF-MPLTINFO.
016400     MOVE DSET-MPLTINFO      TO  DSET-NAME-1.
016500     MOVE MPLTINFO-ARG       TO  LOCK-VALUE-1.
016600     MOVE DSET-DEDILOG       TO  DSET-NAME-2.
           MOVE "EDI "             TO  MPLTINFO-ARG, PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-O.
           MOVE EDI-SEND-BLKTS     TO  SAVE-EDI-SEND-BLKTS.
           IF SAVE-EDI-SEND-BLKTS = "N"
               IF PO-NUMBER-EDI-REL = "999"
                   GO TO 6-MAIN-X.
016300     MOVE "EPOR"             TO  MPLTINFO-ARG, PLT-ARG.
016700     PERFORM 9999-MULTI-LOCK.
016800     PERFORM 9999-GETKEY-MPLTINFO-PK-O.
016900     PERFORM 61-WRITE-DEDILOG THRU 61-WD-X.
017000     PERFORM 9999-UPDATE-MPLTINFO-PK-O.
017100     PERFORM 9999-UNLOCK.
017200 6-MAIN-X.
017300     EXIT.
017400
017500 61-WRITE-DEDILOG.
017600     MOVE SPACES TO BUF-DEDILOG.
017700     ADD 1                    TO MPLTINFO-LOG-REC-NO.
017800     MOVE MPLTINFO-LOG-REC-NO TO LOG-RECORD-NO.
017900     MOVE "PO"                TO LOG-TYPE.
018000     MOVE PO-NUMBER-EDI       TO LOG-KEY.
           ACCEPT CUR-DATE FROM DATE.
      *--------- ACCOUNT FOR CENTURY.
           IF CUR-YY > "70"
               MOVE "19"            TO CUR-DATE-CC
           ELSE
               MOVE "20"            TO CUR-DATE-CC.
           MOVE CUR-DATE-CN         TO LOG-INIT-DATE-CN.
           ACCEPT CUR-TIME FROM TIME.
           MOVE CUR-TIME            TO LOG-INIT-TIME.
018100     MOVE VENDOR-CODE-EDI     TO LOG-VENDOR.
018200     MOVE FLAGS-EDI           TO LOG-FLAGS.
018300     MOVE PO-ITEM-NO-EDI      TO LOG-ITEM-NO.
018400     MOVE CALLING-PGM-EDI     TO LOG-PGM-NAME.
018500     PERFORM 9999-PUT-DEDILOG-LK-O.
018600 61-WD-X.    EXIT.
018700
018800*********************************************************
018900 999-CATREAD.
            IF CATREAD-MSG-NUMBER = ZEROES
                MOVE LANG-SETNUM TO CATREAD-MSG-SET
                MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
            MOVE SPACES TO MESSAGE-BUFFER.
            CALL "CCATREAD" USING CATREAD-PARMS.
            MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
020600 999-CATREAD-EXIT.
020700     EXIT.
020800
       9999-GETKEY-MPLTINFO-PK-O.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-O.
           READ MPLTINFO-PK-O INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MPLTINFO-PK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-RESET-MPLTINFO-PK-O.
           MOVE HIGH-VALUES TO PLTINFOKEY OF MPLTINFO-PK-REC-O.
           START MPLTINFO-PK-O KEY > PLTINFOKEY OF MPLTINFO-PK-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-PUT-MPLTINFO-PK-O.
           MOVE 0 TO COND-WORD.
           WRITE MPLTINFO-PK-REC-O FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-MPLTINFO-PK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-PUT-DEDILOG-LK-O.
           MOVE 0 TO COND-WORD.
           WRITE DEDILOG-LK-REC-O FROM BUF-DEDILOG
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-DEDILOG-LK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

021200 COPY MLOCKCAL IN COPYLIB.
021300 COPY UNLOCK   IN COPYLIB.
021400 COPY DLOCKCAL IN COPYLIB.
       9999-UPDATE-MPLTINFO-PK-O.
           MOVE 0 TO COND-WORD.
           REWRITE MPLTINFO-PK-REC-O FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "UPDATE ERR 9999-UPDATE-MPLTINFO-PK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

