       IDENTIFICATION DIVISION.
       PROGRAM-ID.             SEQPWOIQ.
       AUTHOR.                 J.S. BUNGO.
       INSTALLATION.  GOODYEAR TIRE & RUBBER CO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        HP-3000.
       OBJECT-COMPUTER.        HP-3000.
       SPECIAL-NAMES.          I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZPMMAINT-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.
           SELECT WO-PLANNED
                  ASSIGN TO DATABASE-MCFLMM1103
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STAT.
           SELECT OUT-FILE
                  ASSIGN TO DISK-EQPWOIQ
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE IS DYNAMIC
                  RELATIVE KEY IS ACT-KEY
                  FILE STATUS IS FILE-STAT.
           SELECT SORT-FILE
                  ASSIGN TO DISK-SORTFILE.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).
       FD  WO-PLANNED
           LABEL RECORDS ARE STANDARD.
       01  WO-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1103.
       FD  OUT-FILE RECORD CONTAINS 62 CHARACTERS
           LABEL RECORDS ARE OMITTED
           DATA RECORD IS OUT-REC.
       01  OUT-REC.
           05  OUT-WO-NUM.
               10  OUT-WO      PIC X(7).
               10  OUT-WO-SUF  PIC X(3).
           05  OUT-STATUS      PIC X(02).
           05  OUT-DESCRIPT    PIC X(30).
           05  OUT-JOBP        PIC X(10).
           05  OUT-SCHED       PIC X(10).

       SD  SORT-FILE RECORD CONTAINS 62 CHARACTERS
           DATA RECORD IS SORT-REC.
       01  SORT-REC.
           05  SORT-WO         PIC X(10).
           05  SORT-STATUS     PIC X(02).
           05  SORT-DESCRIPT   PIC X(30).
           05  SORT-JOBP       PIC X(10).
           05  SORT-SCHED      PIC X(10).

       WORKING-STORAGE SECTION.
       77  SUB                       PIC 9(04) VALUE 0.
       77  HELP-SW                   PIC 9(04) VALUE 0.
       77  EOF-SW                    PIC 9(4) VALUE 0.
       77  ACT-KEY                   PIC 9(8).
       77  MAX-KEY                   PIC 9(8).
       77  SAVE-KEY                  PIC 9(8).
       77  PAGE-KEY                  PIC 9(8).

       01  DISPLAY-STATUS          PIC X(02).
       01  SRF-INDICATORS.
           05  IND OCCURS 99 TIMES PIC 1 INDICATOR 01.
       01  WS-CONTROL.
           05  FUNCTION-NUM        PIC X(02).
           05  TERMINAL-ID         PIC X(10).
           05  FORMAT-NAME         PIC X(10).
       01  FILE-STAT               PIC X(02).

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "SEQPWOIQ".
           05  PROGRAM-TYPE        PIC X(02) VALUE "IN".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " G0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A     PIC X(60) VALUE
         "DISPLAYS A LIST OF WORKORDERS FOR A GIVEN PIECE OF EQUIPMENT".
               10  PROG-DESC-B     PIC X(60) VALUE SPACES.
               10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
           05  PASSWORD-FLAG       PIC X.

       01  SCREEN-BUFFER.
           05  EQUIP-BUF       PIC X(06).
           05  SCREEN-LINE OCCURS 15 TIMES.
               10  SELECT-BUF   PIC X(01).
               10  WO-BUF       PIC X(10).
               10  STATUS-BUF   PIC X(02).
               10  DESCRIPT-BUF PIC X(30).
               10  JOBP-BUF     PIC X(10).
               10  SCHED-BUF    PIC X(10).
           05  CMDMSG           PIC X(79).
           05  ERRMSG           PIC X(79).

       01  DB-ERROR.
           05  DB-TYPE   PIC X(08) VALUE SPACES.
           05  FILLER    PIC X(21) VALUE " ERROR - COND-WORD = ".
           05  CON-WORD  PIC -9999.

       01  SCREEN-PRINT-PARMS.
           05  PRINTCNTL              PIC S9(4)  VALUE ZERO  COMP.
           05  PAGECNTL               PIC S9(4)  VALUE 49    COMP.
           05  SPOOLFIL-OPEN-SW       PIC X      VALUE "N".
       01  PASSED-SPOOL-PRT           PIC S9(2)              COMP.
       01  FATAL-ERR-SW               PIC X.
       01  BU-DISPLAY-AREA.
           05  FILLER                 PIC XX.
           05  BU-DISPLAY-MSG         PIC X(27).
           05  FILLER                 PIC XX.
           05  BU-DISPLAY-STAT        PIC S9(4).
           05  FILLER                 PIC XX.
           05  BU-DISPLAY-FLD         PIC X(14).
           05  FILLER                 PIC XX.

       COPY CATREAD    IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.
       01  WO-PLANNED-DATA.      COPY DWOPLAN  IN COPYLIB.
       COPY DBSTAT   IN COPYLIB.
       01  MESSAGE-FILE-DATA.    COPY ERRORLIN IN COPYLIB.

       LINKAGE SECTION.
       COPY VCOMLINK   IN COPYLIB.
       01  DBPARAMETERS.         COPY DBPARMS  IN COPYLIB.
       COPY LANGSUB    IN COPYLIB.
       01  EQUIP-KEY                  PIC X(06).
       01  SEL-WO                     PIC X(10).
       01  MESSAGE-BUF                PIC X(79).

       PROCEDURE DIVISION USING VIEW-COMAREA,
                                DBPARAMETERS,
                                LANGUAGE-PARMS
                                EQUIP-KEY
                                SEL-WO
                                MESSAGE-BUF.
       BEGIN-SORT SECTION 01.

       BEGIN-PROC.
           CALL "CLEQPWOIQ".
           PERFORM HSK THRU HSK-EXIT.
           GO TO MAIN.

       HSK.
           OPEN INPUT          WO-PLANNED.
           OPEN I-O            DISPLAY-FILE.
           MOVE SPACES         TO SCREEN-BUFFER MESSAGE-BUFFER.
       HSK-EXIT.
           EXIT.

       END-OF-JOB.
           CLOSE               WO-PLANNED
                               DISPLAY-FILE.
           GOBACK.

       MAIN.
           MOVE 0              TO ACT-KEY.
           OPEN OUTPUT OUT-FILE.
           SORT SORT-FILE ASCENDING KEY SORT-WO
               INPUT  PROCEDURE SORTIN-WOEQP-INQ
               OUTPUT PROCEDURE SORTOUT-WOEQP-INQ.
           CLOSE OUT-FILE.

           IF ACT-KEY = 0
      **********************************************************************
      **    MESSAGE 040/011:
      ** NO RECORDS FOUND WHICH MATCH YOUR SELECTION
      **********************************************************************
               MOVE  40        TO LANG-SETNUM
               MOVE  11        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE CATREAD-MSG-TEXT TO MESSAGE-BUF
               MOVE SPACES TO SEL-WO
               GO TO END-OF-JOB.

           OPEN I-O OUT-FILE.
           MOVE 0              TO ACT-KEY.
           MOVE 0              TO PAGE-KEY.
           MOVE "VEQPWOIQ"     TO VIEW-NFNAME.
           MOVE 541            TO HELP-SW.

       RESET-SCREEN.
           MOVE SPACES         TO SCREEN-BUFFER MESSAGE-BUFFER.
           PERFORM FILL-SCREEN THRU FS-EXIT.

       SHOWFORM.
           MOVE SCREEN-BUFFER TO DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               CLOSE OUT-FILE
               GO TO END-OF-JOB.
           MOVE ALL B"0" TO SRF-INDICATORS.

           READ DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 2 TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.

           IF VIEW-LASTKEY = 3 OR 8
               CLOSE OUT-FILE
               GO TO END-OF-JOB.

           IF VIEW-LASTKEY = 2
               IF ACT-KEY NOT > 15
                   GO TO SHOWFORM
               ELSE
                   COMPUTE ACT-KEY = ACT-KEY - PAGE-KEY - 15
                   MOVE 0 TO EOF-SW
                   GO TO RESET-SCREEN.

           IF VIEW-LASTKEY = 4
               IF EOF-SW = 1
                   GO TO SHOWFORM
               ELSE
                   GO TO RESET-SCREEN.

           IF VIEW-LASTKEY = 7
               CALL "SPMHELPM" USING HELP-SW
               GO TO SHOWFORM.


           IF VIEW-LASTKEY NOT = 0
               GO TO SHOWFORM.

           MOVE DISPLAY-REC TO SCREEN-BUFFER.

           PERFORM CHECK-FOR-SELECTION THRU CHECK-FOR-SELECTION-EXIT.
           IF SEL-WO NOT = SPACES
               CLOSE OUT-FILE
               GO TO END-OF-JOB
           ELSE
               GO TO SHOWFORM.

       CHECK-FOR-SELECTION.
           MOVE 0 TO SUB.
           MOVE SPACES TO SEL-WO.
           PERFORM CHECK-SELECTION-LOOP UNTIL SUB = 15 OR
                                              SEL-WO NOT = SPACES.
       CHECK-FOR-SELECTION-EXIT.
           EXIT.

       CHECK-SELECTION-LOOP.
           ADD 1 TO SUB.
           IF SELECT-BUF (SUB) NOT = SPACES
               IF WO-BUF (SUB) NOT = SPACES
                   MOVE WO-BUF (SUB) TO SEL-WO.

       FILL-SCREEN.
           MOVE EQUIP-KEY      TO EQUIP-BUF.
           MOVE 0              TO SUB.
           PERFORM FILL-LINE THRU FL-EXIT UNTIL SUB = 15.
           MOVE ACT-KEY        TO SAVE-KEY.

       FS-EXIT.    EXIT.

       FILL-LINE.
           ADD 1               TO ACT-KEY SUB.

           MOVE SPACES         TO OUT-REC.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               MOVE 15         TO SUB
               GO TO FL-EXIT.

           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               MOVE 15         TO SUB
               SUBTRACT 1 FROM ACT-KEY
               GO TO FL-EXIT.

           MOVE OUT-WO-NUM     TO WO-BUF (SUB).
           MOVE OUT-STATUS     TO STATUS-BUF (SUB).
           MOVE OUT-DESCRIPT   TO DESCRIPT-BUF (SUB).
           MOVE OUT-JOBP       TO JOBP-BUF (SUB).
           MOVE OUT-SCHED      TO SCHED-BUF (SUB).

       FL-EXIT.    EXIT.


       SET-ERROR.
           MOVE B"1" TO IND (FIELD-NUMBER)  IND (99).

       999-CATREAD.
           MOVE SPACES         TO CATREAD-MSG-TEXT.
           MOVE LANG-SETNUM    TO CATREAD-MSG-SET.
           MOVE LANG-MSGNUM    TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           IF CATREAD-MSG-NOT-FOUND
               MOVE "***ERROR MSG NOT FOUND***" TO CATREAD-MSG-TEXT.

       999-CATREAD-EXIT.    EXIT.

       SORTIN-WOEQP-INQ SECTION.
           PERFORM SORT-MAIN THRU SORT-M-EXIT
           GO TO SORT-IP-EXIT.

       SORT-MAIN.
           MOVE EQUIP-KEY TO EQPNUM OF WO-PLANNED.
           START WO-PLANNED KEY = EQPNUM OF WO-PLANNED
               INVALID KEY MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO SORT-M-EXIT.

       SORT-DBGET.
           MOVE SPACES         TO SORT-REC.
           READ WO-PLANNED NEXT INTO WO-PLANNED-DATA
               AT END MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "10" OR "14" OR "46"
               GO TO SORT-M-EXIT
           ELSE
           IF FILE-STAT NOT = "00"
               MOVE "DBGET   " TO DB-TYPE
               MOVE COND-WORD  TO CON-WORD
               MOVE DB-ERROR   TO MESSAGE-BUFFER
               MOVE 1          TO FIELD-NUMBER
               PERFORM SET-ERROR
               GO TO SORT-M-EXIT.
           IF EQUIP-NUM-P NOT = EQUIP-KEY
               GO TO SORT-M-EXIT.
           IF WO-NUM-SUFF-P NOT = "000"
               GO TO SORT-DBGET.
           IF WO-START-STATUS NOT = "AA"
               GO TO SORT-DBGET.

           MOVE WO-NUM-PLANNED   TO SORT-WO.
           MOVE APPROVAL-CODE-P  TO SORT-STATUS.
           MOVE DESCRIPTION-1-P  TO SORT-DESCRIPT.
           MOVE PM-JOBPLAN-KEY   TO SORT-JOBP.
           MOVE PM-SCHEDULE-KEY  TO SORT-SCHED.

           RELEASE SORT-REC.
           GO TO SORT-DBGET.

       SORT-M-EXIT.    EXIT.

       SORT-IP-EXIT.    EXIT.

       SORTOUT-WOEQP-INQ SECTION.
           RETURN SORT-FILE AT END
               MOVE ACT-KEY    TO MAX-KEY
               GO TO SORT-WF-EXIT.
           ADD 1               TO ACT-KEY.
           MOVE SORT-REC       TO OUT-REC.
           WRITE OUT-REC INVALID KEY
               DISPLAY "WRITE OUT-FILE ERR"
               GO TO SORT-WF-EXIT.
           GO TO SORTOUT-WOEQP-INQ.

       SORT-WF-EXIT.    EXIT.
