       IDENTIFICATION DIVISION.
       PROGRAM-ID.             SEQTCPY.
       AUTHOR.                 P.D. RAGLOW.
       INSTALLATION.           GOODYEAR TIRE AND RUBBER CO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.

       COPY SPECIALN           IN COPYLIB.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT WO-EQUIP-H-HK-I
                  ASSIGN       TO DATABASE-MCFLMM1701
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STATUS.

           SELECT TYPE-REF-TS-I
                  ASSIGN       TO DATABASE-MCFLER0201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STATUS.

           SELECT TYPE-REM-TS-I
                  ASSIGN       TO DATABASE-MCFLER0401
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STATUS.

           SELECT TYPE-OPS-TS-I
                  ASSIGN       TO DATABASE-MCFLER0601
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STATUS.

           SELECT DRAWING-FL-TN-I
                  ASSIGN       TO DATABASE-MCFLDF0104
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STATUS.

           SELECT CC-LINK-HK-I
                  ASSIGN       TO DATABASE-MCFLMM2101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STATUS.

           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZEQRCOPY-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DISPLAY-STATUS
               CONTROL-AREA IS WS-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  WO-EQUIP-H-HK-I
           LABEL RECORDS ARE STANDARD.
        1  WO-EQUIP-H-HK-REC-I.
           COPY DDS-MCRPMM1700  OF MCFLMM1701.

       FD  TYPE-REF-TS-I
           LABEL RECORDS ARE STANDARD.
       01  TYPE-REF-TS-REC-I.
           COPY DDS-MCRPER0200  OF MCFLER0201.

       FD  TYPE-REM-TS-I
           LABEL RECORDS ARE STANDARD.
       01  TYPE-REM-TS-REC-I.
           COPY DDS-MCRPER0400  OF MCFLER0401.

       FD  TYPE-OPS-TS-I
           LABEL RECORDS ARE STANDARD.
       01  TYPE-OPS-TS-REC-I.
           COPY DDS-MCRPER0600  OF MCFLER0601.

       FD  DRAWING-FL-TN-I
           LABEL RECORDS ARE STANDARD.
       01  DRAWING-FL-TN-REC-I.
           COPY DDS-MCRPDF0100  OF MCFLDF0104.

       FD  CC-LINK-HK-I
           LABEL RECORDS ARE STANDARD.
       01  CC-LINK-HK-REC-I.
           COPY DDS-MCRPMM2100  OF MCFLMM2101.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                       PIC X(2000).

       WORKING-STORAGE SECTION.
       77  HANDLE-BLOWUP-FLAG                PIC X   VALUE "Y".
       77  CNTR1                             PIC 99  VALUE 00.
       77  PROCESS-ANYWAY                    PIC X   VALUE "N".
       77  SUB-HOLD                          PIC XXXX.
       77  SUBLVL-FOUND                      PIC X   VALUE "N".
       77  HIER-OPT                          PIC X.
       88  HIERARCHY-SUBS           VALUE "1".
       88  NON-HIERARCHY-SUBS       VALUE "2".

       COPY FILESTAT           IN COPYLIB.

       COPY CATREAD            IN COPYLIB.

       COPY TBLOWUP            IN COPYLIB.

       01  PASSWORD-MMISA         PIC X(7)  VALUE "DO-ALL;".
       01  PASSWORD-DRWFIL        PIC X(7)  VALUE "DO-ALL;".
       01  PASSWORD-EQPREF        PIC X(7)  VALUE "DO-ALL;".

       01  DSET-NAME              PIC X(16) VALUE SPACES.


       COPY DATAB              IN COPYLIB.

       01  ARGUMENTS  VALUE SPACES.
           05  HIER-KEY-ARG.
               10  HKA-TYPE       PIC X(8).
               10  HKA-SUB.
                   15  HKA-SUB1   PIC X.
                   15  HKA-SUB2   PIC X.
                   15  HKA-SUB3   PIC X.
                   15  HKA-SUB4   PIC X.
               10  FILLER         PIC XX.
           05  TYPE-SUB-ARG.
               10  TSA-TYPE       PIC X(8).
               10  TSA-SUB        PIC X(4).
           05  TYPE-NUM-ARG       PIC X(8).

       01  SEARCH-FIELDS.
           05  HIER-KEY-SEARCH    PIC X(16)  VALUE "HIER-KEY;".
           05  TYPE-SUB-SEARCH    PIC X(16)  VALUE "TYPE-SUB-KEY;".
           05  TYPE-NUM-SEARCH    PIC X(16)  VALUE "TYPE-NUM;".

       01  DATASET-NAMES.
           05  DSET-TYPE-REF      PIC X(16)  VALUE "TYPE-REFERENCE;".
           05  DSET-TYPE-REM      PIC X(16)  VALUE "TYPE-REMARKS;".
           05  DSET-TYPE-OPS      PIC X(16)  VALUE "TYPE-OPERATIONS;".
           05  DSET-DRAWING-FL    PIC X(16)  VALUE "DRAWING-FILE;".
           05  DSET-WO-EQUIP-H    PIC X(16)  VALUE "WO-EQUIP-HIER;".
           05  DSET-CC-LINK       PIC X(16)  VALUE "CORP-CODE-LINK;".

       01  ALL-ITEMS              PIC XX     VALUE "@;".

      *
      * SCREEN AREA
      *
       01  DE-FIELDS-1.
           05  DE-SCRN-1-OPTION          PIC X.
           05  DE-COMMAND-LINE-1         PIC X(79).
       01  DE-FIELDS-2 VALUE SPACES.
           05  DE2-EQP-REF-OPT           PIC X.
           05  DE2-DRW-FIL-OPT           PIC X.
           05  DE2-SPR-PRT-OPT           PIC X.
           05  DE2-HIER-LIT              PIC X(24).
           05  DE2-FROM-TYPE             PIC X(8).
           05  DE2-TO-TYPE               PIC X(8).
           05  DE2-SCRN-TABLE.
               10  FILLER    OCCURS 10 TIMES.
                   15  DE2-LVL-LINE.
                       20  DE2-FR-LVL        PIC XXXX.
                       20  DE2-FR-ERR        PIC XXX.
                       20  DE2-FR-DSC        PIC X(20).
                       20  DE2-TO-LVL        PIC XXXX.
                       20  DE2-TO-ERR        PIC XXX.
                       20  DE2-TO-DSC        PIC X(20).
           05  DE-MESSAGE-LINE-2-1       PIC X(79).
           05  DE-MESSAGE-LINE-2-2       PIC X(79).
           05  DE-COMMAND-LINE-2         PIC X(79).

       COPY CSTRMJB2           IN COPYLIB.

       COPY FUNCTDEF           IN COPYLIB.

       COPY IOFEEDBACK         IN COPYLIB.

       COPY TSHWRDFM           IN COPYLIB.

       COPY DISPDAT2           IN COPYLIB.

       COPY HMSGBUF            IN COPYLIB.

       COPY EQPHIER            IN COPYLIB.

       01  BUF-CORP-CODE.
       COPY DCCLINK            IN COPYLIB.

       01  BUF-DRAWING-FILE.
       COPY DDRAWFIL           IN COPYLIB.

       COPY MTYPEREF           IN COPYLIB.

       COPY DTYPEREM           IN COPYLIB.

       COPY DTYPEOPS           IN COPYLIB.

       LINKAGE SECTION.
       01  PASS-OPT            PIC X.
       01  PASS-PRT-FILE-NUM   PIC XX.
       01  MMISA               PIC X(24).
       01  EQPREF              PIC X(24).
       01  DRWFIL              PIC X(24).

       COPY VCOMLINK           IN COPYLIB.

       COPY LANGSUB            IN COPYLIB.

       PROCEDURE DIVISION USING PASS-OPT PASS-PRT-FILE-NUM
                                MMISA EQPREF DRWFIL
                                VIEW-COMAREA, LANGUAGE-PARMS.
       MAIN-LINE-LOGIC.
           PERFORM 9999-OPENS.
           MOVE "DO-ALL;"  TO PASSWORD.
           MOVE PASS-OPT   TO HIER-OPT.

           MOVE "REQRCPY10"  TO VIEW-NFNAME.
           PERFORM 9999-GETNEXTFORM.
           IF HIERARCHY-SUBS
             MOVE "  HIERACHY SUBSYSTEMS" TO DE2-HIER-LIT
           ELSE
             MOVE "NON-HIERACHY SUBSYSTEMS" TO DE2-HIER-LIT
           END-IF.
      ******"PRESS 'ENTER' TO PROCESS, OR F3 TO EXIT PROGRAM"****
           MOVE 16059 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD.
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE-2-1.
           MOVE SPACES         TO DE-MESSAGE-LINE-2-2.
           PERFORM 9999-DO-SCREEN-2.

           PERFORM UNTIL VIEW-LASTKEY EQUAL EXIT-PROGRAM

             MOVE SPACES TO DE2-FR-DSC(1)  DE2-TO-DSC(1)  DE2-TO-ERR(1)
                            DE2-FR-DSC(2)  DE2-TO-DSC(2)  DE2-TO-ERR(2)
                            DE2-FR-DSC(3)  DE2-TO-DSC(3)  DE2-TO-ERR(3)
                            DE2-FR-DSC(4)  DE2-TO-DSC(4)  DE2-TO-ERR(4)
                            DE2-FR-DSC(5)  DE2-TO-DSC(5)  DE2-TO-ERR(5)
                            DE2-FR-DSC(6)  DE2-TO-DSC(6)  DE2-TO-ERR(6)
                            DE2-FR-DSC(7)  DE2-TO-DSC(7)  DE2-TO-ERR(7)
                            DE2-FR-DSC(8)  DE2-TO-DSC(8)  DE2-TO-ERR(8)
                            DE2-FR-DSC(9)  DE2-TO-DSC(9)  DE2-TO-ERR(9)
                           DE2-FR-DSC(10) DE2-TO-DSC(10) DE2-TO-ERR(10)

             PERFORM 10-EDIT-ENTRIES-SCRN2
             IF SRF-ERROR-FLD = 0
               PERFORM 20-CHECK-AGAINST-HIERARCHY
               IF SRF-ERROR-FLD = 0
                 PERFORM 30-CHECK-DATABASE
                 IF PROCESS-ANYWAY = "Y"
                   PERFORM 40-PROCESS-COPY
                   MOVE SPACES TO DE2-SCRN-TABLE
                 END-IF
      ******"PRESS 'ENTER' TO PROCESS, OR F3 TO EXIT PROGRAM"****
                 MOVE 16059 TO CATREAD-MSG-NUMBER
                 PERFORM 999-CATREAD
                 MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE-2-1
                 MOVE SPACES         TO DE-MESSAGE-LINE-2-2
               END-IF
             END-IF

             MOVE "REQRCPY10" TO VIEW-NFNAME
             PERFORM 9999-GETNEXTFORM
             PERFORM 9999-DO-SCREEN-2

           END-PERFORM.

       END-PROCESSES.
           PERFORM 9999-CLOSES.
           GOBACK.

      ****************************************************************
      *PARAGRAPH NAME : 10-EDIT-ENTRIES-SCRN2                        *
      *PURPOSE : TO VERIFY THE SCREEN DATA WAS ENTERED PROPERLY      *
      ****************************************************************
       10-EDIT-ENTRIES-SCRN2.
           IF DE2-EQP-REF-OPT NOT = "Y" AND "N"
      ******"MUST ENTER 'Y' OR 'N'   "***********
             MOVE 18089 TO CATREAD-MSG-NUMBER
             PERFORM 999-CATREAD
             MOVE MESSAGE-BUFFER TO DE-COMMAND-LINE-2
             MOVE 1 TO SRF-ERROR-FLD
           ELSE
             IF DE2-DRW-FIL-OPT NOT = "Y" AND "N"
      ********"MUST ENTER 'Y' OR 'N'   "***********
               MOVE 18089 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD
               MOVE MESSAGE-BUFFER TO DE-COMMAND-LINE-2
               MOVE 2 TO SRF-ERROR-FLD
             ELSE
               IF DE2-SPR-PRT-OPT NOT = "Y" AND "N"
      ********"MUST ENTER 'Y' OR 'N'   "***********
                 MOVE 18089 TO CATREAD-MSG-NUMBER
                 PERFORM 999-CATREAD
                 MOVE MESSAGE-BUFFER TO DE-COMMAND-LINE-2
                 MOVE 3 TO SRF-ERROR-FLD
               ELSE
                 IF DE2-FROM-TYPE = SPACES
      ******"THIS IS A REQUIRED FIELD"***********
                   MOVE 20062 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD
                   MOVE MESSAGE-BUFFER TO DE-COMMAND-LINE-2
                   MOVE 5 TO SRF-ERROR-FLD
                 ELSE
                   IF DE2-TO-TYPE = SPACES
      ********"THIS IS A REQUIRED FIELD"***********
                     MOVE 20062 TO CATREAD-MSG-NUMBER
                     PERFORM 999-CATREAD
                     MOVE MESSAGE-BUFFER TO DE-COMMAND-LINE-2
                     MOVE 6 TO SRF-ERROR-FLD
                   ELSE
                     MOVE 1 TO CNTR1
                     PERFORM UNTIL CNTR1 IS GREATER THAN 10
                       IF (DE2-FR-LVL(CNTR1) = SPACES
                       AND DE2-TO-LVL(CNTR1) NOT = SPACES)
      ***"SUBSYSTEM MUST BE ENTERED ON BOTH 'FROM' AND 'TO' SIDES"***
                         MOVE 19041 TO CATREAD-MSG-NUMBER
                         PERFORM 999-CATREAD
                         MOVE MESSAGE-BUFFER TO DE-COMMAND-LINE-2
                         COMPUTE SRF-ERROR-FLD = (7 + 4 * (CNTR1 - 1))
                         MOVE 12 TO CNTR1
                       ELSE
                         IF (DE2-TO-LVL(CNTR1) = SPACES
                         AND DE2-FR-LVL(CNTR1) NOT = SPACES)
      ***"SUBSYSTEM MUST BE ENTERED ON BOTH 'FROM' AND 'TO' SIDES"***
                           MOVE 19041 TO CATREAD-MSG-NUMBER
                           PERFORM 999-CATREAD
                           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE-2-1
                          COMPUTE SRF-ERROR-FLD = (9 + 4 * (CNTR1 - 1))
                           MOVE 12 TO CNTR1
                         END-IF
                       END-IF
                       ADD 1 TO CNTR1
                     END-PERFORM
                   END-IF
                 END-IF
               END-IF
             END-IF
           END-IF.

      ****************************************************************
      *PARAGRAPH NAME : 20-CHECK-AGAINST-HIERARCHY.                  *
      *PURPOSE : TO VERIFY THE TYPES AND SUBSYSTEMS EXIST IN THE     *
      *          HIERARCHY.                                          *
      ****************************************************************
       20-CHECK-AGAINST-HIERARCHY.
           MOVE DE2-FROM-TYPE TO HKA-TYPE.
           MOVE "0000"        TO HKA-SUB.
           MOVE "  MMISA;" TO BASE.
           PERFORM 9999-CHAINHD-WO-EQUIP-H-HK-I.
           PERFORM 9999-GETNEXT-WO-EQUIP-H-HK-I.
           IF END-OF-CHAIN
      ***"TYPE NUMBER DOES NOT EXIST IN HIERARCHY"***
             MOVE 20068 TO CATREAD-MSG-NUMBER
             PERFORM 999-CATREAD
             MOVE MESSAGE-BUFFER TO DE-COMMAND-LINE-2
             MOVE 5 TO SRF-ERROR-FLD
           ELSE
             MOVE DE2-TO-TYPE TO HKA-TYPE
             MOVE "0000"        TO HKA-SUB
             PERFORM 9999-CHAINHD-WO-EQUIP-H-HK-I
             PERFORM 9999-GETNEXT-WO-EQUIP-H-HK-I
             IF NOT GOOD-CALL
      ***"TYPE NUMBER DOES NOT EXIST IN HIERARCHY"***
               MOVE 20068 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD
               MOVE MESSAGE-BUFFER TO DE-COMMAND-LINE-2
               MOVE 6 TO SRF-ERROR-FLD
             ELSE
               MOVE 1 TO CNTR1
               MOVE DE2-FROM-TYPE TO HKA-TYPE
               PERFORM UNTIL CNTR1 IS GREATER THAN 10
                          OR SRF-ERROR-FLD NOT = 0
                 IF DE2-FR-LVL(CNTR1) NOT = SPACES
                   MOVE DE2-FR-LVL(CNTR1) TO HKA-SUB SUB-HOLD
                   IF HIERARCHY-SUBS
                     PERFORM 21-CHK-SUBLVL-IN-HIERARCHY
                   ELSE
                     PERFORM 22-CHK-SUBLVL-NOT-IN-HIERARCHY
                   END-IF
                   IF SRF-ERROR-FLD = 0  AND HIERARCHY-SUBS
                     MOVE HIER-SUBS-NAME TO DE2-FR-DSC(CNTR1)
                   END-IF
                 END-IF
                 ADD 1 TO CNTR1
               END-PERFORM
               IF SRF-ERROR-FLD = 0
                 MOVE 1 TO CNTR1
                 MOVE DE2-TO-TYPE TO HKA-TYPE
                 PERFORM UNTIL CNTR1 IS GREATER THAN 10
                            OR SRF-ERROR-FLD NOT = 0
                   IF DE2-TO-LVL(CNTR1) NOT = SPACES
                     MOVE DE2-TO-LVL(CNTR1) TO HKA-SUB SUB-HOLD
                     IF HIERARCHY-SUBS
                       PERFORM 21-CHK-SUBLVL-IN-HIERARCHY
                     ELSE
                       PERFORM 22-CHK-SUBLVL-NOT-IN-HIERARCHY
                     END-IF
                     IF SRF-ERROR-FLD NOT = 0
                       ADD 2 TO SRF-ERROR-FLD
                     ELSE
                       IF HIERARCHY-SUBS
                         MOVE HIER-SUBS-NAME TO DE2-TO-DSC(CNTR1)
                       END-IF
                     END-IF
                   END-IF
                   ADD 1 TO CNTR1
                 END-PERFORM
               END-IF
             END-IF
           END-IF.

      ****************************************************************
      *PARAGRAPH NAME : 21-CHK-SUBLVL-IN-HIERARCHY.                  *
      *PURPOSE : TO VERIFY THE SUBSYSTEMS EXIST IN THE HIERARCHY     *
      ****************************************************************
       21-CHK-SUBLVL-IN-HIERARCHY.
           IF HKA-SUB4 NOT = "0"
             MOVE "0" TO HKA-SUB4
           ELSE
             IF HKA-SUB3 NOT = "0"
               MOVE "0" TO HKA-SUB3
             ELSE
               IF HKA-SUB2 NOT = "0"
                 MOVE "0" TO HKA-SUB2
               ELSE
                 IF HKA-SUB1 NOT = "0"
                   MOVE "0" TO HKA-SUB1
                 END-IF
               END-IF
             END-IF
           END-IF.
           PERFORM 9999-CHAINHD-WO-EQUIP-H-HK-I.
           PERFORM 9999-GETNEXT-WO-EQUIP-H-HK-I.
           IF END-OF-CHAIN
      ***"SUBSYSTEM DOES NOT EXIST IN HIERARCHY"***
             MOVE 19040 TO CATREAD-MSG-NUMBER
             PERFORM 999-CATREAD
             MOVE MESSAGE-BUFFER TO DE-COMMAND-LINE-2
             COMPUTE SRF-ERROR-FLD = 7 + 4 * (CNTR1 - 1)
           ELSE
             MOVE "N" TO SUBLVL-FOUND
             PERFORM UNTIL END-OF-CHAIN OR SUBLVL-FOUND = "Y"
               IF HIER-DISP-CODE = SUB-HOLD OR SUB-HOLD = "0000"
                 MOVE "Y" TO SUBLVL-FOUND
               ELSE
                 PERFORM 9999-GETNEXT-WO-EQUIP-H-HK-I
                 IF END-OF-CHAIN
      ***"SUBSYSTEM DOES NOT EXIST IN HIERARCHY"***
                   MOVE 19040 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD
                   MOVE MESSAGE-BUFFER TO DE-COMMAND-LINE-2
                   COMPUTE SRF-ERROR-FLD = 7 + 4 * (CNTR1 - 1)
                 END-IF
               END-IF
             END-PERFORM
           END-IF.

      ****************************************************************
      * PARAGRAPH : 2100-BLOWUP                                      *
      * PURPOSE   : TO LOG ERROR MESSAGE AND ABORT PROGRAM           *
      ****************************************************************
       2100-BLOWUP.
           MOVE "TEQTHCPY" TO BU-PGM-NAME.
           MOVE VIEW-NFNAME TO BU-DISPLAY-FLD (1).
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
                 VIEW-COMAREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
                 BU-DISPLAY-FLDS.


      ****************************************************************
      *PARAGRAPH NAME : 22-CHK-SUBLVL-NOT-IN-HIERARCHY.              *
      *PURPOSE : TO VERIFY THE SUBSYSTEMS DO NOT EXIST IN HIERARCHY  *
      ****************************************************************
       22-CHK-SUBLVL-NOT-IN-HIERARCHY.
           IF HKA-SUB4 NOT = "0"
             MOVE "0" TO HKA-SUB4
           ELSE
             IF HKA-SUB3 NOT = "0"
               MOVE "0" TO HKA-SUB3
             ELSE
               IF HKA-SUB2 NOT = "0"
                 MOVE "0" TO HKA-SUB2
               ELSE
                 IF HKA-SUB1 NOT = "0"
                   MOVE "0" TO HKA-SUB1
                 END-IF
               END-IF
             END-IF
           END-IF.
           PERFORM 9999-CHAINHD-WO-EQUIP-H-HK-I.
           PERFORM 9999-GETNEXT-WO-EQUIP-H-HK-I.
           IF NOT END-OF-CHAIN
             MOVE "N" TO SUBLVL-FOUND
             PERFORM UNTIL END-OF-CHAIN OR SUBLVL-FOUND = "Y"
               IF HIER-DISP-CODE = SUB-HOLD
                 MOVE "Y" TO SUBLVL-FOUND
      ***"SUBSYSTEM EXISTS IN HIERARCHY, NOT ALLOWED HERE"***
                 MOVE 19042 TO CATREAD-MSG-NUMBER
                 PERFORM 999-CATREAD
                 MOVE MESSAGE-BUFFER TO DE-COMMAND-LINE-2
                 COMPUTE SRF-ERROR-FLD = 7 + 4 * (CNTR1 - 1)
               ELSE
                 PERFORM 9999-GETNEXT-WO-EQUIP-H-HK-I
               END-IF
             END-PERFORM
           END-IF.

      ****************************************************************
      *PARAGRAPH NAME : 30-CHECK-DATABASE.                           *
      *PURPOSE : TO SEE WHETHER DATA ALREADY EXISTS IN THE DATABASE  *
      *          FOR THE "TO" SUBSYSTEM.                             *
      ****************************************************************
       30-CHECK-DATABASE.
           MOVE 1 TO CNTR1.
           MOVE "Y" TO PROCESS-ANYWAY.
           MOVE DE2-TO-TYPE TO HKA-TYPE TSA-TYPE TYPE-NUM-ARG.
           PERFORM UNTIL CNTR1 IS GREATER THAN 10
             IF DE2-EQP-REF-OPT = "Y"
               MOVE "  EQPREF;" TO BASE
               PERFORM 31-CHECK-TYPE-REF
             END-IF
             IF DE2-DRW-FIL-OPT = "Y"
               MOVE "  DRWFIL;" TO BASE
               PERFORM 32-CHECK-DRAWING-FILE
             END-IF
             IF DE2-SPR-PRT-OPT = "Y"
               MOVE "  MMISA;" TO BASE
               PERFORM 33-CHECK-SPARE-PARTS
             END-IF
             ADD 1 TO CNTR1
           END-PERFORM.
           PERFORM 34-DISPLAY-SCREEN-AGAIN.

      ****************************************************************
      *PARAGRAPH NAME : 31-CHECK-TYP-REF.                            *
      *PURPOSE : TO SEE WHETHER DATA ALREADY EXISTS IN THE EQUIPMENT *
      *          REFERENCE DATABASE FOR THIS "TO" TYPE/SUBSYSTEM.    *
      ****************************************************************
       31-CHECK-TYPE-REF.
           IF DE2-TO-LVL (CNTR1) NOT = SPACES
             MOVE DE2-TO-LVL(CNTR1) TO TSA-SUB
             PERFORM 9999-GETKEY-TYPE-REF-TS-I
             IF GOOD-CALL
               MOVE "<--"  TO DE2-TO-ERR (CNTR1)
               MOVE "N" TO PROCESS-ANYWAY
             ELSE
               MOVE "   "  TO DE2-TO-ERR (CNTR1)
             END-IF
           END-IF.

      ****************************************************************
      *PARAGRAPH NAME : 32-CHECK-DRAWING-FILE.                       *
      *PURPOSE : TO SEE WHETHER DATA ALREADY EXISTS IN THE DRAWING   *
      *          FILE DATABASE FOR THIS "TO" TYPE/SUBSYSTEM.         *
      ****************************************************************
       32-CHECK-DRAWING-FILE.
           IF DE2-TO-LVL (CNTR1) NOT = SPACES
             PERFORM 9999-CHAINHD-DRAWING-FL-TN-I
             PERFORM 9999-GETNEXT-DRAWING-FL-TN-I
             PERFORM UNTIL END-OF-CHAIN
               IF DE2-TO-LVL (CNTR1) = DRAW-SUBSYS
                 MOVE 15     TO COND-WORD
                 MOVE "<--"  TO DE2-TO-ERR (CNTR1)
                 MOVE "N"    TO PROCESS-ANYWAY
               END-IF
               PERFORM 9999-GETNEXT-DRAWING-FL-TN-I
             END-PERFORM
           END-IF.

      ****************************************************************
      *PARAGRAPH NAME : 33-CHECK-SPARE-PARTS.                        *
      *PURPOSE : TO SEE WHETHER DATA ALREADY EXISTS IN THE SPARE     *
      *          PARTS DATABASE FOR THIS "TO" TYPE/SUBSYSTEM.        *
      ****************************************************************
       33-CHECK-SPARE-PARTS.
           IF DE2-TO-LVL (CNTR1) NOT = SPACES
             MOVE DE2-TO-LVL(CNTR1) TO HKA-SUB
             PERFORM 9999-CHAINHD-CC-LINK-HK-I
             PERFORM 9999-GETNEXT-CC-LINK-HK-I
             IF GOOD-CALL
               MOVE "<--"  TO DE2-TO-ERR (CNTR1)
               MOVE "N" TO PROCESS-ANYWAY
             END-IF
           END-IF.

      *****************************************************************
      *PARAGRAPH NAME : 34-DISPLAY-SCREEN-AGAIN.                      *
      *PURPOSE : ALLOW THE USER TO CHOOSE WHETHER HE'D LIKE TO PROCESS*
      *          THE SCREEN ANYWAY, EVEN THOUGH DATA IS ALREADY IN THE*
      *          DATABASE FOR THE MARKED TARGET SUBSYSTEMS.           *
      *****************************************************************
       34-DISPLAY-SCREEN-AGAIN.
           MOVE "REQRCPY11" TO VIEW-NFNAME.
           IF PROCESS-ANYWAY = "N"
      ***"DATA ALREADY EXISTS IN DATABASE FOR SUBSYSTEMS MARKED WITH
      ***" '<--'            ***
             MOVE 04050 TO CATREAD-MSG-NUMBER
             PERFORM 999-CATREAD
             MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE-2-1
           ELSE
             MOVE SPACES         TO DE-MESSAGE-LINE-2-1
           END-IF.
      ***"PRESS F6 TO PROCESS RECORDS, PRESS ENTER TO RETURN TO EDITING
           MOVE 16141 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD.
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE-2-2.
           PERFORM 9999-GETNEXTFORM.
           PERFORM 9999-DO-SCREEN-2.
           IF VIEW-LASTKEY = F6-KEY
             MOVE "Y" TO PROCESS-ANYWAY
           ELSE
             MOVE "N" TO PROCESS-ANYWAY
           END-IF.

      *****************************************************************
      *PARAGRAPH NAME : 40-PROCESS-COPY.                              *
      *PURPOSE : PROCESS THE COPIES SPECIFIED BY THE USER ON THE      *
      *          SCREEN.  THE EDITS HAVE ALL BEEN PASSED SUCCESSFULLY.*
      *****************************************************************
       40-PROCESS-COPY.
           MOVE SPACES TO CSTRMJB2-PARMS.
           IF PASS-PRT-FILE-NUM = SPACES
               MOVE "00" TO PASS-PRT-FILE-NUM
           END-IF.
           MOVE "XXX" TO DE2-FR-ERR(1) DE2-FR-ERR(2) DE2-FR-ERR(3)
                         DE2-FR-ERR(4) DE2-FR-ERR(5) DE2-FR-ERR(6)
                         DE2-FR-ERR(7) DE2-FR-ERR(8) DE2-FR-ERR(9)
                         DE2-FR-ERR(10).
           MOVE "Y" TO CSTRM-JOBCARD-FLAG.
           MOVE "SEQTPCPY" TO CSTRM-JOBNAME.
           MOVE ":RUN XEQTPCPY.OBJECT;LIB=P"  TO CSTRM-RUN-CARD(1).
           MOVE PASS-PRT-FILE-NUM TO CSTRM-RUN-CARD(2).
           MOVE DE2-EQP-REF-OPT   TO CSTRM-RUN-CARD(3).
           MOVE DE2-DRW-FIL-OPT   TO CSTRM-RUN-CARD(4).
           MOVE DE2-SPR-PRT-OPT   TO CSTRM-RUN-CARD(5).
           MOVE DE2-FROM-TYPE     TO CSTRM-RUN-CARD(6).
           MOVE DE2-TO-TYPE       TO CSTRM-RUN-CARD(7).
           MOVE DE2-LVL-LINE(1)   TO CSTRM-RUN-CARD(8).
           MOVE DE2-LVL-LINE(2)   TO CSTRM-RUN-CARD(9).
           MOVE DE2-LVL-LINE(3)   TO CSTRM-RUN-CARD(10).
           MOVE DE2-LVL-LINE(4)   TO CSTRM-RUN-CARD(11).
           MOVE DE2-LVL-LINE(5)   TO CSTRM-RUN-CARD(12).
           MOVE DE2-LVL-LINE(6)   TO CSTRM-RUN-CARD(13).
           MOVE DE2-LVL-LINE(7)   TO CSTRM-RUN-CARD(14).
           MOVE DE2-LVL-LINE(8)   TO CSTRM-RUN-CARD(15).
           MOVE DE2-LVL-LINE(9)   TO CSTRM-RUN-CARD(16).
           MOVE DE2-LVL-LINE(10)  TO CSTRM-RUN-CARD(17).
           CALL "CSTRMJB2" USING CSTRMJB2-PARMS VIEW-COMAREA.


       COPY SCRNCALL           IN COPYLIB.
       COPY SCRNCL1            IN COPYLIB.
       COPY SCRNCL2            IN COPYLIB.

       999-CATREAD.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
           IF MESSAGE-BUFFER-1  = SPACES
               MOVE "* ERROR ON THIS FIELD *" TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.

       9999-GETKEY-TYPE-REF-TS-I.
           MOVE 0 TO COND-WORD.
           MOVE TYPE-SUB-ARG TO EQRTYSUBK OF TYPE-REF-TS-REC-I.
           READ TYPE-REF-TS-I INTO BUF-TYPE-REF
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-TYPE-REF-TS-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CHAINHD-WO-EQUIP-H-HK-I.
           MOVE 0 TO COND-WORD.
           MOVE HIER-KEY-ARG TO HIERKEY OF WO-EQUIP-H-HK-REC-I.
           START WO-EQUIP-H-HK-I KEY = HIERKEY OF WO-EQUIP-H-HK-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-WO-EQUIP-H-HK-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CHAINHD-TYPE-REM-TS-I.
           MOVE 0 TO COND-WORD.
           MOVE TYPE-SUB-ARG TO EQRTYSUBK OF TYPE-REM-TS-REC-I.
           START TYPE-REM-TS-I KEY = EQRTYSUBK OF TYPE-REM-TS-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-TYPE-REM-TS-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CHAINHD-TYPE-OPS-TS-I.
           MOVE 0 TO COND-WORD.
           MOVE TYPE-SUB-ARG TO EQRTYSUBK OF TYPE-OPS-TS-REC-I.
           START TYPE-OPS-TS-I KEY = EQRTYSUBK OF TYPE-OPS-TS-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-TYPE-OPS-TS-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CHAINHD-DRAWING-FL-TN-I.
           MOVE 0 TO COND-WORD.
           MOVE TYPE-NUM-ARG TO DRWTYPNUM OF DRAWING-FL-TN-REC-I.
           START DRAWING-FL-TN-I KEY = DRWTYPNUM OF DRAWING-FL-TN-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DRAWING-FL-TN-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CHAINHD-CC-LINK-HK-I.
           MOVE 0 TO COND-WORD.
           MOVE HIER-KEY-ARG TO HIERKEY OF CC-LINK-HK-REC-I.
           START CC-LINK-HK-I KEY = HIERKEY OF CC-LINK-HK-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-CC-LINK-HK-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-WO-EQUIP-H-HK-I.
           MOVE 0 TO COND-WORD.
           READ WO-EQUIP-H-HK-I NEXT INTO BUF-WO-EQUIP-HIER
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-WO-EQUIP-H-HK-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF HIERKEY OF WO-EQUIP-H-HK-REC-I NOT = HIER-KEY-ARG
               MOVE 15 TO COND-WORD.

       9999-GETNEXT-TYPE-REM-TS-I.
           MOVE 0 TO COND-WORD.
           READ TYPE-REM-TS-I NEXT INTO BUF-TYPE-REM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-TYPE-REM-TS-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF EQRTYSUBK OF TYPE-REM-TS-REC-I NOT = TYPE-SUB-ARG
               MOVE 15 TO COND-WORD.

       9999-GETNEXT-TYPE-OPS-TS-I.
           MOVE 0 TO COND-WORD.
           READ TYPE-OPS-TS-I NEXT INTO BUF-TYPE-OPS
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-TYPE-OPS-TS-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF EQRTYSUBK OF TYPE-OPS-TS-REC-I NOT = TYPE-SUB-ARG
               MOVE 15 TO COND-WORD.

       9999-GETNEXT-DRAWING-FL-TN-I.
           MOVE 0 TO COND-WORD.
           READ DRAWING-FL-TN-I NEXT INTO BUF-DRAWING-FILE
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DRAWING-FL-TN-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF DRWTYPNUM OF DRAWING-FL-TN-REC-I NOT = TYPE-NUM-ARG
               MOVE 15 TO COND-WORD.

       9999-GETNEXT-CC-LINK-HK-I.
           MOVE 0 TO COND-WORD.
           READ CC-LINK-HK-I NEXT INTO BUF-CORP-CODE
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-CC-LINK-HK-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF HIERKEY OF CC-LINK-HK-REC-I NOT = HIER-KEY-ARG
               MOVE 15 TO COND-WORD.

       9999-OPENS.
       COPY OPDISPL            IN COPYLIB.
           OPEN INPUT          WO-EQUIP-H-HK-I.
           OPEN INPUT          TYPE-REF-TS-I.
           OPEN INPUT          TYPE-REM-TS-I.
           OPEN INPUT          TYPE-OPS-TS-I.
           OPEN INPUT          DRAWING-FL-TN-I.
           OPEN INPUT          CC-LINK-HK-I.

       9999-CLOSES.
           CLOSE               DISPLAY-FILE.
           CLOSE               WO-EQUIP-H-HK-I.
           CLOSE               TYPE-REF-TS-I.
           CLOSE               TYPE-REM-TS-I.
           CLOSE               TYPE-OPS-TS-I.
           CLOSE               DRAWING-FL-TN-I.
           CLOSE               CC-LINK-HK-I.
