       IDENTIFICATION DIVISION.
       PROGRAM-ID.     SFLLOWUP.
       AUTHOR.         ANNETTE M. KRAUSS.
       INSTALLATION.   THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
       DATE-WRITTEN.   JUNE 6, 1987.
       DATE-COMPILED.
      *REMARKS.
      **************************************************************
      *                                                            *
      *D   SFLLOWUP    PURCHASING STANDARD FOLLOWUP MESSAGES       *
      *                                                            *
      *D    THIS PROGRAM IS USED TO ENTER THE STANDARD             *
      *D    INSTRUCTIONS THAT WILL BE PRINTED ON FOLLOWUPS.        *
      *D                                                           *
      **************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT DISPLAY-FILE
                   ASSIGN TO WORKSTATION-ZPLTSTUP-SI
                   ORGANIZATION IS TRANSACTION
                   ACCESS IS SEQUENTIAL
                   FILE STATUS IS DISPLAY-STATUS
                   CONTROL-AREA IS WS-CONTROL.
            SELECT MPLTINFO-O
                   ASSIGN TO DATABASE-MCFLCS0501
                   ORGANIZATION IS INDEXED
                   ACCESS IS DYNAMIC
                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   FILE STATUS IS FILE-STATUS.
            SELECT MCOMMENT-O
                   ASSIGN TO DATABASE-MCFLCS1801
                   ORGANIZATION IS INDEXED
                   ACCESS IS DYNAMIC
                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   FILE STATUS IS FILE-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC             PIC X(2000).
       FD  MPLTINFO-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-O-REC.
           COPY DDS-MCRPCS0500 OF MCFLCS0501.
       FD  MCOMMENT-O
           LABEL RECORDS ARE STANDARD.
       01  MCOMMENT-O-REC.
           COPY DDS-MCRPCS1800 OF MCFLCS1801.

       WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1        PIC X VALUE SPACE.
           05  FILE-STATUS-2        PIC X VALUE SPACE.

       77  INDX                       PIC 9 VALUE 1.
      *************************************************************
      **                                                         **
      **              D A T A    B A S E    A R E A              **
      **                                                         **
      *************************************************************
      *************************************************************

       COPY MPLTINFO IN COPYLIB.
       COPY MCOMMENT IN COPYLIB.

       01  DATABASE-ARGS.
           05  MPLTINFO-ARG           PIC X(4).
           05  MCOMMENT-ARG.
               10  FILLER             PIC X(1)  VALUE "C".
               10  MCOMMENT-VARIABLE  PIC X(3).

       COPY DBSTAT IN COPYLIB.

       01  MESSAGE-BUFFER.
           05  MSG-TEXT                    PIC X(64)  VALUE SPACES.
           05  MSG-FLD                     PIC X(12)  VALUE SPACES.
           05  MSG-FLD-9 REDEFINES MSG-FLD
                                           PIC Z(11)9.

      *************************************************************
      *************************************************************
      **                                                         **
      **                 TERMINAL I/O DATA AREA                  **
      **                                                         **
      *************************************************************
      *************************************************************
       01  STND-FLLOWUP-SCREEN.
           05  STND-FLLOWUP.
               10  STND-FLLOWUP-INFO OCCURS 3 TIMES.
                   15  FLLOWUP-INDIC     PIC X(1).
                   15  FLLOWUP-INST      PIC X(3).
           05  STND-FLLOWUP-MSGLINE      PIC X(79).
           05  STND-CMDNLINE             PIC X(79).
           05  STND-ERRLINE              PIC X(79).

       COPY TBLOWUP IN COPYLIB.
       COPY CATREAD IN COPYLIB.
       COPY DISPDATA IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.

      *************************************************************
      *************************************************************
      **                                                         **
      **               LINKAGE   SECTION                         **
      **                                                         **
      *************************************************************
      *************************************************************

       LINKAGE SECTION.

       01  BASE                          PIC X(10).
       COPY VCOMLINK IN COPYLIB.
       COPY LANGSUB IN COPYLIB.


      *************************************************************
      **#########################################################**
      *************************************************************
      **                                                         **
      **          P R O C E D U R E    D I V I S I O N           **
      **                                                         **
      *************************************************************
      **#########################################################**
      *************************************************************

       PROCEDURE DIVISION USING BASE,
                                VIEW-COMAREA,
                                LANGUAGE-PARMS.


       MAIN-PGM SECTION 01.

       BEGIN-HERE.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-X.
           PERFORM 2-EOJ.

       1-HSK.
           MOVE "SFLLOWUP" TO BU-PGM-NAME.
           OPEN I-O DISPLAY-FILE, MPLTINFO-O, MCOMMENT-O.

       2-EOJ.
           CLOSE DISPLAY-FILE, MPLTINFO-O, MCOMMENT-O.
           GOBACK.

      ******************************************************
      **                 BLOWUP ROUTINE                   **
      ******************************************************

       2-BLOWUP.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
               BU-DISPLAY-AREA.


      **************************************************
      *                                                *
      *                  6 - M A I N                   *
      *                                                *
      **************************************************

       6-MAIN.
           MOVE "FLLOWUP" TO VIEW-NFNAME.
           MOVE SPACES TO STND-FLLOWUP-SCREEN.
           PERFORM 61-READ-MPLTINFO.

      ***  INPUT DATA ABOVE AND PRESS 'ENTER'  ***
           MOVE   9 TO LANG-SETNUM.
           MOVE  20 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO STND-FLLOWUP-MSGLINE.

       6-MAIN-SHOW-FORM.
           MOVE STND-FLLOWUP-SCREEN TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC         TO STND-FLLOWUP-SCREEN.
           IF VIEW-LASTKEY = 3
               GO TO 6-MAIN-X.
           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO STND-ERRLINE
               MOVE B"1" TO IND(99)
               GO TO 6-MAIN-SHOW-FORM.
           MOVE 1 TO INDX.

       6-EDIT-CHECKS.
           IF FLLOWUP-INST (INDX)  NOT = SPACES
           MOVE FLLOWUP-INST (INDX) TO MCOMMENT-VARIABLE
           MOVE MCOMMENT-ARG        TO MCOMCOMMNT OF MCOMMENT-O-REC
           START MCOMMENT-O KEY = MCOMCOMMNT OF MCOMMENT-O-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-START
           IF FILE-STATUS-1 = "2"
      ***          STND INST DOES NOT EXIST
               MOVE  19 TO LANG-SETNUM
               MOVE  24 TO LANG-MSGNUM
               PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO STND-ERRLINE
               MOVE B"1" TO IND (99), IND (INDX)
               GO TO 6-MAIN-SHOW-FORM
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "START MCOMMENT ERROR IN 6-EDIT-CHECKS"
                   TO BU-DISPLAY-MSG
               MOVE MCOMMENT-ARG TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP
           ELSE
               IF FLLOWUP-INDIC (INDX) = SPACES
                    MOVE "B" TO FLLOWUP-INDIC (INDX).
           IF INDX < 3
              ADD 1 TO INDX
              GO TO 6-EDIT-CHECKS.

         6-UPDATE-MPLTINFO.
           MOVE "PFLP" TO MPLTINFO-ARG.
           MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               MOVE STND-FLLOWUP TO MPLTINFO-FLLOWUP
               REWRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-REWRITE
               IF FILE-STATUS NOT = "00"
                   MOVE "REWRITE ERROR IN 6-REPLACE-MPLTINFO"
                       TO BU-DISPLAY-MSG
                   MOVE "PFLP" TO BU-DISPLAY-MSG
                   PERFORM 2-BLOWUP
               ELSE
                   NEXT SENTENCE
           ELSE
           IF FILE-STATUS-1 = "2"
               MOVE SPACES          TO BUF-MPLTINFO
               MOVE "PFLP"          TO MPLTINFO-KEY
               MOVE STND-FLLOWUP TO MPLTINFO-FLLOWUP
               WRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-WRITE
               IF FILE-STATUS NOT = "00"
                   MOVE "WRT MPLTINFO ERROR IN 6-REPLACE-MPLTINFO"
                       TO BU-DISPLAY-MSG
                   MOVE "PFLP" TO BU-DISPLAY-FLD (1)
                   PERFORM 2-BLOWUP
               ELSE
                   NEXT SENTENCE
           ELSE
               MOVE "READ MPLTINFO ERROR IN 6-REPLACE-MPLTINFO"
                   TO BU-DISPLAY-MSG
               MOVE "PFLP" TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

       6-MAIN-X.
           EXIT.

       61-READ-MPLTINFO.
           MOVE "PFLP" TO MPLTINFO-ARG.
           MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               MOVE MPLTINFO-FLLOWUP TO STND-FLLOWUP
           ELSE
           IF FILE-STATUS-1 NOT = "2"
               MOVE "READ MPLTINFO ERROR IN 61-READ-MPLTINFO"
                   TO BU-DISPLAY-MSG
               MOVE "PFLP" TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

       COPY DISPCALL IN COPYLIB.

      *********************************************************
       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.
           EXIT.
