       IDENTIFICATION DIVISION.
       PROGRAM-ID.     SFOBCODE.
       AUTHOR.         ANNETTE M. KRAUSS.
       INSTALLATION.   THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
       DATE-WRITTEN.   MAY 28, 1986.
       DATE-COMPILED.
      *REMARKS.
      **************************************************************
      *                                                            *
      *D   SFOBCODE                FOB CODES SUBPROGRAM            *
      *                                                            *
      *D    THIS PROGRAM IS USED TO LOAD FOB CODES INTO            *
      *D    THE STORES DATA BASE FOR STARTUP ON CSIS.              *
      *D                                                           *
      *D    THIS PROGRAM IS CALLED BY:                             *
      *D                      1.  TPLTSTUP                         *
      *D                                                           *
      **************************************************************
      *C  08/16/1996     CA YODER     REQ #96-028                  *
      *C   ADDED LOGIC TO START JOB "BXGETFOB" TO UPDATE THE HELP  *
      *C   FILE IF A DELIVERY/FOB CODE IS MODIFIED, ADDED, OR      *
      *C   DELETED.                                                *
      **************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT DISPLAY-FILE
                   ASSIGN TO WORKSTATION-ZPLTSTUP-SI
                   ORGANIZATION IS TRANSACTION
                   ACCESS IS SEQUENTIAL
                   FILE STATUS IS DISPLAY-STATUS
                   CONTROL-AREA IS WS-CONTROL.
            SELECT MPLTINFO-O
                   ASSIGN TO DATABASE-MCFLCS0501
                   ORGANIZATION IS INDEXED
                   ACCESS IS DYNAMIC
                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   FILE STATUS IS FILE-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC             PIC X(2000).
       FD  MPLTINFO-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-O-REC.
           COPY DDS-MCRPCS0500 OF MCFLCS0501.

       WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1        PIC X VALUE SPACE.
           05  FILE-STATUS-2        PIC X VALUE SPACE.

       01  CHANGE-MADE-SW           PIC X VALUE "N".

      *************************************************************
      *************************************************************
      **                                                         **
      **              D A T A    B A S E    A R E A              **
      **                                                         **
      *************************************************************
      *************************************************************

       COPY MPLTINFO IN COPYLIB.
       01  ARG-VALUES.
           05  MPLTINFO-ARG              PIC X(4).

       01  MESSAGE-BUFFER.
           05  MSG-TEXT                  PIC X(64)  VALUE SPACES.
           05  MSG-FLD                   PIC X(12)  VALUE SPACES.

       01  FOB-CODE-ARG.
           05  FILLER                 PIC X(2)   VALUE "FB".
           05  FOB-CODE-IN            PIC X(2).

       COPY DBSTAT IN COPYLIB.

      *************************************************************
      *************************************************************
      **                                                         **
      **                 TERMINAL I/O DATA AREA                  **
      **                                                         **
      *************************************************************
      *************************************************************

       01  FOB-SCREEN.
           05  FOB-INFO OCCURS 5 TIMES.
               10  FOB-CODE              PIC X(2).
               10  FOB-DESC              PIC X(20).
           05  FOB-MSGLINE               PIC X(79).
           05  FOB-CMDLINE               PIC X(79).
           05  FOB-ERRLINE               PIC X(79).

       01  INDX                          PIC 9 VALUE ZERO.
       COPY TBLOWUP   IN COPYLIB.
       COPY CATREAD   IN COPYLIB.
       COPY DISPDATA  IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.

      *************************************************************
      *************************************************************
      **                                                         **
      **               LINKAGE   SECTION                         **
      **                                                         **
      *************************************************************
      *************************************************************

       LINKAGE SECTION.

       01  BASE                          PIC X(10).
       COPY VCOMLINK IN COPYLIB.
       COPY LANGSUB  IN COPYLIB.


      *************************************************************
      **#########################################################**
      *************************************************************
      **                                                         **
      **          P R O C E D U R E    D I V I S I O N           **
      **                                                         **
      *************************************************************
      **#########################################################**
      *************************************************************

       PROCEDURE DIVISION USING BASE,
                                VIEW-COMAREA,
                                LANGUAGE-PARMS.

       0-SBUYRCODE-SEC SECTION 1.

       0-BEGIN-HERE.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-X.
           PERFORM 2-EOJ.

       1-HSK.
           MOVE "SFOBCODE" TO BU-PGM-NAME.
           OPEN I-O DISPLAY-FILE, MPLTINFO-O.

       2-EOJ.
      *--------- IF A CHANGE WAS MADE, CALL CL PROGRAM TO START
      *--------- JOB "BXGETFOB" TO UPDATE HELP FILE.
           IF CHANGE-MADE-SW = "Y"
               CALL "CLGETFOB".
           CLOSE DISPLAY-FILE, MPLTINFO-O.
           GOBACK.

      ******************************************************
      **                 BLOWUP ROUTINE                   **
      ******************************************************

       2-BLOWUP.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
                 VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                 BU-DISPLAY-AREA.


      **************************************************
      *                                                *
      *                  6 - M A I N                   *
      *                                                *
      **************************************************
       6-MAIN.
           MOVE "FOBCODES" TO VIEW-NFNAME.

       6-PUT-BUFFER.
           MOVE SPACES TO FOB-SCREEN.

      ***  INPUT DATA ABOVE AND PRESS 'ENTER'  ***
           MOVE   9 TO LANG-SETNUM.
           MOVE  20 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO FOB-MSGLINE.

       6-SHOW-FORM.
           MOVE 0 TO INDX.
           MOVE FOB-SCREEN TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC TO FOB-SCREEN.
           IF VIEW-LASTKEY = 3
               GO TO 6-MAIN-X.
           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO FOB-ERRLINE
               MOVE B"1" TO IND(99)
               GO TO 6-SHOW-FORM.


       6-EDIT-CHECKS.
           IF (FOB-CODE (1) NOT = SPACES OR
               FOB-CODE (2) NOT = SPACES OR
               FOB-CODE (3) NOT = SPACES)
              IF FOB-CODE (4) NOT = SPACES
               MOVE   3 TO LANG-SETNUM
               MOVE  62 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO FOB-ERRLINE
               MOVE B"1" TO IND(99), IND(14)
               GO TO 6-SHOW-FORM
              ELSE
              IF FOB-CODE (5) NOT = SPACES
               MOVE   3 TO LANG-SETNUM
               MOVE  62 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO FOB-ERRLINE
               MOVE B"1" TO IND(99), IND(14)
               GO TO 6-SHOW-FORM
              ELSE
               NEXT SENTENCE
           ELSE
              IF FOB-CODE (4) NOT = SPACES
                AND FOB-CODE (5) NOT = SPACES
               MOVE   3 TO LANG-SETNUM
               MOVE  62 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO FOB-ERRLINE
               MOVE B"1" TO IND(99), IND(14)
               GO TO 6-SHOW-FORM.

       6-CONT.
           ADD 1 TO INDX.
           IF INDX > 5
              GO TO 6-MAIN.
           IF FOB-CODE (INDX) NOT = SPACES
              MOVE FOB-CODE (INDX) TO FOB-CODE-IN
              MOVE FOB-CODE-ARG TO MPLTINFO-ARG, BU-DISPLAY-FLD (1)
              MOVE FOB-CODE-ARG TO PLTINFOKEY OF MPLTINFO-O-REC
              START MPLTINFO-O KEY = PLTINFOKEY OF MPLTINFO-O-REC
                  INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
              END-START
              IF FILE-STATUS = "00" OR FILE-STATUS-1 = "2"
                  NEXT SENTENCE
              ELSE
                  MOVE "READ ERROR 60-EDIT-CHECK" TO BU-DISPLAY-MSG
                  PERFORM 2-BLOWUP
              END-IF
              IF INDX = 1 OR INDX = 2 OR INDX = 3
                  IF FILE-STATUS = "00"
                    MOVE HIGH-VALUES TO PLTINFOKEY OF MPLTINFO-O-REC
                    START MPLTINFO-O KEY > PLTINFOKEY OF MPLTINFO-O-REC
                      INVALID KEY MOVE "00" TO FILE-STATUS
                    END-START
      ****   FOB CODE ALREADY EXISTS --- CANNOT ADD   ****
                      MOVE   6 TO LANG-SETNUM
                      MOVE   8 TO LANG-MSGNUM
                      PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                      MOVE MESSAGE-BUFFER TO FOB-ERRLINE
                      MOVE B"1" TO IND(99), IND(INDX)
                      GO TO 6-SHOW-FORM
                  ELSE
                      PERFORM 61-ADD-MPLTINFO
                      IF INDX = 3
                          GO TO 6-MAIN
                      ELSE
                          GO TO 6-CONT
               ELSE
               IF INDX = 4
                   IF FILE-STATUS-1 = "2"
      ****  FOB CODE DOES NOT EXIST --- CANNOT MODIFY  ****
                      MOVE   6 TO LANG-SETNUM
                      MOVE   9 TO LANG-MSGNUM
                      PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                      MOVE MESSAGE-BUFFER TO FOB-ERRLINE
                      MOVE B"1" TO IND(99), IND(INDX)
                      GO TO 6-SHOW-FORM
                  ELSE
                      PERFORM 62-MODIFY-MPLTINFO
                              THRU 62-MODIFY-MPLTINFO-X
                      GO TO 6-MAIN
               ELSE
               IF INDX = 5
                  IF FILE-STATUS-1 = "2"
      ****   FOB CODE DOES NOT EXIST --- CANNOT DELETE   ****
                      MOVE   6 TO LANG-SETNUM
                      MOVE  12 TO LANG-MSGNUM
                      PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                      MOVE MESSAGE-BUFFER TO FOB-ERRLINE
                      MOVE B"1" TO IND(99), IND(INDX)
                      GO TO 6-SHOW-FORM
                  ELSE
                      PERFORM 63-DELETE-MPLTINFO
                                  THRU 63-DELETE-MPLTINFO-X
                      GO TO 6-MAIN.
           GO TO 6-CONT.

       6-MAIN-X.
           EXIT.

       61-ADD-MPLTINFO.
           MOVE SPACES             TO BUF-MPLTINFO.
           MOVE FOB-CODE-ARG       TO MPLTINFO-KEY.
           MOVE FOB-DESC (INDX)    TO MPLTINFO-FOB.
           WRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "WRT MPLTINFO ERROR IN 61-ADD-MPLTINFO"
                    TO BU-DISPLAY-MSG
               MOVE FOB-CODE-ARG TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.
           MOVE "Y"                TO CHANGE-MADE-SW.


       62-MODIFY-MPLTINFO.
           MOVE "FOBCODESM" TO VIEW-NFNAME.

       62-PUT-BUFFER.
           READ MPLTINFO-O NEXT INTO BUF-MPLTINFO
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00" OR
              PLTINFOKEY OF MPLTINFO-O-REC NOT = FOB-CODE-ARG
               MOVE "ERROR MOD RCD NOT FOUND" TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.
           MOVE MPLTINFO-FOB TO FOB-DESC (4).
      ***  INPUT DATA ABOVE AND PRESS 'ENTER'  ***
           MOVE   9 TO LANG-SETNUM.
           MOVE  20 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO FOB-MSGLINE.

       62-SHOW-FORM.
           MOVE FOB-SCREEN  TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC TO FOB-SCREEN.
           IF VIEW-LASTKEY = 3
               GO TO 62-MODIFY-MPLTINFO-X.
           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO FOB-ERRLINE
               MOVE B"1" TO IND(99)
               GO TO 62-SHOW-FORM.

       62-REPLACE-MPLTINFO.
           MOVE FOB-DESC (4) TO MPLTINFO-FOB.
           REWRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              MOVE "REWRITE MPLTINFO ERROR IN 62-REPLACE-MPLTINFO"
                   TO BU-DISPLAY-MSG
              MOVE FOB-CODE-ARG TO BU-DISPLAY-FLD (1)
              PERFORM 2-BLOWUP.
           MOVE "Y"                TO CHANGE-MADE-SW.

       62-MODIFY-MPLTINFO-X.
            EXIT.

       63-DELETE-MPLTINFO.
           MOVE "FOBCODESD" TO VIEW-NFNAME.

       63-PUT-BUFFER.
           READ MPLTINFO-O NEXT INTO BUF-MPLTINFO
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00" OR
              PLTINFOKEY OF MPLTINFO-O-REC NOT = FOB-CODE-ARG
               MOVE "ERROR DEL RCD NOT FOUND" TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.
           MOVE MPLTINFO-FOB TO FOB-DESC (5).
      ***  PRESS 'f2' TO DELETE OR 'f8' TO EXIT (LEAVE UNCHANGED)  ***
           MOVE  16 TO LANG-SETNUM.
           MOVE  82 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO FOB-MSGLINE.

       63-SHOW-FORM.
           MOVE FOB-SCREEN TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC TO FOB-SCREEN.
           IF VIEW-LASTKEY = 8
               GO TO 63-DELETE-MPLTINFO-X.
           IF VIEW-LASTKEY = 0 OR
              VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 3 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7
      *****    INVALID FUNCTION KEY    *****
               MOVE   9 TO LANG-SETNUM
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO FOB-ERRLINE
               MOVE B"1" TO IND(99)
               GO TO 63-SHOW-FORM.

       63-MAIN-DELETE-MPLTINFO.
           DELETE MPLTINFO-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DELETE MPLTINFO ERROR IN 63-DELETE-MPLTINFO"
                   TO BU-DISPLAY-MSG
               MOVE FOB-CODE-ARG TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.
           MOVE "Y"                TO CHANGE-MADE-SW.

       63-DELETE-MPLTINFO-X.
           EXIT.
       COPY DISPCALL IN COPYLIB.
      *********************************************************
       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.
           EXIT.
