001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.          SFREIGHT.
001300 AUTHOR.              L BUNN / B WINTER.
001400 DATE-WRITTEN.        JUNE 6, 1983.
001500 DATE-COMPILED.
001600*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
001700*SECURITY.
001800*REMARKS.
001900*           REWRITTEN DECEMBER 1984 BY BARBARA WINTER.
002000*           COMBINED AKRON'S PROGRAM WITH SUBPLANT'S PROGRAM.
002100*************************************************************
002200*************************************************************
002300**                    S F R E I G H T                      **
002400*D      THIS SUBROUTINE PROCESSES THE FREIGHT INFORMATION  **
002500*D    FOR A RECEIVING SLIP.  IF THE FREIGHT HAS BEEN       **
002600*D    ENTERED ALREADY FROM ANOTHER PURCHASE ORDER, THEN    **
002700*D    THAT FREIGHT DATA IS COPIED INTO A NEW FREIGHT       **
002800*D    SEGMENT FOR THE NEW RECEIVING SLIP.  OTHERWISE,      **
002900*D    THE USER MUST ENTER FREIGHT DATA IN THIS SUBROUTINE. **
003000**                                                         **
003100**    DATABASE UPDATES:                                    **
003200**     DDAILYTC   PUT      350 TC PER P.O. (FREIGHT)       **
003300**                PUT      352 TC PER P.O. (FREIGHT)       **
003400**     DPOFREIGHT PUT      ENTIRE RECORD FOR THIS R.S.     **
003500**                PUT      ONLY REFERBACK FOR MULTI-P.O.S  **
003600**     MPORCV     PUT      NEW RS ENTRY ('  ' STATUS)      **
003700**                UPDATE   ACCUMULATOR (RS # IN STATUS).   **
003800**     MPLTINFO   UPDATE   ADD 1 TO SEQUENCE NUMBER.       **
003900*************************************************************
004000*                      PROGRAM CHANGES                      *
004100*************************************************************
004200*    JANUARY 30, 1985                          B. WINTER
004300*         ZBILL FOR AKRON WAS NOT BEING STORED IN
004400*         DPOFREIGHT UNTIL NOW.
004500*    FEBRUARY 15, 1985                         B. WINTER
004600*         ADDED "U" FOR UPS AND "D" FOR LOCAL PICKUP
004700*         TO FREIGHT TYPE.
004800*    MARCH 12, 1985                            B. WINTER
004900*         THE INVOICE SYSTEM NOW PUTS OUT A FREIGHT SEGMENT,
005000*         SO A CHECK WAS ADDED IN THE MULTI-FREIGHT LOGIC.
005100*         IF A REFER-BACK PO IS SPACES, IT WILL NOT BE
005200*         CONSIDERED A MULTI-FREIGHT PO FOR RECEIVING.
005300*    APRIL 18, 1985                            B. WINTER
005400*         ADDED FREIGHT DATE CHECK:  DATE CANNOT BE A FUTURE
005500*         DATE AND CANNOT BE OLDER THAN BEFORE LAST YEAR.
005600*    JULY 29, 1985                             B. WINTER
005700*         GENERAL CHANGES:
005800*           SEQUENCE NUMBER IN MPORCV RECEIVER ENTRY IS
005900*           INCREMENTED FOR ALL PLANTS EVEN THOUGH KELLY
006000*           PLANTS ONLY USE IT.
006100*         KELLY CHANGES:
006200*           1.  CARRIER ID IS REQUIRED ON FREIGHT SCREEN.
006300*           2.  EITHER CARRIER'S WEIGHT OR OUR WEIGHT MUST
006400*               BE ENTERED FOR RAW MATERIALS.
006500*    OCTOBER 30, 1985
006600*      1. CHANGED PROGRAM TO BE COMPATIBLE WITH THE NATIVE
006700*         LANGUAGE SUPPORT FACILITY.      PAUL D RAGLOW.
006800*    NOVEMBER, 1985                BARBARA WINTER
006900*         ADDED CHECK TO ENTER PACKING SLIP FOR "PAY UPON RECEIPT"
007000*         VENDORS.
007100*    MAY 7, 1986                   BARBARA WINTER
007200*     CHANGED THE LOGIC FOR MULTI PO'S.  NOW THE ORIGINAL
007300*     PO IS THE ONLY ONE THAT CONTAINS ALL INFORMATION IN
007400*     DPOFREIGHT SEGMENT.  THE SUCESSIVE PO'S WILL ONLY
007500*     CONTAIN THE REFERBACK PO IN BOTH THE REFERBACK FIELD
007600*     AND THE FREIGHT BILL NUMBER, AND THE RECEIVED DATE.
007700*   JUNE 24, 1986                 BARBARA WINTER.
007800*      THE FREIGHT CHARGES ON THE SCREEN WAS X(8) AND THE
007900*      TRANSACTION FIELD WAS 9(7), SO THE RIGHT BIT WAS BEING
008000*      DROPPED.  ADDED A REDEFINING CLAUSE TO THE SCREEN FIELD
008100*      OF 9(8) WHICH SOLVED THE PROBLEM OF CHARGES BEING RIGHT
008200*      SHIFTED BY ONE DIGIT.
      *C  NOVEMBER 2, 1992              JEFF BUNGO
      *C     ADDED CODE TO CHECK WEIGHT OF RAW MATERIAL RECEIVED
      *C     AGAINST THE CARRIER'S WEIGHT ENTERED ON THE FREIGHT
      *C     SCREEN.  THIS CHECK IS ONLY DONE FOR INVOICELESS PO'S
      *C     AND THE NET WEIGHT RECEIVED FOR THE PO IS CALCULATED
      *C     FOR RAW MATERIAL ITEMS IN POUNDS ONLY.  THE RAW MATERIAL
      *C     GROUPS WERE NEEDED TO BE PASSED FROM SRCVEXEC, AS WELL AS
      *C     THE ITEM LINES.  IF THE RECEIVED WEIGHT EXCEEDS THE AMOUNT
      *C     ENTERED ON THE FREIGHT SCREEN, THEN A NEW SCREEN WILL
      *C     APPEAR LISTING THOSE ITEMS AND THE NET WEIGHT RESULTING.
      *C     THE USER WILL HAVE THE OPTION TO CONTINUE OR TO END THE
      *C     PROCESSING OF THE RECEIVING SLIP.
      *C  JANUARY 12, 1993              JEFF BUNGO, REQ #6344
      *C     IF THERE ARE MORE THAN 12 ITEMS ON THE RECEIVING SLIP
      *C     A FREIGHT ACCUMULATOR RECORD IS WRITTEN FOR THE PO
      *C     SO THAT WHEN THE "MORE THAN 12" ITEMS ARE PROCESSED
      *C     A FREIGHT REFER BACK WILL BE WRITTEN FOR THAT NEW
      *C     RECEIVING SLIP WITH "MORE THAN 12" BACK TO THE
      *C     FIRST RECEIVING SLIP WITH "12 ITEMS".
      *C     A SPECIAL CHECK MUST BE MADE TO MAKE SURE WE ARE NOT
      *C     REFERING BACK TO REFERBACK.
      *C  MARCH   12, 1993              CATHY KALMAN, REQ #6385
      *C     ADDED LOGIC AND A SCREEN SO USER CAN ENTER MULTIPLE
      *C     PO'S FOR ONE FREIGHT BILL WITH MORE THAN ONE PACKING
      *C     SLIP. THIS SCREEN WILL ONLY SHOW WHEN RECEIVING
      *C     INVOICELESS PO'S.
      *C
      *C  DECEMBER 4, 1996  JEFF BUNGO  REQ 96-035
      *C     PASS CARRIER BACK TO SRCVEXEC FOR QS9000 TRACKING.
      *C
      *C  APRIL 30, 1997     JEFF BUNGO
      *C     ALLOW FOR RECEIPT VERIFICATION OF AN ASN.  THE FREIGHT
      *C     SEGMENT HAS ALREADY BEEN ADDED AND THE RS NUMBER IS PASSED
      *C     AS A NEW PARAM ASN-RECEIVER.  RETRIEVE THE RECEIVER TO
      *C     DISPLAY ASN VALUES ON THE FRT SCREEN AND REWRITE INSTEAD
      *C     OF WRITING A NEW RECORD FOR THE FREIGHT SEGMENT.
      *C
      *C  JULY 22, 1997      CA YODER
      *C     ADDED EDIT CHECK TO ONLY ALLOW PREPAID FREIGHT FOR
      *C     GOODYEAR-TO-GOODYEAR SHIPMENTS ("IT" ORDERS).  DANVILLE
      *C     REPORTED A PROBLEM WITH "IT"S BEING MARKED AS COLLECT;
      *C     GARY STARCHER SAID THAT THEY ARE ONLY SHIPPED OUT AS
      *C     PREPAID.
      *C
      *C  OCTOBER 30, 1997   CA YODER
      *C     ADDED CENTURY FOR DATABASE CHANGE TO MCFPCSTERM.
      *C
      *C  NOVEMBER 11, 1997  JEFF BUNGO
      *C     CHANGED RECEIVING TO USE A SUBFILE TO HOLD ALL ITEMS
      *C     INSTEAD OF LIMITING EACH RECEIVER TO 12 ITEMS AND
      *C     DO FREIGHT REFERBACK TO FIRST RECEIVER FOR SUBSEQUENT
      *C     GROUPS OF 12.  THE SORT TABLE OF ITEMS, RAW MATERIAL
      *C     GROUPS, ANY MORE ITEMS FLAG, AND RCVR FLAG ARE NO LONGER
      *C     PASSED AS PARAMETERS TO THIS PROGRAM FROM SRCVEXEC.
      *C     A NEW PARM NET RAW WEIGHT (CALCULATED IN SRCVEXEC) WILL
      *C     BE PASSED TO CHECK RAW MATERIAL WEIGHT VS. WEIGHT ENTERED
      *C     ON THE FREIGHT SCREEN.  ONLY THE TOTAL WEIGHT OF ITEMS RECIEVED
      *C     CAN NOW BE DISPLAYED INSTEAD OF EACH ITEM.  ALSO ALL REFERENCES
      *C     TO FREIGHT REFERBACK FOR RECEIVERS WITH > 12 ITEMS HAS BEEN
      *C     REMOVED.
      *C
      *C  JULY 28, 1998   CA YODER
      *C     ADDED CALLS TO TDATECK2 TO WRITE OUT THE FREIGHT BILL DATE
      *C     IN THE CORRECT FORMAT TO DPOFREIGHT AND DDAILYTC.
      *C
      *C  MAY 7, 1999     DAVE PLUM
      *C     CORRECTED A PROBLEM WITH RECORDS BEING WRITTEN TO DDAILYTC
      *C     WITH A BAD TRANSACTION DATE AND A BLANK TRANSACTION TIME.
      *C
      *C  OCT 12,2000     JIM COFFMAN
      *C     CHANGED LENGTH OF ALL-PO-RLSE VARIABLE PASSED IN LINKAGE
      *C     SECTION TO AGREE WITH WHAT IS PASSED FROM SRCVEXEC
      *C     (DE-FIELDS-1-PO).
      ******************************************************************
008300
008400 ENVIRONMENT DIVISION.
008500 CONFIGURATION SECTION.
008600 SOURCE-COMPUTER.  HP-3000.
008700 OBJECT-COMPUTER.  HP-3000.
       SPECIAL-NAMES.  I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZUDCDOCK-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS DYNAMIC
                  RELATIVE KEY IS RELATIVE-RECNO
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.
            SELECT DDAILYTC-O
              ASSIGN TO DATABASE-MCFLCS1601
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT DPOFREIGHT-O
               ASSIGN TO DATABASE-MCFLCS2401
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT MPORCV-O
               ASSIGN TO DATABASE-MCFLCS0101
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT DPORECD
               ASSIGN TO DATABASE-MCFLCS0901
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT MPLTINFO-O
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT KFRTERMS-O
               ASSIGN TO DATABASE-MCFLCSTERM
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
016800 DATA DIVISION.
016900 FILE SECTION.
017000
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC          PIC X(2000).
       FD  DDAILYTC-O
           LABEL RECORDS ARE STANDARD.
       01  DDAILYTC-REC.
           COPY DDS-MCRPCS1600  OF MCFLCS1601.

       FD  DPOFREIGHT-O
           LABEL RECORDS ARE STANDARD.
       01  DPOFREIGHT-REC.
           COPY DDS-MCRPCS2400  OF MCFLCS2401.

       FD  MPORCV-O
           LABEL RECORDS ARE STANDARD.
       01  MPORCV-REC.
           COPY DDS-MCRPCS0100  OF MCFLCS0101.

       FD  DPORECD
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-REC.
           COPY DDS-MCRPCS0900 OF MCFLCS0901.

       FD  MPLTINFO-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC.
           COPY DDS-MCRPCS0500 OF MCFLCS0501.

       FD  KFRTERMS-O
           LABEL RECORDS ARE STANDARD.
       01  KFRTERMS-REC.
           COPY DDS-MCFRCSTERM OF MCFLCSTERM.
009000
009100 WORKING-STORAGE SECTION.
009200*************************************************************
009300*                 WORKING STORAGE SECTION                   *
009400*************************************************************
       01  ADD-ONE                PIC 9(6).
       01  RELATIVE-RECNO         PIC 9(9).
       01  PO-IDX                 PIC S9(3).
       01  ITEM-IDX               PIC S9(3).
       01  RAW-IDX                PIC S9(3).
       01  WT-SCREEN-IDX          PIC S9(3).
       01  MULTI-PO-SW            PIC X(1)  VALUE "N".
       01  RAW-SW                 PIC X(1)  VALUE "N".
       01  REFERBACK-REFERBACK    PIC X(14) VALUE SPACES.

       01  FREIGHT-DATE-CN.
           05  FREIGHT-CC         PIC X(2).
           05  FREIGHT-YMD.
               10  FREIGHT-YY     PIC X(2).
               10  FREIGHT-MM     PIC X(2).
               10  FREIGHT-DD     PIC X(2).

      *------ WS CONTROL AREA
       01  MAJOR-MINOR                 PIC XXXX.
       01  WS-CONTROL.
           02  FUNCTION-NUM            PIC XX.
                   88  EXIT-KEY-F8-USED                     VALUE "08". LVW000LS
                   88  REFRESH-KEY-F4-USED                  VALUE "04". LVW000LS
                   88  ENTER-KEY-USED                       VALUE "00". LVW000LS
                   88  F1-KEY-USED                          VALUE "01". LVW000LS
                   88  F2-KEY-USED                          VALUE "02". LVW000LS
                   88  F3-KEY-USED                          VALUE "03". LVW000LS
                   88  F4-KEY-USED                          VALUE "04". LVW000LS
                   88  F5-KEY-USED                          VALUE "05". LVW000LS
                   88  F6-KEY-USED                          VALUE "06". LVW000LS
                   88  F7-KEY-USED                          VALUE "07". LVW000LS
                   88  F8-KEY-USED                          VALUE "08". LVW000LS
           02 FUN-KEY REDEFINES FUNCTION-NUM PIC XX.
           02 TERMINAL-ID PIC X(10).
           02 FORMAT-NAME PIC X(10).

       01  DISPLAY-STATUS              PIC X(2).

       01  SRF-INDICATORS.
           05  IND OCCURS 99 TIMES   PIC 1 INDICATOR 01.

       COPY IOFEEDBACK OF COPYLIB.
       01  FILE-STATUS.
           05  FILE-STATUS-1         PIC X.
           05  FILE-STATUS-2         PIC X.
       01  SAVE-PO-TERM              PIC X.
       01  SCREEN-BUFFER             PIC X(2000).
009500 01  CVF-FILLER                PIC X(10)  VALUE SPACES.
009600 01  KELLY-PO-WS               PIC X      VALUE SPACE.
009700 01  PRIOR-FRT-SW              PIC 9      VALUE 0.
009800     88  NO-PRIOR-FREIGHT                 VALUE 1.
009900 01  HOLD-FRT-RS-REFER         PIC X(14)  VALUE SPACES.
010000 01  PO-XXX                    PIC S99    VALUE ZEROS COMP-4.
010100 01  SEQ-NO-CONVERT            PIC 9(6).
       01  TERM-PO-AREA.
           05  FILLER                PIC X(11).
           05  TERM-PO-RS            PIC X(3).
010200 01  PRIOR-PO-WS.
010300     05  FILLER                PIC X       VALUE SPACE.
010400     05  PO-NUM-WS             PIC X(13)   VALUE SPACES.
010500
010510 01  WS-ACCUMULATOR.
010520     05  FILLER                PIC X(11)  VALUE SPACES.
010530     05  WS-PO-RCVR            PIC 9(3)   VALUE ZEROES.
010540
010600 01  PLANT-NUMBER.
010700     05  PLANT-PART1           PIC XX     VALUE SPACES.
010800         88  AKRON                        VALUE "11".
010900     05  FILLER                PIC X.
011000
011100 01  PLANT-NUMBER2.
011200     05  PLANT-DIGIT-1         PIC X.
011300         88  KELLY-PLANT                  VALUE "2".
011400     05  FILLER                PIC X(2).
011500
011600*----------  PURCHASE ORDER WORK AREA
011700 01  PO-RLSE-RS-WORKAREA.
011800     05  PO-RLSE-RS.
011900         10  PO-INDIC          PIC X      VALUE "P".
012000         10  PO-WS.
012100             15  WS-PO         PIC X(7)   VALUE SPACES.
012200             15  WS-RLSE       PIC X(3)   VALUE SPACES.
012300             15  WS-RS         PIC X(3)   VALUE SPACES.
012400
012500     05  FRT-RLSE-RS.
012600         10  FRT-INDIC         PIC X      VALUE "P".
012700         10  FRT-WS-PO         PIC X(7)   VALUE SPACES.
012800         10  FRT-WS-RLSE       PIC X(3)   VALUE SPACES.
012900         10  FRT-WS-RS         PIC X(3)   VALUE SPACES.
013000         10  FRT-WS-RS-9 REDEFINES FRT-WS-RS PIC 9(3).
013100
013200     05  RS-WORKAREA.
013300         10  RS-9              PIC 999.
013400         10  RS-X REDEFINES RS-9  PIC XXX.
013500
013600*----------  PRIOR FREIGHT INFORMATION FOR MULTI-FREIGHT PO'S
013700 01  PRIOR-TYPE                PIC X(2)    VALUE SPACES.
013800 01  PRIOR-BILL-NO.
013900     05  PRIOR-PO-LITERAL      PIC X(3)    VALUE "PO ".
014000     05  PRIOR-PO              PIC X(13)   VALUE SPACES.
014100*************************************************************
014200*                   CALLED SUBROUTINES                      *
014300*************************************************************
014400*----------  VSETERROR AND VPUTWINDOW
014500 01  MESSAGE-BUFFER.
014600     05  MSG-TEXT              PIC X(68)  VALUE SPACE.
014700     05  MSG-FLD               PIC X(8)   VALUE SPACE.
014800 01  MESSAGE-BUFLEN            PIC S9(4)  VALUE 76 COMP-4.
014900 01  MESSAGE-ACTLEN            PIC S9(4)  VALUE 76 COMP-4.
015000 01  FIELD-NUMBER              PIC S9(4)  VALUE 1  COMP-4.
015100
015200 COPY TBLOWUP  OF COPYLIB.
015400 COPY TDATECHK OF COPYLIB.
       COPY CATREAD  OF COPYLIB.
015500*************************************************************
015600*                 DATABASE VARIABLES                        *
015700*************************************************************
015900 01  FRT-ARG                   PIC X(14)  VALUE SPACES.
016100 COPY DBMODES OF COPYLIB.
016200 COPY DBSTAT  OF COPYLIB.
016300
017000 01  MPLTINFO-ARG             PIC X(4)    VALUE "PSQR".
018000*************************************************************
018100*                 DATABASE BUFFERS                          *
018200*************************************************************
018300 COPY DFREIGHT OF COPYLIB.
018310 COPY DPORECD OF COPYLIB.
018400 COPY MPORCV OF COPYLIB.
018500 COPY MPLTINFO OF COPYLIB.
018600 COPY DDAILYTC OF COPYLIB.
018700 COPY TC350 OF COPYLIB.
018800 COPY TC450 OF COPYLIB.
018900 COPY TC352 OF COPYLIB.
019000
019100 01  FREIGHT-SCREEN              PIC X(13)  VALUE "FREIGHT_4".
019110 01  FREIGHT-IT                  PIC X(14)  VALUE "FREIGHT_IT".
019200 01  KELLY-SCREEN                PIC X(9)   VALUE "SHIP_FROM".
       01  WT-SCREEN                   PIC X(14)  VALUE "WEIGHT_CHK".
9303CK 01  PACKSLIP-SCREEN             PIC X(9)   VALUE "PSLIP_CHK".
019300
019400*----------  FREIGHT SCREEN BUFFER AREA
       COPY FRTDOCK OF COPYLIB.

9303CK*-----------  PACKSLIP SCREEN FOR INVOICELESS MULTI FREIGHT PO'S
  .    01  PACKSLIP-SCREEN-BUFFER.
9303CK     05  PACK-SLIP-BUF           PIC X(12)  VALUE SPACES.

022200*-----------  KELLY SHIP FROM INFORMATION
022300 01  KELLY-SCREEN-BUFFER.
022400     05  KELLY-SCREEN-CITY       PIC X(12).
022500     05  KELLY-SCREEN-STATE      PIC X(2).
022600     05  KELLY-SCREEN-ZIP        PIC 9(9).
           05  DE-COMMAND2-LINE        PIC X(79)  VALUE SPACES.
           05  DE-FRT2-MESSAGE-LINE    PIC X(79)  VALUE SPACES.

      *-----------  RAW MATERIAL WEIGHT WARNING SCREEN
       01  WEIGHT-SCREEN-BUFFER.
           05  WEIGHT-RCVD-BUF         PIC Z(8)9.9999.
           05  WEIGHT-OF-FRT-BUF       PIC Z(8)9.9999.
022700 LINKAGE SECTION.
022800 COPY VCOMLINK OF COPYLIB.
022900
023000*----------  SCREEN BUFFER FOR PURCHASE ORDERS WITH SAME
023100*            FREIGHT INFORMATION
023200 01  ALL-PO-RLSE.
023300     05  DE-PO-RLSE OCCURS 7 TIMES.
023400        10  DE-PO              PIC X(7).
023500        10  DE-RLSE            PIC X(3).
           05  FILLER                PIC X(242).
023600
023700 COPY DOCKMISC OF COPYLIB.
023800*----------  FREIGHT DATA PASSED
023900 01  PASS-FREIGHT-DATA.
024000     05  OSD-PASS              PIC X(3).
024100     05  SAVE-RS-NUMBER        PIC X(3).
024200     05  SAVE-F8-EXIT-SW       PIC X.
024300     05  SAVE-PO-RCV-STAT      PIC X(4).
024400     05  SAVE-INTERNAL-FLAG    PIC X.
024500     05  FRT-SEQ-RCV           PIC X(6).
           05  PASS-CARRIER          PIC X(4).
024600 COPY LANGSUB OF COPYLIB.
      *----11/10/97 JSB, ONLY PASS RAW NET WEIGHT INSTEAD OF TABLE
       01  NET-RAW-WEIGHT         PIC S9(8)V9(4).
      *ITEM DATA-TABLE
      *01  ITEM-TABLE.
      *    05  SD-LINE OCCURS 13 TIMES.
      *COPY RCVITEM IN COPYLIB.
      *----11/10/97 JSB, NO LONGER PASS RAW MATERIAL GROUPS
      *01  RAW-MATERIAL-GROUP.
      *    05  RM-GROUP OCCURS 6 TIMES  PIC X(2).
      *01  ANY-MORE-ITEMS-FLAG           PIC X(1).
      *    88  ANY-MORE-ITEMS                      VALUE "Y".
      *01  RCVR-FLAG                 PIC X(1) VALUE SPACES.
      *    88  NEW-RCVR              VALUE "0".
      *    88  CONTINUE-RCVR         VALUE "1".
       01  ASN-RECEIVER.
           05  FILLER                PIC X(1).
           05  ASN-PO                PIC X(10).
           05  ASN-RS                PIC X(3).
024700
024800*************************************************************
024900*************************************************************
025000*                  MAIN  PROCESSING                         *
025100*       IF THIS IS A MULTI-FREIGHT BILL, DPOFREIGHT NEEDS   *
025200*   TO BE UPDATED WITH A REFERENCE BACK TO THE ORIGINAL     *
025300*   FREIGHT INFORMATION.  DISPLAY THE SCREEN AND ACCEPT     *
025400*   FREIGHT DATA IF THIS IS NOT A MULTI-FREIGHT BILL.  IN   *
025500*   EITHER CASE, UPDATE THE DATABASE AND WRITE TRANS-       *
025600*   ACTIONS 350, 352, AND 323.  THESE TRANSACTIONS MUST     *
025700*   BE WRITTEN IN THIS ORDER FOR IBM'S P7205 PROGRAM TO     *
025800*   HANDLE THEM PROPERLY.                                   *
025900*************************************************************
026000*************************************************************
026100 PROCEDURE DIVISION USING VIEW-COMAREA,
026200                          ALL-PO-RLSE,
026300                          MISCELLANEOUS-DATA,
026400                          PASS-FREIGHT-DATA,
026500                          LANGUAGE-PARMS,
                                NET-RAW-WEIGHT
      *---11/11/97 JSB, REMOVE THESE PARMS
      *                         ITEM-TABLE,
      *                         RAW-MATERIAL-GROUP,
      *                         ANY-MORE-ITEMS-FLAG,
      *                         RCVR-FLAG
                                ASN-RECEIVER.
026600
026700 FREIGHT-DISPLAY SECTION 04.
026800 00-SFREIGHT-MAIN.
           OPEN I-O  DPOFREIGHT-O
                     MPORCV-O
                     DISPLAY-FILE
                     MPLTINFO-O
                     KFRTERMS-O
                     DDAILYTC-O.
           OPEN INPUT DPORECD.
026900
027200     MOVE SPACES TO DDAILYTC-DATA.
           MOVE 1 TO DATE-MODE.
027300     CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
027400     MOVE DATE-YMD-OUT TO DDAILYTC-DATE.
027500     MOVE DATE-UNFORMATTED-TIME-OUT TO DDAILYTC-TIME.
027600
           MOVE "P" TO PO-INDIC, FRT-INDIC.
           MOVE "PO " TO PRIOR-PO-LITERAL.
           MOVE "PSQR" TO MPLTINFO-ARG.
           MOVE ZERO TO LANG-SETNUM, LANG-MSGNUM, FIELD-NUMBER.

           MOVE ZEROS TO WT-SCREEN-IDX.
           MOVE SPACES TO WEIGHT-SCREEN-BUFFER.
           INITIALIZE FREIGHT-SCREEN-BUFFER.

027800     PERFORM 100-CHECK-FOR-MULTI-FREIGHT THRU 109-EXIT.
027900
028000     IF NO-PRIOR-FREIGHT
028200        PERFORM 200-DISPLAY-SCREEN THRU 299-EXIT
028300        IF SAVE-F8-EXIT-SW = "Y"
028400           GO TO 09-EXIT.
028500
028700     PERFORM 300-UPDATE-DB THRU 399-EXIT.
028800
028900 09-EXIT.
           CLOSE     DPOFREIGHT-O
                     MPORCV-O
                     DISPLAY-FILE
                     MPLTINFO-O
                     DDAILYTC-O
                     KFRTERMS-O
                     DPORECD.
           GOBACK.
029000*************************************************************
029100*************************************************************
029200*     SEARCH FOR A PO THAT HAS ALREADY RECEIVED ITEMS       *
029300*     ON THIS SHIPMENT AND UPDATED DPOFREIGHT.  IF FOUND,   *
029400*     USE THE REFERENCE PO TO RETRIEVE THE FREIGHT DATA     *
029500*     AND HOLD THIS DATA TO USE LATER WHEN CREATING A NEW   *
029600*     SEGMENT IN DPOFREIGHT FOR THIS RECEIVING SLIP.        *
029700*************************************************************
029800*************************************************************
029900 100-CHECK-FOR-MULTI-FREIGHT.
030000     MOVE PLT-NUMBER-PASS       TO PLANT-NUMBER, PLANT-NUMBER2.
030100     MOVE 1                          TO PRIOR-FRT-SW.
030200     IF AKRON
030300        IF SAVE-INTERNAL-FLAG = "X"
030400           MOVE "N"                  TO TC350-FLAG-AREA
030500                                        TC352-FLAG-AREA
030600        ELSE
030700           MOVE SPACES               TO TC350-FLAG-AREA
030800                                        TC352-FLAG-AREA.
030900
031000     MOVE SPACES                     TO FREIGHT-SCREEN-BUFFER.
031100     MOVE DE-PO (1)                  TO FRT-WS-PO.
031200     MOVE DE-RLSE (1)                TO FRT-WS-RLSE.
031300     MOVE ZEROS                      TO FRT-WS-RS-9.
031400     MOVE FRT-RLSE-RS                TO FRT-ARG, MISC-RS-ARG.
           MOVE 0 TO COND-WORD.
           MOVE FRT-ARG TO PORCVNO OF DPOFREIGHT-REC.
           START DPOFREIGHT-O KEY = PORCVNO OF DPOFREIGHT-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
031500
031800     IF COND-WORD NOT = 0
031900         IF COND-WORD = 17
032000             GO TO 109-EXIT
032100         ELSE
032200           MOVE "DBFIND1 DFREIGHT- SFREIGHT" TO BU-DISPLAY-MSG
032300           PERFORM 990-BLOWUP THRU 999-EXIT.
032400
           MOVE 0 TO COND-WORD.
           READ DPOFREIGHT-O NEXT INTO BUF-DPOFREIGHT
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPOFREIGHT-REC NOT = FRT-ARG
               MOVE 15 TO COND-WORD.
032700     IF COND-WORD NOT = 0
032800         IF COND-WORD = 15
032900             GO TO 109-EXIT
033000         ELSE
033100           MOVE "DBGET1 DFREIGHT - SFREIGHT" TO BU-DISPLAY-MSG
033200           PERFORM 990-BLOWUP THRU 999-EXIT.
033300
033400*----------  IF REFER BACK PO IS BLANK, THIS ENTRY WAS ADDED
033500*            BY INVOICING PROGRAMS, NOT BY RECEIVING PROGRAMS.
033600     IF FRT-REFERBACK = SPACES
033700        GO TO 109-EXIT.
033800
033900     MOVE FRT-REFERBACK               TO  FRT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE FRT-ARG TO PORCVNO OF DPOFREIGHT-REC.
           START DPOFREIGHT-O KEY = PORCVNO OF DPOFREIGHT-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
031500
031800     IF COND-WORD NOT = 0
031900         IF COND-WORD = 17
032000             GO TO 109-EXIT
032100         ELSE
032200           MOVE "DBFIND2 DFREIGHT- SFREIGHT" TO BU-DISPLAY-MSG
032300           PERFORM 990-BLOWUP THRU 999-EXIT.
032400
           MOVE 0 TO COND-WORD.
           READ DPOFREIGHT-O NEXT INTO BUF-DPOFREIGHT
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPOFREIGHT-REC NOT = FRT-ARG
               MOVE 15 TO COND-WORD.
032700     IF COND-WORD NOT = 0
032800         IF COND-WORD = 15
032900             GO TO 109-EXIT
033000         ELSE
033100           MOVE "DBGET2 DFREIGHT - SFREIGHT" TO BU-DISPLAY-MSG
033200           PERFORM 990-BLOWUP THRU 999-EXIT.
035100
035200     MOVE 0                          TO PRIOR-FRT-SW.
035300     MOVE FRT-ARG                    TO PRIOR-PO-WS
035400                                        HOLD-FRT-RS-REFER.
035500     MOVE PO-NUM-WS                  TO PRIOR-PO.
035600     MOVE "M "                       TO PRIOR-TYPE.
035700     MOVE FRT-OSD                    TO OSD-PASS.
035800     MOVE SPACES                     TO MISC-FRT-COMMENT.
035900     IF NOT AKRON
036000        GO TO 109-EXIT.
036100
036200     IF TC350-FLAG-AREA = SPACES
036300         IF FRT-TYPE = "C" OR FRT-TYPE = "G"
036400             MOVE FRT-TYPE           TO TC350-FLAG-AREA
036500                                        TC352-FLAG-AREA.
036600
036700 109-EXIT.  EXIT.
036800*************************************************************
036900*            DISPLAY THE FREIGHT SCREEN AND MOVE            *
037000*            THE INPUT BUFFER INTO THE PRINT BUFFER.        *
037100*************************************************************
037200 200-DISPLAY-SCREEN.
037201*-------- TRAFFIC DEPARTMENT CHANGED THEIR MIND 2-5-88
037210*    IF SAVE-INTERNAL-FLAG = "X"
037220*       MOVE FREIGHT-IT         TO VIEW-NFNAME
037230*    ELSE
037300        MOVE FREIGHT-SCREEN     TO VIEW-NFNAME.
038600     MOVE SPACES                         TO FREIGHT-SCREEN-BUFFER.
           MOVE ZEROES  TO CARR-WT-BUF, OUR-WT-BUF,
                           FREIGHT-CHARGES-BUF9.
038700
038800     IF AKRON
038900        IF MISC-ZBILL NOT = SPACES
039000            MOVE MISC-ZBILL              TO Z-BILL-BUF.
039100
039101*-------- TRAFFIC DEPARTMENT CHANGED THEIR MIND 2-5-88
039110*    IF SAVE-INTERNAL-FLAG = "X"
039120*       MOVE "G"                           TO TYPE-FREIGHT-BUF.
039130
039200     MOVE MISC-PO-FOB                      TO SCR-FOB.
039300     MOVE MISC-PO-VIA                      TO SCR-VIA.
039310
039320*----------  GET FREIGHT TERMS FROM DPORECD
           MOVE SPACES TO SAVE-PO-TERM.
039321     MOVE MISC-RS-ARG TO WS-ACCUMULATOR.
039322     MOVE ZEROES TO WS-PO-RCVR.
039323     MOVE MISC-RS-ARG TO BU-DISPLAY-FLD (2).
039330*----------  RETRIEVE PO RECORD
           MOVE 0 TO COND-WORD.
           MOVE MISC-RS-ARG    TO PORCVNO    OF DPORECD-REC.
           START DPORECD KEY = PORCVNO OF DPORECD-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
039333     IF COND-WORD NOT = 0
039334           MOVE "DBFIND DPORECD 200 SFREIGHT " TO BU-DISPLAY-MSG
039335           MOVE WS-ACCUMULATOR              TO BU-DISPLAY-FLD (1)
039336           PERFORM 990-BLOWUP THRU 999-EXIT.
           MOVE 0 TO COND-WORD.
           READ DPORECD NEXT INTO BUF-DPORECD
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPORECD-REC NOT = MISC-RS-ARG
               MOVE 15 TO COND-WORD.
039339     IF COND-WORD NOT = 0
039340           MOVE "DBGET DPORECD 200 SFREIGHT  " TO BU-DISPLAY-MSG
039341           MOVE WS-ACCUMULATOR              TO BU-DISPLAY-FLD (1)
039342           PERFORM 990-BLOWUP THRU 999-EXIT.
039343
039344     MOVE PO-FREIGHT-TERMS TO TYPE-FREIGHT-BUF, SAVE-PO-TERM.
      *-------- INTERNAL ORDERS CAN ONLY BE PREPAID.   7/22/97
           IF SAVE-INTERNAL-FLAG = "X"
              MOVE "P"                           TO TYPE-FREIGHT-BUF.

      *----4/30/97, IF ASN RECEIPT RETRIEVE FRT DATA TO DISPLAY
           IF ASN-RECEIVER NOT = SPACES
               MOVE ASN-RECEIVER TO PORCVNO OF DPOFREIGHT-REC
               READ DPOFREIGHT-O INTO BUF-DPOFREIGHT
                 INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS NOT = "00"
                   MOVE "READ DFREIGHT ASN 200" TO BU-DISPLAY-MSG
                   MOVE ASN-RECEIVER TO BU-DISPLAY-FLD(1)
                   PERFORM 990-BLOWUP THRU 999-EXIT
               END-IF
               MOVE FRT-TYPE TO TYPE-FREIGHT-BUF
               MOVE FRT-EMPL TO EMPLOYEE-BUF
               MOVE FRT-PACK-SLIP TO P-SLIP-NO-BUF
               MOVE FRT-CARRIER TO CARRIER-BUF
               MOVE FRT-CARRIER-WT TO CARR-WT-BUF
               MOVE FRT-SEALS TO SEALS-BUF
               MOVE FRT-BILL-NO TO FREIGHT-NO-BUF
               MOVE FRT-RAIL-CAR TO CAR-NO-BUF
               MOVE FRT-YY TO YY-BUF
               MOVE FRT-MM TO MM-BUF
               MOVE FRT-DD TO DD-BUF
           END-IF.

039910 210-SHOW-FORM.
           MOVE FREIGHT-SCREEN-BUFFER TO SCREEN-BUFFER.
           MOVE SCREEN-BUFFER TO DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
              INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO SRF-INDICATORS.
           MOVE DISPLAY-REC TO SCREEN-BUFFER.

      *------ A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *------ IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.
035800
           MOVE SCREEN-BUFFER TO FREIGHT-SCREEN-BUFFER.
041300
041400     IF VIEW-LASTKEY = 3 OR VIEW-LASTKEY = 7
041500        MOVE "Y"                            TO SAVE-F8-EXIT-SW
041600        GO TO 299-EXIT.
041700
041800*----------  IF F2 IS PRESSED BECAUSE OF FREIGHT CHARGES
041900*            WARNING MSG, THEN USER WANTS TO ENTER AN AMOUNT
042000*            GREATER THAN 100,000 SO CONTINUE
           IF LANG-MSGNUM = 13
042100     IF VIEW-LASTKEY = 2
042300          GO TO 212-AFTER-VALIDATION.
042400*---------- READ DATA BUFFER
042910
PDR   ****************************************************************
PDR   *     COMMENTED OUT THE FOLLOWING SENTENCE 1/31/92.  IT IS     *
PDR   *     NO LONGER VALID TO USE "G" ACCORDING TO BETH ADCOCK      *
PDR   *     IN GADSDEN. - FREIGHT USER COORDINATOR                   *
PDR   ****************************************************************
PDR   *----------  IF INTERNAL ORDER, TYPE MUST BE 'G'
PDR   *    IF SAVE-INTERNAL-FLAG = "X"
PDR   *      IF TYPE-FREIGHT-BUF = "P"
PDR   *       MOVE "G"                           TO TYPE-FREIGHT-BUF.
042940
043000*************************************************************
043100*    11-6-85  CHECK IF PACKING SLIP NUMBER IS ENTERED IF    *
043200*             THE VENDOR SWITCH IS "Y".  RIGHT NOW, THIS    *
043300*             WILL ONLY BE FOR AKRON, BUT THE WAY THE LOGIC *
043400*             IS SET UP, OTHER PLANTS CAN USE THIS WITH NO  *
043500*             PROGRAMMING CHANGE TO THIS SUBROUTINE.        *
043600*************************************************************
043700     IF VENDOR-SW = "Y"
043800        IF P-SLIP-NO-BUF = SPACES
043900*       ***  PACKING SLIP NUMBER IS REQUIRED  ***
044000        MOVE 16                     TO LANG-SETNUM
044100        MOVE 109                    TO LANG-MSGNUM
044200        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
044300        MOVE 20                     TO FIELD-NUMBER
044400        PERFORM 940-VSETERROR THRU 949-EXIT
044500        GO TO 210-SHOW-FORM.
044600
044700     MOVE SPACES                    TO MESSAGE-BUFFER.
044800     MOVE ZEROES                    TO LANG-SETNUM,
044900                                       LANG-MSGNUM.
045000     MOVE KELLY-PO-IND               TO KELLY-PO-WS.
045100     CALL "CVALFRT" USING PLT-NUMBER, MESSAGE-BUFFER,
045200                          FIELD-NUMBER, KELLY-PO-WS,
045300                          FREIGHT-SCREEN-BUFFER,
045400                          LANGUAGE-PARMS, CVF-FILLER.
045500
046000     IF MESSAGE-BUFFER NOT = SPACES
046100        PERFORM 940-VSETERROR THRU 949-EXIT
046200        GO TO 210-SHOW-FORM.
046300     IF LANG-SETNUM NOT = ZEROES
046400        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
046500        PERFORM 940-VSETERROR THRU 949-EXIT
046600        GO TO 210-SHOW-FORM.
046700
046800 212-AFTER-VALIDATION.
046900     IF NOT KELLY-PLANT
047000        GO TO 215-FREIGHT.
047100
047200*----------  GET KELLY SHIP FROM INFORMATION
047300     MOVE KELLY-SCREEN TO VIEW-NFNAME.
           MOVE ZEROES       TO KELLY-SCREEN-ZIP.
048600
           MOVE KELLY-SCREEN-BUFFER TO SCREEN-BUFFER.
           MOVE SCREEN-BUFFER TO DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
              INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO SRF-INDICATORS.
           MOVE DISPLAY-REC TO SCREEN-BUFFER.

      *------ A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *------ IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.
           MOVE SCREEN-BUFFER TO KELLY-SCREEN-BUFFER.
050000
050100     IF VIEW-LASTKEY = 3
050200        MOVE "Y" TO SAVE-F8-EXIT-SW
050300        GO TO 299-EXIT.
051000 215-FREIGHT.
051100     IF NOT AKRON
051200        GO TO 217-WEIGHT.
051300
051400*----------  COLLECT CHARGE CHECK
051500     IF TYPE-FREIGHT-BUF = "C" OR "G"
051600         IF CAR-NO-BUF = SPACES
051700             IF FREIGHT-CHARGES-BUF9 = ZEROES
051800*                ***  FREIGHT CHARGES MUST BE ENTERED ***
051900                 MOVE   6 TO LANG-SETNUM
052000                 MOVE  11 TO LANG-MSGNUM
052100                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
052200                 MOVE ZEROES         TO   MSG-FLD
052300                 MOVE 6              TO   FIELD-NUMBER
052400                 PERFORM  940-VSETERROR  THRU  949-EXIT
052500                 GO TO  210-SHOW-FORM.
052600
052700*----------  FILL IN THE TRANSACTION FLAGS
052800     IF TC350-FLAG-AREA = SPACES
052900         IF TYPE-FREIGHT-BUF = "C" OR "G"
053000             MOVE TYPE-FREIGHT-BUF   TO TC350-FLAG-AREA
053100                                        TC352-FLAG-AREA.
053200
053300     IF AKRON
053400       IF MISC-ZBILL NOT = SPACES
053500         IF Z-BILL-BUF NOT = MISC-ZBILL
053600*            *** CAN NOT ENTER ANOTHER ZBILL NUMBER ***
053700             MOVE   3                TO LANG-SETNUM
053800             MOVE  41                TO LANG-MSGNUM
053900             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
054000             MOVE MISC-ZBILL      TO MSG-FLD
054100             MOVE 17                 TO FIELD-NUMBER
054200             PERFORM 940-VSETERROR THRU 949-EXIT
054300             GO TO 210-SHOW-FORM.

       217-WEIGHT.
      * CHECK RAW MATERIAL WEIGHT AGAINST CARRIER'S WEIGHT.
      *   THIS IS ONLY DONE ON INVOICELESS PO'S.
           IF PO-INVOICELESS-IND NOT = "X"
               GO TO 220-MOVE-DATA.
           PERFORM 230-CHECK-RAW-WT THRU 230-CRW-EXIT.
           IF SAVE-F8-EXIT-SW = "Y"
               GO TO 299-EXIT.
054400
054500 220-MOVE-DATA.
054600     MOVE OSD-NO-BUF                 TO OSD-PASS.
054700     MOVE COMMENT-BUF                TO MISC-FRT-COMMENT.
054800 299-EXIT.  EXIT.

       230-CHECK-RAW-WT.
      *--11/11/97 JSB, REMOVE THIS LOGIC, NET WEIGHT PASSED AS PARM
      *    MOVE 2 TO PO-IDX.
      *    MOVE "N" TO MULTI-PO-SW.
      *----IF MULTI PO'S ON THIS FREIGHT, DO NOT CHECK WEIGHT
      *    PERFORM
      *        UNTIL PO-IDX > 7 OR MULTI-PO-SW = "Y"
      *      IF DE-PO(PO-IDX) NOT = SPACES
      *          MOVE "Y" TO MULTI-PO-SW
      *      ELSE
      *          ADD 1 TO PO-IDX
      *      END-IF
      *    END-PERFORM.
      *    IF MULTI-PO-SW = "Y"
      *        GO TO 230-CRW-EXIT.
      *----FOR EACH ITEM, IF ITS UM=LB AND IT IS IDENTIFIED AS A
      *----  A RAW MATERIAL IN THE PLANT THEN ADD ITS QTY RCVED
      *----  TO THE TOTAL WEIGHT RCVED.
      *    MOVE 1 TO ITEM-IDX.
      *230-CHECK-ITEM.
      *    IF ITEM-IDX > 13
      *        GO TO 230-CHECK-ITEM-END.
      *    IF SD-CODE(ITEM-IDX) = SPACES
      *        ADD 1 TO ITEM-IDX
      *        GO TO 230-CHECK-ITEM.
      *    IF NOT KELLY-PLANT
      *        IF SD-UM(ITEM-IDX) NOT = "LB"
      *            ADD 1 TO ITEM-IDX
      *            GO TO 230-CHECK-ITEM
      *        END-IF
      *    ELSE
      *        IF SD-KELLY-PO-UM(ITEM-IDX) NOT = "LB"
      *            ADD 1 TO ITEM-IDX
      *            GO TO 230-CHECK-ITEM
      *        END-IF
      *    END-IF.
      *    MOVE 1 TO RAW-IDX.
      *    MOVE "N" TO RAW-SW.
      *    PERFORM
      *      UNTIL RAW-IDX > 6 OR RAW-SW = "Y"
      *        IF SD-MAJOR-GROUP(ITEM-IDX) = RM-GROUP(RAW-IDX)
      *            MOVE "Y" TO RAW-SW
      *        ELSE
      *            ADD 1 TO RAW-IDX
      *        END-IF
      *    END-PERFORM.
      *    IF RAW-SW = "Y"
      *        ADD 1 TO WT-SCREEN-IDX
      *        MOVE SD-ITM(ITEM-IDX) TO WEIGHT-ITEM-BUF(WT-SCREEN-IDX)
      *        MOVE SD-CODE(ITEM-IDX) TO WEIGHT-CODE-BUF(WT-SCREEN-IDX)
      *        MOVE SD-PO-QTY-DLVR(ITEM-IDX) TO
      *                                  WEIGHT-QTY-BUF(WT-SCREEN-IDX)
      *        ADD  SD-PO-QTY-DLVR(ITEM-IDX) TO NET-RAW-WEIGHT
      *        IF NOT KELLY-PLANT
      *            MOVE SD-UM(ITEM-IDX) TO WEIGHT-UM-BUF(WT-SCREEN-IDX)
      *        ELSE
      *            MOVE SD-KELLY-PO-UM(ITEM-IDX) TO
      *                                    WEIGHT-UM-BUF(WT-SCREEN-IDX)
      *        END-IF
      *    END-IF.
      *    ADD 1 TO ITEM-IDX.
      *    GO TO 230-CHECK-ITEM.
      *230-CHECK-ITEM-END.
           IF NET-RAW-WEIGHT > CARR-WT-BUF
               MOVE NET-RAW-WEIGHT TO WEIGHT-RCVD-BUF
               MOVE CARR-WT-BUF TO WEIGHT-OF-FRT-BUF
               PERFORM 231-RAW-WT-WARNING THRU 231-RWW-EXIT.
       230-CRW-EXIT.
           EXIT.

       231-RAW-WT-WARNING.
           MOVE WT-SCREEN TO VIEW-NFNAME.
           MOVE WEIGHT-SCREEN-BUFFER TO DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.
           READ DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.
           IF VIEW-LASTKEY = 3 OR VIEW-LASTKEY = 7
               MOVE "Y" TO SAVE-F8-EXIT-SW.
       231-RWW-EXIT.
           EXIT.


054900*************************************************************
055000*************************************************************
055100*        UPDATE RECEIVING SLIP NUMBER IN M-PO-RCV-STAT        *
055200*************************************************************
055300*************************************************************
055400 300-UPDATE-DB.
      *----4/30/97, IF ASN RECEIPT SKIP CREATING NEW RS
           IF ASN-RECEIVER NOT = SPACES
               MOVE ASN-RS TO FRT-WS-RS
                              SAVE-RS-NUMBER
               MOVE ASN-RECEIVER TO PORCVNO OF MPORCV-REC
               READ MPORCV-O INTO BUF-MPORCV
               MOVE M-PO-RCV-SEQ TO FRT-SEQ-RCV
               GO TO 300-UPDATE-FRT.
056200*----------  GET NEXT SEQUENCE NUMBER FOR RECEIVING SLIP
056300*            (DONE FOR ALL, BUT USED ONLY IN KELLY PLANTS)
           MOVE 0 TO COND-WORD.
           MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
057100     IF COND-WORD NOT = 0
057200        MOVE "DBGET MPLTINFO 300 SFREIGHT" TO BU-DISPLAY-MSG
057300        PERFORM 990-BLOWUP THRU 999-EXIT.
057400
057500     ADD 1                          TO MPLTINFO-RCV-SEQ.
           MOVE 0 TO COND-WORD.
           REWRITE MPLTINFO-REC FROM BUF-MPLTINFO
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
057800     IF COND-WORD NOT = 0
057900        MOVE "DBUPDATE MPLTINFO 300 SFREIGHT" TO BU-DISPLAY-MSG
058000        PERFORM 990-BLOWUP THRU 999-EXIT.
058900
059000     MOVE DE-PO (1)                  TO  FRT-WS-PO.
059100     MOVE DE-RLSE (1)                TO  FRT-WS-RLSE.
059200     MOVE ZEROS                      TO  FRT-WS-RS-9.
059300     MOVE FRT-RLSE-RS                TO  FRT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE FRT-ARG TO PORCVNO OF MPORCV-REC.
           READ MPORCV-O INTO BUF-MPORCV
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
059600     IF COND-WORD NOT = 0
059700           MOVE "DBGET MPORCV   - SFREIGHT" TO BU-DISPLAY-MSG
059800           MOVE FRT-ARG                     TO BU-DISPLAY-FLD (2)
059900           PERFORM 990-BLOWUP THRU 999-EXIT.
060000
060100     MOVE ZEROS                      TO RS-WORKAREA.
060200     IF M-PO-LAST-RCVR = SPACES
060300         MOVE 001                    TO RS-9
060400     ELSE
060500         MOVE M-PO-LAST-RCVR TO RS-X
060600         ADD  1                      TO RS-9.
060700
060800     MOVE RS-X                       TO SAVE-RS-NUMBER
060900                                        M-PO-RCV-STAT.
           MOVE 0 TO COND-WORD.
           REWRITE MPORCV-REC FROM BUF-MPORCV
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
061200     IF COND-WORD NOT = 0
061300           MOVE "DBUPDATE MPORCV- SFREIGHT" TO BU-DISPLAY-MSG
061400           PERFORM 990-BLOWUP THRU 999-EXIT.
061500*************************************************************
061600*          CREATE A NEW RECEIVING SLIP                      *
061700*************************************************************
061800     MOVE SAVE-RS-NUMBER             TO FRT-WS-RS-9.
061900     MOVE FRT-RLSE-RS                TO M-PO-RCV-NO.
062000     MOVE SAVE-PO-RCV-STAT           TO M-PO-RCV-STAT.
062100     MOVE MPLTINFO-RCV-SEQ           TO SEQ-NO-CONVERT.
062200     MOVE SEQ-NO-CONVERT             TO M-PO-RCV-SEQ, FRT-SEQ-RCV.
062300
           MOVE 0 TO COND-WORD.
           WRITE MPORCV-REC FROM BUF-MPORCV
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
062600     IF COND-WORD NOT = 0
062700           MOVE "DBPUT MPORCV   - SFREIGHT" TO BU-DISPLAY-MSG
062800           MOVE FRT-WS-RS-9                 TO BU-DISPLAY-FLD (2)
                 MOVE FRT-RLSE-RS TO BU-DISPLAY-FLD (3)
062900           PERFORM 990-BLOWUP THRU 999-EXIT.
063000
063500*************************************************************
063600*        UPDATE FREIGHT SEGMENT WITH FREIGHT DATA           *
063700*************************************************************
       300-UPDATE-FRT.
      *-----4/30/97, IF ASN RECEIPT FRT HAS BEEN RETRIEVED INTO BUF
           IF ASN-RECEIVER = SPACES
               MOVE SPACES                     TO  BUF-DPOFREIGHT
               MOVE DE-PO (1)                  TO  FRT-WS-PO
               MOVE DE-RLSE (1)                TO  FRT-WS-RLSE
               MOVE SAVE-RS-NUMBER             TO  FRT-WS-RS-9
               MOVE FRT-RLSE-RS                TO  FRT-PO-RCV-NO
           END-IF.
           IF FRT-CHARGES-X = SPACES
              MOVE ZEROES TO FRT-CHARGES-9.

      *---------- FORMAT FREIGHT BILL DATE.
           IF FREIGHT-DATE-BUF NUMERIC
               MOVE 3                TO  DATE-MODE
               MOVE FREIGHT-DATE-BUF TO  DATE-VALIDATE-IN
               CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
           ELSE
               MOVE SPACES           TO  DATE-YMD-OUT.

064800     IF NO-PRIOR-FREIGHT
065000         MOVE TYPE-FREIGHT-BUF       TO  FRT-TYPE
065100         MOVE EMPLOYEE-BUF           TO  FRT-EMPL
065200         MOVE P-SLIP-NO-BUF          TO  FRT-PACK-SLIP
065400         MOVE CARRIER-BUF            TO  FRT-CARRIER
                                               PASS-CARRIER
065500         MOVE FREIGHT-NO-BUF         TO  FRT-BILL-NO
065700         MOVE FREIGHT-CHARGES-BUF9   TO  FRT-CHARGES-9
065900         MOVE ORIGIN-BUF             TO  FRT-SPLC
066000         MOVE CARR-WT-BUF            TO  FRT-CARRIER-WT
066200         MOVE OUR-WT-BUF             TO  FRT-OUR-WT
066300         MOVE CAR-NO-BUF             TO  FRT-RAIL-CAR
066400         MOVE LOT-NO-BUF             TO  FRT-LOT
066600         MOVE SEALS-BUF              TO  FRT-SEALS
066700         MOVE OSD-NO-BUF             TO  FRT-OSD
066800******   MOVE YY-BUF                 TO  FRT-YY
066900******   MOVE MM-BUF                 TO  FRT-MM
067000******   MOVE DD-BUF                 TO  FRT-DD
               MOVE DATE-YMD-OUT           TO  FRT-BILL-DATE
               IF FRT-YY = SPACES
                   MOVE SPACES TO FRT-CC
               ELSE
                   IF FRT-YY > "70"
                       MOVE "19" TO FRT-CC
                   ELSE
                       MOVE "20" TO FRT-CC
                   END-IF
               END-IF
               MOVE SPACES                 TO  FRT-REFERBACK
               MOVE Z-BILL-BUF             TO  FRT-ZBILL
               MOVE COMMENT-BUF            TO  FRT-OSD-CLAIM
           ELSE
9303CK         PERFORM 400-CHECK-PO-FOR-INVOICELESS
  .            INITIALIZE PACKSLIP-SCREEN-BUFFER
  .            IF PO-INVOICELESS-IND = "X"
      *---11/11/97 JSB, NO LONGER NEEDED, ALWAYS A NEW RECEIVER
  .   *           IF NEW-RCVR
  .                  PERFORM 401-SHOW-PACKSLIP-SCREEN
  .   *           END-IF
9303CK         END-IF

      *--- MOVE FRT CHARGES FOR TC 450 OR 350 CHECK LATER
               MOVE FRT-CHARGES-9          TO  FREIGHT-CHARGES-BUF9
               MOVE SPACES                 TO  BUF-DPOFREIGHT
               MOVE ZEROES                 TO FRT-CHARGES-9
                                              FRT-CARRIER-WT
                                              FRT-OUR-WT
               MOVE FRT-RLSE-RS            TO  FRT-PO-RCV-NO
               MOVE HOLD-FRT-RS-REFER      TO  FRT-REFERBACK
9303CK         MOVE PACK-SLIP-BUF          TO  FRT-PACK-SLIP
               MOVE PRIOR-TYPE             TO  FRT-TYPE
               MOVE PRIOR-BILL-NO          TO  FRT-BILL-NO.

      *---11/11/97 JSB, NO LONGER NEEDED
9303CK*    IF ANY-MORE-ITEMS
  .   *       SET CONTINUE-RCVR TO TRUE
  .   *    ELSE
9303CK*       SET NEW-RCVR TO TRUE.

           MOVE DDAILYTC-DATE              TO FRT-DATE-RCVD.
           IF FRT-DATE-RCVD-YY > "70"
               MOVE "19"                   TO FRT-DATE-RCVD-CC
           ELSE
               MOVE "20"                   TO FRT-DATE-RCVD-CC.
           IF FRT-CHARGES-X = SPACES
              MOVE ZEROES TO FRT-CHARGES-9.
           MOVE 0 TO COND-WORD.
      *------4/30/97, IF ASN RECEIPT REWRITE OTHERWISE WRITE NEW REC
           IF ASN-RECEIVER = SPACES
               WRITE DPOFREIGHT-REC FROM BUF-DPOFREIGHT
                   INVALID KEY MOVE 99 TO COND-WORD
           ELSE
               MOVE SPACES TO FRT-ASN-INDIC
               REWRITE DPOFREIGHT-REC FROM BUF-DPOFREIGHT
                   INVALID KEY MOVE 99 TO COND-WORD
           END-IF.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
068200     IF COND-WORD NOT = 0
068300           MOVE "DBPUT1 DFREIGHT - SFREIGHT" TO BU-DISPLAY-MSG
068400           PERFORM 990-BLOWUP THRU 999-EXIT.
068900*************************************************************
069000*   IF PRIOR FREIGHT, DELETE THE ACCUMULATOR FREIGHT ENTRY  *
069100*************************************************************
069200     IF NO-PRIOR-FREIGHT
069300        GO TO 310-ADD-MULTI-PO.
069400
069500     MOVE DE-PO (1)                  TO  FRT-WS-PO.
069600     MOVE DE-RLSE (1)                TO  FRT-WS-RLSE.
069700     MOVE ZEROS                      TO  FRT-WS-RS-9.
069800     MOVE FRT-RLSE-RS                TO  FRT-ARG.
069900
           MOVE 0 TO COND-WORD.
           MOVE FRT-ARG TO PORCVNO OF DPOFREIGHT-REC.
           START DPOFREIGHT-O KEY = PORCVNO OF DPOFREIGHT-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
070200     IF COND-WORD NOT = 0
070300           MOVE "DBFIND DFREIGHT- SFREIGHT" TO BU-DISPLAY-MSG
070400           PERFORM 990-BLOWUP THRU 999-EXIT.
070500
           MOVE 0 TO COND-WORD.
           READ DPOFREIGHT-O NEXT INTO BUF-DPOFREIGHT
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPOFREIGHT-REC NOT = FRT-ARG
               MOVE 15 TO COND-WORD.
070800     IF COND-WORD NOT = 0
070900           MOVE "DBGET1 DFREIGHT - SFREIGHT" TO BU-DISPLAY-MSG
071000           PERFORM 990-BLOWUP THRU 999-EXIT.
071600
           MOVE 0 TO COND-WORD.
           DELETE DPOFREIGHT-O INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
071800     IF COND-WORD NOT = 0
071900           MOVE "DBGET2 DFREIGHT - SFREIGHT" TO BU-DISPLAY-MSG
072000           PERFORM 990-BLOWUP THRU 999-EXIT.
072100
072600*************************************************************
072700*      IF MULTIPLE PO'S WERE ENTERED, ADD A NEW             *
072800*      DPOFREIGHT SEGMENT CONTAINING THE PO NUMBER          *
072900*      AND THIS RECEIVING SLIP NUMBER IN THE                *
073000*      REFER-BACK FIELD.                                    *
073100*************************************************************
073200 310-ADD-MULTI-PO.
073800     MOVE DE-PO (1)                  TO WS-PO.
073900     MOVE DE-RLSE (1)                TO WS-RLSE.
074000     MOVE SAVE-RS-NUMBER             TO WS-RS.
074100
074200     MOVE 2                          TO PO-XXX.
074300
074400 320-FIND-MULTI-PO.
074500     IF PO-XXX > 7
074600         GO TO 322-ADD-MULTI-ITEMS.
074700
074800     IF DE-PO (PO-XXX) = SPACES
074900         ADD 1                       TO PO-XXX
075000         GO TO 320-FIND-MULTI-PO.
075100
075200     MOVE SPACES                     TO  BUF-DPOFREIGHT.
075300     MOVE DE-PO (PO-XXX)             TO  FRT-WS-PO.
075400     MOVE DE-RLSE (PO-XXX)           TO  FRT-WS-RLSE.
075500     MOVE ZEROES                     TO  FRT-WS-RS-9.
075600     MOVE FRT-RLSE-RS                TO  FRT-PO-RCV-NO.
075700     MOVE PO-RLSE-RS                 TO  FRT-REFERBACK.
075800     MOVE DDAILYTC-DATE TO FRT-DATE-RCVD.
075900
           MOVE 0 TO COND-WORD.
           WRITE DPOFREIGHT-REC FROM BUF-DPOFREIGHT
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
076200     IF COND-WORD NOT = 0
076300           MOVE "DBPUT2 DFREIGHT - SFREIGHT" TO BU-DISPLAY-MSG
076400           PERFORM 990-BLOWUP THRU 999-EXIT.
076500
      *----RESET DE-PO SO AS NOT TO PROCESS AGAIN IF MORE THAN 12 ITEMS
           MOVE SPACES TO DE-PO (PO-XXX).

076600     ADD 1                           TO  PO-XXX.
076700     GO TO 320-FIND-MULTI-PO.

       322-ADD-MULTI-ITEMS.
      *--11/11/97 JSB, NO LONGER NEEDED NO MORE REFERBACK FOR > 12 ITEMS
      *    IF NOT ANY-MORE-ITEMS
      *        GO TO 325-UNLOCK-FREIGHT.
      *----CHECK FOR REFERBACK TO A REFERBACK
      *    MOVE PO-RLSE-RS TO FRT-ARG.
      *    MOVE FRT-ARG TO PORCVNO OF DPOFREIGHT-REC.
      *    START DPOFREIGHT-O KEY = PORCVNO OF DPOFREIGHT-REC
      *        INVALID KEY MOVE 17 TO COND-WORD.
      *    IF FILE-STATUS NOT = "00"
      *        IF FILE-STATUS-1 = "2"
      *            MOVE 17 TO COND-WORD
      *        ELSE
      *            MOVE 99 TO COND-WORD.
      *    IF COND-WORD NOT = 0
      *          MOVE "DBFIND DFREIGHT- 322 SFREIGHT" TO BU-DISPLAY-MSG
      *          MOVE PO-RLSE-RS TO BU-DISPLAY-FLD (1)
      *          MOVE FILE-STATUS TO BU-DISPLAY-FLD (3)
      *          PERFORM 990-BLOWUP THRU 999-EXIT.
      *    MOVE 0 TO COND-WORD.
      *    READ DPOFREIGHT-O NEXT INTO BUF-DPOFREIGHT
      *        AT END MOVE 15 TO COND-WORD.
      *    IF FILE-STATUS NOT = "00"
      *        IF FILE-STATUS = "10" OR "14" OR "46"
      *            MOVE 15 TO COND-WORD
      *        ELSE
      *            MOVE 99 TO COND-WORD.
      *    IF PORCVNO OF DPOFREIGHT-REC NOT = FRT-ARG
      *        MOVE 15 TO COND-WORD.
      *    IF COND-WORD NOT = 0
      *          MOVE "DBGET DFREIGHT -322 SFREIGHT" TO BU-DISPLAY-MSG
      *          MOVE PO-RLSE-RS TO BU-DISPLAY-FLD (1)
      *          MOVE FILE-STATUS TO BU-DISPLAY-FLD (3)
      *          PERFORM 990-BLOWUP THRU 999-EXIT.
      *    IF FRT-REFERBACK NOT = SPACES
      *        MOVE FRT-REFERBACK TO REFERBACK-REFERBACK
      *    ELSE
      *        MOVE SPACES TO REFERBACK-REFERBACK.
      *
      *    MOVE SPACES                     TO  BUF-DPOFREIGHT.
      *    MOVE DE-PO (1)                  TO  FRT-WS-PO.
      *    MOVE DE-RLSE (1)                TO  FRT-WS-RLSE.
      *    MOVE ZEROES                     TO  FRT-WS-RS-9.
      *    MOVE FRT-RLSE-RS                TO  FRT-PO-RCV-NO.
      *    IF REFERBACK-REFERBACK = SPACES
      *        MOVE PO-RLSE-RS             TO  FRT-REFERBACK
      *    ELSE
      *        MOVE REFERBACK-REFERBACK    TO  FRT-REFERBACK.
      *    MOVE DDAILYTC-DATE TO FRT-DATE-RCVD.
      *
      *    MOVE 0 TO COND-WORD.
      *    WRITE DPOFREIGHT-REC FROM BUF-DPOFREIGHT
      *        INVALID KEY MOVE 99 TO COND-WORD.
      *    IF FILE-STATUS NOT = "00"
      *        MOVE 99 TO COND-WORD.
      *    IF COND-WORD NOT = 0
      *          MOVE "DBPUT3 DFREIGHT - SFREIGHT" TO BU-DISPLAY-MSG
      *          PERFORM 990-BLOWUP THRU 999-EXIT.
076800
076900 325-UNLOCK-FREIGHT.
      *----------  IF THE USER ENTERS FREIGHT TERMS THAT ARE
      *            DIFFERENT THAN THE TERMS ENTERED ON THE PO,
      *            RECORD THAT FACT.
           IF TYPE-FREIGHT-BUF = SAVE-PO-TERM
              NEXT SENTENCE
           ELSE
              PERFORM 800-DIFFERENT-TERMS.

077400*************************************************************
077500*   NOTE -- TRANSACTIONS MUST BE KEPT IN THIS ORDER         *
077600*           (350, 352, 323) BECAUSE OF IBM'S P7205 PROGRAM. *
077700*           TRANSACTION 323 IS CREATED AFTER RETURNING      *
077800*           FROM THIS ROUTINE.                              *
077900*************************************************************
078000*     DDAILYTC - PUT A TRANSACTION CODE OF 350 OR 450       *
078100*************************************************************
      *----------- FORMAT FREIGHT BILL DATE.
           IF FREIGHT-DATE-BUF NUMERIC
               MOVE 3                TO  DATE-MODE
               MOVE FREIGHT-DATE-BUF TO  DATE-VALIDATE-IN
               CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
           ELSE
               MOVE SPACES           TO  DATE-YMD-OUT.

078200     MOVE DE-PO (1)                  TO WS-PO.
078300     MOVE DE-RLSE (1)                TO WS-RLSE.
078400     MOVE SAVE-RS-NUMBER             TO WS-RS.
078500     MOVE PLT-NUMBER                 TO DDAILYTC-PLT.
078600
078700     IF FREIGHT-CHARGES-BUF9 > 9999999.99
078800        GO TO 330-CREATE-TC450.
079000     MOVE "350"                      TO DDAILYTC-TC.
079100     MOVE PO-RLSE-RS                 TO TC350-RS.
079200     IF NO-PRIOR-FREIGHT
079300         MOVE CARRIER-BUF            TO TC350-CARRIER
079400         MOVE FREIGHT-NO-BUF         TO TC350-PRO-NUMBER
               MOVE DATE-YMD-OUT           TO TC350-PRO-DATE
079500******   MOVE DD-BUF                 TO TC350-PRO-DD
079510******   MOVE MM-BUF                 TO TC350-PRO-MM
079520******   MOVE YY-BUF                 TO TC350-PRO-YY
079600         IF AKRON
079700            IF CAR-NO-BUF = SPACES
079800               MOVE SPACES           TO TC350-PACK-SLIP
079900            ELSE
080000               MOVE CAR-NO-BUF       TO TC350-PACK-SLIP
080100         ELSE
080200            MOVE P-SLIP-NO-BUF       TO TC350-PACK-SLIP
080300     ELSE
080400         MOVE SPACES                 TO TC350-MULTI-FRT
080500         MOVE "MULTI"                TO TC350-MULTI-IDENTIFY
080600         MOVE HOLD-FRT-RS-REFER      TO TC350-MULTI-ORIG-RS
080700         GO TO 335-PUT-TC350.
080800
081200     MOVE FREIGHT-CHARGES-BUF9 TO TC350-CHARGES.
081400     GO TO 335-PUT-TC350.
081500
081600 330-CREATE-TC450.
081700     MOVE "450"                       TO DDAILYTC-TC.
081800     MOVE PO-WS                       TO TC450-RS.
081900     MOVE CARRIER-BUF                 TO TC450-CARRIER.
082000**** MOVE DD-BUF                      TO TC450-PRO-DD.
082010**** MOVE MM-BUF                      TO TC450-PRO-MM.
082020**** MOVE YY-BUF                      TO TC450-PRO-YY.
082100**** MOVE FRT-BILL-DATE               TO TC450-PRO-DATE.
           MOVE DATE-YMD-OUT                TO TC450-PRO-DATE.
082200     MOVE FREIGHT-CHARGES-BUF9        TO TC450-CHARGES.
082300
082400 335-PUT-TC350.
082401     IF DDAILYTC-TC = "450"
082402        IF TYPE-FREIGHT-BUF = "G" OR "C"
082403           IF TC450-PRO-DATE = SPACES
082404              MOVE DDAILYTC-DATE TO TC450-PRO-DATE.
082405
082406     IF DDAILYTC-TC = "350"
082407        IF TYPE-FREIGHT-BUF = "G" OR "C"
082408           IF TC350-PRO-DATE = SPACES
082409              MOVE DDAILYTC-DATE TO TC350-PRO-DATE.
082410     IF TC350-PRO-DATE = SPACES
082420        IF TYPE-FREIGHT-BUF = "G" OR "C"
082430           MOVE "PRO DATE = SPACES FOR G OR C" TO BU-DISPLAY-MSG
082440           MOVE PO-RLSE-RS    TO BU-DISPLAY-FLD (1)
082450           MOVE TYPE-FREIGHT-BUF TO BU-DISPLAY-FLD (2)
082460           MOVE FRT-ARG          TO BU-DISPLAY-FLD (3)
082470           PERFORM 990-BLOWUP THRU 999-EXIT.
082480
           IF FRT-CHARGES-X = SPACES
              MOVE ZEROES TO TC350-CHARGES.
           MOVE 0 TO COND-WORD.
           WRITE DDAILYTC-REC FROM BUF-DDAILYTC
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
083100     IF COND-WORD NOT = 0
083200           MOVE "DBPUT 350 DDAILYTC 330 SFREIGHT"
083300                            TO BU-DISPLAY-MSG
083400           PERFORM 990-BLOWUP THRU 999-EXIT.
083500
084000*************************************************************
084100*          DDAILYTC  PUT A TRANSACTION CODE OF 352          *
084200*************************************************************
084300     MOVE SPACES                    TO DDAILYTC-DATA.
084400     MOVE PO-RLSE-RS                TO TC352-RS.
084500     MOVE "352"                     TO DDAILYTC-TC.
084600
084610     IF KELLY-PLANT
084620        NEXT SENTENCE
084630     ELSE
084640        IF AKRON
084650           NEXT SENTENCE
084660        ELSE
084670           MOVE EMPLOYEE-BUF TO VENDOR-PAID-PACK-SLIP.
084680
084700     IF NO-PRIOR-FREIGHT
084800        NEXT SENTENCE
084900     ELSE
085000         MOVE SPACES                TO TC352-MULTI-FRT
085100         MOVE "MULTI"               TO TC352-MULTI-IDENTIFY
085200         MOVE HOLD-FRT-RS-REFER     TO TC352-MULTI-ORIG-RS
085300         GO TO 340-PUT-TC352.
085400
085500     IF KELLY-PLANT
085600        MOVE KELLY-SCREEN-CITY      TO KELLY-CITY
085700        MOVE KELLY-SCREEN-STATE     TO KELLY-STATE
085800        MOVE KELLY-SCREEN-ZIP       TO TC352-SPLC
085900     ELSE
086000        MOVE ORIGIN-BUF             TO TC352-SPLC.
086100
086200     MOVE CAR-NO-BUF                TO TC352-CAR.
086300     MOVE TYPE-FREIGHT-BUF          TO TC352-TYPE.
086400
086500*---------- (11/5/85) IF VENDOR NEEDS TO BE PAID UPON RECEIPT,
086600*                     PASS THE PACKING SLIP NUMBER.
086700     IF VENDOR-SW = "Y"
086800        MOVE P-SLIP-NO-BUF          TO VENDOR-PAID-PACK-SLIP.
086900
087000*----------  IF A PO HAS MORE THAN ONE Z-BILL, PUT "MULTZ". IF A PO
087100*            HAD FREIGHT COME IN ON ANOTHER RECEIVER, PUT "MULTI".
087200*            RECEIVER, PUT "MULTI".
087300     IF MISC-MULTIZ = "Z"
087400         MOVE "MULTZ"               TO TC352-ZBILL
087500     ELSE
087600         MOVE Z-BILL-BUF            TO TC352-ZBILL.
087700
087800     IF AKRON
087900        MOVE CARR-WT-BUF            TO TC352-WEIGHT
088000     ELSE
088100        IF CARR-WT-BUF =  ZEROES
088200            MOVE OUR-WT-BUF         TO TC352-WEIGHT
088300        ELSE
088400            MOVE CARR-WT-BUF        TO TC352-WEIGHT.
088500
088600 340-PUT-TC352.
           MOVE 0 TO COND-WORD.
           WRITE DDAILYTC-REC FROM BUF-DDAILYTC
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
089300     IF COND-WORD NOT = 0
089400           MOVE "DBPUT352 DDAILYTC 340 SFREIGHT" TO BU-DISPLAY-MSG
089500           PERFORM 990-BLOWUP THRU 999-EXIT.
089600
090200 399-EXIT.  EXIT.
090300
9303CK 400-CHECK-PO-FOR-INVOICELESS.
  .        MOVE MISC-RS-ARG    TO PORCVNO    OF DPORECD-REC.
  .        READ DPORECD INTO BUF-DPORECD
  .            INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
  .        IF FILE-STATUS NOT = "00"
  .              MOVE "DBFIND DPORECD 400 SFREIGHT " TO BU-DISPLAY-MSG
  .              MOVE MISC-RS-ARG                 TO BU-DISPLAY-FLD (1)
  .              PERFORM 990-BLOWUP THRU 999-EXIT.
  .   *----------  ADD THE DIFFERING FREIGHT TERMS
  .
  .    401-SHOW-PACKSLIP-SCREEN.
  .        MOVE PACKSLIP-SCREEN TO VIEW-NFNAME.
  .        MOVE PACKSLIP-SCREEN-BUFFER TO SCREEN-BUFFER.
  .        MOVE SCREEN-BUFFER TO DISPLAY-REC .
  .        WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
  .           INDIC ARE SRF-INDICATORS.
  .        MOVE ALL B"0" TO SRF-INDICATORS.
  .
  .        READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
  .            INDIC ARE SRF-INDICATORS.
  .        ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
  .        MOVE ALL B"0" TO SRF-INDICATORS.
9303CK     MOVE DISPLAY-REC TO PACKSLIP-SCREEN-BUFFER.

       800-DIFFERENT-TERMS.
            MOVE SPACES TO KFRTERMS-REC.
            MOVE DDAILYTC-DATE     TO FREIGHT-YMD.
            IF FREIGHT-YY > "70"
                MOVE "19"          TO FREIGHT-CC
            ELSE
                MOVE "20"          TO FREIGHT-CC.
            MOVE FREIGHT-DATE-CN   TO KTERMDAT.
      ****  MOVE DDAILYTC-DATE TO KTERMDAT.
            MOVE DDAILYTC-TIME TO KTERMTIM.
            MOVE PO-VEN-CODE TO KTERMVEN.
            MOVE MISC-RS-ARG TO TERM-PO-AREA.
            MOVE SAVE-RS-NUMBER TO TERM-PO-RS.
            MOVE TERM-PO-AREA TO KTERMPO.
            MOVE SAVE-PO-TERM TO KTERMPOTRM.
            MOVE TYPE-FREIGHT-BUF TO KTERMRCVRT.
            MOVE ZEROES TO COND-WORD.
            WRITE KFRTERMS-REC
                 INVALID KEY MOVE 99 TO COND-WORD.
            IF FILE-STATUS = "22"
                MOVE KTERMTIM  TO ADD-ONE
                ADD 1 TO ADD-ONE
                MOVE ADD-ONE TO KTERMTIM
                WRITE KFRTERMS-REC INVALID KEY
                    MOVE FILE-STATUS TO FILE-STATUS
                END-WRITE
                IF FILE-STATUS = "22"
                    MOVE KTERMTIM TO ADD-ONE
                    ADD 1 TO ADD-ONE
                    MOVE ADD-ONE TO KTERMTIM
                    WRITE KFRTERMS-REC INVALID KEY
                        MOVE FILE-STATUS TO FILE-STATUS.
            IF FILE-STATUS NOT = "00"
               MOVE "BAD WRITE OF KFRTERMS" TO BU-DISPLAY-MSG
               MOVE KTERMDAT TO BU-DISPLAY-FLD (1)
               MOVE KTERMTIM TO BU-DISPLAY-FLD (2)
               MOVE KTERMPO TO BU-DISPLAY-FLD (3)
               MOVE FILE-STATUS TO BU-DISPLAY-FLD (4)
               PERFORM 990-BLOWUP THRU 999-EXIT.

091900*>>>>>>>>>>        DISPLAY ERROR MESSAGE FOR SPECIFIC FIELD
092000 940-VSETERROR.
           MOVE B"1" TO IND (99).
           MOVE B"1" TO IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO DE-FRT1-MESSAGE-LINE
                                  DE-FRT2-MESSAGE-LINE.
093200 949-EXIT.  EXIT.
093300************************************************************
093400************************************************************
093500*                    B L O W U P                           *
093600*     CHECK FOR IMAGE, VIEW, OR SPOOL ERROR.  CLOSE        *
093700*     FILES, GET OUT OF BLOCK MODE, AND DISPLAY            *
093800*     APPROPRIATE ERROR MESSAGE ON SCREEN.                 *
093900*                                                          *
094000*     ALSO APPENDS THE ERROR MESSAGE TO A FILE CALLED      *
094100*     BLOWUP.PUB.  TO READ THIS FILE, RUN "XBLPRT.OBJECT". *
094200*                                                          *
094300*         |||  PROGRAM IS ABORTED IN TBLOWUP  |||          *
094400************************************************************
094500************************************************************
094600 990-BLOWUP.
094800     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
094900           VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
095000           BU-DISPLAY-FLDS.
095100 999-EXIT.  EXIT.
095200
095300 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
096900 999-CATREAD-EXIT.
097000     EXIT.
