       IDENTIFICATION DIVISION.
       PROGRAM-ID.           SFRTAPPLY.
       AUTHOR.               KALMAN.
       DATE-WRITTEN.         JUNE 1993.
      *INSTALLATION.         GOODYEAR TIRE AND RUBBER CO.

      *D* REMARKS.
      *D*
      *D* THIS IS AN ONLINE SUBRTN THAT WILL APPLY FREIGHT BILLS TO
      *D* DTRANS AND MMATLACCUM DATA SETS. IT WILL ALSO VALIDATE
      *D* THE CARRIER CODE.
      *D*
      *D* TO USE IT, THE FOLLOWING PARMS MUST BE PASSED.
      *D*
      *D* BUF-FREIGHT:    MUST BE A VALID FREIGHT RECORD.
      *D*                 NO EDIT CHECKING WILL BE DONE ON IT.
      *D*
      *D* AMT-TO-APPLY:   THE FREIGHT CHARGES TO BE APPLIED.
      *D*
      *D* PAID-AMOUNT:    THE TOTAL CHARGE PAID BY TIS. THIS IS USED
      *D*                 TO CALCULATE TAX. SHOULD BE ZERO IF THE
      *D*                 AMT-TO-APPLY IS RATED.
      *D*
      *D* FROM-PGM-NAME:  THE NAME OF THE CALLING PROGRAM FOR BLOWUPS.
      *D*
      *C* CHANGES.
      *C*
      *C*   06/11/1996    CA YODER
      *C*     MODIFIED FOR CENTURY DATABASE CHANGES.
      *C*
      *C*   08/27/1996    CA YODER
      *C*     ADDED LOGIC TO APPLY FRT CHARGES TO MASTER STOCK CODE
      *C*     ON DPOITEM, IF ONE EXISTS.
      *C*
      *C*   06/02/99      CA YODER   (DECATUR REQUEST)
      *C*     EXPANDED TAX RATE PERCENTAGE FROM 2 DECIMAL
      *C*     PLACES TO 4.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

      ******************************************************************
       INPUT-OUTPUT SECTION.
      ******************************************************************
       FILE-CONTROL.
           SELECT CARRIER-O
                  ASSIGN TO DATABASE-MCFLCACARR
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS KCARCDE
                  FILE STATUS IS FILE-STATUS.
           SELECT DPOITEM-PO-I
                  ASSIGN TO DATABASE-MCFLCS1002
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DRCVITEM-PO-I
                  ASSIGN TO DATABASE-MCFLCS1201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DTRANS-PO-O
                  ASSIGN TO DATABASE-MCFLCA0703
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT MACCOUNT-INFO-I
                  ASSIGN TO DATABASE-MCFLCA0101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT MACCOUNT-INFO-O
                  ASSIGN TO DATABASE-MCFLCA0101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT MCHT-ACCTS-DP-I
                  ASSIGN TO DATABASE-MCFLCA0301
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT MCLASS-CL-I
                  ASSIGN TO DATABASE-MCFLCS4901
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT MMATL-ACCUM-CODE-I
                  ASSIGN TO DATABASE-MCFLCA0601
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT MTAX-TX-I
                  ASSIGN TO DATABASE-MCFLCS3701
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

      ******************************************************************
       DATA DIVISION.
      ******************************************************************

       FILE SECTION.

       FD  CARRIER-O
           LABEL RECORDS ARE STANDARD.
       01  CARRIER-REC-O.
           COPY DDS-MCRPCACARR OF MCFLCACARR.

       FD  DPOITEM-PO-I
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-PO-REC-I.
           COPY DDS-MCRPCS1000  OF MCFLCS1002.

       FD  DRCVITEM-PO-I
           LABEL RECORDS ARE STANDARD.
       01  DRCVITEM-PO-REC-I.
           COPY DDS-MCRPCS1200  OF MCFLCS1201.

       FD  DTRANS-PO-O
           LABEL RECORDS ARE STANDARD.
       01  DTRANS-PO-REC-O.
           COPY DDS-MCRPCA0700  OF MCFLCA0703.

       FD  MACCOUNT-INFO-I
           LABEL RECORDS ARE STANDARD.
       01  MACCOUNT-INFO-REC-I.
           COPY DDS-MCRPCA0100  OF MCFLCA0101.

       FD  MACCOUNT-INFO-O
           LABEL RECORDS ARE STANDARD.
       01  MACCOUNT-INFO-REC-O.
           COPY DDS-MCRPCA0100  OF MCFLCA0101.

       FD  MCHT-ACCTS-DP-I
           LABEL RECORDS ARE STANDARD.
       01  MCHT-ACCTS-DP-REC-I.
           COPY DDS-MCRPCA0300  OF MCFLCA0301.

       FD  MCLASS-CL-I
           LABEL RECORDS ARE STANDARD.
       01  MCLASS-CL-REC-I.
           COPY DDS-MCRPCS4900  OF MCFLCS4901.

       FD  MMATL-ACCUM-CODE-I
           LABEL RECORDS ARE STANDARD.
       01  MMATL-ACCUM-CODE-REC-I.
           COPY DDS-MCRPCA0600  OF MCFLCA0601.

       FD  MTAX-TX-I
           LABEL RECORDS ARE STANDARD.
       01  MTAX-TX-REC-I.
           COPY DDS-MCRPCS3700  OF MCFLCS3701.

      ******************************************************************
       WORKING-STORAGE SECTION.
      ******************************************************************
      *-----------------------------------------------------------------
      *  M I S C E L L A N E O U S   D A T E   &   T I M E   F I E L D S
      *-----------------------------------------------------------------

       01  CUR-DATE.
           05  CUR-DATE-CC                PIC X(2).
           05  CUR-SYSTEM-DATE.
               10  CUR-DATE-YY            PIC X(2).
               10  CUR-DATE-MM            PIC X(2).
               10  CUR-DATE-DD            PIC X(2).

       01  CUR-TIME                       PIC X(6).

      *-----------------------------------------------------------------
      *  A R G U M E N T   V A L U E S
      *-----------------------------------------------------------------

       01  CARRIER-ARG              PIC X(4).
       01  CLASS-ARG                PIC X(4)  VALUE SPACES.
       01  DEPT-ARG                 PIC X(6)  VALUE SPACES.
       01  ITEM-ARG                 PIC X(4)  VALUE SPACES.
       01  CODE-ARG                 PIC X(8)  VALUE SPACES.
       01  MACCT-ARG                PIC X(4)  VALUE SPACES.
       01  PO-14-ARG                          VALUE SPACES.
           05  PO-11-ARG.
               10  PO-PREFIX-ARG    PIC X.
               10  PO-10-ARG.
                   15  PO-NUM-ARG   PIC X(7).
                   15  PO-RLS-ARG   PIC X(3).
           05  PO-RCVR-ARG          PIC X(3).
       01  PO-14-ARG-DUP            REDEFINES PO-14-ARG.
           05  PO-PREFIX-ARG-DUP    PIC X.
           05  PO-13-ARG            PIC X(13).
       01  RAIL-CAR-ARG             PIC X(10) VALUE SPACES.
       01  TAX-ARG                  PIC XX    VALUE SPACES.

      *-----------------------------------------------------------------
      *  F L A G S   A N D   S W I T C H E S
      *-----------------------------------------------------------------

       01  DRCVITEM-EOF             PIC X.
       01  DPOITEM-EOF              PIC X.

       01  FREIGHT-TYPE             PIC X.
           88  FREIGHT-PAID                   VALUE "P".
           88  FREIGHT-RATED                  VALUE "R".

      *-----------------------------------------------------------------
      *  I N D E X E S
      *-----------------------------------------------------------------

       01  TBL-IX                        PIC 9(4) COMP-4 VALUE 0.

      *-----------------------------------------------------------------
      *  A C C U M U L A T O R S
      *-----------------------------------------------------------------

       01  AMT-TO-APPLY-SUBTOTAL          PIC S9(12)V99  VALUE 0.
       01  PAID-AMT-SUBTOTAL              PIC S9(12)V99  VALUE 0.
       01  ITEM-COUNT                     PIC 9(4) COMP-4 VALUE 0.
       01  TOTAL-QTY-DLVR                 PIC S9(8)V9(4) VALUE 0.
      *01  TOTAL-ITEM-TAX-PCT             PIC S9(2)V99   VALUE 0.
       01  TOTAL-ITEM-TAX-PCT             PIC S9(2)V9999 VALUE 0.

      *-----------------------------------------------------------------
      *  S A V E   F I E L D S
      *-----------------------------------------------------------------

       01  SAVE-PAY-FRT-TAX              PIC X        VALUE "Y".
       01  SAVE-STR-DEPT                 PIC X(6)     VALUE SPACES.

      *-----------------------------------------------------------------
      *  T A B L E S
      *-----------------------------------------------------------------

      *----THE ITEM TABLE HAS AN OCCURS OF 84 TIMES BECAUSE THE MAXIMUM
      *----NUMBER OF ITEMS ON A RECEIVER IS CURRENTLY 12 AND THE MAXIMUM
      *----NUMBER OF PO'S RELATED TO A FREIGHT BILL IS 7  (7 * 12 = 84).
      *----WE CURRENTLY DO NOT APPLY FREIGHT ACROSS MORE THAN JUST THE
      *----FIRST PO. BUT IF THAT CHANGES, THE TABLE WILL BE READY.

       01  ITEM-TABLE.
           05  ITEM-TABLE-ENTRY    OCCURS 84 TIMES.
               10  TBL-PO-RLS.
                   15  TBL-PO      PIC X(7).
                   15  TBL-RLS     PIC X(3).
               10  TBL-RCVR        PIC X(4).
               10  TBL-CODE        PIC X(8).
               10  TBL-ITEM        PIC X(4).
               10  TBL-UM          PIC X(2).
               10  TBL-QTY         PIC S9(10).
               10  TBL-FRT-PCT     PIC S9V9(5).
               10  TBL-APPL-AMT    PIC S9(7)V99.
               10  TBL-PAID-AMT    PIC S9(7)V99.
               10  TBL-FRT-TAX     PIC S9(7)V99.

      *-----------------------------------------------------------------
      *  D A T A B A S E   A N D   F I L E   B U F F E R S
      *-----------------------------------------------------------------


       01  BUF-CARRIER.
           05  CARRIER-CODE           PIC X(4).
           05  CARRIER-NAME           PIC X(30).
           05  CARRIER-EXPEDITE       PIC X(1).
           05  FILLER                 PIC X(1).

       COPY DPOITEM  OF COPYLIB.

       COPY DRCVITEM OF COPYLIB.

       COPY DTRANS   OF COPYLIB.

       COPY MACTINFO OF COPYLIB.

       COPY MATLACUM OF COPYLIB.

       COPY MCHTACCT OF COPYLIB.

       COPY MCLASS   OF COPYLIB.

       COPY MTAX     OF COPYLIB.

      *-----------------------------------------------------------------
      *  D A T A B A S E   S T A T U S   A R E A
      *-----------------------------------------------------------------

       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X.
           05  FILE-STATUS-2             PIC X.

       COPY DBCSACCT OF COPYLIB.

       COPY DATAB    OF COPYLIB.

      *-----------------------------------------------------------------
      *  U T I L I T Y   A R E A
      *-----------------------------------------------------------------

       COPY TBLOWUP OF COPYLIB.

       COPY VCOMAREA OF COPYLIB.

      *-----------------------------------------------------------------
       LINKAGE SECTION.
      *-----------------------------------------------------------------

       COPY FREIGHT OF COPYLIB.

       01  AMT-TO-APPLY           PIC S9(12)V99.
       01  PAID-AMT               PIC S9(12)V99.

       01  TOTAL-FRT-TAX          PIC S9(12)V99.

       01  FROM-PGM-NAME          PIC X(10).

      ******************************************************************
       PROCEDURE DIVISION USING BUF-FREIGHT,  AMT-TO-APPLY,
                                PAID-AMT, TOTAL-FRT-TAX, FROM-PGM-NAME.
      ******************************************************************

       0-CONTROL.

           PERFORM 1-HSK.

           PERFORM 6-APPLY-FREIGHT THRU 6-APPLY-X.

           PERFORM 2-CLOSE-FILES.

           GOBACK.

       1-HSK.

           OPEN INPUT      DRCVITEM-PO-I           MMATL-ACCUM-CODE-I
                           MCHT-ACCTS-DP-I         DPOITEM-PO-I
                           MCLASS-CL-I             MTAX-TX-I
                           MACCOUNT-INFO-I.
           OPEN I-O        CARRIER-O               DTRANS-PO-O
                           DTRANS-PO-O             MACCOUNT-INFO-O.

           MOVE FROM-PGM-NAME TO BU-DISPLAY-FLD (1).

      *----AS OF MAR 93 THE CENTURY IS NOT AVAILABLE FROM THE SYSTEM.
      *----UNTIL THE SITUATION CHANGES, THE FOLLOWING CODING IS A
      *----TEMPORARY MEASURE. THIS CODING IS USED FOR ALL DATES IN
      *----THIS PROGRAM THAT NEED CONVERSION.

           ACCEPT CUR-SYSTEM-DATE FROM DATE.
           IF CUR-DATE-YY < "70"
              MOVE "20" TO CUR-DATE-CC
           ELSE
              MOVE "19" TO CUR-DATE-CC.

      *----GET STOREROOM DEPARTMENT.

           MOVE "SDPT" TO MACCT-ARG.
           PERFORM 9999-READ-MACCOUNT-INFO-I.
           MOVE MACCT-STR-DEPT TO SAVE-STR-DEPT.

      *----CHECK FOR TAX ON FREIGHT CHARGES.

           MOVE "MTED" TO MACCT-ARG.
           PERFORM 9999-READ-MACCOUNT-INFO-I.
           MOVE MACCT-PAY-FRT-TAX TO SAVE-PAY-FRT-TAX.

       2-CLOSE-FILES.

           CLOSE        CARRIER-O               MMATL-ACCUM-CODE-I
                        MCHT-ACCTS-DP-I         DPOITEM-PO-I
                        MACCOUNT-INFO-I         MTAX-TX-I
                        MCLASS-CL-I             DRCVITEM-PO-I
                        DTRANS-PO-O             MACCOUNT-INFO-O.

       6-APPLY-FREIGHT.

      *----IS FREIGHT REC PAID OR RATED?

           INITIALIZE FREIGHT-TYPE.
           IF FREIGHT-REC-TYPE = "R"
              SET FREIGHT-RATED TO TRUE
           ELSE
              SET FREIGHT-PAID  TO TRUE.

      *----VALIDATE RATED AND PAID CARRIERS.

           MOVE FREIGHT-DELV-CARR TO CARRIER-ARG.
           IF CARRIER-ARG > SPACES
              PERFORM 9999-READ-CARRIER-O
              IF FILE-STATUS-1 = "2"
                 MOVE CARRIER-ARG TO CARRIER-CODE
                 MOVE SPACES TO CARRIER-NAME
                 PERFORM 9999-WRITE-CARRIER-O.
           PERFORM 9999-UNLOCK-CARRIER-O.

           MOVE FREIGHT-PAY-CARR TO CARRIER-ARG.
           IF CARRIER-ARG > SPACES
              PERFORM 9999-READ-CARRIER-O
              IF FILE-STATUS-1 = "2"
                 MOVE CARRIER-ARG TO CARRIER-CODE
                 MOVE SPACES TO CARRIER-NAME
                 PERFORM 9999-WRITE-CARRIER-O.
           PERFORM 9999-UNLOCK-CARRIER-O.

      *----BUILD A TABLE FOR THE ITEMS THAT THE FREIGHT CHARGES
      *----WILL BE DISTRIBUTED OVER. USUALLY THE ITEMS WILL COME
      *----FROM A RECEIVER. IN SOME CASES A SPECIAL PO WILL BE USED.
      *----THIS PO WILL ONLY HAVE ONE ITEM (0001) AS "NON-STR".

           INITIALIZE DRCVITEM-EOF, ITEM-COUNT, TOTAL-QTY-DLVR,
                      ITEM-TABLE.
           MOVE FREIGHT-PO-14 TO PO-14-ARG.

      *----IF A RCVR IS USED, FIND ALL ITEMS AND LOAD INFO INTO TABLE.
      *----ALSO GET NUMBER OF ITEMS AND TOTAL QUANTITY DELIVERED.
      *----IF THE RCVR CAN'T BE FOUND USE DEFAULTS.

           IF PO-RCVR-ARG NOT = "000"
              PERFORM 9999-START-DRCVITEM-I-EQ-PO
              IF FILE-STATUS-1 = "2"
                 MOVE 1               TO ITEM-COUNT
                 MOVE 1               TO TOTAL-QTY-DLVR
                 MOVE "NON-STR"       TO TBL-CODE (ITEM-COUNT)
                 MOVE PO-NUM-ARG      TO TBL-PO   (ITEM-COUNT)
                 MOVE PO-RLS-ARG      TO TBL-RLS  (ITEM-COUNT)
                 MOVE PO-RCVR-ARG     TO TBL-RCVR (ITEM-COUNT)
                 MOVE "0001"          TO TBL-ITEM (ITEM-COUNT)
                 MOVE SPACES          TO TBL-UM   (ITEM-COUNT)
                 MOVE 1               TO TBL-QTY  (ITEM-COUNT)
              ELSE
                 PERFORM UNTIL DRCVITEM-EOF = "Y"
                    PERFORM 9999-READ-NEXT-DRCVITEM-PO-I
                    IF DRCVITEM-EOF NOT = "Y"
                       IF RCV-PO-RCV-NO = PO-14-ARG
                          ADD  1               TO ITEM-COUNT
                          ADD  RCV-QTY-DLVR    TO TOTAL-QTY-DLVR
                          MOVE RCV-CORP-CODE   TO TBL-CODE (ITEM-COUNT)
                          MOVE RCV-PO-NO       TO TBL-PO   (ITEM-COUNT)
                          MOVE RCV-PO-REL      TO TBL-RLS  (ITEM-COUNT)
                          MOVE RCV-PO-RCVR     TO TBL-RCVR (ITEM-COUNT)
                          MOVE RCV-ITEM-NUMBER TO TBL-ITEM (ITEM-COUNT)
                          MOVE RCV-ITEM-UM     TO TBL-UM   (ITEM-COUNT)
                          MOVE RCV-QTY-DLVR    TO TBL-QTY  (ITEM-COUNT)
                       ELSE
                          MOVE "Y" TO DRCVITEM-EOF
                       END-IF
                    END-IF
                 END-PERFORM.

      *----IF A PO IS USED, LOAD ITEM 0001 INFO INTO TABLE.

           IF PO-RCVR-ARG  = "000"
              MOVE "0001" TO ITEM-ARG
              PERFORM 9999-READ-DPOITEM-PO-I
              MOVE 1               TO ITEM-COUNT
              MOVE 1               TO TOTAL-QTY-DLVR
              MOVE "NON-STR"       TO TBL-CODE (ITEM-COUNT)
              MOVE PO-NUM-ARG      TO TBL-PO   (ITEM-COUNT)
              MOVE PO-RLS-ARG      TO TBL-RLS  (ITEM-COUNT)
              MOVE PO-RCVR-ARG     TO TBL-RCVR (ITEM-COUNT)
              MOVE "0001"          TO TBL-ITEM (ITEM-COUNT)
              MOVE ITM-UM          TO TBL-UM   (ITEM-COUNT)
              MOVE 1               TO TBL-QTY  (ITEM-COUNT).

      *----GO THRU ITEM TABLE AGAIN AND LOAD FREIGHT AND TAX INFO.

           INITIALIZE TBL-IX, AMT-TO-APPLY-SUBTOTAL, PAID-AMT-SUBTOTAL.
           PERFORM UNTIL TBL-IX = ITEM-COUNT
              ADD 1 TO TBL-IX

      *-------CALC THE PERCENTAGE OF THIS ITEM'S QTY TO
      *-------THE TOTAL QTY ON THIS RECEIVER.

              COMPUTE TBL-FRT-PCT (TBL-IX) ROUNDED =
                 TBL-QTY (TBL-IX) / TOTAL-QTY-DLVR

      *-------USE THIS PERCENTAGE TO DISTRIBUTE THE FRT CHARGES
      *-------THAT WILL BE APPLIED (PAID - RATED)

              IF TBL-IX = ITEM-COUNT
                 COMPUTE TBL-APPL-AMT (TBL-IX) ROUNDED =
                    AMT-TO-APPLY - AMT-TO-APPLY-SUBTOTAL
              ELSE
                 COMPUTE TBL-APPL-AMT (TBL-IX) ROUNDED =
                    AMT-TO-APPLY * TBL-FRT-PCT (TBL-IX)
              END-IF
              ADD TBL-APPL-AMT (TBL-IX) TO AMT-TO-APPLY-SUBTOTAL

      *-------USE THIS PERCENTAGE TO DISTRIBUTE THE TOTAL AMT OF
      *-------FREIGHT THAT WAS PAID.  THIS IS USED TO FIGURE TAXES.

              IF TBL-IX = ITEM-COUNT
                 COMPUTE TBL-PAID-AMT (TBL-IX) ROUNDED =
                    PAID-AMT - PAID-AMT-SUBTOTAL
              ELSE
                 COMPUTE TBL-PAID-AMT (TBL-IX) ROUNDED =
                    PAID-AMT * TBL-FRT-PCT (TBL-IX)
              END-IF
              ADD TBL-PAID-AMT (TBL-IX) TO PAID-AMT-SUBTOTAL

      *-------GET THE TAX PERCENTAGE FOR THIS ITEM FROM THE PO
      *-------AND CALC THE TAX AMT USING THE TOTAL PAID FRT CHARGE

              PERFORM 60-CALCULATE-TAX-PERCENT
              COMPUTE TBL-FRT-TAX (TBL-IX) ROUNDED =
                 TBL-PAID-AMT (TBL-IX) * (TOTAL-ITEM-TAX-PCT / 100)
              ADD TBL-FRT-TAX (TBL-IX) TO TOTAL-FRT-TAX
           END-PERFORM.

      *----USE TABLE ENTRIES TO WRITE DTRANS AND MMATLACCUM RECORDS.

           INITIALIZE TBL-IX.
           PERFORM UNTIL TBL-IX = ITEM-COUNT
              INITIALIZE BUF-DTRANS
              ADD 1 TO TBL-IX

      *-------CREATE DTRANS FIRST.

              MOVE FREIGHT-PO-14 TO PO-14-ARG
              MOVE ZEROES TO PO-RCVR-ARG
              MOVE TBL-ITEM (TBL-IX) TO ITEM-ARG
              PERFORM 9999-READ-DPOITEM-PO-I

      *-------IF DPOITEM NOT FOUND USE ACCOUNTING DEFAULTS TO APPLY.

              IF FILE-STATUS-1 = "2"
                 MOVE "000" TO ITM-CLASS
                 MOVE "0000" TO ITM-SUB-DETL
                 MOVE "000000" TO ITM-ADDL-DATA
              END-IF
              IF ITM-ADDL-DATA = SPACES
                 MOVE "000000" TO ITM-ADDL-DATA
              END-IF

      *----------- IF MASTER STOCK CODE EXISTS, USE THIS CODE FOR THE
      *----------- FREIGHT CHARGE.

              IF FILE-STATUS = "00"
                  IF ITM-MASTER-STOCK > SPACES
                      MOVE ITM-MASTER-STOCK TO TBL-CODE (TBL-IX)
                  END-IF
              END-IF

      *-------CLASS MUST BE VALID FOR CSAS.
      *-------CLASS IS USUALLY VALID IN MMATL-ACCUM FOR CODED ITEMS.
      *-------CLASS IS NOT VALIDATED DURING PO ENTRY.
      *-------THEREFORE ONLY USE CLASS FROM PO FOR "NON-STR" ITEMS
      *-------THEREBY REDUCING THE AMOUNT OF INVALID CLASSES THAT HAVE
      *-------TO BE SET TO "000". ALSO USE CLASS FROM PO WHEN NO
      *-------ENTRY IN MMATL-ACCUM.

              IF TBL-CODE (TBL-IX) = "NON-STR"
                 MOVE ITM-CLASS TO CLASS-ARG
              ELSE
                 MOVE TBL-CODE (TBL-IX)   TO CODE-ARG
                 PERFORM 9999-READ-MMATL-ACCUM-CODE-I
                 IF FILE-STATUS-1 = "2"
                    MOVE ITM-CLASS TO CLASS-ARG
                 ELSE
                    MOVE MATL-CLASS TO CLASS-ARG
                 END-IF
              END-IF
              PERFORM 9999-READ-MCLASS-CL-I
              IF FILE-STATUS-1 = "2"
                 MOVE "000"                  TO TRANS-CLASS
              ELSE
                 MOVE CLASS-ARG              TO TRANS-CLASS
              END-IF

      *-------VALIDATE DEPT
              MOVE ITM-SUB-DETL TO DEPT-ARG
              PERFORM 9999-READ-MCHT-ACCTS-DP-I
              IF FILE-STATUS-1 = "2"
                 MOVE "0000"                 TO TRANS-DEPT
              ELSE
                 MOVE ITM-SUB-DETL           TO TRANS-DEPT
              END-IF

      *-------NEW WORK ORDERS (ACCT > 9999) CANNOT BE
      *-------CHARGED TO A DEPARTMENT.

              MOVE ITM-ADDL-DATA             TO TRANS-ACCT
              IF TRANS-ACCT > "009999"
                 MOVE "0000"                 TO TRANS-DEPT
              END-IF

              MOVE TBL-CODE (TBL-IX)         TO TRANS-STORES-CODE
              MOVE TBL-PO (TBL-IX)           TO TRANS-ORDER-NUM
              MOVE TBL-RLS (TBL-IX)          TO TRANS-RELEASE
              MOVE TBL-RCVR (TBL-IX)         TO TRANS-RCVR-NUM
              MOVE TBL-ITEM(TBL-IX)          TO TRANS-ITEM-NUM
              MOVE "FRT"                     TO TRANS-CODE
      *----------- CENTURY CHANGE.
              MOVE CUR-DATE                  TO TRANS-DATE-CN

              ACCEPT CUR-TIME FROM TIME
              MOVE CUR-TIME                  TO TRANS-TIME

              IF FREIGHT-RATED
                 MOVE FREIGHT-DELV-CARR      TO TRANS-EMP
              ELSE
                 MOVE FREIGHT-PAY-CARR       TO TRANS-EMP
              END-IF
              INITIALIZE                        TRANS-QTY
              COMPUTE                           TRANS-VALUE =
                 TBL-APPL-AMT(TBL-IX) + TBL-FRT-TAX (TBL-IX)
              MOVE FREIGHT-FB-NUM            TO TRANS-DOCUMENT-NUM
              IF TBL-CODE (TBL-IX) = "NON-STR"
                 MOVE TBL-UM (TBL-IX)        TO TRANS-UNIT-MEASURE
              ELSE
                 MOVE MATL-UNIT-MEASURE      TO TRANS-UNIT-MEASURE
              END-IF
              INITIALIZE                        TRANS-BALANCE-QTY

              PERFORM 9999-WRITE-DTRANS-PO-O

      *       CALL "SFRTSTAMP"

      *-------CREATE MMATL-ACCUM NEXT

              IF TBL-CODE (TBL-IX) NOT = "NON-STR"
                 IF TRANS-DEPT = SAVE-STR-DEPT
                    COMPUTE MATL-INV-DOLLARS = MATL-INV-DOLLARS +
                                               TBL-APPL-AMT (TBL-IX) +
                                               TBL-FRT-TAX (TBL-IX)
                    MOVE SPACES TO BU-DISPLAY-MSG
                    CALL "SUPDMATL" USING ACCTG-BASE, BUF-MATLACUM,
                          STATUS-AREA, BU-DISPLAY-MSG, BU-DISPLAY-FLDS
                    IF BU-DISPLAY-MSG NOT = SPACES
                       PERFORM 9999-BLOWUP
                    END-IF
                 END-IF
              END-IF

           END-PERFORM.

       6-APPLY-X.  EXIT.

       60-CALCULATE-TAX-PERCENT.
           INITIALIZE TAX-ARG, TOTAL-ITEM-TAX-PCT.
           MOVE FREIGHT-PO-14 TO PO-14-ARG.
           MOVE "000" TO PO-RCVR-ARG.
           IF SAVE-PAY-FRT-TAX = "Y"
      *-------FIND EACH ITEM TO GET THE TAX CODE
              PERFORM 9999-START-DPOITEM-I-GE-PO
              PERFORM 9999-READ-NEXT-DPOITEM-PO-I
              PERFORM UNTIL (TAX-ARG NOT EQUAL SPACES)
                 OR (DPOITEM-EOF = "Y")
                 IF ITM-PO-RCV-NO = PO-14-ARG
                    IF ITM-NUMBER = TBL-ITEM (TBL-IX)
                       MOVE ITM-TAX-CODE TO TAX-ARG
                    ELSE
                       PERFORM 9999-READ-NEXT-DPOITEM-PO-I
                    END-IF
                 ELSE
                    MOVE "Y" TO DPOITEM-EOF
                 END-IF
              END-PERFORM
              IF TAX-ARG NOT = SPACES
                 PERFORM 9999-READ-MTAX-TX-I
                 COMPUTE TOTAL-ITEM-TAX-PCT =
                    MTAX-PERCENT(1) + MTAX-PERCENT(2) +
                    MTAX-PERCENT(3) + MTAX-PERCENT(4)
              END-IF
           END-IF.

      *-----------------------------------------------------------------
      *9999-UTILITY SECTION.
      *-----------------------------------------------------------------

       9999-BLOWUP.
           MOVE "SFRTAPPLY" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
              VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
              BU-DISPLAY-FLDS.

      *9999-UPD-MACCOUNT-LAST-DATES.
      *    MOVE "FRT" TO MACCT-ARG.
      *    PERFORM 9999-READ-MACCOUNT-INFO-O.
      *    MOVE CUR-DATE TO MACCT-FRT-LAST-DATE-PROCESSED.
      *    MOVE CUR-TIME TO MACCT-FRT-LAST-TIME-PROCESSED.
      *    PERFORM 9999-REWRITE-MACCOUNT-INFO-O.

      *---------------------------------
      * CARRIER
      *---------------------------------

       9999-READ-CARRIER-O.
           MOVE CARRIER-ARG TO KCARCDE OF CARRIER-REC-O.
           READ CARRIER-O INTO BUF-CARRIER
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 NOT = "2"
                 MOVE "READ CARRIER*9999-RCO" TO BU-DISPLAY-MSG
                 MOVE CARRIER-ARG TO BU-DISPLAY-FLD (2)
                 GO TO 9999-BLOWUP.

       9999-WRITE-CARRIER-O.
           WRITE CARRIER-REC-O FROM BUF-CARRIER
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              MOVE "WRITE CARRIER*9999-WCO" TO BU-DISPLAY-MSG
              MOVE CARRIER-CODE TO BU-DISPLAY-FLD (2)
              GO TO 9999-BLOWUP.

       9999-UNLOCK-CARRIER-O.
           MOVE HIGH-VALUES TO KCARCDE OF CARRIER-REC-O.
           START CARRIER-O KEY > KCARCDE OF CARRIER-REC-O
              INVALID KEY MOVE "00" TO FILE-STATUS.

      *---------------------------------
      * DPOITEM
      *---------------------------------

       9999-START-DPOITEM-I-GE-PO.
           MOVE PO-14-ARG TO PORCVNO OF DPOITEM-PO-REC-I.
           START DPOITEM-PO-I KEY >= PORCVNO OF DPOITEM-PO-REC-I
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 NOT = "2"
                 MOVE "START DPOITEM-PO*9999-SDGPI" TO BU-DISPLAY-MSG
                 MOVE PO-14-ARG TO BU-DISPLAY-FLD (2)
                 PERFORM 9999-BLOWUP.

       9999-READ-NEXT-DPOITEM-PO-I.
           READ DPOITEM-PO-I NEXT INTO BUF-DPOITEM
              AT END MOVE "Y" TO DPOITEM-EOF.

       9999-READ-DPOITEM-PO-I.
           MOVE PO-14-ARG TO PORCVNO OF DPOITEM-PO-REC-I.
           MOVE ITEM-ARG  TO ITEMNO  OF DPOITEM-PO-REC-I.
           READ DPOITEM-PO-I INTO BUF-DPOITEM
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 NOT = "2"
                 MOVE "READ DPOITEM-PO*9999-RDPI" TO BU-DISPLAY-MSG
                 MOVE PO-14-ARG TO BU-DISPLAY-FLD (2)
                 MOVE ITEM-ARG  TO BU-DISPLAY-FLD (3)
                 GO TO 9999-BLOWUP.

      *---------------------------------
      * DRCVITEM
      *---------------------------------

       9999-READ-NEXT-DRCVITEM-PO-I.
           READ DRCVITEM-PO-I NEXT INTO BUF-DRCVITEM
              AT END MOVE "Y" TO DRCVITEM-EOF.

       9999-START-DRCVITEM-I-EQ-PO.
           MOVE PO-14-ARG TO PORCVNO OF DRCVITEM-PO-REC-I.
           START DRCVITEM-PO-I KEY = PORCVNO OF DRCVITEM-PO-REC-I
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 NOT = "2"
                 MOVE "START DRCVITEM-PO*9999-SDEPI" TO BU-DISPLAY-MSG
                 MOVE PO-14-ARG TO BU-DISPLAY-FLD (2)
                 MOVE FREIGHT-FB-NUM TO BU-DISPLAY-FLD (3)
                 PERFORM 9999-BLOWUP.

      *---------------------------------
      * DTRANS
      *---------------------------------

       9999-WRITE-DTRANS-PO-O.
           WRITE DTRANS-PO-REC-O FROM BUF-DTRANS
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              MOVE "WRITE DTRANS-PO*9999-WDPO" TO BU-DISPLAY-MSG
              MOVE TRANS-PO-NUM   TO BU-DISPLAY-FLD (2)
              MOVE TRANS-RCVR-NUM TO BU-DISPLAY-FLD (3)
              MOVE TRANS-ITEM-NUM TO BU-DISPLAY-FLD (4)
              GO TO 9999-BLOWUP.

      *---------------------------------
      * MACCOUNT-INFO
      *---------------------------------

       9999-READ-MACCOUNT-INFO-I.
           MOVE MACCT-ARG TO INFOKEY OF MACCOUNT-INFO-REC-I.
           READ MACCOUNT-INFO-I INTO BUF-MACCT-INFO
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              MOVE "READ MACCOUNT-INFO*9999-RMII" TO BU-DISPLAY-MSG
              MOVE MACCT-ARG TO BU-DISPLAY-FLD (2)
              GO TO 9999-BLOWUP.

       9999-READ-MACCOUNT-INFO-O.
           MOVE MACCT-ARG TO INFOKEY OF MACCOUNT-INFO-REC-O.
           READ MACCOUNT-INFO-O INTO BUF-MACCT-INFO
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              MOVE "READ MACCOUNT-INFO*9999-RMIO" TO BU-DISPLAY-MSG
              MOVE MACCT-ARG TO BU-DISPLAY-FLD (2)
              GO TO 9999-BLOWUP.

       9999-REWRITE-MACCOUNT-INFO-O.
           REWRITE MACCOUNT-INFO-REC-O FROM BUF-MACCT-INFO
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              MOVE "REWRITE MACCOUNT-INFO*9999-RMIO" TO BU-DISPLAY-MSG
              MOVE MACCT-ARG TO BU-DISPLAY-FLD (1)
              GO TO 9999-BLOWUP.

      *---------------------------------
      * MCHT-ACCTS
      *---------------------------------

       9999-READ-MCHT-ACCTS-DP-I.
           MOVE DEPT-ARG TO DEPT OF MCHT-ACCTS-DP-REC-I.
           READ MCHT-ACCTS-DP-I INTO BUF-MCHTACCTS
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 NOT = "2"
                 MOVE "READ MCHT-ACCTS*9999-RMAI" TO BU-DISPLAY-MSG
                 MOVE DEPT-ARG TO BU-DISPLAY-FLD (2)
                 GO TO 9999-BLOWUP.

      *---------------------------------
      * MCLASS
      *---------------------------------

       9999-READ-MCLASS-CL-I.
           MOVE CLASS-ARG TO ACTGCLASS OF MCLASS-CL-REC-I.
           READ MCLASS-CL-I INTO BUF-MCLASS
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 NOT = "2"
                 MOVE "READ MCLASS*9999-RMCI" TO BU-DISPLAY-MSG
                 MOVE CLASS-ARG TO BU-DISPLAY-FLD (2)
                 GO TO 9999-BLOWUP.

      *---------------------------------
      * MMATL-ACCUM
      *---------------------------------

       9999-READ-MMATL-ACCUM-CODE-I.
           MOVE CODE-ARG TO MATLCODE OF MMATL-ACCUM-CODE-REC-I.
           READ MMATL-ACCUM-CODE-I INTO BUF-MATLACUM
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 NOT = "2"
                 MOVE "READ MATLACUM-CODE*9999-RMACI" TO BU-DISPLAY-MSG
                 MOVE CODE-ARG  TO BU-DISPLAY-FLD (2)
                 GO TO 9999-BLOWUP.

      *---------------------------------
      * MTAX
      *---------------------------------

       9999-READ-MTAX-TX-I.
           MOVE TAX-ARG TO TAXCDE OF MTAX-TX-REC-I.
           READ MTAX-TX-I INTO BUF-MTAX
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 NOT = "2"
                 MOVE "READ MTAX*9999-RMTI" TO BU-DISPLAY-MSG
                 MOVE TAX-ARG TO BU-DISPLAY-FLD (2)
                 GO TO 9999-BLOWUP.

