000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    SHELPSCR.
000400 AUTHOR.        BARBARA WINTER.
000500 DATE-WRITTEN.  AUGUST 1987.
000600*INSTALLATION.  GOODYEAR TIRE AND RUBBER CO.
000700*
000800*REMARKS.
000900**********************************************************************
001000**********************************************************************
001100*                          S H E L P S C R                           *
001200*                                                                    *
001300*         -------- DISPLAYS ANY SET OF HELP SCREENS ----------       *
001400*                                                                    *
001500* 1.  FORMFILE NAMES MUST BE 6 LETTERS WITH THE 7TH AND 8TH          *
001600*     CHARACTERS CONTAINING 01, 02, ETC.  FOR  EXAMPLE:  IF A PO     *
001700*     INQUIRY SCREEN HAD A HELP FUNCTION KEY THAT WOULD DISPLAY 3    *
001800*     SCREENS, THOSE HELP SCREENS WOULD BE NAMED HPOINQ01, HPOINQ02, *
001900*     AND HPOINQ03.                                                  *
002000*                                                                    *
002100* 2.  FUNCTIONS KEYS:  (WILL ALWAYS BE THE SAME AND MUST BE LABELED  *
002200*                      BY YOU IN YOUR SCREENS)                       *
002300*     F1 = PREVIOUS SCREEN (DOES NOT APPLY TO SCREEN 1)              *
002400*     F2 = NEXT SCREEN     (DOES NOT APPLY TO LAST SCREEN)           *
002600*     F3 = EXIT            (RETURNS TO YOUR PROGRAM)                 *
002700*                                                                    *
002800* 3.  IF THE FIRST HELP SCREEN IS NOT FOUND, THE FOLLOWING MESSAGE   *
002900*     WILL BE DISPLAYED:  "HELP SCREEN IS NOT AVAILABLE - CONTACT    *
003000*     AKRON DP"                                                      *
003100*                                                                    *
003200* 4.  IF ANY OTHER SCREENS ARE NOT FOUND, THIS PROGRAM WILL ASSUME   *
003300*     THAT THERE ARE NO MORE HELP SCREENS TO DISPLAY AND THE         *
003400*     FOLLOWING MESSAGE WILL BE DISPLAYED:  "NO MORE HELP SCREENS    *
003500*     TO DISPLAY - PRESS ANOTHER FUNCTION KEY"                       *
003600*                                                                    *
003700* 5.  IN MOST CASES, YOUR HELP SCREEN WILL BE IN YOUR CURRENT FORM   *
003800*     FILE WHICH YOU ALREADY HAVE OPEN, SO THIS PROGRAM ASSUMES      *
003900*     THAT THE FORMFILE IS OPEN.                                     *
004000**********************************************************************
004100*                                                                    *
004200*                       P A R A M E T E R S                          *
004300*  1.  VIEW-COMAREA                     (COPY VCOMLINK OF COPYLIB)  *
004400*  2.  LANGUAGE-PARMS                   (COPY LANGSUB  OF COPYLIB)  *
004500*  3.  FORMNAME        PIC X(6)         (PREFIX OF YOUR HELP SCREENS)*
004600**********************************************************************
004700*                                                                    *
004800*                    C A L L I N G   P R O C E D U R E               *
      *    MOVE "ZPOINQ" TO VIEW-CFNAME.                                   *
004900*    MOVE "HPOINQ" TO FORMNAME.                                      *
005000*    CALL "SHELPSCR" USING VIEW-COMAREA LANGUAGE-PARMS FORMNAME.     *
005100**********************************************************************
005200**********************************************************************
005300
005400 ENVIRONMENT DIVISION.
005500 CONFIGURATION SECTION.
005600 SOURCE-COMPUTER.    HP-3000.
005700 OBJECT-COMPUTER.    HP-3000.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZHELPSCR-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                       PIC X(2000).
006000 WORKING-STORAGE SECTION.
       01  DISPLAY-STATUS              PIC X(2).
006100 01  BASE                     PIC X(10) VALUE SPACES.
006200 01  HELP-SCREEN.
006300     05  PREFIX-NAME          PIC X(6)  VALUE SPACES.
006400     05  HELP-NUM             PIC X(2)  VALUE "01".
006500     05  HELP-NUMBER REDEFINES HELP-NUM  PIC 99.
006600
006700 01  SAVE-NUMBER              PIC X(2)  VALUE "01".

      *------ WS CONTROL AREA
       01  MAJOR-MINOR                 PIC XXXX.
       01  WS-CONTROL.
           02  FUNCTION-NUM            PIC XX.
                   88  EXIT-KEY-F8-USED                     VALUE "08". LVW000LS
                   88  REFRESH-KEY-F4-USED                  VALUE "04". LVW000LS
                   88  ENTER-KEY-USED                       VALUE "00". LVW000LS
                   88  F1-KEY-USED                          VALUE "01". LVW000LS
                   88  F2-KEY-USED                          VALUE "02". LVW000LS
                   88  F3-KEY-USED                          VALUE "03". LVW000LS
                   88  F4-KEY-USED                          VALUE "04". LVW000LS
                   88  F5-KEY-USED                          VALUE "05". LVW000LS
                   88  F6-KEY-USED                          VALUE "06". LVW000LS
                   88  F7-KEY-USED                          VALUE "07". LVW000LS
                   88  F8-KEY-USED                          VALUE "08". LVW000LS
           02 FUN-KEY REDEFINES FUNCTION-NUM PIC XX.
           02 TERMINAL-ID PIC X(10).
           02 FORMAT-NAME PIC X(10).
       01  SRF-INDICATORS.
           05  IND OCCURS 99 TIMES   PIC 1 INDICATOR 01.

       01  SCREEN-BUFFER.
           05  DE-COMMAND-LINE      PIC X(79).
           05  DE-MESSAGE-LINE      PIC X(79).

       COPY CATREAD    IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.

006900 01  MSG-NOT-AVAIL            PIC X(76) VALUE SPACES.
007000 01  MSG-NO-MORE              PIC X(76) VALUE SPACES.
007100 01  MSG-NO-PREV              PIC X(76) VALUE SPACES.
       01  HOLD-FORM-NAME                    PIC X(10).
       01  HOLD-FORMFILE-NAME                PIC X(10) VALUE SPACES.
       01  TEST-FORMFILE-NAME                PIC X(10).
       01  OVRDSPF-WORK                      PIC X(70).
       01  OVRDSPF-LEN      PIC S9(10)V9(5) COMP-3 VALUE 70.

024900 77  SAVE-VIEW-LASTKEY             PIC S9(4) COMP-4 VALUE 0.
007700
007800*---------- VSETERROR AND VPUTWINDOW
007900 01  MESSAGE-BUFFER           PIC X(76)    VALUE SPACES.
008000 01  MESSAGE-BUFFER-RD REDEFINES MESSAGE-BUFFER.
008100     05  MSG-BUFFER           PIC X(68).
008200     05  MSG-VALUE            PIC X(8).
009900
010100 LINKAGE SECTION.
010200 COPY VCOMLINK OF COPYLIB.
010300 COPY LANGSUB  OF COPYLIB.
010400 01  FORMNAME                 PIC X(6).
010500
010600****************************************************************
010700*                PROCEDURE DIVISION                            *
010800****************************************************************
010900 PROCEDURE DIVISION USING   VIEW-COMAREA
011000                            LANGUAGE-PARMS
011100                            FORMNAME.
011200
011300 00-MAIN.
           MOVE 0 TO SAVE-VIEW-LASTKEY.
           MOVE VIEW-CFNAME TO HOLD-FORMFILE-NAME.
           STRING "OVRDSPF FILE(ZHELPSCR) TOFILE(",
                     HOLD-FORMFILE-NAME, ")",
                     DELIMITED BY SIZE INTO OVRDSPF-WORK.
           CALL "QCMDEXC" USING OVRDSPF-WORK, OVRDSPF-LEN.
           OPEN I-O DISPLAY-FILE.
011600     MOVE FORMNAME        TO  PREFIX-NAME.
011800
011900*****************************************************************
012000*                READ IN ERROR MESSAGES                         *
012100*****************************************************************
012200*-----  "HELP SCREEN IS NOT AVAILABLE - CONTACT AKRON DP"
012300     MOVE 8               TO  LANG-SETNUM.
012400     MOVE 9               TO  LANG-MSGNUM.
012500     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
012600     MOVE MESSAGE-BUFFER  TO  MSG-NOT-AVAIL.
012700
012800*-----  "NO MORE HELP SCREENS TO DISPLAY - PRESS ANOTHER FUNCTION KEY"
012900     MOVE 14              TO  LANG-SETNUM.
013000     MOVE 110             TO  LANG-MSGNUM.
013100     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
013200     MOVE MESSAGE-BUFFER  TO  MSG-NO-MORE.
013300
013400*-----  "NO PREVIOUS HELP SCREEN TO DISPLAY - PRESS ANOTHER FUNCTION KEY"
013500     MOVE 14              TO  LANG-SETNUM.
013600     MOVE 111             TO  LANG-MSGNUM.
013700     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
013800     MOVE MESSAGE-BUFFER  TO  MSG-NO-PREV.
013900
           MOVE "01"        TO HELP-NUM.
014000     MOVE HELP-SCREEN TO VIEW-NFNAME.
014700
014800     PERFORM 200-DISPLAY-SCREEN  THRU 299-EXIT.
014900
           CLOSE DISPLAY-FILE.
015000 99-EXIT.
           GOBACK.
015100
015300******************************************************************
015400*          DISPLAY HELP SCREENS FORWARDS AND BACKWARDS           *
015500******************************************************************
015600 200-DISPLAY-SCREEN.
           PERFORM 800-DISPLAY THRU 809-EXIT.
021700     IF VIEW-LASTKEY = 3
021800        GO TO 299-EXIT.
021900
       210-DISPLAY-SCREEN.
022000*----------  SAVE CURRENT FORM NUMBER IN CASE THE NEXT ONE IS BAD
022100     MOVE HELP-NUMBER TO SAVE-NUMBER.
022200
           IF VIEW-LASTKEY = 3
              GO TO 299-EXIT.

022300*----------  PREV SCREEN
022400     IF VIEW-LASTKEY = 1
022500        IF HELP-NUMBER = 1
022600           MOVE MSG-NO-PREV TO MESSAGE-BUFFER
022700           PERFORM 920-SHOW-MSG THRU 929-EXIT
022800           GO TO 200-DISPLAY-SCREEN
022900        ELSE
023000           SUBTRACT 1 FROM HELP-NUMBER
023100*---------- NEXT SCREEN
023200     ELSE
023300        ADD 1 TO HELP-NUMBER.
023400
023500     MOVE HELP-SCREEN    TO VIEW-NFNAME.
023600     PERFORM 800-DISPLAY THRU 809-EXIT.
023700     IF DISPLAY-STATUS NOT = "00"
023900        MOVE MSG-NO-MORE TO MESSAGE-BUFFER
024000        MOVE SAVE-NUMBER TO HELP-NUMBER
024100        MOVE HELP-SCREEN TO VIEW-NFNAME
024400        PERFORM 920-SHOW-MSG THRU 929-EXIT
024200        PERFORM 800-DISPLAY THRU 809-EXIT
024500        GO TO 210-DISPLAY-SCREEN.
024600
025000     GO TO 210-DISPLAY-SCREEN.
025100
025200 299-EXIT.  EXIT.
025300
       800-DISPLAY.
            MOVE SCREEN-BUFFER TO DISPLAY-REC.
            WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
                  INDIC ARE SRF-INDICATORS.
            MOVE ALL B"0" TO SRF-INDICATORS.

            READ DISPLAY-FILE FORMAT IS VIEW-NFNAME
                 INDIC ARE SRF-INDICATORS.
            ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
            MOVE ALL B"0" TO SRF-INDICATORS.

           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

036200     IF VIEW-LASTKEY EQUAL 4 OR
036400        VIEW-LASTKEY EQUAL 5 OR
036500        VIEW-LASTKEY EQUAL 6 OR
036500        VIEW-LASTKEY EQUAL 7 OR
036700        VIEW-LASTKEY EQUAL 8
              MOVE 9 TO LANG-SETNUM
              MOVE 10 TO LANG-MSGNUM
036800        PERFORM 920-SHOW-MSG THRU 929-EXIT
036900        GO TO 800-DISPLAY.
       809-EXIT.  EXIT.
058000
025400 920-SHOW-MSG.
           MOVE B"1" TO IND (99).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE.
026000 929-EXIT.     EXIT.
026800
026900 999-CATREAD.
            MOVE LANG-SETNUM TO CATREAD-MSG-SET.
            MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
            CALL "CCATREAD" USING CATREAD-PARMS.
            MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
028500 999-CATREAD-EXIT.
028600       EXIT.
