000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    SINQRSIC.
000400 AUTHOR.        JEFF BUNGO.
000500 DATE-WRITTEN.  JUNE 10, 1994.
000600 DATE-COMPILED.
000700*REMARKS.       SUBROUTINE SHOWS RECEIVING SLIP CORRECTION DATA.
000800*************************************************************
000900*************************************************************
001000*                      S I N Q R S I C                      *
001100*                                                           *
001200*    THIS SUBROUTINE SHOWS ALL ITEM CORRECTION INFO FOR     *
001300*    ON A RECEIVING SLIP.  CORRECTIONS MAY BE BROWSED       *
001400*    FORWARD AND BACKWARD.                                  *
003500*************************************************************
003600*    CALLING PROGRAMS:                                      *
003700*       1.  SRSINQS  -  MAIN SUBROUTINE FOR RS INQUIRY      *
003900*************************************************************
      *C 06/07/96  JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   RECOMPILE TO PICK UP NEW FILE FORMATS.
      *C---------------------------------------------------------------
DCR01 *C MAR 10, 2005  D.RAUCH       DCR01    REQUEST# 2005-78515
DCR01 *C    DISPLAY FILE PROCESSING CHANGED FROM USING ZCSISINQ
DCR01 *C    NEW DISPLAY FILE ZSINQRSIC CREATED - FORMATS COPIED
DCR01 *C    FROM ZCSISINQ.
DCR01 *****************************************************************

004100 ENVIRONMENT DIVISION.
004200 CONFIGURATION SECTION.
004300 SOURCE-COMPUTER.    HP-3000.
004400 OBJECT-COMPUTER.    HP-3000.
       SPECIAL-NAMES.  I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
004500 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZSINQRSIC-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS DYNAMIC
                  RELATIVE KEY IS RELATIVE-RECNO
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.
             SELECT MPORCV
               ASSIGN TO DATABASE-MCFLCS0101
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT DRCVITEM
               ASSIGN TO DATABASE-MCFLCS1201
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT DRCVCORR
               ASSIGN TO DATABASE-MCFLCS5401
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT DRCVITEM-ST
               ASSIGN TO DATABASE-MCFLST0601
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT DRCVCORR-ST
               ASSIGN TO DATABASE-MCFLST5401
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
004600 DATA DIVISION.
004700 FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC          PIC X(2000).

       FD  MPORCV
           LABEL RECORDS ARE STANDARD.
       01  MPORCV-REC.
           COPY DDS-MCRPCS0100  OF MCFLCS0101.

       FD  DRCVITEM
           LABEL RECORDS ARE STANDARD.
       01  DRCVITEM-REC.
           COPY DDS-MCRPCS1200  OF MCFLCS1201.

       FD  DRCVCORR
           LABEL RECORDS ARE STANDARD.
       01  DRCVCORR-REC.
           COPY DDS-MCRPCS5400  OF MCFLCS5401.

       FD  DRCVITEM-ST
           LABEL RECORDS ARE STANDARD.
       01  DRCVITEM-ST-REC.
           COPY DDS-MCRPST0600  OF MCFLST0601.
       FD  DRCVCORR-ST
           LABEL RECORDS ARE STANDARD.
       01  DRCVCORR-ST-REC.
           COPY DDS-MCRPST5400  OF MCFLST5401.
004800*************************************************************
004900*                    WORKING STORAGE                        *
005000*************************************************************
005100 WORKING-STORAGE SECTION.
       77  LIVE-LIT    PIC X(23)  VALUE "++++ LIVE DATABASE ++++".
       77  HISTORY-LIT PIC X(23)  VALUE "++ HISTORY DATABASE ++ ".
       77  MAX-LINES   PIC S99    COMP-4 VALUE 6.
       77  END-OF-CORRECTIONS PIC X VALUE "N".
       77  BEG-OF-CORRECTIONS PIC X VALUE "Y".

       01  FILE-STATUS.
           05  FILE-STATUS-1      PIC X.
           05  FILE-STATUS-2      PIC X.
       01  RELATIVE-RECNO         PIC 9(9).

      *------ WS CONTROL AREA
       01  MAJOR-MINOR                 PIC XXXX.
       01  WS-CONTROL.
           02  FUNCTION-NUM            PIC XX.
                   88  EXIT-KEY-F8-USED                     VALUE "08". LVW000LS
                   88  REFRESH-KEY-F4-USED                  VALUE "04". LVW000LS
                   88  ENTER-KEY-USED                       VALUE "00". LVW000LS
                   88  F1-KEY-USED                          VALUE "01". LVW000LS
                   88  F2-KEY-USED                          VALUE "02". LVW000LS
                   88  F3-KEY-USED                          VALUE "03". LVW000LS
                   88  F4-KEY-USED                          VALUE "04". LVW000LS
                   88  F5-KEY-USED                          VALUE "05". LVW000LS
                   88  F6-KEY-USED                          VALUE "06". LVW000LS
                   88  F7-KEY-USED                          VALUE "07". LVW000LS
                   88  F8-KEY-USED                          VALUE "08". LVW000LS
           02 FUN-KEY REDEFINES FUNCTION-NUM PIC XX.
           02 TERMINAL-ID PIC X(10).
           02 FORMAT-NAME PIC X(10).

       01  DISPLAY-STATUS              PIC X(2).

       01  SRF-INDICATORS.
           05  IND OCCURS 99 TIMES   PIC 1 INDICATOR 01.

       COPY IOFEEDBACK OF COPYLIB.
006000
006100*----------  SUBSCRIPT FOR SCREEN DISPLAY BUFFER
006200 01  LINE-SUB            PIC S99  COMP-4 VALUE ZEROS.
       01  CURR-LINE           PIC S99  COMP-4 VALUE ZEROS.
       01  SUB-LINE            PIC S99  COMP-4 VALUE ZEROS.

       01  PREVIOUS-COUNT      PIC S999 COMP-4 VALUE ZEROS.
006300
006400*----------  SUBSCRIPT FOR DESCRIPTION SUBROUTINE TABLE
006500 01  X                   PIC 9(2)        VALUE ZEROES.
006600
006700 01  PREV-RECORDS        PIC 9            VALUE 0.
006800     88  NO-PREV                          VALUE 1.
006900
007000 01  MORE-RECORDS        PIC 9            VALUE 0.
007100     88  NO-MORE                          VALUE 1.
007200
007300 01  FIRST-TIME          PIC 9             VALUE 0.
007400     88  IS-FIRST-TIME                     VALUE 1.
007500
007600*----------  SAVES RELEASE NUMBER FOR KELLY PLANTS WHEN "000" IS
007700*            MOVE IN TO FIND ACCUMULATOR ENTRY
007800 01  SAVE-PO-RLSE        PIC X(3)        VALUE SPACES.
007900
008000 COPY DBPOARG1 OF COPYLIB.
008100 COPY DBPOARG2 OF COPYLIB.
008200
008300
008400*************************************************************
008500*                 CALLED ROUTINES                           *
008600*************************************************************
008700*---------- VSETERROR AND VPUTWINDOW
008800 01  MESSAGE-BUFFER            PIC X(76)    VALUE SPACES.
008900 01  MESSAGE-BUFFER-RD REDEFINES MESSAGE-BUFFER.
009000     05  MSG-BUFFER            PIC X(68).
009100     05  MSG-VALUE             PIC X(8).
009200 01  MESSAGE-BUFLEN            PIC S9(4)    VALUE 76 COMP-4.
009300 01  MESSAGE-ACTLEN            PIC S9(4)    VALUE 0  COMP-4.
009400 01  FIELD-NUMBER              PIC S9(4)    VALUE 1  COMP-4.
009500
009600 COPY TBLOWUP OF COPYLIB.
009800 COPY TDATECHK OF COPYLIB.
       COPY CATREAD  OF COPYLIB.
009900 COPY CDESC  OF COPYLIB.
010000 COPY CNDESC OF COPYLIB.
010100*************************************************************
010200**               V I E W   W O R K   A R E A               **
010300*************************************************************
010400 01  FORM-NAMES.
010500     05  ITEMDATA              PIC X(8)     VALUE "INQRSI_3".
010600
       01  SCREEN-BUFFER                 PIC X(2000).
010700 01  SCREEN-BUFFER-INQRSIC.
010800     05  VIEW-PO                   PIC X(7)  VALUE SPACES.
010900     05  VIEW-RLSE                 PIC X(3)  VALUE SPACES.
011000     05  VIEW-RS                   PIC X(3)  VALUE SPACES.
011100     05  VIEW-ITEMS                PIC ZZZ   VALUE ZEROES.
011200     05  VIEW-SEQ                  PIC X(6)  VALUE SPACES.
011300     05  VIEW-LAST-RCVR            PIC X(3)  VALUE SPACES.
011400     05  VIEW-ITEM-LINE.
011500       10  VIEW-ITEM               PIC X(4).
011700       10  VIEW-CODE               PIC X(7).
           05  VIEW-CORRECTIONS OCCURS 6 TIMES.
             10  VIEW-CORR-DATE          PIC X(8).
             10  VIEW-CORR-REASONS.
               15  VIEW-CORR-REASON1     PIC X(71).
               15  VIEW-CORR-REASON2     PIC X(70).
           05  VIEW-PAGE-CORRECTIONS     PIC X(1).
           05  VIEW-LIVE-HISTORY         PIC X(23).
           05  DE-COMMAND-LINE           PIC X(79).
           05  DE-MESSAGE-LINE           PIC X(79).
012500*************************************************************
012600**  D A T A B A S E   C O M M U N I C A T I O N   A R E A  **
012700*************************************************************
012800 COPY DBSTAT  OF COPYLIB.
012900 COPY DBMODES OF COPYLIB.
013000 01  ARGUMENT-VALUES.
013100     05  CODE-ARG        PIC X(8)        VALUE SPACES.
013200     05  RS-ARG       PIC X(14)       VALUE SPACES.
013300     05  PLT-ARG         PIC X(4)        VALUE SPACES.
013400     05  PO-ARG          PIC X(14)       VALUE SPACES.
013500
014100 01  ITEMS-LISTING.
014300     05  CODE-SEARCH           PIC X(10)    VALUE "CORP-CODE;".
014400     05  PO-KEY-NAME           PIC X(10)    VALUE "PO-RCV-NO;".
014500
014600 COPY MPORCV  OF COPYLIB.
014700 COPY DRCVITEM OF COPYLIB.
       COPY DRCVITMH OF COPYLIB.
       COPY DRCVCORR OF COPYLIB.
       COPY DRCVCORH OF COPYLIB.
014900
015000*************************************************************
015100**           L I N K A G E   S E C T I O N                 **
015200*************************************************************
015300 LINKAGE SECTION.
015400 01  BASE                      PIC X(10).
015500 COPY VCOMLINK OF COPYLIB.
015600*----------  PARAMETERS FOR ALL INQUIRY SUBROUTINES (SINQRSA,
015700*            SINQRSI, SINQFRT)
015800 01  SUBROUTINE-PARMS.
015900     05  PASS-LAST-RECEIVER    PIC 999.
016000     05  PASS-START-RECEIVER   PIC 999.
016100     05  PASS-PO               PIC X(14).
016200     05  PASS-SPOOL            PIC S9(2).
016300     05  PASS-REDEFINES-AREA.
016310         07  PASS-PLT-NUMBER     PIC X(3).
016320         07  PASS-NO-LEFT-OFF-AT PIC 9(3).
016330     05  TALLY-PASS-AREA REDEFINES PASS-REDEFINES-AREA.
016340         07  PASS-TALLY-ITEM     PIC X(4).
016350         07  FILLER              PIC X(2).
016410*---------- 'R'=RECEIVER, 'F'=FREIGHT, 'T'=TALLY
016500     05  PASS-INQUIRY          PIC X.
016600     05  PASS-SAVE-LASTKEY     PIC S9(4) COMP-4.
           05  PASS-HISTORY-FLAG     PIC X.
           05  PASS-ITEM             PIC 9(4).
016700
016800 COPY LANGSUB OF COPYLIB.
016900
017000**************************************************************
017100**************************************************************
017200*                  PROCEDURE DIVISION                        *
017300*     IF THIS INQUIRY WAS SELECTED BEFORE THE FREIGHT        *
017400*     INQUIRY, THE STARTING RECEIVER NUMBER IS PASSED        *
017500*     OF WHERE TO BEGIN DISPLAYING.  IF THIS INQUIRY         *
017600*     IS CALLED FROM THE FREIGHT INQUIRY, THEN THE           *
017700*     RECEIVER NUMBER TO BEGIN WITH IS PASSED FROM           *
017800*     FREIGHT ROUTINE.  DISPLAY EACH CORRECTION OF A RECVR   *
017900*     UP TO 6  LINES AT A TIME.  FUNCTION KEYS ALLOW         *
018000*     FORWARD AND BACKWARD BROWSING OF ITEMS OR RECEIVERS.   *
      *     FORWARD AND BACKWARD BROWSING OF THE CORRECTIONS MAY   *
      *     BE DONE ENTERING "M" (MORE) OR "P" (PREVIOUS) IN AN    *
      *     INPUT FIELD.                                           *
018100*     THE FREIGHT INQUIRY AND RECEIVER INQUIRY MAY ALSO BE   *
018200*     CALLED BY PRESSING A FUNCTION KEY.                     *
018300**************************************************************
018400**************************************************************
018500 PROCEDURE DIVISION USING  BASE,
018600                           VIEW-COMAREA,
018700                           SUBROUTINE-PARMS,
018800                           LANGUAGE-PARMS.
018900
019000 00-MAIN.
019100     PERFORM 10-HOUSEKEEPING THRU 19-EXIT.
019200
019300     PERFORM 100-DISPLAY-RECEIVER-ITEMS THRU 199-EXIT.

           CLOSE DISPLAY-FILE MPORCV, DRCVITEM.
019400
019500     GOBACK.
019600*************************************************************
019700*     OPEN DATABASE FOR THE SECOND TIME AND SET UP VALUES.  *
019800*************************************************************
019900 10-HOUSEKEEPING.
           IF PASS-HISTORY-FLAG NOT = "Y"
               OPEN INPUT MPORCV, DRCVITEM, DRCVCORR
           ELSE
               OPEN INPUT DRCVITEM-ST, DRCVCORR-ST
           END-IF.
           OPEN I-O DISPLAY-FILE.
020000     MOVE PASS-PO           TO WS-ACCUMULATOR, WS-RECEIVER.
020100     MOVE "000"                 TO WS-ACCUM-RS.
           MOVE "INQRSICR"            TO ITEMDATA.
020200
020700     MOVE PASS-NO-LEFT-OFF-AT TO WS-RS-9.
021000
           IF PASS-HISTORY-FLAG NOT = "Y"
021100         MOVE WS-ACCUMULATOR        TO PO-ARG
021200         MOVE WS-RECEIVER           TO RS-ARG
           ELSE
               MOVE WS-ACCUMULATOR-2-14   TO PO-ARG
               MOVE WS-RECEIVER-2-14      TO RS-ARG
           END-IF.
           MOVE 0 TO CURR-LINE.
           MOVE "N" TO END-OF-CORRECTIONS.
           MOVE "Y" TO BEG-OF-CORRECTIONS.
021300 19-EXIT.  EXIT.
021400
021500*************************************************************
021600*         RETRIEVE DATA AND DISPLAY THE ITEM SCREEN.        *
021700*************************************************************
021800 100-DISPLAY-RECEIVER-ITEMS.
021900     MOVE ITEMDATA TO  VIEW-NFNAME.
022500     MOVE SPACES TO SCREEN-BUFFER-INQRSIC.
022800
           IF PASS-HISTORY-FLAG NOT = "Y"
               MOVE 0 TO COND-WORD
               MOVE PO-ARG TO PORCVNO OF MPORCV-REC
               READ MPORCV INTO BUF-MPORCV
                   INVALID KEY MOVE 17 TO COND-WORD
               END-READ
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   IF FILE-STATUS NOT = "00"
                       MOVE 99 TO COND-WORD
                   END-IF
               END-IF
023200         IF COND-WORD NOT = 0
023300            MOVE "DBGET MPORCV AT 100 SINQRSI" TO BU-DISPLAY-MSG
023400            PERFORM 990-BLOWUP THRU 999-EXIT
               END-IF
           END-IF.
023500
023600     MOVE 2 TO VIEW-LASTKEY.
023700     MOVE PASS-LAST-RECEIVER TO VIEW-LAST-RCVR.
023800
023900 110-NEW-RECEIVER.
           IF PASS-HISTORY-FLAG = "Y"
               GO TO 112-CHAINHD-DRCVITEM.

023901*----------  GET SEQUENCE NUMBER
           IF WS-RS-9 > 998 OR WS-RS-9 < 1
               GO TO 199-EXIT.
           MOVE 0 TO COND-WORD.
           MOVE RS-ARG TO PORCVNO OF MPORCV-REC.
           READ MPORCV INTO BUF-MPORCV
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF COND-WORD = 17
               IF VIEW-LASTKEY = 2 OR 8
                   ADD 1 TO WS-RS-9
               ELSE
                   SUBTRACT 1 FROM WS-RS-9
               END-IF
               MOVE WS-RS-9 TO VIEW-RS
               MOVE WS-RECEIVER TO RS-ARG
               GO TO 110-NEW-RECEIVER
           ELSE
           IF COND-WORD = 0
               MOVE M-PO-RCV-SEQ TO VIEW-SEQ
           ELSE
               MOVE "READ ERR MPORCV" TO BU-DISPLAY-MSG
               PERFORM 990-BLOWUP THRU 999-EXIT.
023980
       112-CHAINHD-DRCVITEM.
           IF WS-RS-9 > 998 OR WS-RS-9 < 1
               GO TO 199-EXIT.
           MOVE 0 TO COND-WORD.
           IF PASS-HISTORY-FLAG NOT = "Y"
               MOVE RS-ARG TO PORCVNO OF DRCVITEM-REC
               START DRCVITEM KEY = PORCVNO OF DRCVITEM-REC
                   INVALID KEY MOVE 17 TO COND-WORD
               END-START
           ELSE
               MOVE RS-ARG TO PORCVNO OF DRCVITEM-ST-REC
               START DRCVITEM-ST KEY = PORCVNO OF DRCVITEM-ST-REC
                   INVALID KEY MOVE 17 TO COND-WORD
               END-START
           END-IF.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
024110     IF NO-ENTRY
               IF VIEW-LASTKEY = 2 OR 8
                   ADD 1 TO WS-RS-9
               ELSE
                   SUBTRACT 1 FROM WS-RS-9
               END-IF
               MOVE WS-RS-9 TO VIEW-RS
               IF PASS-HISTORY-FLAG NOT = "Y"
                   MOVE WS-RECEIVER TO RS-ARG
               ELSE
                   MOVE WS-RECEIVER-2-14 TO RS-ARG
               END-IF
               GO TO 112-CHAINHD-DRCVITEM.
024130
024200     IF NOT GOOD-CALL
              IF PASS-HISTORY-FLAG NOT = "Y"
024300          MOVE "START DRCVITEM 100 SINQRSI" TO BU-DISPLAY-MSG
              ELSE
                MOVE "START DRCVITEM-ST 100 SINQRSI" TO BU-DISPLAY-MSG
              END-IF
024400        PERFORM 990-BLOWUP THRU 999-EXIT.
024500     MOVE ZEROES              TO VIEW-ITEMS.
024700     MOVE 0                     TO MORE-RECORDS.
024800
024900     MOVE WS-PO                 TO VIEW-PO.
025000     MOVE WS-RLSE               TO VIEW-RLSE.
025100     MOVE WS-RS                 TO VIEW-RS.
025110     IF PASS-INQUIRY = "T"
025120        PERFORM 850-MATCH-ITEM THRU 859-EXIT
025130     ELSE
              PERFORM 860-START-ITEM THRU 860-EXIT.
025200*       PERFORM 810-READ-RCVR-FORWARD THRU 819-EXIT.
025300
025400 115-FILL-ITEM-SCREEN.
           PERFORM 800-GET-CORRECTIONS THRU 800-EXIT.
           IF PASS-HISTORY-FLAG NOT = "Y"
               MOVE LIVE-LIT TO VIEW-LIVE-HISTORY
           ELSE
               MOVE HISTORY-LIT TO VIEW-LIVE-HISTORY
           END-IF.
025700
025800*----------  DISPLAY SCREEN WITH ITEM INFORMATION
026500 140-SHOW-FORM.
           MOVE SCREEN-BUFFER-INQRSIC TO SCREEN-BUFFER.
           MOVE SCREEN-BUFFER TO DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
              INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO SRF-INDICATORS.
           MOVE DISPLAY-REC TO SCREEN-BUFFER.

      *------ A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *------ IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.
027300
           MOVE DISPLAY-REC   TO SCREEN-BUFFER-INQRSIC.
027600
027700     IF VIEW-LASTKEY EQUAL  7 OR 3
027800        MOVE 7            TO PASS-SAVE-LASTKEY
027900        GO TO 199-EXIT.

027920*----------  IF TALLY RCVR INQUIRY, ONLY SHOW ONE ITEM
027930     IF PASS-INQUIRY = "T"
027940        GO TO 199-EXIT.
027910
      *----------  FREIGHT INQUIRY
028100     IF VIEW-LASTKEY = 1
               MOVE 2 TO PASS-SAVE-LASTKEY
               IF WS-RS-9 NOT = PASS-NO-LEFT-OFF-AT
                 MOVE 1 TO PASS-ITEM
               ELSE
                 IF PASS-HISTORY-FLAG NOT = "Y"
                   MOVE RCV-ITEM-NUMBER TO PASS-ITEM
                 ELSE
                   MOVE RCVH-ITEM-NUMBER TO PASS-ITEM
                 END-IF
               END-IF
028300         MOVE WS-RS-9 TO PASS-NO-LEFT-OFF-AT
               GO TO 199-EXIT.
029500
029510 142-NEXT-RCVR.
029600*----------  NEXT RECEIVER
029700     IF VIEW-LASTKEY = 2
029800        IF WS-RS = PASS-LAST-RECEIVER OR PASS-INQUIRY = "T"
029900           MOVE  14 TO LANG-SETNUM
030000           MOVE 102 TO LANG-MSGNUM
030100           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
030200           PERFORM 940-VSETERROR THRU 949-EXIT
030300           GO TO 140-SHOW-FORM
030400        ELSE
030500           ADD 1 TO WS-RS-9
030600           MOVE WS-RS-9 TO VIEW-RS
                 IF PASS-HISTORY-FLAG NOT = "Y"
030700               MOVE WS-RECEIVER TO RS-ARG
                 ELSE
                     MOVE WS-RECEIVER-2-14 TO RS-ARG
                 END-IF
                 MOVE 1 TO PASS-ITEM
030800           MOVE 1 TO LINE-SUB
                 MOVE 0 TO CURR-LINE
                 MOVE "N" TO END-OF-CORRECTIONS
                 MOVE "Y" TO BEG-OF-CORRECTIONS
                 MOVE SPACES TO VIEW-PAGE-CORRECTIONS
030900           GO TO 110-NEW-RECEIVER.

      *----------  RECEIVIER INQUIRY
028100     IF VIEW-LASTKEY = 5
               MOVE 1 TO PASS-SAVE-LASTKEY
               IF WS-RS-9 NOT = PASS-NO-LEFT-OFF-AT
                   MOVE 1 TO PASS-ITEM
               ELSE
                 IF PASS-HISTORY-FLAG NOT = "Y"
                     MOVE RCV-ITEM-NUMBER TO PASS-ITEM
                 ELSE
                     MOVE RCVH-ITEM-NUMBER TO PASS-ITEM
                 END-IF
               END-IF
               MOVE WS-RS-9 TO PASS-NO-LEFT-OFF-AT
               GO TO 199-EXIT.
031000
031100*----------  PREVIOUS RECEIVER
031200     IF VIEW-LASTKEY = 6
031300        IF WS-RS = "001" OR PASS-INQUIRY = "T"
031400           MOVE  14 TO LANG-SETNUM
031500           MOVE 103 TO LANG-MSGNUM
031600           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
031700           PERFORM 940-VSETERROR THRU 949-EXIT
031800           GO TO 140-SHOW-FORM
031900        ELSE
032000           SUBTRACT 1 FROM WS-RS-9
032100           MOVE WS-RS-9 TO VIEW-RS
                 IF PASS-HISTORY-FLAG NOT = "Y"
032200               MOVE WS-RECEIVER TO RS-ARG
                 ELSE
                     MOVE WS-RECEIVER-2-14 TO RS-ARG
                 END-IF
                 MOVE 1 TO PASS-ITEM
032300           MOVE 1 TO LINE-SUB
                 MOVE 0 TO CURR-LINE
                 MOVE "N" TO END-OF-CORRECTIONS
                 MOVE "Y" TO BEG-OF-CORRECTIONS
                 MOVE SPACES TO VIEW-PAGE-CORRECTIONS
032400           GO TO 110-NEW-RECEIVER.
032500
032600*----------  MORE ITEMS
032700     IF VIEW-LASTKEY = 8
032800        IF NO-MORE OR PASS-INQUIRY = "T"
032900           MOVE  14 TO LANG-SETNUM
033000           MOVE 104 TO LANG-MSGNUM
033100           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
033200           PERFORM 940-VSETERROR THRU 949-EXIT
033300           GO TO 140-SHOW-FORM
033400        ELSE
033500          PERFORM 810-READ-RCVR-FORWARD THRU 819-EXIT
                IF NO-MORE OR (NOT GOOD-CALL)
                   MOVE 14 TO LANG-SETNUM
                   MOVE 104 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   PERFORM 940-VSETERROR THRU 949-EXIT
                   GO TO 140-SHOW-FORM
                ELSE
                   MOVE 0 TO CURR-LINE
                   MOVE "N" TO END-OF-CORRECTIONS
                   MOVE "Y" TO BEG-OF-CORRECTIONS
                   MOVE SPACES TO VIEW-PAGE-CORRECTIONS
033600             GO TO 115-FILL-ITEM-SCREEN.
033700
033800*----------  PREVIOUS ITEMS
033900
034000     IF VIEW-LASTKEY = 4
               IF NO-PREV OR PASS-INQUIRY = "T"
034200          MOVE  14 TO LANG-SETNUM
034300          MOVE 105 TO LANG-MSGNUM
034400          PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
034500          PERFORM  940-VSETERROR THRU 949-EXIT
034600          GO TO  140-SHOW-FORM
034800         ELSE
034900          PERFORM 820-READ-RCVR-BACKWARD THRU 829-EXIT
                IF NO-PREV OR NOT GOOD-CALL
                 MOVE  14 TO LANG-SETNUM
                 MOVE 105 TO LANG-MSGNUM
                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                 PERFORM 940-VSETERROR THRU 949-EXIT
                 GO TO 140-SHOW-FORM
                ELSE
                 MOVE 0 TO CURR-LINE
                 MOVE "N" TO END-OF-CORRECTIONS
                 MOVE "Y" TO BEG-OF-CORRECTIONS
                 MOVE SPACES TO VIEW-PAGE-CORRECTIONS
                 GO TO 115-FILL-ITEM-SCREEN.

           IF VIEW-PAGE-CORRECTIONS NOT = "M" AND "P"
               GO TO 140-SHOW-FORM.
           IF VIEW-PAGE-CORRECTIONS = "M"
               IF END-OF-CORRECTIONS = "Y"
                 MOVE  14 TO LANG-SETNUM
                 MOVE  96 TO LANG-MSGNUM
                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                 MOVE 1 TO FIELD-NUMBER
                 PERFORM 940-VSETERROR THRU 949-EXIT
                 GO TO 140-SHOW-FORM
               ELSE
                 MOVE "N" TO BEG-OF-CORRECTIONS
                 GO TO 115-FILL-ITEM-SCREEN
           ELSE
               IF VIEW-PAGE-CORRECTIONS = "P"
                 IF BEG-OF-CORRECTIONS = "Y"
                   MOVE  14 TO LANG-SETNUM
                   MOVE  98 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 1 TO FIELD-NUMBER
                   PERFORM 940-VSETERROR THRU 949-EXIT
                   GO TO 140-SHOW-FORM
                 ELSE
                   MOVE "N" TO END-OF-CORRECTIONS
                   GO TO 115-FILL-ITEM-SCREEN.
       199-EXIT.  EXIT.

      *----------  GET CORRECTIONS FOR RECEIVING SLIP ITEM
       800-GET-CORRECTIONS.
           MOVE 0 TO COND-WORD.
           MOVE 0 TO SUB-LINE.
           PERFORM MAX-LINES TIMES
               ADD 1 TO SUB-LINE
               MOVE SPACES TO VIEW-CORRECTIONS (SUB-LINE)
           END-PERFORM.
           IF VIEW-PAGE-CORRECTIONS = "P"
               COMPUTE PREVIOUS-COUNT = MAX-LINES + CURR-LINE
               MOVE "00" TO FILE-STATUS
               PERFORM PREVIOUS-COUNT TIMES
                 IF FILE-STATUS = "00"
                   IF PASS-HISTORY-FLAG NOT = "Y"
                     READ DRCVCORR PRIOR INTO BUF-DRCVCORR
                        AT END MOVE FILE-STATUS TO FILE-STATUS
                     END-READ
                   ELSE
                     READ DRCVCORR-ST PRIOR INTO BUF-DRCVCORR
                        AT END MOVE FILE-STATUS TO FILE-STATUS
                     END-READ
                   END-IF
                   IF FILE-STATUS NOT = "00"
                       MOVE SPACES TO VIEW-PAGE-CORRECTIONS
                   ELSE
                     IF PASS-HISTORY-FLAG NOT = "Y"
                       IF CORR-PO-NUMBER NOT = RCV-PO-RCV-NO  OR
                        CORR-ITEM NOT = RCV-ITEM-NUMBER
                            MOVE "Y" TO BEG-OF-CORRECTIONS
                            READ DRCVCORR NEXT INTO BUF-DRCVCORR
                            MOVE "10" TO FILE-STATUS
                       END-IF
                     ELSE
                       IF CORR-PO-NUMBER NOT = RCVH-PO-RCV-NO  OR
                        CORR-ITEM NOT = RCVH-ITEM-NUMBER
                            MOVE "Y" TO BEG-OF-CORRECTIONS
                            READ DRCVCORR-ST NEXT INTO BUF-DRCVCORR
                            MOVE "10" TO FILE-STATUS
                       END-IF
                     END-IF
                   END-IF
                 END-IF
               END-PERFORM
               IF FILE-STATUS = "00"
                   IF PASS-HISTORY-FLAG NOT = "Y"
                     READ DRCVCORR NEXT INTO BUF-DRCVCORR
                   ELSE
                     READ DRCVCORR-ST NEXT INTO BUF-DRCVCORR
                   END-IF
               END-IF
               MOVE 1 TO CURR-LINE
               MOVE 4                   TO DATE-MODE
               MOVE CORR-DATE           TO DATE-VALIDATE-IN
               CALL "TDATECK2" USING DATE-CHECK-AREA
                                     LANGUAGE-PARMS
               MOVE DATE-SLASH-OUT TO VIEW-CORR-DATE (CURR-LINE)
               MOVE CORR-REASON TO VIEW-CORR-REASONS (CURR-LINE)
           END-IF.
           IF VIEW-PAGE-CORRECTIONS = "M"
               MOVE 0 TO CURR-LINE
           END-IF.
           IF VIEW-PAGE-CORRECTIONS = SPACES
               MOVE 0 TO CURR-LINE
               MOVE "Y" TO BEG-OF-CORRECTIONS
               IF PASS-HISTORY-FLAG NOT = "Y"
                 MOVE RCV-PO-RCV-NO TO PORCVNO OF DRCVCORR
                 MOVE RCV-ITEM-NUMBER TO ITEMNO OF DRCVCORR
                 START DRCVCORR KEY NOT < EXTERNALLY-DESCRIBED-KEY
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                 END-START
               ELSE
                 MOVE RCVH-PO-RCV-NO TO PORCVNO OF DRCVCORR-ST
                 MOVE RCVH-ITEM-NUMBER TO ITMNO OF DRCVCORR-ST
                 START DRCVCORR-ST KEY NOT < EXTERNALLY-DESCRIBED-KEY
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                 END-START
               END-IF
               IF FILE-STATUS NOT = "00"
                 MOVE 17 TO COND-WORD
                 GO TO 800-END
               END-IF
           END-IF.

       800-LOOP-CORRECTIONS.
           IF PASS-HISTORY-FLAG NOT = "Y"
             READ DRCVCORR NEXT INTO BUF-DRCVCORR
                 AT END MOVE FILE-STATUS TO FILE-STATUS
             END-READ
           ELSE
             READ DRCVCORR-ST NEXT INTO BUF-DRCVCORR
                 AT END MOVE FILE-STATUS TO FILE-STATUS
             END-READ
           END-IF.
           IF FILE-STATUS = "00"
             IF PASS-HISTORY-FLAG NOT = "Y"
               IF CORR-PO-NUMBER NOT = RCV-PO-RCV-NO OR
                  CORR-ITEM NOT = RCV-ITEM-NUMBER
                  MOVE "10" TO FILE-STATUS
               END-IF
             ELSE
               IF CORR-PO-NUMBER NOT = RCVH-PO-RCV-NO OR
                  CORR-ITEM NOT = RCVH-ITEM-NUMBER
                  MOVE "10" TO FILE-STATUS
               END-IF
           END-IF.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
                   MOVE "Y" TO END-OF-CORRECTIONS
                   IF PASS-HISTORY-FLAG NOT = "Y"
                     READ DRCVCORR PRIOR INTO BUF-DRCVCORR
                   ELSE
                     READ DRCVCORR PRIOR INTO BUF-DRCVCORR
                   END-IF
               ELSE
                   MOVE 99 TO COND-WORD
               END-IF
           ELSE
               IF CURR-LINE = MAX-LINES
                 IF PASS-HISTORY-FLAG NOT = "Y"
                   READ DRCVCORR PRIOR INTO BUF-DRCVCORR
                 ELSE
                   READ DRCVCORR PRIOR INTO BUF-DRCVCORR
                 END-IF
               ELSE
                   ADD 1 TO CURR-LINE
                   MOVE 4                   TO DATE-MODE
                   MOVE CORR-DATE           TO DATE-VALIDATE-IN
                   CALL "TDATECK2" USING DATE-CHECK-AREA
                                         LANGUAGE-PARMS
                   MOVE DATE-SLASH-OUT TO VIEW-CORR-DATE (CURR-LINE)
                   MOVE CORR-REASON TO VIEW-CORR-REASONS (CURR-LINE)
                   GO TO 800-LOOP-CORRECTIONS
               END-IF
           END-IF.

       800-END.
           IF COND-WORD = 99
              IF PASS-HISTORY-FLAG NOT = "Y"
                MOVE "DRCVCORR 800 SINQRSI" TO BU-DISPLAY-MSG
              ELSE
                MOVE "DRCVCORR-ST 800 SINQRSI" TO BU-DISPLAY-MSG
              END-IF
              PERFORM 990-BLOWUP THRU 999-EXIT
           ELSE
           IF COND-WORD NOT = 0
              IF CURR-LINE = 0
      *---------- NO CORRECTIONS EXIST FOR THIS ITEM
                MOVE 14                    TO LANG-SETNUM
                MOVE 125                   TO LANG-MSGNUM
                PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                PERFORM 940-VSETERROR THRU 949-EXIT
                MOVE MESSAGE-BUFFER        TO DE-MESSAGE-LINE.
       800-EXIT.
           EXIT.

039800 810-READ-RCVR-FORWARD.
           MOVE 0 TO COND-WORD.
           MOVE "00" TO FILE-STATUS.
           IF PASS-HISTORY-FLAG NOT = "Y"
               READ DRCVITEM NEXT INTO BUF-DRCVITEM
                   AT END MOVE 15 TO COND-WORD
               END-READ
           ELSE
               READ DRCVITEM-ST NEXT INTO BUF-DRCVITEM-H
                   AT END MOVE 15 TO COND-WORD
               END-READ
           END-IF.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
           ELSE
               IF PASS-HISTORY-FLAG NOT = "Y"
                   IF PORCVNO OF DRCVITEM-REC NOT = RS-ARG
                       READ DRCVITEM PRIOR INTO BUF-DRCVITEM
                           AT END MOVE 15 TO COND-WORD
                       END-READ
                       MOVE 15 TO COND-WORD
                   END-IF
               ELSE
                   IF PORCVNO OF DRCVITEM-ST-REC NOT = RS-ARG
                       READ DRCVITEM-ST PRIOR INTO BUF-DRCVITEM-H
                           AT END MOVE 15 TO COND-WORD
                       END-READ
                       MOVE 15 TO COND-WORD
                   END-IF
               END-IF
           END-IF.
           IF GOOD-CALL
               MOVE 0 TO PREV-RECORDS
           ELSE
               MOVE 1 TO MORE-RECORDS
           END-IF.
           IF GOOD-CALL
               IF PASS-HISTORY-FLAG NOT = "Y"
041000             PERFORM 840-MOVE-RCVR THRU 849-EXIT
               ELSE
                   PERFORM 840-MOVE-RCVR-H THRU 849-H-EXIT
               END-IF
           END-IF.
041100 819-EXIT.  EXIT.
041200
041300 820-READ-RCVR-BACKWARD.
           MOVE 0 TO COND-WORD.
           MOVE "00" TO FILE-STATUS.
           IF PASS-HISTORY-FLAG NOT = "Y"
               READ DRCVITEM PRIOR RECORD INTO BUF-DRCVITEM
                   AT END MOVE 14 TO COND-WORD
               END-READ
           ELSE
               READ DRCVITEM-ST PRIOR RECORD INTO BUF-DRCVITEM-H
                   AT END MOVE 14 TO COND-WORD
               END-READ
           END-IF.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "1"
                   MOVE 14 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
           ELSE
               IF PASS-HISTORY-FLAG NOT = "Y"
                   IF PORCVNO OF DRCVITEM-REC NOT = RS-ARG
                       READ DRCVITEM NEXT INTO BUF-DRCVITEM
                           AT END MOVE 14 TO COND-WORD
                       END-READ
                       MOVE 14 TO COND-WORD
                   END-IF
               ELSE
                   IF PORCVNO OF DRCVITEM-ST-REC NOT = RS-ARG
                       READ DRCVITEM-ST NEXT INTO BUF-DRCVITEM-H
                           AT END MOVE 14 TO COND-WORD
                       END-READ
                       MOVE 14 TO COND-WORD
                   END-IF
               END-IF
           END-IF.
           IF GOOD-CALL
041800         MOVE 0 TO MORE-RECORDS
           ELSE
               MOVE 1 TO PREV-RECORDS.
041900*    IF NOT GOOD-CALL
042000*       MOVE "DBGET DRCVITEM 820 SINQRSI" TO BU-DISPLAY-MSG
042100*       PERFORM 990-BLOWUP THRU 999-EXIT.
           IF GOOD-CALL
               IF PASS-HISTORY-FLAG NOT = "Y"
042200             PERFORM 840-MOVE-RCVR THRU 849-EXIT
               ELSE
                   PERFORM 840-MOVE-RCVR-H THRU 849-H-EXIT
               END-IF
           END-IF.
042300 829-EXIT.  EXIT.

046300 840-MOVE-RCVR.
046400     MOVE RCV-CORP-CODE         TO VIEW-CODE.
046500     MOVE RCV-ITEM-NUMBER       TO VIEW-ITEM.
           MOVE RCV-PO-RCVR         TO WS-RS, VIEW-RS.
047800 849-EXIT.  EXIT.

046300 840-MOVE-RCVR-H.
046400     MOVE RCVH-CORP-CODE      TO VIEW-CODE.
046500     MOVE RCVH-ITEM-NUMBER    TO VIEW-ITEM.
           MOVE RCVH-PO-RCVR        TO WS-RS, VIEW-RS.
047800 849-H-EXIT.  EXIT.

047810 850-MATCH-ITEM.
           MOVE 0 TO COND-WORD.
           IF PASS-HISTORY-FLAG NOT = "Y"
               READ DRCVITEM NEXT INTO BUF-DRCVITEM
                   AT END MOVE 15 TO COND-WORD
               END-READ
           ELSE
               READ DRCVITEM-ST NEXT INTO BUF-DRCVITEM-H
                   AT END MOVE 15 TO COND-WORD
               END-READ
           END-IF.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PASS-HISTORY-FLAG NOT = "Y"
               IF PORCVNO OF DRCVITEM-REC NOT = RS-ARG
                   MOVE 15 TO COND-WORD
               END-IF
           ELSE
               IF PORCVNO OF DRCVITEM-ST-REC NOT = RS-ARG
                   MOVE 15 TO COND-WORD
               END-IF
           END-IF.
047840     IF NOT GOOD-CALL
047850        GO TO 859-EXIT.
           IF PASS-HISTORY-FLAG NOT = "Y"
047860         IF RCV-ITEM-NUMBER NOT = PASS-TALLY-ITEM
047870            GO TO 850-MATCH-ITEM
               END-IF
047871         PERFORM 840-MOVE-RCVR THRU 849-EXIT
           ELSE
047860         IF RCVH-ITEM-NUMBER NOT = PASS-TALLY-ITEM
047870            GO TO 850-MATCH-ITEM
               END-IF
047871         PERFORM 840-MOVE-RCVR-H THRU 849-H-EXIT
           END-IF.
047880 859-EXIT.  EXIT.

       860-START-ITEM.
           MOVE 0 TO COND-WORD.
           IF PASS-HISTORY-FLAG NOT = "Y"
               READ DRCVITEM NEXT INTO BUF-DRCVITEM
                   AT END MOVE 15 TO COND-WORD
               END-READ
           ELSE
               READ DRCVITEM-ST NEXT INTO BUF-DRCVITEM-H
                   AT END MOVE 15 TO COND-WORD
               END-READ
           END-IF.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PASS-HISTORY-FLAG NOT = "Y"
               IF PORCVNO OF DRCVITEM-REC NOT = RS-ARG
                   MOVE 15 TO COND-WORD
               END-IF
           ELSE
               IF PORCVNO OF DRCVITEM-ST-REC NOT = RS-ARG
                   MOVE 15 TO COND-WORD
               END-IF
           END-IF.
           IF NOT GOOD-CALL
              GO TO 860-EXIT.
           IF PASS-HISTORY-FLAG NOT = "Y"
               IF RCV-ITEM-NUMBER < PASS-ITEM
                  GO TO 860-START-ITEM
               END-IF
               PERFORM 840-MOVE-RCVR THRU 849-EXIT
           ELSE
               IF RCVH-ITEM-NUMBER < PASS-ITEM
                  GO TO 860-START-ITEM
               END-IF
               PERFORM 840-MOVE-RCVR-H THRU 849-H-EXIT
           END-IF.
       860-EXIT.
           EXIT.

049400 940-VSETERROR.
           MOVE B"1" TO IND (FIELD-NUMBER)  IND (99).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE.
051300
050700 949-EXIT.  EXIT.
051700************************************************************
051800************************************************************
051900*                    B L O W U P                           *
052000*     CHECK FOR IMAGE, VIEW, OR SPOOL ERROR.  CLOSE        *
052100*     FILES, GET OUT OF BLOCK MODE, AND DISPLAY            *
052200*     APPROPRIATE ERROR MESSAGE ON SCREEN.                 *
052300*                                                          *
052400*     ALSO APPENDS THE ERROR MESSAGE TO A FILE CALLED      *
052500*     BLOWUP.PUB.  TO READ THIS FILE, RUN "XBLPRT.OBJECT". *
052600*                                                          *
052700*         |||  PROGRAM IS ABORTED IN TBLOWUP  |||          *
052800************************************************************
052900************************************************************
053000 990-BLOWUP.
053100     MOVE "SINQRSI"       TO BU-PGM-NAME.
053200     MOVE VIEW-NFNAME     TO BU-DISPLAY-FLD (1).
053300     MOVE RS-ARG          TO BU-DISPLAY-FLD (2).
053400     MOVE CODE-ARG        TO BU-DISPLAY-FLD (3)
           IF PASS-HISTORY-FLAG NOT = "Y"
053500         MOVE RCV-ITEM-NUMBER TO BU-DISPLAY-FLD (4)
           ELSE
               MOVE RCVH-ITEM-NUMBER TO BU-DISPLAY-FLD (4)
               MOVE "HISTORY"   TO BU-DISPLAY-FLD (5)
           END-IF.
053600     CALL "TBLOWUP" USING BASE BU-PGM-NAME
053700           STATUS-AREA VIEW-COMAREA
053800           FILE-STATUS BU-DISPLAY-MSG BU-DISPLAY-FLDS.
053900 999-EXIT.  EXIT.
054000
054100 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
055700 999-CATREAD-EXIT.
055800     EXIT.
