000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    SINQRSI.
000400 AUTHOR.        BARBARA WINTER.
000500 DATE-WRITTEN.  DECEMBER 12, 1986.
000600 DATE-COMPILED.
000700*REMARKS.       SUBROUTINE THAT SHOWS RECEIVING SLIP ITEM DATA.
000800*************************************************************
000900*************************************************************
001000*                      S I N Q R S I                        *
001100*                                                           *
001200*    THIS SUBROUTINE SHOWS ITEM INFORMATION FOR ALL ITEMS   *
001300*    ON A RECEIVING SLIP.  ITEMS MAY BE BROWSED FORWARD AND *
001400*    BACKWARD.  RECEIVING SLIPS MAY ALSO BE BROWSED         *
001500*    FORWARD AND BACKWARD FROM ANY POINT.  THIS MEANS THAT  *
001600*    ONE OF FOUR CHOICES CAN BE MADE WHEN BROWSING;         *
001700*            1.  PREVIOUS ITEMS ON CURRENT RECEIVER         *
001800*            2.  MORE ITEMS ON CURRENT RECEIVER             *
001900*            3.  PREVIOUS RECEIVING SLIP                    *
002000*            4.  NEXT RECEIVING SLIP                        *
002100*                                                           *
002200*    THE FREIGHT INQUIRY MAY BE SELECTED AT ANY TIME ALSO.  *
002300*    THE FREIGHT INQUIRY WILL PICK UP FROM THE CURRENT      *
002400*    RECEIVING SLIP BEING REVIEWED IN THIS PROGRAM.  THERE  *
002500*    IS ONE EXCEPTION TO THIS RULE.  IF, IN THE MAIN        *
002600*    PROGRAM, THE USER ENTERED A PO AND CHOSE TO GO         *
002700*    DIRECTLY TO THE FREIGHT INQUIRY FIRST, THEN THE USER   *
002800*    CHOSE TO EXECUTE THIS RECEIVING SLIP INQUIRY FROM THE  *
002900*    FREIGHT INQUIRY, THE FREIGHT INQUIRY WILL BE CONSIDERED*
003000*    THE "DRIVING" PROGRAM AND THIS PROGRAM WILL PICK UP    *
003100*    THE RECEIVING SLIP LAST REVIEWED ON THE FREIGHT        *
003200*    SCREEN, ALLOW THE USER TO BROWSE FORWARD AND BACKWARD, *
003300*    BUT THEN RETURN TO THE FREIGHT INQUIRY ON THE RECEIVER *
003400*    WHERE THE FREIGHT HAD LEFT OFF.                        *
003500*************************************************************
003600*    CALLING PROGRAMS:                                      *
003700*       1.  SRSINQS  -  MAIN SUBROUTINE FOR RS INQUIRY      *
003800*       2.  SINQFRT  -  FREIGHT INQUIRY                     *
003900*************************************************************
      *************************************************************
      *C               HISTORY OF CHANGES
      *C
      *C  11/22/93  JEFF BUNGO  REQ # 4502
      *C      MODIFIED LOGIC TO GO TO HISTORY DATABASE FOR THE
      *C      INQUIRY IF THE PASS-HISTORY-FLAG IS SET TO "Y".
      *C
      *C  06/07/96  JEFF BUNGO
      *C      EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C      RECOMPILE TO PICK UP NEW FILE FORMATS.
      *C
      *C  08/29/00  JIM COFFMAN
      *C      REMOVED CHECKS IN PARAGRAPHS 110-NEW-RECIEVER
      *C      AND 112-CHAINHD-DRCVITEM FOR RECEIVER NUMBER
      *C      GREATER THAN 998 ASA DANVILLE HAD A 999 RECEIVER
      *C      NUMBER AND THEY COULD NOT VIEW THE DATA.
      *C
      *C  04/16/02  CA YODER     (NAPANEE REQUEST)
      *C      ADDED SUBFILE LOGIC TO DISPLAY RECEIVING SLIP
      *C      DESCRIPTION.  ALSO ADDED CALL TO "CCRQDESC"
      *C      TO SHOW MP8 COMPLIANCE REQUIREMENT INFORMATION.
      *C      NOTE:  THIS PROGRAM NOW USES THE SCREEN PROGRAM
      *C      ZINQRS INSTEAD OF ZCSISINQ.
      *C
      *C  06/04/2003 WR FONAGY
      *C      ADD LOGIC TO ONLY DISPLAY A MAXIMUM OF 25 LINES
      *C      OF DESCRIPTION.  UNION CITY HAD BLOWUP DUE TO
      *C      A RECEIVING SLIP THAT CONTAINED 26 LINES OF
      *C      DESCRIPTION.
      *C***********************************************************
004000
004100 ENVIRONMENT DIVISION.
004200 CONFIGURATION SECTION.
004300 SOURCE-COMPUTER.    HP-3000.
004400 OBJECT-COMPUTER.    HP-3000.
       SPECIAL-NAMES.  I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
004500 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
      ************ASSIGN TO WORKSTATION-ZCSISINQ-SI
                  ASSIGN TO WORKSTATION-ZINQRS-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS DYNAMIC
                  RELATIVE KEY IS REC-COUNT
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.
            SELECT DPOITEM
               ASSIGN TO DATABASE-MCFLCS1002
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT MPORCV
               ASSIGN TO DATABASE-MCFLCS0101
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT DRCVITEM
               ASSIGN TO DATABASE-MCFLCS1201
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
            SELECT DPOITEM-ST
               ASSIGN TO DATABASE-MCFLST0401
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT DRCVITEM-ST
               ASSIGN TO DATABASE-MCFLST0601
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
004600 DATA DIVISION.
004700 FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC          PIC X(2000).
017000
       FD  DPOITEM
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-REC.
           COPY DDS-MCRPCS1000  OF MCFLCS1002.

       FD  MPORCV
           LABEL RECORDS ARE STANDARD.
       01  MPORCV-REC.
           COPY DDS-MCRPCS0100  OF MCFLCS0101.

       FD  DRCVITEM
           LABEL RECORDS ARE STANDARD.
       01  DRCVITEM-REC.
           COPY DDS-MCRPCS1200  OF MCFLCS1201.

       FD  DPOITEM-ST
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-ST-REC.
           COPY DDS-MCRPST0400  OF MCFLST0401.
       FD  DRCVITEM-ST
           LABEL RECORDS ARE STANDARD.
       01  DRCVITEM-ST-REC.
           COPY DDS-MCRPST0600  OF MCFLST0601.
004800*************************************************************
004900*                    WORKING STORAGE                        *
005000*************************************************************
005100 WORKING-STORAGE SECTION.
       77  LIVE-LIT    PIC X(23)  VALUE "++++ LIVE DATABASE ++++".
       77  HISTORY-LIT PIC X(23)  VALUE "++ HISTORY DATABASE ++ ".
       77  SUB         PIC 9      VALUE 0.
       77  PRINT-DCOMPL-SW        PIC X      VALUE "N".
       01  FILE-STATUS.
           05  FILE-STATUS-1      PIC X.
           05  FILE-STATUS-2      PIC X.
       01  REC-COUNT              PIC 9(9).

       01  DISPLAY-DATE           PIC 9(6).

      *------ WS CONTROL AREA
       01  MAJOR-MINOR                 PIC XXXX.
       01  WS-CONTROL.
           02  FUNCTION-NUM            PIC XX.
                   88  EXIT-KEY-F8-USED                     VALUE "08". LVW000LS
                   88  REFRESH-KEY-F4-USED                  VALUE "04". LVW000LS
                   88  ENTER-KEY-USED                       VALUE "00". LVW000LS
                   88  F1-KEY-USED                          VALUE "01". LVW000LS
                   88  F2-KEY-USED                          VALUE "02". LVW000LS
                   88  F3-KEY-USED                          VALUE "03". LVW000LS
                   88  F4-KEY-USED                          VALUE "04". LVW000LS
                   88  F5-KEY-USED                          VALUE "05". LVW000LS
                   88  F6-KEY-USED                          VALUE "06". LVW000LS
                   88  F7-KEY-USED                          VALUE "07". LVW000LS
                   88  F8-KEY-USED                          VALUE "08". LVW000LS
           02 FUN-KEY REDEFINES FUNCTION-NUM PIC XX.
           02 TERMINAL-ID PIC X(10).
           02 FORMAT-NAME PIC X(10).

       01  DISPLAY-STATUS              PIC X(2).

       01  SRF-INDICATORS.
           05  IND OCCURS 99 TIMES   PIC 1 INDICATOR 01.

       01  OFF-SWITCH               PIC 1  VALUE B"0".
       01  ON-SWITCH                PIC 1  VALUE B"1".

       COPY IOFEEDBACK OF COPYLIB.
005200 01  WS-SUB-SUBDETL-DATALINE.
005300     05  WS-SUB-LIT         PIC X(4)      VALUE SPACES.
005400     05  WS-SUB             PIC X(4)      VALUE SPACES.
005500     05  WS-SUBDETL-LIT     PIC X(12)     VALUE "   SUB-DETL ".
005600     05  WS-SUB-DETL        PIC X(4)      VALUE SPACES.
005700     05  WS-ADDL-DATA-LIT   PIC X(13)     VALUE "   ADDL-DATA ".
005800     05  WS-ADDL-DATA       PIC X(10)     VALUE SPACES.
005900
006000
006100*----------  SUBSCRIPT FOR SCREEN DISPLAY BUFFER
006200 01  LINE-SUB            PIC S99  COMP-4 VALUE ZEROS.
006300
006400*----------  SUBSCRIPT FOR DESCRIPTION SUBROUTINE TABLE
006500 01  X                   PIC 9(2)        VALUE ZEROES.
006600
006700 01  PREV-RECORDS        PIC 9            VALUE 0.
006800     88  NO-PREV                          VALUE 1.
006900
007000 01  MORE-RECORDS        PIC 9            VALUE 0.
007100     88  NO-MORE                          VALUE 1.
007200
007300 01  FIRST-TIME          PIC 9             VALUE 0.
007400     88  IS-FIRST-TIME                     VALUE 1.
007500
007600*----------  SAVES RELEASE NUMBER FOR KELLY PLANTS WHEN "000" IS
007700*            MOVE IN TO FIND ACCUMULATOR ENTRY
007800 01  SAVE-PO-RLSE        PIC X(3)        VALUE SPACES.
007900
008000 COPY DBPOARG1 OF COPYLIB.
008100 COPY DBPOARG2 OF COPYLIB.
008200
008300
008400*************************************************************
008500*                 CALLED ROUTINES                           *
008600*************************************************************
008700*---------- VSETERROR AND VPUTWINDOW
008800 01  MESSAGE-BUFFER            PIC X(76)    VALUE SPACES.
008900 01  MESSAGE-BUFFER-RD REDEFINES MESSAGE-BUFFER.
009000     05  MSG-BUFFER            PIC X(68).
009100     05  MSG-VALUE             PIC X(8).
009200 01  MESSAGE-BUFLEN            PIC S9(4)    VALUE 76 COMP-4.
009300 01  MESSAGE-ACTLEN            PIC S9(4)    VALUE 0  COMP-4.
009400 01  FIELD-NUMBER              PIC S9(4)    VALUE 1  COMP-4.
009500
009600 COPY TBLOWUP OF COPYLIB.
009800 COPY TDATECHK OF COPYLIB.
       COPY CATREAD  OF COPYLIB.
009900 COPY CDESC  OF COPYLIB.
010000 COPY CNDESC OF COPYLIB.

       01  CCRQDESC-PARMS.
           05  CCRQDESC-CODE          PIC X(7).
           05  CCRQDESC-LINES.
               10  CCRQDESC-LINE  OCCURS 10 TIMES
                                      PIC X(80).

       COPY CCHKOBJ OF COPYLIB.

010100*************************************************************
010200**               V I E W   W O R K   A R E A               **
010300*************************************************************
010400 01  FORM-NAMES.
010500     05  ITEMDATA              PIC X(8)     VALUE "INQRSI_3".
010600
       01  SCREEN-BUFFER                 PIC X(2000).
010700 01  SCREEN-BUFFER-INQRSI.
010800     05  VIEW-PO                   PIC X(7)  VALUE SPACES.
010900     05  VIEW-RLSE                 PIC X(3)  VALUE SPACES.
011000     05  VIEW-RS                   PIC X(3)  VALUE SPACES.
011100     05  VIEW-ITEMS                PIC ZZZ   VALUE ZEROES.
011200     05  VIEW-SEQ                  PIC X(6)  VALUE SPACES.
011300     05  VIEW-LAST-RCVR            PIC X(3)  VALUE SPACES.
011400     05  VIEW-ITEM-LINE.
011500       10  VIEW-ITEM               PIC X(4).
011600       10  VIEW-COMPLETE           PIC X.
011700       10  VIEW-CODE               PIC X(7).
011800       10  VIEW-QTY-DLVR           PIC ZZZZZZZ9.9999.
011900       10  VIEW-UM                 PIC X(2).
012000       10  VIEW-QTY-STOR           PIC ZZZZZZZ9.9999.
012100       10  VIEW-DLVR-DATE          PIC X(8).
012200       10  VIEW-STOR-DATE          PIC X(8).
012300*****05  VIEW-DESC-AREA.
012400*********10  VIEW-DESC OCCURS 13 TIMES   PIC X(79).

       01  SCREEN-BUFFER-INQRSI-B.
012410     05  VIEW-LOT                  PIC X(4).
012420     05  VIEW-TALLY                PIC X(4).
           05  VIEW-CHATNO               PIC X(6).
           05  VIEW-LIVE-HISTORY         PIC X(23).
           05  DE-COMMAND-LINE           PIC X(79).
           05  DE-MESSAGE-LINE           PIC X(79).

       01  SC-LINE-BUF                   PIC X(79).

012500*************************************************************
012600**  D A T A B A S E   C O M M U N I C A T I O N   A R E A  **
012700*************************************************************
012800 COPY DBSTAT  OF COPYLIB.
012900 COPY DBMODES OF COPYLIB.
013000 01  ARGUMENT-VALUES.
013100     05  CODE-ARG        PIC X(8)        VALUE SPACES.
013200     05  RS-ARG       PIC X(14)       VALUE SPACES.
013300     05  PLT-ARG         PIC X(4)        VALUE SPACES.
013400     05  PO-ARG          PIC X(14)       VALUE SPACES.
013500
014100 01  ITEMS-LISTING.
014300     05  CODE-SEARCH           PIC X(10)    VALUE "CORP-CODE;".
014400     05  PO-KEY-NAME           PIC X(10)    VALUE "PO-RCV-NO;".
014500
014600 COPY MPORCV  OF COPYLIB.
014700 COPY DRCVITEM OF COPYLIB.
014800 COPY DPOITEM   OF COPYLIB.
       COPY DPOITEMH OF COPYLIB.
       COPY DRCVITMH OF COPYLIB.
014900
015000*************************************************************
015100**           L I N K A G E   S E C T I O N                 **
015200*************************************************************
015300 LINKAGE SECTION.
015400 01  BASE                      PIC X(10).
015500 COPY VCOMLINK OF COPYLIB.
015600*----------  PARAMETERS FOR ALL INQUIRY SUBROUTINES (SINQRSA,
015700*            SINQRSI, SINQFRT)
015800 01  SUBROUTINE-PARMS.
015900     05  PASS-LAST-RECEIVER    PIC 999.
016000     05  PASS-START-RECEIVER   PIC 999.
016100     05  PASS-PO               PIC X(14).
016200     05  PASS-SPOOL            PIC S9(2).
016300     05  PASS-REDEFINES-AREA.
016310         07  PASS-PLT-NUMBER     PIC X(3).
016320         07  PASS-NO-LEFT-OFF-AT PIC 9(3).
016330     05  TALLY-PASS-AREA REDEFINES PASS-REDEFINES-AREA.
016340         07  PASS-TALLY-ITEM     PIC X(4).
016350         07  FILLER              PIC X(2).
016410*---------- 'R'=RECEIVER, 'F'=FREIGHT, 'T'=TALLY
016500     05  PASS-INQUIRY          PIC X.
016600     05  PASS-SAVE-LASTKEY     PIC S9(4) COMP-4.
           05  PASS-HISTORY-FLAG     PIC X.
           05  PASS-ITEM             PIC 9(4).
016700
016800 COPY LANGSUB OF COPYLIB.
016900
017000**************************************************************
017100**************************************************************
017200*                  PROCEDURE DIVISION                        *
017300*     IF THIS INQUIRY WAS SELECTED BEFORE THE FREIGHT        *
017400*     INQUIRY, THE STARTING RECEIVER NUMBER IS PASSED        *
017500*     OF WHERE TO BEGIN DISPLAYING.  IF THIS INQUIRY         *
017600*     IS CALLED FROM THE FREIGHT INQUIRY, THEN THE           *
017700*     RECEIVER NUMBER TO BEGIN WITH IS PASSED FROM           *
017800*     FREIGHT ROUTINE.  DISPLAY EACH ITEM OF A RECEIVER      *
017900*     UP TO 10 LINES AT A TIME.  FUNCTION KEYS ALLOW         *
018000*     FORWARD AND BACKWARD BROWSING OF ITEMS OR RECEIVERS.   *
018100*     THE FREIGHT INQUIRY CAN ALSO BE CALLED BY A            *
018200*     FUNCTION KEY.                                          *
018300**************************************************************
018400**************************************************************
018500 PROCEDURE DIVISION USING  BASE,
018600                           VIEW-COMAREA,
018700                           SUBROUTINE-PARMS,
018800                           LANGUAGE-PARMS.
018900
019000 00-MAIN.
019100     PERFORM 10-HOUSEKEEPING THRU 19-EXIT.
019200
019300     PERFORM 100-DISPLAY-RECEIVER-ITEMS THRU 199-EXIT.

           CLOSE DISPLAY-FILE MPORCV, DRCVITEM, DPOITEM.
019400
019500     GOBACK.
019600*************************************************************
019700*     OPEN DATABASE FOR THE SECOND TIME AND SET UP VALUES.  *
019800*************************************************************
019900 10-HOUSEKEEPING.
           IF PASS-HISTORY-FLAG NOT = "Y"
               OPEN INPUT MPORCV, DRCVITEM, DPOITEM
           ELSE
               OPEN INPUT DRCVITEM-ST, DPOITEM-ST
           END-IF.
           OPEN I-O DISPLAY-FILE.
020000     MOVE PASS-PO           TO WS-ACCUMULATOR, WS-RECEIVER.
020100     MOVE "000"                 TO WS-ACCUM-RS.
           MOVE "   SUB-DETL "        TO WS-SUBDETL-LIT.
           MOVE "   ADDL-DATA "       TO WS-ADDL-DATA-LIT.
           MOVE "INQRSI_3"            TO ITEMDATA.
020200
020300*----------  THIS CAN BE CALLED DIRECTLY FROM THE MAIN REQUEST
020400*            SCREEN OR FROM THE FREIGHT INQUIRY.  IF FROM THE
020500*            FREIGHT, PICK UP WHERE FREIGHT LEFT OFF.
020600     IF PASS-INQUIRY = "T"
020900        MOVE PASS-START-RECEIVER TO WS-RS
020800     ELSE
020700        MOVE PASS-NO-LEFT-OFF-AT TO WS-RS-9.
021000
           IF PASS-HISTORY-FLAG NOT = "Y"
021100         MOVE WS-ACCUMULATOR        TO PO-ARG
021200         MOVE WS-RECEIVER           TO RS-ARG
           ELSE
               MOVE WS-ACCUMULATOR-2-14   TO PO-ARG
               MOVE WS-RECEIVER-2-14      TO RS-ARG
           END-IF.

           MOVE "MCFPCS7000"   TO  CHKOBJ-FILE-NAME.
           CALL "CCHKOBJ" USING    CHKOBJ-FILE-NAME,
                                   CHKOBJ-RETURN-STATUS.
           IF CHKOBJ-RETURN-STATUS  = "00"
               MOVE "Y"        TO  PRINT-DCOMPL-SW
           ELSE
               MOVE "N"        TO  PRINT-DCOMPL-SW.

021300 19-EXIT.  EXIT.
021400
021500*************************************************************
021600*         RETRIEVE DATA AND DISPLAY THE ITEM SCREEN.        *
021700*************************************************************
021800 100-DISPLAY-RECEIVER-ITEMS.
021900*****MOVE ITEMDATA TO  VIEW-NFNAME.
022500     MOVE SPACES TO SCREEN-BUFFER-INQRSI.
022800
           IF PASS-HISTORY-FLAG NOT = "Y"
               MOVE 0 TO COND-WORD
               MOVE PO-ARG TO PORCVNO OF MPORCV-REC
               READ MPORCV INTO BUF-MPORCV
                   INVALID KEY MOVE 17 TO COND-WORD
               END-READ
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   IF FILE-STATUS NOT = "00"
                       MOVE 99 TO COND-WORD
                   END-IF
               END-IF
023200         IF COND-WORD NOT = 0
023300            MOVE "DBGET MPORCV AT 100 SINQRSI" TO BU-DISPLAY-MSG
023400            PERFORM 990-BLOWUP THRU 999-EXIT
               END-IF
           END-IF.
023500
023600     MOVE 2 TO VIEW-LASTKEY.
023700     MOVE PASS-LAST-RECEIVER TO VIEW-LAST-RCVR.
023800
023900 110-NEW-RECEIVER.
           IF PASS-HISTORY-FLAG = "Y"
               GO TO 112-CHAINHD-DRCVITEM.

023901*----------  GET SEQUENCE NUMBER
      *    IF WS-RS-9 > 998 OR WS-RS-9 < 1
           IF WS-RS-9 < 1
               GO TO 199-EXIT.
           MOVE 0 TO COND-WORD.
           MOVE RS-ARG TO PORCVNO OF MPORCV-REC.
           READ MPORCV INTO BUF-MPORCV
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF COND-WORD = 17
               IF VIEW-LASTKEY = 2 OR 8
                   ADD 1 TO WS-RS-9
               ELSE
                   SUBTRACT 1 FROM WS-RS-9
               END-IF
               MOVE WS-RS-9 TO VIEW-RS
               MOVE WS-RECEIVER TO RS-ARG
               GO TO 110-NEW-RECEIVER
           ELSE
           IF COND-WORD = 0
               MOVE M-PO-RCV-SEQ TO VIEW-SEQ
           ELSE
               MOVE "READ ERR MPORCV" TO BU-DISPLAY-MSG
               PERFORM 990-BLOWUP THRU 999-EXIT.
023980
       112-CHAINHD-DRCVITEM.
      *    IF WS-RS-9 > 998 OR WS-RS-9 < 1
           IF WS-RS-9 < 1
               GO TO 199-EXIT.
           MOVE 0 TO COND-WORD.
           IF PASS-HISTORY-FLAG NOT = "Y"
               MOVE RS-ARG TO PORCVNO OF DRCVITEM-REC
               START DRCVITEM KEY = PORCVNO OF DRCVITEM-REC
                   INVALID KEY MOVE 17 TO COND-WORD
               END-START
           ELSE
               MOVE RS-ARG TO PORCVNO OF DRCVITEM-ST-REC
               START DRCVITEM-ST KEY = PORCVNO OF DRCVITEM-ST-REC
                   INVALID KEY MOVE 17 TO COND-WORD
               END-START
           END-IF.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
024110     IF NO-ENTRY
               IF VIEW-LASTKEY = 2 OR 8
                   ADD 1 TO WS-RS-9
               ELSE
                   SUBTRACT 1 FROM WS-RS-9
               END-IF
               MOVE WS-RS-9 TO VIEW-RS
               IF PASS-HISTORY-FLAG NOT = "Y"
                   MOVE WS-RECEIVER TO RS-ARG
               ELSE
                   MOVE WS-RECEIVER-2-14 TO RS-ARG
               END-IF
               GO TO 112-CHAINHD-DRCVITEM.
024130
024200     IF NOT GOOD-CALL
              IF PASS-HISTORY-FLAG NOT = "Y"
024300          MOVE "START DRCVITEM 100 SINQRSI" TO BU-DISPLAY-MSG
              ELSE
                MOVE "START DRCVITEM-ST 100 SINQRSI" TO BU-DISPLAY-MSG
              END-IF
024400        PERFORM 990-BLOWUP THRU 999-EXIT.
024500     MOVE ZEROES              TO VIEW-ITEMS.
024700     MOVE 0                     TO MORE-RECORDS.
024800
024900     MOVE WS-PO                 TO VIEW-PO.
025000     MOVE WS-RLSE               TO VIEW-RLSE.
025100     MOVE WS-RS                 TO VIEW-RS.
025110     IF PASS-INQUIRY = "T"
025120        PERFORM 850-MATCH-ITEM THRU 859-EXIT
025130     ELSE
              PERFORM 860-START-ITEM THRU 860-EXIT.
025200*       PERFORM 810-READ-RCVR-FORWARD THRU 819-EXIT.
025300
025400 115-FILL-ITEM-SCREEN.
025500     PERFORM 800-FIND-ACCUM        THRU 809-EXIT.

           MOVE SCREEN-BUFFER-INQRSI TO SCREEN-BUFFER.
      *---- SHOW SFLCTL (71) AND CLEAR SFL (72), BUT DON'T SHOW IT (70).

           MOVE ON-SWITCH    TO IND (71)  IND (72).
           MOVE OFF-SWITCH   TO IND (70).

           WRITE SUBFILE DISPLAY-REC FROM SCREEN-BUFFER
               FORMAT IS "RSSFLC"
               INDICATORS ARE SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "PROBLEM ON INIT SFL WRITE" TO BU-DISPLAY-MSG
               PERFORM 990-BLOWUP THRU 999-EXIT.
      *-------- TURN CLEAR SFL OFF.
           MOVE OFF-SWITCH TO IND (72).

025600     PERFORM 830-GET-DESC          THRU 839-EXIT.
           IF PASS-HISTORY-FLAG NOT = "Y"
               MOVE LIVE-LIT TO VIEW-LIVE-HISTORY
           ELSE
               MOVE HISTORY-LIT TO VIEW-LIVE-HISTORY
           END-IF.
025700
025800*----------  DISPLAY SCREEN WITH ITEM INFORMATION
026500*140-SHOW-FORM.
      *****MOVE SCREEN-BUFFER-INQRSI TO SCREEN-BUFFER.
      *****MOVE SCREEN-BUFFER TO DISPLAY-REC.
      *****WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
      ********INDIC ARE SRF-INDICATORS.

           MOVE ON-SWITCH TO IND (70)  IND (71)  IND (73).

      *--- WRITE THE SUBFILE TO SCREEN.
           WRITE SUBFILE DISPLAY-REC FROM SCREEN-BUFFER
               FORMAT IS "RSSFLC"
               INDICATORS ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "PROBLEM ON SHOW SFL WRITE" TO BU-DISPLAY-MSG
               MOVE REC-COUNT TO BU-DISPLAY-FLD (1)
               MOVE DISPLAY-STATUS TO BU-DISPLAY-FLD (2)
               PERFORM 990-BLOWUP THRU 999-EXIT.

       140-SHOW-FORM.

      *--- SHOW FUNCTION KEYS.
           MOVE SCREEN-BUFFER-INQRSI-B TO SCREEN-BUFFER.
           WRITE DISPLAY-REC FROM SCREEN-BUFFER
               FORMAT IS "RSREC"
               INDICATORS ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

      *****READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
           READ  DISPLAY-FILE FORMAT IS "RSSFLC"
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO SRF-INDICATORS.
           MOVE DISPLAY-REC TO SCREEN-BUFFER.

      *------ A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *------ IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.
027300
           MOVE DISPLAY-REC   TO SCREEN-BUFFER-INQRSI.
027600
027700     IF VIEW-LASTKEY EQUAL  7 OR 3
027800        MOVE 7            TO PASS-SAVE-LASTKEY
027900        GO TO 199-EXIT.
027910
027920*----------  IF TALLY RCVR INQUIRY, ONLY SHOW ONE ITEM
027930     IF PASS-INQUIRY = "T"
027940        GO TO 199-EXIT.
028000
028100     IF VIEW-LASTKEY = 1
              MOVE 2 TO PASS-SAVE-LASTKEY
              IF WS-RS-9 NOT = PASS-NO-LEFT-OFF-AT
                MOVE 1 TO PASS-ITEM
              ELSE
                IF PASS-HISTORY-FLAG NOT = "Y"
                  MOVE RCV-ITEM-NUMBER TO PASS-ITEM
                ELSE
                  MOVE RCVH-ITEM-NUMBER TO PASS-ITEM
                END-IF
              END-IF
              MOVE WS-RS-9 TO PASS-NO-LEFT-OFF-AT
              GO TO 199-EXIT.

028100     IF VIEW-LASTKEY = 5
              MOVE 4 TO PASS-SAVE-LASTKEY
              IF WS-RS-9 NOT = PASS-NO-LEFT-OFF-AT
                MOVE 1 TO PASS-ITEM
              ELSE
                IF PASS-HISTORY-FLAG NOT = "Y"
                    MOVE RCV-ITEM-NUMBER TO PASS-ITEM
                ELSE
                    MOVE RCVH-ITEM-NUMBER TO PASS-ITEM
                END-IF
              END-IF
              MOVE WS-RS-9 TO PASS-NO-LEFT-OFF-AT
              GO TO 199-EXIT.

029510 142-NEXT-RCVR.
029600*----------  NEXT RECEIVER
029700     IF VIEW-LASTKEY = 2
029800        IF WS-RS = PASS-LAST-RECEIVER OR PASS-INQUIRY = "T"
029900           MOVE  14 TO LANG-SETNUM
030000           MOVE 102 TO LANG-MSGNUM
030100           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
030200           PERFORM 940-VSETERROR THRU 949-EXIT
030300           GO TO 140-SHOW-FORM
030400        ELSE
030500           ADD 1 TO WS-RS-9
030600           MOVE WS-RS-9 TO VIEW-RS
                 IF PASS-HISTORY-FLAG NOT = "Y"
030700               MOVE WS-RECEIVER TO RS-ARG
                 ELSE
                     MOVE WS-RECEIVER-2-14 TO RS-ARG
                 END-IF
                 MOVE 1 TO PASS-ITEM
030800           MOVE 1 TO LINE-SUB
030900           GO TO 110-NEW-RECEIVER.
031000
031100*----------  PREVIOUS RECEIVER
031200     IF VIEW-LASTKEY = 6
031300        IF WS-RS = "001" OR PASS-INQUIRY = "T"
031400           MOVE  14 TO LANG-SETNUM
031500           MOVE 103 TO LANG-MSGNUM
031600           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
031700           PERFORM 940-VSETERROR THRU 949-EXIT
031800           GO TO 140-SHOW-FORM
031900        ELSE
032000           SUBTRACT 1 FROM WS-RS-9
032100           MOVE WS-RS-9 TO VIEW-RS
                 IF PASS-HISTORY-FLAG NOT = "Y"
032200               MOVE WS-RECEIVER TO RS-ARG
                 ELSE
                     MOVE WS-RECEIVER-2-14 TO RS-ARG
                 END-IF
                 MOVE 1 TO PASS-ITEM
032300           MOVE 1 TO LINE-SUB
032400           GO TO 110-NEW-RECEIVER.
032500
032600*----------  MORE ITEMS
032700     IF VIEW-LASTKEY = 8
032800        IF NO-MORE OR PASS-INQUIRY = "T"
032900           MOVE  14 TO LANG-SETNUM
033000           MOVE 104 TO LANG-MSGNUM
033100           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
033200           PERFORM 940-VSETERROR THRU 949-EXIT
033300           GO TO 140-SHOW-FORM
033400        ELSE
033500          PERFORM 810-READ-RCVR-FORWARD THRU 819-EXIT
                IF NO-MORE OR (NOT GOOD-CALL)
                   MOVE 14 TO LANG-SETNUM
                   MOVE 104 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   PERFORM 940-VSETERROR THRU 949-EXIT
                   GO TO 140-SHOW-FORM
                ELSE
033600             GO TO 115-FILL-ITEM-SCREEN.
033700
033800*----------  PREVIOUS ITEMS
033900
034000     IF VIEW-LASTKEY = 4
               IF NO-PREV OR PASS-INQUIRY = "T"
034200          MOVE  14 TO LANG-SETNUM
034300          MOVE 105 TO LANG-MSGNUM
034400          PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
034500          PERFORM  940-VSETERROR THRU 949-EXIT
034600          GO TO  140-SHOW-FORM
034800         ELSE
034900          PERFORM 820-READ-RCVR-BACKWARD THRU 829-EXIT
                IF NO-PREV OR NOT GOOD-CALL
                 MOVE  14 TO LANG-SETNUM
                 MOVE 105 TO LANG-MSGNUM
                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                 PERFORM 940-VSETERROR THRU 949-EXIT
                 GO TO 140-SHOW-FORM
                ELSE
035000           GO TO 115-FILL-ITEM-SCREEN.
035100
035200******************************************************************
035300*  IF 'ENTER' KEY WAS PRESSED PRINT ERROR MESSAGE STATING THAT   *
035400*  YOU MUST PRESS DESIRED FUNCTION KEY                           *
035500******************************************************************
035600     MOVE   9 TO LANG-SETNUM.
035700     MOVE  92 TO LANG-MSGNUM.
035800     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
035900     PERFORM  940-VSETERROR THRU 949-EXIT.
036000     GO TO  140-SHOW-FORM.
036100 199-EXIT.  EXIT.
036200
036300*>>>>>>>>>>  GET ACCOUNTING DATA FROM ACCUMULATOR ENTRY
036400 800-FIND-ACCUM.
           MOVE 0 TO COND-WORD.
           IF PASS-HISTORY-FLAG NOT = "Y"
               MOVE PO-ARG TO PORCVNO OF DPOITEM-REC
               START DPOITEM KEY NOT < PORCVNO OF DPOITEM-REC
                   INVALID KEY MOVE 17 TO COND-WORD
               END-START
           ELSE
               MOVE PO-ARG TO PORCVNO OF DPOITEM-ST-REC
               START DPOITEM-ST KEY NOT < PORCVNO OF DPOITEM-ST-REC
                   INVALID KEY MOVE 17 TO COND-WORD
               END-START
           END-IF.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
036700
036800     IF NO-ENTRY
036900        GO TO 808-DID-NOT-FIND-ITEM.
037000
037100     IF NOT GOOD-CALL
              IF PASS-HISTORY-FLAG NOT = "Y"
037200          MOVE "START DPOITEM 800 SINQRSI" TO BU-DISPLAY-MSG
              ELSE
                MOVE "START DPOITEM-ST 800 SINQRSI" TO BU-DISPLAY-MSG
              END-IF
037300        PERFORM 990-BLOWUP THRU 999-EXIT.
037400 805-GET-MATCHING-ITEM.
           MOVE 0 TO COND-WORD.
           IF PASS-HISTORY-FLAG NOT = "Y"
               READ DPOITEM NEXT INTO BUF-DPOITEM
                   AT END MOVE 15 TO COND-WORD
               END-READ
           ELSE
               READ DPOITEM-ST NEXT INTO BUF-DPOITEM-H
                   AT END MOVE 15 TO COND-WORD
               END-READ
           END-IF.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PASS-HISTORY-FLAG NOT = "Y"
               IF PORCVNO OF DPOITEM-REC NOT = PO-ARG
                   MOVE 15 TO COND-WORD
               END-IF
           ELSE
               IF PORCVNO OF DPOITEM-ST-REC NOT = PO-ARG
                   MOVE 15 TO COND-WORD
               END-IF
           END-IF.
037700     IF END-OF-CHAIN
037800        GO TO 808-DID-NOT-FIND-ITEM
037900     ELSE
038000        IF NOT GOOD-CALL
                 IF PASS-HISTORY-FLAG NOT = "Y"
038100             MOVE "READ DPOITEM 805 SINQRSI" TO BU-DISPLAY-MSG
                 ELSE
                   MOVE "READ DPOITEM-ST 805 SINQRSI" TO BU-DISPLAY-MSG
                 END-IF
038200           PERFORM 990-BLOWUP THRU 999-EXIT.
           IF PASS-HISTORY-FLAG NOT = "Y"
038300         IF ITM-NUMBER = RCV-ITEM-NUMBER
038400            MOVE SPACES             TO WS-SUB-LIT
038500            MOVE ITM-SUB-DETL       TO WS-SUB-DETL
038600            MOVE ITM-ADDL-DATA      TO WS-ADDL-DATA
038700            MOVE ITM-UM             TO VIEW-UM
                  GO TO 809-EXIT
               END-IF
           ELSE
               IF ITMH-NUMBER = RCVH-ITEM-NUMBER
038400            MOVE SPACES             TO WS-SUB-LIT
038500            MOVE ITMH-SUB-DETL      TO WS-SUB-DETL
038600            MOVE ITMH-ADDL-DATA     TO WS-ADDL-DATA
038700            MOVE ITMH-QTY-UM        TO VIEW-UM
038800            GO TO 809-EXIT
               END-IF
           END-IF.
038900     GO TO 805-GET-MATCHING-ITEM.
039000 808-DID-NOT-FIND-ITEM.
039100***  NO ACCOUNTING DATA AVAILABLE - PO ITEM HAS BEEN DELETED|"
039200     MOVE 14                    TO LANG-SETNUM.
039300     MOVE 58                    TO LANG-MSGNUM.
039400     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
039500     MOVE MESSAGE-BUFFER        TO WS-SUB-SUBDETL-DATALINE.
039600 809-EXIT.  EXIT.
039700
039800 810-READ-RCVR-FORWARD.
           MOVE 0 TO COND-WORD.
           MOVE "00" TO FILE-STATUS.
           IF PASS-HISTORY-FLAG NOT = "Y"
               READ DRCVITEM NEXT INTO BUF-DRCVITEM
                   AT END MOVE 15 TO COND-WORD
               END-READ
           ELSE
               READ DRCVITEM-ST NEXT INTO BUF-DRCVITEM-H
                   AT END MOVE 15 TO COND-WORD
               END-READ
           END-IF.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
           ELSE
               IF PASS-HISTORY-FLAG NOT = "Y"
                   IF PORCVNO OF DRCVITEM-REC NOT = RS-ARG
                       READ DRCVITEM PRIOR INTO BUF-DRCVITEM
                           AT END MOVE 15 TO COND-WORD
                       END-READ
                       MOVE 15 TO COND-WORD
                   END-IF
               ELSE
                   IF PORCVNO OF DRCVITEM-ST-REC NOT = RS-ARG
                       READ DRCVITEM-ST PRIOR INTO BUF-DRCVITEM-H
                           AT END MOVE 15 TO COND-WORD
                       END-READ
                       MOVE 15 TO COND-WORD
                   END-IF
               END-IF
           END-IF.
           IF GOOD-CALL
               MOVE 0 TO PREV-RECORDS
           ELSE
               MOVE 1 TO MORE-RECORDS
           END-IF
           IF GOOD-CALL
               IF PASS-HISTORY-FLAG NOT = "Y"
041000             PERFORM 840-MOVE-RCVR THRU 849-EXIT
               ELSE
                   PERFORM 840-MOVE-RCVR-H THRU 849-H-EXIT
               END-IF
           END-IF.
041100 819-EXIT.  EXIT.
041200
041300 820-READ-RCVR-BACKWARD.
           MOVE 0 TO COND-WORD.
           MOVE "00" TO FILE-STATUS.
           IF PASS-HISTORY-FLAG NOT = "Y"
               READ DRCVITEM PRIOR RECORD INTO BUF-DRCVITEM
                   AT END MOVE 14 TO COND-WORD
               END-READ
           ELSE
               READ DRCVITEM-ST PRIOR RECORD INTO BUF-DRCVITEM-H
                   AT END MOVE 14 TO COND-WORD
               END-READ
           END-IF.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "1"
                   MOVE 14 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
           ELSE
               IF PASS-HISTORY-FLAG NOT = "Y"
                   IF PORCVNO OF DRCVITEM-REC NOT = RS-ARG
                       READ DRCVITEM NEXT INTO BUF-DRCVITEM
                           AT END MOVE 14 TO COND-WORD
                       END-READ
                       MOVE 14 TO COND-WORD
                   END-IF
               ELSE
                   IF PORCVNO OF DRCVITEM-ST-REC NOT = RS-ARG
                       READ DRCVITEM-ST NEXT INTO BUF-DRCVITEM-H
                           AT END MOVE 14 TO COND-WORD
                       END-READ
                       MOVE 14 TO COND-WORD
                   END-IF
               END-IF
           END-IF.
           IF GOOD-CALL
041800         MOVE 0 TO MORE-RECORDS
           ELSE
               MOVE 1 TO PREV-RECORDS.
041900*    IF NOT GOOD-CALL
042000*       MOVE "DBGET DRCVITEM 820 SINQRSI" TO BU-DISPLAY-MSG
042100*       PERFORM 990-BLOWUP THRU 999-EXIT.
           IF GOOD-CALL
               IF PASS-HISTORY-FLAG NOT = "Y"
042200             PERFORM 840-MOVE-RCVR THRU 849-EXIT
               ELSE
                   PERFORM 840-MOVE-RCVR-H THRU 849-H-EXIT
               END-IF
           END-IF.
042300 829-EXIT.  EXIT.

042400 830-GET-DESC.
042500*****MOVE SPACES                      TO VIEW-DESC-AREA.
           INITIALIZE REC-COUNT.
042600     MOVE 1                           TO X.
           IF PASS-HISTORY-FLAG NOT = "Y"
042700       IF ITM-UM = "LT" OR "AS"
042800*********MOVE 12                       TO CNDESC-LINES-TO-GET
042900         MOVE 0                        TO CNDESC-LINES-GOT
043000         MOVE SPACES                   TO CNDESC-LINE
043100         CALL "CNDESC" USING BASE, RS-ARG, RCV-ITEM-NUMBER,
043200                             CNDESC-DATA
043300         PERFORM 834-MOVE-NONCODED-DESC CNDESC-LINES-GOT TIMES
043400       ELSE
043500       IF RCV-CORP-CODE = "NON-STR"
043600*********MOVE 12                       TO CNDESC-LINES-TO-GET
043700         MOVE 0                        TO CNDESC-LINES-GOT
043800         MOVE SPACES                   TO CNDESC-LINE
043900         CALL "CNDESC" USING BASE, PO-ARG, RCV-ITEM-NUMBER,
044000                               CNDESC-DATA
044100         PERFORM 834-MOVE-NONCODED-DESC CNDESC-LINES-GOT TIMES
044200       ELSE
044300         MOVE SPACES                   TO CDESC-DATA
044400*********MOVE 12                       TO CDESC-LINES-TO-GET
044500         MOVE "P"                      TO CDESC-LANGUAGE-OPTION
044600         MOVE "F"                      TO CDESC-DESC-OPTION
044700         MOVE "S"                      TO CDESC-MANUFACT-OPTION
044800         MOVE "R"                      TO CDESC-LOCAL-DESC-OPTION
044900         CALL "CDESC" USING CDESC-RET-CODE, BASE, STATUS-AREA,
045000                     BU-DISPLAY-MSG, RCV-CORP-CODE, CDESC-DATA
               IF CDESC-RET-CODE = "00"
045100          PERFORM 832-MOVE-CODED-DESC CDESC-LINES-GOT TIMES
               END-IF
      *--------------- GET PO DESCRIPTION.
               MOVE 1                        TO X
               MOVE 0                        TO CNDESC-LINES-GOT
               MOVE SPACES                   TO CNDESC-LINE
               CALL "CNDESC" USING BASE, PO-ARG, RCV-ITEM-NUMBER,
                                     CNDESC-DATA
               PERFORM 834-MOVE-NONCODED-DESC CNDESC-LINES-GOT TIMES
             END-IF
             PERFORM 836-WRITE-DCOMPL
             END-IF
           ELSE
042700       IF ITMH-QTY-UM = "LT" OR "AS"
042800*********MOVE 12                       TO CNDESC-LINES-TO-GET
042900         MOVE 0                        TO CNDESC-LINES-GOT
043000         MOVE SPACES                   TO CNDESC-LINE
043100         CALL "CNDESCST" USING BASE, RS-ARG, RCVH-ITEM-NUMBER,
043200                             CNDESC-DATA
043300         PERFORM 834-MOVE-NONCODED-DESC CNDESC-LINES-GOT TIMES
043400       ELSE
043500       IF RCVH-CORP-CODE = SPACES
043600*********MOVE 12                       TO CNDESC-LINES-TO-GET
043700         MOVE 0                        TO CNDESC-LINES-GOT
043800         MOVE SPACES                   TO CNDESC-LINE
043900         CALL "CNDESCST" USING BASE, PO-ARG, RCVH-ITEM-NUMBER,
044000                               CNDESC-DATA
044100         PERFORM 834-MOVE-NONCODED-DESC CNDESC-LINES-GOT TIMES
044200       ELSE
044300         MOVE SPACES                   TO CDESC-DATA
044400*********MOVE 12                       TO CDESC-LINES-TO-GET
044500         MOVE "P"                      TO CDESC-LANGUAGE-OPTION
044600         MOVE "F"                      TO CDESC-DESC-OPTION
044700         MOVE "S"                      TO CDESC-MANUFACT-OPTION
044800         MOVE "R"                      TO CDESC-LOCAL-DESC-OPTION
044900         CALL "CDESC" USING CDESC-RET-CODE, BASE, STATUS-AREA,
045000                     BU-DISPLAY-MSG, RCVH-CORP-CODE, CDESC-DATA
               IF CDESC-RET-CODE = "00"
045100          PERFORM 832-MOVE-CODED-DESC CDESC-LINES-GOT TIMES
               END-IF
             END-IF
             END-IF
           END-IF.
045200*****MOVE WS-SUB-SUBDETL-DATALINE TO VIEW-DESC (X).
           MOVE WS-SUB-SUBDETL-DATALINE TO SC-LINE-BUF.
           PERFORM 835-WRITE-SUBFILE.
045300
045400     GO TO 839-EXIT.
045500 832-MOVE-CODED-DESC.
045600*****MOVE CDESC (X)                TO VIEW-DESC (X).
      **** ONLY ALLOW MAXIMUM OF 25 LINES OF DESCRIPTION SINCE
      **** TABLE IS SIZED TO OCCUR 25 TIMES.
           IF (X < 25 OR X = 25)
               MOVE CDESC (X)                TO SC-LINE-BUF
               PERFORM 835-WRITE-SUBFILE
           END-IF.
045700     ADD 1 TO X.
045800 834-MOVE-NONCODED-DESC.
045900*****MOVE CNDESC (X)               TO VIEW-DESC (X).
      **** ONLY ALLOW MAXIMUM OF 25 LINES OF DESCRIPTION SINCE
      **** TABLE IS SIZED TO OCCUR 25 TIMES.
           IF (X < 25 OR X = 25)
               MOVE CNDESC (X)               TO SC-LINE-BUF
               PERFORM 835-WRITE-SUBFILE
           END-IF.
046000     ADD 1 TO X.
046100
       835-WRITE-SUBFILE.
           MOVE SC-LINE-BUF           TO DISPLAY-REC.
           ADD 1                      TO REC-COUNT.
           IF REC-COUNT > 9999
               MOVE "SUBFILE TOO SMALL-INCREASE ZINQRS"
                   TO BU-DISPLAY-MSG
               MOVE REC-COUNT TO BU-DISPLAY-FLD (1)
               PERFORM 990-BLOWUP THRU 999-EXIT.
           WRITE SUBFILE DISPLAY-REC
               FORMAT IS "RSSFL"
               INDICATORS ARE SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "SUBFILE WRITE ERROR" TO BU-DISPLAY-MSG
               MOVE REC-COUNT        TO BU-DISPLAY-FLD (1)
               MOVE DISPLAY-STATUS   TO BU-DISPLAY-FLD (2)
               PERFORM 990-BLOWUP THRU 999-EXIT.

       836-WRITE-DCOMPL.
           IF PRINT-DCOMPL-SW = "Y"
               MOVE RCV-CORP-CODE  TO  CCRQDESC-CODE
               MOVE SPACES         TO  CCRQDESC-LINES
               CALL "CCRQDESC" USING CCRQDESC-PARMS
               IF CCRQDESC-LINES > SPACES
                   PERFORM VARYING SUB FROM 1 BY 1
                           UNTIL CCRQDESC-LINE (SUB) = SPACES OR
                                                 SUB > 6
                       MOVE CCRQDESC-LINE (SUB)  TO  SC-LINE-BUF
                       PERFORM 835-WRITE-SUBFILE
                   END-PERFORM.

046200 839-EXIT.  EXIT.
046300 840-MOVE-RCVR.
046400     MOVE RCV-CORP-CODE         TO VIEW-CODE.
046500     MOVE RCV-ITEM-NUMBER     TO VIEW-ITEM.
046600     MOVE RCV-QTY-DLVR          TO VIEW-QTY-DLVR.
046700     MOVE RCV-QTY-STORED        TO VIEW-QTY-STOR.
046800     MOVE 4                   TO DATE-MODE.
046900     MOVE RCV-DATE-RCVD       TO DATE-VALIDATE-IN.
047000     CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
047100     MOVE DATE-SLASH-OUT      TO VIEW-DLVR-DATE.
047200
047300     MOVE RCV-DATE-STORED     TO DATE-VALIDATE-IN.
047400     CALL "TDATECHK" USING DATE-CHECK-AREA.
047500     MOVE DATE-SLASH-OUT      TO VIEW-STOR-DATE.
047600
047610     MOVE RCV-LOT             TO VIEW-LOT.
047620     MOVE RCV-TALLY           TO VIEW-TALLY.
           MOVE RCV-CHATNO          TO VIEW-CHATNO.
047700     MOVE RCV-COMPLETE-FLAG   TO VIEW-COMPLETE.
           MOVE RCV-PO-RCVR         TO WS-RS, VIEW-RS.
047800 849-EXIT.  EXIT.

046300 840-MOVE-RCVR-H.
046400     MOVE RCVH-CORP-CODE      TO VIEW-CODE.
046500     MOVE RCVH-ITEM-NUMBER    TO VIEW-ITEM.
046600     MOVE RCVH-ITM-QTY-DLVR   TO VIEW-QTY-DLVR.
046700     MOVE RCVH-QTY-STORED     TO VIEW-QTY-STOR.
046800     MOVE 4                   TO DATE-MODE.
           MOVE RCVH-DATE-RCVD      TO DATE-VALIDATE-IN.
047000     CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
047100     MOVE DATE-SLASH-OUT      TO VIEW-DLVR-DATE.
047200
           MOVE RCVH-DATE-STORED    TO DATE-VALIDATE-IN.
047400     CALL "TDATECHK" USING DATE-CHECK-AREA.
047500     MOVE DATE-SLASH-OUT      TO VIEW-STOR-DATE.
047600
047610     MOVE RCVH-LOT            TO VIEW-LOT.
047620     MOVE RCVH-TALLY          TO VIEW-TALLY.
           MOVE RCVH-CHATNO         TO VIEW-CHATNO.
047700     MOVE RCVH-COMPLETE-FLAG  TO VIEW-COMPLETE.
           MOVE RCVH-PO-RCVR        TO WS-RS, VIEW-RS.
047800 849-H-EXIT.  EXIT.

047810 850-MATCH-ITEM.
           MOVE 0 TO COND-WORD.
           IF PASS-HISTORY-FLAG NOT = "Y"
               READ DRCVITEM NEXT INTO BUF-DRCVITEM
                   AT END MOVE 15 TO COND-WORD
               END-READ
           ELSE
               READ DRCVITEM-ST NEXT INTO BUF-DRCVITEM-H
                   AT END MOVE 15 TO COND-WORD
               END-READ
           END-IF.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PASS-HISTORY-FLAG NOT = "Y"
               IF PORCVNO OF DRCVITEM-REC NOT = RS-ARG
                   MOVE 15 TO COND-WORD
               END-IF
           ELSE
               IF PORCVNO OF DRCVITEM-ST-REC NOT = RS-ARG
                   MOVE 15 TO COND-WORD
               END-IF
           END-IF.
047840     IF NOT GOOD-CALL
047850        GO TO 859-EXIT.
           IF PASS-HISTORY-FLAG NOT = "Y"
047860         IF RCV-ITEM-NUMBER NOT = PASS-TALLY-ITEM
047870            GO TO 850-MATCH-ITEM
               END-IF
               PERFORM 840-MOVE-RCVR THRU 849-EXIT
           ELSE
047860         IF RCVH-ITEM-NUMBER NOT = PASS-TALLY-ITEM
047870            GO TO 850-MATCH-ITEM
               END-IF
047871         PERFORM 840-MOVE-RCVR-H THRU 849-H-EXIT
           END-IF.
047880 859-EXIT.  EXIT.

       860-START-ITEM.
           MOVE 0 TO COND-WORD.
           IF PASS-HISTORY-FLAG NOT = "Y"
               READ DRCVITEM NEXT INTO BUF-DRCVITEM
                   AT END MOVE 15 TO COND-WORD
               END-READ
           ELSE
               READ DRCVITEM-ST NEXT INTO BUF-DRCVITEM-H
                   AT END MOVE 15 TO COND-WORD
               END-READ
           END-IF.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PASS-HISTORY-FLAG NOT = "Y"
               IF PORCVNO OF DRCVITEM-REC NOT = RS-ARG
                   MOVE 15 TO COND-WORD
               END-IF
           ELSE
               IF PORCVNO OF DRCVITEM-ST-REC NOT = RS-ARG
                   MOVE 15 TO COND-WORD
               END-IF
           END-IF.
           IF NOT GOOD-CALL
              GO TO 860-EXIT.
           IF PASS-HISTORY-FLAG NOT = "Y"
               IF RCV-ITEM-NUMBER < PASS-ITEM
                  GO TO 860-START-ITEM
               END-IF
               PERFORM 840-MOVE-RCVR THRU 849-EXIT
           ELSE
               IF RCVH-ITEM-NUMBER < PASS-ITEM
                  GO TO 860-START-ITEM
               END-IF
               PERFORM 840-MOVE-RCVR-H THRU 849-H-EXIT
           END-IF.
       860-EXIT.
           EXIT.

049400 940-VSETERROR.
           MOVE B"1" TO IND (FIELD-NUMBER)  IND (99).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE.
051300
050700 949-EXIT.  EXIT.
051700************************************************************
051800************************************************************
051900*                    B L O W U P                           *
052000*     CHECK FOR IMAGE, VIEW, OR SPOOL ERROR.  CLOSE        *
052100*     FILES, GET OUT OF BLOCK MODE, AND DISPLAY            *
052200*     APPROPRIATE ERROR MESSAGE ON SCREEN.                 *
052300*                                                          *
052400*     ALSO APPENDS THE ERROR MESSAGE TO A FILE CALLED      *
052500*     BLOWUP.PUB.  TO READ THIS FILE, RUN "XBLPRT.OBJECT". *
052600*                                                          *
052700*         |||  PROGRAM IS ABORTED IN TBLOWUP  |||          *
052800************************************************************
052900************************************************************
053000 990-BLOWUP.
053100     MOVE "SINQRSI"       TO BU-PGM-NAME.
053200     MOVE VIEW-NFNAME     TO BU-DISPLAY-FLD (1).
053300     MOVE RS-ARG          TO BU-DISPLAY-FLD (2).
053400     MOVE CODE-ARG        TO BU-DISPLAY-FLD (3)
           IF PASS-HISTORY-FLAG NOT = "Y"
053500         MOVE RCV-ITEM-NUMBER TO BU-DISPLAY-FLD (4)
           ELSE
               MOVE RCVH-ITEM-NUMBER TO BU-DISPLAY-FLD (4)
               MOVE "HISTORY"   TO BU-DISPLAY-FLD (5)
           END-IF.
053600     CALL "TBLOWUP" USING BASE BU-PGM-NAME
053700           STATUS-AREA VIEW-COMAREA
053800           FILE-STATUS BU-DISPLAY-MSG BU-DISPLAY-FLDS.
053900 999-EXIT.  EXIT.
054000
054100 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
055700 999-CATREAD-EXIT.
055800     EXIT.
