000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    SINQFRT.
000400 AUTHOR.        LM BUNN / BARBARA WINTER.
000500 DATE-WRITTEN.  MAY 27, 1983.
000600*INSTALLATION.  GOODYEAR TIRE AND RUBBER CO.

001200*************************************************************
000800*REMARKS.       SUB-PROGRAM OF THE RECEIVER INQUIRY PROGRAM.
000900*
001000*         THIS IS A SUB-ROUTINE WHICH SHOWS FREIGHT INFORMATION
001100*                FOR A PARTICULAR RECEIVING SLIP.
001200*************************************************************

001300*************************************************************
001400*                      T I N Q F R T                        *
001500*                                                           *
001600*         THIS IS A SUBROUTINE THAT SHOWS FREIGHT           *
001700*         INFORMATION FOR RECEIVING SLIPS.                  *
001800*                                                           *
001900*   THIS PROGRAM CAN BE CALLED DIRECTLY FROM THE MAIN       *
002000*   PROGRAM REQUESTING A PO NUMBER, OR FROM THE RECEIVER    *
002100*   ITEM INQUIRY SCREEN.                                    *
002200*      1.  IF CALLED FROM THE MAIN PROGRAM, THE STARTING    *
002300*          RECEIVING SLIP NUMBER IS PASSED AND THE USER     *
002400*          MAY BROWSE FREIGHT DATA FORWARD AND BACKWARD.    *
002500*          THEY MAY CHOOSE TO GO TO THE RECEIVER SCREEN     *
002600*          AND THAT INQUIRY WILL BEGIN ON THE RECEIVER      *
002700*          WHERE THE FREIGHT INQUIRY LEFT OFF.  EVEN        *
002800*          THOUGH THEY MAY THEN BROWSE RECEIVING ITEMS,     *
002900*          THE FREIGHT INQUIRY WILL PICK UP FROM WHERE      *
003000*          IT PREVIOUSLY HAD LEFT OFF.                      *
003100*                                                           *
003200*      2.  IF CALLED FROM THE RECEIVER ITEM INQUIRY, THIS   *
003300*          PROGRAM BEGINS DISPLAY FREIGHT DATA FROM WHERE   *
003400*          WHERE THE RECEIVER INQUIRY LEFT OFF.             *
003500*************************************************************
003600*************************************************************
003700*     CALLING PROGRAMS:                                     *
003800*      1.  SINQRSA  -  ALL RECEIVERS SCREEN                 *
003900*      2.  SINQFRT  -  FREIGHT INQUIRY                      *
004000*                                                           *
004100*     CALLED PROGRAMS:                                      *
004200*      1.  SINQRSI  -  RECEIVER ITEM INQUIRY                *
004300*      2.  TSCRPRNT -  PRINTS SCREEN CONTENTS               *
004400*      3.  TBLOWUP  -  ABORTS PROGRAM CLEANLY               *
004500*************************************************************
004600*************************************************************
004700*************************************************************
004800*                   PROGRAM CHANGES                         *
      *C08/16/93 - JSB                                            *
      *C    FOR A FREIGHT REFERBACK ON AN INVOICELESS PO, DISPLAY *
      *C    THE PACKING SLIP NUMBER THAT WAS ENTERED FOR THE      *
      *C    RECEIVING SLIP AND NOT THE REFERBACKED PACKING SLIP.  *
      *C
      *C 11/22/93  JEFF BUNGO  REQUEST #4502
      *C    MODIFIED PROGRAM TO GO TO HISTORY DATABASE FOR THE
      *C    INQUIRY IF PASS-HISTORY-FLAG IS SET TO "Y".
      *C
      *C 02/21/94  JEFF BUNGO  REQUEST #6449
      *C    ADDED FIELDS TO HISTORY DATABASES TO MATCH LIVE
      *C    DATABASES.  CHANGED PROGRAM TO DISPLAY THESE FIELDS
      *C    ON AN INQUIRY.
      *C
      *C 06/07/96  JEFF BUNGO
      *C    EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C    RECOMPILE TO PICK UP NEW FILE FORMATS.
      *C    FOR PASSED BINARY DATE TO TDATECHK FOR DISPLAY FORMAT,
      *C    SUBTRACT 19M OR 20M BEFORE THE CALL.
      *C
      *C 04/03/97  JEFF BUNGO
      *C    FOR HISTORY DISPLAY, MOVE RCVR SEQUENCE SAVED IN
      *C    DPOFREIGHT TO THE SCREEN.  KELLY NEEDS THIS TO
      *C    CORRELATE TO PRAPS RECEIVER NUMBER.
      *C
      *C 03/18/04  CA YODER
      *C    PROGRAM NAME WAS NOT DISPLAYING IN BLOWUP MESSAGE.
      *C    CORRECTED PROBLEM.
      *C---------------------------------------------------------------
DCR01 *C MAR 10, 2005  D.RAUCH       DCR01    REQUEST# 2005-78515
DCR01 *C    DISPLAY FILE PROCESSING CHANGED FROM USING ZCSISINQ
DCR01 *C    NEW DISPLAY FILE ZSINQFRT CREATED - FORMATS COPIED
DCR01 *C    FROM ZCSISINQ.
DCR01 *****************************************************************

008600 ENVIRONMENT DIVISION.
008700 CONFIGURATION SECTION.
008800 SOURCE-COMPUTER.    HP-3000.
008900 OBJECT-COMPUTER.    HP-3000.
       SPECIAL-NAMES.  I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
DCR01             ASSIGN TO WORKSTATION-ZSINQFRT-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS DYNAMIC
                  RELATIVE KEY IS RELATIVE-RECNO
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.
            SELECT DPOFREIGHT
               ASSIGN TO DATABASE-MCFLCS2401
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT MPORCV
               ASSIGN TO DATABASE-MCFLCS0101
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT DPORECD
               ASSIGN TO DATABASE-MCFLCS0901
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT DPORECD-ST
               ASSIGN TO DATABASE-MCFLST0301
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT DPOFREIGHT-ST
               ASSIGN TO DATABASE-MCFLST0701
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
009000
009200 DATA DIVISION.
009300 FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC          PIC X(2000).

       FD  DPOFREIGHT
           LABEL RECORDS ARE STANDARD.
       01  DPOFREIGHT-REC.
           COPY DDS-MCRPCS2400  OF MCFLCS2401.

       FD  MPORCV
           LABEL RECORDS ARE STANDARD.
       01  MPORCV-REC.
           COPY DDS-MCRPCS0100  OF MCFLCS0101.

       FD  DPORECD
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-REC.
           COPY DDS-MCRPCS0900  OF MCFLCS0901.

       FD  DPORECD-ST
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-ST-REC.
           COPY DDS-MCRPST0300  OF MCFLST0301.
       FD  DPOFREIGHT-ST
           LABEL RECORDS ARE STANDARD.
       01  DPOFREIGHT-ST-REC.
           COPY DDS-MCRPST0700  OF MCFLST0701.
009400 WORKING-STORAGE SECTION.
009500*************************************************************
009600*                  WORKING STORAGE                          *
009700*************************************************************
       77  LIVE-LIT    PIC X(23)  VALUE "++++ LIVE DATABASE ++++".
       77  HISTORY-LIT PIC X(23)  VALUE "++ HISTORY DATABASE ++ ".

       01  DISPLAY-DATE               PIC 9(6).
       01  TEMP-DATE                  PIC 9(8).
       01  FILLER REDEFINES TEMP-DATE.
           05  FILLER                 PIC 9(2).
           05  TEMP-YEAR              PIC 9(2).
           05  FILLER                 PIC 9(4).

       01  FILE-STATUS.
           05  FILE-STATUS-1          PIC X.
           05  FILE-STATUS-2          PIC X.

       01  RELATIVE-RECNO         PIC 9(9).

      *------ WS CONTROL AREA
       01  MAJOR-MINOR                 PIC XXXX.
       01  WS-CONTROL.
           02  FUNCTION-NUM            PIC XX.
                   88  EXIT-KEY-F8-USED                     VALUE "08". LVW000LS
                   88  REFRESH-KEY-F4-USED                  VALUE "04". LVW000LS
                   88  ENTER-KEY-USED                       VALUE "00". LVW000LS
                   88  F1-KEY-USED                          VALUE "01". LVW000LS
                   88  F2-KEY-USED                          VALUE "02". LVW000LS
                   88  F3-KEY-USED                          VALUE "03". LVW000LS
                   88  F4-KEY-USED                          VALUE "04". LVW000LS
                   88  F5-KEY-USED                          VALUE "05". LVW000LS
                   88  F6-KEY-USED                          VALUE "06". LVW000LS
                   88  F7-KEY-USED                          VALUE "07". LVW000LS
                   88  F8-KEY-USED                          VALUE "08". LVW000LS
           02 FUN-KEY REDEFINES FUNCTION-NUM PIC XX.
           02 TERMINAL-ID PIC X(10).
           02 FORMAT-NAME PIC X(10).

       01  DISPLAY-STATUS              PIC X(2).

       01  SRF-INDICATORS.
           05  IND OCCURS 99 TIMES   PIC 1 INDICATOR 01.

       COPY IOFEEDBACK OF COPYLIB.
009800 01  PLT-WS.
009900     05  PLT-1                  PIC X(2)     VALUE SPACES.
010000     05  FILLER                 PIC X        VALUE SPACES.
010100
010200 COPY DBPOARG1 OF COPYLIB.
010300
010400 01  FRT-ARG.
010500     05  FRT-PO-PREFIX          PIC X        VALUE "P".
           05  FRT-ARG-2-14.
010600         10  FRT-PO             PIC X(7)     VALUE SPACE.
010700         10  FRT-RLSE           PIC X(3)     VALUE SPACE.
010800         10  FRT-RS             PIC X(3)     VALUE ZERO.
010900         10  FRT-RS-9 REDEFINES FRT-RS  PIC 9(3).
010910 01  RFR-ARG.
010920     05  RFR-PO-PREFIX          PIC X        VALUE "P".
           05  RFR-ARG-2-14.
010930         10  RFR-PO             PIC X(7)     VALUE SPACE.
010940         10  RFR-RLSE           PIC X(3)     VALUE SPACE.
010950         10  RFR-RS             PIC X(3)     VALUE ZERO.
010960         10  RFR-RS-9 REDEFINES RFR-RS  PIC 9(3).
       01  SAVE-PACK-SLIP             PIC X(12)    VALUE SPACES.
011000*************************************************************
011100*                   CALLED ROUTINES                         *
011200*************************************************************
011300*---------- VSETERROR AND VPUTWINDOW
011400 01  MESSAGE-BUFFER            PIC X(76)    VALUE SPACES.
011500 01  MESSAGE-BUFFER-RD REDEFINES MESSAGE-BUFFER.
011600     05  MSG-BUFFER            PIC X(68).
011700     05  MSG-VALUE             PIC X(8).
011800 01  MESSAGE-BUFLEN            PIC S9(4)    VALUE 76 COMP-4.
011900 01  MESSAGE-ACTLEN            PIC S9(4)    VALUE 0  COMP-4.
012000 01  FIELD-NUMBER              PIC S9(4)    VALUE 1  COMP-4.
012100
012700 01  RETURN-STATUS             PIC X        VALUE SPACE.
012800
       COPY CATREAD OF COPYLIB.
012900 COPY TBLOWUP OF COPYLIB.
013100 COPY TDATECHK OF COPYLIB.
013200*************************************************************
013300*                     VIEW BUFFERS                          *
013400*************************************************************
       01  SCREEN-BUFFER             PIC X(2000).
013500 01  FORM-NAMES.
013600     05  FRTDATA               PIC X(8)     VALUE "INQFRT_4".
013700
013800 01  SCREEN-BUFFER-INQFRT.
013900     05  VIEW-PO               PIC X(7)  VALUE SPACES.
014000     05  VIEW-RLSE             PIC X(3)  VALUE SPACES.
014100     05  VIEW-RS               PIC X(3)  VALUE SPACES.
014200     05  VIEW-LAST-RCVR        PIC X(3)  VALUE SPACES.
           05  VIEW-REFER-LIT        PIC X(24) VALUE SPACES.
           05  VIEW-REFER-PO         PIC X(07) VALUE SPACES.
           05  VIEW-REFER-RLSE       PIC X(03) VALUE SPACES.
           05  VIEW-REFER-RS         PIC X(03) VALUE SPACES.
014300     05  VIEW-SEQUENCE         PIC X(6)  VALUE SPACES.
014400     05  VIEW-TYPE             PIC X(8)  VALUE SPACES.
014500     05  VIEW-EMPL             PIC X(4)  VALUE SPACES.
014600     05  VIEW-PACK-SLIP        PIC X(12) VALUE SPACES.
014700     05  VIEW-CHARGES          PIC ------------9.99 VALUE ZEROES.
014800     05  VIEW-CARRIER          PIC X(4)  VALUE SPACES.
014900     05  VIEW-FRT-BILL         PIC X(16) VALUE SPACES.
015000     05  VIEW-ORIGIN           PIC X(10) VALUE SPACES.
015100     05  VIEW-DATE             PIC X(8)  VALUE SPACES.
015200     05  VIEW-CAR-NO           PIC X(10) VALUE SPACES.
015300     05  VIEW-ZBILL            PIC X(5)  VALUE SPACES.
015400     05  VIEW-OSD              PIC X(4)  VALUE SPACES.
015500     05  VIEW-CARR-WT          PIC Z(7)9 VALUE ZEROS.
015600     05  VIEW-OUR-WT           PIC Z(7)9 VALUE ZEROS.
015700     05  VIEW-LOT              PIC X(8)  VALUE SPACES.
015800     05  VIEW-SEALS            PIC X(68) VALUE SPACES.
           05  VIEW-OSD-CLAIM        PIC X(68) VALUE SPACES.
           05  VIEW-HISTORY-LIVE     PIC X(23) VALUE SPACES.
           05  DE-COMMAND-LINE1      PIC X(79) VALUE SPACES.
           05  DE-MESSAGE-LINE1      PIC X(79) VALUE SPACES.

       01  REFER-LIT   PIC X(24) VALUE "FREIGHT REFERRED BACK TO".
015900
016000*>>>>>>>>>>>>     D A T A B A S E
016100 COPY DBSTAT  OF COPYLIB.
016200 COPY DBMODES OF COPYLIB.
016300
017000 01  ITEMS-LISTING.
017100     05  ALL-ITEMS             PIC X(2)     VALUE "@;".
017200     05  PO-KEY-NAME           PIC X(10)    VALUE "PO-RCV-NO;".
017300
017400 01  PO-ARG                    PIC X(14)    VALUE SPACES.
017500 COPY MPORCV OF COPYLIB.
017600 COPY DFREIGHT OF COPYLIB.
017700 COPY DPORECD OF COPYLIB.
       COPY DPORECDH OF COPYLIB.
       COPY DPOFRTH OF COPYLIB.
017800*************************************************************
017900*                     LINKAGE SECTION                       *
018000*************************************************************
018100 LINKAGE SECTION.
018200
018300 01  BASE                      PIC X(10).
018400 COPY VCOMLINK OF COPYLIB.
018500*----------  PARAMETERS FOR ALL INQUIRY SUBROUTINES
018600*            (SINQRSI, SINQFRT)
018700 01  SUBROUTINE-PARMS.
018800     05  PASS-LAST-RECEIVER    PIC 999.
018900     05  PASS-START-RECEIVER   PIC 999.
019000     05  PASS-PO               PIC X(14).
019100     05  PASS-SPOOL            PIC S9(2).
019200     05  PASS-PLT-NUMBER       PIC X(3).
019300     05  PASS-NO-LEFT-OFF-AT   PIC 9(3).
019400     05  PASS-INQUIRY          PIC X.
019500     05  PASS-SAVE-LASTKEY     PIC S9(4) COMP-4.
           05  PASS-HISTORY-FLAG     PIC X.
           05  PASS-ITEM             PIC 9(4).
019600
019700 COPY LANGSUB OF COPYLIB.
019800
019900*************************************************************
020000*************************************************************
020100*                  PROCEDURE DIVISION                       *
020200*       FIND DPORECD TO GET ZBILL NUMBER AND FIND           *
020300*       DPOFREIGHT FOR ALL THE OTHER DATA.  BROWSE          *
020400*       TO NEXT OR PREVIOUS RECEIVER.                       *
020500*************************************************************
020600*************************************************************
020700 PROCEDURE DIVISION USING  BASE,
020800                           VIEW-COMAREA,
020900                           SUBROUTINE-PARMS,
021000                           LANGUAGE-PARMS.
021100
021200 00-INQFRT SECTION 04.
021300 00-MAIN.
           IF PASS-HISTORY-FLAG NOT = "Y"
               OPEN INPUT DPOFREIGHT, DPORECD, MPORCV
           ELSE
               OPEN INPUT DPOFREIGHT-ST  DPORECD-ST
           END-IF.
           OPEN I-O DISPLAY-FILE.
021400     MOVE PASS-PO    TO FRT-ARG, WS-RECEIVER.
021500
022100     MOVE PASS-NO-LEFT-OFF-AT TO FRT-RS-9.
022200
022300     MOVE "000"      TO WS-RS.
           IF PASS-HISTORY-FLAG NOT = "Y"
022400         MOVE WS-RECEIVER TO PO-ARG
           ELSE
               MOVE WS-RECEIVER-2-14 TO PO-ARG
           END-IF.
022500
022600*----------  FIND DPORECD FOR ZBILL NUMBER
           MOVE 0 TO COND-WORD.
           IF PASS-HISTORY-FLAG NOT = "Y"
               MOVE PO-ARG TO PORCVNO  OF DPORECD-REC
               START DPORECD KEY = PORCVNO OF DPORECD-REC
                  INVALID KEY MOVE 17 TO COND-WORD
               END-START
           ELSE
               MOVE PO-ARG TO PORCVNO OF DPORECD-ST-REC
               START DPORECD-ST KEY = PORCVNO OF DPORECD-ST-REC
                  INVALID KEY MOVE 17 TO COND-WORD
               END-START
           END-IF.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
022900     IF COND-WORD NOT = 0
              IF PASS-HISTORY-FLAG NOT = "Y"
023000         MOVE "START DPORECD AT 00 IN SINQFRT" TO BU-DISPLAY-MSG
              ELSE
023000         MOVE "START DPORECD-ST,00 IN SINQFRT" TO BU-DISPLAY-MSG
              END-IF
023100        PERFORM 990-BLOWUP THRU 999-EXIT.
023200
           MOVE 0 TO COND-WORD.
           IF PASS-HISTORY-FLAG NOT = "Y"
               READ DPORECD NEXT INTO BUF-DPORECD
                   AT END MOVE 15 TO COND-WORD
               END-READ
           ELSE
               READ DPORECD-ST NEXT INTO BUF-DPORECD-H
                   AT END MOVE 15 TO COND-WORD
               END-READ
           END-IF.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PASS-HISTORY-FLAG NOT = "Y"
               IF PORCVNO OF DPORECD-REC NOT = PO-ARG
                   MOVE 15 TO COND-WORD
               END-IF
           ELSE
               IF PORCVNO OF DPORECD-ST-REC NOT = PO-ARG
                   MOVE 15 TO COND-WORD
               END-IF
           END-IF.
023500     IF COND-WORD NOT = 0
              IF PASS-HISTORY-FLAG NOT = "Y"
023600         MOVE "READ DPORECD AT 00 IN SINQFRT" TO BU-DISPLAY-MSG
              ELSE
023600         MOVE "READ DPORECD-ST, 00 IN SINQFRT" TO BU-DISPLAY-MSG
              END-IF
023700        PERFORM 990-BLOWUP THRU 999-EXIT.
023800*************************************************************
023900*    GET MPORCV FOR SEQUENCE NUMBER AND DPOFREIGHT FOR      *
024000*    THE REST OF FREIGHT INFORMATION.                       *
024100*************************************************************
024200 100-FIND-MPORCV.
           IF PASS-HISTORY-FLAG = "Y"
               GO TO 105-FIND-DPOFREIGHT
           END-IF.
           MOVE 0 TO COND-WORD.
           MOVE FRT-ARG TO PORCVNO OF MPORCV-REC.
           READ MPORCV INTO BUF-MPORCV
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
024500     IF COND-WORD = 17
024600*-----  DISPLAY "NO MORE RECEIVERS"...WILL ONLY HAPPEN FROM
024700*       PO REFERBACKS SINCE WE DON'T KNOW ITS LAST RECEIVER
024800           MOVE  14 TO LANG-SETNUM
024900           MOVE 102 TO LANG-MSGNUM
025000           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
025100           PERFORM 940-VSETERROR THRU 949-EXIT
025200           GO TO 120-SHOW-FORM.
025300     IF COND-WORD NOT = 0
025400        MOVE "DBGET MPORCV AT 100 SINQFRT" TO BU-DISPLAY-MSG
025500        PERFORM 990-BLOWUP THRU 999-EXIT.
025600
025700 105-FIND-DPOFREIGHT.
028200     MOVE SPACES             TO SCREEN-BUFFER-INQFRT.
           MOVE SPACES TO SAVE-PACK-SLIP.
           MOVE 0 TO COND-WORD.
           IF PASS-HISTORY-FLAG NOT = "Y"
               MOVE FRT-ARG TO PORCVNO OF DPOFREIGHT-REC
               START DPOFREIGHT KEY = PORCVNO OF DPOFREIGHT-REC
                   INVALID KEY MOVE 17 TO COND-WORD
               END-START
           ELSE
               MOVE FRT-ARG-2-14 TO PORCVNO OF DPOFREIGHT-ST-REC
               START DPOFREIGHT-ST KEY = PORCVNO OF DPOFREIGHT-ST-REC
                   INVALID KEY MOVE 17 TO COND-WORD
               END-START
           END-IF.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
026000     IF COND-WORD NOT = 0
024600*-----  DISPLAY "NO MORE RECEIVERS"...WILL ONLY HAPPEN FROM
024700*       PO REFERBACKS SINCE WE DON'T KNOW ITS LAST RECEIVER
024800           MOVE  14 TO LANG-SETNUM
024900           MOVE 102 TO LANG-MSGNUM
025000           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
025100           PERFORM 940-VSETERROR THRU 949-EXIT
025200           GO TO 120-SHOW-FORM.
           MOVE 0 TO COND-WORD.
           IF PASS-HISTORY-FLAG NOT = "Y"
               READ DPOFREIGHT NEXT INTO BUF-DPOFREIGHT
                   AT END MOVE 15 TO COND-WORD
               END-READ
           ELSE
               READ DPOFREIGHT-ST NEXT INTO BUF-DPOFREIGHT-H
                   AT END MOVE 15 TO COND-WORD
               END-READ
           END-IF.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PASS-HISTORY-FLAG NOT = "Y"
               IF PORCVNO  OF DPOFREIGHT-REC NOT = FRT-ARG
                   MOVE 15 TO COND-WORD
               END-IF
           ELSE
               IF PORCVNO  OF DPOFREIGHT-ST-REC NOT = FRT-ARG-2-14
                   MOVE 15 TO COND-WORD
               END-IF
           END-IF.
026500     IF COND-WORD NOT = 0
026600         IF COND-WORD = 15
026700             MOVE  14 TO LANG-SETNUM
026800             MOVE  75 TO LANG-MSGNUM
026900             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
027000             PERFORM 940-VSETERROR THRU 949-EXIT
027100             GO TO  110-GET-FORM
027200         ELSE
                 IF PASS-HISTORY-FLAG NOT = "Y"
027300             MOVE "SINQFRT - FRT GET DB INFO" TO BU-DISPLAY-MSG
                 ELSE
027300             MOVE "SINQFRT FRT-ST GET DB INFO" TO BU-DISPLAY-MSG
                 END-IF
027400           PERFORM 990-BLOWUP THRU 999-EXIT.
027500
           IF PASS-HISTORY-FLAG NOT = "Y"
027600       IF FRT-REFER-RS NOT = SPACES
027700         MOVE FRT-REFER-PO   TO RFR-PO
027800         MOVE FRT-REFER-RLSE TO RFR-RLSE
027900         MOVE FRT-REFER-RS   TO RFR-RS
               MOVE "P"            TO RFR-PO-PREFIX
               IF PO-INVOICELESS-IND = "X"
                   MOVE FRT-PACK-SLIP TO SAVE-PACK-SLIP
               END-IF
027910         MOVE 0 TO LANG-MSGNUM
028000         PERFORM 800-RETRIEVE-MULTI THRU 809-EXIT
028010         IF LANG-MSGNUM = 75
028020            GO TO 110-GET-FORM
028030         ELSE
028040            IF LANG-MSGNUM = 102
028050               GO TO 120-SHOW-FORM
                  END-IF
               END-IF
               MOVE REFER-LIT TO VIEW-REFER-LIT
               MOVE FRT-PO-NUM TO VIEW-REFER-PO
               MOVE FRT-PO-RLSE TO VIEW-REFER-RLSE
               MOVE FRT-PO-RS TO VIEW-REFER-RS
               MOVE FRT-ARG TO FRT-PO-RCV-NO
             END-IF

             IF PO-INVOICELESS-IND = "X" AND
               SAVE-PACK-SLIP NOT = SPACES
               MOVE SAVE-PACK-SLIP TO FRT-PACK-SLIP
             END-IF
           ELSE
027600       IF FRTH-REFER-RS NOT = SPACES
027700         MOVE FRTH-REFER-PO   TO RFR-PO
027800         MOVE FRTH-REFER-RLSE TO RFR-RLSE
027900         MOVE FRTH-REFER-RS   TO RFR-RS
               IF POH-INVOICELESS-INDIC = "X"
                   MOVE FRTH-PACK-SLIP TO SAVE-PACK-SLIP
               END-IF
027910         MOVE 0 TO LANG-MSGNUM
028000         PERFORM 810-RETRIEVE-MULTI THRU 819-EXIT
028010         IF LANG-MSGNUM = 75
028020            GO TO 110-GET-FORM
028030         ELSE
028040            IF LANG-MSGNUM = 102
028050               GO TO 120-SHOW-FORM
                  END-IF
               END-IF
               MOVE REFER-LIT TO VIEW-REFER-LIT
               MOVE FRTH-PO-NUM TO VIEW-REFER-PO
               MOVE FRTH-PO-RLSE TO VIEW-REFER-RLSE
               MOVE FRTH-PO-RS TO VIEW-REFER-RS
               MOVE FRT-ARG-2-14 TO FRTH-PO-RCV-NO
             END-IF

             IF POH-INVOICELESS-INDIC = "X" AND
               SAVE-PACK-SLIP NOT = SPACES
               MOVE SAVE-PACK-SLIP TO FRTH-PACK-SLIP
             END-IF
           END-IF.
028100
028300     MOVE PASS-LAST-RECEIVER TO VIEW-LAST-RCVR.
           IF PASS-HISTORY-FLAG NOT = "Y"
028400         MOVE FRT-PO-NUM         TO VIEW-PO
028500         MOVE FRT-PO-RLSE        TO VIEW-RLSE
028600         MOVE FRT-PO-RS          TO VIEW-RS
028700         MOVE FRT-CARRIER        TO VIEW-CARRIER
028800         MOVE FRT-BILL-NO        TO VIEW-FRT-BILL
028900         MOVE 4                  TO DATE-MODE
029000         MOVE FRT-BILL-DATE      TO DATE-VALIDATE-IN
029100         CALL "TDATECHK" USING DATE-CHECK-AREA
029200         MOVE DATE-SLASH-OUT     TO VIEW-DATE
029300         MOVE FRT-CHARGES-9      TO VIEW-CHARGES
029400         MOVE FRT-PACK-SLIP      TO VIEW-PACK-SLIP
029500         MOVE FRT-CARRIER-WT     TO VIEW-CARR-WT
029600         MOVE FRT-OUR-WT         TO VIEW-OUR-WT
029700         MOVE FRT-SPLC           TO VIEW-ORIGIN
029800         MOVE FRT-EMPL           TO VIEW-EMPL
029900         MOVE FRT-LOT            TO VIEW-LOT
030000         MOVE FRT-RAIL-CAR       TO VIEW-CAR-NO
030100         MOVE FRT-SEALS          TO VIEW-SEALS
030200         MOVE FRT-OSD            TO VIEW-OSD
030300         MOVE M-PO-RCV-SEQ       TO VIEW-SEQUENCE
030400         MOVE PASS-PLT-NUMBER    TO PLT-WS
030500         IF PLT-1 = "11"
030600             MOVE FRT-ZBILL       TO VIEW-ZBILL
               END-IF
030700
030800         IF FRT-TYPE = "C"
030900             MOVE   3 TO LANG-SETNUM
031000             MOVE 155 TO LANG-MSGNUM
031100             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
031200             MOVE MESSAGE-BUFFER TO VIEW-TYPE
031300         ELSE
031400         IF FRT-TYPE = "G"
031500             MOVE "GOODYEAR" TO VIEW-TYPE
031600         ELSE
031700         IF FRT-TYPE = "P"
031800             MOVE  16 TO LANG-SETNUM
031900             MOVE  97 TO LANG-MSGNUM
032000             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
032100             MOVE MESSAGE-BUFFER TO VIEW-TYPE
032200         ELSE
032300         IF FRT-TYPE = "U"
032400             MOVE  21 TO LANG-SETNUM
032500             MOVE  14 TO LANG-MSGNUM
032600             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
032700             MOVE MESSAGE-BUFFER TO VIEW-TYPE
032800         ELSE
032900         IF FRT-TYPE = "D"
033000             MOVE  12 TO LANG-SETNUM
033100             MOVE   8 TO LANG-MSGNUM
033200             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
033300             MOVE MESSAGE-BUFFER TO VIEW-TYPE
               END-IF
               END-IF
               END-IF
               END-IF
               END-IF
           ELSE
028400         MOVE FRTH-PO-NUM        TO VIEW-PO
028500         MOVE FRTH-PO-RLSE       TO VIEW-RLSE
028600         MOVE FRTH-PO-RS         TO VIEW-RS
028700         MOVE FRTH-CARRIER       TO VIEW-CARRIER
028800         MOVE FRTH-BILL-NO       TO VIEW-FRT-BILL
028900         MOVE 4                  TO DATE-MODE
      *---------YEAR 2000 COMPLIANCE
      *---------BEFORE TDATECHK CALL, SUBTRACT 19M/20M FROM BINARY DATE
               IF FRTH-BILL-DATE = 0
                   MOVE SPACES             TO VIEW-DATE
               ELSE
                   MOVE FRTH-BILL-DATE     TO TEMP-DATE
                   IF TEMP-YEAR > 70
                       COMPUTE DISPLAY-DATE = FRTH-BILL-DATE - 19000000
                   ELSE
                       COMPUTE DISPLAY-DATE = FRTH-BILL-DATE - 20000000
                   END-IF
                   MOVE DISPLAY-DATE       TO DATE-VALIDATE-IN
      *------------ FORMAT DATE FOR DISPLAY
029100             CALL "TDATECHK" USING DATE-CHECK-AREA
029200             MOVE DATE-SLASH-OUT     TO VIEW-DATE
               END-IF
029300         MOVE FRTH-CHARGES       TO VIEW-CHARGES
029400         MOVE FRTH-PACK-SLIP     TO VIEW-PACK-SLIP
029500         MOVE FRTH-CARRIER-WT    TO VIEW-CARR-WT
029600         MOVE FRTH-OUR-WT        TO VIEW-OUR-WT
029700         MOVE FRTH-SPLC          TO VIEW-ORIGIN
029800         MOVE FRTH-EMPL          TO VIEW-EMPL
029900         MOVE FRTH-LOT           TO VIEW-LOT
030000         MOVE FRTH-RAIL-CAR      TO VIEW-CAR-NO
030100         MOVE FRTH-SEALS         TO VIEW-SEALS
030200         MOVE FRTH-OSD           TO VIEW-OSD
               MOVE FRTH-OSD-CLAIM     TO VIEW-OSD-CLAIM
      *----------JSB 04/03/97 SHOW SEQUENCE NUMBER INSTEAD OF SPACES
               MOVE FRTH-RCVR-SEQ-NO   TO VIEW-SEQUENCE
030400         MOVE PASS-PLT-NUMBER    TO PLT-WS
030500         IF PLT-1 = "11"
030600             MOVE SPACES         TO VIEW-ZBILL
               END-IF
030700
030800         IF FRTH-TYPE = "C"
030900             MOVE   3 TO LANG-SETNUM
031000             MOVE 155 TO LANG-MSGNUM
031100             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
031200             MOVE MESSAGE-BUFFER TO VIEW-TYPE
031300         ELSE
031400         IF FRTH-TYPE = "G"
031500             MOVE "GOODYEAR" TO VIEW-TYPE
031600         ELSE
031700         IF FRTH-TYPE = "P"
031800             MOVE  16 TO LANG-SETNUM
031900             MOVE  97 TO LANG-MSGNUM
032000             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
032100             MOVE MESSAGE-BUFFER TO VIEW-TYPE
032200         ELSE
032300         IF FRTH-TYPE = "U"
032400             MOVE  21 TO LANG-SETNUM
032500             MOVE  14 TO LANG-MSGNUM
032600             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
032700             MOVE MESSAGE-BUFFER TO VIEW-TYPE
032800         ELSE
032900         IF FRTH-TYPE = "D"
033000             MOVE  12 TO LANG-SETNUM
033100             MOVE   8 TO LANG-MSGNUM
033200             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
033300             MOVE MESSAGE-BUFFER TO VIEW-TYPE
               END-IF
               END-IF
               END-IF
               END-IF
               END-IF
           END-IF.
033400
033500 110-GET-FORM.
033600     MOVE FRTDATA TO  VIEW-NFNAME.
035400*************************************************************
035500*         DISPLAY SCREEN AND TEST FOR FUNCTION KEY ENTERED  *
035600*          FUNCTION KEYS:                                   *
035700*            F1 = RECIEVER INQUIRY                          *
035800*            F2 = NEXT FREIGHT                              *
035900*            F3 = PREVIOUS FREIGHT                          *
036000*            F5 = PRINT SCREEN                              *
036100*            F7 = RETURN TO MAIN SCREEN                     *
036200*            F8 = END PROGRAM                               *
036300*            'ENTER' KEY DEFAULTS TO F2                     *
036400*            F4 AND F6 ARE INVALID                          *
036500*************************************************************
036600 120-SHOW-FORM.
           IF PASS-HISTORY-FLAG NOT = "Y"
               MOVE LIVE-LIT TO VIEW-HISTORY-LIVE
           ELSE
               MOVE HISTORY-LIT TO VIEW-HISTORY-LIVE
           END-IF.
           MOVE SCREEN-BUFFER-INQFRT TO SCREEN-BUFFER.
           MOVE SCREEN-BUFFER TO DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
              INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO SRF-INDICATORS.
           MOVE DISPLAY-REC TO SCREEN-BUFFER-INQFRT.

      *------ A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *------ IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.
038700
038800*----------  F2 = NEXT RECEIVER   &(ENTER KEY DEFAULTS HERE)
038900     IF VIEW-LASTKEY = 2 OR 0
039000        IF FRT-RS = PASS-LAST-RECEIVER OR PASS-INQUIRY = "T"
039100           MOVE  14 TO LANG-SETNUM
039200           MOVE 102 TO LANG-MSGNUM
039300           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
039400           PERFORM 940-VSETERROR THRU 949-EXIT
039500           GO TO 120-SHOW-FORM
039600        ELSE
039700           ADD 1 TO FRT-RS-9
039800           GO TO 100-FIND-MPORCV.
039900
040000*----------  F8 = PREVIOUS RECEIVER
040100     IF VIEW-LASTKEY = 8
040200        IF FRT-RS = "001" OR PASS-INQUIRY = "T"
040300           MOVE  14 TO LANG-SETNUM
040400           MOVE 103 TO LANG-MSGNUM
040500           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
040600           PERFORM 940-VSETERROR THRU 949-EXIT
040700           GO TO 120-SHOW-FORM
040800        ELSE
040900           SUBTRACT 1 FROM FRT-RS-9
041000           GO TO 100-FIND-MPORCV.
041500
041100*----------  F1 = RECEIVER ITEM INQUIRY
041600     IF VIEW-LASTKEY = 1
              MOVE VIEW-LASTKEY TO PASS-SAVE-LASTKEY
              IF FRT-RS-9 NOT = PASS-NO-LEFT-OFF-AT
                  MOVE 1 TO PASS-ITEM
              END-IF
              MOVE FRT-RS-9 TO PASS-NO-LEFT-OFF-AT
              GO TO 199-EXIT.

041600     IF VIEW-LASTKEY = 5
              MOVE 4 TO PASS-SAVE-LASTKEY
              IF FRT-RS-9 NOT = PASS-NO-LEFT-OFF-AT
                  MOVE 1 TO PASS-ITEM
              END-IF
              MOVE FRT-RS-9 TO PASS-NO-LEFT-OFF-AT
              GO TO 199-EXIT.

042700     IF VIEW-LASTKEY EQUAL  7  OR  3
042800         MOVE VIEW-LASTKEY TO PASS-SAVE-LASTKEY
042900         GO TO  199-EXIT.
043000
043100     IF VIEW-LASTKEY EQUAL 4 OR 6
043200         MOVE   9 TO LANG-SETNUM
043300         MOVE  10 TO LANG-MSGNUM
043400         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
043500         PERFORM 940-VSETERROR THRU 949-EXIT
043600         GO TO 120-SHOW-FORM.
043700 199-EXIT.
           IF PASS-HISTORY-FLAG = "Y"
               CLOSE DPOFREIGHT, DPORECD, MPORCV, DISPLAY-FILE
           ELSE
               CLOSE DPOFREIGHT-ST DPORECD-ST DISPLAY-FILE
           END-IF.
043800     GOBACK.
043801 800-RETRIEVE-MULTI.
           MOVE 0 TO COND-WORD.
           MOVE RFR-ARG TO PORCVNO OF MPORCV-REC.
           READ MPORCV INTO BUF-MPORCV
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
043812     IF COND-WORD = 17
043813*-----  DISPLAY "NO MORE RECEIVERS"...WILL ONLY HAPPEN FROM
043814*       PO REFERBACKS SINCE WE DON'T KNOW ITS LAST RECEIVER
043815           MOVE  14 TO LANG-SETNUM
043816           MOVE 102 TO LANG-MSGNUM
043817           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
043818           PERFORM 940-VSETERROR THRU 949-EXIT
043819           GO TO 809-EXIT.
043820     IF COND-WORD NOT = 0
043821        MOVE "DBGET MPORCV AT 800 SINQFRT" TO BU-DISPLAY-MSG
043822        PERFORM 990-BLOWUP THRU 999-EXIT.
043823
           MOVE 0 TO COND-WORD.
           MOVE RFR-ARG TO PORCVNO OF DPOFREIGHT-REC.
           START DPOFREIGHT KEY = PORCVNO OF DPOFREIGHT-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
026000     IF COND-WORD NOT = 0
043813*-----  DISPLAY "NO MORE RECEIVERS"...WILL ONLY HAPPEN FROM
043814*       PO REFERBACKS SINCE WE DON'T KNOW ITS LAST RECEIVER
043815           MOVE  14 TO LANG-SETNUM
043816           MOVE 102 TO LANG-MSGNUM
043817           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
043818           PERFORM 940-VSETERROR THRU 949-EXIT
043819           GO TO 809-EXIT.
           MOVE 0 TO COND-WORD.
           READ DPOFREIGHT NEXT INTO BUF-DPOFREIGHT
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO  OF DPOFREIGHT-REC NOT = RFR-ARG
               MOVE 15 TO COND-WORD.
043832     IF COND-WORD NOT = 0
043833         IF COND-WORD = 15
043834             MOVE  14 TO LANG-SETNUM
043835             MOVE  75 TO LANG-MSGNUM
043836             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
043837             PERFORM 940-VSETERROR THRU 949-EXIT
043838             GO TO  110-GET-FORM
043839         ELSE
043840             MOVE "SINQFRT - FRT GET DB INFO" TO BU-DISPLAY-MSG
043841             PERFORM 990-BLOWUP THRU 999-EXIT.
      *---------CHECK FOR REFERBACK TO A REFERBACK
               IF FRT-REFER-RS NOT = SPACES
027700             MOVE FRT-REFER-PO   TO RFR-PO
027800             MOVE FRT-REFER-RLSE TO RFR-RLSE
027900             MOVE FRT-REFER-RS   TO RFR-RS
                   MOVE "P"            TO RFR-PO-PREFIX
                   GO TO 800-RETRIEVE-MULTI.
043842 809-EXIT.  EXIT.

       810-RETRIEVE-MULTI.
           MOVE 0 TO COND-WORD.
           MOVE RFR-ARG-2-14 TO PORCVNO OF DPOFREIGHT-ST-REC.
           START DPOFREIGHT-ST KEY = PORCVNO OF DPOFREIGHT-ST-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF COND-WORD NOT = 0
      *-----  DISPLAY "NO MORE RECEIVERS"...WILL ONLY HAPPEN FROM
      *       PO REFERBACKS SINCE WE DON'T KNOW ITS LAST RECEIVER
                 MOVE  14 TO LANG-SETNUM
                 MOVE 102 TO LANG-MSGNUM
                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                 PERFORM 940-VSETERROR THRU 949-EXIT
                 GO TO 809-EXIT.
           MOVE 0 TO COND-WORD.
           READ DPOFREIGHT-ST NEXT INTO BUF-DPOFREIGHT-H
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO  OF DPOFREIGHT-ST-REC NOT = RFR-ARG-2-14
               MOVE 15 TO COND-WORD.
043832     IF COND-WORD NOT = 0
043833         IF COND-WORD = 15
043834             MOVE  14 TO LANG-SETNUM
043835             MOVE  75 TO LANG-MSGNUM
043836             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
043837             PERFORM 940-VSETERROR THRU 949-EXIT
043838             GO TO  110-GET-FORM
043839         ELSE
043840             MOVE "SINQFRT - FRT HIST GET DB" TO BU-DISPLAY-MSG
043841             PERFORM 990-BLOWUP THRU 999-EXIT.
      *---------CHECK FOR REFERBACK TO A REFERBACK
               IF FRTH-REFER-RS NOT = SPACES
027700             MOVE FRTH-REFER-PO   TO RFR-PO
027800             MOVE FRTH-REFER-RLSE TO RFR-RLSE
027900             MOVE FRTH-REFER-RS   TO RFR-RS
                   GO TO 800-RETRIEVE-MULTI.
043842 819-EXIT.  EXIT.
044900******************************************************************
045000*   DISPLAY ERROR MESSAGE FOR SPECIFIC FIELD ON SCREEN           *
045100******************************************************************
045200 940-VSETERROR.
           MOVE B"1" TO IND (FIELD-NUMBER)  IND (99).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE1.
048600 949-EXIT.  EXIT.
050700
046700************************************************************
046800*                    B L O W U P                           *
046900*     CHECK FOR IMAGE, VIEW, OR SPOOL ERROR.  CLOSE        *
047000*     FILES, GET OUT OF BLOCK MODE, AND DISPLAY            *
047100*     APPROPRIATE ERROR MESSAGE ON SCREEN.                 *
047200*                                                          *
047300*     ALSO APPENDS THE ERROR MESSAGE TO A FILE CALLED      *
047400*     BLOWUP.PUB.  TO READ THIS FILE, RUN "XBLPRT.OBJECT". *
047500*                                                          *
047600*         |||  PROGRAM IS ABORTED IN TBLOWUP  |||          *
047700************************************************************
047800 990-BLOWUP.
           MOVE "SINQFRT" TO BU-PGM-NAME.
047900     MOVE VIEW-NFNAME TO BU-DISPLAY-FLD (1).
048000     MOVE PASS-PO TO BU-DISPLAY-FLD (2).
048100     MOVE FRT-ARG TO BU-DISPLAY-FLD (3).
           IF PASS-HISTORY-FLAG = "Y"
               MOVE "HISTORY" TO BU-DISPLAY-FLD (4).
048200     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
048300           VIEW-COMAREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
048400           BU-DISPLAY-FLDS.
048500 999-EXIT.  EXIT.
050800 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
052400 999-CATREAD-EXIT.
052500     EXIT.
