000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.     SINQMFR.
000400 AUTHOR.         DAVE PLUM/CRAIG HILLES.
000500 DATE-WRITTEN.   JUNE 1985.
000600 DATE-COMPILED.
000700*INSTALLATION.   THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
000800*REMARKS.
000900**************************************************************
001000*   S I N Q M F R   INQUIRY BY MANUFACTURER SUBPROGRAM       *
000900**************************************************************
001100*                                                            *
001200*   THIS SUBPROGRAM IS CALLED BY:                            *
001300*       1) SDSCINQ  - DESCRIPTION INQUIRY SUBPROGRAM         *
001400*                                                            *
001500*   SUBPROGRAMS CALLED:                                      *
001600*       1) SRFMTMFR - REFORMAT MANUFACTURER SUBPROGRAM       *
001700*       2) TMTLSTAT - MATERIAL STATUS BY CODE SUBPROGRAM     *
001800*       3) TSCRPRT2 - SCREEN PRINT SUBPROGRAM                *
001900*       4) TBLOWUP  - BLOWUP SUBPROGRAM                      *
002000*       5) CFINPTYP - FIND MANUFACTURER TYPE                 *
002100*                                                            *
002200**************************************************************
002300*                                                            *
002400*   THIS SUBPROGRAM PERFORMS THE FOLLOWING FUNCTIONS:        *
002500*                                                            *
002600*D     THIS PROGRAM PERMITS A USER TO PERFORM INQUIRIES BY   *
002700*D  MANUFACTURER.  IT WILL RETRIEVE ALL OF THE CODES LINKED  *
002800*D  TO A GIVEN MANUFACTURER (PROVIDED THAT THE NUMBER OF     *
002900*D  CODES IS NOT EXTREMELY LARGE), AND THEN DISPLAY THOSE    *
003000*D  CODES (X TO A SCREEN) WITH A FEW LINES OF DESCRIPTION    *
003100*D  GIVEN FOR EACH CODE.  THE USER MAY ALSO REQUEST MORE     *
003200*D  INFORMATION ON ANY OF THE CODES DISPLAYED BY SELECTING   *
003300*D  IT INDIVIDUALLY,  TO PROVIDE THIS ADDITIONAL DATA THE    *
003400*D  SUBPROGRAM "TMTLSTAT" IS CALLED USING THE STORES CODE.   *
003500*                                                            *
003600*   THIS PROGRAM IS VERY, VERY SIMILAR TO "SINQKWM" WHICH    *
003700*   IS USED TO PERFORM INQUIRES BY KEYWORD/MODIFIER.  IF     *
003800*   CHANGES TO THIS PROGRAM ARE MADE, SIMILAR CHANGES TO     *
003900*   "SINQKWM" SHOULD BE CONSIDERED.                          *
004000*                                                            *
004100**************************************************************
004200*             P R O G R A M   C H A N G E S                  *
004300*                                                            *
004400*   09/20/85 REVISIONS MADE TO PROVIDE FOR MULTIPLE          *
004500*            LANGUAGE CAPABILITY.                            *
004600*                                                            *
004700*   09/25/85 CALLS TO THE SUBPROGRAM TRSTRMFR WERE REPLACED  *
004800*            WITH CALLS TO TRFMTMFR.  MANUFACTURER NAMES     *
004900*            ARE NO LONGER LIMITED TO ONLY 6 WORDS.          *
005000*                                  D.A. PLUM                 *
005100*                                                            *
005200*   03/26/86 MADE THE FOLLOWING CHANGES:                     *
005300*            1) CHANGED CALLS TO TRFMTMFR TO READ CRFMTMFR   *
005400*               TO REFLECT THE CHANGE IN NAMING CONVENTIONS. *
005500*            2) ADDED MPLTINFO-PARMS AS A PARAMETER BEING    *
005600*               PASSED FROM THE CALLING PROGRAM.             *
005700*                                  D.A. PLUM                 *
005800*                                                            *
005900*   04/21/86 ADDED FEATURE TO ALLOW THE USER A CHOICE        *
006000*            BETWEEN VIEWING CODE DESCRIPTIONS IN EITHER     *
006100*            THE PRIMARY OR SECONDARY LANGUAGE.              *
006200*                                  D.A. PLUM                 *
006300*                                                            *
006400*   04/22/86 MADE THE FOLLOWING CHANGES:                     *
006500*            1) ADDED PART NUMBER TYPE AND PART NUMBER AS    *
006600*               FIELDS TO BE DISPLAYED FOLLOWING THE SEARCH. *
006700*            2) ADDED CALLS TO CFINPTYP WHICH RETURNS        *
006800*               MANUFACTURER TYPES SUCH AS "CAT" AND "P/N".  *
006900*            3) REVISED FORMFILE AND SCREEN BUFFER TO        *
007000*               PLACE KEYWORD/MODIFIER IN A SEPERATE FIELD   *
007100*               INSTEAD OF THE FIRST LINE OF DESCRIPTION.    *
007200*            4) CHANGED THE NUMBER OF CODES DISPLAYED PER    *
007300*               SCREEN AND THE LINES OF DESCRIPTION SHOWN    *
007400*               PER CODE FROM 4 CODES WITH 3 LINES OF        *
007500*               DESCRIPTION PER CODE TO 9 CODES WITH A       *
007600*               SINGLE LINE OF DESCRIPTION PER CODE.  THE    *
007700*               PART NUMBER TYPE, PART NUMBER AND KWM ARE    *
007800*               ALSO SHOWN FOR EACH CODE.                    *
007900*                                  D.A. PLUM                 *
008000*   12/04/86 REMOVED UNNEEDED VCLOSEFORMF AND VOPENFORMV     *
008100*            CALLS THAT WERE BEING PERFORMED WHENEVER        *
008200*            SUBPROGRAM TMTLSTAT IS CALLED.  THE FORMS FOR   *
008300*            THIS PROGRAM, AS WELL AS THOSE FOR TMTLSTAT ARE *
008400*            CONTAINED IN FORMFILE FCSISINQ.                 *
008500*                                  D.A. PLUM                 *
      *                                                            *
      *   16FEB1993      DAVE PLUM     REQUEST #6363               *
      *   ADDED MOVE STATEMENTS FOR THE VARIABLE "VIEW-CFNAME"     *
      *   BOTH BEFORE AND AFTER THE CALL TO SHELPSCR.  SHELPSCR    *
      *   WAS BLOWING UP WHENEVER IT WAS CALLED FROM THIS PROGRAM. *
      *C                                                           *
      *C  09/27/93       JEFF BUNGO    REQUEST #6428               *
      *C  ADDED CAPABILITY TO INQUIRE BY PARTIAL PART NUMBER.      *
      *C  CHANGED THE 9010-DBFIND FOR THE FIND OF MANPART AND      *
      *C  ADDED NEW ROUTINES TO DETIRMINE AND FIND PARTIAL PART    *
      *C  NUMBERS.                                                 *
      *C                                                           *
      *C  05/02/96       JIM COFFMAN   REQUEST #96-021             *
      *C  ADDED VENDOR-TABLE TO WORKING STORAGE AND CODE TO        *
      *C  SUPPORT MULTIPLE SELECTIONS FROM THE VENDOR SCREENS      *
      *C  WHEN A GENERIC REQUEST IS MADE                           *
      *C
      *C  03/20/97       JEFF BUNGO
      *C  REMOVED CODE TO INIT RET-SUB TO ZERO ON EACH SCREEN.
      *C  THIS WILL ALLOW THE USER TO SELECT CODES FROM MULTIPLE
      *C  SCREENS.
      *C                                                           *
      *C  04/16/02       CA YODER                                  *
      *C  CORRECTED DISPLAY OF MANUFACTURER/PART NUMBER ON SCREEN  *
      *C  FOR INQUIRY BY KEYWORD/MODIFIER.  IT WAS TRUNCATING THE  *
      *C  PART NUMBER FIELD, SO A NEW FIELD V-MNF-LINE WAS ADDED   *
      *C  TO HOLD THE MANUFACTURER/PART NUMBER FOR THE KEYWORD/    *
      *C  MODIFIER INQUIRY.                                        *
      *C---------------------------------------------------------------
      *C MAR 10, 2005  D.RAUCH       DCR01    REQUEST# 2005-78515
      *C    DISPLAY FILE PROCESSING CHANGED FROM USING ZCSISINQ
      *C    NEW DISPLAY FILE ZSINVPOI  CREATED - FORMATS COPIED
      *C    FROM ZCSISINQ.
      *C---------------------------------------------------------------
      *C MMM DD, CCYY  XXXNAMEXXX    XXX01    REQUEST# 2005-XXXXX
      *C    XXXXXXXXXXXXXXXXXX DESC XXXXXXXXXXXXXXXXXXXXXXXXXXXXX
      **************************************************************

008900 ENVIRONMENT DIVISION.
009000 CONFIGURATION SECTION.

009100 SOURCE-COMPUTER.  HP-3000.
009200 OBJECT-COMPUTER.  HP-3000.

       SPECIAL-NAMES.  I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT DMANPART-MAN
                  ASSIGN TO DATABASE-MCFLCS3601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DMANPART-PART
                  ASSIGN TO DATABASE-MCFLCS3602
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DCODE-KEY
                  ASSIGN TO DATABASE-MCFLCS3401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DCODE-CODE
                  ASSIGN TO DATABASE-MCFLCS3402
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT MMANUFACT
                  ASSIGN TO DATABASE-MCFLCS3501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MKEYADJ
                  ASSIGN TO DATABASE-MCFLCS3301
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZINQMFR-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS DYNAMIC
                  RELATIVE KEY IS RELATIVE-RECNO
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

009300
009400 DATA DIVISION.
       FILE SECTION.
       FD  DMANPART-MAN
           LABEL RECORDS ARE STANDARD.
       01  DMANPART-MAN-REC.
           COPY DDS-MCRPCS3600  OF MCFLCS3601.

       FD  DMANPART-PART
           LABEL RECORDS ARE STANDARD.
       01  DMANPART-PART-REC.
           COPY DDS-MCRPCS3600  OF MCFLCS3602.

       FD  DCODE-KEY
           LABEL RECORDS ARE STANDARD.
       01  DCODE-KEY-REC.
           COPY DDS-MCRPCS3400  OF MCFLCS3401.

       FD  DCODE-CODE
           LABEL RECORDS ARE STANDARD.
       01  DCODE-CODE-REC.
           COPY DDS-MCRPCS3400  OF MCFLCS3402.

       FD  MMANUFACT
           LABEL RECORDS ARE STANDARD.
       01  MMANUFACT-REC.
           COPY DDS-MCRPCS3500  OF MCFLCS3501.

       FD  MKEYADJ
           LABEL RECORDS ARE STANDARD.
       01  MKEYADJ-REC.
           COPY DDS-MCRPCS3300  OF MCFLCS3301.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC        PIC X(2000).

009500 WORKING-STORAGE SECTION.
009600
009700 77  PASSED-SPOOL-PRT              PIC S9(2) COMP-4 VALUE 0.
010500 77  SUB                           PIC 9(4)  VALUE 0.
       77  RET-SUB                       PIC S9(4) BINARY VALUE 0.
       77  SAVE-VIEW-LASTKEY             PIC S9(4) COMP VALUE 0.
       77  LAST-SCRN-FLAG                PIC X(1)  VALUE "N".
       77  CODE-SELECTED-FLAG            PIC X(1)  VALUE "N".
       77  FIRST-TIME-FLAG               PIC X(1).
       77  END-SUBFILE                   PIC X(1).
       77  PSUB                          PIC 9(2)  VALUE 0.
       77  LAST-CHECK                    PIC 9(2)  VALUE 0.
       77  PARTIAL-FOUND                 PIC X     VALUE "N".
       77  SEARCH-KSAM                   PIC X     VALUE "N".
010600
       01  CHECK-PARTNO.
           05  CHECK-PARTNO-CHAR OCCURS 20 TIMES PIC X(1).
       01  PARTIAL-CHECK.
           05  PARTIAL-CHECK-CHAR OCCURS 20 TIMES PIC X(1).

       COPY FUNCTDEF IN COPYLIB.

011500 01  TABLE-CONSTRAINTS.
011600     05  NUM-CODES-PER-SCREEN      PIC 9(1) VALUE 9.
011700     05  LINES-DESC-PER-CODE       PIC 9(1) VALUE 1.
011800
013000**************************************************************
013100**************************************************************
013200**                                                          **
013300**                     DATA BASE AREA                       **
013400**                                                          **
013500**************************************************************
013600**************************************************************
013700
013800 COPY DMANPART   IN COPYLIB.
013900 COPY DCODE      IN COPYLIB.
014000 COPY DDESC      IN COPYLIB.
014100 COPY DDESC2     IN COPYLIB.
       COPY MMANUFAC   IN COPYLIB.
       COPY MKEYADJ    IN COPYLIB.
014200
014300 01  CODE-WORK.
014400     05  CODE-WORK-1-5.
014500         10  CODE-MAJOR-GROUP      PIC X(2).
014600         10  CODE-SUB-GROUP        PIC X(2).
014700         10  CODE-SEQUENCE-1       PIC X(1).
014800     05  FILLER                    PIC X(2).
014900
015000******************************************************************
015100**                                                              **
015200**               D A T A B A S E   W O R K                      **
015300**                                                              **
015400******************************************************************
015500
       01  DSET-NAME                    PIC X(16).
       01  SAVE-COND-WORD               PIC S9(4) COMP-4.

       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

       01  RELATIVE-RECNO               PIC 9(9).
       01  SAVE-RELATIVE-RECNO          PIC 9(9).

017400 COPY DBSTAT     IN COPYLIB.
017500
017600 01 SEARCH-ITEMS.
017700     05  ALL-ITEMS             PIC X(2)  VALUE "@;".
017800     05  CODE-SEARCH           PIC X(16) VALUE "CORP-CODE;".
017900     05  KWM-OR-MFR-SEARCH     PIC X(16) VALUE "MANUFACTURER;".
018000
018100 01 ARG-VALUES.
018200     05  CODE-ARG                  PIC X(8)  VALUE SPACES.
018300     05  KWM-OR-MFR-ARG            PIC X(50) VALUE SPACES.
018400     05  PLT-ARG                   PIC X(4)  VALUE SPACES.
018500
018600*************************************************************
018700**                                                         **
018800**                  V I E W   W O R K                      **
018900**                                                         **
019000**         ------ ALSO SEE LINKAGE SECTION ------          **
019100**                                                         **
019200*************************************************************
019300
       COPY HMSGBUF IN COPYLIB.
020500
020800 01  FIELD-NUMBER                  PIC S9(4)  COMP-4 VALUE 1.
020900 01  HELP-FORM-PREFIX              PIC X(6)  VALUE "HMJGRP".
021000
021100*************************************************************
021200*************************************************************
021300**                                                         **
021400**                 TERMINAL I/O DATA AREA                  **
021500**                                                         **
021600*************************************************************
021700*************************************************************
021800
021900 01  DE-FIELDS-1.
022000     05  DE-FIELD1                 PIC X(49).
022100     05  DE-MFR-AREA REDEFINES DE-FIELD1.
022200         10  DE-MANUFACTURER       PIC X(26).
022300         10  DE-MAN-PARTNO         PIC X(20).
022400         10  FILLER                PIC X(3).
022500     05  DE-KWM-AREA REDEFINES DE-FIELD1.
022600         10  DE-KEYWORD-MODIFIER.
022700             15  DE-KEYWORD        PIC X(19).
022800             15  DE-MODIFIER       PIC X(30).
022900     05  DE-KWM-SELECT.
023000         10  DE-KW-SELECT          PIC X(19).
023100         10  DE-MOD-SELECT         PIC X(30).
023200     05  DE-CODE-1-5.
023300         10  DE-MAJOR-GROUP        PIC X(2).
023400         10  DE-SUB-GROUP          PIC X(2).
023500         10  DE-SEQUENCE-1         PIC X(1).
           05  DE-COMMAND-LINE-1         PIC X(79).
           05  DE-MESSAGE-LINE-1         PIC X(79).
023600
       01  SUBFILE-CONTROL.
           05  SUBFILE-CONTROL-RECNO     PIC 9(4).
023800     05  V-MFR                     PIC X(50).

       01  DE-SUBFILE.
024100     05  DE-SELECT-FLAG     PIC X(1).
024200     05  V-CODE             PIC X(7).
024300     05  V-TYPE             PIC X(3).
           05  V-MNF-LINE.
024400         10  V-PARTNO       PIC X(20).
024500         10  V-KWM          PIC X(44).
024600     05  V-DESC-LN          PIC X(79).
024900
026500*************************************************************
026600*************************************************************
026700**                                                         **
026800**                  SUBPROGRAM AREAS                       **
026900**                                                         **
027000*************************************************************
027100*************************************************************
027200
027300***** NOTE THAT "TSCRPRT2" ALSO USES PASSED-SPOOL-PRT, *****
027400***** AND VIEW-COMAREA AS PARAMETERS IN ADDITION TO    *****
027500***** THOSE LISTED BELOW.                              *****
027600
027700 01  TSCRPRT2-PARAMETERS.
027800     05  TSCRPRT2-PRINTCNTL        PIC S9(4) COMP-4 VALUE 0.
027900     05  TSCRPRT2-PAGECNTL         PIC S9(4) COMP-4 VALUE 49.
028000     05  TSCRPRT2-SPOOLSW          PIC X(1)  VALUE "N".
028100
028200 01  TSCRPRT2-ERROR-SW             PIC X(1)  VALUE "N".
028300
028400 01  TSCRPRT2-DISPLAY-AREA.
028500     05     FILLER                 PIC X(2).
028600     05  TSCRPRT2-MSG              PIC X(27).
028700     05     FILLER                 PIC X(2).
028800     05  TSCRPRT2-STAT             PIC S9(4).
028900     05     FILLER                 PIC X(2).
029000     05  TSCRPRT2-FLD              PIC X(14).
029100     05     FILLER                 PIC X(2).
029200
029300***** NOTE THAT "TMTLSTAT" ALSO USES PASSED-SPOOL-PRT, *****
029400***** BASE, VIEW-COMAREA, AND LANGUAGE-PARMS AS        *****
029500***** PARAMETERS IN ADDITION TO THOSE LISTED BELOW.    *****
029600
029700 01  TMTLSTAT-PARAMETERS.
029800     05  TMTLSTAT-COMPANY          PIC X(4)  VALUE SPACES.
029900     05  TMTLSTAT-CODE             PIC X(7)  VALUE SPACES.
030000
       01  VENDOR-TABLE.
           05  VENDOR-CODE-T OCCURS 16 TIMES.
               10  VC-T                  PIC X(10).

030100 COPY CRFMTMFR   IN COPYLIB.
030200 COPY CRFMTKWM   IN COPYLIB.
030300 COPY CFINPTYP   IN COPYLIB.
030400 COPY CDESC      IN COPYLIB.
030500 COPY TBLOWUP    IN COPYLIB.
       COPY TSHWRDFM   IN COPYLIB.
030600 COPY DISPDAT2   IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.
030700 COPY MKWINQ     IN COPYLIB.
       COPY CATREAD    IN COPYLIB.
030800
030900*************************************************************
031000*************************************************************
031100**                                                         **
031200**           L I N K A G E    S E C T I O N                **
031300**                                                         **
031400*************************************************************
031500*************************************************************
031600
031700 LINKAGE SECTION.
031800
031900 01  BASE                          PIC X(10).
032000
032100*************************************************************
032200*************************************************************
032300**                                                         **
032400**                VIEW COMMUNICATION AREA                  **
032500**                                                         **
032600**      ------ ALSO SEE WORKING STORAGE SECTION ------     **
032700**                                                         **
032800*************************************************************
032900*************************************************************
033000
033100 COPY VCOMLINK   IN COPYLIB.
033200 COPY LANGSUB    IN COPYLIB.
033300
033400 01  MPLTINFO-PARMS.
033500     05  MPLTINFO-PLANT-CODE       PIC X(3).
033600     05  MPLTINFO-DDESC-LANG       PIC X(3).
033700     05  MPLTINFO-DDESC2-LANG      PIC X(3).
033800
033900 01  SINQMFR-PARMS.
034000*------- TELLS WHETHER INQUIRY BY MANUFACTURER OR KEYWORD/MOD
034100     05  MFR-KWM-FLAG              PIC X(1).
           05  RETURN-CODES.
               10  RET-CODE OCCURS 15 TIMES PIC X(7).
034200     05  FILLER                    PIC X(15).
034300
034400*************************************************************
034500*************************************************************
034600**                                                         **
034700**           P R O C E D U R E   D I V I S I O N           **
034800**                                                         **
034900*************************************************************
035000*************************************************************
035100
035200 PROCEDURE DIVISION USING BASE,
035300                          VIEW-COMAREA,
035400                          LANGUAGE-PARMS,
035500                          MPLTINFO-PARMS,
035600                          SINQMFR-PARMS.
035700 INQUIRY SECTION.
035800
035900 BEGIN-HERE.
036000     PERFORM 1000-HSK.
036100     PERFORM 6000-MAIN THRU 6990-MAIN-X.
           CLOSE DMANPART-MAN, DMANPART-PART, DCODE-KEY, DCODE-CODE,
             DISPLAY-FILE.
036200     GOBACK.
036300
036400 1000-HSK.
036500     MOVE "SINQMFR" TO BU-PGM-NAME.
           MOVE 0 TO SUB.

           OPEN INPUT DMANPART-MAN, DMANPART-PART,
             DCODE-KEY, DCODE-CODE, MMANUFACT, MKEYADJ.
           OPEN I-O DISPLAY-FILE.
036600
           MOVE SPACES TO RETURN-CODES, VENDOR-TABLE.
           MOVE ZEROS TO RET-SUB.

036700     MOVE MPLTINFO-PLANT-CODE TO TMTLSTAT-COMPANY.
036800
041100*********************************************************
041200**                  BLOWUP ROUTINE                     **
041300*********************************************************
041400
041500 2100-BLOWUP.
041600     MOVE DE-MANUFACTURER          TO   BU-DISPLAY-FLD (1).
041700     MOVE DE-MAN-PARTNO            TO   BU-DISPLAY-FLD (2).
041800     MOVE DE-KW-SELECT             TO   BU-DISPLAY-FLD (3).
041900     MOVE DE-MOD-SELECT            TO   BU-DISPLAY-FLD (4).
042000     MOVE DE-CODE-1-5              TO   BU-DISPLAY-FLD (5).
042100     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
042200           VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
042300           BU-DISPLAY-AREA.
042400
044500 4100-SETERROR.
           MOVE B"1" TO IND (99).
           MOVE B"1" TO IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE-1.
051300
045500 4110-S-X.
045600     EXIT.
045700
045800 4120-GET-FORM-1.
045900*------ CALLING MODES:  'M' = MANUFACTURER INQUIRY
046000*------                 'K' = KEYWORD/MODIFIER INQUIRY
046100     IF MFR-KWM-FLAG = "M"
046200         MOVE "INQMFR"             TO   VIEW-NFNAME
046300     ELSE
046400         MOVE "INQKWM"             TO   VIEW-NFNAME.
047800*********************************************************
047900*                                                       *
048000*                      6 - M A I N                      *
048100*                                                       *
048200*********************************************************
048300
048400 6000-MAIN.
           MOVE "N" TO SEARCH-KSAM.
           MOVE ALL B"0" TO SRF-INDICATORS.
048500     PERFORM 4120-GET-FORM-1.
048600 6010-PUT-WINDOW.
048700     MOVE SPACES TO MESSAGE-BUFFER.
048900
049000 6020-PUT-BUFFER.
049100     MOVE SPACES TO DE-FIELDS-1.
050000 6100-SHOW-FORM.
050100*----- f1 APPL, f2,f3,f6,f7 INVALID, f4 REFRESH, f5 PRINT
050200*----- NOTE: FOR FKEY 1, WE WANT TO FIELDEDIT.
050300     MOVE 6                        TO   SRF-KEYSET.
050400     MOVE "I"                      TO   SRF-FKEY (7).
050500     MOVE " AFE"                   TO   SRF-FKEY (1).
           MOVE DE-FIELDS-1 TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC TO DE-FIELDS-1.
           MOVE DE-FIELD1   TO V-MFR.
051100
051200*------ MAJOR GROUP HELP SCREENS
      *------ ADDED MOVE STMTS INVOLVING VIEW-CFNAME TO RESOLVE A
      *------ PROGRAM BUG.  THE F2 KEY WAS NOT FUNCTIONAL IN THE
      *------ AS/400 VERSION OF THIS PROGRAM UNTIL THIS CHANGE WAS
      *------ MADE.   16FEB1993  DAVE PLUM
051300     IF VIEW-LASTKEY = 2
               MOVE "ZCSISINQ" TO VIEW-CFNAME
051400         CALL "SHELPSCR" USING VIEW-COMAREA, LANGUAGE-PARMS,
051500           HELP-FORM-PREFIX
               MOVE "ZINQMFR"  TO VIEW-CFNAME
051600         PERFORM 4120-GET-FORM-1
051700         GO TO 6100-SHOW-FORM.
051800
051900     IF VIEW-LASTKEY = EXIT-PROGRAM
052000         MOVE SPACES TO MESSAGE-BUFFER
052200         GO TO 6990-MAIN-X.
052300
052400     MOVE VIEW-LASTKEY TO SAVE-VIEW-LASTKEY.
052500
053500 6120-EDIT-MFR.
053600*------- DO A DBFIND ON EITHER MANUFACTURER OR KEYWORD MODIFIER
053700     IF MFR-KWM-FLAG = "M"
053800         MOVE DE-MANUFACTURER      TO   SEND-MFR
053900         CALL "CRFMTMFR" USING REFORMAT-MFR-AREA, BASE,
054000           VIEW-COMAREA
054100         MOVE RETURN-MFR           TO   KWM-OR-MFR-ARG,
054200                                        DE-MANUFACTURER
054300         MOVE "MANUFACTURER;"      TO   KWM-OR-MFR-SEARCH
054400         MOVE "DMANPART;"          TO   DSET-NAME
054500     ELSE
054600         MOVE DE-KEYWORD           TO   SEND-KW
054700         MOVE DE-MODIFIER          TO   SEND-MOD
054800         CALL "CRFMTKWM" USING REFORMAT-KWM-AREA, BASE,
054900           VIEW-COMAREA
055000         MOVE RETURN-KWM           TO   KWM-OR-MFR-ARG,
055100         MOVE RETURN-KW            TO   DE-KEYWORD
055200         MOVE RETURN-MOD           TO   DE-MODIFIER
055300         MOVE "KEYWORD-ADJ;"       TO   KWM-OR-MFR-SEARCH
055400         MOVE "DCODE;"             TO   DSET-NAME.
055500
           IF MFR-KWM-FLAG = "M" AND DE-MANUFACTURER = SPACES
           AND DE-MAN-PARTNO > SPACES
               NEXT SENTENCE
           ELSE
055700*        CALL "DBFIND" USING BASE, DSET-NAME, MODE1,
055800*          STATUS-AREA, KWM-OR-MFR-SEARCH, KWM-OR-MFR-ARG
               PERFORM 9000-DBGET-7
055900         IF NO-ENTRY
056000             GO TO 9200-KSAM-SEARCH
056100         ELSE
056200         IF NOT GOOD-CALL
056300             MOVE "DBFIND DCODE ERROR IN 6120-EDIT-MFR"
056400                 TO BU-DISPLAY-MSG
056500             PERFORM 2100-BLOWUP.
056600
056700***** ALTHOUGH THE DBFIND ON "DMANPART" MAY RETURN A     *****
056800***** COND-WORD OF 0, THERE MAY BE ZERO ENTRIES FOR THE  *****
056900***** MANUFACTURER IN "DMANPART".  CHAIN-LENG = 0        *****
057000***** IDENTIFIES THE SITUATION WHERE THE MANUFACTURER    *****
057100***** EXISTS IN THE DATA SET "MMANUFACT", BUT IS NOT     *****
057200***** LINKED TO ANY CODES.                               *****
057300*****                                                    *****
057400
           PERFORM 9010-DBFIND.
057500     IF DE-MANUFACTURER > SPACES
057600         IF COND-WORD NOT = 0
057700             IF MFR-KWM-FLAG = "M"
057800***              MANUFACTURER EXISTS, BUT NOT LINKED TO ANY CODES*
057900                 MOVE  13 TO LANG-SETNUM
058000                 MOVE  19 TO LANG-MSGNUM
058100                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
058200                 MOVE  1  TO FIELD-NUMBER
058300                 PERFORM 4100-SETERROR THRU 4110-S-X
058400                 GO TO 6100-SHOW-FORM
058500             ELSE
058600***             KEYWORD/MODIFIER EXISTS BUT NOT LINKED TO ANY CODES *
058700                 MOVE  11 TO LANG-SETNUM
058800                 MOVE   6 TO LANG-MSGNUM
058900                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
059000                 MOVE   1 TO FIELD-NUMBER
059100                 PERFORM 4100-SETERROR THRU 4110-S-X
059200                 GO TO 6100-SHOW-FORM.
059300
059400*------ IF INQUIRE BY MANUFACTURER AND PARTNO, THE SMALLER CHAIN
059500*------ IS PROBABLY THE PARTNO CHAIN.
059600     IF DE-MAN-PARTNO > SPACES AND MFR-KWM-FLAG = "M"
               PERFORM 9121-DETIRMINE-PARTIAL THRU 9121-DP-X
059700         MOVE "MAN-PARTNO;"        TO   KWM-OR-MFR-SEARCH
059800         MOVE DE-MAN-PARTNO        TO   KWM-OR-MFR-ARG
059900*        CALL "DBFIND" USING BASE, DSET-NAME, MODE1,
060000*          STATUS-AREA, KWM-OR-MFR-SEARCH, KWM-OR-MFR-ARG
               PERFORM 9010-DBFIND
060100         IF NO-ENTRY
060200***          "MANUFACTURER'S NUMBER DOES NOT EXIST"
060300             MOVE  13              TO   LANG-SETNUM
060400             MOVE  20              TO   LANG-MSGNUM
060500             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
060600             MOVE 9                TO   FIELD-NUMBER
060700             PERFORM 4100-SETERROR THRU 4110-S-X
060800             GO TO 6100-SHOW-FORM
060900         ELSE
061000         IF NOT GOOD-CALL
061100             MOVE "DBFIND ERR MANPARTNO 6-EF" TO BU-DISPLAY-MSG
061200             PERFORM 2100-BLOWUP.
061300
062200     MOVE SPACES                   TO   DE-SUBFILE.
062300
       6200-LOAD-SUBFILE.
           PERFORM 7300-CLEAR-SUBFILE THRU 7310-CS-X.
           MOVE 0 TO RELATIVE-RECNO.

       6205-NEXT-SCREEN.
      *------ WE READ UP TO 9 RECORDS AHEAD, AT END OF CHAIN WE
      *------ TELL SUBFILE NO MORE RECORDS BY SETTING INDICATOR 74
           PERFORM 6500-MOVE-FORWARD THRU 6510-MF-X.
           IF COND-WORD NOT = 0
               MOVE B"0" TO IND(74)
           ELSE
               MOVE B"1" TO IND(74).

       6210-DISPLAY-SUBFILE.
           WRITE DISPLAY-REC FORMAT "RDSB" INDICATORS SRF-INDICATORS.
           MOVE B"1" TO IND(76).
           IF RELATIVE-RECNO > ZERO
               MOVE B"1" TO IND(75)
           ELSE
               MOVE B"0" TO IND(75).
           MOVE SUBFILE-CONTROL TO DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT "RDSC" INDICATORS SRF-INDICATORS.
           READ DISPLAY-FILE FORMAT "RDSC" INDICATORS SRF-INDICATORS.

      *------ THE SUBFILE IS SET FOR ONLY 9 RECORDS. IF ROLLUP IS
      *------ HIT (NEXT SCREEN ASKED FOR), IND 78 IS SET
           IF (IND (78) = B"1")
               GO TO 6205-NEXT-SCREEN
           ELSE
           IF (IND (03) = B"1")
               PERFORM 8000-LOAD-SELECTED-CODES
               IF SEARCH-KSAM = "Y"
                   GO TO 9200-KSAM-SEARCH
               ELSE
                   GO TO 6000-MAIN.

075800 6220-EDIT-REQUESTS.
           MOVE RELATIVE-RECNO TO SAVE-RELATIVE-RECNO.
       6225-EDIT-REQUESTS-LOOP.
           READ SUBFILE DISPLAY-FILE NEXT MODIFIED RECORD
             FORMAT "RDSF" INDICATORS SRF-INDICATORS
             AT END GO TO 6230-ER-X.
           IF DISPLAY-STATUS NOT = "00"
               GO TO 6230-ER-X.
           MOVE DISPLAY-REC TO DE-SUBFILE.
      *    *** SUBFILE WONT LET YOU REWRITE IDENTICAL REC.
      *    *** IF AN 'S' AND HIT ENTER, MUST FORCE MODIFIED REC
           IF DE-SELECT-FLAG = "S"
               MOVE "Y" TO DE-SELECT-FLAG
               MOVE DE-SUBFILE TO DISPLAY-REC
               MOVE B"1" TO IND(14)
               REWRITE SUBFILE DISPLAY-REC FORMAT "RDSF"
                 INDICATORS SRF-INDICATORS
               END-REWRITE
               GO TO 6225-EDIT-REQUESTS-LOOP
           ELSE
           IF DE-SELECT-FLAG = "Y"
               MOVE "S" TO DE-SELECT-FLAG
               MOVE DE-SUBFILE TO DISPLAY-REC
               MOVE B"1" TO IND(14)
               REWRITE SUBFILE DISPLAY-REC FORMAT "RDSF"
                 INDICATORS SRF-INDICATORS
               END-REWRITE
               GO TO 6225-EDIT-REQUESTS-LOOP
           ELSE
           IF DE-SELECT-FLAG = "X" AND V-CODE > SPACES
               NEXT SENTENCE
           ELSE
               GO TO 6225-EDIT-REQUESTS-LOOP.
      *------ MARK THIS CODE AS SELECTED TO RETURN TO CALLER
           MOVE B"1" TO IND(14).
           MOVE "S"    TO DE-SELECT-FLAG.
           MOVE DE-SUBFILE TO DISPLAY-REC.
           REWRITE SUBFILE DISPLAY-REC FORMAT "RDSF"
             INDICATORS SRF-INDICATORS.

085400     MOVE V-CODE TO TMTLSTAT-CODE.
085600     CALL "TMTLSTAT" USING BASE,
085700                           VIEW-COMAREA,
085800                           TMTLSTAT-COMPANY,
085900                           PASSED-SPOOL-PRT,
086000                           TMTLSTAT-CODE,
086100                           LANGUAGE-PARMS.
086400
           GO TO 6225-EDIT-REQUESTS-LOOP.

077700 6230-ER-X.
      *------ THE READ MODIFIED REC CHANGED THE CURRENT RELATIVE
      *------ RECNO IN THE SUBFILE, SO WE GET THAT BACK. ALSO WE WANT
      *------ TO RETURN TO THE SCREEN WE WERE ON, WHICH CAN BE
      *------ CALCULATED BY THE RELATIVE RECNO OF THE CODE INQUIRED ON.
           COMPUTE SUBFILE-CONTROL-RECNO =
             RELATIVE-RECNO / (NUM-CODES-PER-SCREEN + 1).
           COMPUTE SUBFILE-CONTROL-RECNO =
             SUBFILE-CONTROL-RECNO * NUM-CODES-PER-SCREEN + 1.
           MOVE SAVE-RELATIVE-RECNO TO RELATIVE-RECNO.
           GO TO 6210-DISPLAY-SUBFILE.

086500 6500-MOVE-FORWARD.
           MOVE 0 TO SUB.
           MOVE "Y" TO FIRST-TIME-FLAG.
       6510-MOVE-FORWARD-LOOP.
           IF SUB > 8
               GO TO 6510-MF-X.
           PERFORM 9020-DBGET.
           IF COND-WORD NOT = 0
               GO TO 6510-MF-X.
           PERFORM 7100-CHECK-SELECTIONS THRU 7110-CS-X.
           IF LAST-SCRN-FLAG = "Y"
               GO TO 6510-MF-X.
           IF CODE-SELECTED-FLAG NOT = "Y"
               GO TO 6510-MOVE-FORWARD-LOOP.
           ADD 1 TO RELATIVE-RECNO.
           ADD 1 TO SUB.
      *------ THE SUBFILE CONTROL RECORD NUMBER ALLOWS US TO POSITION
      *------ THE SUBFILE AT A CERTAIN RELATIVE RECNO. AFTER WE COME
      *------ OUT OF A SCRN WITH A ROLLDOWN PAST END, WE WANT TO
      *------ POSITION TO THE 1ST REC OF NEXT SCRN.
           IF FIRST-TIME-FLAG = "Y"
               MOVE "N" TO FIRST-TIME-FLAG
               MOVE RELATIVE-RECNO TO SUBFILE-CONTROL-RECNO.
           PERFORM 6600-MOVE-TO-SCRN.
           MOVE SPACES TO DE-SELECT-FLAG.
           MOVE DE-SUBFILE TO DISPLAY-REC.
           WRITE SUBFILE DISPLAY-REC FORMAT "RDSF"
             INDICATORS SRF-INDICATORS.
           GO TO 6510-MOVE-FORWARD-LOOP.

089900 6510-MF-X.
090000     EXIT.
093300
       6600-MOVE-TO-SCRN.
099900     MOVE CODE-WORK                TO   V-CODE.
100000     IF MFR-KWM-FLAG = "M"
100100*------- CONVERT THE MANUFACTURER PART TYPE ABBREV TO SHORT DESC
100200         MOVE MAN-PARTNO-TYPE      TO   CFINPTYP-TYPE-DB
100300         CALL "CFINPTYP" USING CFINPTYP-PARMS
100400         MOVE CFINPTYP-TYPE-SHORT  TO   V-TYPE
100500         MOVE MAN-PARTNO           TO   V-PARTNO
100600     ELSE
100700         MOVE SPACES               TO   V-TYPE
100800                                        V-PARTNO.
100900
101000*------- GET 1 LINE DESC FOR SCRN. IF USER HIT F1 FROM MFR ENTRY
101100*------- SCRN, GET SECONDARY DESC.
101200     MOVE 2                        TO   CDESC-LINES-TO-GET.
101300     IF SAVE-VIEW-LASTKEY = 1
101400         MOVE "S"                  TO   CDESC-LANGUAGE-OPTION
101500     ELSE
101600         MOVE "P"                  TO   CDESC-LANGUAGE-OPTION.
101700     MOVE "D"                      TO   CDESC-DESC-OPTION.
101800     MOVE "N"                      TO   CDESC-LOCAL-DESC-OPTION.
101900     MOVE V-CODE               TO   CODE-ARG.
           MOVE COND-WORD TO SAVE-COND-WORD.
102000     CALL "CDESC" USING CDESC-RET-CODE, BASE, STATUS-AREA,
102100       BU-DISPLAY-MSG, CODE-ARG, CDESC-DATA.
           MOVE SAVE-COND-WORD TO COND-WORD.
102200     IF BU-DISPLAY-MSG-1 NOT = SPACES
102300         PERFORM 2100-BLOWUP.
103000     MOVE CDESC (2) TO   V-DESC-LN.
102400
102500     IF MFR-KWM-FLAG = "M"
102600         MOVE CDESC (1) TO   V-KWM
102700     ELSE
               MOVE 1 TO CDESC-LINES-TO-GET
               MOVE "M"  TO CDESC-DESC-OPTION
               CALL "CDESC" USING CDESC-RET-CODE, BASE, STATUS-AREA,
                 BU-DISPLAY-MSG, CODE-ARG, CDESC-DATA
      *********MOVE CDESC (1) TO V-KWM.
               MOVE CDESC (1) TO V-MNF-LINE.
102900
103100
104100 6990-MAIN-X.
104200     EXIT.
104300
107800 7100-CHECK-SELECTIONS.
107900     MOVE "Y"                      TO   CODE-SELECTED-FLAG.
           MOVE "N"                      TO   LAST-SCRN-FLAG.
108000     IF DE-MAJOR-GROUP > SPACES
108100         IF CODE-MAJOR-GROUP NOT = DE-MAJOR-GROUP
108200             MOVE "N"              TO   CODE-SELECTED-FLAG
108300             GO TO 7105-CHECK-LAST.
108400     IF DE-SUB-GROUP > SPACES
108500         IF CODE-SUB-GROUP NOT = DE-SUB-GROUP
108600             MOVE "N"              TO   CODE-SELECTED-FLAG
108700             GO TO 7105-CHECK-LAST.
108800     IF DE-SEQUENCE-1 > SPACES
108900         IF CODE-SEQUENCE-1 NOT = DE-SEQUENCE-1
109000             MOVE "N"              TO   CODE-SELECTED-FLAG
109100             GO TO 7105-CHECK-LAST.
109200     IF MFR-KWM-FLAG = "M"
109300         IF DE-MANUFACTURER > SPACES
109400             IF MAN-NAME NOT = DE-MANUFACTURER
109500                 MOVE "N"          TO   CODE-SELECTED-FLAG
109600                 GO TO 7105-CHECK-LAST.
109700     IF DE-KW-SELECT > SPACES OR DE-MOD-SELECT > SPACES
109800         PERFORM 7200-FIND-GET-DCODE THRU 7290-FGD-X.
109900     IF DE-KW-SELECT > SPACES
110000         IF CODE-KEYWORD NOT = DE-KW-SELECT
110100             MOVE "N"              TO   CODE-SELECTED-FLAG
110200             GO TO 7105-CHECK-LAST.
110300     IF DE-MOD-SELECT > SPACES
110400         IF CODE-MODIFIER NOT = DE-MOD-SELECT
110500             MOVE "N"              TO   CODE-SELECTED-FLAG
110600             GO TO 7105-CHECK-LAST.
110700
110800*------- FOR INQUIRY BY KEYWORD MODIFIER, WE ONLY WANT CODES
110900*------- LINKED TO THAT KWM FOR THE PROPER LANGUAGE (OTHERWISE YOU
111000*------- WOULD GET 2 IF CODE WAS LINKED FOR BOTH LANGUAGES).
111100     IF MFR-KWM-FLAG = "K"
111200         IF SAVE-VIEW-LASTKEY = 1
111300             IF CODE-LANGUAGE-IND = "2"
111400                 NEXT SENTENCE
111500             ELSE
111600                 MOVE "N"          TO   CODE-SELECTED-FLAG
111700         ELSE
111800         IF CODE-LANGUAGE-IND = "1"
111900             NEXT SENTENCE
112000         ELSE
112100             MOVE "N"              TO   CODE-SELECTED-FLAG.
112200
112300 7105-CHECK-LAST.
112400*------- KEYWORD/MOD CHAIN IS SORTED BY CODE, SO IF SELECTING
112500*------- BY MAJOR GROUP/SUB GROUP, QUIT WHEN BEYOND LARGEST
112600*------- POSSIBLE CODE
112700     IF MFR-KWM-FLAG = "K"
112900         IF DE-MAJOR-GROUP > SPACES AND DE-SUB-GROUP > SPACES
113000          AND DE-SEQUENCE-1 > SPACES
113100          AND CODE-WORK-1-5 > DE-CODE-1-5
113200             MOVE "Y"          TO   LAST-SCRN-FLAG
113300         ELSE
113400         IF DE-MAJOR-GROUP > SPACES AND DE-SUB-GROUP > SPACES
113500          AND CODE-MAJOR-GROUP > DE-MAJOR-GROUP
113600          AND CODE-SUB-GROUP > DE-SUB-GROUP
113700             MOVE "Y"          TO   LAST-SCRN-FLAG
113800         ELSE
113900         IF DE-MAJOR-GROUP > SPACES
114000          AND CODE-MAJOR-GROUP > DE-MAJOR-GROUP
114100             MOVE "Y"          TO   LAST-SCRN-FLAG.
114200
114300 7110-CS-X.
114400     EXIT.
114500
114600 7200-FIND-GET-DCODE.
114700*------ THIS SECTION CAN BE EXECUTED FROM MANUFACTURER INQUIRY
114800*------ ONLY.  THEY CAN SELECT ON KEYWORD/MOD, SO HAVE TO
114900*------ GET THE DETAIL FOR THAT CODE
115000*    CALL "DBFIND" USING BASE, DSET-DCODE, MODE1, STATUS-AREA,
115100*      CODE-SEARCH, MAN-CORPCODE.
           MOVE 0 TO COND-WORD.
           MOVE MAN-CORPCODE TO CORPCDE OF DCODE-CODE-REC.
           START DCODE-CODE KEY = CORPCDE OF DCODE-CODE-REC
               INVALID KEY MOVE 0 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 0 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
115200     IF NOT GOOD-CALL
115300         MOVE "DBFIND ERR 7200-FGD" TO BU-DISPLAY-MSG
115400         PERFORM 2100-BLOWUP.
115500
115600 7210-GET-DCODE-LOOP.
115700*    CALL "DBGET" USING BASE, DSET-DCODE, MODE5, STATUS-AREA,
115800*      ALL-ITEMS, BUF-DCODE, MAN-CORPCODE.
           MOVE 0 TO COND-WORD.
           READ DCODE-CODE NEXT INTO BUF-DCODE
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF CORPCDE OF DCODE-CODE-REC NOT = MAN-CORPCODE
               MOVE 15 TO COND-WORD.
115900     IF END-OF-CHAIN
116000         MOVE SPACES               TO   BUF-DCODE
116100         GO TO 7290-FGD-X
116200     ELSE
116300     IF NOT GOOD-CALL
116400         MOVE "DBGET ERR DCODE 7210-GDL" TO BU-DISPLAY-MSG
116500         PERFORM 2100-BLOWUP.
116600
116700     IF SAVE-VIEW-LASTKEY = 1
116800         IF CODE-LANGUAGE-IND = "2"
116900             NEXT SENTENCE
117000         ELSE
117100             GO TO 7210-GET-DCODE-LOOP
117200     ELSE
117300     IF CODE-LANGUAGE-IND = "1"
117400         NEXT SENTENCE
117500     ELSE
117600         GO TO 7210-GET-DCODE-LOOP.
117700
       7290-FGD-X.
           EXIT.

       7300-CLEAR-SUBFILE.
           MOVE B"0" TO IND (75), IND (76).
           MOVE B"1" TO IND (77).
           MOVE SUBFILE-CONTROL TO DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT "RDSC" INDICATORS SRF-INDICATORS.
           MOVE B"0" TO IND (77).
           MOVE ZERO TO RELATIVE-RECNO.
       7310-CS-X.
           EXIT.

       8000-LOAD-SELECTED-CODES.
      *------JSB 3/20/97 TO ALLOW RETRIEVAL FROM MULTIPLE SCREENS
      *    MOVE ZERO TO RET-SUB.
           MOVE "N" TO END-SUBFILE.
           PERFORM UNTIL END-SUBFILE = "Y"
               READ SUBFILE DISPLAY-FILE NEXT MODIFIED RECORD
                 FORMAT "RDSF" INDICATORS SRF-INDICATORS
                 AT END MOVE "Y" TO END-SUBFILE
               END-READ
               IF DISPLAY-STATUS NOT = "00"
                   MOVE "Y" TO END-SUBFILE
               END-IF
               IF END-SUBFILE = "N"
                   MOVE DISPLAY-REC TO DE-SUBFILE
                   IF DE-SELECT-FLAG = "S" OR "Y"
                       IF RET-SUB > 14
                           MOVE 15 TO RET-SUB
                       ELSE
                           ADD 1 TO RET-SUB
                       END-IF
                       MOVE V-CODE TO RET-CODE (RET-SUB)
                   END-IF
               END-IF
           END-PERFORM.

       9000-DBGET-7.
           IF DSET-NAME = "DMANPART;"
               MOVE 0 TO COND-WORD
               MOVE KWM-OR-MFR-ARG TO MANUFACT OF MMANUFACT-REC
               READ MMANUFACT INTO BUF-MMANUFACT
                   INVALID KEY MOVE 17 TO COND-WORD
               END-READ
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
               IF FILE-STATUS NOT = "00"
                   MOVE 99 TO COND-WORD
               ELSE
                   NEXT SENTENCE
           ELSE
               MOVE 0 TO COND-WORD
               MOVE KWM-OR-MFR-ARG TO KEYWORDADJ OF MKEYADJ-REC
               READ MKEYADJ INTO BUF-MKEYADJ
                   INVALID KEY MOVE 17 TO COND-WORD
               END-READ
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
               IF FILE-STATUS NOT = "00"
                   MOVE 99 TO COND-WORD.

       9010-DBFIND.
            IF DSET-NAME = "DCODE;"
               MOVE 0 TO COND-WORD
               MOVE KWM-OR-MFR-ARG TO KEYWORDADJ OF DCODE-KEY-REC
               START DCODE-KEY KEY = KEYWORDADJ OF DCODE-KEY-REC
                   INVALID KEY MOVE 17 TO COND-WORD
               END-START
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
               IF FILE-STATUS NOT = "00"
                   MOVE 99 TO COND-WORD
               ELSE
                   NEXT SENTENCE
            ELSE
            IF KWM-OR-MFR-SEARCH = "MAN-PARTNO;"
               MOVE 0 TO COND-WORD
               MOVE KWM-OR-MFR-ARG TO MANPARTNO OF DMANPART-PART-REC
               START DMANPART-PART
                   KEY NOT < MANPARTNO OF DMANPART-PART-REC
                   INVALID KEY MOVE 17 TO COND-WORD
               END-START
               MOVE SPACES TO MAN-NAME
               PERFORM UNTIL COND-WORD NOT = 0
                               OR MAN-NAME = DE-MANUFACTURER
                   READ DMANPART-PART NEXT INTO BUF-DMANPART
                       AT END MOVE 17 TO COND-WORD
                   END-READ
               END-PERFORM
               IF COND-WORD NOT = 17
                   PERFORM 9122-PARTIAL-CHECK THRU 9122-PC-X
                   IF PARTIAL-FOUND = "N"
                       MOVE 17 TO COND-WORD
                   ELSE
                       START DMANPART-PART
                         KEY NOT < MANPARTNO OF DMANPART-PART-REC
                       END-START
                   END-IF
               END-IF
           ELSE
               MOVE 0 TO COND-WORD
               MOVE KWM-OR-MFR-ARG TO MANUFACT OF DMANPART-MAN-REC
               START DMANPART-MAN KEY = MANUFACT OF DMANPART-MAN-REC
                   INVALID KEY MOVE 17 TO COND-WORD
               END-START
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
               IF FILE-STATUS NOT = "00"
                   MOVE 99 TO COND-WORD.

       9011-DBFIND-MANPART.
       9011-DM-X.
           EXIT.

       9020-DBGET.
           IF DSET-NAME = "DCODE;"
               PERFORM 9100-DBGET5-DCODE-KEY
           ELSE
           IF KWM-OR-MFR-SEARCH = "MAN-PARTNO;"
               PERFORM 9120-DBGET5-DMANPART-PART
           ELSE
               PERFORM 9140-DBGET5-DMANPART-MAN.

       9100-DBGET5-DCODE-KEY.
           MOVE 0 TO COND-WORD.
           READ DCODE-KEY NEXT INTO BUF-DCODE
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF KEYWORDADJ OF DCODE-KEY-REC NOT = KWM-OR-MFR-ARG
               MOVE 15 TO COND-WORD.
           IF COND-WORD = 0
               MOVE CORPCDE OF DCODE-KEY-REC TO CODE-WORK.

       9120-DBGET5-DMANPART-PART.
           MOVE 0 TO COND-WORD.
           READ DMANPART-PART NEXT INTO BUF-DMANPART
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           PERFORM 9122-PARTIAL-CHECK THRU 9122-PC-X.
           IF PARTIAL-FOUND = "N"
      *    IF MANPARTNO OF DMANPART-PART-REC NOT = KWM-OR-MFR-ARG
               MOVE 15 TO COND-WORD.
           IF COND-WORD = 0
               MOVE CORPCDE OF DMANPART-PART-REC TO CODE-WORK.

       9121-DETIRMINE-PARTIAL.
           MOVE DE-MAN-PARTNO TO CHECK-PARTNO.
           PERFORM VARYING PSUB FROM 1 BY 1
               UNTIL PSUB > 20
                 IF CHECK-PARTNO-CHAR (PSUB) NOT = SPACES
                     MOVE PSUB TO LAST-CHECK
                 END-IF
           END-PERFORM.
       9121-DP-X.
           EXIT.

       9122-PARTIAL-CHECK.
           MOVE "Y" TO PARTIAL-FOUND.
           MOVE MANPARTNO OF DMANPART-PART-REC TO PARTIAL-CHECK.
           PERFORM VARYING PSUB FROM LAST-CHECK BY -1
             UNTIL PSUB = 0
              IF PARTIAL-CHECK-CHAR(PSUB) NOT = CHECK-PARTNO-CHAR(PSUB)
                  MOVE "N" TO PARTIAL-FOUND
              END-IF
           END-PERFORM.
       9122-PC-X.
           EXIT.

       9140-DBGET5-DMANPART-MAN.
           MOVE 0 TO COND-WORD.
           READ DMANPART-MAN NEXT INTO BUF-DMANPART
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF MANUFACT OF DMANPART-MAN-REC NOT = KWM-OR-MFR-ARG
               MOVE 15 TO COND-WORD.
           IF COND-WORD = 0
               MOVE CORPCDE OF DMANPART-MAN-REC TO CODE-WORK.

077900 9200-KSAM-SEARCH.
           IF SEARCH-KSAM = "N"
078000         MOVE SPACES TO MANUFACT-KEYWORD-INQUIRY
078100         IF MFR-KWM-FLAG = "M"
078200           MOVE "M" TO MKW-TYPE
078300         ELSE
078400           MOVE "K" TO MKW-TYPE
               END-IF
078500         MOVE KWM-OR-MFR-ARG TO MKW-PASS-AREA
               MOVE "Y" TO SEARCH-KSAM
           END-IF.
078600     CALL "SMKWINQ" USING VIEW-COMAREA MANUFACT-KEYWORD-INQUIRY
078700                          BASE LANGUAGE-PARMS VENDOR-TABLE.
078800     PERFORM 4120-GET-FORM-1
078900     IF MFR-KWM-FLAG = "M"
079000         MOVE MKW-RETURN-AREA      TO   DE-MANUFACTURER
                                              V-MFR
079100     ELSE
079200         MOVE MKW-RETURN-AREA      TO   DE-FIELD1,
                                              V-MFR.
080200     IF MKW-MESSAGE-AREA NOT = SPACES
080300        MOVE MKW-MESSAGE-AREA TO MESSAGE-BUFFER
080400        MOVE  1  TO FIELD-NUMBER
080500        PERFORM 4100-SETERROR THRU 4110-S-X
080600        GO TO 6100-SHOW-FORM
080700     ELSE
080800*-----  NONE WERE SELECTED
080900        IF MKW-RETURN-STATUS = "N"
081000           GO TO 6000-MAIN
081100        ELSE
081200           IF MFR-KWM-FLAG = "M"
081300              MOVE MKW-RETURN-MANUFCT TO DE-MANUFACTURER
081400              GO TO 6120-EDIT-MFR
081500           ELSE
081600              MOVE MKW-RETURN-KEYWORD  TO DE-KEYWORD
081700              MOVE MKW-RETURN-MODIFIER TO DE-MODIFIER
081800              GO TO 6120-EDIT-MFR.

       COPY DISPCALL IN COPYLIB.
       COPY DISPCAL2  IN COPYLIB.
119300 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
121000 999-CATREAD-EXIT.
121100     EXIT.
