       IDENTIFICATION DIVISION.
       PROGRAM-ID.          SINSTRPT.
       AUTHOR.              ANNETTE KRAUSS.
       INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
       DATE-WRITTEN.        JUNE 6, 1986.

      ***** COMMENTS:
      *C
      *C  04/21/99   CA YODER.   J THOMAS REQUEST.
      *C    ADDED ANOTHER COLUMN TO THE REPORT INDICATING IF THE
      *C    INSTRUCTIONS ARE PURCHASING OR RECEIVING INSTRUCTIONS.
      *C

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.
       COPY SPECIALN IN COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.
           SELECT SORT-FILE  ASSIGN TO DISK-SORT.
           SELECT MCOMMENT-I
                  ASSIGN TO DATABASE-MCFLCS1801
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT DCOMMENT-I
                  ASSIGN TO DATABASE-MCFLCS1901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
            SELECT MPLTINFO-PK-I
                ASSIGN TO DATABASE-MCFLCS0501
                ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                FILE STATUS IS FILE-STATUS.
002500

       DATA DIVISION.
       FILE SECTION.

       FD  PRINT-FILE
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 132 CHARACTERS
           DATA RECORD IS PRINT-REC.
       01  PRINT-REC                  PIC X(132).

       SD  SORT-FILE
      **** RECORD CONTAINS 6 CHARACTERS.
           RECORD CONTAINS 7 CHARACTERS.
       01  SORT-RCD.
      **** 05  SORT-COM-NO            PIC X(3).
           05  SORT-COM-NO            PIC X(4).
           05  SORT-SUBJECT-CODE      PIC X(3).

       FD  MCOMMENT-I
           LABEL RECORDS ARE STANDARD.
       01  MCOMMENT-REC-I.
           COPY DDS-MCRPCS1800   OF MCFLCS1801.

       FD  DCOMMENT-I
           LABEL RECORDS ARE STANDARD.
       01  DCOMMENT-REC-I.
           COPY DDS-MCRPCS1900   OF MCFLCS1901.

       FD  MPLTINFO-PK-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-PK-REC-I.
           COPY DDS-MCRPCS0500 OF MCFLCS0501.
002800
       WORKING-STORAGE SECTION.
       01  HANDLE-BLOWUP-FLAG         PIC X      VALUE "Y".
       01  WS-EDI-INSTAL              PIC X      VALUE SPACE.

       01  FILE-STATUS.
           05  FILE-STATUS-1          PIC X      VALUE SPACES.
           05  FILE-STATUS-2          PIC X      VALUE SPACES.

       77  FST-TIME-SW                PIC 9.
       77  LINE-CTR                   PIC 9(2)   VALUE ZEROS.
       77  PAGE-NUM                   PIC 9(3)   VALUE ZEROS.
       01  END-OF-SORT-FILE           PIC X(1)   VALUE "N".
           88  ALL-SORTED-RECORDS-PROCESSED      VALUE "Y".
       01  END-OF-INPUT-FILE          PIC X(1)   VALUE "N".
           88  ALL-INPUT-RECORDS-PROCESSED       VALUE "Y".

      **********************
      *                    *
      * ESCAPE SEQUENCES   *
      *                    *
      **********************
       01  STRIP                  PIC X(5)  JUST RIGHT VALUE SPACES.
       01  EXPAND-PRINT-STRIPED   PIC X(5)  VALUE "*EXP*".
       01  COMPRESS-PRINT-STRIPED PIC X(5)  VALUE "*CMP*".


      *****ARGUMENT VALUES*****
       01  COMMENT-ARG                PIC X(4)   VALUE SPACES.
       01  MPLTINFO-ARG               PIC X(4)   VALUE SPACES.
       01  PLT-ARG                    PIC X(4)   VALUE SPACES.

       01  ITEM-LISTINGS.
           05  ALL-ITEM-LIST          PIC XX     VALUE "@;".
           05  COMMENT-SEARCH    PIC X(16)  VALUE "MCOM-COMMENT-NO;".

       COPY TDATECHK IN COPYLIB.

      *********************
      *                   *
      *   DATA SET NAMES  *
      *                   *
      *********************

       01  DSET-NAMES.
           05  DSET-MCOMMENT          PIC X(16)  VALUE "MCOMMENT;".
           05  DSET-DCOMMENT          PIC X(16)  VALUE "DCOMMENT;".
           05  DSET-NAME              PIC X(16)  VALUE SPACES.


       01 SWITCH-AREA.
           05  EXP-PRT-FLAG           PIC X  VALUE SPACES.
           05  COMP-PRT-FLAG          PIC X  VALUE SPACES.
           05  AT-LEAST-ONE-FOUND     PIC X  VALUE "N".

       01  WORK-AREA.
           05  BUILD-COMMENT-NO.
      *****    10  BUILD-COM-PREFIX     PIC X     VALUE "C".
               10  BUILD-COM-PREFIX     PIC X.
               10  BUILD-COM-NO         PIC X(3)  VALUE SPACES.


      *--------------------- ESCAPE SEQUENCES

       COPY TBLOWUP IN COPYLIB.
       01  VIEW-COMAREA.
           05  FILLER                  PIC X(118)  VALUE ALL "0".
           05  FILLER                  PIC S9(4)   COMP-4 VALUE 9999.
       01  KSAM-STATUS                 PIC X(2)    VALUE SPACES.


      *--------------------- DATABASE AREA
       COPY DBMODES   IN COPYLIB.

       COPY DBSTAT    IN COPYLIB.

      *COPY CCHKOBJ   IN COPYLIB.
      *COPY CCRTFILE  IN COPYLIB.
      *COPY OVRPFDATA IN COPYLIB.
      *--------------------- DATABASE BUFFERS
       COPY MCOMMENT  IN COPYLIB.

       COPY DCOMMENT  IN COPYLIB.

       COPY MPLTINFO  IN COPYLIB.
      *********************************
      *                               *
      *  REPORT  HEADERS              *
      *                               *
      *********************************

       01  PRINT-LINE                 PIC X(132)  VALUE SPACES.

       01  HEAD1 REDEFINES PRINT-LINE.
           05  FILLER                 PIC X(29).
           05  HEAD1-TITLE1           PIC X(39).
           05  HEAD1-TITLE2           PIC X(37).
           05  FILLER                 PIC X(15).
           05  HEAD1-PLANT            PIC X(6).
           05  HEAD1-PLANT-OUT        PIC X(3).
           05  FILLER                 PIC X(3).

       01  HEAD2 REDEFINES PRINT-LINE.
           05  FILLER                 PIC X(1).
           05  HEAD2-DATE             PIC X(8).
           05  FILLER                 PIC X(5).
           05  HEAD2-TIME             PIC X(8).
           05  FILLER                 PIC X(10).
           05  HEAD2-TITLE1           PIC X(30).
           05  HEAD2-TITLE2           PIC X(42).
           05  FILLER                 PIC X(14).
           05  HEAD2-PAGE             PIC X(6).
           05  HEAD2-PAGE-NO          PIC Z,ZZ9.
           05  FILLER                 PIC X(3).

       01  DOT-LINE.
           05  FILLER                 PIC X(132)  VALUE ALL "-".

      *01  COMMENT-DETAIL-FIRST-LINE.
      *    05  FILLER  PIC X(18)  VALUE "  INSTRUCTION NO: ".
      *    05  COM-NO-OUT  PIC X(3).
      *    05  FILLER  PIC X(5)   VALUE SPACES.
      *    05  COM-CONTENT-OUT  PIC X(72).
      *    05  FILLER  PIC X(14)  VALUE "  PRINT TYPE: ".
      *    05  PRINT-TYPE-OUT  PIC X(10).
      *
      *01  COMMENT-DETAIL-SEC-LINE.
      *    05  FILLER  PIC X(26)  VALUE SPACES.
      *    05  COM-CONTENT-OUT-2  PIC X(72).

       01  FIELD-HEADING-1.
           05  FILLER             PIC X(5)  VALUE "PO/RC".
      **** 05  FILLER             PIC X(15) VALUE "INSTRUCTION NO.".
           05  FILLER             PIC X(10) VALUE " INSTR NO ".
           05  SUB-CODE-LITERAL   PIC X(10) VALUE " SUB CODE ".
           05  FILLER             PIC X(80) VALUE
               "I  N  S  T  R  U  C  T  I  O  N ".
           05  FILLER             PIC X(20) VALUE "PRINT TYPE".

       01  DETAIL-LINE-1.
           05  FILLER             PIC X(2)         VALUE SPACES.
           05  COM-INST-TYPE      PIC X.
           05  FILLER             PIC X(3)         VALUE SPACES.
      **** 05  COM-NO-OUT         PIC B(5)X(3)B(7) VALUE SPACES.
           05  COM-NO-OUT         PIC X(3)B(6)     VALUE SPACES.
           05  SUB-CODE-OUT       PIC BBBBXXXBBB   VALUE SPACES.
           05  COM-CONTENT-OUT    PIC X(80)        VALUE SPACES.
           05  PRINT-TYPE-OUT     PIC X(10)        VALUE SPACES.

       LINKAGE SECTION.
       01  BASE                                  PIC X(10).
       01  PLANT-NUMBER                          PIC X(3).
       01  ESC-INFO.
           05  COMPRESS-PRINT                    PIC X(8).
           05  NORMAL-PRINT                      PIC X(8).
           05  EXPAND-PRINT                      PIC X(8).
       01  HD-PAPER-FLAG                      PIC X(1).
           88  PAPER-IS-132-COL                           VALUE "X".

       PROCEDURE DIVISION USING BASE, PLANT-NUMBER, ESC-INFO,
                                HD-PAPER-FLAG.

       1-HOUSEKEEP SECTION.
      *---------- OPEN THE PRINT FILE, GET THE FILE NUMBER OF THE PRINT
      *---------- FILE, AND PRINT THE HEADER PAGE.
      *    MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
      *    MOVE "*YES"            TO OVRPRTF-SHARED.
      *    MOVE HD-NO-OF-COPIES   TO OVRPRTF-COPIES.
      *    MOVE "MCPRT"           TO OVRPRTF-FILE.
      *    PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT PRINT-FILE.

           OPEN INPUT MCOMMENT-I, DCOMMENT-I, MPLTINFO-PK-I.

           MOVE "SINSTRPT" TO BU-PGM-NAME.

           SORT SORT-FILE
             ON ASCENDING KEY SORT-COM-NO
                 INPUT PROCEDURE IS 8-SERIAL-READ-MCOMMENT
                 OUTPUT PROCEDURE IS 9-WRITE-RECORDS.

           WRITE PRINT-REC FROM NORMAL-PRINT AFTER ADVANCING 0.

           CLOSE MCOMMENT-I, DCOMMENT-I, MPLTINFO-PK-I.
           GOBACK.

      *COPY OVRPFCALL IN COPYLIB.

       8-SERIAL-READ-MCOMMENT SECTION.
           MOVE SPACES          TO BUF-MPLTINFO.
           MOVE "EDI "          TO MPLTINFO-ARG, PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-I.
           IF COND-WORD = 0
               IF EDI-INSTAL = "Y"
                   MOVE "Y"     TO WS-EDI-INSTAL
               ELSE
               MOVE "N"         TO WS-EDI-INSTAL
               MOVE SPACES      TO SUB-CODE-LITERAL
           ELSE
           MOVE "N"             TO WS-EDI-INSTAL
           MOVE SPACES          TO SUB-CODE-LITERAL.
           READ MCOMMENT-I FIRST RECORD INTO BUF-MCOMMENT
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "Y" TO END-OF-INPUT-FILE.
           PERFORM 81-PROCESS-INPUT-RECORDS THRU 81-PIR-EXIT.
           GO TO 89-EXIT.

       81-PROCESS-INPUT-RECORDS.
           IF MCOM-KEY-PREFIX =  "C" OR "R"
      ******   MOVE MCOM-KEY-NUM      TO  SORT-COM-NO
               MOVE MCOM-COMMENT-NO   TO  SORT-COM-NO
               MOVE MCOM-SUBJECT-CODE TO SORT-SUBJECT-CODE
               RELEASE SORT-RCD.

           READ MCOMMENT-I NEXT INTO BUF-MCOMMENT
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE "Y" TO END-OF-INPUT-FILE
                   GO TO 81-PIR-EXIT
               ELSE
               MOVE "READN MCOMMENT ERROR"  TO BU-DISPLAY-MSG
               MOVE COND-WORD               TO BU-DISPLAY-FLD (1)
               PERFORM 82-BLOWUP.

           PERFORM 81-PROCESS-INPUT-RECORDS.

       81-PIR-EXIT.
           EXIT.

      *************************************************************
      *                    BLOWUP   ROUTINE                       *
      *************************************************************
       82-BLOWUP.
           WRITE PRINT-REC FROM NORMAL-PRINT AFTER ADVANCING 0.

           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
                 VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                 BU-DISPLAY-AREA.



       89-EXIT.
           EXIT.


       9-WRITE-RECORDS SECTION.
           IF PAPER-IS-132-COL
               NEXT SENTENCE
           ELSE
               WRITE PRINT-REC FROM COMPRESS-PRINT
                   AFTER ADVANCING 0 LINES.

           PERFORM 94-NEW-PAGE.
           RETURN SORT-FILE
               AT END GO TO 92-REPORT-FINISHED.
           PERFORM 91-PROCESS-SORTED-RECORDS THRU 91-PSR-X
               UNTIL ALL-SORTED-RECORDS-PROCESSED.
           MOVE "Y"  TO  AT-LEAST-ONE-FOUND.
           GO TO 92-REPORT-FINISHED.

       91-PROCESS-SORTED-RECORDS.
           MOVE 0                TO FST-TIME-SW.
           PERFORM 92-FIND-DCOMMENT THRU  92-DONE-WRITE-COMMENT.
           RETURN SORT-FILE
               AT END MOVE "Y"   TO END-OF-SORT-FILE.

       91-PSR-X.
           EXIT.


       92-REPORT-FINISHED.
           IF AT-LEAST-ONE-FOUND  =  "Y"
               GO TO 99-WRITE-RPT-EXIT.
           MOVE "*** NO INSTRUCTIONS ON FILE ***"  TO PRINT-LINE.
           WRITE PRINT-REC AFTER ADVANCING 1 LINES.
           GO TO 99-WRITE-RPT-EXIT.

       92-FIND-DCOMMENT.
      **** MOVE SORT-COM-NO  TO  BUILD-COM-NO, COM-NO-OUT.
           MOVE SORT-COM-NO  TO  BUILD-COMMENT-NO.
           MOVE SORT-COM-NO (2:3)   TO  COM-NO-OUT.
           EVALUATE SORT-COM-NO (1:1)
               WHEN "C"    MOVE "P" TO  COM-INST-TYPE
               WHEN "R"    MOVE "R" TO  COM-INST-TYPE.

      **** MOVE "C"          TO  BUILD-COM-PREFIX.
           IF WS-EDI-INSTAL = "N"
               MOVE SPACES        TO SUB-CODE-OUT
           ELSE
           MOVE SORT-SUBJECT-CODE TO SUB-CODE-OUT.
       92-FD-LOOP.
           MOVE BUILD-COMMENT-NO  TO  COMMENT-ARG.
           MOVE COMMENT-ARG TO MCOMCOMMNT OF DCOMMENT-REC-I.
           START DCOMMENT-I KEY = MCOMCOMMNT OF DCOMMENT-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   IF FST-TIME-SW = 1
                       MOVE SPACES  TO  EXP-PRT-FLAG, COMP-PRT-FLAG
                       MOVE SPACES TO PRINT-TYPE-OUT
                       MOVE "** NO INSTRUCTION ON FILE **"
                           TO COM-CONTENT-OUT
                       WRITE PRINT-REC FROM DETAIL-LINE-1
                           AFTER ADVANCING 1 LINES
                       GO TO 92-DONE-WRITE-COMMENT
                   ELSE
                   MOVE "R" TO BUILD-COM-PREFIX
                   MOVE 1   TO FST-TIME-SW
                   GO TO 92-FD-LOOP
               ELSE
               MOVE "DBFIND DCOMMENT ERROR"  TO  BU-DISPLAY-MSG
               MOVE COND-WORD                TO  BU-DISPLAY-FLD (1)
               PERFORM 92-BLOWUP.

       92-FIND-PRT-TYPE.
           MOVE SPACES  TO  EXP-PRT-FLAG, COMP-PRT-FLAG.
           READ DCOMMENT-I NEXT INTO BUF-DCOMMENT
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET DCOMMENT 1 ERROR"  TO BU-DISPLAY-MSG
               MOVE COND-WORD                 TO BU-DISPLAY-FLD (1)
               PERFORM 92-BLOWUP.

           IF EXP-PRT-START  =  EXPAND-PRINT-STRIPED
               MOVE "X"  TO  EXP-PRT-FLAG
               MOVE EXP-DATA-COMMENT  TO  COM-CONTENT-OUT
               MOVE "EXPANDED"  TO  PRINT-TYPE-OUT
           ELSE
               IF COMP-PRT-START  =  COMPRESS-PRINT-STRIPED
                   MOVE "X"  TO  COMP-PRT-FLAG
                   MOVE COMP-DATA-COMMENT  TO COM-CONTENT-OUT
                   MOVE "COMPRESSED"  TO  PRINT-TYPE-OUT
               ELSE
                   MOVE DCOM-DATA-LINE  TO  COM-CONTENT-OUT
                   MOVE "REGULAR"  TO  PRINT-TYPE-OUT.

       92-WRITE-FIRST-DETAIL.
           WRITE PRINT-REC FROM DETAIL-LINE-1
                 AFTER ADVANCING 1 LINES.
           MOVE SPACES TO DETAIL-LINE-1.
           ADD  1  TO LINE-CTR.

       92-CONT-GET-DCOMMENT.
           READ DCOMMENT-I NEXT INTO BUF-DCOMMENT
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO 92-DONE-WRITE-COMMENT
               ELSE
                   MOVE "DBGET DCOMMENT 2 ERROR"  TO BU-DISPLAY-MSG
                   MOVE COND-WORD                 TO BU-DISPLAY-FLD (1)
                   PERFORM 92-BLOWUP.
           IF MCOMCOMMNT OF DCOMMENT-REC-I NOT = COMMENT-ARG
               GO TO 92-DONE-WRITE-COMMENT.

           IF EXP-PRT-FLAG  = "X"
               MOVE EXP-DATA-COMMENT  TO  COM-CONTENT-OUT
           ELSE
               IF COMP-PRT-FLAG  =  "X"
                   MOVE COMP-DATA-COMMENT  TO  COM-CONTENT-OUT
               ELSE
                   MOVE DCOM-DATA-LINE  TO  COM-CONTENT-OUT.

           WRITE PRINT-REC FROM DETAIL-LINE-1
                  AFTER ADVANCING 1 LINES.
           MOVE SPACES TO DETAIL-LINE-1.
           ADD  1  TO LINE-CTR.
           IF LINE-CTR > 60
               PERFORM 94-NEW-PAGE.
           GO TO 92-CONT-GET-DCOMMENT.

       92-DONE-WRITE-COMMENT.
           MOVE SPACES  TO  PRINT-LINE.
           WRITE PRINT-REC FROM PRINT-LINE AFTER ADVANCING 3 LINES.
           ADD  3 TO LINE-CTR.
           IF LINE-CTR > 55
               PERFORM 94-NEW-PAGE.


      *************************************************************
      *                    BLOWUP   ROUTINE                       *
      *************************************************************
       92-BLOWUP.
           WRITE PRINT-REC FROM NORMAL-PRINT AFTER ADVANCING 0.

           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
                 VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                 BU-DISPLAY-AREA.



       94-NEW-PAGE.
           MOVE SPACES                TO PRINT-LINE.
           ADD 1                      TO PAGE-NUM.
           MOVE "G O O D Y E A R   C O R P O R A T E   "
                                      TO HEAD1-TITLE1.
           MOVE " I N F O R M A T I O N   S Y S T E M"
                                      TO HEAD1-TITLE2.
           MOVE "PLANT "              TO HEAD1-PLANT.
           MOVE PLANT-NUMBER          TO HEAD1-PLANT-OUT.
           WRITE PRINT-REC FROM PRINT-LINE AFTER ADVANCING NEW-PAGE.
           MOVE SPACES                TO PRINT-LINE.
           MOVE 1                     TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-FORMATTED-TIME-OUT TO HEAD2-TIME.
           MOVE DATE-SLASH-OUT        TO HEAD2-DATE.
           MOVE "PAGE: "              TO HEAD2-PAGE.
           MOVE PAGE-NUM              TO HEAD2-PAGE-NO.
           MOVE "P U R C H A S E   O R D E R   " TO HEAD2-TITLE1.
           MOVE "S T A N D A R D   I N S T R U C T I O N S"
                                                 TO HEAD2-TITLE2.
           WRITE PRINT-REC FROM PRINT-LINE AFTER ADVANCING 2 LINES.
           WRITE PRINT-REC FROM DOT-LINE AFTER ADVANCING 1 LINES.
           WRITE PRINT-REC FROM FIELD-HEADING-1 AFTER ADVANCING 1.
           WRITE PRINT-REC FROM DOT-LINE AFTER ADVANCING 1 LINES.
           MOVE SPACES TO PRINT-REC.
           MOVE  10                    TO LINE-CTR.

       99-WRITE-RPT-EXIT.
           EXIT.

       9999-GETKEY-MPLTINFO-PK-I.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-I.
           READ MPLTINFO-PK-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET7 ERR 9999-DBGET7-MPLTINFO-PK-I"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 82-BLOWUP.
