       IDENTIFICATION DIVISION.
       PROGRAM-ID.    SINVPOIH.
       AUTHOR.        BK DISMUKES.

      *****************************************************************
      *     THIS SUBROUTINE IS A FRONT END TO PO INQUIRY FOR INVOICE
      *     PROCESSING AND PO BY VENDOR INQUIRY.  A SCREEN IS DISPLAYED
      *     WITH THE PASSED 'PO NUMBER' FROM THE CALLING PROGRAM AND
      *     THE USER HAS THE OPTION OF LOOKING AT THE HEADER OR ITEM
      *     DATA.
      *****************************************************************

      *****************************************************************
      **          M O D I F I C A T I O N    H I S T O R Y
      *****************************************************************
      *     08/10/2004    CA YODER
      *     ADDED LOGIC TO VALIDATE DPORECDH ENTRY BEFORE BRANCHING
      *     TO HEADER OR ITEM INQUIRIES.  OBSERVED MANY BLOWUPS
      *     OF MISSING DPORECD SEGMENTS IN TPOINQH AFTER A PO HAD
      *     BEEN DELETED.  IF THE PO IS VALIDATED FIRST HERE, IT MAY
      *     PREVENT BLOWUPS IN THIS INQUIRY.
      * ---------------------------------------------------------------
      *  MAR 10, 2005  D.RAUCH       DCR01    REQUEST# 2005-78515
      *     DISPLAY FILE PROCESSING CHANGED FROM USING ZCSISINQ
      *     NEW DISPLAY FILE ZSINVPOIH CREATED - FORMATS COPIED
      *     FROM ZCSISINQ.
      * ---------------------------------------------------------------
      *  MMM DD, CCYY  XXXNAMEXXX    XXX01    REQUEST# 2005-XXXXX
      *     XXXXXXXXXXXXXXXXXX DESC XXXXXXXXXXXXXXXXXXXXXXXXXXXXX
      *****************************************************************

004000 ENVIRONMENT DIVISION.
004100 CONFIGURATION SECTION.
004200 SOURCE-COMPUTER.    HP-3000.
004300 OBJECT-COMPUTER.    HP-3000.
004400
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

005600 INPUT-OUTPUT SECTION.
005700 FILE-CONTROL.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZSINVPOIH-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

           SELECT DPORECDH-I
                  ASSIGN TO DATABASE-MCFLST0301
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC            PIC X(2000).

       FD  DPORECDH-I
           LABEL RECORDS ARE STANDARD.
       01  DPORECDH-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLST0301.
004600
004700 WORKING-STORAGE SECTION.
004900 01  FORM-NAMES.
005000     05  REQUEST                  PIC X(6)     VALUE "FINVPO".
005100
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

005200 COPY TBLOWUP    IN COPYLIB.
005300
       COPY DBSTAT IN COPYLIB.

005400 01  BLOWUP-SW                 PIC X        VALUE SPACE.
005500
005600 01  MESSAGE-BUFFER.
005700     05  MSG-TEXT              PIC X(68)    VALUE SPACE.
005800     05  MSG-FLD               PIC X(8)     VALUE SPACE.
005900     05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC ZZZZZZZ9.
006000
006500 01  FIELD-NUMBER              PIC S9(4)    VALUE 1  COMP-4.
006600
       COPY CATREAD IN COPYLIB.

       COPY DISPDATA IN COPYLIB.

       COPY IOFEEDBACK IN COPYLIB.

       COPY JCWAREA IN COPYLIB.

006700 01  WHICH-LABELS              PIC S9(4)    VALUE 1  COMP-4.
006800
006900 01  LABEL-NUMBER              PIC S9(4)    VALUE 8  COMP-4.
007000
007100 01  NEXT-LABEL-NAME.
007200     05  FILLER                PIC X(16)
007300          VALUE " REVIEW NEXT PO ".
007400
007500 01  PREV-LABEL-NAME.
007600     05  FILLER                PIC X(16)
007700          VALUE "  PREV   SCREEN ".
007800
       COPY DPORECDH   IN COPYLIB.
008700
008800*************************************************************
008900**                                                         **
009000**           D A T A   E N T R Y   B U F F E R S           **
009100**                                                         **
009200*************************************************************
009300
009400 01  DE-BUFFER1.
009500     05  DE1-HIST-SEARCH       PIC X(35).
009500     05  DE1-POH-RLSE.
009600         10  DE1-POH           PIC X(7).
009700         10  DE1-RLSE          PIC X(3).
009800     05  DE1-ITEM-NUMBER       PIC X(4).
009900     05  DE1-CORPCODE          PIC X(7).
           05  DE1-COMMAND-LINE      PIC X(79).
           05  DE1-MESSAGE-LINE      PIC X(79).
010100
011000
011100 LINKAGE SECTION.
011200
011300 01  BASE                      PIC X(10).
011300 01  BASE-STHIST               PIC X(10).
011400
011500*************************************************************
011600**                                                         **
011700**      S C R E E N   P R I N T   P A R A M E T E R S      **
011800**                                                         **
011900*************************************************************
012000
012100 01  SCREEN-PRINT-PARMS.
012200     05  PRINT-CTL             PIC S9(4)    COMP-4.
012300     05  PAGE-CTL              PIC S9(4)    COMP-4.
012400     05  SPOOLFIL-OPEN-SW      PIC X.
012500
012600 01  PASS-SPOOL-PRT-NO         PIC S9(2)    COMP-4.
012700
012800
012900*************************************************************
013000**                                                         **
013100**      V I E W   C O M M U N I C A T I O N   A R E A      **
013200**                                                         **
013300*************************************************************
013400
       COPY VCOMLINK IN COPYLIB.
018000
018100
018200*************************************************************
018300**                                                         **
018400**           D A T A B A S E   W O R K   A R E A           **
018500**                                                         **
018600*************************************************************
018700
018800 01  MAIN-ARGUMENT-VALUES.
018900     05  PLT-ARG                PIC X(4).
019000     05  POH-ARG.
019200         10  A-POH-NO           PIC X(7).
019300         10  A-POH-RLSE         PIC X(3).
019400         10  A-POH-RCV          PIC X(3).
019100         10  FILLER             PIC X.
019500     05  VEN-ARG.
019600         10  VEN-ARG1-7         PIC X(7).
019700         10  VEN-ARG8-10        PIC X(3).
019800     05  REQ-ARG                PIC X(12).
019900
020000 01  SAVE-POINQ-AREA.
020100     05  SAVE-COMPANY           PIC X(3).
020200     05  SAVE-ITEM-NUMBER       PIC X(4).
020300     05  SAVE-CORPCODE          PIC X(7).
020400     05  SAVE-POH-COUNT         PIC 9(2).
020500
020600 COPY LANGSUB    IN COPYLIB.
020700
020800 01  FORMFILE                   PIC X(36).
020900
021000
021100 PROCEDURE DIVISION USING  BASE,
                                 BASE-STHIST,
021200                           SCREEN-PRINT-PARMS,
021300                           PASS-SPOOL-PRT-NO,
021400                           VIEW-COMAREA,
021500                           MAIN-ARGUMENT-VALUES,
021600                           SAVE-POINQ-AREA,
021700                           LANGUAGE-PARMS,
021800                           FORMFILE.
021900 POH-INQUIRY SECTION 01.
       BEGIN-HERE.
022100     PERFORM 1-HSK  THRU  1-HSK-X.
022200
022300     PERFORM  6-POH-REQUEST  THRU  6-POH-REQUEST-X.
022400
           CLOSE DISPLAY-FILE, DPORECDH-I.

022500     GOBACK.
022600
022700 1-HSK.
           OPEN I-O DISPLAY-FILE,
                INPUT DPORECDH-I.
023600
100000*******************************************************
100100**   SET PRICE JCW TO 1 SO PRICE IS DISPLAYED
100200**   THE PRICE JCW IS LOCATED IN POSITION 258
      **   THIS IS DONE TEMPORARILY SINCE THE SETJCW CONCEPT
      **   ON THE HP3000 IS NOT IMPLEMENTED AT THE MENU
      **   LEVEL ON THE AS/400.
100600*******************************************************
100700
100800     MOVE "1"      TO SETJCW-VALUE.
           MOVE 258      TO SETJCW-STARTING-POS.
           MOVE 1        TO SETJCW-LENGTH.
           CALL "SETJCW" USING SETJCW-VALUE,
                               SETJCW-STARTING-POS,
                               SETJCW-LENGTH,
                               SETJCW-STATUS.
           IF SETJCW-STATUS NOT = "00"
               MOVE "SETJCW ERROR" TO BU-DISPLAY-MSG
               MOVE SETJCW-STATUS TO BU-DISPLAY-FLD (1)
               PERFORM 990-BLOWUP THRU 999-EXIT.

023700 1-HSK-X.
023800     EXIT.
023900
024000
024100
024200 6-POH-REQUEST.
024800     MOVE REQUEST     TO  VIEW-NFNAME.
026300
028100     MOVE SPACE       TO  DE-BUFFER1.
028100     MOVE "+++ SEARCHING HISTORY DATABASE +++"
028100                      TO  DE1-HIST-SEARCH.
028200     MOVE A-POH-NO    TO  DE1-POH.
028300     MOVE A-POH-RLSE  TO  DE1-RLSE.
           MOVE ZEROS       TO  DE1-ITEM-NUMBER.
028400
      **********************************************************
      *   THE FOLLOWING CODE INVOLVING CHANGING THE FUNCTION   *
      *   KEY LABELS WAS COMMENTED OUT SINCE THIS LOGIC        *
      *   DIDNT DO ANYTHING IN THE HP WORLD EITHER.            *
      *   SAVE-PO-COUNT WAS ALWAYS LESS THAN 2 THEREFORE THE   *
      *   'PREV SCREEN' LABEL IS ALWAYS SET!                   *
      **********************************************************
029200*--- IF SAVE-POH-COUNT LESS THAN 2
029300*---     CALL "VSETKEYLABEL" USING  VIEW-COMAREA,
029400*---                                WHICH-LABELS,
029500*---                                LABEL-NUMBER,
029600*---                                PREV-LABEL-NAME,
029700*---     IF VIEW-STATUS EQUAL ZERO
029800*---         NEXT SENTENCE
029900*---     ELSE
030000*---         MOVE "TINVPOI VSETKEYLABELE"  TO  BU-DISPLAY-MSG
030100*---         PERFORM 990-BLOWUP THRU 999-EXIT
030200*--- ELSE
030300*---     CALL "VSETKEYLABEL" USING  VIEW-COMAREA,
030400*---                                WHICH-LABELS,
030500*---                                LABEL-NUMBER,
030600*---                                NEXT-LABEL-NAME,
030700*---     IF VIEW-STATUS NOT EQUAL ZERO
030800*---         MOVE "TINVPOI VSETKEYLABELN"  TO  BU-DISPLAY-MSG
030900*---         PERFORM 990-BLOWUP THRU 999-EXIT.
031000
031100 6-PROCESS-FORM1.
           MOVE DE-BUFFER1     TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC    TO DE-BUFFER1.
033500
033600     IF VIEW-LASTKEY EQUAL 3
033700         GO TO  6-POH-REQUEST-X.
035000
035100     IF VIEW-LASTKEY EQUAL 1  OR
035200        VIEW-LASTKEY EQUAL 2  OR
035300        VIEW-LASTKEY EQUAL 4  OR
035400        VIEW-LASTKEY EQUAL 5  OR
035500        VIEW-LASTKEY EQUAL 6  OR
035600        VIEW-LASTKEY EQUAL 7  OR
              VIEW-LASTKEY EQUAL 8
035700         MOVE 3  TO  FIELD-NUMBER
035800*        ***  INVALID FUNCTION KEY ENTERED  ***
035900         MOVE   9 TO LANG-SETNUM
036000         MOVE  10 TO LANG-MSGNUM
036100         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
036200         PERFORM  72-PGM-ERROR  THRU  72-PGM-ERROR-X
036300         GO TO  6-PROCESS-FORM1.

           IF DE1-ITEM-NUMBER = ZEROS
               NEXT SENTENCE
           ELSE
           IF DE1-CORPCODE NOT = SPACES
      *         CHOOSE ONLY ONE FIELD ITEM NUMBER OR CORP CODE
076900         MOVE 66128  TO CATREAD-MSG-NUMBER
077100         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
077200         MOVE 3  TO  FIELD-NUMBER
036200         PERFORM  72-PGM-ERROR  THRU  72-PGM-ERROR-X
036300         GO TO  6-PROCESS-FORM1.
039300
           MOVE POH-ARG TO PORCVNO OF DPORECDH-REC-I.
           START DPORECDH-I KEY = PORCVNO OF DPORECDH-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
      *         PURCHASE ORDER DOES NOT EXIST
               MOVE 16045  TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 3  TO  FIELD-NUMBER
               PERFORM  72-PGM-ERROR  THRU  72-PGM-ERROR-X
               GO TO  6-PROCESS-FORM1.

           MOVE DE1-ITEM-NUMBER       TO  SAVE-ITEM-NUMBER.
           MOVE DE1-CORPCODE          TO  SAVE-CORPCODE.
041600
041700 6-POH-HEADER-SUBPGM.
041800     IF SAVE-ITEM-NUMBER EQUAL ZERO   AND
041900        SAVE-CORPCODE EQUAL SPACE
042000         CALL "SPOINQHH" USING  BASE,
                                      BASE-STHIST,
042100                                SCREEN-PRINT-PARMS,
042200                                PASS-SPOOL-PRT-NO,
042300                                VIEW-COMAREA,
042400                                MAIN-ARGUMENT-VALUES,
042500                                SAVE-POINQ-AREA,
042600                                LANGUAGE-PARMS
042700         IF VIEW-LASTKEY EQUAL 2
042800             CALL "SPOINQIH" USING  BASE,
                                          BASE-STHIST,
042900                                    SCREEN-PRINT-PARMS,
043000                                    PASS-SPOOL-PRT-NO,
043100                                    VIEW-COMAREA,
043200                                    MAIN-ARGUMENT-VALUES,
043300                                    SAVE-POINQ-AREA,
043400                                    LANGUAGE-PARMS
043500             IF VIEW-LASTKEY EQUAL 1
043600                 GO TO  6-POH-HEADER-SUBPGM
043700             ELSE
043800                 NEXT SENTENCE
043900         ELSE
044000             NEXT SENTENCE
044100     ELSE
044200         CALL "SPOINQIH" USING  BASE,
                                      BASE-STHIST,
044300                                SCREEN-PRINT-PARMS,
044400                                PASS-SPOOL-PRT-NO,
044500                                VIEW-COMAREA,
044600                                MAIN-ARGUMENT-VALUES,
044700                                SAVE-POINQ-AREA,
044800                                LANGUAGE-PARMS,
044900         IF VIEW-LASTKEY EQUAL 1
045000             CALL "SPOINQHH" USING  BASE,
                                          BASE-STHIST,
045100                                    SCREEN-PRINT-PARMS,
045200                                    PASS-SPOOL-PRT-NO,
045300                                    VIEW-COMAREA,
045400                                    MAIN-ARGUMENT-VALUES,
045500                                    SAVE-POINQ-AREA,
045600                                    LANGUAGE-PARMS
045700             IF VIEW-LASTKEY EQUAL 2
045800                 GO TO  6-POH-HEADER-SUBPGM.
047300
047400 6-POH-REQUEST-X.
047500     EXIT.
052300
052400 72-PGM-ERROR.
           MOVE B"1" TO IND(FIELD-NUMBER), IND(99).
           MOVE MESSAGE-BUFFER  TO DE1-MESSAGE-LINE.
053900
054000 72-PGM-ERROR-X.
054100     EXIT.

       COPY DISPCALL IN COPYLIB.
054200
057800************************************************************
057900************************************************************
058000*                    B L O W U P                           *
058100*     CHECK FOR IMAGE, VIEW, OR SPOOL ERROR.  CLOSE        *
058200*     FILES, GET OUT OF BLOCK MODE, AND DISPLAY            *
058300*     APPROPRIATE ERROR MESSAGE ON SCREEN.                 *
058400*                                                          *
058500*     ALSO APPENDS THE ERROR MESSAGE TO A FILE CALLED      *
058600*     BLOWUP.PUB.  TO READ THIS FILE, RUN "XBLPRT.OBJECT". *
058700*                                                          *
058800*         |||  PROGRAM IS ABORTED IN TBLOWUP  |||          *
058900************************************************************
059000************************************************************
059100 990-BLOWUP.
059200     MOVE VEN-ARG TO BU-DISPLAY-FLD (1).
059300     MOVE POH-ARG TO BU-DISPLAY-FLD (2).
059400     MOVE REQ-ARG TO BU-DISPLAY-FLD (3).
059500     MOVE "SINVPOIH"        TO  BU-PGM-NAME.
059600     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
059700           VIEW-COMAREA, DISPLAY-STATUS,  BU-DISPLAY-MSG,
059800           BU-DISPLAY-FLDS.
059900 999-EXIT.  EXIT.
060000
060100 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
061700 999-CATREAD-EXIT.
061800     EXIT.
