000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    SINVPOBH.
000400 AUTHOR.        BK DISMUKES.
000600 INSTALLATION.  GOODYEAR TIRE AND RUBBER CO.
000500 DATE-WRITTEN.  MARCH 19, 1993
000700
000800*REMARKS.       HIST PO INQUIRY BY VENDOR CODE.
000900
001000*D     THIS SUBROUTINE DISPLAYS A LIST OF PURCHASE ORDERS BY
001100*D     A SPECIFIED VENDOR AND SHOWS 10 PURCHASE ORDERS PER
001200*D     SCREEN DISPLAY.  IF A USER WISHES TO SEE A SPECIFIC
001300*D     PURCHASE ORDER THIS SUBROUTINE IN TURN CALLS POINQ
001400*D     WHICH CALLS THE POINQ SUBROUTINES (POINQHH OR POINQIH).
001500*D     THIS SUBROUTINE IS CALLED BY INVOICE CREATE AND PO
001600*D     INQUIRY BY VENDOR CODE.

      *C 02/21/94  JEFF BUNGO   REQ #6449
      *C     ADDED NEW FIELDS TO THE HISTORY DATABASE TO MATCH
      *C     THE LIVE DATABASES.  CHANGED/RECOMPILED THIS PROGRAM
      *C     TO USE THE NEW FIELDS.
      *C
      *C 02/20/1995   CA ZUBEK      REQ #95-002
      *C     ADDED CAPABILITY TO VIEW PO'S IN DESCENDING DATE ORDER.
      *C     ALSO ADDED DATE OF PO FIELD TO SCREEN.
      *C
      *C 07/22/1996   CA YODER
      *C     MODIFIED PROGRAM FOR CENTURY DATABASE CHANGES.
      *C
003300
003400 ENVIRONMENT DIVISION.
003500 CONFIGURATION SECTION.
003600 SOURCE-COMPUTER.    IBM-AS400.
003700 OBJECT-COMPUTER.    IBM-AS400.
       SPECIAL-NAMES.  I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZINVPOBV-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS DYNAMIC
                  RELATIVE KEY IS RELATIVE-RECNO
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

            SELECT DPORECDH-I
              ASSIGN TO DATABASE-MCFLST0302
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
003600 FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC          PIC X(2000).
003700
       FD  DPORECDH-I
           LABEL RECORDS ARE STANDARD.
       01  DPORECDH-REC-I.
           COPY DDS-MCRPST0300  OF MCFLST0302.
003300 WORKING-STORAGE SECTION.
003400************************************************************
003500*            W O R K I N G   S T O R A G E                 *
003600************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1      PIC X.
           05  FILE-STATUS-2      PIC X.
       01  RELATIVE-RECNO         PIC 9(9).
005300
005400 01  POH-WORK-AREA.
005600     05  POH-NO                PIC X(7).
005700     05  POH-RLSE              PIC X(3).
005800     05     FILLER             PIC X(3).
005500     05     FILLER             PIC X.
005800*---------- VSETERROR AND VPUTWINDOW
005900 01  MESSAGE-BUFFER            PIC X(76)    VALUE SPACES.
006000 01  MESSAGE-BUFFER-RD REDEFINES MESSAGE-BUFFER.
006100     05  MSG-BUFFER            PIC X(68).
006200     05  MSG-VALUE             PIC X(8).
006300 01  MESSAGE-BUFLEN            PIC S9(4)    VALUE 76 COMP-4.
006400 01  MESSAGE-ACTLEN            PIC S9(4)    VALUE 0  COMP-4.
006500 01  FIELD-NUMBER              PIC S9(4)    VALUE 1  COMP-4.
006600
       01  DATE-OUT-HOLD.
           05  DATE-OUT-MD           PIC X(2).
           05  DATE-OUT-DM           PIC X(2).
           05  DATE-OUT-YY           PIC X(2).

       01  HOLD-POH-DATE             PIC 9(8).

       01  HOLD-POH-DATE-2  REDEFINES  HOLD-POH-DATE.
           05  POH-DATE-CC           PIC 9(2).
           05  POH-DATE-YMD.
               10  POH-DATE-YY       PIC 9(2).
               10  POH-DATE-MM       PIC 9(2).
               10  POH-DATE-DD       PIC 9(2).

       01  DISPLAY-DATE              PIC 9(6).

9502CZ COPY TDATECHK OF COPYLIB.
       COPY CATREAD OF COPYLIB.
006000 COPY TBLOWUP IN COPYLIB.
006900
007000 01  FORM-NAMES.
007100     05  POBYVENDOR            PIC X(7)     VALUE "FINVPBV".
008300

      *------ WS CONTROL AREA
       01  MAJOR-MINOR                 PIC XXXX.
       01  WS-CONTROL.
           02  FUNCTION-NUM            PIC XX.
                   88  EXIT-KEY-F8-USED                     VALUE "08". LVW000LS
                   88  REFRESH-KEY-F4-USED                  VALUE "04". LVW000LS
                   88  ENTER-KEY-USED                       VALUE "00". LVW000LS
                   88  F1-KEY-USED                          VALUE "01". LVW000LS
                   88  F2-KEY-USED                          VALUE "02". LVW000LS
                   88  F3-KEY-USED                          VALUE "03". LVW000LS
                   88  F4-KEY-USED                          VALUE "04". LVW000LS
                   88  F5-KEY-USED                          VALUE "05". LVW000LS
                   88  F6-KEY-USED                          VALUE "06". LVW000LS
                   88  F7-KEY-USED                          VALUE "07". LVW000LS
                   88  F8-KEY-USED                          VALUE "08". LVW000LS
           02 FUN-KEY REDEFINES FUNCTION-NUM PIC XX.
           02 TERMINAL-ID PIC X(10).
           02 FORMAT-NAME PIC X(10).

       01  DISPLAY-STATUS              PIC X(2).

       01  SRF-INDICATORS.
           05  IND OCCURS 99 TIMES   PIC 1 INDICATOR 01.

       COPY IOFEEDBACK OF COPYLIB.
010600
011500 01  TABLE-CONSTRAINTS.
011600     05  NUM-CODES-PER-SCREEN      PIC 9(2) VALUE 10.
011700     05  LINES-DESC-PER-CODE       PIC 9(1) VALUE 1.

011100*************************************************************
011200**                                                         **
011300**           D A T A   E N T R Y   B U F F E R S           **
011400**                                                         **
011500*************************************************************
       01  SUBFILE-CONTROL.
011800     05  DE1-VENDOR-CODE.
011900         10  DE1-VENDOR1-7     PIC X(7).
012000         10  DE1-VENDOR8-10    PIC X(3).
012100     05  DE1-VENDOR-DATA  OCCURS  2  TIMES
012200                               PIC X(44).
           05  DE1-BUYER             PIC X(4).
       01  DE-SUBFILE.
012300     05  DE1-SELECT-TABLE.
012400         10  DE1-SELECT-POH-RLSE.
012500             15  DE1-SELECT-BYTE    PIC X.
012600             15  DE1-POH-RLSE.
012700                 20  DE1-POH        PIC X(7).
012800                 20  DE1-HYPHEN     PIC X.
012900                 20  DE1-RLSE       PIC X(3).
                   15  DE1-DATE.
                       20  DE1-MD         PIC X(2).
                       20  DE1-DTE-SLASH1 PIC X(1).
                       20  DE1-DM         PIC X(2).
                       20  DE1-DTE-SLASH2 PIC X(1).
                       20  DE1-CC         PIC X(2).
                       20  DE1-YY         PIC X(2).
                   15  DE1-BUYER-NAME     PIC X(15).
                   15  DE1-INHIST-FLAG    PIC X(19).
013000
013800 COPY DBSTAT IN COPYLIB.
014500
015100 01  BUILD-POH-KEY-VALUE.
015300     05  B-POH-NO               PIC X(7)     VALUE SPACE.
015400     05  B-POH-RLSE             PIC X(3)     VALUE SPACE.
015500     05  B-POH-RCV              PIC X(3)     VALUE ZERO.
015200     05     FILLER              PIC X        VALUE SPACES.
015600
016100 01  SAVE-MAIN-POH-ARG          PIC X(14)    VALUE SPACE.
016900 COPY DPORECDH IN COPYLIB.
017000
017100 LINKAGE SECTION.
017200
017300 01  BASE                      PIC X(10).
017300 01  BASE-STHIST               PIC X(10).
017400*************************************************************
017500**                                                         **
017600**      S C R E E N   P R I N T   P A R A M E T E R S      **
017700**                                                         **
017800*************************************************************
017900
018000 01  SCREEN-PRINT-PARMS.
018100     05  PRINT-CTL             PIC S9(4)    COMP-4.
018200     05  PAGE-CTL              PIC S9(4)    COMP-4.
018300     05  SPOOLFIL-OPEN-SW      PIC X.
018400
018500 01  PASS-SPOOL-PRT-NO         PIC S9(2)    COMP-4.
018600
018700 COPY VCOMLINK IN COPYLIB.
018800
018900*************************************************************
019000**                                                         **
019100**           D A T A B A S E   W O R K   A R E A           **
019200**                                                         **
019300*************************************************************
019400
019500 01  MAIN-ARGUMENT-VALUES.
019600     05  PLT-ARG               PIC X(4).
019700     05  POH-ARG               PIC X(14).
019800     05  VEN-ARG.
019900         10  VEN-ARG1-7        PIC X(7).
020000         10  VEN-ARG8-10       PIC X(3).
020100     05  REQ-ARG               PIC X(12).
020200
020300 01  SAVE-POINQ-AREA.
020400     05  SAVE-COMPANY          PIC X(3).
020500     05  SAVE-ITEM-NUMBER      PIC X(4).
020600     05  SAVE-CORPCODE         PIC X(7).
020700     05  SAVE-POH-COUNT        PIC 9(2).
020800
020900 01  SAVE-POBV-AREA.
021000     05  SAVE-POH-VENDOR        PIC X(10).
021100     05  SAVE-POH-VENDOR-NAME   PIC X(44).
021200     05  SAVE-POH-VENDOR-CSZ    PIC X(44).
021300
021400
021500 COPY LANGSUB IN COPYLIB.
021600
021700 01  FORMFILE                  PIC X(36).

       01  PASS-BUYER                PIC X(4).
021800
021900 PROCEDURE DIVISION USING  BASE,
                                 BASE-STHIST,
022000                           SCREEN-PRINT-PARMS,
022100                           PASS-SPOOL-PRT-NO,
022200                           VIEW-COMAREA,
022300                           MAIN-ARGUMENT-VALUES,
022400                           SAVE-POINQ-AREA,
022500                           SAVE-POBV-AREA,
022600                           LANGUAGE-PARMS,
022700                           FORMFILE,
                                 PASS-BUYER.
022800
022900 POH-BY-VENDOR.
023000
           OPEN INPUT DPORECDH-I.
           OPEN I-O   DISPLAY-FILE.
           MOVE ALL B"0" TO SRF-INDICATORS.
           MOVE SPACES TO DE-SUBFILE
                          SUBFILE-CONTROL.
023100     PERFORM  6-SHOW-POS-BY-VENDOR  THRU
023200              6-SHOW-POS-BY-VENDOR-X.
           CLOSE DPORECDH-I, DISPLAY-FILE.
023300     GOBACK.
023400
023500
023600************************************************************
023700************************************************************
023800*                    B L O W U P                           *
023900*     CHECK FOR IMAGE, VIEW, OR SPOOL ERROR.  CLOSE        *
024000*     FILES, GET OUT OF BLOCK MODE, AND DISPLAY            *
024100*     APPROPRIATE ERROR MESSAGE ON SCREEN.                 *
024200*                                                          *
024300*     ALSO APPENDS THE ERROR MESSAGE TO A FILE CALLED      *
024400*     BLOWUP.PUB.  TO READ THIS FILE, RUN "XBLPRT.OBJECT". *
024500*                                                          *
024600*         |||  PROGRAM IS ABORTED IN TBLOWUP  |||          *
024700************************************************************
024800************************************************************
024900 2-BLOWUP.
           MOVE "SINVPOBH" TO BU-PGM-NAME.
025000     MOVE VEN-ARG TO BU-DISPLAY-FLD (1).
025100     MOVE POH-ARG TO BU-DISPLAY-FLD (2).
025200     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
025300           VIEW-COMAREA, FILE-STATUS,  BU-DISPLAY-MSG,
025400           BU-DISPLAY-FLDS.
025500
025600 2-BLOWUP-X.
025700     EXIT.
025800
025900 6-SHOW-POS-BY-VENDOR.
           MOVE VEN-ARG TO VENCDE OF DPORECDH-REC-I.
           START DPORECDH-I KEY = VENCDE OF DPORECDH-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
027600             MOVE SPACES               TO  SUBFILE-CONTROL
027700             MOVE VEN-ARG1-7           TO  DE1-VENDOR1-7
027800             MOVE VEN-ARG8-10          TO  DE1-VENDOR8-10
027900             MOVE SAVE-POH-VENDOR-NAME  TO  DE1-VENDOR-DATA (1)
028000             MOVE SAVE-POH-VENDOR-CSZ   TO  DE1-VENDOR-DATA (2)
                   IF PASS-BUYER = SPACES
                       MOVE B"1" TO IND(1)
                       MOVE SPACES TO DE1-BUYER
                   ELSE
                       MOVE PASS-BUYER TO DE1-BUYER
                   END-IF
                   PERFORM 810-CLEAR-SUBFILE THRU 819-EXIT
                   MOVE 0 TO RELATIVE-RECNO
028300     ELSE
028400         MOVE "START DPORECD6-SPBV"  TO  BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

031500 6-LOAD-POS.
           MOVE 0 TO COND-WORD.
           READ DPORECDH-I NEXT INTO BUF-DPORECD-H
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                  MOVE 15 TO COND-WORD
               ELSE
                  MOVE 99 TO COND-WORD.
           IF VENCDE OF DPORECDH-REC-I NOT = VEN-ARG
034800         MOVE 15 TO COND-WORD.
032600
           IF COND-WORD = 0
              IF PASS-BUYER NOT = SPACES
                  IF POH-BUYER-CODE NOT = PASS-BUYER
                      GO TO 6-LOAD-POS
                  END-IF
              END-IF
033500        MOVE POH-RCV-NO TO  POH-WORK-AREA
034000        MOVE POH-NO     TO  DE1-POH
034100        MOVE "-"        TO  DE1-HYPHEN
034200        MOVE POH-RLSE   TO  DE1-RLSE
              MOVE SPACE      TO  DE1-SELECT-BYTE
              MOVE "IN HISTORY DATABASE"
                              TO  DE1-INHIST-FLAG
              MOVE 4          TO DATE-MODE
              MOVE POH-DATE   TO HOLD-POH-DATE
      *------------ SUBTRACT 19M OR 20M BEFORE DATE REFORMAT.
              IF POH-DATE-YY > 70
                  COMPUTE DISPLAY-DATE = POH-DATE - 19000000
              ELSE
                  COMPUTE DISPLAY-DATE = POH-DATE - 20000000
              END-IF
              MOVE DISPLAY-DATE  TO DATE-VALIDATE-IN
              CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
              MOVE DATE-OUT   TO DATE-OUT-HOLD
              MOVE DATE-OUT-MD  TO DE1-MD
              MOVE DATE-OUT-DM  TO DE1-DM
              MOVE DATE-OUT-YY  TO DE1-YY
      *------------ ACCOUNT FOR CENTURY.
              IF DATE-OUT-YY > "70"
                  MOVE "19"     TO DE1-CC
              ELSE
                  MOVE "20"     TO DE1-CC
              END-IF
              MOVE "/" TO DE1-DTE-SLASH1  DE1-DTE-SLASH2
              IF PASS-BUYER = SPACES
                 MOVE POH-BUYER TO DE1-BUYER-NAME
              ELSE
                 MOVE SPACES TO DE1-BUYER-NAME
              END-IF
              MOVE DE-SUBFILE TO DISPLAY-REC
              ADD 1 TO RELATIVE-RECNO
              WRITE SUBFILE DISPLAY-REC FORMAT "RDSF"
                    INDICATORS SRF-INDICATORS
034300        GO TO  6-LOAD-POS.

           IF RELATIVE-RECNO = ZERO
               MOVE "NO ORDERS FOR BUYER" TO DE1-INHIST-FLAG
               MOVE DE-SUBFILE TO DISPLAY-REC
               ADD 1 TO RELATIVE-RECNO
               WRITE SUBFILE DISPLAY-REC FORMAT "RDSF"
                    INDICATORS SRF-INDICATORS.
035400
035500 6-INITIATE-FORM1.
035600     MOVE POBYVENDOR  TO  VIEW-NFNAME.
043500
043600 6-SHOW-FORM1.
           WRITE DISPLAY-REC FORMAT "RDSB" INDICATORS SRF-INDICATORS.
           MOVE B"1" TO IND(76).
           IF RELATIVE-RECNO > ZERO
              MOVE B"1" TO IND(75)
           ELSE
              MOVE B"0" TO IND(75).
           MOVE SUBFILE-CONTROL TO DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT "RDSC" INDICATORS SRF-INDICATORS.
           READ DISPLAY-FILE FORMAT "RDSC" INDICATORS SRF-INDICATORS.

038800 145-INQUIRE-DATA-ENTRY.
           READ SUBFILE DISPLAY-FILE NEXT MODIFIED RECORD
                FORMAT "RDSF" INDICATORS SRF-INDICATORS
                AT END GO TO 6-SHOW-POS-BY-VENDOR-X.
           IF DISPLAY-STATUS NOT = "00"
              GO TO 6-SHOW-FORM1.
           MOVE DISPLAY-REC TO DE-SUBFILE.
040100     IF DE1-SELECT-BYTE = "X" AND DE1-POH-RLSE > SPACES
              NEXT SENTENCE
           ELSE
              GO TO 145-INQUIRE-DATA-ENTRY.

           MOVE SPACES TO DE1-SELECT-BYTE.
           MOVE DE-SUBFILE TO DISPLAY-REC.
           REWRITE SUBFILE DISPLAY-REC FORMAT "RDSF"
              INDICATORS SRF-INDICATORS.

056400             MOVE POH-ARG              TO  SAVE-MAIN-POH-ARG
056500             MOVE SPACE                TO  BUILD-POH-KEY-VALUE
056700             MOVE DE1-POH              TO  B-POH-NO
056800             MOVE DE1-RLSE             TO  B-POH-RLSE
056900             MOVE ZERO                 TO  B-POH-RCV
057000             MOVE BUILD-POH-KEY-VALUE  TO  POH-ARG
057100             CALL "SINVPOIH" USING  BASE,
                                          BASE-STHIST,
057200                                    SCREEN-PRINT-PARMS,
057300                                    PASS-SPOOL-PRT-NO,
057400                                    VIEW-COMAREA,
057500                                    MAIN-ARGUMENT-VALUES,
057600                                    SAVE-POINQ-AREA,
057700                                    LANGUAGE-PARMS,
057800                                    FORMFILE
057900             MOVE SAVE-MAIN-POH-ARG  TO  POH-ARG
058000             SUBTRACT 1  FROM  SAVE-POH-COUNT
058200             GO TO 145-INQUIRE-DATA-ENTRY.
           GO TO 6-SHOW-FORM1.
041400
058400 6-SHOW-POS-BY-VENDOR-X.
058500     EXIT.

       810-CLEAR-SUBFILE.
           MOVE B"0" TO IND (75), IND (76).
           MOVE B"1" TO IND (77).
           MOVE SUBFILE-CONTROL TO DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT "RDSC" INDICATORS SRF-INDICATORS.
           MOVE B"0" TO IND (77).
           MOVE ZERO TO RELATIVE-RECNO.
       819-EXIT.  EXIT.
066500
066600 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
068200 999-CATREAD-EXIT.
068300     EXIT.
