       IDENTIFICATION DIVISION.
       PROGRAM-ID.    SINVINQS.
       AUTHOR.        A. TREUDLER/FRED HAYNES.
       INSTALLATION.  GOODYEAR TIRE AND RUBBER CO.
       DATE-WRITTEN.  SEPT. 27, 1984.

      *REMARKS.       INVOICE INQUIRY.
      *D* *  * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *D*                                                          *
      *D* S I N V I N Q S                                  AQ1     *
      *D*  THIS PROGRAM IS THE INVOICE INQUIRY PROGRAM.            *
      *D*  THIS SUBPROGRAM BRINGS UP THE INITIAL REQUEST SCREEN.   *
      *D*  THE USER CAN INQUIRE BY :  1) REGISTER NO.              *
      *D*                             2) REGISTER AND ITEM NO.     *
      *D*                             3) INVOICE NUMBER            *
      *D*                             4) PO NUMBER                 *
      *D*                             5) VENDOR CODE               *
      *D*                                                          *
      *D* N O T E    T H I S   S U B R O U T I N E                 *
      *D*       C A L L S :                                        *
      *D*          1) SINVINQH.SOURCE - INQUIRE AGAINST HEADER     *
      *D*                               DATA.                      *
      *D*          2) SINVINQI.SOURCE - INQUIRE AGAINST ITEMS      *
      *D*                                                          *
      *D* *  * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *C*
      *C* CHANGES
      *C* JUNE 1992  CR KALMAN
      *C* ADDED A 3 CHAR FIELD TO INQ-2 FOR RECEIVER. THIS IS
      *C* NEEDED FOR THE INVOICELESS PO PROJECT. IT LETS THE USER
      *C* KNOW WHAT RECEIVER THE AUTOMATIC INVOICE WAS GENERATED
      *C* FROM.
      *C
      *C  02/21/94   JS BUNGO   #6449
      *C     RECOMPILED TO PICKUP ADDITIONAL FIELDS ADDED TO
      *C     DPORECD HISTORY FILE.  THESE FIELDS WERE ADDED SO
      *C     HISTORY FILES MATCH LIVE FILES.
      *C
      *C  02/06/95   CA ZUBEK
      *C     CHANGED THE FUNCTION KEY LOGIC TO TREAT THE ENTER KEY
      *C     THE SAME AS THE F1 KEY.  IT WILL NOW GO TO THE HEADER
      *C     DATA SCREEN INSTEAD OF DISPLAYING AN ERROR.
      *C
      *C     5/03/95  WILL MCINTYRE   REQUEST #95-007
      *C     ADDED CALL TO TALTVENK TO ALLOW USER TO ENTER AN
      *C     ALTERNATE KEY, AND HAVE THE LINKED VENDOR CODE
      *C     SUBSTITUTED IN THE ALTERNATE KEY'S PLACE.
      *C
      *C  11/22/95    CA YODER
      *C     ADDED LOGIC TO ALWAYS DISPLAY CANADIAN CURRENCY CODE
      *C     FOR DUTY INVOICES.  THE PO CURRENCY CODE IS USED
      *C     FOR THIS FIELD, BUT DUTY INVOICES ARE ALWAYS IN
      *C     CANADIAN CURRENCY.
      *C
      *C  05/07/96    CA YODER     REQ #94-005
      *C     ADDED CODE TO CHECK FOR THE INVOICE CURRENCY CODE AND
      *C     DISPLAY IT ON THE SCREEN.  IF THERE IS NO INVOICE
      *C     CURRENCY CODE, JUST USE THE PO CURRENCY AS BEFORE.
      *C
      *C  06/19/96    CA YODER
      *C     RE-COMPILED TO PICK UP CENTURY DATABASE CHANGES.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.    IBM-AS400.
       OBJECT-COMPUTER.    IBM-AS400.
       SPECIAL-NAMES.
           I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZINVINQ-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

           SELECT DINVRCD-I-REG
                  ASSIGN TO DATABASE-MCFLCS2501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DINVRCD-I-PO
                  ASSIGN TO DATABASE-MCFLCS2502
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DINVRCD-I-VEN
                  ASSIGN TO DATABASE-MCFLCS2503
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DINVRCD-I-INV
                  ASSIGN TO DATABASE-MCFLCS2504
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DINVRCDH-I-REG
                  ASSIGN TO DATABASE-MCFLST0801
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DINVRCDH-I-PO
                  ASSIGN TO DATABASE-MCFLST0802
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DINVRCDH-I-VEN
                  ASSIGN TO DATABASE-MCFLST0803
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DINVRCDH-I-INV
                  ASSIGN TO DATABASE-MCFLST0804
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPORECD-I
                  ASSIGN TO DATABASE-MCFLCS0901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPORECDH-I
                  ASSIGN TO DATABASE-MCFLST0301
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DVENDOR-I
                  ASSIGN TO DATABASE-MCFLCS0701
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DVENDORH-I
                  ASSIGN TO DATABASE-MCFLST0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT MPORCV-I
                  ASSIGN TO DATABASE-MCFLCS0101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DPOITEM-I
                  ASSIGN TO DATABASE-MCFLCS1002
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-I
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MVALIDUM-I
                  ASSIGN TO DATABASE-MCFLCS0401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DPOITEMH-I
                  ASSIGN TO DATABASE-MCFLST0401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPODATAITM-I
                  ASSIGN TO DATABASE-MCFLCS1101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPODESCH-I
                  ASSIGN TO DATABASE-MCFLST0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DREQD-I
                  ASSIGN TO DATABASE-MCFLCS2102
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPOFREIGHT-I
                  ASSIGN TO DATABASE-MCFLCS2404
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPOFREIGHTH-I
                  ASSIGN TO DATABASE-MCFLST0702
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DRCVITEM-I
                  ASSIGN TO DATABASE-MCFLCS1201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DRCVITEMH-I
                  ASSIGN TO DATABASE-MCFLST0601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DINVITM-I
                  ASSIGN TO DATABASE-MCFLCS2601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DINVITMH-I
                  ASSIGN TO DATABASE-MCFLST0901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DINVACCT-I
                  ASSIGN TO DATABASE-MCFLCS2701
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DINVACCTH-I
                  ASSIGN TO DATABASE-MCFLST1001
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC          PIC X(1000).

       FD  DINVRCD-I-REG
           LABEL RECORDS ARE STANDARD.
       01  DINVRCD-I-REC-REG.
           COPY DDS-ALL-FORMATS OF MCFLCS2501.

       FD  DINVRCD-I-PO
           LABEL RECORDS ARE STANDARD.
       01  DINVRCD-I-REC-PO.
           COPY DDS-ALL-FORMATS OF MCFLCS2502.

       FD  DINVRCD-I-VEN
           LABEL RECORDS ARE STANDARD.
       01  DINVRCD-I-REC-VEN.
           COPY DDS-ALL-FORMATS OF MCFLCS2503.

       FD  DINVRCD-I-INV
           LABEL RECORDS ARE STANDARD.
       01  DINVRCD-I-REC-INV.
           COPY DDS-ALL-FORMATS OF MCFLCS2504.

       FD  DINVRCDH-I-REG
           LABEL RECORDS ARE STANDARD.
       01  DINVRCDH-I-REC-REG.
           COPY DDS-ALL-FORMATS OF MCFLST0801.

       FD  DINVRCDH-I-PO
           LABEL RECORDS ARE STANDARD.
       01  DINVRCDH-I-REC-PO.
           COPY DDS-ALL-FORMATS OF MCFLST0802.

       FD  DINVRCDH-I-VEN
           LABEL RECORDS ARE STANDARD.
       01  DINVRCDH-I-REC-VEN.
           COPY DDS-ALL-FORMATS OF MCFLST0803.

       FD  DINVRCDH-I-INV
           LABEL RECORDS ARE STANDARD.
       01  DINVRCDH-I-REC-INV.
           COPY DDS-ALL-FORMATS OF MCFLST0804.

       FD  DPORECD-I
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS0901.

       FD  DPORECDH-I
           LABEL RECORDS ARE STANDARD.
       01  DPORECDH-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLST0301.

       FD  DVENDOR-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS0701.

       FD  DVENDORH-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDORH-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLST0201.

       FD  MPORCV-I
           LABEL RECORDS ARE STANDARD.
       01  MPORCV-I-REC.
           COPY DDS-ALL-FORMATS  OF MCFLCS0101.

       FD  DPOITEM-I
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-I-REC.
           COPY DDS-ALL-FORMATS  OF MCFLCS1002.

       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-I-REC.
           COPY DDS-ALL-FORMATS  OF MCFLCS0201.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-I-REC.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  MVALIDUM-I
           LABEL RECORDS ARE STANDARD.
       01  MVALIDUM-I-REC.
           COPY DDS-MCRPCS0400  OF MCFLCS0401.

       FD  DPOITEMH-I
           LABEL RECORDS ARE STANDARD.
       01  DPOITEMH-I-REC.
           COPY DDS-ALL-FORMATS  OF MCFLST0401.

       FD  DPODATAITM-I
           LABEL RECORDS ARE STANDARD.
       01  DPODATAITM-I-REC.
           COPY DDS-ALL-FORMATS  OF MCFLCS1101.

       FD  DPODESCH-I
           LABEL RECORDS ARE STANDARD.
       01  DPODESCH-I-REC.
           COPY DDS-ALL-FORMATS  OF MCFLST0501.

       FD  DREQD-I
           LABEL RECORDS ARE STANDARD.
       01  DREQD-I-REC.
           COPY DDS-ALL-FORMATS  OF MCFLCS2102.

       FD  DPOFREIGHT-I
           LABEL RECORDS ARE STANDARD.
       01  DPOFREIGHT-I-REC.
           COPY DDS-ALL-FORMATS  OF MCFLCS2404.

       FD  DPOFREIGHTH-I
           LABEL RECORDS ARE STANDARD.
       01  DPOFREIGHTH-I-REC.
           COPY DDS-ALL-FORMATS  OF MCFLST0702.

       FD  DRCVITEM-I
           LABEL RECORDS ARE STANDARD.
       01  DRCVITEM-I-REC.
           COPY DDS-ALL-FORMATS  OF MCFLCS1201.

       FD  DRCVITEMH-I
           LABEL RECORDS ARE STANDARD.
       01  DRCVITEMH-I-REC.
           COPY DDS-ALL-FORMATS  OF MCFLST0601.

       FD  DINVITM-I
           LABEL RECORDS ARE STANDARD.
       01  DINVITM-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS2601.

       FD  DINVITMH-I
           LABEL RECORDS ARE STANDARD.
       01  DINVITMH-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLST0901.

       FD  DINVACCT-I
           LABEL RECORDS ARE STANDARD.
       01  DINVACCT-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS2701.

       FD  DINVACCTH-I
           LABEL RECORDS ARE STANDARD.
       01  DINVACCTH-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLST1001.

       WORKING-STORAGE SECTION.
       77  READ-CTR                  PIC S9(4)    VALUE ZERO  COMP-4.
       77  ITEM-INQ-NUM              PIC X(4)     VALUE SPACES.
       77  SCREEN-INDICATOR          PIC S9(4)    VALUE 1 COMP-4.
       77  RET-CODE-TALTVENK         PIC X(02)    VALUE "00".
       77  BASE-TALTVENK             PIC X(20).
       77  ALT-KEY-ARG               PIC X(10).
       77  ALT-VEND-CODE             PIC X(10).
       01  FILE-STATUS.
           05  FILE-STATUS-1         PIC X     VALUE SPACES.
           05  FILE-STATUS-2         PIC X     VALUE SPACES.
       01  INV-CHAR-1-5              PIC X(5).
      *************************************************************
      **                                                         **
      **                  S W I T C H   A R E A                  **
      **                                                         **
      *************************************************************

       01  TYPE-INV-INQ-SW           PIC X        VALUE SPACES.
           88  REG-INQ                            VALUE "R".
           88  PO-INQ                             VALUE "P".
           88  VEN-INQ                            VALUE "V".
           88  INV-INQ                            VALUE "I".
       01  USE-HIST-DB-SW            PIC X        VALUE SPACES.
       01  SWITCHES.
           05  FATAL-ERR-SW          PIC X        VALUE "N".
           05  ERR-SW                PIC X        VALUE SPACES.
           05  HREAD-PRIOR-VALID-SW  PIC X        VALUE "N".
               88  HREAD-PRIOR-VALID              VALUE "Y".
               88  HREAD-PRIOR-NOT-VALID          VALUE "N".
           05  HREAD-NEXT-VALID-SW   PIC X        VALUE "N".
               88  HREAD-NEXT-VALID               VALUE "Y".
               88  HREAD-NEXT-NOT-VALID           VALUE "N".
           05  IREAD-PRIOR-VALID-SW  PIC X        VALUE "N".
               88  IREAD-PRIOR-VALID              VALUE "Y".
               88  IREAD-PRIOR-NOT-VALID          VALUE "N".
           05  IREAD-NEXT-VALID-SW   PIC X        VALUE "N".
               88  IREAD-NEXT-VALID               VALUE "Y".
               88  IREAD-NEXT-NOT-VALID           VALUE "N".

       01  ARGUMENT-VALUES.
           05  PO-ARG                PIC X(14)    VALUE SPACES.
           05  VEN-ARG               PIC X(10)    VALUE SPACES.
           05  REGISTER-ARG          PIC X(6)     VALUE SPACES.
           05  INV-ARG               PIC X(14)    VALUE SPACES.
           05  PLT-ARG               PIC X(4)     VALUE SPACES.
           05  UM-ARG                PIC X(2)     VALUE SPACES.
           05  CODE-ARG              PIC X(8)     VALUE SPACES.

       01  BUILD-PO-KEY-VALUE.
           05  B-PO-PREFIX           PIC X        VALUE "P".
           05  BUILD-PO-KEY-HIST.
               10  B-PO-NO           PIC X(7)     VALUE SPACE.
               10  B-PO-RLSE         PIC X(3)     VALUE SPACE.
               10  B-PO-RCV          PIC X(3)     VALUE ZERO.

       01  SAVE-VIEW-STATUS          PIC S9(4)    VALUE ZERO  COMP-4.
       01  SAVE-VIEW-LASTKEY         PIC S9(4)    VALUE ZERO  COMP-4.
       01  SAVE-COND-WORD            PIC S9(4)    VALUE ZERO  COMP-4.

       COPY HMSGBUF IN COPYLIB.

       01  DATA-BASE-INDIC              PIC X   VALUE SPACES.
           88  STORES-DB                        VALUE SPACES.
           88  STORES-HISTORY-DB                VALUE "Y".

       01  READ-NEXT-SW                 PIC X   VALUE "Y".
           88  READ-NEXT                        VALUE "Y".

       01  ITEM-NOT-FOUND-MSG.
           05  FILLER                   PIC X(13)  VALUE SPACES.
           05  NO-ITEM-OUT              PIC ZZZ9  VALUE ZEROS.
           05  FILLER                   PIC X(32)  VALUE SPACES.

       01  READ-ERR-SW                  PIC X(1)  VALUE SPACES.
           88  READ-NEXT-ERR                      VALUE "N".
           88  READ-PRIOR-ERR                     VALUE "P".

      *---USED FOR YEAR 2000 COMPLIANCE.
       01  DISPLAY-DATE                 PIC 9(6).
       01  TEMP-DATE.
           05  FILLER                   PIC 9(2).
           05  TEMP-YEAR                PIC 9(2).
           05  FILLER                   PIC 9(4).
       01  TEMP-DATE-9 REDEFINES TEMP-DATE  PIC 9(8).

      *************************************************************
      **                                                         **
      **                   S A V E   A R E A S                   **
      **                                                         **
      *************************************************************

       01  SUB-AREA.
           05  FRT-SUB               PIC S9(4)  VALUE ZEROS COMP-4.
           05  SUB                   PIC S9(4)  VALUE ZEROS COMP-4.
       01  SUBSCRIPTS.
           05  DESC-SUB              PIC S9(4) VALUE 0 COMP-4.
           05  ACCT-SUB              PIC S9(4) VALUE 0 COMP-4.
       01  MISC-SAVE-AREAS-9.
           05  S-DDESC-LAST          PIC S9(9) VALUE 0 COMP-4.
           05  CALC-ITEM-EXT         PIC S9(11)V9(4) VALUE 0 COMP-3.
           05  SAVE-POITEMSEQ.
               10  SAVE-INV-ITEM-NO  PIC X(4)  VALUE SPACES.
               10  FILLER            PIC X(2)  VALUE "01".
           05  SAVE-INVACCT-ITEM-NO  PIC X(4)  VALUE SPACES.

      *************************************************************
      **                                                         **
      **           D A T A   E N T R Y   B U F F E R S           **
      **                                                         **
      *************************************************************

       01  SCREEN-1.
           05  DE-REGISTER-NO        PIC X(5).
           05  DE-ITEM-NO            PIC X(4).
           05  DE-INVOICE-NO         PIC X(14).
           05  DE-PO-RLSE-NUM.
               10  DE-PO-NUM         PIC X(7).
               10  DE-PO-RLSE        PIC X(3).
           05  DE-VEN-CODE           PIC X(10).
           05  DE-HISTORY-INDIC      PIC X.
               88  SEARCH-HISTORY-DB        VALUE "X".
           05  DE-CMDNLINE           PIC X(79).
           05  DE-MSGLINE            PIC X(79).


       01  SCREEN-2.
           05  DE2-HISTORY-LIT       PIC X(20).
           05  DE2-PO-RLSE.
               10  DE2-PO            PIC X(7).
               10  DE2-RLSE          PIC X(3).
           05  DE2-INV-NUM           PIC X(14).
           05  DE2-REG-NUM           PIC ZZZZ9.
           05  DE2-STATUS            PIC X.
           05  DE2-MFEST-NO          PIC X(8).
           05  DE2-CHECK-NO          PIC X(8).
           05  DE2-CHECK-DATE        PIC X(8).
           05  DE2-NO-CHECK-INDIC    PIC X.
           05  DE2-INV-DATE          PIC X(8).
           05  DE2-DUE-DATE          PIC X(8).
           05  DE2-INV-TERMS         PIC X(2).
           05  DE2-ENTRY-DATE        PIC X(8).
           05  DE2-MOD-DATE          PIC X(8).
           05  DE2-ADD-CLERK         PIC X(4).
           05  DE2-MOD-CLERK         PIC X(4).
           05  DE2-MATL-CE           PIC X.
           05  DE2-I-MATL-EXT        PIC -(11)9.99.
           05  DE2-P-MATL-EXT        PIC -(11)9.99.
           05  DE2-PAYMENT-IND       PIC X.
           05  DE2-VEN-CODE          PIC X(10).
           05  DE2-NET-DUE-VENDOR    PIC -(11)9.99.
           05  DE2-DIST-COST         PIC -(11)9.99.
           05  DE2-CUR-CODE          PIC X(2).
           05  DE2-CUR-CODE-DESC     PIC X(12).
0792CK     05  DE2-RCVR              PIC X(3).
           05  DE2-HOLD-OPT-VERBAGE  PIC X(20).
           05  DE2-MSG-LINE          PIC X(60).
           05  DE2-CMDLINE           PIC X(79).
           05  DE2-MSGLINE           PIC X(79).

       01  SCREEN-3.
           05  DE3-HISTORY-LIT       PIC X(20).
           05  DE3-PO-RLSE.
               10  DE3-PO            PIC X(7).
               10  DE3-RLSE          PIC X(3).
           05  DE3-INV-NUM           PIC X(14).
           05  DE3-REG-NUM           PIC ZZZZ9.
           05  DE3-INV-AMT           PIC -(11)9.99.
           05  DE3-INV-CE            PIC X.
           05  DE3-INV-CE-ACCTG      PIC X(9).
           05  DE3-MATL-EXT          PIC -(11)9.99.
           05  DE3-VEN-FRT           PIC -(11)9.99.
           05  DE3-FOB               PIC X(20).
           05  DE3-VEN-TAX           PIC -(11)9.99.
           05  DE3-TAX-CODE          PIC X(2).
           05  DE3-VEN-CTNRS         PIC -(11)9.99.
           05  DE3-VEN-INS           PIC -(11)9.99.
           05  DE3-VEN-OTHER         PIC -(11)9.99.
           05  DE3-CALC-INV-AMT      PIC -(11)9.99.
           05  DE3-MSG-LINE          PIC X(60).
           05  DE3-CMDLINE           PIC X(79).
           05  DE3-MSGLINE           PIC X(79).

       01  SCREEN-4.
           05  DE4-HISTORY-LIT       PIC X(20).
           05  DE4-PO-RLSE.
               10  DE4-PO            PIC X(7).
               10  DE4-RLSE          PIC X(3).
           05  DE4-INV-NUM           PIC X(14).
           05  DE4-REG-NUM           PIC ZZZZ9.
           05  DE4-ORIG-INV-AMT      PIC -(11)9.99.
           05  DE4-INV-CE            PIC X.
           05  DE4-INV-CE-ACCTG      PIC X(9).
           05  DE4-CE6-EXT-ERR       PIC -(11)9.99.
           05  DE4-CE7-UP-ERR        PIC -(11)9.99.
           05  DE4-CE8-OTHER         PIC -(11)9.99.
           05  DE4-CALC-INV-AMT      PIC -(11)9.99.
           05  DE4-CE3-FRT           PIC -(11)9.99.
           05  DE4-CE4-INS           PIC -(11)9.99.
           05  DE4-CE5-TAX           PIC -(11)9.99.
           05  DE4-CE9-CASHD         PIC -(11)9.99.
           05  DE4-CPW               PIC -(11)9.99.
           05  DE4-CPW-CODE          PIC X(4).
           05  DE4-OTHER-CE          PIC X.
           05  DE4-OTHER-CE-AMT      PIC -(11)9.99.
           05  DE4-OTHER-CE-ACCT     PIC X(9).
           05  DE4-NET-DUE-VENDOR    PIC -(11)9.99.
           05  DE4-MSG-LINE          PIC X(60).
           05  DE4-CMDLINE           PIC X(79).
           05  DE4-MSGLINE           PIC X(79).

       01  SCREEN-5.
           05  DE5-HISTORY-LIT       PIC X(20).
           05  DE5-PO-RLSE.
               10  DE5-PO            PIC X(7).
               10  DE5-RLSE          PIC X(3).
           05  DE5-INV-NUM           PIC X(14).
           05  DE5-REG-NUM           PIC ZZZZ9.
           05  DE5-NET-DUE-VENDOR    PIC -(11)9.99.
           05  DE5-CASH-DSCNT        PIC -(11)9.99.
           05  DE5-CTNRS             PIC -(11)9.99.
           05  DE5-CPW               PIC -(11)9.99.
           05  DE5-TOTAL-GDYR-FRT    PIC -(11)9.99.
           05  DE5-OTHER             PIC -(11)9.99.
           05  DE5-ACCRUED-TAX-TABLE OCCURS 4 TIMES.
               10  DE5-ACCRUED-TAX   PIC -(11)9.99.
               10  DE5-ATAX-DISTRICT PIC X(15).
               10  DE5-ATAX-ACCTG    PIC X(9).
           05  DE5-DIST-COST         PIC -(11)9.99.
           05  DE5-MSG-LINE          PIC X(60).
           05  DE5-CMDLINE           PIC X(79).
           05  DE5-MSGLINE           PIC X(79).

       01  SCREEN-6.
           05  DE6-HISTORY-LIT       PIC X(20).
           05  DE6-PO-RLSE.
               10  DE6-PO            PIC X(7).
               10  DE6-RLSE          PIC X(3).
           05  DE6-INV-NUM           PIC X(14).
           05  DE6-REG-NUM           PIC ZZZZ9.
           05  DE6-FRT-DATA  OCCURS 10 TIMES.
               10  DE6-RCVR          PIC X(3).
               10  DE6-CARRIER-CODE  PIC X(4).
               10  DE6-PRO-NUMBER    PIC X(16).
               10  DE6-CAR-NO        PIC X(10).
               10  DE6-FRT-AMOUNT    PIC -(11)9.99.
           05  DE6-MSG-LINE          PIC X(60).
           05  DE6-CMDLINE           PIC X(79).
           05  DE6-MSGLINE           PIC X(79).

       01  SCREEN-7.
           05  DE7-HISTORY-LIT       PIC X(20).
           05  DE7-PO-RLSE.
               10  DE7-PO            PIC X(7).
               10  DE7-RLSE          PIC X(3).
           05  DE7-INV-NUM           PIC X(14).
           05  DE7-REG-NUM           PIC ZZZZ9.
           05  DE7-ITEM-INFORMATION.
               10  DE7-ITEM-NO       PIC ZZZ9.
               10  DE7-CORPCODE      PIC X(7).
               10  DE7-PO-UNPD-QTY   PIC -(8)9.9(4).
               10  DE7-PO-UM         PIC X(2).
               10  DE7-PO-UPRICE     PIC -(11)9.9(4).
               10  DE7-PO-ITEM-EXT   PIC -(11)9.9(4).
               10  DE7-INV-UNPD-QTY  PIC -(8)9.9(4).
               10  DE7-INV-UM        PIC X(2).
               10  DE7-INV-UPRICE    PIC -(11)9.9(4).
               10  DE7-INV-ITEM-EXT  PIC -(11)9.9(4).
               10  DE7-TAX-CODE      PIC X(2).
               10  DE7-INV-MEMO-MSG  PIC X(36).
               10  DE7-DESC-TABLE.
                   15  DE7-DESC-LINE  OCCURS  4  TIMES
                                     PIC X(79).
               10  DE7-ACCOUNTING-TABLE.
                   15  DE7-ACCTG-ENTRY  OCCURS  5  TIMES.
                       20  DE7-PRIME     PIC X(3).
                       20  DE7-SUB       PIC X(3).
                       20  DE7-SUBD      PIC X(4).
                       20  DE7-ADDL-DATA PIC X(6).
                       20  DE7-PERCENT   PIC ZZ9.99.
               10  DE7-INSTLINE          PIC X(60).
               10  DE7-CMDLINE           PIC X(79).
               10  DE7-MSGLINE           PIC X(79).

       01  HISTORY-DB-LIT            PIC X(20)  VALUE SPACES.

      *************************************************************
      **                                                         **
      **  D A T A B A S E   C O M M U N I C A T I O N   A R E A  **
      **                                                         **
      *************************************************************
       COPY DBSTAT   IN COPYLIB.

       COPY TDATECHK IN COPYLIB.

       COPY CDESC    IN COPYLIB.
       01  RET-CODE  PIC X(2) VALUE SPACES.

       COPY CNDESC   IN COPYLIB.

       COPY TBLOWUP  IN COPYLIB.

       COPY CATREAD  IN COPYLIB.

       COPY DISPDATA IN COPYLIB.

       COPY IOFEEDBACK IN COPYLIB.


      *************************************************************
      **                                                         **
      **             D A T A B A S E   B U F F E R S             **
      **                                                         **
      *************************************************************


       COPY DINVRCD IN COPYLIB.

       COPY DINVRCDH IN COPYLIB.

       COPY DFREIGHT IN COPYLIB.

       COPY DPOFRTH  IN COPYLIB.

       COPY DPORECD  IN COPYLIB.

       COPY DPORECDH IN COPYLIB.

       COPY DINVITM  IN COPYLIB.

       COPY DINVITMH IN COPYLIB.

       COPY DINVACCT IN COPYLIB.

       COPY DINVACTH  IN COPYLIB.

       COPY DPODESCH  IN COPYLIB.

       COPY DVENDOR  IN COPYLIB.

       COPY DVENDORH IN COPYLIB.

       COPY MPLTINFO IN COPYLIB.

       COPY MVALIDUM IN COPYLIB.

      *************************************************************
      **                                                         **
      **                L I N K A G E   A R E A                  **
      **                                                         **
      *************************************************************

       LINKAGE SECTION.

       01  BASE                       PIC X(10).
       01  BASE-STHIST.
           05  BASE-STHIST-OPEN-INDIC PIC X(2).
           05  BASE-STHIST-NAME       PIC X(8).
       COPY VCOMLINK IN COPYLIB.
       COPY LANGSUB  IN COPYLIB.


       PROCEDURE DIVISION USING BASE,
                                BASE-STHIST,
                                VIEW-COMAREA,
                                LANGUAGE-PARMS.

       MAIN-PROCESSING SECTION 02.
       6-MAIN.
           MOVE "SINVINQS"  TO  BU-PGM-NAME.
           OPEN I-O DISPLAY-FILE.
           OPEN INPUT DINVRCD-I-REG, DINVRCD-I-PO, DINVRCD-I-VEN,
                    DINVRCD-I-INV, DPORECD-I, DVENDOR-I,
                    DPOFREIGHT-I, MVALIDUM-I, MPLTINFO-I,
                    DINVITM-I, DINVACCT-I.
           MOVE SPACES TO BASE-STHIST-OPEN-INDIC.
           PERFORM 61-SELECTION-ROUTINE  THRU  61-SR-X.
           CLOSE    DISPLAY-FILE, DINVRCD-I-REG, DINVRCD-I-PO,
                    DINVRCD-I-VEN, DINVRCD-I-INV, DPORECD-I, DVENDOR-I,
                    DINVRCDH-I-REG, DINVRCDH-I-PO, DINVRCDH-I-VEN,
                    DINVRCDH-I-INV, DPORECDH-I, DVENDORH-I,
                    DPOFREIGHTH-I, DPOFREIGHT-I, MVALIDUM-I,
                    MPLTINFO-I, DINVITM-I, DINVACCT-I.
           GOBACK.

       6-MAIN-X.
           EXIT.


       2-BLOWUP.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                       BU-DISPLAY-FLDS.

       2-BLOWUP-X.
           EXIT.

       3-OPEN-HIST-DB.
           OPEN INPUT DINVRCDH-I-REG
           IF FILE-STATUS-1  = "9"
               MOVE "NO DB" TO BASE-STHIST-NAME
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "OPEN STORES HIST 'STHIST'" TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP,
           ELSE
           OPEN INPUT DINVRCDH-I-PO, DINVRCDH-I-VEN, DINVRCDH-I-INV,
                      DPORECDH-I, DVENDORH-I, DPOFREIGHTH-I,
                      DINVITMH-I, DINVACCTH-I, DPODESCH-I
           MOVE "XX" TO BASE-STHIST-OPEN-INDIC.

       3-OHD-X.
           EXIT.


       61-SELECTION-ROUTINE.
           MOVE "INVINQ1" TO  VIEW-NFNAME.
           MOVE SPACES  TO  SCREEN-1.
           IF USE-HIST-DB-SW = "Y"
               MOVE "X"              TO  DE-HISTORY-INDIC.

       61-SHOWFORM-SCREEN-1.
           MOVE SCREEN-1    TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC TO SCREEN-1.

      *
      * IF REGISTER OR ITEM NUMBER CLEARED, THEN MOVE SPACES IN
      *
           IF DE-REGISTER-NO EQUAL ZEROES
             MOVE SPACES TO DE-REGISTER-NO.
           IF DE-ITEM-NO EQUAL ZEROES
             MOVE SPACES TO DE-ITEM-NO.

           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2
               MOVE VIEW-LASTKEY   TO  SAVE-VIEW-LASTKEY
           ELSE
           IF VIEW-LASTKEY = 3
               GO TO 61-SR-X
           ELSE
           IF VIEW-LASTKEY = 4
               IF DE-HISTORY-INDIC = "X"
                   MOVE SPACES        TO  DE-HISTORY-INDIC
                   GO TO 61-SHOWFORM-SCREEN-1
               ELSE
                   MOVE "X"           TO  DE-HISTORY-INDIC
                   GO TO 61-SHOWFORM-SCREEN-1
           ELSE
           IF VIEW-LASTKEY = 5  OR
              VIEW-LASTKEY = 6  OR
              VIEW-LASTKEY = 7  OR
              VIEW-LASTKEY = 8
      *        ***  INVALID FUNCTION KEY ENTERED  ***
               MOVE 9010 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE-MSGLINE
               MOVE B"1" TO IND(99)
               GO TO  61-SHOWFORM-SCREEN-1
           ELSE
0294CZ*------- IF THE ENTER KEY IS PRESSED, TREAT IT AS IF THE F1
  .   *------- KEY WAS PRESSED.      2/6/1995
  .            MOVE 1              TO  SAVE-VIEW-LASTKEY.
  .   *
  .   *        ***  SELECT THE APPROPRIATE  'FUNCTION KEY'  ***
  .   *        MOVE 19013 TO CATREAD-MSG-NUMBER
  .   *        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
  .   *        MOVE MESSAGE-BUFFER TO DE-MSGLINE
  .   *        MOVE B"1" TO IND(99)
0294CZ*        GO TO  61-SHOWFORM-SCREEN-1.

           MOVE SAVE-VIEW-LASTKEY  TO  VIEW-LASTKEY.

       61-EDIT-SELECTION.
           IF VIEW-LASTKEY = 1
               IF DE-ITEM-NO NOT = SPACES
      *            *** CANNOT SELECT ITEM NO. WHEN REVIEWING HEADER
      *                 DATA 'f1' ***
                   MOVE 3028 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE-MSGLINE
                   MOVE B"1" TO IND(99), IND(2)
                   GO TO 61-SHOWFORM-SCREEN-1.

           IF DE-ITEM-NO NOT = SPACES
               IF DE-REGISTER-NO = SPACES
      *            *** REGISTER NUMBER IS REQUIRED WHEN SELECTING
      *                 ITEM NUMBER
                   MOVE  66156 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE-MSGLINE
                   MOVE B"1" TO IND(99), IND(1)
                   GO TO 61-SHOWFORM-SCREEN-1.

           IF DE-PO-RLSE NOT = SPACES
               IF DE-PO-NUM = SPACES
      *            *** YOU MUST ENTER PO NUMBER TO ACCOMPANY RELEASE
      *                 ENTERED
                   MOVE  66158 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE-MSGLINE
                   MOVE B"1" TO IND(99), IND(5)
                   GO TO 61-SHOWFORM-SCREEN-1.

           IF DE-REGISTER-NO = SPACES AND DE-INVOICE-NO = SPACES
             AND DE-PO-NUM = SPACES AND DE-VEN-CODE = SPACES
      *        *** YOU MUST ENTER ONE OF THE SELECTION CRITERIA
               MOVE  66157 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE-MSGLINE
               MOVE B"1" TO IND(99), IND(1)
               GO TO 61-SHOWFORM-SCREEN-1.

           IF (DE-REGISTER-NO  NOT = SPACES AND DE-INVOICE-NO = SPACES
             AND DE-PO-NUM = SPACES AND DE-VEN-CODE = SPACES) OR
              (DE-REGISTER-NO  = SPACES AND DE-INVOICE-NO NOT = SPACES
             AND DE-PO-NUM = SPACES AND DE-VEN-CODE = SPACES) OR
              (DE-REGISTER-NO  = SPACES AND DE-INVOICE-NO = SPACES
             AND DE-PO-NUM NOT = SPACES AND DE-VEN-CODE = SPACES) OR
              (DE-REGISTER-NO = SPACES AND DE-INVOICE-NO = SPACES
             AND DE-PO-NUM = SPACES AND DE-VEN-CODE NOT = SPACES)
               NEXT SENTENCE
           ELSE
      *        *** SELECT ONLY ONE OPTION
               MOVE  66140 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE-MSGLINE
               MOVE B"1" TO IND(99), IND(1)
               GO TO 61-SHOWFORM-SCREEN-1.

           IF DE-HISTORY-INDIC = "X" OR SPACE
               NEXT SENTENCE
           ELSE
      *        *** YOU MUST ENTER AN 'X TO USE HISTORY DATA BASE
               MOVE  66159 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE-MSGLINE
               MOVE B"1" TO IND(99), IND(9)
               GO TO 61-SHOWFORM-SCREEN-1.

       61-CHECK-WHICH-DB.
           IF SEARCH-HISTORY-DB
               IF BASE-STHIST-NAME = "NO DB"
                   MOVE 19020 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD  THRU  999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE-MSGLINE
                   MOVE B"1" TO IND(99), IND(1)
                   GO 61-SHOWFORM-SCREEN-1
               ELSE
               IF BASE-STHIST-OPEN-INDIC = SPACES
                   PERFORM 3-OPEN-HIST-DB  THRU  3-OHD-X
                   IF BASE-STHIST-NAME = "NO DB"
                       GO TO 61-CHECK-WHICH-DB.

           IF SEARCH-HISTORY-DB
               MOVE "Y"                TO  USE-HIST-DB-SW
           ELSE
               MOVE SPACES             TO  USE-HIST-DB-SW.

           MOVE "N"  TO  ERR-SW.
           IF DE-REGISTER-NO  NOT = SPACES
               PERFORM 612-EDIT-REGISTER-NO  THRU  612-ERN-X
           ELSE
           IF DE-INVOICE-NO   NOT = SPACES
               PERFORM 613-EDIT-INVOICE-NO   THRU  613-EIN-X
           ELSE
           IF DE-PO-NUM       NOT = SPACES
               PERFORM 614-EDIT-PO-NUM       THRU  614-EPN-X
           ELSE
               PERFORM 615-EDIT-VEN-NUM      THRU  615-EVN-X.
           IF ERR-SW = "Y"
               GO TO 61-SHOWFORM-SCREEN-1.

           MOVE DE-ITEM-NO    TO  ITEM-INQ-NUM.
           SET HREAD-NEXT-NOT-VALID, HREAD-PRIOR-NOT-VALID TO TRUE.
           IF VIEW-LASTKEY = 1
               GO TO 61-CALL-HDR-INQ
           ELSE
               GO TO 61-CALL-ITEM-INQ.

       61-CALL-HDR-INQ.
           MOVE "Y" TO READ-NEXT-SW.
           PERFORM 7-HEADER-INQUIRE THRU 7-HEADER-INQUIRE-X.
           IF VIEW-LASTKEY = 4
               GO TO 61-CALL-ITEM-INQ
           ELSE
               GO TO 61-SELECTION-ROUTINE.

       61-CALL-ITEM-INQ.
           MOVE "Y" TO READ-NEXT-SW.
           IF STORES-DB
             SET IREAD-NEXT-NOT-VALID, IREAD-PRIOR-NOT-VALID TO TRUE
           ELSE
             SET IREAD-NEXT-VALID, IREAD-PRIOR-VALID TO TRUE
           END-IF.
           PERFORM 8-ITEM-INQUIRE THRU 8-ITEM-INQUIRE-X.
           IF VIEW-LASTKEY = 4
               PERFORM 69-RESTART-READ
               IF FILE-STATUS NOT = "00"
                   MOVE "RESTART DINVRCD*69-RESTART-READ"
                       TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP
               ELSE
                    GO TO 61-CALL-HDR-INQ
           ELSE
               GO TO 61-SELECTION-ROUTINE.

       61-SR-X.
           EXIT.


       612-EDIT-REGISTER-NO.
           IF USE-HIST-DB-SW = "Y"
               MOVE DE-REGISTER-NO TO REGISTERNO OF DINVRCDH-I-REC-REG,
                                      REGISTER-ARG,
               START DINVRCDH-I-REG KEY = REGISTERNO OF
                                          DINVRCDH-I-REC-REG
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           ELSE
               MOVE DE-REGISTER-NO TO REGISTERNO OF DINVRCD-I-REC-REG,
                                      REGISTER-ARG,
               START DINVRCD-I-REG KEY = REGISTERNO OF
                                         DINVRCD-I-REC-REG
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
      *            ***  REGISTER NUMBER DOES NOT EXIST - CORRECT AND
      *                 REENTER  ***
                   MOVE 18031 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE-MSGLINE
                   MOVE B"1" TO IND(99), IND(1)
                   MOVE "Y"  TO  ERR-SW
               ELSE
                   MOVE "START DINVRCD*612-ERN"  TO  BU-DISPLAY-MSG
                   MOVE DE-REGISTER-NO          TO  BU-DISPLAY-FLD (1)
                   GO TO 2-BLOWUP
           ELSE
               MOVE "R"   TO   TYPE-INV-INQ-SW.

       612-ERN-X.
           EXIT.

       613-EDIT-INVOICE-NO.
           IF USE-HIST-DB-SW = "Y"
               MOVE DE-INVOICE-NO TO INVOICENO OF DINVRCDH-I-REC-INV,
                                     INV-ARG
               START DINVRCDH-I-INV KEY = INVOICENO OF
                                          DINVRCDH-I-REC-INV
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           ELSE
               MOVE DE-INVOICE-NO TO INVOICENO OF DINVRCD-I-REC-INV,
                                     INV-ARG
               START DINVRCD-I-INV KEY = INVOICENO OF
                                         DINVRCD-I-REC-INV
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
      *            ***  INVOICE NUMBER DOES NOT EXIST - CORRECT AND
      *                 REENTER  ***
                   MOVE 9046 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE-MSGLINE
                   MOVE B"1" TO IND(99), IND(3)
                   MOVE "Y"  TO  ERR-SW
               ELSE
                   MOVE "FIND DINVRCD*613-EIN"  TO  BU-DISPLAY-MSG
                   MOVE DE-INVOICE-NO           TO  BU-DISPLAY-FLD (1)
                   GO TO 2-BLOWUP
           ELSE
               MOVE "I"   TO   TYPE-INV-INQ-SW.

       613-EIN-X.
           EXIT.

       614-EDIT-PO-NUM.
           MOVE DE-PO-NUM           TO  B-PO-NO.
           IF DE-PO-RLSE = SPACES
               MOVE ZEROS TO DE-PO-RLSE.
           MOVE DE-PO-RLSE          TO  B-PO-RLSE.
           IF SEARCH-HISTORY-DB
               MOVE BUILD-PO-KEY-HIST   TO  PO-ARG
           ELSE
               MOVE BUILD-PO-KEY-VALUE  TO  PO-ARG.
           IF USE-HIST-DB-SW = "Y"
               MOVE PO-ARG TO PORCVNO OF DPORECDH-I-REC
               START DPORECDH-I KEY = PORCVNO OF DPORECDH-I-REC
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           ELSE
               MOVE PO-ARG TO PORCVNO OF DPORECD-I-REC
               START DPORECD-I KEY = PORCVNO OF DPORECD-I-REC
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
      *            ***  P.O. DOES NOT EXIST  ***
                   MOVE 16045 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE-MSGLINE
                   MOVE B"1" TO IND(99), IND(5)
                   MOVE "Y"  TO  ERR-SW
                   GO TO 614-EPN-X
               ELSE
                   MOVE "FIND DPORECD*614-EPN"  TO  BU-DISPLAY-MSG
                   MOVE PO-ARG                  TO  BU-DISPLAY-FLD (1)
                   GO TO 2-BLOWUP.

           IF USE-HIST-DB-SW = "Y"
               MOVE PO-ARG TO PORCVNO OF DINVRCDH-I-REC-PO
               START DINVRCDH-I-PO KEY = PORCVNO OF DINVRCDH-I-REC-PO
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           ELSE
               MOVE PO-ARG TO PORCVNO OF DINVRCD-I-REC-PO
               START DINVRCD-I-PO KEY = PORCVNO OF DINVRCD-I-REC-PO
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
      *            ***  AN INVOICE DOES NOT EXIST FOR THE PO NUMBER
      *                 ENTERED  ***
                   MOVE 9047 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE-MSGLINE
                   MOVE B"1" TO IND(99), IND(5)
                   MOVE "Y"  TO  ERR-SW
               ELSE
                   MOVE "FIND DINVRCD*614-EPN" TO  BU-DISPLAY-MSG
                   MOVE PO-ARG                  TO  BU-DISPLAY-FLD (1)
                   GO TO 2-BLOWUP
           ELSE
               MOVE "P"   TO   TYPE-INV-INQ-SW.

       614-EPN-X.
           EXIT.

       615-EDIT-VEN-NUM.
           IF USE-HIST-DB-SW = "Y"
               PERFORM 6150-GET-ALTKEY THRU 6150-GA-EXIT
               MOVE DE-VEN-CODE TO VENCDE OF DVENDORH-I-REC,
                                   VEN-ARG
               START DVENDORH-I KEY = VENCDE OF DVENDORH-I-REC
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           ELSE
               PERFORM 6150-GET-ALTKEY THRU 6150-GA-EXIT
               MOVE DE-VEN-CODE TO VENCDE OF DVENDOR-I-REC,
                                   VEN-ARG
               START DVENDOR-I KEY = VENCDE OF DVENDOR-I-REC
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
      *            ***  VENDOR CODE DOES NOT EXIST  ***
                   MOVE 22003 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE-MSGLINE
                   MOVE B"1" TO IND(99), IND(8)
                   MOVE "Y"  TO  ERR-SW
                   GO TO 615-EVN-X
               ELSE
                   MOVE "FIND DVENDOR*615-EVN"  TO  BU-DISPLAY-MSG
                   MOVE VEN-ARG                 TO  BU-DISPLAY-FLD (1)
                   GO TO 2-BLOWUP.

           IF USE-HIST-DB-SW = "Y"
               MOVE DE-VEN-CODE TO VENCDE OF DINVRCDH-I-REC-VEN
               START DINVRCDH-I-VEN KEY = VENCDE OF
                                          DINVRCDH-I-REC-VEN
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           ELSE
               MOVE DE-VEN-CODE TO VENCDE OF DINVRCD-I-REC-VEN
               START DINVRCD-I-VEN KEY = VENCDE OF
                                         DINVRCD-I-REC-VEN
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
      *            *** AN INVOICE DOES NOT EXIST FOR THE VENDOR CODE ENTERED ***
                   MOVE 9056 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE-MSGLINE
                   MOVE B"1" TO IND(99), IND(8)
                   MOVE "Y"  TO  ERR-SW
               ELSE
                   MOVE "FIND DINVRCD*615-EVN" TO  BU-DISPLAY-MSG
                   MOVE VEN-ARG                 TO  BU-DISPLAY-FLD (1)
                   GO TO 2-BLOWUP
           ELSE
               MOVE "V"   TO   TYPE-INV-INQ-SW.

       615-EVN-X.
           EXIT.

       6150-GET-ALTKEY.
      *-----  CALL ALT KEY SUB-PGM TO GET ALT KEY IF ONE EXISTS
           MOVE DE-VEN-CODE TO ALT-KEY-ARG.
           CALL "TALTVENK" USING RET-CODE-TALTVENK,
                                 BASE-TALTVENK,
                                 STATUS-AREA,
                                 ALT-KEY-ARG,
                                 ALT-VEND-CODE.
           IF RET-CODE-TALTVENK NOT EQUAL "00"
              MOVE "TALTVENK ERROR 6150-GA" TO BU-DISPLAY-MSG
              PERFORM 2-BLOWUP THRU 2-BLOWUP-X.
           MOVE ALT-VEND-CODE   TO DE-VEN-CODE.

       6150-GA-EXIT.
           EXIT.

       69-RESTART-READ.
           IF REG-INQ
             IF STORES-DB
               START DINVRCD-I-REG KEY = REGISTERNO OF
                                         DINVRCD-I-REC-REG
                     INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
             ELSE
               START DINVRCDH-I-REG KEY = REGISTERNO OF
                                          DINVRCDH-I-REC-REG
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           ELSE
           IF INV-INQ
             IF STORES-DB
               START DINVRCD-I-INV KEY = INVOICENO OF
                                         DINVRCD-I-REC-INV
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
             ELSE
               START DINVRCDH-I-INV KEY = INVOICENO OF
                                          DINVRCDH-I-REC-INV
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           ELSE
           IF PO-INQ
             IF STORES-DB
               START DINVRCD-I-PO KEY = PORCVNO OF DINVRCD-I-REC-PO
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
             ELSE
               START DINVRCDH-I-PO KEY = PORCVNO OF DINVRCDH-I-REC-PO
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           ELSE
             IF STORES-DB
               START DINVRCD-I-VEN KEY = VENCDE OF
                                         DINVRCD-I-REC-VEN
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
             ELSE
               START DINVRCDH-I-VEN KEY = VENCDE OF
                                          DINVRCDH-I-REC-VEN
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       7-HEADER-INQUIRE.
           MOVE USE-HIST-DB-SW TO DATA-BASE-INDIC.
           IF STORES-HISTORY-DB
               MOVE 8003 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO HISTORY-DB-LIT.

           IF STORES-DB
               IF READ-NEXT
                   IF REG-INQ
                       PERFORM 79-READ-NEXT-REG
                   ELSE
                   IF VEN-INQ
                       IF VIEW-LASTKEY = 4
                           SET HREAD-NEXT-NOT-VALID,
                               HREAD-PRIOR-NOT-VALID TO TRUE
                           MOVE SPACES
                                  TO REGISTERNO OF DINVRCD-I-REC-VEN
                           PERFORM 79-READ-NEXT-VEN UNTIL
                             REGISTERNO OF DINVRCD-I-REC-VEN =
                             REGISTER-ARG
                       ELSE
                           PERFORM 79-READ-NEXT-VEN
                   ELSE
                   IF PO-INQ
                       IF VIEW-LASTKEY = 4
                           SET HREAD-NEXT-NOT-VALID,
                               HREAD-PRIOR-NOT-VALID TO TRUE
                           MOVE SPACES
                                  TO REGISTERNO OF DINVRCD-I-REC-PO
                           PERFORM 79-READ-NEXT-PO UNTIL
                             REGISTERNO OF DINVRCD-I-REC-PO =
                             REGISTER-ARG
                       ELSE
                           PERFORM 79-READ-NEXT-PO
                   ELSE
                       IF VIEW-LASTKEY = 4
                           SET HREAD-NEXT-NOT-VALID,
                               HREAD-PRIOR-NOT-VALID TO TRUE
                           MOVE SPACES
                                  TO REGISTERNO OF DINVRCD-I-REC-INV
                           PERFORM 79-READ-NEXT-INV UNTIL
                             REGISTERNO OF DINVRCD-I-REC-INV =
                             REGISTER-ARG
                       ELSE
                           PERFORM 79-READ-NEXT-INV
              ELSE
                   IF REG-INQ
                       PERFORM 79-READ-PRIOR-REG
                   ELSE
                   IF VEN-INQ
                       PERFORM 79-READ-PRIOR-VEN
                   ELSE
                   IF PO-INQ
                       PERFORM 79-READ-PRIOR-PO
                   ELSE
                       PERFORM 79-READ-PRIOR-INV
           ELSE
               IF READ-NEXT
                   IF REG-INQ
                       PERFORM 79-READ-NEXT-HREG
                   ELSE
                   IF VEN-INQ
                       IF VIEW-LASTKEY = 4
                           SET HREAD-NEXT-NOT-VALID,
                               HREAD-PRIOR-NOT-VALID TO TRUE
                           MOVE SPACES
                                  TO REGISTERNO OF DINVRCDH-I-REC-VEN
                           PERFORM 79-READ-NEXT-HVEN UNTIL
                             REGISTERNO OF DINVRCDH-I-REC-VEN =
                             REGISTER-ARG
                       ELSE
                           PERFORM 79-READ-NEXT-HVEN
                   ELSE
                   IF PO-INQ
                       IF VIEW-LASTKEY = 4
                           SET HREAD-NEXT-NOT-VALID,
                               HREAD-PRIOR-NOT-VALID TO TRUE
                           MOVE SPACES
                                  TO REGISTERNO OF DINVRCDH-I-REC-PO
                           PERFORM 79-READ-NEXT-HPO  UNTIL
                             REGISTERNO OF DINVRCDH-I-REC-PO =
                             REGISTER-ARG
                       ELSE
                           PERFORM 79-READ-NEXT-HPO
                   ELSE
                       IF VIEW-LASTKEY = 4
                           SET HREAD-NEXT-NOT-VALID,
                               HREAD-PRIOR-NOT-VALID TO TRUE
                           MOVE SPACES
                                  TO REGISTERNO OF DINVRCDH-I-REC-INV
                           PERFORM 79-READ-NEXT-HINV UNTIL
                             REGISTERNO OF DINVRCDH-I-REC-INV =
                             REGISTER-ARG
                       ELSE
                           PERFORM 79-READ-NEXT-HINV
              ELSE
                   IF REG-INQ
                       PERFORM 79-READ-PRIOR-HREG
                   ELSE
                   IF VEN-INQ
                       PERFORM 79-READ-PRIOR-HVEN
                   ELSE
                   IF PO-INQ
                       PERFORM 79-READ-PRIOR-HPO
                   ELSE
                       PERFORM 79-READ-PRIOR-HINV.

           IF FILE-STATUS = "10" OR "14" OR "46"
               IF READ-ERR-SW = SPACES
                   IF READ-NEXT
                       MOVE "N"     TO READ-NEXT-SW,
                                       READ-ERR-SW
                       GO TO 7-HEADER-INQUIRE
                   ELSE
                       MOVE "Y"     TO READ-NEXT-SW
                       MOVE "P"     TO READ-ERR-SW
                       GO TO 7-HEADER-INQUIRE
               ELSE
                   MOVE 8           TO VIEW-LASTKEY,
                                       SAVE-VIEW-LASTKEY
                   GO TO 7-HEADER-INQUIRE-X.

           MOVE INV-REG-NO             TO BU-DISPLAY-FLD (1).
           IF STORES-DB
               PERFORM 70-LOAD-SCREEN-BUFFERS  THRU  70-LSB-X
           ELSE
               PERFORM 71-LOAD-SCREEN-BUFFERS-HIST  THRU  71-LSBH-X.
           PERFORM 70-DISPLAY-SCREENS  THRU  70-DS-X.
           IF VIEW-LASTKEY = 3 OR 4
               MOVE 0 TO SAVE-VIEW-LASTKEY
               GO TO 7-HEADER-INQUIRE-X.

           GO TO 7-HEADER-INQUIRE.

       7-HEADER-INQUIRE-X.
           EXIT.

       70-DISPLAY-SCREENS.
           IF SCREEN-INDICATOR = 2
               GO TO 72-DISPLAY-INVOICE-AMOUNT
           ELSE
           IF SCREEN-INDICATOR = 3
               GO TO 73-DISPLAY-CE-DEDUCTS
           ELSE
           IF SCREEN-INDICATOR = 4
               GO TO 74-DISPLAY-DIST-COSTS
           ELSE
           IF SCREEN-INDICATOR = 5
               GO TO 75-DISPLAY-PAID-FREIGHT.

      *************************************************************
      *                                                           *
      *       I N V O I C E   H E A D E R   D A T A               *
      *                                                           *
      *************************************************************

       71-DISPLAY-HEADER-DATA.
           MOVE 1  TO  SCREEN-INDICATOR.
           MOVE "INVINQ2"  TO  VIEW-NFNAME.
           MOVE SCREEN-2   TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC TO SCREEN-2.

           IF VIEW-LASTKEY = 3
               MOVE 1 TO SCREEN-INDICATOR
               GO TO 70-DS-X
           ELSE
           IF VIEW-LASTKEY = 4
               GO TO 70-DS-X
           ELSE
           IF VIEW-LASTKEY = 6
               IF HREAD-PRIOR-VALID
                   MOVE "N" TO READ-NEXT-SW
                   GO TO 70-DS-X
               ELSE
      *        **** INVALID FUNCTION KEY *****
                   MOVE 9010 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO   DE2-MSGLINE
                   MOVE B"1"           TO   IND(99)
                   GO TO 71-DISPLAY-HEADER-DATA
           ELSE
           IF VIEW-LASTKEY = 7
               IF HREAD-NEXT-VALID
                   MOVE "Y" TO READ-NEXT-SW
                   GO TO 70-DS-X
               ELSE
      *        **** INVALID FUNCTION KEY *****
                   MOVE 9010 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO   DE2-MSGLINE
                   MOVE B"1"           TO   IND(99)
                   GO TO 71-DISPLAY-HEADER-DATA
           ELSE
           IF VIEW-LASTKEY = 1
               GO TO 72-DISPLAY-INVOICE-AMOUNT
           ELSE
           IF VIEW-LASTKEY = 2
               GO TO 73-DISPLAY-CE-DEDUCTS
           ELSE
           IF VIEW-LASTKEY = 5
               GO TO 74-DISPLAY-DIST-COSTS.

      *    *** PRESS DESIRED FUNCTION KEY ***
           MOVE 16043 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO   DE2-MSGLINE.
           MOVE B"1"           TO   IND(99).
           GO TO 71-DISPLAY-HEADER-DATA.


      *************************************************************
      *                                                           *
      *        I N V O I C E   T O T A L   A M O U N T            *
      *                                                           *
      *************************************************************

       72-DISPLAY-INVOICE-AMOUNT.
           MOVE 2  TO  SCREEN-INDICATOR.
           MOVE "INVINQ3"  TO  VIEW-NFNAME.
           MOVE SCREEN-3   TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC TO SCREEN-3.

           IF VIEW-LASTKEY = 3
               MOVE 1 TO SCREEN-INDICATOR
               GO TO 70-DS-X
           ELSE
           IF VIEW-LASTKEY = 4
               GO TO 70-DS-X
           ELSE
           IF VIEW-LASTKEY = 6
               IF HREAD-PRIOR-VALID
                   MOVE "N" TO READ-NEXT-SW
                   GO TO 70-DS-X
               ELSE
      *        **** INVALID FUNCTION KEY *****
                   MOVE 9010 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO   DE3-MSGLINE
                   MOVE B"1"           TO   IND(99)
                   GO TO 72-DISPLAY-INVOICE-AMOUNT
           ELSE
           IF VIEW-LASTKEY = 7
               IF HREAD-NEXT-VALID
                   MOVE "Y" TO READ-NEXT-SW
                   GO TO 70-DS-X
               ELSE
      *        **** INVALID FUNCTION KEY *****
                   MOVE 9010 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO   DE3-MSGLINE
                   MOVE B"1"           TO   IND(99)
                   GO TO 72-DISPLAY-INVOICE-AMOUNT
           ELSE
           IF VIEW-LASTKEY = 1
               GO TO 71-DISPLAY-HEADER-DATA
           ELSE
           IF VIEW-LASTKEY = 2
               GO TO 73-DISPLAY-CE-DEDUCTS
           ELSE
           IF VIEW-LASTKEY = 5
               GO TO 74-DISPLAY-DIST-COSTS.

      *    *** PRESS DESIRED FUNCTION KEY ***
           MOVE 16043 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO   DE3-MSGLINE.
           MOVE B"1"           TO   IND(99).
           GO TO 72-DISPLAY-INVOICE-AMOUNT.

      *************************************************************
      *                                                           *
      *       I N V O I C E   C E   D E D U C T I O N S           *
      *                                                           *
      *************************************************************

       73-DISPLAY-CE-DEDUCTS.
           MOVE 3  TO  SCREEN-INDICATOR.
           MOVE "INVINQ4"  TO  VIEW-NFNAME.
           MOVE SCREEN-4   TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC TO SCREEN-4.

           IF VIEW-LASTKEY = 3
               MOVE 1 TO SCREEN-INDICATOR
               GO TO 70-DS-X
           ELSE
           IF VIEW-LASTKEY = 4
               GO TO 70-DS-X
           ELSE
           IF VIEW-LASTKEY = 6
               IF HREAD-PRIOR-VALID
                   MOVE "N" TO READ-NEXT-SW
                   GO TO 70-DS-X
               ELSE
      *        **** INVALID FUNCTION KEY *****
                   MOVE 9010 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO   DE2-MSGLINE
                   MOVE B"1"           TO   IND(99)
                   GO TO 73-DISPLAY-CE-DEDUCTS
           ELSE
           IF VIEW-LASTKEY = 7
               IF HREAD-NEXT-VALID
                   MOVE "Y" TO READ-NEXT-SW
                   GO TO 70-DS-X
               ELSE
      *        **** INVALID FUNCTION KEY *****
                   MOVE 9010 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO   DE3-MSGLINE
                   MOVE B"1"           TO   IND(99)
                   GO TO 73-DISPLAY-CE-DEDUCTS
           ELSE
           IF VIEW-LASTKEY = 1
               GO TO 71-DISPLAY-HEADER-DATA
           ELSE
           IF VIEW-LASTKEY = 2
               GO TO 72-DISPLAY-INVOICE-AMOUNT
           ELSE
           IF VIEW-LASTKEY = 5
               GO TO 74-DISPLAY-DIST-COSTS.

      *    *** PRESS DESIRED FUNCTION KEY ***
           MOVE 16043 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO   DE4-MSGLINE.
           MOVE B"1"           TO   IND(99).
           GO TO 73-DISPLAY-CE-DEDUCTS.


      *************************************************************
      *                                                           *
      *       I N V O I C E   D I S T R I B U T E D   C O S T S   *
      *                                                           *
      *************************************************************

       74-DISPLAY-DIST-COSTS.
           MOVE 4  TO  SCREEN-INDICATOR.
           MOVE "INVINQ5"  TO  VIEW-NFNAME.
           MOVE SCREEN-5   TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC TO SCREEN-5.

           IF VIEW-LASTKEY = 3
             MOVE 1 TO SCREEN-INDICATOR
             GO TO 70-DS-X
           ELSE
           IF VIEW-LASTKEY = 4
               GO TO 70-DS-X
           ELSE
           IF VIEW-LASTKEY = 6
               IF HREAD-PRIOR-VALID
                   MOVE "N" TO READ-NEXT-SW
                   GO TO 70-DS-X
               ELSE
      *        **** INVALID FUNCTION KEY *****
                   MOVE 9010 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO   DE2-MSGLINE
                   MOVE B"1"           TO   IND(99)
                   GO TO 74-DISPLAY-DIST-COSTS
           ELSE
           IF VIEW-LASTKEY = 7
               IF HREAD-NEXT-VALID
                   MOVE "Y" TO READ-NEXT-SW
                   GO TO 70-DS-X
               ELSE
      *        **** INVALID FUNCTION KEY *****
                   MOVE 9010 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO   DE3-MSGLINE
                   MOVE B"1"           TO   IND(99)
                   GO TO 74-DISPLAY-DIST-COSTS
           ELSE
           IF VIEW-LASTKEY = 1
               GO TO 71-DISPLAY-HEADER-DATA
           ELSE
           IF VIEW-LASTKEY = 2
               GO TO 73-DISPLAY-CE-DEDUCTS
           ELSE
           IF VIEW-LASTKEY = 5
               GO TO 75-DISPLAY-PAID-FREIGHT.

      *    *** PRESS DESIRED FUNCTION KEY ***
           MOVE 16043 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO   DE5-MSGLINE.
           MOVE B"1"           TO   IND(99).
           GO TO 74-DISPLAY-DIST-COSTS.


      *************************************************************
      *                                                           *
      *       I N V O I C E   P A I D   F R E I G H T             *
      *                                                           *
      *************************************************************

       75-DISPLAY-PAID-FREIGHT.
           MOVE 5  TO  SCREEN-INDICATOR.
           MOVE "INVINQ6"  TO  VIEW-NFNAME.
           MOVE SCREEN-6   TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC TO SCREEN-6.

           IF VIEW-LASTKEY = 3
               MOVE 1 TO SCREEN-INDICATOR
               GO TO 70-DS-X
           ELSE
           IF VIEW-LASTKEY = 4
               GO TO 70-DS-X
           ELSE
           IF VIEW-LASTKEY = 6
               IF HREAD-PRIOR-VALID
                   MOVE "N" TO READ-NEXT-SW
                   GO TO 70-DS-X
               ELSE
      *        **** INVALID FUNCTION KEY *****
                   MOVE 9010 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO   DE2-MSGLINE
                   MOVE B"1"           TO   IND(99)
                   GO TO 75-DISPLAY-PAID-FREIGHT
           ELSE
           IF VIEW-LASTKEY = 7
               IF HREAD-NEXT-VALID
                   MOVE "Y" TO READ-NEXT-SW
                   GO TO 70-DS-X
               ELSE
      *        **** INVALID FUNCTION KEY *****
                   MOVE 9010 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO   DE3-MSGLINE
                   MOVE B"1"           TO   IND(99)
                   GO TO 75-DISPLAY-PAID-FREIGHT
           ELSE
           IF VIEW-LASTKEY = 1
               GO TO 71-DISPLAY-HEADER-DATA
           ELSE
           IF VIEW-LASTKEY = 2
               GO TO 72-DISPLAY-INVOICE-AMOUNT
           ELSE
           IF VIEW-LASTKEY = 5
               GO TO 74-DISPLAY-DIST-COSTS.

      *    *** PRESS DESIRED FUNCTION KEY ***
           MOVE 16043 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO   DE6-MSGLINE.
           MOVE B"1"           TO   IND(99).
           GO TO 75-DISPLAY-PAID-FREIGHT.

       70-DS-X.
           EXIT.


       70-LOAD-SCREEN-BUFFERS.
           MOVE SPACES              TO  SCREEN-2,
                                        SCREEN-3,
                                        SCREEN-4,
                                        SCREEN-5,
                                        SCREEN-6.
           MOVE INV-REG-NO-9        TO  DE2-REG-NUM,
                                        DE3-REG-NUM,
                                        DE4-REG-NUM,
                                        DE5-REG-NUM,
                                        DE6-REG-NUM,
                                        BU-DISPLAY-FLD (1).
           MOVE INV-PO-NO           TO  DE2-PO,
                                        DE3-PO,
                                        DE4-PO,
                                        DE5-PO,
                                        DE6-PO.
           MOVE INV-RLSE            TO  DE2-RLSE,
                                        DE3-RLSE,
                                        DE4-RLSE,
                                        DE5-RLSE,
                                        DE6-RLSE.
           MOVE INV-NO              TO  DE2-INV-NUM,
                                        DE3-INV-NUM,
                                        DE4-INV-NUM,
                                        DE5-INV-NUM,
                                        DE6-INV-NUM.
           MOVE INV-STATUS          TO  DE2-STATUS.
           MOVE INV-MFEST-NO        TO  DE2-MFEST-NO.
           MOVE INV-CHECK-NO        TO  DE2-CHECK-NO.
           MOVE INV-NO-CHECK-INDIC  TO  DE2-NO-CHECK-INDIC.
           MOVE 4                   TO  DATE-MODE.
           IF INV-CHECK-DATE NOT = SPACES
               MOVE INV-CHECK-DATE  TO  DATE-VALIDATE-IN
               CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
               MOVE DATE-SLASH-OUT  TO  DE2-CHECK-DATE.
           IF INV-DATE NOT = SPACE
               MOVE INV-DATE        TO  DATE-VALIDATE-IN
               CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
               MOVE DATE-SLASH-OUT  TO  DE2-INV-DATE.
           IF INV-DUE-DATE NOT = SPACE
               MOVE INV-DUE-DATE    TO  DATE-VALIDATE-IN
               CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
               MOVE DATE-SLASH-OUT  TO  DE2-DUE-DATE.
           MOVE INV-TERMS           TO  DE2-INV-TERMS.
           IF INV-ENTRY-DATE NOT = SPACE
               MOVE INV-ENTRY-DATE  TO  DATE-VALIDATE-IN
               CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
               MOVE DATE-SLASH-OUT  TO  DE2-ENTRY-DATE.
           IF INV-MOD-DATE NOT = SPACE
               MOVE INV-MOD-DATE    TO  DATE-VALIDATE-IN
               CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
               MOVE DATE-SLASH-OUT  TO  DE2-MOD-DATE.
           MOVE INV-ADD-CLERK       TO  DE2-ADD-CLERK.
           MOVE INV-MOD-CLERK       TO  DE2-MOD-CLERK.
           MOVE CE1-CODE            TO  DE2-MATL-CE,
                                        DE3-INV-CE,
                                        DE4-INV-CE.
           MOVE CE1-ACCTG-DATA      TO  DE3-INV-CE-ACCTG,
                                        DE4-INV-CE-ACCTG.
           MOVE INV-I-MATL-EXT      TO  DE2-I-MATL-EXT.
           MOVE INV-P-MATL-EXT      TO  DE2-P-MATL-EXT.
           MOVE INV-PAYMENT-IND     TO  DE2-PAYMENT-IND.
           MOVE INV-NET-DUE-VENDOR  TO  DE2-NET-DUE-VENDOR,
                                        DE4-NET-DUE-VENDOR,
                                        DE5-NET-DUE-VENDOR.
           MOVE INV-DIST-COST       TO  DE2-DIST-COST,
                                        DE5-DIST-COST.
0692CK     MOVE INV-RCVR-NO         TO  DE2-RCVR.
           MOVE INV-VEN-CODE        TO  DE2-VEN-CODE.
           MOVE INV-FREE-VERB       TO  DE2-HOLD-OPT-VERBAGE.
           MOVE CE1-TOTAL           TO  DE3-INV-AMT,
                                        DE4-ORIG-INV-AMT.
           IF INV-PAYMENT-IND = "P"
               ADD  INV-P-MATL-EXT
                    INV-ADD-VFRT
                    INV-ADD-INS
                    INV-ADD-TAX
                    INV-ADD-CTNRS
                    INV-ADD-OTHER  GIVING  DE3-CALC-INV-AMT,
                                           DE4-CALC-INV-AMT
               MOVE  INV-P-MATL-EXT TO  DE3-MATL-EXT
           ELSE
           IF INV-PAYMENT-IND = "I"
               ADD  INV-I-MATL-EXT
                    INV-ADD-VFRT
                    INV-ADD-INS
                    INV-ADD-TAX
                    INV-ADD-CTNRS
                    INV-ADD-OTHER  GIVING  DE3-CALC-INV-AMT,
                                           DE4-CALC-INV-AMT
               MOVE  INV-I-MATL-EXT TO  DE3-MATL-EXT
           ELSE
               MOVE ZEROS           TO  DE3-MATL-EXT.

           PERFORM 701-GET-FOB  THRU  701-GF-X.
           MOVE INV-ADD-VFRT        TO  DE3-VEN-FRT.
           MOVE INV-ADD-INS         TO  DE3-VEN-INS.
           MOVE INV-ADD-TAX         TO  DE3-VEN-TAX.
           MOVE INV-TAX-CODE        TO  DE3-TAX-CODE.
           MOVE INV-ADD-CTNRS       TO  DE3-VEN-CTNRS.
           MULTIPLY INV-ADD-CTNRS BY -1  GIVING  DE5-CTNRS.
           MOVE INV-ADD-OTHER       TO  DE3-VEN-OTHER.
           MOVE CE6-EXT-ERR         TO  DE4-CE6-EXT-ERR.
           MOVE CE7-UPRC-ERR        TO  DE4-CE7-UP-ERR.
           MOVE CE8-OTHER           TO  DE4-CE8-OTHER.
           MOVE CE3-FRT             TO  DE4-CE3-FRT.
           MOVE CE4-INS             TO  DE4-CE4-INS.
           MOVE CE5-TAX             TO  DE4-CE5-TAX.
           MOVE CE9-CASH-DSCNT      TO  DE4-CE9-CASHD.
           MULTIPLY CE9-CASH-DSCNT  BY  -1  GIVING  DE5-CASH-DSCNT.
           IF CE-EXT-ACCTG-DATA-1 = "113930000"
               MOVE CE-EXT-VALUE-1  TO  DE4-CPW
               MULTIPLY CE-EXT-VALUE-1  BY  -1  GIVING DE5-CPW
           ELSE
               MOVE CE-EXT-CODE-1   TO  DE4-OTHER-CE
               MOVE CE-EXT-VALUE-1  TO  DE4-OTHER-CE-AMT
               MOVE CE-EXT-ACCTG-DATA-1  TO  DE4-OTHER-CE-ACCT.
           MOVE INV-CPW-CODE        TO  DE4-CPW-CODE.
           MOVE INV-TOTAL-CFRT      TO  DE5-TOTAL-GDYR-FRT.
           PERFORM 701-LOAD-TAX-DISTRICTS  THRU  701-LTD-X.
           PERFORM 701-MOVE-ACCRUED-TAX  THRU  701-MAT-X
               VARYING SUB FROM 1 BY 1
                   UNTIL SUB > 4.
           MOVE INV-ADJ-OTHER       TO  DE5-OTHER.
           PERFORM 701-GET-FRT-DATA  THRU  701-GFD-X.

           IF TYPE-INV-INQ-SW = "R"
               NEXT SENTENCE
           ELSE
           IF HREAD-NEXT-VALID AND HREAD-PRIOR-VALID
      *    *** PRESS 'f6' TO REVIEW PRIOR; 'f7' TO REVIEW NEXT INVOICE ***
               MOVE 16099 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER           TO DE2-MSG-LINE,
                                                DE3-MSG-LINE,
                                                DE4-MSG-LINE,
                                                DE5-MSG-LINE,
                                                DE6-MSG-LINE
           ELSE
           IF HREAD-PRIOR-VALID
      *    *** PRESS 'f6' TO REVIEW PRIOR INVOICE                      ***
               MOVE 16101 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER           TO DE2-MSG-LINE,
                                                DE3-MSG-LINE,
                                                DE4-MSG-LINE,
                                                DE5-MSG-LINE,
                                                DE6-MSG-LINE
           ELSE
           IF HREAD-NEXT-VALID
      *    *** PRESS 'f7' TO REVIEW NEXT INVOICE                       ***
               MOVE 16100 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER           TO DE2-MSG-LINE,
                                                DE3-MSG-LINE,
                                                DE4-MSG-LINE,
                                                DE5-MSG-LINE,
                                                DE6-MSG-LINE
             ELSE
               MOVE SPACES                   TO DE2-MSG-LINE,
                                                DE3-MSG-LINE,
                                                DE4-MSG-LINE,
                                                DE5-MSG-LINE,
                                                DE6-MSG-LINE.
       70-LSB-X.
           EXIT.

       701-GET-FOB.
           MOVE INV-PO-RCV-NO   TO  PO-ARG.
           MOVE PO-ARG          TO  PORCVNO OF DPORECD-I-REC.
           READ DPORECD-I INTO BUF-DPORECD
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ DPORECD *701-GF"     TO  BU-DISPLAY-MSG
               MOVE PO-ARG  TO  BU-DISPLAY-FLD (2)
               GO TO  2-BLOWUP.


           MOVE PO-FOB          TO  DE3-FOB.

      *------- IF IT'S A DUTY INVOICE, DEFAULT TO CANADIAN CURRENCY
      *------- CODE; DON'T USE PO CURRENCY CODE.
           MOVE INV-NO          TO  INV-CHAR-1-5.
           IF (PO-CURRENCY-CODE NOT = SPACES)
                                OR  INV-CHAR-1-5 = "DUTY-"
                                OR  INV-CURR-CODE NOT = SPACES
               IF INV-CHAR-1-5 = "DUTY-"
                   MOVE "08"               TO  VALIDUM OF MVALIDUM-I-REC
                                               DE2-CUR-CODE
               ELSE
                   IF INV-CURR-CODE NOT = SPACES
                       MOVE INV-CURR-CODE  TO  VALIDUM OF MVALIDUM-I-REC
                                               DE2-CUR-CODE
               ELSE
                   MOVE  PO-CURRENCY-CODE  TO  VALIDUM OF MVALIDUM-I-REC
                                               DE2-CUR-CODE
               END-IF
               READ MVALIDUM-I INTO BUF-MVALIDUM
                 INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS NOT = "00"
                   MOVE "READ  MVALIDUM*701-GF"   TO  BU-DISPLAY-MSG
                   GO TO 2-BLOWUP
               ELSE
                   MOVE VALID-CURRENCY-DESC       TO  DE2-CUR-CODE-DESC.

       701-GF-X.
           EXIT.

       701-GET-FRT-DATA.
           MOVE INV-REG-NO   TO  REGISTER-ARG.
           MOVE ZERO         TO  FRT-SUB.
           MOVE REGISTER-ARG TO  REGISTERNO OF DPOFREIGHT-I-REC.
           START DPOFREIGHT-I KEY = REGISTERNO OF DPOFREIGHT-I-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 701-GFD-X
               ELSE
                   MOVE "START DPOFREIGHT*701-GFD"  TO  BU-DISPLAY-MSG
                   GO TO  2-BLOWUP.

       701-DPOFREIGHT-LOOP.
           ADD 1  TO  FRT-SUB.
           IF FRT-SUB > 10
               GO TO 701-GFD-X.
           READ DPOFREIGHT-I NEXT INTO BUF-DPOFREIGHT
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO 701-GFD-X
               ELSE
                   MOVE "READN DPOFREIGHT*701-DL"  TO  BU-DISPLAY-MSG
                   GO TO  2-BLOWUP.
           IF REGISTERNO OF DPOFREIGHT-I-REC NOT = REGISTER-ARG
               GO TO 701-GFD-X.

           ADD 1                   TO  FRT-SUB.
           MOVE FRT-PO-RS          TO  DE6-RCVR (FRT-SUB).
           MOVE FRT-CARRIER        TO  DE6-CARRIER-CODE (FRT-SUB).
           MOVE FRT-BILL-NO        TO  DE6-PRO-NUMBER (FRT-SUB).
           MOVE FRT-RAIL-CAR       TO  DE6-CAR-NO (FRT-SUB).
           MOVE FRT-CHARGES-9      TO  DE6-FRT-AMOUNT (FRT-SUB).
           GO TO 701-DPOFREIGHT-LOOP.

       701-GFD-X.
           EXIT.


       701-LOAD-TAX-DISTRICTS.
           MOVE "PTX1"      TO PLTINFOKEY OF MPLTINFO-I-REC.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ MPLTINFO 701-LTD PTX1"  TO  BU-DISPLAY-MSG
               MOVE PLT-ARG                  TO  BU-DISPLAY-FLD (2)
               GO TO 2-BLOWUP.

           MOVE MPLTINFO-TAX-DISTRICT (1)
                                   TO  DE5-ATAX-DISTRICT (1).
           MOVE MPLTINFO-TAX-DISTRICT (2)
                                   TO  DE5-ATAX-DISTRICT (2).
           MOVE MPLTINFO-TAX-CE-ACCTG (1)
                                   TO  DE5-ATAX-ACCTG (1).
           MOVE MPLTINFO-TAX-CE-ACCTG (2)
                                   TO  DE5-ATAX-ACCTG (2).

           MOVE "PTX2"      TO PLTINFOKEY OF MPLTINFO-I-REC.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   NEXT SENTENCE
               ELSE
                   MOVE "GET MPLTINFO 701-LTD PTX2" TO BU-DISPLAY-MSG
                   MOVE PLT-ARG  TO  BU-DISPLAY-FLD (2)
                   GO TO 2-BLOWUP
           ELSE
               MOVE MPLTINFO-TAX-DISTRICT (1)
                                       TO  DE5-ATAX-DISTRICT (3)
               MOVE MPLTINFO-TAX-DISTRICT (2)
                                       TO  DE5-ATAX-DISTRICT (4)
               MOVE MPLTINFO-TAX-CE-ACCTG (1)
                                      TO  DE5-ATAX-ACCTG (3)
               MOVE MPLTINFO-TAX-CE-ACCTG (2)
                                      TO  DE5-ATAX-ACCTG (4).

       701-LTD-X.
           EXIT.

       701-MOVE-ACCRUED-TAX.
           MOVE INV-ATAX-AMT (SUB)  TO  DE5-ACCRUED-TAX (SUB).

       701-MAT-X.
           EXIT.

       71-LOAD-SCREEN-BUFFERS-HIST.
           MOVE SPACES              TO  SCREEN-1,
                                        SCREEN-2,
                                        SCREEN-3,
                                        SCREEN-4,
                                        SCREEN-5.
           MOVE HISTORY-DB-LIT      TO  DE2-HISTORY-LIT,
                                        DE3-HISTORY-LIT,
                                        DE4-HISTORY-LIT,
                                        DE5-HISTORY-LIT,
                                        DE6-HISTORY-LIT.
           MOVE INVH-REG-NO-9       TO  DE2-REG-NUM,
                                        DE3-REG-NUM,
                                        DE4-REG-NUM,
                                        DE5-REG-NUM,
                                        DE6-REG-NUM,
                                        BU-DISPLAY-FLD (1).
           MOVE INVH-PO-NO          TO  DE2-PO,
                                        DE3-PO,
                                        DE4-PO,
                                        DE5-PO,
                                        DE6-PO.
           MOVE INVH-RLSE           TO  DE2-RLSE,
                                        DE3-RLSE,
                                        DE4-RLSE,
                                        DE5-RLSE,
                                        DE6-RLSE.
           MOVE INVH-NO             TO  DE2-INV-NUM,
                                        DE3-INV-NUM,
                                        DE4-INV-NUM,
                                        DE5-INV-NUM,
                                        DE6-INV-NUM.
           MOVE INVH-STATUS         TO  DE2-STATUS.
           MOVE INVH-MFEST-NO       TO  DE2-MFEST-NO.
           MOVE INVH-CHECK-NO       TO  DE2-CHECK-NO.
           MOVE INVH-NO-CHECK-INDIC TO  DE2-NO-CHECK-INDIC.
           MOVE 4                   TO  DATE-MODE.
           IF INVH-CHECK-DATE NOT = ZEROS
      *------SUBTRACT 19M OR 20M BEFORE DATE REFORMAT
               MOVE 4 TO DATE-MODE
               MOVE INVH-CHECK-DATE TO TEMP-DATE-9
               IF TEMP-YEAR > 70
                   COMPUTE DISPLAY-DATE = INVH-CHECK-DATE - 19000000
               ELSE
                   COMPUTE DISPLAY-DATE = INVH-CHECK-DATE - 20000000
               END-IF
               MOVE DISPLAY-DATE TO DATE-VALIDATE-IN
      *--------MOVE INVH-CHECK-DATE TO  DATE-VALIDATE-IN
               CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
               MOVE DATE-SLASH-OUT  TO  DE2-CHECK-DATE.
           IF INVH-DATE NOT = ZEROS
      *------SUBTRACT 19M OR 20M BEFORE DATE REFORMAT
               MOVE 4 TO DATE-MODE
               MOVE INVH-DATE       TO TEMP-DATE-9
               IF TEMP-YEAR > 70
                   COMPUTE DISPLAY-DATE = INVH-DATE - 19000000
               ELSE
                   COMPUTE DISPLAY-DATE = INVH-DATE - 20000000
               END-IF
               MOVE DISPLAY-DATE TO DATE-VALIDATE-IN
      *--------MOVE INVH-DATE       TO  DATE-VALIDATE-IN
               CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
               MOVE DATE-SLASH-OUT  TO  DE2-INV-DATE.
           IF INVH-DUE-DATE NOT = ZEROS
      *------SUBTRACT 19M OR 20M BEFORE DATE REFORMAT
               MOVE 4 TO DATE-MODE
               MOVE INVH-DUE-DATE   TO TEMP-DATE-9
               IF TEMP-YEAR > 70
                   COMPUTE DISPLAY-DATE = INVH-DUE-DATE - 19000000
               ELSE
                   COMPUTE DISPLAY-DATE = INVH-DUE-DATE - 20000000
               END-IF
               MOVE DISPLAY-DATE    TO DATE-VALIDATE-IN
      *--------MOVE INVH-DUE-DATE   TO  DATE-VALIDATE-IN
               CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
               MOVE DATE-SLASH-OUT  TO  DE2-DUE-DATE.
           MOVE INVH-TERMS          TO  DE2-INV-TERMS.
           IF INVH-ENTRY-DATE NOT = ZEROS
      *------SUBTRACT 19M OR 20M BEFORE DATE REFORMAT
               MOVE 4 TO DATE-MODE
               MOVE INVH-ENTRY-DATE TO TEMP-DATE-9
               IF TEMP-YEAR > 70
                   COMPUTE DISPLAY-DATE = INVH-ENTRY-DATE - 19000000
               ELSE
                   COMPUTE DISPLAY-DATE = INVH-ENTRY-DATE - 20000000
               END-IF
               MOVE DISPLAY-DATE    TO DATE-VALIDATE-IN
      *--------MOVE INVH-ENTRY-DATE TO  DATE-VALIDATE-IN
               CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
               MOVE DATE-SLASH-OUT  TO  DE2-ENTRY-DATE.
           IF INVH-MOD-DATE NOT = ZEROS
      *------SUBTRACT 19M OR 20M BEFORE DATE REFORMAT
               MOVE 4 TO DATE-MODE
               MOVE INVH-MOD-DATE   TO TEMP-DATE-9
               IF TEMP-YEAR > 70
                   COMPUTE DISPLAY-DATE = INVH-MOD-DATE - 19000000
               ELSE
                   COMPUTE DISPLAY-DATE = INVH-MOD-DATE - 20000000
               END-IF
               MOVE DISPLAY-DATE    TO DATE-VALIDATE-IN
      *--------MOVE INVH-MOD-DATE   TO  DATE-VALIDATE-IN
               CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
               MOVE DATE-SLASH-OUT  TO  DE2-MOD-DATE.
           MOVE INVH-ADD-CLERK      TO  DE2-ADD-CLERK.
           MOVE INVH-MOD-CLERK      TO  DE2-MOD-CLERK.
           MOVE CEH1-CODE           TO  DE2-MATL-CE,
                                        DE3-INV-CE,
                                        DE4-INV-CE.
           MOVE CEH1-ACCTG-DATA     TO  DE3-INV-CE-ACCTG,
                                        DE4-INV-CE-ACCTG.
           MOVE INVH-I-MATL-EXT     TO  DE2-I-MATL-EXT.
           MOVE INVH-P-MATL-EXT     TO  DE2-P-MATL-EXT.
           MOVE INVH-PAYMENT-IND    TO  DE2-PAYMENT-IND.
           MOVE INVH-NET-DUE-VENDOR TO  DE2-NET-DUE-VENDOR,
                                        DE4-NET-DUE-VENDOR,
                                        DE5-NET-DUE-VENDOR.
           MOVE INVH-DIST-COST      TO  DE2-DIST-COST,
                                        DE5-DIST-COST.
           MOVE INVH-VEN-CODE       TO  DE2-VEN-CODE.
1293BK     MOVE INVH-RCVR-NO        TO  DE2-RCVR.
           MOVE INVH-FREE-VERB      TO  DE2-HOLD-OPT-VERBAGE.
           MOVE CEH1-TOTAL          TO  DE3-INV-AMT,
                                        DE4-ORIG-INV-AMT.
           IF INVH-PAYMENT-IND = "P"
               ADD  INVH-P-MATL-EXT
                    INVH-ADD-VFRT
                    INVH-ADD-INS
                    INVH-ADD-TAX
                    INVH-ADD-CTNRS
                    INVH-ADD-OTHER  GIVING  DE3-CALC-INV-AMT,
                                            DE4-CALC-INV-AMT
               MOVE  INVH-P-MATL-EXT TO  DE3-MATL-EXT
           ELSE
           IF INVH-PAYMENT-IND = "I"
               ADD  INVH-I-MATL-EXT
                    INVH-ADD-VFRT
                    INVH-ADD-INS
                    INVH-ADD-TAX
                    INVH-ADD-CTNRS
                    INVH-ADD-OTHER  GIVING  DE3-CALC-INV-AMT,
                                            DE4-CALC-INV-AMT
               MOVE  INVH-I-MATL-EXT TO  DE3-MATL-EXT
           ELSE
               MOVE ZEROS           TO  DE3-MATL-EXT.

           PERFORM 711-GET-FOB  THRU  711-GF-X.
           MOVE INVH-ADD-VFRT       TO  DE3-VEN-FRT.
           MOVE INVH-ADD-INS        TO  DE3-VEN-INS.
           MOVE INVH-ADD-TAX        TO  DE3-VEN-TAX.
           MOVE INVH-TAX-CODE       TO  DE3-TAX-CODE.
           MOVE INVH-ADD-CTNRS      TO  DE3-VEN-CTNRS.
           MULTIPLY INVH-ADD-CTNRS BY -1  GIVING  DE5-CTNRS.
           MOVE INVH-ADD-OTHER      TO  DE3-VEN-OTHER.
           MOVE CEH6-EXT-ERR        TO  DE4-CE6-EXT-ERR.
           MOVE CEH7-UPRC-ERR       TO  DE4-CE7-UP-ERR.
           MOVE CEH8-OTHER          TO  DE4-CE8-OTHER.
           MOVE CEH3-FRT            TO  DE4-CE3-FRT.
           MOVE CEH4-INS            TO  DE4-CE4-INS.
           MOVE CEH5-TAX            TO  DE4-CE5-TAX.
           MOVE CEH9-CASH-DSCNT     TO  DE4-CE9-CASHD.
           MULTIPLY CEH9-CASH-DSCNT  BY  -1  GIVING  DE5-CASH-DSCNT.
           IF CEH-EXT-ACCTG-DATA-1 = "113930000"
               MOVE CEH-EXT-VALUE-1  TO  DE4-CPW
               MULTIPLY CEH-EXT-VALUE-1  BY  -1  GIVING DE5-CPW
           ELSE
               MOVE CEH-EXT-CODE-1   TO  DE4-OTHER-CE
               MOVE CEH-EXT-VALUE-1  TO  DE4-OTHER-CE-AMT
               MOVE CEH-EXT-ACCTG-DATA-1  TO  DE4-OTHER-CE-ACCT.
           MOVE INVH-CPW-CODE       TO  DE4-CPW-CODE.
           MOVE INVH-TOTAL-CFRT     TO  DE5-TOTAL-GDYR-FRT.
           PERFORM 701-LOAD-TAX-DISTRICTS  THRU  701-LTD-X.
           PERFORM 711-MOVE-ACCRUED-TAX  THRU  711-MAT-X
               VARYING SUB FROM 1 BY 1
                   UNTIL SUB > 4.
           MOVE INVH-ADJ-OTHER      TO  DE5-OTHER.
           PERFORM 711-GET-FRT-DATA  THRU  711-GFD-X.


           IF TYPE-INV-INQ-SW = "R"
               NEXT SENTENCE
           ELSE
           IF HREAD-NEXT-VALID AND HREAD-PRIOR-VALID
      *    *** PRESS 'f6' TO REVIEW PRIOR; 'f7' TO REVIEW NEXT INVOICE ***
               MOVE 16099 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER           TO DE2-MSG-LINE,
                                                DE3-MSG-LINE,
                                                DE4-MSG-LINE,
                                                DE5-MSG-LINE,
                                                DE6-MSG-LINE
           ELSE
           IF HREAD-PRIOR-VALID
      *    *** PRESS 'f6' TO REVIEW PRIOR INVOICE                      ***
               MOVE 16101 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER           TO DE2-MSG-LINE,
                                                DE3-MSG-LINE,
                                                DE4-MSG-LINE,
                                                DE5-MSG-LINE,
                                                DE6-MSG-LINE
           ELSE
           IF HREAD-NEXT-VALID
      *    *** PRESS 'f7' TO REVIEW NEXT INVOICE                       ***
               MOVE 16100 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER           TO DE2-MSG-LINE,
                                                DE3-MSG-LINE,
                                                DE4-MSG-LINE,
                                                DE5-MSG-LINE,
                                                DE6-MSG-LINE
             ELSE
               MOVE SPACES                   TO DE2-MSG-LINE,
                                                DE3-MSG-LINE,
                                                DE4-MSG-LINE,
                                                DE5-MSG-LINE,
                                                DE6-MSG-LINE.

       71-LSBH-X.
           EXIT.



       711-GET-FOB.
           MOVE INVH-PO-RCV-NO   TO  PO-ARG.
           MOVE INVH-PO-RCV-NO   TO  PORCVNO OF DPORECDH-I-REC.
           READ DPORECDH-I INTO BUF-DPORECD-H
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ DPORECD *711-GF"     TO  BU-DISPLAY-MSG
               MOVE PO-ARG  TO  BU-DISPLAY-FLD (2)
               GO TO  2-BLOWUP.

           MOVE POH-FOB         TO  DE3-FOB.

      *------- IF IT'S A DUTY INVOICE, DEFAULT TO CANADIAN CURRENCY
      *------- CODE; DON'T USE PO CURRENCY CODE.
           MOVE INVH-NO         TO  INV-CHAR-1-5.
           IF (POH-CURRENCY-CODE NOT = SPACES) OR
                                        (INV-CHAR-1-5 = "DUTY-")
               IF INV-CHAR-1-5 = "DUTY-"
                   MOVE "08"               TO  VALIDUM OF MVALIDUM-I-REC
               ELSE
                   MOVE POH-CURRENCY-CODE  TO  VALIDUM OF MVALIDUM-I-REC
               END-IF
               READ MVALIDUM-I INTO BUF-MVALIDUM
                 INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS NOT = "00"
                   MOVE "READ MVALIDUM*711-GF"   TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP
               ELSE
                   MOVE  VALID-CURRENCY-DESC     TO  DE2-CUR-CODE-DESC
                   IF INV-CHAR-1-5 = "DUTY-"
                       MOVE "08"                 TO  DE2-CUR-CODE
                   ELSE
                       MOVE  POH-CURRENCY-CODE   TO  DE2-CUR-CODE.

       711-GF-X.
           EXIT.

       711-GET-FRT-DATA.
           MOVE ZERO          TO  FRT-SUB.
           MOVE INVH-REG-NO   TO  REGISTER-ARG,
                                  REGISTERNO OF DPOFREIGHTH-I-REC.
           START DPOFREIGHTH-I KEY = REGISTERNO OF DPOFREIGHTH-I-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 711-GFD-X
               ELSE
                   MOVE "START DPOFREIGHT*711-GFD"  TO  BU-DISPLAY-MSG
                   GO TO  2-BLOWUP.

       711-DPOFREIGHT-LOOP.
           ADD 1  TO  FRT-SUB.
           IF FRT-SUB > 10
               GO TO 711-GFD-X.
           READ DPOFREIGHTH-I NEXT INTO BUF-DPOFREIGHT-H
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO  711-GFD-X
               ELSE
                   MOVE "READN DPOFREIGHTH*711-DL"  TO  BU-DISPLAY-MSG
                   GO TO  2-BLOWUP.
                   MOVE 99 TO COND-WORD.
           IF REGISTERNO OF DPOFREIGHTH-I-REC NOT = REGISTER-ARG
               GO TO  711-GFD-X.

           ADD 1                   TO  FRT-SUB.
           MOVE FRTH-PO-RS         TO  DE6-RCVR (FRT-SUB).
           MOVE FRTH-CARRIER       TO  DE6-CARRIER-CODE (FRT-SUB).
           MOVE FRTH-BILL-NO       TO  DE6-PRO-NUMBER (FRT-SUB).
           MOVE FRTH-RAIL-CAR      TO  DE6-CAR-NO (FRT-SUB).
           MOVE FRTH-CHARGES       TO  DE6-FRT-AMOUNT (FRT-SUB).
           GO TO 711-DPOFREIGHT-LOOP.

       711-GFD-X.
           EXIT.


       711-MOVE-ACCRUED-TAX.
           MOVE INVH-ATAX-AMT (SUB)  TO  DE5-ACCRUED-TAX (SUB).

       711-MAT-X.
           EXIT.

       79-READ-NEXT-REG.
           READ DINVRCD-I-REG NEXT INTO BUF-DINVRCD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
                   MOVE "READN DINVRCD-I-REG*79-READ-NEXT-REG"
                       TO BU-DISPLAY-MSG
                   MOVE REGISTER-ARG      TO BU-DISPLAY-FLD (1)
                   GO TO 2-BLOWUP.
           IF REGISTERNO OF DINVRCD-I-REC-REG NOT = REGISTER-ARG
               MOVE "10" TO FILE-STATUS.

       79-READ-NEXT-VEN.
           READ DINVRCD-I-VEN NEXT
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
                   MOVE "READN DINVRCD-I-VEN*79-READ-NEXT-VEN"
                       TO BU-DISPLAY-MSG
                   MOVE REGISTER-ARG      TO BU-DISPLAY-FLD (1)
                   GO TO 2-BLOWUP.
           IF VENCDE OF DINVRCD-I-REC-VEN NOT = VEN-ARG
               MOVE "10" TO FILE-STATUS.

           IF FILE-STATUS = "00"
               MOVE HREAD-NEXT-VALID-SW TO HREAD-PRIOR-VALID-SW
               READ DINVRCD-I-VEN NEXT
                   AT END MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS EQUAL "00" AND
                  VENCDE OF DINVRCD-I-REC-VEN EQUAL VEN-ARG
                 SET HREAD-NEXT-VALID TO TRUE
               ELSE
                 SET HREAD-NEXT-NOT-VALID TO TRUE
               END-IF
               IF FILE-STATUS EQUAL "10"
                 READ DINVRCD-I-VEN LAST INTO BUF-DINVRCD
                   AT END MOVE FILE-STATUS TO FILE-STATUS
                 END-READ
               ELSE
                 READ DINVRCD-I-VEN PRIOR INTO BUF-DINVRCD
                   AT END MOVE FILE-STATUS TO FILE-STATUS
                 END-READ
               END-IF
               IF FILE-STATUS NOT = "00" OR
                  INV-VEN-CODE NOT EQUAL VEN-ARG
                 MOVE "10" TO FILE-STATUS
               END-IF
           END-IF.

       79-READ-NEXT-PO.
           READ DINVRCD-I-PO NEXT
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
                   MOVE "READN DINVRCD-I*79-READ-NEXT-PO"
                       TO BU-DISPLAY-MSG
                   MOVE PO-ARG TO BU-DISPLAY-FLD (1)
                   GO TO 2-BLOWUP.
           IF PORCVNO OF DINVRCD-I-REC-PO NOT = PO-ARG
               MOVE "10" TO FILE-STATUS.

           IF FILE-STATUS EQUAL "00"
               MOVE HREAD-NEXT-VALID-SW TO HREAD-PRIOR-VALID-SW
               READ DINVRCD-I-PO NEXT
                   AT END MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS EQUAL "00" AND
                  PORCVNO OF DINVRCD-I-REC-PO EQUAL PO-ARG
                 SET HREAD-NEXT-VALID TO TRUE
               ELSE
                 SET HREAD-NEXT-NOT-VALID TO TRUE
               END-IF
               IF FILE-STATUS EQUAL "10"
                 READ DINVRCD-I-PO LAST INTO BUF-DINVRCD
                   AT END MOVE FILE-STATUS TO FILE-STATUS
                 END-READ
               ELSE
                 READ DINVRCD-I-PO PRIOR INTO BUF-DINVRCD
                   AT END MOVE FILE-STATUS TO FILE-STATUS
                 END-READ
               END-IF
               IF FILE-STATUS NOT = "00" OR
                  INV-PO-RCV-NO NOT EQUAL PO-ARG
                 MOVE "10" TO FILE-STATUS
               END-IF
           END-IF.

       79-READ-NEXT-INV.
           READ DINVRCD-I-INV NEXT
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
                   MOVE "READN DINVRCD-I-INV*79-READ-NEXT-INV"
                       TO BU-DISPLAY-MSG
                   MOVE REGISTER-ARG      TO BU-DISPLAY-FLD (1)
                   GO TO 2-BLOWUP.
           IF INVOICENO OF DINVRCD-I-REC-INV NOT = INV-ARG
               MOVE "10" TO FILE-STATUS.

           IF FILE-STATUS = "00"
               MOVE HREAD-NEXT-VALID-SW TO HREAD-PRIOR-VALID-SW
               READ DINVRCD-I-INV NEXT
                   AT END MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS EQUAL "00" AND
                  INVOICENO OF DINVRCD-I-REC-INV EQUAL INV-ARG
                 SET HREAD-NEXT-VALID TO TRUE
               ELSE
                 SET HREAD-NEXT-NOT-VALID TO TRUE
               END-IF
               IF FILE-STATUS EQUAL "10"
                 READ DINVRCD-I-INV LAST INTO BUF-DINVRCD
                   AT END MOVE FILE-STATUS TO FILE-STATUS
                 END-READ
               ELSE
                 READ DINVRCD-I-INV PRIOR INTO BUF-DINVRCD
                   AT END MOVE FILE-STATUS TO FILE-STATUS
                 END-READ
               END-IF
               IF FILE-STATUS NOT = "00" OR
                  INV-NO NOT EQUAL INV-ARG
                 MOVE "10" TO FILE-STATUS
               END-IF
           END-IF.

       79-READ-PRIOR-REG.
           READ DINVRCD-I-REG PRIOR INTO BUF-DINVRCD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
                   MOVE "READP DINVRCD-I-REG*79-READ-PRIOR-REG"
                       TO BU-DISPLAY-MSG
                   MOVE REGISTER-ARG      TO BU-DISPLAY-FLD (1)
                   GO TO 2-BLOWUP.
           IF REGISTERNO OF DINVRCD-I-REC-REG NOT = REGISTER-ARG
               MOVE "10" TO FILE-STATUS.

       79-READ-PRIOR-VEN.
           READ DINVRCD-I-VEN PRIOR INTO BUF-DINVRCD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
                   MOVE "READP DINVRCD-I-VEN*79-READ-PRIOR-VEN"
                       TO BU-DISPLAY-MSG
                   MOVE REGISTER-ARG      TO BU-DISPLAY-FLD (1)
                   GO TO 2-BLOWUP.
           IF VENCDE OF DINVRCD-I-REC-VEN NOT = VEN-ARG
               MOVE "10" TO FILE-STATUS.

           IF FILE-STATUS = "00"
               SET HREAD-NEXT-VALID TO TRUE
               READ DINVRCD-I-VEN PRIOR
                   AT END MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS EQUAL "00" AND
                  VENCDE OF DINVRCD-I-REC-VEN EQUAL VEN-ARG
                 SET HREAD-PRIOR-VALID TO TRUE
               ELSE
                 SET HREAD-PRIOR-NOT-VALID TO TRUE
                 IF FILE-STATUS NOT EQUAL "00"
                   MOVE VEN-ARG TO VENCDE OF DINVRCD-I-REC-VEN
                   START DINVRCD-I-VEN KEY >=
                     VENCDE OF DINVRCD-I-REC-VEN
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                   END-START
                 END-IF
               END-IF
               READ DINVRCD-I-VEN NEXT INTO BUF-DINVRCD
                   AT END MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS NOT = "00" OR
                  INV-VEN-CODE NOT EQUAL VEN-ARG
                   MOVE "10" TO FILE-STATUS
               END-IF
           END-IF.

       79-READ-PRIOR-PO.
           READ DINVRCD-I-PO PRIOR
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
                   MOVE "READP DINVRCD-I*79-READ-PRIOR-PO"
                       TO BU-DISPLAY-MSG
                   MOVE PO-ARG            TO BU-DISPLAY-FLD (1)
                   GO TO 2-BLOWUP.
           IF PORCVNO  OF DINVRCD-I-REC-PO NOT = PO-ARG
               MOVE "10" TO FILE-STATUS.

           IF FILE-STATUS = "00"
               SET HREAD-NEXT-VALID TO TRUE
               READ DINVRCD-I-PO PRIOR
                   AT END MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS EQUAL "00" AND
                  PORCVNO OF DINVRCD-I-REC-PO EQUAL PO-ARG
                 SET HREAD-PRIOR-VALID TO TRUE
               ELSE
                 SET HREAD-PRIOR-NOT-VALID TO TRUE
                 IF FILE-STATUS NOT EQUAL "00"
                   MOVE PO-ARG TO PORCVNO OF DINVRCD-I-REC-PO
                   START DINVRCD-I-PO KEY >=
                     PORCVNO OF DINVRCD-I-REC-PO
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                   END-START
                 END-IF
               END-IF
               READ DINVRCD-I-PO NEXT INTO BUF-DINVRCD
                   AT END MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS NOT = "00" OR
                  INV-PO-RCV-NO NOT EQUAL PO-ARG
                   MOVE "10" TO FILE-STATUS
               END-IF
           END-IF.

       79-READ-PRIOR-INV.
           READ DINVRCD-I-INV PRIOR INTO BUF-DINVRCD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
                   MOVE "READP DINVRCD-I-INV*79-READ-PRIOR-INV"
                       TO BU-DISPLAY-MSG
                   MOVE REGISTER-ARG      TO BU-DISPLAY-FLD (1)
                   GO TO 2-BLOWUP.
           IF INVOICENO OF DINVRCD-I-REC-INV NOT = INV-ARG
               MOVE "10" TO FILE-STATUS.

           IF FILE-STATUS = "00"
               SET HREAD-NEXT-VALID TO TRUE
               READ DINVRCD-I-INV PRIOR
                   AT END MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS EQUAL "00" AND
                  INVOICENO OF DINVRCD-I-REC-INV EQUAL INV-ARG
                 SET HREAD-PRIOR-VALID TO TRUE
               ELSE
                 SET HREAD-PRIOR-NOT-VALID TO TRUE
                 IF FILE-STATUS NOT EQUAL "00"
                   MOVE INV-ARG TO INVOICENO OF DINVRCD-I-REC-INV
                   START DINVRCD-I-INV KEY >=
                     INVOICENO OF DINVRCD-I-REC-INV
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                   END-START
                 END-IF
               END-IF
               READ DINVRCD-I-INV NEXT INTO BUF-DINVRCD
                   AT END MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS NOT = "00" OR
                  INV-NO NOT EQUAL INV-ARG
                   MOVE "10" TO FILE-STATUS
               END-IF
           END-IF.

       79-READ-NEXT-HREG.
           READ DINVRCDH-I-REG NEXT INTO BUF-DINVRCD-H
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
                   MOVE "READN DINVRCDH-I-REG*79-READ-NEXT-HREG"
                       TO BU-DISPLAY-MSG
                   MOVE REGISTER-ARG      TO BU-DISPLAY-FLD (1)
                   GO TO 2-BLOWUP.
           IF REGISTERNO OF DINVRCDH-I-REC-REG NOT = REGISTER-ARG
               MOVE "10" TO FILE-STATUS.

       79-READ-NEXT-HVEN.
           READ DINVRCDH-I-VEN NEXT INTO BUF-DINVRCD-H
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
                   MOVE "READN DINVRCDH-I-REG*79-READ-NEXT-HVEN"
                       TO BU-DISPLAY-MSG
                   MOVE REGISTER-ARG      TO BU-DISPLAY-FLD (1)
                   GO TO 2-BLOWUP.
           IF VENCDE OF DINVRCDH-I-REC-VEN NOT = VEN-ARG
               MOVE "10" TO FILE-STATUS.

           IF FILE-STATUS = "00"
               MOVE HREAD-NEXT-VALID-SW TO HREAD-PRIOR-VALID-SW
               READ DINVRCDH-I-VEN NEXT
                   AT END MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS EQUAL "00" AND
                  VENCDE OF DINVRCDH-I-REC-VEN EQUAL VEN-ARG
                 SET HREAD-NEXT-VALID TO TRUE
               ELSE
                 SET HREAD-NEXT-NOT-VALID TO TRUE
               END-IF
               IF FILE-STATUS EQUAL "10"
                 READ DINVRCDH-I-VEN LAST INTO BUF-DINVRCD-H
                   AT END MOVE FILE-STATUS TO FILE-STATUS
                 END-READ
               ELSE
                 READ DINVRCDH-I-VEN PRIOR INTO BUF-DINVRCD-H
                   AT END MOVE FILE-STATUS TO FILE-STATUS
                 END-READ
               END-IF
               IF FILE-STATUS NOT = "00" OR
                  INVH-VEN-CODE NOT EQUAL VEN-ARG
                 MOVE "10" TO FILE-STATUS
               END-IF
           END-IF.

       79-READ-NEXT-HPO.
           READ DINVRCDH-I-PO NEXT INTO BUF-DINVRCD-H
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
                   MOVE "READN DINVRCDH-I*79-READ-NEXT-HPO"
                       TO BU-DISPLAY-MSG
                   MOVE PO-ARG            TO BU-DISPLAY-FLD (1)
                   GO TO 2-BLOWUP.
           IF PORCVNO  OF DINVRCDH-I-REC-PO NOT = PO-ARG
               MOVE "10" TO FILE-STATUS.

           IF FILE-STATUS EQUAL "00"
               MOVE HREAD-NEXT-VALID-SW TO HREAD-PRIOR-VALID-SW
               READ DINVRCDH-I-PO NEXT
                   AT END MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS EQUAL "00" AND
                  PORCVNO OF DINVRCDH-I-REC-PO EQUAL PO-ARG
                 SET HREAD-NEXT-VALID TO TRUE
               ELSE
                 SET HREAD-NEXT-NOT-VALID TO TRUE
               END-IF
               IF FILE-STATUS EQUAL "10"
                 READ DINVRCDH-I-PO LAST INTO BUF-DINVRCD-H
                   AT END MOVE FILE-STATUS TO FILE-STATUS
                 END-READ
               ELSE
                 READ DINVRCDH-I-PO PRIOR INTO BUF-DINVRCD-H
                   AT END MOVE FILE-STATUS TO FILE-STATUS
                 END-READ
               END-IF
               IF FILE-STATUS NOT = "00" OR
                  INVH-PO-RCV-NO NOT EQUAL PO-ARG
                 MOVE "10" TO FILE-STATUS
               END-IF
           END-IF.

       79-READ-NEXT-HINV.
           READ DINVRCDH-I-INV NEXT INTO BUF-DINVRCD-H
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
                   MOVE "READN DINVRCDH-I-INV*79-READ-NEXT-HINV"
                       TO BU-DISPLAY-MSG
                   MOVE REGISTER-ARG      TO BU-DISPLAY-FLD (1)
                   GO TO 2-BLOWUP.
           IF INVOICENO OF DINVRCDH-I-REC-INV NOT = INV-ARG
               MOVE "10" TO FILE-STATUS.

           IF FILE-STATUS = "00"
               MOVE HREAD-NEXT-VALID-SW TO HREAD-PRIOR-VALID-SW
               READ DINVRCDH-I-INV NEXT
                   AT END MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS EQUAL "00" AND
                  INVOICENO OF DINVRCDH-I-REC-INV EQUAL INV-ARG
                 SET HREAD-NEXT-VALID TO TRUE
               ELSE
                 SET HREAD-NEXT-NOT-VALID TO TRUE
               END-IF
               IF FILE-STATUS EQUAL "10"
                 READ DINVRCDH-I-INV LAST INTO BUF-DINVRCD-H
                   AT END MOVE FILE-STATUS TO FILE-STATUS
                 END-READ
               ELSE
                 READ DINVRCDH-I-INV PRIOR INTO BUF-DINVRCD-H
                   AT END MOVE FILE-STATUS TO FILE-STATUS
                 END-READ
               END-IF
               IF FILE-STATUS NOT = "00" OR
                  INVH-NO NOT EQUAL INV-ARG
                 MOVE "10" TO FILE-STATUS
               END-IF
           END-IF.

       79-READ-PRIOR-HREG.
           READ DINVRCDH-I-REG PRIOR INTO BUF-DINVRCD-H
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
                   MOVE "READP DINVRCDH-I-REG*79-READ-PRIOR-HREG"
                       TO BU-DISPLAY-MSG
                   MOVE REGISTER-ARG      TO BU-DISPLAY-FLD (1)
                   GO TO 2-BLOWUP.
           IF REGISTERNO OF DINVRCDH-I-REC-REG NOT = REGISTER-ARG
               MOVE "10" TO FILE-STATUS.

       79-READ-PRIOR-HVEN.
           READ DINVRCDH-I-VEN PRIOR INTO BUF-DINVRCD-H
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
                   MOVE "READP DINVRCDH-I-REG*79-READ-PRIOR-HVEN"
                       TO BU-DISPLAY-MSG
                   MOVE REGISTER-ARG      TO BU-DISPLAY-FLD (1)
                   GO TO 2-BLOWUP.
           IF VENCDE OF DINVRCDH-I-REC-VEN NOT = VEN-ARG
               MOVE "10" TO FILE-STATUS.

           IF FILE-STATUS = "00"
               SET HREAD-NEXT-VALID TO TRUE
               READ DINVRCDH-I-VEN PRIOR
                   AT END MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS EQUAL "00" AND
                  VENCDE OF DINVRCDH-I-REC-VEN EQUAL VEN-ARG
                 SET HREAD-PRIOR-VALID TO TRUE
               ELSE
                 SET HREAD-PRIOR-NOT-VALID TO TRUE
                 IF FILE-STATUS NOT EQUAL "00"
                   MOVE VEN-ARG TO VENCDE OF DINVRCDH-I-REC-VEN
                   START DINVRCDH-I-VEN KEY >=
                     VENCDE OF DINVRCDH-I-REC-VEN
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                   END-START
                 END-IF
               END-IF
               READ DINVRCDH-I-VEN NEXT INTO BUF-DINVRCD-H
                   AT END MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS NOT = "00" OR
                  INVH-VEN-CODE NOT EQUAL VEN-ARG
                   MOVE "10" TO FILE-STATUS
               END-IF
           END-IF.

       79-READ-PRIOR-HPO.
           READ DINVRCDH-I-PO PRIOR INTO BUF-DINVRCD-H
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
                   MOVE "READP DINVRCDH-I*79-READ-PRIOR-PO"
                       TO BU-DISPLAY-MSG
                   MOVE PO-ARG            TO BU-DISPLAY-FLD (1)
                   GO TO 2-BLOWUP.
           IF PORCVNO  OF DINVRCDH-I-REC-PO NOT = PO-ARG
               MOVE "10" TO FILE-STATUS.

           IF FILE-STATUS = "00"
               SET HREAD-NEXT-VALID TO TRUE
               READ DINVRCDH-I-PO PRIOR
                   AT END MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS EQUAL "00" AND
                  PORCVNO OF DINVRCDH-I-REC-PO EQUAL PO-ARG
                 SET HREAD-PRIOR-VALID TO TRUE
               ELSE
                 SET HREAD-PRIOR-NOT-VALID TO TRUE
                 IF FILE-STATUS NOT EQUAL "00"
                   MOVE PO-ARG TO PORCVNO OF DINVRCDH-I-REC-PO
                   START DINVRCDH-I-PO KEY >=
                     PORCVNO OF DINVRCDH-I-REC-PO
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                   END-START
                 END-IF
               END-IF
               READ DINVRCDH-I-PO NEXT INTO BUF-DINVRCD-H
                   AT END MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS NOT = "00" OR
                  INVH-PO-RCV-NO NOT EQUAL PO-ARG
                   MOVE "10" TO FILE-STATUS
               END-IF
           END-IF.

       79-READ-PRIOR-HINV.
           READ DINVRCDH-I-INV PRIOR INTO BUF-DINVRCD-H
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
                   MOVE "READP DINVRCDH-I-INV*79-READ-PRIOR-HINV"
                       TO BU-DISPLAY-MSG
                   MOVE REGISTER-ARG      TO BU-DISPLAY-FLD (1)
                   GO TO 2-BLOWUP.
           IF INVOICENO OF DINVRCDH-I-REC-INV NOT = INV-ARG
               MOVE "10" TO FILE-STATUS.

           IF FILE-STATUS = "00"
               SET HREAD-NEXT-VALID TO TRUE
               READ DINVRCDH-I-INV PRIOR
                   AT END MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS EQUAL "00" AND
                  INVOICENO OF DINVRCDH-I-REC-INV EQUAL INV-ARG
                 SET HREAD-PRIOR-VALID TO TRUE
               ELSE
                 SET HREAD-PRIOR-NOT-VALID TO TRUE
                 IF FILE-STATUS NOT EQUAL "00"
                   MOVE INV-ARG TO INVOICENO OF DINVRCDH-I-REC-INV
                   START DINVRCDH-I-INV KEY >=
                     INVOICENO OF DINVRCDH-I-REC-INV
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                   END-START
                 END-IF
               END-IF
               READ DINVRCDH-I-INV NEXT INTO BUF-DINVRCD-H
                   AT END MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS NOT = "00" OR
                  INVH-NO NOT EQUAL INV-ARG
                   MOVE "10" TO FILE-STATUS
               END-IF
           END-IF.

       8-ITEM-INQUIRE.
           MOVE USE-HIST-DB-SW TO DATA-BASE-INDIC.
           IF STORES-HISTORY-DB
               MOVE 8003 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO HISTORY-DB-LIT.

           IF VIEW-LASTKEY NOT = 4
             IF STORES-DB
               IF REG-INQ
                 PERFORM 79-READ-NEXT-REG
               ELSE
                 IF VEN-INQ
                   PERFORM 79-READ-NEXT-VEN
                 ELSE
                   IF PO-INQ
                     PERFORM 79-READ-NEXT-PO
                   ELSE
                     PERFORM 79-READ-NEXT-INV
                   END-IF
                 END-IF
               END-IF
             ELSE
               IF REG-INQ
                 PERFORM 79-READ-NEXT-HREG
               ELSE
                 IF VEN-INQ
                   PERFORM 79-READ-NEXT-HVEN
                 ELSE
                   IF PO-INQ
                     PERFORM 79-READ-NEXT-HPO
                   ELSE
                     PERFORM 79-READ-NEXT-HINV
                   END-IF
                 END-IF
               END-IF
               IF FILE-STATUS = "10" OR "14" OR "46"
                 MOVE 8 TO VIEW-LASTKEY, SAVE-VIEW-LASTKEY
                 GO TO 8-ITEM-INQUIRE-X
               END-IF
             END-IF
           END-IF.

           MOVE SPACES TO SCREEN-7.
           IF STORES-DB
               MOVE INV-PO-NO        TO  DE7-PO
               MOVE INV-RLSE         TO  DE7-RLSE
               MOVE INV-NO           TO  DE7-INV-NUM
               MOVE INV-REG-NO-9     TO  DE7-REG-NUM,
                                         REGISTER-ARG,
                                         BU-DISPLAY-FLD (1),
                           REGISTERNO OF DINVITM-I-REC
               MOVE INV-PO-RCV-NO    TO  PO-ARG
               MOVE SPACES TO ITEMNO OF DINVITM-I-REC
               START DINVITM-I KEY = REGISTERNO OF DINVITM-I-REC
                INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-START
           ELSE
               MOVE HISTORY-DB-LIT   TO  DE7-HISTORY-LIT
               MOVE INVH-PO-NO       TO  DE7-PO
               MOVE INVH-RLSE        TO  DE7-RLSE
               MOVE INVH-NO          TO  DE7-INV-NUM
               MOVE INVH-REG-NO-9    TO  DE7-REG-NUM,
                                         REGISTER-ARG,
                                         BU-DISPLAY-FLD (1),
                              REGISTERNO OF DINVITMH-I-REC
               MOVE INVH-PO-RCV-NO   TO  PO-ARG
               MOVE SPACES TO INVITEMNO OF DINVITMH-I-REC
               START DINVITMH-I KEY = REGISTERNO OF DINVITMH-I-REC
                 INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-START.

           IF FILE-STATUS NOT EQUAL "00"
               IF FILE-STATUS-1 = "2"
      *        *** NO ITEMS WERE FOUND ON THIS INVOICE ***
                   MOVE 14014 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO   DE7-MSGLINE
                   MOVE B"1"           TO   IND(99)
                   GO TO 8C-SHOW-ITEM-SCREEN
               ELSE
                   MOVE "START DINVITM*8-II" TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP.

           MOVE SPACES          TO  MESSAGE-BUFFER.
           MOVE ZEROS           TO  VIEW-LASTKEY.
           MOVE "Y"             TO  READ-NEXT-SW.

       8-GET-DINVITM-LOOP.
           IF STORES-DB
             IF READ-NEXT
               PERFORM 89-READ-NEXT-ITEM
             ELSE
               PERFORM 89-READ-PRIOR-ITEM
             END-IF
           ELSE
             IF READ-NEXT
               PERFORM 89-READ-NEXT-HITEM
             ELSE
               PERFORM 89-READ-PRIOR-HITEM
             END-IF
             IF FILE-STATUS = "10" OR "14" OR "46"
               IF READ-ERR-SW = SPACES
                 IF READ-NEXT
                   MOVE "N" TO READ-NEXT-SW, READ-ERR-SW
                   GO TO 8-GET-DINVITM-LOOP
                 ELSE
                   MOVE "Y" TO READ-NEXT-SW
                   MOVE "P" TO READ-ERR-SW
                   GO TO 8-GET-DINVITM-LOOP
                 END-IF
               ELSE
                 MOVE 8 TO VIEW-LASTKEY, SAVE-VIEW-LASTKEY
                 GO TO 8-ITEM-INQUIRE-X
               END-IF
             END-IF
           END-IF.

           IF STORES-DB
             MOVE INVITM-ITEM-NO TO SAVE-INV-ITEM-NO
           ELSE
             IF INVITMH-PO-NUM NOT = INVH-PO-RLSE
               IF VIEW-LASTKEY = 6
                 MOVE "N" TO READ-NEXT-SW
               ELSE
                 MOVE "Y" TO READ-NEXT-SW
               END-IF
               GO TO 8-GET-DINVITM-LOOP
             ELSE
               MOVE INVITMH-ITEM-NO TO SAVE-INV-ITEM-NO
             END-IF
           END-IF.

           IF ITEM-INQ-NUM = SPACES
               NEXT SENTENCE
           ELSE
           IF ITEM-INQ-NUM = SAVE-INV-ITEM-NO
               MOVE SPACES TO ITEM-INQ-NUM
           ELSE
           IF ITEM-INQ-NUM < SAVE-INV-ITEM-NO
      *    *** ITEM NUMBER (    ) DOES NOT EXIST ON THIS INVOICE ***
               MOVE 9003 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ITEM-NOT-FOUND-MSG
               MOVE SPACES TO MESSAGE-BUFFER
               MOVE ITEM-INQ-NUM TO NO-ITEM-OUT
               MOVE SPACES TO ITEM-INQ-NUM
               MOVE ITEM-NOT-FOUND-MSG TO MESSAGE-BUFFER
               GO TO 8-GET-DINVITM-LOOP
           ELSE
               MOVE "Y" TO READ-NEXT-SW
               GO TO 8-GET-DINVITM-LOOP.

           MOVE SPACES TO DE7-ITEM-INFORMATION.
           IF STORES-DB
               PERFORM 80-LOAD-ITEM-INFO THRU 80-LII-X
           ELSE
               PERFORM 81-LOAD-ITEM-INFO-HIST THRU 81-LIIH-X.

       8-FIND-DINVACCT.
           IF STORES-DB
             MOVE REGISTER-ARG TO REGISTERNO OF DINVACCT-I-REC
             START DINVACCT-I KEY = REGISTERNO OF DINVACCT-I-REC
                 INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
             END-START
           ELSE
             MOVE REGISTER-ARG TO REGISTERNO OF DINVACCTH-I-REC
             START DINVACCTH-I KEY = REGISTERNO OF DINVACCTH-I-REC
                 INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
             END-START
           END-IF.
           IF FILE-STATUS NOT = "00"
               MOVE "START DINVACCT*8-FD"  TO  BU-DISPLAY-MSG
               GO TO  2-BLOWUP.

           MOVE ZERO  TO  ACCT-SUB.

       8-GET-DINVACCT-LOOP.
           IF STORES-DB
               READ DINVACCT-I NEXT INTO BUF-DINVACCT
                   AT END MOVE FILE-STATUS TO FILE-STATUS
           ELSE
               READ DINVACCTH-I NEXT INTO BUF-DINVACCT-H
                   AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO 8-TYPE-OF-CODE
               ELSE
                   MOVE "READN DINVACCT?*8-GDL"  TO  BU-DISPLAY-MSG
                   GO TO  2-BLOWUP.
           IF STORES-DB
               IF REGISTERNO OF DINVACCT-I-REC NOT = REGISTER-ARG
                   GO TO 8-TYPE-OF-CODE
               ELSE
                   NEXT SENTENCE
           ELSE
               IF REGISTERNO OF DINVACCTH-I-REC NOT = REGISTER-ARG
                   GO TO 8-TYPE-OF-CODE.

           IF STORES-DB
             MOVE INVACCT-ITEM TO SAVE-INVACCT-ITEM-NO
           ELSE
             IF INVACCTH-PO-NUM NOT = INVH-PO-RLSE
               GO TO 8-GET-DINVACCT-LOOP
             ELSE
               MOVE INVACCTH-ITEM TO SAVE-INVACCT-ITEM-NO
             END-IF
           END-IF.

           IF SAVE-INV-ITEM-NO = SAVE-INVACCT-ITEM-NO
               NEXT SENTENCE
           ELSE
           IF SAVE-INV-ITEM-NO < SAVE-INVACCT-ITEM-NO
               GO TO 8-TYPE-OF-CODE
           ELSE
               GO TO  8-GET-DINVACCT-LOOP.

           IF STORES-DB
               PERFORM 80-LOAD-ITEM-ACCT-DATA  THRU  80-LIAD-X
           ELSE
               PERFORM 81-LOAD-ITEM-ACCT-DATA-HIST  THRU  81-LIADH-X.
           GO TO  8-GET-DINVACCT-LOOP.

       8-TYPE-OF-CODE.
           IF DE7-CORPCODE  = "NON-STR"
               IF STORES-DB
                   PERFORM 80-LOAD-NONCODED-DESC  THRU  80-LND-X
               ELSE
                   PERFORM 81-LOAD-NONCODED-DESC-HIST THRU 81-LNDH-X
           ELSE
               PERFORM 80-LOAD-CODED-DESC  THRU   80-LCD-X.

       8C-SHOW-ITEM-SCREEN.
           MOVE "INVINQ7"    TO  VIEW-NFNAME.
           IF ( IREAD-NEXT-VALID AND IREAD-PRIOR-VALID ) OR
                STORES-HISTORY-DB

      *
      * PRESS 'f6' TO REVIEW PRIOR ITEM; 'f7' TO REVIEW NEXT ITEM      ***
      *
               MOVE 16102 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-INSTLINE
           ELSE
           IF IREAD-PRIOR-VALID

      *
      * PRESS 'f6' TO REVIEW PRIOR ITEM                                ***
      *
               MOVE 16104 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-INSTLINE

           ELSE
           IF IREAD-NEXT-VALID

      *
      * PRESS 'f7' TO REVIEW NEXT ITEM                                 ***
      *
               MOVE 16103 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-INSTLINE
             ELSE
               MOVE SPACES TO DE7-INSTLINE.

           IF STORES-HISTORY-DB
             IF READ-NEXT-ERR

      *
      * NO MORE ITEMS TO REVIEW
      *
               MOVE 66219 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSGLINE
               MOVE B"1" TO IND(99)
               MOVE SPACES TO READ-ERR-SW
             ELSE
               IF READ-PRIOR-ERR

      *
      * NO PRIOR ITEMS TO REVIEW
      *
                 MOVE 66220 TO CATREAD-MSG-NUMBER
                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                 MOVE MESSAGE-BUFFER TO DE7-MSGLINE
                 MOVE B"1" TO IND(99)
                 MOVE SPACES TO READ-ERR-SW.

           MOVE SCREEN-7     TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC  TO  SCREEN-7.
           IF VIEW-LASTKEY = 3 OR 4
               GO TO 8-ITEM-INQUIRE-X
           ELSE
           IF VIEW-LASTKEY = 6
               IF IREAD-PRIOR-VALID
                   MOVE "N" TO READ-NEXT-SW
                   GO TO 8-GET-DINVITM-LOOP
               ELSE
      *        *** INVALID FUNCTION KEY ENTERED ***
                   MOVE 9010 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO   DE7-MSGLINE
                   MOVE B"1" TO IND(99)
                   GO TO 8C-SHOW-ITEM-SCREEN
           ELSE
           IF VIEW-LASTKEY = 7
               IF IREAD-NEXT-VALID
                   MOVE "Y" TO READ-NEXT-SW
                   GO TO 8-GET-DINVITM-LOOP
               ELSE
      *        *** INVALID FUNCTION KEY ENTERED ***
                   MOVE 9010 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO   DE7-MSGLINE
                   MOVE B"1" TO IND(99)
                   GO TO 8C-SHOW-ITEM-SCREEN
           ELSE
           IF VIEW-LASTKEY = 1  OR
              VIEW-LASTKEY = 2  OR
              VIEW-LASTKEY = 5  OR
              VIEW-LASTKEY = 8
      *        *** INVALID FUNCTION KEY ENTERED ***
               MOVE 9010 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO   DE7-MSGLINE
               MOVE B"1" TO IND(99)
               GO TO 8C-SHOW-ITEM-SCREEN
           ELSE
      *        ***  SELECT THE APPROPRIATE  'FUNCTION KEY'  ***
               MOVE 19013 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO   DE7-MSGLINE
               MOVE B"1" TO IND(99)
               GO TO 8C-SHOW-ITEM-SCREEN.

       8-ITEM-INQUIRE-X.
           EXIT.

       80-LOAD-ITEM-INFO.
           MOVE INVITM-ITEM-NO       TO  DE7-ITEM-NO.
           MOVE INVITM-CORPCODE      TO  DE7-CORPCODE,
                                         CODE-ARG.
           MOVE INVITM-PO-QTY-PD     TO  DE7-PO-UNPD-QTY.
           MOVE INVITM-PO-UM         TO  DE7-PO-UM,
                                         DE7-INV-UM.
           MOVE INVITM-PO-UPRICE     TO  DE7-PO-UPRICE.
           IF INVITM-PO-QTY-PD = ZEROS
               MOVE INVITM-PO-UPRICE TO  DE7-PO-ITEM-EXT
           ELSE
               MULTIPLY INVITM-PO-QTY-PD  BY  INVITM-PO-UPRICE
                   GIVING CALC-ITEM-EXT  ROUNDED
               MOVE CALC-ITEM-EXT     TO  DE7-PO-ITEM-EXT.
           MOVE INVITM-INV-QTY-PD     TO  DE7-INV-UNPD-QTY.
           MOVE INVITM-INV-UPRICE     TO  DE7-INV-UPRICE.
           IF INVITM-INV-QTY-PD = ZEROS
               MOVE INVITM-INV-UPRICE  TO  DE7-INV-ITEM-EXT
           ELSE
               MULTIPLY INVITM-INV-QTY-PD  BY  INVITM-INV-UPRICE
                   GIVING CALC-ITEM-EXT ROUNDED
               MOVE CALC-ITEM-EXT      TO  DE7-INV-ITEM-EXT.
           MOVE INVITM-TAX-CODE        TO  DE7-TAX-CODE.
           IF INVITM-MEMO-INDIC = "X"
      *        *** MEMO QUANTITY  (QTY PAID NOT UPDATE) ***
               MOVE 13034 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-INV-MEMO-MSG
               MOVE SPACES TO MESSAGE-BUFFER.

       80-LII-X.
           EXIT.

       80-LOAD-ITEM-ACCT-DATA.
           ADD +1  TO  ACCT-SUB.
           MOVE INVACCT-PRIME      TO  DE7-PRIME (ACCT-SUB).
           MOVE INVACCT-SUB        TO  DE7-SUB (ACCT-SUB).
           MOVE INVACCT-SUBD       TO  DE7-SUBD (ACCT-SUB).
           MOVE INVACCT-ADDL-DATA  TO  DE7-ADDL-DATA (ACCT-SUB).
           MOVE INVACCT-PCT        TO  DE7-PERCENT (ACCT-SUB).

       80-LIAD-X.
           EXIT.

       80-LOAD-NONCODED-DESC.
           MOVE 4                       TO  CNDESC-LINES-TO-GET.
           MOVE 0                       TO  CNDESC-LINES-GOT.
           CALL "CNDESC" USING BASE, PO-ARG, INVITM-ITEM-NO,
               CNDESC-DATA.

           IF CNDESC-LINES-GOT  =  0
      *        *** NO DESCRIPTION ON FILE ***
               MOVE 14003 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-DESC-LINE (1)
               GO TO  80-LND-X.

           MOVE ZEROS                   TO  DESC-SUB.

       80-GET-NONCODED-LOOP.
           ADD 1                        TO  DESC-SUB.
           IF DESC-SUB > CNDESC-LINES-GOT  OR
              DESC-SUB > 4
               GO TO 80-LND-X.

           MOVE CNDESC (DESC-SUB)       TO  DE7-DESC-LINE (DESC-SUB).
           GO TO 80-GET-NONCODED-LOOP.

       80-LND-X.
           EXIT.

       80-LOAD-CODED-DESC.
      **************************************************
      **  CALL CDESC FOR DESCRIPTION LINES. (CODED)   **
      **************************************************
           MOVE 4                       TO  CDESC-LINES-TO-GET.
           CALL "CDESC" USING RET-CODE,
                              BASE,
                              STATUS-AREA,
                              BU-DISPLAY-MSG,
                              CODE-ARG,
                              CDESC-DATA.
           IF BU-DISPLAY-MSG-1  NOT = SPACES
               MOVE CODE-ARG            TO  BU-DISPLAY-FLD (4)
               GO TO 2-BLOWUP.

           IF CDESC-LINES-GOT  =  0
      *        *** NO DESCRIPTION ON FILE ***
               MOVE 14003 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-DESC-LINE (1)
               GO TO  80-LCD-X.

           MOVE ZEROS                   TO  DESC-SUB.

       80-GET-DESC-LOOP.
           ADD 1                        TO  DESC-SUB.
           IF DESC-SUB > CDESC-LINES-GOT  OR
              DESC-SUB > 4
               GO TO 80-LCD-X.

           MOVE CDESC (DESC-SUB)        TO  DE7-DESC-LINE (DESC-SUB).
           GO TO 80-GET-DESC-LOOP.

       80-LCD-X.
           EXIT.

       81-LOAD-ITEM-INFO-HIST.
           MOVE INVITMH-ITEM-NO       TO  DE7-ITEM-NO.
           MOVE INVITMH-CORPCODE      TO  DE7-CORPCODE,
                                          CODE-ARG.
           MOVE INVITMH-PO-QTY-PD     TO  DE7-PO-UNPD-QTY.
           MOVE INVITMH-PO-UM         TO  DE7-PO-UM,
                                          DE7-INV-UM.
           MOVE INVITMH-PO-UPRICE     TO  DE7-PO-UPRICE.
           IF INVITMH-PO-QTY-PD = ZEROS
               MOVE INVITMH-PO-UPRICE TO  DE7-PO-ITEM-EXT
           ELSE
               MULTIPLY INVITMH-PO-QTY-PD  BY  INVITMH-PO-UPRICE
                   GIVING CALC-ITEM-EXT  ROUNDED
               MOVE CALC-ITEM-EXT     TO  DE7-PO-ITEM-EXT.
           MOVE INVITMH-INV-QTY-PD    TO  DE7-INV-UNPD-QTY.
           MOVE INVITMH-INV-UPRICE    TO  DE7-INV-UPRICE.
           IF INVITMH-INV-QTY-PD = ZEROS
               MOVE INVITMH-INV-UPRICE  TO  DE7-INV-ITEM-EXT
           ELSE
               MULTIPLY INVITMH-INV-QTY-PD  BY  INVITMH-INV-UPRICE
                   GIVING CALC-ITEM-EXT ROUNDED
               MOVE CALC-ITEM-EXT      TO  DE7-INV-ITEM-EXT.
           MOVE INVITMH-TAX-CODE       TO  DE7-TAX-CODE.
           IF INVITMH-MEMO-INDIC = "X"
      *        *** MEMO QUANTITY  (QTY PAID NOT UPDATE) ***
               MOVE 13034 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-INV-MEMO-MSG
               MOVE SPACES TO MESSAGE-BUFFER.

       81-LIIH-X.
           EXIT.

       81-LOAD-ITEM-ACCT-DATA-HIST.
           ADD +1  TO  ACCT-SUB.
           MOVE INVACCTH-PRIME      TO  DE7-PRIME (ACCT-SUB).
           MOVE INVACCTH-SUB        TO  DE7-SUB (ACCT-SUB).
           MOVE INVACCTH-SUBD       TO  DE7-SUBD (ACCT-SUB).
           MOVE INVACCTH-ADDL-DATA  TO  DE7-ADDL-DATA (ACCT-SUB).
           MOVE INVACCTH-PCT        TO  DE7-PERCENT (ACCT-SUB).

       81-LIADH-X.
           EXIT.

       81-LOAD-NONCODED-DESC-HIST.
           MOVE ZEROS  TO  DESC-SUB.
           MOVE PO-ARG TO  PORCVNO OF DPODESCH-I-REC.
           MOVE SAVE-POITEMSEQ TO POITEMSEQ OF DPODESCH-I-REC.
           START DPODESCH-I KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 81-LNDH-X
               ELSE
               MOVE "START DPODESC*81-LNDH"  TO  BU-DISPLAY-MSG
               MOVE PO-ARG     TO  BU-DISPLAY-FLD (2)
               GO TO  2-BLOWUP.

       81-GET-NCODED-ITEM-LOOP.
           READ DPODESCH-I NEXT INTO BUF-DPODESC-H
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO 81-LNDH-X
               ELSE
                   MOVE "READN DPODESC*81-GNIL"  TO  BU-DISPLAY-MSG
                   GO TO  2-BLOWUP.
           IF PORCVNO OF DPODESCH-I-REC NOT = PO-ARG
             OR SAVE-INV-ITEM-NO NOT = DPODESCH-ITEM-NO
               GO TO 81-LNDH-X.

           ADD +1  TO  DESC-SUB.
           IF DESC-SUB > +4
               GO TO  81-LNDH-X.

           MOVE PODESCH-DESC  TO  DE7-DESC-LINE (DESC-SUB).
           GO TO 81-GET-NCODED-ITEM-LOOP.

       81-LNDH-X.
           EXIT.

       89-READ-NEXT-ITEM.
           READ DINVITM-I NEXT
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
                   MOVE "READN DINVITM-I-REG*89-READ-NEXT-ITEM"
                       TO BU-DISPLAY-MSG
                   MOVE REGISTER-ARG      TO BU-DISPLAY-FLD (1)
                   GO TO 2-BLOWUP.
           IF REGISTERNO OF DINVITM-I-REC NOT = REGISTER-ARG
               MOVE "10" TO FILE-STATUS.

           IF FILE-STATUS = "00"
               MOVE IREAD-NEXT-VALID-SW TO IREAD-PRIOR-VALID-SW
               READ DINVITM-I NEXT
                   AT END MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS EQUAL "00" AND
                  REGISTERNO OF DINVITM-I-REC EQUAL REGISTER-ARG
                 SET IREAD-NEXT-VALID TO TRUE
               ELSE
                 SET IREAD-NEXT-NOT-VALID TO TRUE
               END-IF
               IF FILE-STATUS EQUAL "10"
                 READ DINVITM-I LAST INTO BUF-DINVITM
                   AT END MOVE FILE-STATUS TO FILE-STATUS
                 END-READ
               ELSE
                 READ DINVITM-I PRIOR INTO BUF-DINVITM
                   AT END MOVE FILE-STATUS TO FILE-STATUS
                 END-READ
               END-IF
               IF FILE-STATUS NOT = "00" OR
                  INVITM-REG-NO NOT EQUAL REGISTER-ARG
                 MOVE "10" TO FILE-STATUS
               END-IF
           END-IF.

       89-READ-PRIOR-ITEM.
           READ DINVITM-I PRIOR
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
                   MOVE "READP DINVITM-I-REG*89-READ-PRIOR-ITEM"
                       TO BU-DISPLAY-MSG
                   MOVE REGISTER-ARG      TO BU-DISPLAY-FLD (1)
                   GO TO 2-BLOWUP.
           IF REGISTERNO OF DINVITM-I-REC NOT = REGISTER-ARG
               MOVE "10" TO FILE-STATUS.

           IF FILE-STATUS = "00"
               SET IREAD-NEXT-VALID TO TRUE
               READ DINVITM-I PRIOR
                   AT END MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS EQUAL "00" AND
                  REGISTERNO OF DINVITM-I-REC EQUAL REGISTER-ARG
                 SET IREAD-PRIOR-VALID TO TRUE
               ELSE
                 SET IREAD-PRIOR-NOT-VALID TO TRUE
                 IF FILE-STATUS NOT EQUAL "00"
                   MOVE REGISTER-ARG TO REGISTERNO OF DINVITM-I-REC
                   START DINVITM-I KEY >=
                     REGISTERNO OF DINVITM-I-REC
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                   END-START
                 END-IF
               END-IF
               READ DINVITM-I NEXT INTO BUF-DINVITM
                   AT END MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS NOT = "00" OR
                  INVITM-REG-NO NOT EQUAL REGISTER-ARG
                   MOVE "10" TO FILE-STATUS
               END-IF
           END-IF.

       89-READ-NEXT-HITEM.
           READ DINVITMH-I NEXT INTO BUF-DINVITM-H
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
                   MOVE "READN DINVITMH-I-REG*89-READ-NEXT-HITEM"
                       TO BU-DISPLAY-MSG
                   MOVE REGISTER-ARG      TO BU-DISPLAY-FLD (1)
                   GO TO 2-BLOWUP.
           IF REGISTERNO OF DINVITMH-I-REC NOT = REGISTER-ARG
               MOVE "10" TO FILE-STATUS.

       89-READ-PRIOR-HITEM.
           READ DINVITMH-I PRIOR INTO BUF-DINVITM-H
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
                   MOVE "READN DINVITMH-I-REG*89-READ-PRIOR-HITEM"
                       TO BU-DISPLAY-MSG
                   MOVE REGISTER-ARG      TO BU-DISPLAY-FLD (1)
                   GO TO 2-BLOWUP.
           IF REGISTERNO OF DINVITMH-I-REC NOT = REGISTER-ARG
               MOVE "10" TO FILE-STATUS.

       COPY DISPCALL IN COPYLIB.

      *------ THIS VERSION OF CATREAD ASSUMES THE SET/MSG NUMBER
      *------ WILL BE IN CATREAD-MSG-NUMBER.
       999-CATREAD.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
           IF MESSAGE-BUFFER-1  = SPACES
               MOVE "* ERROR ON THIS FIELD *" TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.
