000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.     SJOBPCOD.
000400 AUTHOR.         J.S.BUNGO.
000500 DATE-WRITTEN.   9/8/93.
000600 DATE-COMPILED.
000700 INSTALLATION.   THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
000800*REMARKS.
000900*D   THIS SUBPROGRAM RENAMES, DELETES AND UPDATES THE UNIT OF MEASURE
001000*D   OF A CORPORATE CODE ON ALL PM JOBPLANS.  THIS SUBROUTINE SHOULD BE
001100*D   CALLED WHENEVER A CODE IS RENAMED TO A DIFFERENT CORPORATE CODE,
001200*D   OR WHEN A CORPORATE CODE IS DELETED OR WHEN THE PRIMARY UNIT OF
001300*D   MEASURE HAS CHANGED FOR A CODE.  THE PARAMETER VALUES WILL DETIRMINE
001400*D   WHICH FUNCTION TO PERFORM ON THE PM JOBPLAN.
001500
001600 ENVIRONMENT DIVISION.
001700 CONFIGURATION SECTION.
001800 SOURCE-COMPUTER.  HP-3000.
001900 OBJECT-COMPUTER.  HP-3000.
002000
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PM-JOBPLAN
                  ASSIGN TO DATABASE-MCFLMM4103
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS FILE-STAT.
002100 DATA DIVISION.
       FILE SECTION.
       FD  PM-JOBPLAN
           LABEL RECORDS ARE STANDARD.
       01  PM-JOBP-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM4103.
002200 WORKING-STORAGE SECTION.
002300
       77  FILE-STAT            PIC X(02)  VALUE SPACES.
002700
002800 01  NEW-QTY              PIC S9(8).
002900 01  DELETE-MSG.
003000     05  DELETE-MSG-CODE  PIC X(08)  VALUE SPACES.
003100     05  FILLER PIC X(32) VALUE "WAS DELETED & REMOVED FROM TASK".
003200 01  PM-JOBPLAN-DATA.
003300     COPY DPMJBPLN IN COPYLIB.
003400 01  BASE                 PIC X(10)  VALUE "  MMISA;".
003500 01  PASSWORD             PIC X(08)  VALUE "DO-ALL;".
003600 01  LOCK-DESC.
003700     05  NUMBER-OF-LOCKS  PIC S9(4)  COMP VALUE 1.
003800     05  LOCK-FIELDS.
003900         10  LNGTH        PIC S9(4)  COMP VALUE 25.
004000         10  DSET-NAME    PIC X(16)  VALUE "PM-JOBPLAN;".
004100         10  ITEM         PIC X(16)  VALUE "PRT-NUMBER;".
004200         10  REL-OP       PIC XX     VALUE "= ".
004300         10  LOCK-VALUE   PIC X(08)  VALUE SPACES.
004400 01  LOCK-DESC2.
004500     05  NUMBER-OF-LOCKS2 PIC S9(4)  COMP VALUE 1.
004600     05  LOCK-FIELDS2.
004700         10  LNGTH2       PIC S9(4)  COMP VALUE 25.
004800         10  DSET-NAME2   PIC X(16)  VALUE "PM-JOBPLAN;".
004900         10  ITEM2        PIC X(16)  VALUE "PRT-NUMBER;".
005000         10  REL-OP2      PIC XX     VALUE "= ".
005100         10  LOCK-VALUE2  PIC X(08)  VALUE SPACES.
005200
005300 COPY DBMODES IN COPYLIB.
005400 COPY DBSTAT  IN COPYLIB.
005500
005600 LINKAGE SECTION.
005700 01  OLD-CODE             PIC X(08).
005800 01  NEW-CODE             PIC X(08).
005900 01  NEW-UM               PIC X(02).
006000 01  NEW-UM-CF            PIC 9(6)V9(4).
006100 01  BU-DISPLAY-MSG       PIC X(60).
006200 01  BU-DISPLAY-FLDS.
006300     05  BU-DISPLAY-LINE OCCURS 5 TIMES.
006400         10  BU-DISPLAY-FLD  PIC X(14).
006500         10  BU-DISPLAY-FLD9 PIC S9(8).
006600
006700 PROCEDURE DIVISION USING OLD-CODE
006800                          NEW-CODE
006900                          NEW-UM
007000                          NEW-UM-CF
007100                          BU-DISPLAY-MSG
007200                          BU-DISPLAY-FLDS.
007300
007400 6-MAIN.
           OPEN I-O PM-JOBPLAN.
008000     IF NEW-CODE NOT = SPACES
008100*----------RENAME OLD CODE TO NEW CODE
008200         PERFORM RENAME-JOBP-CODE THRU RENAME-JOBP-CODE-EXIT
008300     ELSE
008400         IF NEW-UM NOT = SPACES
008500*--------------CHANGE UNIT OF MEASURE ON OLD CODE
008600             PERFORM CHANGE-UM THRU CHANGE-UM-EXIT
008700         ELSE
008800*--------------OLD CODE IS BEING DELETED
008900             PERFORM DELETE-JOBP-CODE THRU DELETE-JOBP-CODE-EXIT
009000         END-IF
009100     END-IF.
           CLOSE PM-JOBPLAN.
010500     GOBACK.
010600
010700 RENAME-JOBP-CODE.
           MOVE OLD-CODE TO PRTNUMBER OF PM-JOBPLAN.
           START PM-JOBPLAN KEY = PRTNUMBER OF PM-JOBPLAN
               INVALID KEY MOVE FILE-STAT TO FILE-STAT.
011000     IF FILE-STAT NOT = "00"
               GO TO RENAME-JOBP-CODE-EXIT.
011800 RENAME-JOBP-LOOP.
           READ PM-JOBPLAN NEXT INTO PM-JOBPLAN-DATA
               AT END MOVE FILE-STAT TO FILE-STAT.
012100     IF FILE-STAT = "10" OR "14" OR  "46"
012200         GO TO RENAME-JOBP-CODE-EXIT
012300     ELSE IF FILE-STAT NOT = "00"
012400         MOVE "READ ERROR PM-JOBPLAN, RENAME" TO BU-DISPLAY-MSG
012500         MOVE "SJOBPCOD" TO BU-DISPLAY-FLD (2)
012600         MOVE FILE-STAT TO BU-DISPLAY-FLD (3)
012700         MOVE OLD-CODE TO BU-DISPLAY-FLD (4)
012800         GO TO RENAME-JOBP-CODE-EXIT.
           IF PMJP-CORP-CODE NOT = OLD-CODE
               GO TO RENAME-JOBP-CODE-EXIT.
012900     MOVE NEW-CODE TO PMJP-CORP-CODE.
           DELETE PM-JOBPLAN
               INVALID KEY MOVE FILE-STAT TO FILE-STAT.
013100     IF FILE-STAT NOT = "00"
013200         MOVE "DELETE ERROR PM-JOBPLAN, RENAME"
013300              TO BU-DISPLAY-MSG
013400         MOVE "SJOBPCOD" TO BU-DISPLAY-FLD (2)
013500         MOVE FILE-STAT TO BU-DISPLAY-FLD (3)
013600         MOVE OLD-CODE TO BU-DISPLAY-FLD (4)
013700         MOVE NEW-CODE TO BU-DISPLAY-FLD (5)
013800         GO TO RENAME-JOBP-CODE-EXIT.
           WRITE PM-JOBP-REC FROM PM-JOBPLAN-DATA
               INVALID KEY MOVE FILE-STAT TO FILE-STAT.
015000     IF FILE-STAT NOT = "00"
015100         MOVE "WRITE ERROR PM-JOBPLAN, RENAME" TO BU-DISPLAY-MSG
015200         MOVE "SJOBPCOD" TO BU-DISPLAY-FLD (2)
015300         MOVE FILE-STAT TO BU-DISPLAY-FLD (3)
015400         MOVE OLD-CODE TO BU-DISPLAY-FLD (4)
015500         MOVE NEW-CODE TO BU-DISPLAY-FLD (5)
015600         GO TO RENAME-JOBP-CODE-EXIT.
016600     GO TO RENAME-JOBP-CODE.
016700 RENAME-JOBP-CODE-EXIT.
016800     EXIT.
016900
017000 CHANGE-UM.
           MOVE OLD-CODE TO PRTNUMBER OF PM-JOBPLAN.
           START PM-JOBPLAN KEY = PRTNUMBER OF PM-JOBPLAN
               INVALID KEY MOVE FILE-STAT TO FILE-STAT.
017300     IF FILE-STAT NOT = "00"
017400         GO TO CHANGE-UM-EXIT.
018200 CHANGE-UM-LOOP.
           READ PM-JOBPLAN NEXT INTO PM-JOBPLAN-DATA
               AT END MOVE FILE-STAT TO FILE-STAT.
018500     IF FILE-STAT = "10" OR "14" OR "46"
018600         GO TO CHANGE-UM-EXIT
018700     ELSE IF FILE-STAT NOT = "00"
018800         MOVE "READ ERROR PM-JOBPLAN, CHANGE-UM"
018900              TO BU-DISPLAY-MSG
019000         MOVE "SJOBPCOD" TO BU-DISPLAY-FLD (2)
019100         MOVE FILE-STAT TO BU-DISPLAY-FLD (3)
019200         MOVE OLD-CODE TO BU-DISPLAY-FLD (4)
019300         GO TO CHANGE-UM-EXIT.
           IF PMJP-CORP-CODE NOT = OLD-CODE
               GO TO CHANGE-UM-EXIT.
019400     MOVE NEW-UM TO PMJP-UNIT-MEAS.
019500     MULTIPLY PMJP-EST-QTY-9 BY NEW-UM-CF
019600       GIVING NEW-QTY.
019700     MOVE NEW-QTY TO PMJP-EST-QTY-9.
           REWRITE PM-JOBP-REC FROM PM-JOBPLAN-DATA
               INVALID KEY MOVE FILE-STAT TO FILE-STAT.
020000     IF FILE-STAT NOT = "00"
020100         MOVE "UPDATE ERROR PM-JOBPLAN, CHANGE-UM"
020200              TO BU-DISPLAY-MSG
020300         MOVE "SJOBPCOD" TO BU-DISPLAY-FLD (2)
020400         MOVE FILE-STAT TO BU-DISPLAY-FLD (3)
020500         MOVE NEW-UM TO BU-DISPLAY-FLD (4)
020600         MOVE PMJP-KEY-SEQ TO BU-DISPLAY-FLD (5)
020700         GO TO CHANGE-UM-EXIT.
020800     GO TO CHANGE-UM-LOOP.
020900 CHANGE-UM-EXIT.
021000     EXIT.
021100
021200 DELETE-JOBP-CODE.
           MOVE OLD-CODE TO PRTNUMBER OF PM-JOBPLAN.
           START PM-JOBPLAN KEY = PRTNUMBER OF PM-JOBPLAN
               INVALID KEY MOVE FILE-STAT TO FILE-STAT.
021500     IF FILE-STAT NOT = "00"
022300         GO TO DELETE-JOBP-CODE-EXIT.
022400 DELETE-LOOP.
           READ PM-JOBPLAN NEXT INTO PM-JOBPLAN-DATA
               AT END MOVE FILE-STAT TO FILE-STAT.
022700     IF FILE-STAT = "10" OR "14" OR "46"
022800         GO TO DELETE-JOBP-CODE-EXIT
022900     ELSE IF FILE-STAT NOT = "00"
023000         MOVE "READ ERROR PM-JOBPLAN, DELETE-JOBP-CODE"
023100            TO BU-DISPLAY-MSG
023200         MOVE "SJOBPCOD" TO BU-DISPLAY-FLD (2)
023300         MOVE FILE-STAT TO BU-DISPLAY-FLD (3)
023400         MOVE OLD-CODE TO BU-DISPLAY-FLD (4)
023500         GO TO DELETE-JOBP-CODE-EXIT.
           IF PMJP-CORP-CODE NOT = OLD-CODE
               GO TO DELETE-JOBP-CODE-EXIT.
023600     MOVE SPACES TO PMJP-CORP-CODE
023700                    PMJP-UNIT-MEAS
023800                    PMJP-EST-QTY.
023900     MOVE OLD-CODE TO DELETE-MSG-CODE.
024000     MOVE DELETE-MSG TO PMJP-TEXT.
           DELETE PM-JOBPLAN
              INVALID KEY MOVE FILE-STAT TO FILE-STAT.
024200     IF FILE-STAT NOT = "00"
024300         MOVE "DELETE ERROR PM-JOBPLAN, DELETE-JOBP-CODE"
024400              TO BU-DISPLAY-MSG
024500         MOVE "SJOBPCOD" TO BU-DISPLAY-FLD (2)
024600         MOVE FILE-STAT TO BU-DISPLAY-FLD (3)
024700         MOVE OLD-CODE TO BU-DISPLAY-FLD (4)
024800         MOVE PMJP-TEXT TO BU-DISPLAY-FLD (5)
024900         GO TO DELETE-JOBP-CODE-EXIT.
           WRITE PM-JOBP-REC FROM PM-JOBPLAN-DATA
               INVALID KEY MOVE FILE-STAT TO FILE-STAT.
026200     IF FILE-STAT NOT = "00"
026300         MOVE "WRITE ERROR PM-JOBPLAN, DELETE-JOBP-CODE"
026400           TO BU-DISPLAY-MSG
026500         MOVE "SJOBPCOD" TO BU-DISPLAY-FLD (2)
026600         MOVE FILE-STAT TO BU-DISPLAY-FLD (3)
026700         MOVE OLD-CODE TO BU-DISPLAY-FLD (4)
026800         MOVE PMJP-TEXT TO BU-DISPLAY-FLD (5)
026900         GO TO DELETE-JOBP-CODE-EXIT.
027900     GO TO DELETE-JOBP-CODE.
028000 DELETE-JOBP-CODE-EXIT.
028100     EXIT.
