       IDENTIFICATION DIVISION.

       PROGRAM-ID.     SMCRAFT.
       AUTHOR.         EXLTECH, LLC - DAN RAUCH

      ***************************************************************
      **     MMIS  CRAFT DISPLAY/SELECTION PROGRAM
      ***************************************************************
      ** NOTE:  THIS PROGRAM USES A FORWARD LOADING SUBFILE  WHERE
      **        OS400 HANDLES THE BACKWARD PAGING.
      **           ----------------------------------------------
      **           ------- LINKAGE SECTION MODE FLD -------------
      **        1) PASS "D" IN THE LINKAGE SECTION MODE FLD LS-DSP
      **           TO "DISPLAY"  CRAFT SUBFILE
      **           --------  O R  -------------------------------
      **        2) PASS "S" IN THE LINKAGE SECTION MODE FLD LS-DSP
      **           TO ALLOW CRAFT TO BE SELECTED & RETURNED TO CALLER
      **           ----------------------------------------------
      ** SO FAR THIS PGM IS CALLED FROM TMCRAFT   IN DISPLAY MODE
      **                                TXINITWO  IN SELECT  MODE
      **                                TMODWORK  IN SELECT  MODE
      **                                TINITWO   IN SELECT  MODE
      **                                TINITWOG  IN SELECT  MODE
      **                                TCHNGWO   IN SELECT  MODE
      **                                TCHNGWO2  IN SELECT  MODE
      ***************************************************************

      *****************************************************************
      **          M O D I F I C A T I O N    H I S T O R Y
      *****************************************************************
DCR01 *  APR 18, 2005  DCR01  DAN RAUCH       REQUEST# 2005-78291
DCR01 *  1) NEW SUB PROGRAM CALLED TO DISPLAY OR ALLOW CRAFT SELECTION
DCR01 *  2) CREATE NEW DSPF ZSMCRAFT
      * ---------------------------------------------------------------
      *  MMM DD, 2005  XXX01  XXXXNAMEXXXXXX  REQUEST# 200?-NNNNN
      *  XXXXXXXXXXXX DESCRIBE MODIFICATION HERE XXXXXXXXXXXXXXXXXXXXX
      *****************************************************************


      *================================================================
       ENVIRONMENT DIVISION.
      *===============================================================
       CONFIGURATION SECTION.

       SOURCE-COMPUTER.       IBM-AS400.
       OBJECT-COMPUTER.       IBM-AS400.
       SPECIAL-NAMES.         LOCAL-DATA LDA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT DISPLAY-FILE  ASSIGN TO WORKSTATION-ZSMCRAFT-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS DYNAMIC
                  FILE STATUS IS WS-FILE-STATUS
                  RELATIVE KEY IS WS-RRN
                  CONTROL-AREA IS WS-KEYBOARD-RETURN-AREA.

           SELECT CRAFT-FILE     ASSIGN TO DATABASE-MCFLMM0601
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS IS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

      *================================================================
       DATA DIVISION.
      *================================================================
       FILE SECTION.

       FD  DISPLAY-FILE.
       01  DISPLAY-REC.
       COPY DDS-ALL-FORMATS OF ZSMCRAFT.

       FD  CRAFT-FILE.
       01  CRAFT-REC.
       COPY DDS-ALL-FORMATS OF MCFLMM0601.

      *----------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *----------------------------------------------------------------
       01  WS-PGM-VERSION          PIC X(10)  VALUE "SMCRAFTV01".

       COPY FILESTATUS IN COPYLIB.
       COPY KEYBDRTN    IN COPYLIB.

      *****************************************************************
      *  ALL PROGRAM INDICATORS
      *****************************************************************
       01  WS-ALL-INDICATORS.
      **** 03  IN83              PIC 1   INDIC 83   VALUE B"0".
      ****     88  SFLEND-OFF                       VALUE B"0".
      ****     88  SFLEND-ON                        VALUE B"1".

           03  IN84              PIC 1   INDIC 84   VALUE B"0".
               88  SFL-CLEAR-OFF                    VALUE B"0".
               88  SFL-CLEAR-ON                     VALUE B"1".

           03  IN85              PIC 1   INDIC 85   VALUE B"0".
               88  SFL-DISPLAY-OFF                  VALUE B"0".
               88  SFL-DISPLAY-ON                   VALUE B"1".

           03  IN86              PIC 1   INDIC 86   VALUE B"0".
               88  SFLNXTCHG-OFF                    VALUE B"0".
               88  SFLNXTCHG-ON                     VALUE B"1".

           03  IN60              PIC 1   INDIC 60    VALUE B"0".
               88  DISPLAY-SEL-LIT-YES               VALUE B"0".
               88  DISPLAY-SEL-LIT-NO                VALUE B"1".

           03  IN61              PIC 1   INDIC 61    VALUE B"0".
               88  DISPLAY-SEL1-FLD-YES              VALUE B"0".
               88  DISPLAY-SEL1-FLD-NO               VALUE B"1".

           03  IN62              PIC 1   INDIC 62    VALUE B"0".
               88  DISPLAY-SEL2-FLD-YES              VALUE B"0".
               88  DISPLAY-SEL2-FLD-NO               VALUE B"1".

           03  IN63              PIC 1   INDIC 63    VALUE B"0".
               88  DISPLAY-SEL3-FLD-YES              VALUE B"0".
               88  DISPLAY-SEL3-FLD-NO               VALUE B"1".

           03  IN91              PIC 1   INDIC 91   VALUE B"0".
               88  SFL-PAGE-FWD                     VALUE B"1".

       01  WS-ALL-SCREEN-FIELDS.
            03  WS-H01-FLDS.
                05  VERSION           PIC X(15)          VALUE SPACE.

            03  WS-B01S-FLDS.
                05  PGMSG             PIC X(10)          VALUE SPACE.
                05  MSSG              PIC X(75)          VALUE SPACE.

            03  WS-CTL01-FLDS.
                05  CRRN              PIC S9(04)         VALUE +0.
                05  CREC              PIC X(10)          VALUE SPACE.
                05  CFLD              PIC X(10)          VALUE SPACE.
                05  CCRAFT            PIC X(02)          VALUE SPACE.

            03  WS-SFL01-FLDS.
                05  SEL1              PIC X(01)          VALUE SPACE.
                05  SFCRAFT1          PIC X(02)          VALUE SPACE.
                05  SFFLAG1           PIC X(02)          VALUE SPACE.
                05  SFDESC1           PIC X(12)          VALUE SPACE.

                05  SEL2              PIC X(01)          VALUE SPACE.
                05  SFCRAFT2          PIC X(02)          VALUE SPACE.
                05  SFFLAG2           PIC X(02)          VALUE SPACE.
                05  SFDESC2           PIC X(12)          VALUE SPACE.

                05  SEL3              PIC X(01)          VALUE SPACE.
                05  SFCRAFT3          PIC X(02)          VALUE SPACE.
                05  SFFLAG3           PIC X(02)          VALUE SPACE.
                05  SFDESC3           PIC X(12)          VALUE SPACE.

      *****************************************************************
      *  PROGRAM MESSAGES
      *****************************************************************
       01  WS-PROGRAM-MESSAGES.
           03  WS-NORECS-MSSG       PIC  X(79)         VALUE
               "No Records Found for Search Criteria Entered".
           03  WS-SELECT-MSSG       PIC  X(79)         VALUE
           "Make up to 3 Selections(1,2,3) - Press <ENTER> to Return".

           03  WS-1ST-PAGE          PIC  X(10)         VALUE
               "1st Page  ".
           03  WS-NXT-PAGE          PIC  X(10)         VALUE
               "*More     ".
           03  WS-LST-PAGE          PIC  X(10)         VALUE
               "Last Page ".
           03  WS-ONE-PAGE          PIC  X(10)         VALUE
               "Only Page ".
      *****************************************************************
      *  MISCELLANEOUS WORK FIELDS
      *****************************************************************
       01  WS-MISCELLANEOUS-FIELDS.

           03  WS-RRN            PIC  9(05)         VALUE ZERO.
           03  WS-RRN1           PIC  9(05)         VALUE ZERO.
           03  WS-RRNX           PIC  9(05)         VALUE ZERO.

           03  WS-LINE-CNT       PIC  9(02)         VALUE ZERO.

           03  WS-CRAFT1         PIC  X(02)         VALUE SPACE.
           03  WS-CRAFT2         PIC  X(02)         VALUE SPACE.
           03  WS-CRAFT3         PIC  X(02)         VALUE SPACE.

           03  WS-FLAG1          PIC  X(02)         VALUE SPACE.
           03  WS-FLAG2          PIC  X(02)         VALUE SPACE.
           03  WS-FLAG3          PIC  X(02)         VALUE SPACE.

           03  WS-DESC1          PIC  X(12)         VALUE SPACE.
           03  WS-DESC2          PIC  X(12)         VALUE SPACE.
           03  WS-DESC3          PIC  X(12)         VALUE SPACE.

           03  WS-START-KEY      PIC  X(02)         VALUE SPACE.
           03  WS-SFL-CNT        PIC  9(05)         VALUE ZERO.
           03  WS-PAGE-CNT       PIC  9(05)         VALUE ZERO.
           03  WS-PAGE-RRN       PIC  9(05)         VALUE ZERO.
           03  WS-SFLPAGE-MAXX   PIC  9(05)         VALUE 16.

           03  WS-SELECTION-SW   PIC  X(01)         VALUE SPACE.
               88  SELECTION-WAS-MADE-NO            VALUE "N".
               88  SELECTION-WAS-MADE-YES           VALUE "Y".

           03  WS-LAST-PAGE-SW   PIC  X(01)         VALUE SPACE.
               88  LAST-PAGE-NO                     VALUE "N".
               88  LAST-PAGE-YES                    VALUE "Y".

      *================================================================
      *=             L I N K A G E    S E C T I O N
      *================================================================
       LINKAGE SECTION.
       01  LS-CRAFT                PIC X(06).
       01  LS-FLAG                 PIC X(06).
       01  LS-DESC                 PIC X(36).
       01  LS-DSP                  PIC X(01).

      *================================================================
      *=             P R O C E D U R E    D I V I S I O N
      *================================================================
       PROCEDURE DIVISION  USING LS-CRAFT  LS-FLAG  LS-DESC  LS-DSP.
       0000-PROGRAM-ENTRY.

           OPEN  I-O    DISPLAY-FILE
                 INPUT  CRAFT-FILE.

      *----------------------------------------------------------------
      ** DISPLAY CRAFT & DESCRIPTIONS FOR SELECTION
      *----------------------------------------------------------------
           PERFORM 0010-INITIALIZE       THRU 0010-EXIT.

           PERFORM 1000-MAIN-LOGIC       THRU 1000-EXIT.

           PERFORM 0099-EOJ-RTN          THRU 0099-EXIT.

           CLOSE        DISPLAY-FILE
                        CRAFT-FILE.

       0000-PROGRAM-END.
           GOBACK.

      *****************************************************************
      ** 1ST TIME PROCESSING ROUTINE
      *****************************************************************
       0010-INITIALIZE.

           SET  SELECTION-WAS-MADE-NO   TO TRUE.

           MOVE  SPACE        TO LS-CRAFT  LS-FLAG  LS-DESC.

           MOVE LOW-VALUES           TO WS-START-KEY.
           MOVE SPACE                TO CCRAFT  OF WS-CTL01-FLDS.
           PERFORM 1999-LOAD-SFL01       THRU 1999-EXIT.

       0010-EXIT.
            EXIT.

      *****************************************************************
      ** END OF JOB PROCESSING
      *****************************************************************
       0099-EOJ-RTN.

           IF  SELECTION-WAS-MADE-YES
               MOVE  WS-CRAFT1    TO LS-CRAFT(1:2)
               MOVE  WS-FLAG1     TO LS-FLAG(1:2)
               MOVE  WS-DESC1     TO LS-DESC(1:12)
               MOVE  WS-CRAFT2    TO LS-CRAFT(3:2)
               MOVE  WS-FLAG2     TO LS-FLAG(3:2)
               MOVE  WS-DESC2     TO LS-DESC(13:12)
               MOVE  WS-CRAFT3    TO LS-CRAFT(5:2)
               MOVE  WS-FLAG3     TO LS-FLAG(5:2)
               MOVE  WS-DESC3     TO LS-DESC(25:12)
           END-IF.

       0099-EXIT.
            EXIT.

      *****************************************************************
      ***  MAIN PROCESSING LOOP ROUTINE
      *****************************************************************
       1000-MAIN-LOGIC.

           PERFORM 8000-DISPLAY-SCREEN-1  THRU 8000-DSP-EXIT.
           IF  KB-F03-KEY
               GO TO 1000-EXIT
           END-IF.

      ***  CHECK THE SFL FOR USER ENTRY
           IF  WS-RRN1 > ZERO
               PERFORM 1100-CHECK-SFL01       THRU 1100-EXIT
               IF  SELECTION-WAS-MADE-YES
                   GO TO 1000-EXIT
               END-IF
           END-IF.

           IF  SFL-PAGE-FWD

               IF  LAST-PAGE-YES
                   GO TO 1000-REDISPLAY
               END-IF

           END-IF.

           PERFORM 1999-LOAD-SFL01       THRU 1999-EXIT.

       1000-REDISPLAY.

           GO TO 1000-MAIN-LOGIC.

       1000-EXIT.
            EXIT.

      *****************************************************************
      ***  CHECK SFL01 FOR USER SELECTION
      *****************************************************************
       1100-CHECK-SFL01.

           SET  SELECTION-WAS-MADE-NO   TO TRUE.
           MOVE ZERO             TO WS-RRNX.

       1100-READN-SFL01.

      ***  ADD  1                TO WS-RRNX.
      ***  PERFORM 8000-READK-SFL01      THRU 8000-READK-EXIT.
           PERFORM 8000-READN-SFL01      THRU 8000-READN-EXIT.
           IF  FS-END-OF-FILE
               GO TO 1100-EXIT
           END-IF.

      ***  CHECK 1ST SELECT FLD FOR THE 3 POSSIBLE VALUES - 1,2 OR 3
           IF  SEL1 OF WS-SFL01-FLDS  = "1"
               SET  SELECTION-WAS-MADE-YES  TO TRUE
               MOVE SFCRAFT1  OF WS-SFL01-FLDS  TO WS-CRAFT1
               MOVE SFFLAG1   OF WS-SFL01-FLDS  TO WS-FLAG1
               MOVE SFDESC1   OF WS-SFL01-FLDS  TO WS-DESC1
           ELSE
               IF  SEL1 OF WS-SFL01-FLDS  = "2"
                   SET  SELECTION-WAS-MADE-YES  TO TRUE
                   MOVE SFCRAFT1  OF WS-SFL01-FLDS  TO WS-CRAFT2
                   MOVE SFFLAG1   OF WS-SFL01-FLDS  TO WS-FLAG2
                   MOVE SFDESC1   OF WS-SFL01-FLDS  TO WS-DESC2
               ELSE
                   IF  SEL1 OF WS-SFL01-FLDS  = "3"
                       SET  SELECTION-WAS-MADE-YES  TO TRUE
                       MOVE SFCRAFT1  OF WS-SFL01-FLDS  TO WS-CRAFT3
                       MOVE SFFLAG1   OF WS-SFL01-FLDS  TO WS-FLAG3
                       MOVE SFDESC1   OF WS-SFL01-FLDS  TO WS-DESC3
                   END-IF
               END-IF
           END-IF.

      ***  CHECK 2ND SELECT FLD FOR THE 3 POSSIBLE VALUES - 1,2 OR 3
           IF  SEL2 OF WS-SFL01-FLDS  = "1"
               SET  SELECTION-WAS-MADE-YES  TO TRUE
               MOVE SFCRAFT2  OF WS-SFL01-FLDS  TO WS-CRAFT1
               MOVE SFFLAG2   OF WS-SFL01-FLDS  TO WS-FLAG1
               MOVE SFDESC2   OF WS-SFL01-FLDS  TO WS-DESC1
           ELSE
               IF  SEL2 OF WS-SFL01-FLDS  = "2"
                   SET  SELECTION-WAS-MADE-YES  TO TRUE
                   MOVE SFCRAFT2  OF WS-SFL01-FLDS  TO WS-CRAFT2
                   MOVE SFFLAG2   OF WS-SFL01-FLDS  TO WS-FLAG2
                   MOVE SFDESC2   OF WS-SFL01-FLDS  TO WS-DESC2
               ELSE
                   IF  SEL2 OF WS-SFL01-FLDS  = "3"
                       SET  SELECTION-WAS-MADE-YES  TO TRUE
                       MOVE SFCRAFT2  OF WS-SFL01-FLDS  TO WS-CRAFT3
                       MOVE SFFLAG2   OF WS-SFL01-FLDS  TO WS-FLAG3
                       MOVE SFDESC2   OF WS-SFL01-FLDS  TO WS-DESC3
                   END-IF
               END-IF
           END-IF.


      ***  CHECK 3RD SELECT FLD FOR THE 3 POSSIBLE VALUES - 1,2 OR 3
           IF  SEL3 OF WS-SFL01-FLDS  = "1"
               SET  SELECTION-WAS-MADE-YES  TO TRUE
               MOVE SFCRAFT3  OF WS-SFL01-FLDS  TO WS-CRAFT1
               MOVE SFFLAG3   OF WS-SFL01-FLDS  TO WS-FLAG1
               MOVE SFDESC3   OF WS-SFL01-FLDS  TO WS-DESC1
           ELSE
               IF  SEL3 OF WS-SFL01-FLDS  = "2"
                   SET  SELECTION-WAS-MADE-YES  TO TRUE
                   MOVE SFCRAFT3  OF WS-SFL01-FLDS  TO WS-CRAFT2
                   MOVE SFFLAG3   OF WS-SFL01-FLDS  TO WS-FLAG2
                   MOVE SFDESC3   OF WS-SFL01-FLDS  TO WS-DESC2
               ELSE
                   IF  SEL3 OF WS-SFL01-FLDS  = "3"
                       SET  SELECTION-WAS-MADE-YES  TO TRUE
                       MOVE SFCRAFT3  OF WS-SFL01-FLDS  TO WS-CRAFT3
                       MOVE SFFLAG3   OF WS-SFL01-FLDS  TO WS-FLAG3
                       MOVE SFDESC3   OF WS-SFL01-FLDS  TO WS-DESC3
                   END-IF
               END-IF
           END-IF.


           SET  SFLNXTCHG-OFF    TO TRUE.
           MOVE SPACE            TO SEL1 OF WS-SFL01-FLDS.
           MOVE SPACE            TO SEL2 OF WS-SFL01-FLDS.
           MOVE SPACE            TO SEL3 OF WS-SFL01-FLDS.
           SET  DISPLAY-SEL1-FLD-YES  TO TRUE.
           SET  DISPLAY-SEL2-FLD-YES  TO TRUE.
           SET  DISPLAY-SEL3-FLD-YES  TO TRUE.
           PERFORM 8000-REWRT-SFL01      THRU 8000-REWRT-EXIT.

           GO TO 1100-READN-SFL01.

       1100-EXIT.
           EXIT.

      *****************************************************************
      ***  CLEAR SFL01
      *****************************************************************
       1998-CLEAR-SFL01.

           INITIALIZE  WS-SFL01-FLDS.
           MOVE ZERO             TO WS-RRN
                                    WS-RRN1
                                    WS-LINE-CNT
                                    WS-PAGE-CNT
                                    WS-PAGE-RRN.

           SET  DISPLAY-SEL1-FLD-NO   TO TRUE.
           SET  DISPLAY-SEL2-FLD-NO   TO TRUE.
           SET  DISPLAY-SEL3-FLD-NO   TO TRUE.
           SET  DISPLAY-SEL-LIT-NO    TO TRUE.

           MOVE 1                TO CRRN  OF WS-CTL01-FLDS.
           MOVE SPACE            TO PGMSG   OF WS-B01S-FLDS.

           SET  SFL-DISPLAY-OFF  TO TRUE.

           SET  SFL-CLEAR-ON     TO TRUE.
           PERFORM 8000-WRITE-CTL01      THRU 8000-WRTCR-EXIT.
           SET  SFL-CLEAR-OFF    TO TRUE.

           IF  LS-DSP = "S"
               SET  DISPLAY-SEL-LIT-YES   TO TRUE
           END-IF.

      **** SET  SFLEND-ON        TO TRUE.

       1998-EXIT.
            EXIT.

      *****************************************************************
      ***  LOAD  SFL01
      *****************************************************************
       1999-LOAD-SFL01.

           IF  SFL-PAGE-FWD
               GO TO 1999-LOAD-INIT
           END-IF.

           IF  WS-START-KEY = CCRAFT  OF WS-CTL01-FLDS
               GO TO 1999-EXIT
           END-IF.

           PERFORM 1998-CLEAR-SFL01      THRU 1998-EXIT.

           MOVE CCRAFT  OF WS-CTL01-FLDS TO WS-START-KEY.
           PERFORM 9000-START-CRAFT-FILE THRU 9000-START-EXIT.

       1999-LOAD-INIT.

           MOVE ZERO             TO WS-SFL-CNT  WS-LINE-CNT.

       1999-LOAD-LOOP.

           PERFORM 9000-READN-CRAFT-FILE  THRU 9000-READN-EXIT.
           IF  FS-END-OF-FILE
               IF  WS-LINE-CNT > ZERO
                   ADD  1            TO WS-RRN  WS-SFL-CNT
                   PERFORM 8000-WRITE-SFL01  THRU 8000-WRITE-EXIT
               END-IF
               IF  WS-SFL-CNT  > ZERO
                   PERFORM 1999A-SET-PAGE-DISPLAY THRU 1999A-SPD-EXIT
               END-IF
               GO TO 1999-EXIT
           END-IF.

           SET  SFLNXTCHG-OFF     TO TRUE.

           ADD  1                  TO WS-LINE-CNT.
           IF  WS-LINE-CNT = 1
           MOVE SPACE                 TO SEL1     OF WS-SFL01-FLDS
               IF  LS-DSP = "S"
                   SET  DISPLAY-SEL1-FLD-YES  TO TRUE
               END-IF
           MOVE CRAFTREQD OF CRAFT-REC  TO SFCRAFT1 OF WS-SFL01-FLDS
           MOVE CRAFTFLAG OF CRAFT-REC  TO SFFLAG1  OF WS-SFL01-FLDS
           MOVE CRAFTPAD  OF CRAFT-REC  TO SFDESC1  OF WS-SFL01-FLDS
           GO TO 1999-LOAD-LOOP
           END-IF.

           IF  WS-LINE-CNT = 2
           MOVE SPACE                   TO SEL2     OF WS-SFL01-FLDS
               IF  LS-DSP = "S"
                   SET  DISPLAY-SEL2-FLD-YES  TO TRUE
               END-IF
           MOVE CRAFTREQD OF CRAFT-REC  TO SFCRAFT2 OF WS-SFL01-FLDS
           MOVE CRAFTFLAG OF CRAFT-REC  TO SFFLAG2  OF WS-SFL01-FLDS
           MOVE CRAFTPAD  OF CRAFT-REC  TO SFDESC2  OF WS-SFL01-FLDS
           GO TO 1999-LOAD-LOOP
           END-IF.

           IF  WS-LINE-CNT = 3
           MOVE SPACE                   TO SEL3     OF WS-SFL01-FLDS
               IF  LS-DSP = "S"
                   SET  DISPLAY-SEL3-FLD-YES  TO TRUE
               END-IF
           MOVE CRAFTREQD OF CRAFT-REC  TO SFCRAFT3 OF WS-SFL01-FLDS
           MOVE CRAFTFLAG OF CRAFT-REC  TO SFFLAG3  OF WS-SFL01-FLDS
           MOVE CRAFTPAD  OF CRAFT-REC  TO SFDESC3  OF WS-SFL01-FLDS
           END-IF.

           ADD  1                  TO WS-RRN  WS-SFL-CNT.
           PERFORM 8000-WRITE-SFL01  THRU 8000-WRITE-EXIT.

           MOVE ZERO               TO   WS-LINE-CNT.
           INITIALIZE  WS-SFL01-FLDS.
           SET  DISPLAY-SEL1-FLD-NO   TO TRUE.
           SET  DISPLAY-SEL2-FLD-NO   TO TRUE.
           SET  DISPLAY-SEL3-FLD-NO   TO TRUE.

           IF  WS-SFL-CNT  = WS-SFLPAGE-MAXX
               PERFORM 1999A-SET-PAGE-DISPLAY THRU 1999A-SPD-EXIT
               GO TO 1999-EXIT
           END-IF.

           GO TO 1999-LOAD-LOOP.

       1999-EXIT.
            EXIT.
      *****************************************************************
      ***  SET THE PAGE DISPLAY RRN
      *****************************************************************
       1999A-SET-PAGE-DISPLAY.

            ADD  1              TO WS-PAGE-CNT.
            IF  WS-PAGE-CNT > 1
                COMPUTE WS-PAGE-RRN =
                      ((WS-PAGE-CNT - 1) * WS-SFLPAGE-MAXX)
            END-IF.

            ADD  1              TO WS-PAGE-RRN.
            PERFORM 2000-CHECK-MORE   THRU 2000-EXIT.

       1999A-SPD-EXIT.
              EXIT.
      *****************************************************************
      ***  SET THE PAGING MSG
      *****************************************************************
       2000-CHECK-MORE.

           SET  LAST-PAGE-NO   TO TRUE.
           MOVE SPACE          TO PGMSG   OF WS-B01S-FLDS.
           MOVE LOW-VALUES     TO WS-START-KEY.

      ***  END OF FILE COMING IN HERE
           IF FS-END-OF-FILE

              IF WS-PAGE-CNT = 1
                 MOVE WS-ONE-PAGE    TO PGMSG   OF WS-B01S-FLDS
                 SET  LAST-PAGE-YES  TO TRUE
              END-IF

              IF WS-PAGE-CNT > 1
                 MOVE WS-LST-PAGE    TO PGMSG   OF WS-B01S-FLDS
                 SET  LAST-PAGE-YES  TO TRUE
              END-IF

              GO TO 2000-EXIT
           END-IF.

      ***  CHECK TO SEE IF THERE IS ONE MORE RECORD
           PERFORM 9000-READN-CRAFT-FILE  THRU 9000-READN-EXIT.
           IF FS-GOOD-FILE-IO

      ***  DISPLAY 1ST PAGE MSG
              IF WS-PAGE-CNT = 1
                 MOVE WS-1ST-PAGE    TO PGMSG   OF WS-B01S-FLDS
              END-IF

      ***  DISPLAY *MORE MSG
              IF WS-PAGE-CNT > 1
                 MOVE WS-NXT-PAGE    TO PGMSG   OF WS-B01S-FLDS
              END-IF

      ***  RESET THE FILE POINTER BACK TO PRIOR RECORD
           PERFORM 9000-READP-CRAFT-FILE  THRU 9000-READP-EXIT
           GO TO 2000-EXIT
           END-IF.


      ***  END OF FILE
           IF FS-END-OF-FILE

      ***  END OF FILE AND ONE PAGE OR LESS HAS BEEN BUILT
      ***  DISPLAY ONLY PAGE MSG
              IF WS-PAGE-CNT = 1
                 MOVE WS-ONE-PAGE    TO PGMSG   OF WS-B01S-FLDS
              SET  LAST-PAGE-YES  TO TRUE
              END-IF

      ***  END OF FILE AND MORE THAN ONE PAGE WAS BUILT
      ***  DISPLAY LAST PAGE MSG
              IF WS-PAGE-CNT > 1
                 MOVE WS-LST-PAGE    TO PGMSG   OF WS-B01S-FLDS
              SET  LAST-PAGE-YES  TO TRUE
              END-IF

           END-IF.


       2000-EXIT.
            EXIT.
      *****************************************************************
      ** DISPLAY SCREEN 1 - LIST CRAFT DESCS
      *****************************************************************
       8000-DISPLAY-SCREEN-1.

           MOVE WS-PGM-VERSION     TO VERSION OF WS-H01-FLDS.
           MOVE "-S1"              TO VERSION OF WS-H01-FLDS(11:3).

      **** MOVE CORR WS-H01-FLDS   TO H01-O.
           WRITE DISPLAY-REC  FORMAT "H01"
           END-WRITE.

           IF  WS-RRN1 = ZERO
               MOVE  WS-NORECS-MSSG  TO  MSSG  OF WS-B01S-FLDS
           END-IF.

           IF  WS-RRN1 > ZERO
               SET  SFL-DISPLAY-ON   TO TRUE
               IF  LS-DSP = "S"
                   MOVE  WS-SELECT-MSSG  TO  MSSG  OF WS-B01S-FLDS
               END-IF
           END-IF.

           MOVE CORR WS-B01S-FLDS   TO B01S-O.
           WRITE DISPLAY-REC  FORMAT "B01S"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

           MOVE WS-PAGE-RRN TO CRRN  OF WS-CTL01-FLDS.
           MOVE CORR WS-CTL01-FLDS  TO CTL01-O.
           WRITE DISPLAY-REC  FORMAT "CTL01"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.


           READ  DISPLAY-FILE  FORMAT "CTL01"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-READ.
           MOVE CORR CTL01-I     TO WS-CTL01-FLDS.

           MOVE  SPACE           TO  MSSG  OF WS-B01S-FLDS.

       8000-DSP-EXIT.
            EXIT.

      *****************************************************************
      *** CTL01 WRITE CONTROL RECORD
      *****************************************************************
       8000-WRITE-CTL01.

           WRITE DISPLAY-REC  FORMAT "CTL01"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

       8000-WRTCR-EXIT.
            EXIT.
      *****************************************************************
      *** SFL01 READ NEXT MODIFIED RECORD
      *****************************************************************
       8000-READN-SFL01.

           READ SUBFILE DISPLAY-FILE
                NEXT MODIFIED RECORD FORMAT IS "SFL01"
                     INDICATORS ARE WS-ALL-INDICATORS
           END-READ.

           IF FS-GOOD-FILE-IO
               MOVE CORR SFL01-I   TO WS-SFL01-FLDS
           END-IF.

           MOVE WS-RRN              TO WS-RRN1.

       8000-READN-EXIT.
            EXIT.
      *****************************************************************
      *** SFL01 READ SUBFILE BY KEY(RRN)
      *****************************************************************
       8000-READK-SFL01.

           MOVE WS-RRNX             TO WS-RRN.
           READ SUBFILE DISPLAY-FILE
                RECORD FORMAT IS "SFL01"
                       INDICATORS ARE WS-ALL-INDICATORS
           END-READ.

           IF FS-GOOD-FILE-IO
               MOVE CORR SFL01-I   TO WS-SFL01-FLDS
           END-IF.

           MOVE WS-RRN              TO WS-RRN1.

       8000-READK-EXIT.
            EXIT.
      *****************************************************************
      *** SFL01 WRITE SUBFILE RECORD
      *****************************************************************
       8000-WRITE-SFL01.

           MOVE CORR WS-SFL01-FLDS  TO SFL01-O.
           WRITE SUBFILE DISPLAY-REC  FORMAT "SFL01"
                         INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

           MOVE WS-RRN              TO WS-RRN1.

       8000-WRITE-EXIT.
            EXIT.

      *****************************************************************
      *** SFL01 REWRITE SUBFILE RECORD
      *****************************************************************
       8000-REWRT-SFL01.

           MOVE CORR WS-SFL01-FLDS  TO SFL01-O.
           REWRITE SUBFILE DISPLAY-REC  FORMAT "SFL01"
                         INDICATORS ARE WS-ALL-INDICATORS
           END-REWRITE.

       8000-REWRT-EXIT.
            EXIT.

      *----------------------------------------------------------------
      *
      *            ALL DATABASE FILE I-O'S BELOW THIS POINT
      *
      *----------------------------------------------------------------

      *****************************************************************
      *** START CRAFT FILE
      *****************************************************************
       9000-START-CRAFT-FILE.

           INITIALIZE  CRAFT-REC.
           MOVE WS-START-KEY        TO CRAFTREQD OF CRAFT-REC.

           START CRAFT-FILE
                 KEY IS >= EXTERNALLY-DESCRIBED-KEY
           END-START.

       9000-START-EXIT.
            EXIT.

      *****************************************************************
      *** READ CRAFT FILE SEQUENTIALLY FWD
      *****************************************************************
       9000-READN-CRAFT-FILE.

           READ  CRAFT-FILE  NEXT RECORD
           END-READ.

       9000-READN-EXIT.
            EXIT.

      *****************************************************************
      *** READ CRAFT FILE SEQUENTIALLY BACKWARDS
      *****************************************************************
       9000-READP-CRAFT-FILE.

           READ  CRAFT-FILE  PRIOR RECORD
           END-READ.

       9000-READP-EXIT.
            EXIT.

      *****************************************************************
      ***              END  OF  SOURCE  MEMBER
      *****************************************************************
