000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.       SMODBDGT.
000500 AUTHOR.           KURT MOVSESIAN/JIM COFFMAN (MAINTAINER).
000800
000900***************************************************************
001000*                                                             *
001100*   S M O D B D G T                                           *
001200*                                                             *
001300*    THIS SUB PROGRAM UPDATES THE BUDGET AMOUNT IN DPORECD    *
001400*    AND IS CALLED WHEN THE BUDGET AMOUNT IS CHANGE BECAUSE   *
001500*    A EXISTING ITEM IS MODIFIED OR DELETED OR A NEW ITEM     *
001600*    IS ADDED TO THE ORDER.                                   *
001700***************************************************************
      *
      *C  07/18/1996   CA YODER
      *C    RE-COMPILED TO PICK UP CENTURY DATABASE CHANGES.
      *
      *C  11/26/2003   BRUCE GEISER
      *C    CHANGED VALUE LOGGED IN BLOWUP MESSAGE TO TRACK ERROR.
001800
001900
002000
002100 ENVIRONMENT DIVISION.
002200 CONFIGURATION SECTION.
002300 SOURCE-COMPUTER.  HP-3000.
002400 OBJECT-COMPUTER.  HP-3000.
002500
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DPORECD-O
                  ASSIGN TO DATABASE-MCFLCS0901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

002600 DATA DIVISION.
       FILE SECTION.
       FD  DPORECD-O
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLCS0901.

002700
002800 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
002900
003000**************************************************************
003100**************************************************************
003200**                                                          **
003300**                DATABASE I/O BUFFER AREA                  **
003400**                                                          **
003500**************************************************************
003600**************************************************************
003700
003800
003900*********************
004000*                   *
004100*   DATA SET NAMES  *
004200*                   *
004300*********************
004400
004500 01  DSET-NAMES.
004600     05  DSET-NAME              PIC X(16)  VALUE SPACES.
004700     05  DSET-DPORECD           PIC X(16)  VALUE "DPORECD;".
004800
004900 01 ITEMS-LISTING.
005000     05  ALL-ITEMS              PIC XX    VALUE "@;".
005100     05  PO-SEARCH              PIC X(10) VALUE "PO-RCV-NO;".
005200
005300 01 ARG-VALUES.
005400     05  PO-ARG                 PIC X(14) VALUE SPACES.
005500
006000
006100 LINKAGE SECTION.
006200
006300 01  BASE             PIC X(10).
006400
006500 COPY SMODBDGT IN COPYLIB.
006600
006700 COPY DPORECD IN COPYLIB.
006800
006900 COPY DBSTAT IN COPYLIB.
007000
007100 01  BU-DISPLAY-MSG.
007200     05  BU-DISPLAY-MSG-1         PIC X(1).
007300     05  FILLER                   PIC X(59).
007400
007500 01  BU-DISPLAY-FLDS.
007600     05  BU-DISPLAY-LINE  OCCURS 5 TIMES.
007700         10  BU-DISPLAY-FLD       PIC X(14).
007800         10  BU-DISPLAY-FLD9      PIC S9(8).
007900
008000
008100
008200 PROCEDURE DIVISION USING  BASE,
008300                           SMODBDGT-PARMS,
008400                           BUF-DPORECD,
008500                           STATUS-AREA,
008600                           BU-DISPLAY-MSG,
008700                           BU-DISPLAY-FLDS.
008800
008900
009000 SMODBDGT SECTION 02.
009100
009200 BEGIN-HERE.
           OPEN I-O DPORECD-O.

009300     PERFORM 6-MAIN THRU 6-M-X.

009400     CLOSE DPORECD-O.
009500     GOBACK.
009600
009700
009800******************************************************
009900**                                                  **
010000**   BLOWUP ROUTINE                                 **
010100**                                                  **
010200******************************************************
010300
010400 2-BLOWUP.
010500     MOVE "SMODBDGT"             TO  BU-DISPLAY-FLD (5).
010600     MOVE PO-RCV-NO              TO  BU-DISPLAY-FLD (4).
           MOVE SMODBDGT-PO-NUMBER     TO  BU-DISPLAY-FLD (3).
010700     GOBACK.
010800
010900
011000 6-MAIN.
011100*A   IF SMODBDGT-GET-DPORECD-SW = "Y"
011200     PERFORM 61-GET-DPORECD  THRU 61-GD-X.
011300
011400     PERFORM 62-UPDATE-DPORECD  THRU 62-UD-X.
011500
011600 6-M-X.
011700     EXIT.
011800
011900 61-GET-DPORECD.
012000     MOVE SMODBDGT-PO-NUMBER      TO PO-ARG.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPORECD-REC-O.
           START DPORECD-O KEY = PORCVNO OF DPORECD-REC-O
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
012100*A   CALL "DBFIND" USING BASE, DSET-DPORECD, MODE1,
012200*A       STATUS-AREA, PO-SEARCH, PO-ARG.
012300     IF COND-WORD NOT = 0
012400         MOVE "FIND DPORECD * 61-GD" TO BU-DISPLAY-MSG
012500         GO TO 2-BLOWUP.
           MOVE 0 TO COND-WORD.
           READ DPORECD-O NEXT INTO BUF-DPORECD
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPORECD-REC-O NOT = PO-ARG
               MOVE 15 TO COND-WORD.
012600*A   CALL "DBGET" USING BASE, DSET-DPORECD, MODE5,
012700*A       STATUS-AREA, ALL-ITEMS, BUF-DPORECD, PO-ARG.
012800     IF COND-WORD NOT = 0
012900         MOVE "GET DPORECD * 61-GD" TO BU-DISPLAY-MSG
013000         GO TO 2-BLOWUP.
013100     MOVE SPACES                  TO  SMODBDGT-GET-DPORECD-SW.
013200
013300 61-GD-X.
013400     EXIT.
013500
013600
013700 62-UPDATE-DPORECD.
014800     ADD SMODBDGT-BUDGET-NET-CHG  TO PO-BUDGET-AMT.
014900     IF PO-BUDGET-AMT < 0
015000         MOVE ZEROS               TO PO-BUDGET-AMT.
015100
           MOVE 0 TO COND-WORD.
           REWRITE DPORECD-REC-O FROM BUF-DPORECD
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
015200*A   CALL "DBUPDATE" USING BASE, DSET-DPORECD, MODE1,
015300*A       STATUS-AREA, ALL-ITEMS, BUF-DPORECD.
015400     IF COND-WORD NOT = 0
015500         MOVE "UPDATE DPORECD * 62-UD" TO BU-DISPLAY-MSG
015600         GO TO 2-BLOWUP.
015700
016400 62-UD-X.
016500     EXIT.
