000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          SMODFRTS.
000400 AUTHOR.              BUNN / BARBARA WINTER.
000500 DATE-WRITTEN.        FEBRUARY 26, 1982.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*                REWRITTEN APRIL 1985 TO COMBINE AKRON AND
001100*                SUBPLANTS VERSIONS.  -BARBARA WINTER.
001200*************************************************************
001300*************************************************************
001400**                  S M O D F R T S                        **
001500**                                                         **
001600*D        THIS PROGRAM MODIFIES FREIGHT INFORMATION        **
001700*D        FROM A RECEIVING SLIP.                           **
001800**                                                         **
001900**     RECEIVING SLIP NUMBER IS ENTERED AND VALIDATED.     **
002000**     THE FREIGHT DATA IS BROUGHT TO THE SCREEN AND THE   **
002100**     USER MAY MODIFY ANY DATA.  THE SAME CHECKS ARE      **
002200**     PERFORMED AS WHEN THE RECEIVING SLIP WAS CREATED.   **
002300**                                                         **
002400**     DATABASE UPDATING:                                  **
002500**          1.  DPOFREIGHT  -  UPDATED                     **
002600**          2.  DDAILYTC    -  ADD 351 TRANSACTION RECORD  **
002700**          3.  DDAILYTC    -  ADD 353 TRANSACTION RECORD  **
002800*************************************************************
      *C***********************************************************
      *C 08/28/92  -  JEFF BUNGO   (CONVERSION BUG FIX)
      *C     CHANGED IF STATEMENT TO CLOSE THIRD-PRT IF
      *C     PRINT-PRT-NO IS "NOT" ZEROS.
      *C
      *C 06/06/96      JEFF BUNGO
      *C     EXTEND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C
      *C 06/06/96      JEFF BUNGO
      *C     REMOVE ESCAPE SEQUENCES FROM PRINTING AND REFORMAT
      *C     FREIGHT INFO TO PRINT IN 80 COLUMNS.
      *C
      *C 10/30/97      CA YODER
      *C    ADDED CENTURY FOR DATABASE CHANGE TO MCFPCSTERM.
      *C
      *C 08/25/99      CA YODER   AKRON REQUEST.
      *C    ADDED ADDITIONAL INFORMATION FIELD TO PRINTOUT.
      *C
      *C***********************************************************
006900
007000 ENVIRONMENT DIVISION.
007100 CONFIGURATION SECTION.
007200 SOURCE-COMPUTER.  HP-3000.
007300 OBJECT-COMPUTER.  HP-3000.
       SPECIAL-NAMES. C01 IS NEW-PAGE
           I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
007600 INPUT-OUTPUT SECTION.
007700 FILE-CONTROL.
            SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.
015200      SELECT ACCTG-PRT    ASSIGN TO PRINTER-MCPRT2.
015300      SELECT THIRD-PRT    ASSIGN TO PRINTER-MCPRT3.
            SELECT DPOFREIGHT-I
               ASSIGN TO DATABASE-MCFLCS2401
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
            SELECT DPOFREIGHT-O
               ASSIGN TO DATABASE-MCFLCS2401
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
            SELECT DPORECD-I
               ASSIGN TO DATABASE-MCFLCS0901
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
            SELECT MPORCV-I
               ASSIGN TO DATABASE-MCFLCS0101
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
            SELECT DDAILYTC-O
               ASSIGN TO DATABASE-MCFLCS1601
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZUDCDOCK-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS DYNAMIC
                  RELATIVE KEY IS RELATIVE-RECNO
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.
             SELECT KFRTERMS-O
               ASSIGN TO DATABASE-MCFLCSTERM
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
            SELECT DRCVTRAK-O
               ASSIGN TO DATABASE-MCFLCS6404
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
           SELECT CARRIER-FILE
               ASSIGN TO DATABASE-MCFLCACARR
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
008100 DATA DIVISION.
008200 FILE SECTION.
005300 FD  ONLINE-PRT
005400     LABEL RECORDS ARE OMITTED
005500     RECORD CONTAINS 80 CHARACTERS
005600     DATA RECORD IS PRINT-RCD.
005700 01  PRINT-RCD.
005800     05  PRINT-LINE           PIC X(80).
018100
006000 FD  ACCTG-PRT
006100     LABEL RECORDS ARE OMITTED
006200     RECORD CONTAINS 80 CHARACTERS
006300     DATA RECORD IS ACCTG-RCD.
006400 01  ACCTG-RCD.
006500     05  PRINT-ACCTG          PIC X(80).
006600
006700 FD  THIRD-PRT
006800     LABEL RECORDS ARE OMITTED
006900     RECORD CONTAINS 80 CHARACTERS
007000     DATA RECORD IS THIRD-RCD.
007100 01  THIRD-RCD.
007200     05  PRINT-THIRD          PIC X(80).

       FD  DPOFREIGHT-I
           LABEL RECORDS ARE STANDARD.
       01  DPOFREIGHT-REC-I.
           COPY DDS-MCRPCS2400  OF MCFLCS2401.

       FD  DPOFREIGHT-O
           LABEL RECORDS ARE STANDARD.
       01  DPOFREIGHT-REC-O.
           COPY DDS-MCRPCS2400  OF MCFLCS2401.

       FD  DPORECD-I
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-REC-I.
           COPY DDS-MCRPCS0900  OF MCFLCS0901.

       FD  MPORCV-I
           LABEL RECORDS ARE STANDARD.
       01  MPORCV-REC-I.
           COPY DDS-MCRPCS0100  OF MCFLCS0101.

       FD  DDAILYTC-O
           LABEL RECORDS ARE STANDARD.
       01  DDAILYTC-REC-O.
           COPY DDS-MCRPCS1600  OF MCFLCS1601.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC          PIC X(2000).

       FD  KFRTERMS-O
           LABEL RECORDS ARE STANDARD.
       01  KFRTERMS-REC.
           COPY DDS-MCFRCSTERM OF MCFLCSTERM.
       FD  DRCVTRAK-O
           LABEL RECORDS ARE STANDARD.
       01  DRCVTRAK-REC-O.
           COPY DDS-MCRPCS6400  OF MCFLCS6404.
       FD  CARRIER-FILE
           LABEL RECORDS ARE STANDARD.
       01  CARRIER-REC.
           COPY DDS-MCRPCACARR  OF MCFLCACARR.

010400 WORKING-STORAGE SECTION.
010500************************************************************
010600*            W O R K I N G   S T O R A G E                 *
010700************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1      PIC X.
           05  FILE-STATUS-2      PIC X.
       01  RELATIVE-RECNO         PIC 9(9).

       01  FREIGHT-DATE-CN.
           05  FREIGHT-CC         PIC X(2).
           05  FREIGHT-YMD.
               10  FREIGHT-YY     PIC X(2).
               10  FREIGHT-MM     PIC X(2).
               10  FREIGHT-DD     PIC X(2).

      *------ WS CONTROL AREA
       01  MAJOR-MINOR                 PIC XXXX.
       01  WS-CONTROL.
           02  FUNCTION-NUM            PIC XX.
                   88  EXIT-KEY-F8-USED                     VALUE "08". LVW000LS
                   88  REFRESH-KEY-F4-USED                  VALUE "04". LVW000LS
                   88  ENTER-KEY-USED                       VALUE "00". LVW000LS
                   88  F1-KEY-USED                          VALUE "01". LVW000LS
                   88  F2-KEY-USED                          VALUE "02". LVW000LS
                   88  F3-KEY-USED                          VALUE "03". LVW000LS
                   88  F4-KEY-USED                          VALUE "04". LVW000LS
                   88  F5-KEY-USED                          VALUE "05". LVW000LS
                   88  F6-KEY-USED                          VALUE "06". LVW000LS
                   88  F7-KEY-USED                          VALUE "07". LVW000LS
                   88  F8-KEY-USED                          VALUE "08". LVW000LS
           02 FUN-KEY REDEFINES FUNCTION-NUM PIC XX.
           02 TERMINAL-ID PIC X(10).
           02 FORMAT-NAME PIC X(10).

       01  DISPLAY-STATUS              PIC X(2).

       01  SRF-INDICATORS.
           05  IND OCCURS 99 TIMES   PIC 1 INDICATOR 01.

       COPY IOFEEDBACK OF COPYLIB.
       COPY CATREAD    OF COPYLIB.
       COPY CCHKOBJ    OF COPYLIB.
010800 01  CVF-FILLER                    PIC X(10)  VALUE SPACES.
       01  SAVE-PO-TERM                  PIC X.
       01  SAVE-PO                       PIC X(14).
       01  KFRTERMS-STATUS               PIC X(2).
010900 01  KELLY-PO-WS                   PIC X      VALUE SPACE.
011000 01  LINE-ADV                      PIC 99      VALUE ZEROES.
011100 01  SAVE-PRO-DATE.
           05  SAVE-PRO-DATE-YY          PIC X(2)    VALUE SPACES.
           05  FILLER                    PIC X(4)    VALUE SPACES.
011200 COPY PLANTS OF COPYLIB.
011300*----------  PURCHASE ORDER WORK AREAS
011400 01  PO-RLSE-RS-WORKAREA.
011500     05  PO-RLSE-RS.
011600         10  PO-INDIC              PIC X      VALUE "P".
011700         10  WS-PO-AREA.
011800             15  WS-PO             PIC X(7)   VALUE SPACES.
011900             15  WS-RLSE           PIC X(3)   VALUE SPACES.
012000             15  WS-RS             PIC X(3)   VALUE SPACES.
012100             15  WS-RS-9 REDEFINES WS-RS  PIC 9(3).
012200     05  DISPLAY-PO-RLSE-RS.
012300         10  DISP-PO               PIC X(7)   VALUE SPACES.
012400         10  FILLER                PIC X      VALUE "-".
012500         10  DISP-RLSE             PIC X(3)   VALUE SPACES.
012600         10  FILLER                PIC X      VALUE "-".
012700         10  DISP-RS               PIC X(3)   VALUE SPACES.
012800     05  RS-WORKAREA.
012900         10  FILLER                PIC 9      VALUE ZEROS.
013000         10  RS-9                  PIC 99     VALUE ZEROS.
013100         10  RS-X REDEFINES RS-9   PIC XX.
013200
013300**************************************************************
013400*                 C A L L E D  R O U T I N E S               *
013500**************************************************************
013600*---------- VSETERROR AND VPUTWINDOW
013700 01  MESSAGE-BUFFER                PIC X(76)    VALUE SPACES.
013800 01  MESSAGE-BUFFER-RD REDEFINES MESSAGE-BUFFER.
013900     05  MSG-BUFFER                PIC X(68).
014000     05  MSG-VALUE                 PIC X(8).
014300 01  FIELD-NUMBER                  PIC S9(4)    VALUE 1 COMP-4.
014400
014500*---------- VPRINTFORM
014600 01  SCREEN-PRINT-PARMS.
014700     05  PRINT-CTL                 PIC S9(4)    VALUE 1  COMP-4.
014800     05  PAGE-CTL                  PIC S9(4)    VALUE 49 COMP-4.
014900     05  SPOOL-FIL-OPEN-SW         PIC X        VALUE "Y".
015000 01  RETURN-STATUS                 PIC X        VALUE SPACE.
015100
015200*----------  SPOOLER PARAMETERS
015300 01  SPOOLER-PARAMETERS.
015400     05  SPOOL-STATUS              PIC S9     VALUE ZERO  COMP-4.
015500     05  SPOOL-MESSAGE             PIC X(75)  VALUE SPACES.
015600     05  FILLER                    PIC X      VALUE SPACES.
015700     05  SPOOL-COPIES              PIC S9(2)  VALUE 1     COMP-4.
015800     05  SPOOL-PRIORITY            PIC S9     VALUE ZERO  COMP-4.
015900     05  ACCTG-STATUS              PIC S9     VALUE ZERO  COMP-4.
016000     05  ACCTG-MESSAGE             PIC X(75)  VALUE SPACES.
016100     05  FILLER                    PIC X      VALUE SPACES.
016200     05  ACCTG-COPIES              PIC S9(2)  VALUE 1     COMP-4.
016300     05  ACCTG-PRIORITY            PIC S9     VALUE ZERO  COMP-4.
016400*----------  THE FOLLOWING DATA IS FOR 3RD PRTR IN SUBPLANTS ONLY
016500     05  THIRD-STATUS              PIC S9    VALUE ZERO  COMP-4.
016600     05  THIRD-MESSAGE             PIC X(75)  VALUE SPACES.
016700     05  FILLER                    PIC X      VALUE SPACES.
016800     05  THIRD-COPIES              PIC S9(2)  VALUE 1   COMP-4.
016900     05  THIRD-PRIORITY            PIC S9     VALUE 0   COMP-4.
017000 COPY TBLOWUP   OF COPYLIB.
017200 COPY TDATECHK  OF COPYLIB.
017300 COPY DBMODES OF COPYLIB.
017400 COPY DBSTAT  OF COPYLIB.
       COPY OVRPFDATA OF COPYLIB.
017500 01  PO-ARG                        PIC X(14)  VALUE SPACES.
017600 01  MPLTINFO-ARG                  PIC X(4)   VALUE "P 01".
018600
018700 01  DB-LOG-TEXT                   PIC X(8)  VALUE "SMODFRTS".
018800 01  DB-LOG-TEXT-LEN               PIC S9(4) COMP-4 VALUE -8.
018900 COPY MPORCV  OF COPYLIB.
019000 COPY DPORECD  OF COPYLIB.
019100 COPY DFREIGHT OF COPYLIB.
       COPY DRCVTRAK OF COPYLIB.
019200 COPY DDAILYTC OF COPYLIB.
019300 COPY TC350    OF COPYLIB.
019400 COPY TC450    OF COPYLIB.
019500 COPY TC352    OF COPYLIB.
019510 COPY TC354    OF COPYLIB.
019600
019700 01  SMODFRTS                      PIC X(9)   VALUE "FREIGHT_4".
019710 01  FREIGHT-INTERNAL-PO           PIC X(10)  VALUE "FREIGHT_IT".
019800 01  RECEIVER                      PIC X(10)  VALUE "RECEIVER_1".
019900
020000 01  SCREEN-BUFFER-RECEIVER.
020100     05  DE-PO                     PIC X(7)  VALUE SPACES.
020200     05  DE-RLSE                   PIC X(3)  VALUE SPACES.
020300     05  DE-RS                     PIC X(3)  VALUE SPACES.
           05  DE-COMMAND-LINE1          PIC X(79).
           05  DE-MESSAGE-LINE1          PIC X(79).
020400
020500*----------  FREIGHT SCREEN BUFFER AREA
020600 01  FREIGHT-SCREEN-BUFFER.
020700     05  SCR-FOB                   PIC X(20) VALUE SPACES.
020800     05  SCR-VIA                   PIC X(20) VALUE SPACES.
020900     05  TYPE-FREIGHT-BUF          PIC X     VALUE SPACES.
021000     05  EMPLOYEE-BUF              PIC X(4)  VALUE SPACES.
021100     05  P-SLIP-NO-BUF             PIC X(12) VALUE SPACES.
021200     05  CARRIER-BUF               PIC X(4)  VALUE SPACES.
021300     05  FREIGHT-NO-BUF            PIC X(16) VALUE SPACES.
021400     05  FREIGHT-CHARGES-BUF.
021500         10  WHOLE-CHARGES         PIC X(13) VALUE SPACES.
021600         10  DECIMAL-CHARGES       PIC XX    VALUE SPACES.
021700     05  FREIGHT-CHARGES-BUF9 REDEFINES FREIGHT-CHARGES-BUF
021800                                   PIC 9(13)V99.
021900     05  FREIGHT-DATE-BUF.
022000         10  MM-BUF                PIC XX    VALUE SPACES.
022100         10  DD-BUF                PIC XX    VALUE SPACES.
022200         10  YY-BUF                PIC XX    VALUE SPACES.
022300     05  ORIGIN-BUF                PIC X(9)  VALUE SPACES.
022400     05  CARR-WT-BUF               PIC 9(8)  VALUE ZEROES.
022500     05  OUR-WT-BUF                PIC 9(8)  VALUE ZEROES.
022600     05  CAR-NO-BUF                PIC X(10) VALUE SPACES.
022700     05  LOT-NO-BUF                PIC X(8)  VALUE SPACES.
022800     05  SEALS-BUF                 PIC X(68) VALUE SPACES.
022900     05  Z-BILL-BUF                PIC X(6)  VALUE SPACES.
023000     05  OSD-NO-BUF                PIC X(3)  VALUE SPACES.
023100     05  COMMENT-BUF               PIC X(68) VALUE SPACES.
           05  DE-COMMAND-LINE2          PIC X(79).
           05  DE-MESSAGE-LINE2          PIC X(79).

       01  HDR-1.
           05  FILLER           PIC X(24)  VALUE SPACES.
           05  FILLER           PIC X(18)  VALUE " M O D I F I E D  ".
           05  FILLER           PIC X(13)  VALUE "F R E I G H T".
           05  FILLER           PIC X(06)  VALUE SPACES.
           05  PRT-DATE         PIC X(8)   VALUE SPACES.
           05  FILLER           PIC X(3)   VALUE SPACES.
           05  PRT-TIME         PIC X(8)   VALUE SPACES.

       01  HDR-1A.
           05  MSG3             PIC X(64)  VALUE SPACES.
           05  PRT-PRIOR-RS     PIC X(15)  VALUE SPACES.

       01  HDR-2.
           05  PRPD-COLLECT-H2  PIC X(8)   VALUE SPACES.
           05  FILLER           PIC X(10)  VALUE SPACES.
           05  MSG4             PIC X(12)  VALUE SPACES.
           05  FREIGHT-H2       PIC ZZZZZZZZZZZZZ.99 VALUE ZEROES.
           05  FILLER           PIC X(16)  VALUE SPACES.
           05  MSG7             PIC X(10)  VALUE SPACES.
           05  PRO-DATE-H2      PIC X(8)   VALUE SPACES.

       01  HDR-2A.
           05  MSG8             PIC X(8)   VALUE SPACES.
           05  CARRIER-H2A      PIC X(9)   VALUE SPACES.
           05  FILLER           PIC X(1)   VALUE SPACES.
           05  MSG9             PIC X(12)  VALUE SPACES.
           05  PRO-NUM-H2A      PIC X(16)  VALUE SPACES.
           05  FILLER           PIC X(16)  VALUE SPACES.
           05  MSG10            PIC X(14)  VALUE SPACES.
           05  EMPL-2A          PIC X(4)   VALUE SPACES.

       01  HDR-2B.
           05  MSG13            PIC X(8)   VALUE SPACES.
           05  LOT-NO-2B        PIC XXX    VALUE SPACES.
           05  FILLER           PIC X(7)   VALUE SPACES.
           05  MSG11            PIC X(16)  VALUE SPACES.
           05  P-SLIP-2B        PIC X(12)  VALUE SPACES.
           05  FILLER           PIC X(16)  VALUE SPACES.
           05  MSG12            PIC X(7)   VALUE SPACES.
           05  ORIGIN-2B        PIC X(9)   VALUE SPACES.

       01  HDR-2C.
           05  MSG16            PIC X(13)  VALUE SPACES.
           05  OSD-NO-2C        PIC X(3)   VALUE SPACES.
           05  FILLER           PIC X(2)   VALUE SPACES.
           05  MSG14            PIC X(11)  VALUE SPACES.
           05  CAR-NO-2C        PIC X(10)  VALUE SPACES.
           05  FILLER           PIC X(1)   VALUE SPACES.
           05  MSG5             PIC X(13)  VALUE SPACES.
           05  C-WT-2C          PIC ZZZZZZZ9  VALUE ZEROS.
           05  MSG6             PIC X(11)  VALUE SPACES.
           05  O-WT-2C          PIC ZZZZZZZ9  VALUE ZEROS.

       01  HDR-2D.
           05  MSG15            PIC X(10)  VALUE SPACES.
           05  SEALS-2D         PIC X(68)  VALUE SPACES.

       01  HDR-2E.
           05  MSG17            PIC X(10)  VALUE SPACES.
           05  COMMENT-2E       PIC X(70)  VALUE SPACES.

       01  HDR-2F.
           05  MSG18            PIC X(4)   VALUE SPACES.
           05  FILLER           PIC X(14)  VALUE SPACES.
           05  FOB-2F           PIC X(20)  VALUE SPACES.
           05  FILLER           PIC X(02)  VALUE SPACES.
           05  MSG20            PIC X(9)   VALUE SPACES.
           05  RCV-DATE-2F      PIC X(8)   VALUE SPACES.
           05  FILLER           PIC X(05)  VALUE SPACES.
           05  MSG19            PIC X(10)  VALUE SPACES.
           05  SEQ-2F           PIC X(6)   VALUE SPACES.

       01  HDR-3.
           05  MSG21            PIC X(17)  VALUE SPACES.
           05  PRT-RCV-DEPT     PIC X(4)   VALUE SPACES.
           05  FILLER           PIC X(16)  VALUE SPACES.
           05  FILLER           PIC X      VALUE SPACE.
           05  MSG22            PIC X(24)  VALUE SPACES.
           05  PRT-RS           PIC X(15)  VALUE SPACES.
           05  FILLER           PIC X(4)   VALUE SPACES.

       01  HDR-4.
           05  MSG24            PIC X(10)  VALUE SPACES.
           05  FILLER           PIC X      VALUE ":".
           05  FILLER           PIC X(2)   VALUE SPACES.
           05  PRT-ADDL-INFO    PIC X(16)  VALUE SPACES.
           05  FILLER           PIC X(9)   VALUE SPACES.
           05  MSG25            PIC X(6)   VALUE SPACES.
           05  FILLER           PIC X      VALUE ":".
           05  FILLER           PIC X(2)   VALUE SPACES.
           05  PRT-REQ-NO       PIC X(12)  VALUE SPACES.
           05  FILLER           PIC X(21)  VALUE SPACES.

       01  PRT-Z-BILL-NO.
           05  FILLER           PIC X(46)  VALUE SPACES.
           05  MSG23            PIC X(15)  VALUE SPACES.
           05  PRT-Z-BILL       PIC X(5)   VALUE SPACES.

031900 LINKAGE SECTION.
032000 COPY VCOMLINK OF COPYLIB.
032100 COPY DOCKMISC OF COPYLIB.
032200
032300*---------- VALID RECEIVING DEPARTMENTS AND SPOOLER NUMBERS
032400 01  USER-AREA                 PIC X(2400).
032500 01  USER-AREA-RD  REDEFINES USER-AREA.
032600     02  USER-DATA    OCCURS 200 TIMES
032700                      INDEXED BY U-X.
032800         05  USER-NAME-UA      PIC X(8).
032900         05  RCV-DPT-UA        PIC X(4).
033000
033100 COPY LANGSUB OF COPYLIB.
033200 COPY ESCNAME OF COPYLIB.
033300
033400*************************************************************
033500*      A RECEIVING SLIP NUMBER IS ENTERED BY THE USER       *
033600*      ANDVALIDATED.  THE FREIGHT INFORMATION IS PUT       *
033700*      TO THE SCREEN AND MAY BE MODIFIED.  THE NEW DATA     *
033800*      IS STORED IN THE DATABASE AND TRANSACTIONS 351       *
033900*      AND 353 ARE CREATED.                                 *
034000*************************************************************
034100 PROCEDURE DIVISION USING VIEW-COMAREA,
034200                          MISCELLANEOUS-DATA,
034300                          USER-AREA,
034400                          LANGUAGE-PARMS,
034500                          ESC-NAME.
034600 00-MAIN.
           OPEN INPUT MPORCV-I DPORECD-I DPOFREIGHT-I CARRIER-FILE.
           OPEN I-O   KFRTERMS-O DPOFREIGHT-O DDAILYTC-O DISPLAY-FILE
                      DRCVTRAK-O.
034700     PERFORM 300-MAIN THRU 399-EXIT.
           CLOSE MPORCV-I DPORECD-I DPOFREIGHT-I KFRTERMS-O
                 DPOFREIGHT-O DDAILYTC-O DISPLAY-FILE
                 DRCVTRAK-O CARRIER-FILE.
034800     GOBACK.
034900
035000*************************************************************
035100*         DISPLAY SCREEN REQUESTING RECEIVER NUMBER.        *
035200*************************************************************
035300 300-MAIN.
036400
036500     MOVE RECEIVER    TO  VIEW-NFNAME.
           MOVE "000" TO DE-RLSE DE-RS.
037900
038000 305-DISPLAY-RECEIVING-SCREEN.
           MOVE SCREEN-BUFFER-RECEIVER TO DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
              INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO SRF-INDICATORS.
           MOVE DISPLAY-REC TO SCREEN-BUFFER-RECEIVER.

      *------ A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *------ IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.
035800
036200     IF VIEW-LASTKEY EQUAL 1 OR
036300        VIEW-LASTKEY EQUAL 2 OR
036400        VIEW-LASTKEY EQUAL 8 OR
036500        VIEW-LASTKEY EQUAL 4 OR
036700        VIEW-LASTKEY EQUAL 6
              MOVE 9 TO LANG-SETNUM
              MOVE 10 TO LANG-MSGNUM
036800        PERFORM 940-VSETERROR THRU 949-EXIT
036900        GO TO 305-DISPLAY-RECEIVING-SCREEN.
039000
039100     IF VIEW-LASTKEY EQUAL 3
039200        GO TO 399-EXIT
039300     ELSE
039400        IF VIEW-LASTKEY EQUAL 7
039500           GO TO 300-MAIN.
040200*----------  VALIDATE PO
040300     MOVE DE-PO                  TO  WS-PO, DISP-PO.
040400     MOVE DE-RLSE                TO  WS-RLSE, DISP-RLSE.
040500     MOVE DE-RS                  TO  WS-RS, DISP-RS.
040600     MOVE PO-RLSE-RS             TO  PO-ARG, SAVE-PO.
040700
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF MPORCV-REC-I.
           READ MPORCV-I INTO BUF-MPORCV
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
041000     IF NOT GOOD-CALL
041100         IF NO-ENTRY
041200*            *** PURCHASE ORDER DOES NOT EXIST ***
041300             MOVE  16            TO LANG-SETNUM
041400             MOVE  45            TO LANG-MSGNUM
041500             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
041600             MOVE DE-PO          TO MSG-VALUE
041700             MOVE 1              TO FIELD-NUMBER
041800             PERFORM 940-VSETERROR THRU 949-EXIT
041900             GO TO 305-DISPLAY-RECEIVING-SCREEN
042000         ELSE
042100           MOVE "DBGET MPORCV AT 315 SMODFRTS " TO BU-DISPLAY-MSG
042200           PERFORM 990-BLOWUP THRU 999-EXIT.
042300
042400     MOVE ZEROS      TO WS-RS-9.
042500     MOVE PO-RLSE-RS TO PO-ARG.
           MOVE SPACES TO SAVE-PO-TERM.
042600
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPORECD-REC-I.
           START DPORECD-I KEY = PORCVNO OF DPORECD-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
042900     IF NOT GOOD-CALL
043000           MOVE "DBFIND DPORECD SMODFRTS AT 310" TO BU-DISPLAY-MSG
043100           PERFORM 990-BLOWUP THRU 999-EXIT.
           MOVE 0 TO COND-WORD.
           READ DPORECD-I NEXT INTO BUF-DPORECD
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPORECD-REC-I NOT = PO-ARG
               MOVE 15 TO COND-WORD.
043400     IF NOT GOOD-CALL
043500           MOVE "DBGET DPORECD 305 SMODFRTS" TO BU-DISPLAY-MSG
043600           PERFORM 990-BLOWUP THRU 999-EXIT.
043700
           MOVE PO-FREIGHT-TERMS TO SAVE-PO-TERM.
043800     MOVE DE-RS      TO WS-RS.
043900     MOVE PO-RLSE-RS TO PO-ARG.
           MOVE PO-ADDL-INFO TO PRT-ADDL-INFO.
           MOVE PO-REQ-NUMBER   TO PRT-REQ-NO.
044000*----------  ONLY AKRON NEEDS TO VALIDATE USERS
044100     IF NOT AKRON
044200        GO TO 325-GET-DB-FREIGHT.
044300
044400*----------  SET FLAG IF PO IS AN INTERNAL ORDER
044500     IF PO-INTERNAL-ORDER-INDIC = "X"
044600         MOVE "N" TO  TC350-FLAG-AREA
044700         MOVE "N" TO TC352-FLAG-AREA.
044800
044900*----------  DO NOT VALIDATE USERS IF MGR OR DOCKX
045000     IF MISC-USER-NAME = "MGR     "
045100         GO TO 325-GET-DB-FREIGHT.
045200
045300     IF MISC-USER-NAME = "DOCKX   "
045400         GO TO 325-GET-DB-FREIGHT.
045500
045600*----------  FIND USER IN TABLE AND MATCH RECEIVING DEPARTMENTS.
045700*            IF NOT FOUND, THE USER CANNOT MODIFY THIS
045800*            RECEIVING SLIP.
045900     SET U-X TO 1.
046000     SEARCH USER-DATA
046100          AT END GO TO 320-INVALID-USER
046200          WHEN USER-NAME-UA (U-X) = MISC-USER-NAME
046300          MOVE RCV-DPT-UA (U-X) TO PRT-RCV-DEPT
046400          GO TO 325-GET-DB-FREIGHT.
046500
046600 320-INVALID-USER.
046700     MOVE PO-RCV-DEPT    TO  MSG-VALUE.
046800*    *** YOU ARE NOT AUTHORIZED TO RECEIVE THIS SHIPMENT ***
046900     MOVE  25 TO LANG-SETNUM.
047000     MOVE   1 TO LANG-MSGNUM.
047100     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
047200     PERFORM  940-VSETERROR  THRU  949-EXIT.
047300     GO TO  305-DISPLAY-RECEIVING-SCREEN.
047400
047500*----------  GET FREIGHT DATA TO PUT TO SCREEN
047600 325-GET-DB-FREIGHT.
047700     MOVE SPACES TO FREIGHT-SCREEN-BUFFER.
047800     MOVE PO-FOB     TO SCR-FOB.
047900     MOVE PO-VIA     TO SCR-VIA.
048200     IF NOT GOOD-CALL
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPOFREIGHT-REC-I.
           START DPOFREIGHT-I KEY = PORCVNO OF DPOFREIGHT-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF NOT GOOD-CALL
041200*            *** PURCHASE ORDER DOES NOT EXIST ***
041300             MOVE  16            TO LANG-SETNUM
041400             MOVE  45            TO LANG-MSGNUM
041500             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
041600             MOVE DE-PO          TO MSG-VALUE
041700             MOVE 1              TO FIELD-NUMBER
041800             PERFORM 940-VSETERROR THRU 949-EXIT
041900             GO TO 305-DISPLAY-RECEIVING-SCREEN.
048500
           MOVE 0 TO COND-WORD.
           READ DPOFREIGHT-I NEXT INTO BUF-DPOFREIGHT
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPOFREIGHT-REC-I NOT = PO-ARG
               MOVE 15 TO COND-WORD.
048800     IF NOT GOOD-CALL
048900           MOVE "DBGET DFREIGHT SMODFRTS AT 325" TO BU-DISPLAY-MSG
049000           PERFORM 990-BLOWUP THRU 999-EXIT.
049100
049200     IF FRT-REFERBACK NOT = SPACES
049300*        *** TO PROCESS THIS FREIGHT USE RECEIVING SLIP # ***
049400         MOVE  20 TO LANG-SETNUM
049500         MOVE  24 TO LANG-MSGNUM
049600         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
049700         MOVE FRT-REFER-PO   TO DISP-PO
049800         MOVE FRT-REFER-RLSE TO DISP-RLSE
049900         MOVE FRT-REFER-RS   TO DISP-RS
050000         MOVE DISPLAY-PO-RLSE-RS TO MSG-VALUE
050100         MOVE 1              TO FIELD-NUMBER
050200         PERFORM 940-VSETERROR THRU 949-EXIT
050300         GO TO 305-DISPLAY-RECEIVING-SCREEN.
050400
050500     IF PO-ZBILL = SPACES
050600         MOVE FRT-ZBILL      TO Z-BILL-BUF
050700     ELSE
050800         MOVE PO-ZBILL       TO Z-BILL-BUF.
050900
051000     MOVE FRT-CARRIER        TO CARRIER-BUF.
051100     MOVE FRT-BILL-NO        TO FREIGHT-NO-BUF.
051200*----------  PUT DATE IN CORRECT US/EUROPEAN FORMAT
051300     MOVE 4 TO DATE-MODE.
051400     MOVE FRT-BILL-DATE      TO DATE-VALIDATE-IN.
051500     CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
051600     MOVE DATE-OUT           TO FREIGHT-DATE-BUF.
051700
052100     MOVE FRT-CHARGES-9 TO FREIGHT-CHARGES-BUF9.
052200     MOVE FRT-PACK-SLIP      TO P-SLIP-NO-BUF.
052300     MOVE FRT-CARRIER-WT     TO CARR-WT-BUF.
052400     MOVE FRT-OUR-WT         TO OUR-WT-BUF.
052500     MOVE FRT-SPLC           TO ORIGIN-BUF.
052600     MOVE FRT-EMPL           TO EMPLOYEE-BUF.
052700     MOVE FRT-LOT            TO LOT-NO-BUF.
052800     MOVE FRT-RAIL-CAR       TO CAR-NO-BUF.
052900     MOVE FRT-SEALS          TO SEALS-BUF.
053000     MOVE FRT-OSD            TO OSD-NO-BUF.
           MOVE FRT-OSD-CLAIM      TO COMMENT-BUF.
053100     MOVE FRT-TYPE           TO TYPE-FREIGHT-BUF.
053200
053300*----------  GET THE NEXT FORM
053310*    IF PO-INTERNAL-ORDER-INDIC = "X"
053311*       MOVE "G" TO TYPE-FREIGHT-BUF
053320*       MOVE FREIGHT-INTERNAL-PO TO VIEW-NFNAME
053330*    ELSE
053400        MOVE SMODFRTS    TO  VIEW-NFNAME.
053500
055700*************************************************************
055800*     DISPLAY FREIGHT INFORMATION.  THE USER MAY TYPE OVER  *
055900*     ANY DATA TO MODIFY IT.  THE SCREEN IS THEN READ AND   *
056000*     THE DATA IS STORED AS AN UPDATE TO THE DATABASE.      *
056100*                                                           *
056200*************************************************************
056300 330-SHOW-FORM.
056600*----------  IF WARNING MSG FOR FRT CHARGES IS DISPLAYED, ALLOW
056700*            USER TO PRESS F2 TO CONTINUE
           MOVE FREIGHT-SCREEN-BUFFER TO DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
              INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO SRF-INDICATORS.
           MOVE DISPLAY-REC TO FREIGHT-SCREEN-BUFFER.

      *------ A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *------ IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.
036100
           IF LANG-MSGNUM NOT = 13
              IF VIEW-LASTKEY = 2
                 MOVE 9 TO LANG-SETNUM
                 MOVE 10 TO LANG-MSGNUM
036800           PERFORM 940-VSETERROR THRU 949-EXIT
036900           GO TO 330-SHOW-FORM.

036200     IF VIEW-LASTKEY EQUAL 1 OR
036400        VIEW-LASTKEY EQUAL 8 OR
036500        VIEW-LASTKEY EQUAL 4 OR
036700        VIEW-LASTKEY EQUAL 6
              MOVE 9 TO LANG-SETNUM
              MOVE 10 TO LANG-MSGNUM
036800        PERFORM 940-VSETERROR THRU 949-EXIT
036900        GO TO 330-SHOW-FORM.
058000
058100     IF VIEW-LASTKEY EQUAL 3
058200        GO TO 399-EXIT
058300     ELSE
058400        IF VIEW-LASTKEY EQUAL 7
058500           GO TO 300-MAIN.
058600
058700*----------  IF WARNING MSG WAS DISPLAYED BECAUSE FRT CHARGES
058800*            WERE > 100,000 AND F2 WAS PRESSED, ALLOW USER
058900*            TO CONTINUE
059000     IF VIEW-LASTKEY = 2
059100        IF LANG-MSGNUM = 13
059200           GO TO 332-AFTER-VALIDATION.
060000
060600     MOVE FREIGHT-CHARGES-BUF9 TO FREIGHT-H2.
060700
060800     IF PO-ZBILL = SPACES
060900         NEXT SENTENCE
061000     ELSE
061100         IF Z-BILL-BUF NOT = PO-ZBILL
061200*          *** CAN NOT ENTER ANOTHER ZBILL NUMBER ***
061300           MOVE   3 TO LANG-SETNUM
061400           MOVE  41 TO LANG-MSGNUM
061500           MOVE 17  TO FIELD-NUMBER
061600           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
061700           MOVE PO-ZBILL          TO MSG-VALUE
061800           PERFORM 940-VSETERROR THRU 949-EXIT
061900           GO TO 330-SHOW-FORM.
062000
062100     MOVE SPACES                    TO MESSAGE-BUFFER.
062200     MOVE KELLY-PO-IND               TO KELLY-PO-WS.
062300*----------  VALIDATE FREIGHT ROUTINE
062400     CALL "CVALFRT" USING PLT-NUMBER, MESSAGE-BUFFER,
062500                          FIELD-NUMBER, KELLY-PO-WS,
062600                          FREIGHT-SCREEN-BUFFER,
062700                          LANGUAGE-PARMS, CVF-FILLER.
062800
063100     IF MESSAGE-BUFFER NOT = SPACES
063200        PERFORM 940-VSETERROR THRU 949-EXIT
063300        GO TO 330-SHOW-FORM.
063400     IF LANG-SETNUM NOT = ZEROES
063500        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
063600        PERFORM 940-VSETERROR THRU 949-EXIT
063700        GO TO 330-SHOW-FORM.
063701
063710     MOVE SPACES TO BUF-DDAILYTC.
063800
063900 332-AFTER-VALIDATION.
064000     IF NOT AKRON
064100        GO TO 335-FREIGHT-TYPE.
064200
064300*-------- IF FRT-TC-FLAG DOES NOT CONTAIN AN "N"
064400*          (MEANING INTERNAL ORDER), PLACE A "C" FLAG IF THE
064500*          FREIGHT IS A COLLECT SHIPMENT; A "G" IF THE SHIPMENT
064600*          IS GOODYEAR TO GOODYEAR; AND A BLANK FOR PREPAID.
064700
064800     IF  TC350-FLAG-AREA = SPACES
064900         IF TYPE-FREIGHT-BUF = "C"
065000             MOVE "C" TO  TC350-FLAG-AREA
065100             MOVE "C" TO TC352-FLAG-AREA
065200         ELSE
065300         IF TYPE-FREIGHT-BUF = "G"
065400             MOVE "G" TO  TC350-FLAG-AREA
065500             MOVE "G" TO TC352-FLAG-AREA
065600         ELSE
065700             MOVE " " TO  TC350-FLAG-AREA
065800             MOVE " " TO TC352-FLAG-AREA.
065900 335-FREIGHT-TYPE.
066000     IF TYPE-FREIGHT-BUF = "D"
066100        MOVE "LOCAL" TO PRPD-COLLECT-H2
066200     ELSE
066300     IF TYPE-FREIGHT-BUF = "U"
066400        MOVE "UPS" TO PRPD-COLLECT-H2
066500     ELSE
066600     IF TYPE-FREIGHT-BUF = "P"
066700         MOVE "PREPAID" TO PRPD-COLLECT-H2
066800     ELSE
066900     IF TYPE-FREIGHT-BUF = "C"
067000         MOVE "COLLECT" TO PRPD-COLLECT-H2
067100     ELSE
067200         MOVE "GOODYEAR" TO PRPD-COLLECT-H2.
067300
067400     MOVE CARRIER-BUF    TO CARRIER-H2A.
067500     MOVE FREIGHT-NO-BUF TO PRO-NUM-H2A.
067600
067800     MOVE  3             TO DATE-MODE.
067900     MOVE FREIGHT-DATE-BUF  TO DATE-VALIDATE-IN.
068000     CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
068100     MOVE DATE-YMD-OUT TO SAVE-PRO-DATE.
068200     MOVE DATE-SLASH-OUT  TO PRO-DATE-H2.
068300     MOVE P-SLIP-NO-BUF  TO P-SLIP-2B.
068400     MOVE CARR-WT-BUF    TO C-WT-2C.
068500     MOVE OUR-WT-BUF     TO O-WT-2C.
068600     MOVE ORIGIN-BUF     TO ORIGIN-2B.
068700     MOVE EMPLOYEE-BUF   TO EMPL-2A.
068800     MOVE LOT-NO-BUF     TO LOT-NO-2B.
068900     MOVE CAR-NO-BUF     TO CAR-NO-2C.
069000     MOVE SEALS-BUF      TO SEALS-2D.
069100     MOVE OSD-NO-BUF     TO OSD-NO-2C.
069200     MOVE COMMENT-BUF    TO COMMENT-2E.
           MOVE PO-FOB         TO FOB-2F.
           MOVE FRT-DATE-RCVD  TO RCV-DATE-2F.
           MOVE M-PO-RCV-SEQ   TO SEQ-2F.
069300
070200*************************************************************
070300*          DDAILYTC TRANSACTION CODE 351 OR 451             *
070400*************************************************************
071100     MOVE 1                              TO DATE-MODE.
071200     CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
071300     MOVE DATE-SLASH-OUT   TO PRT-DATE.
071400     MOVE DATE-YMD-OUT     TO DDAILYTC-DATE.
071500     MOVE DATE-UNFORMATTED-TIME-OUT       TO DDAILYTC-TIME.
071600     MOVE PLT-NUMBER TO DDAILYTC-PLT.
071700
071800     IF FREIGHT-CHARGES-BUF9 > 999999.99
071900        GO TO 340-CREATE-TC451.
072000
072100     MOVE "351"                           TO DDAILYTC-TC.
072200     MOVE PO-RLSE-RS                      TO TC350-RS.
072300     MOVE CARRIER-BUF                     TO TC350-CARRIER.
072400     MOVE FREIGHT-NO-BUF                  TO TC350-PRO-NUMBER.
072500     MOVE SAVE-PRO-DATE                   TO TC350-PRO-DATE.
072900     MOVE P-SLIP-NO-BUF                   TO TC350-PACK-SLIP.
073000
073100     IF FREIGHT-CHARGES-BUF = SPACES
073200         MOVE ZEROS                       TO  TC350-CHARGES
073300     ELSE
073400         MOVE FREIGHT-CHARGES-BUF9               TO TC350-CHARGES
073500
073600     GO TO 345-PUT-TC351.
073700
073800 340-CREATE-TC451.
073900     MOVE "451"                           TO DDAILYTC-TC.
074000     MOVE WS-PO-AREA                      TO TC450-RS.
074100     MOVE CARRIER-BUF                     TO TC450-CARRIER.
074200     MOVE FREIGHT-NO-BUF                  TO TC450-PRO-NUMBER.
074300     MOVE SAVE-PRO-DATE                   TO TC450-PRO-DATE.
074400     MOVE FREIGHT-CHARGES-BUF9                   TO TC450-CHARGES.
074500
074600 345-PUT-TC351.
           MOVE 0 TO COND-WORD.
           WRITE DDAILYTC-REC-O FROM BUF-DDAILYTC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
074900     IF NOT GOOD-CALL
075000           MOVE "DBPUT DDAILYTC SMODFRTS AT 335" TO BU-DISPLAY-MSG
075100           PERFORM 990-BLOWUP THRU 999-EXIT.
075200
075700********************************************************
075800*    DDAILYTC - FREIGHT TRANSACTION RECORD 353         *
075900********************************************************
076700     MOVE "353"                         TO DDAILYTC-TC.
076800     MOVE SPACES                        TO DDAILYTC-DATA.
076900     MOVE PO-RLSE-RS                    TO TC352-RS.
077000     MOVE Z-BILL-BUF                    TO TC352-ZBILL.
077100     MOVE ORIGIN-BUF                    TO TC352-SPLC.
077200     IF AKRON
077300        MOVE CARR-WT-BUF                TO TC352-WEIGHT
077400     ELSE
077500        IF CARR-WT-BUF = SPACES OR ZEROES
077600           MOVE OUR-WT-BUF              TO TC352-WEIGHT
077700        ELSE
077800           MOVE CARR-WT-BUF             TO TC352-WEIGHT.
077900     MOVE CAR-NO-BUF                    TO TC352-CAR.
078000     MOVE TYPE-FREIGHT-BUF              TO TC352-TYPE.
078100
078110     IF KELLY-PLANT
078120        NEXT SENTENCE
078130     ELSE
078140        IF AKRON
078150           NEXT SENTENCE
078160        ELSE
078170           MOVE EMPLOYEE-BUF TO VENDOR-PAID-PACK-SLIP.
078180
           MOVE 0 TO COND-WORD.
           WRITE DDAILYTC-REC-O FROM BUF-DDAILYTC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
078400     IF NOT GOOD-CALL
078500           MOVE "DBPUT2 DDAILYTC SMODFRTS 335" TO BU-DISPLAY-MSG
078600           PERFORM 990-BLOWUP THRU 999-EXIT.
078700
079120*----------  IF CARRIER OR FRT BILL NUMBER HAS BEEN MODIFIED,
079130*            TIS NEEDS A SEPARATE RECORD
079140     IF CARRIER-BUF NOT = FRT-CARRIER
079150        GO TO 360-CREATE-TC354.
079160     IF FREIGHT-NO-BUF = FRT-BILL-NO
079170        GO TO 370-UPDATE-DPOFREIGHT.
079180
079190 360-CREATE-TC354.
079191     MOVE SPACES TO DDAILYTC-DATA.
079192     MOVE "354"  TO DDAILYTC-TC.
079193     MOVE PO-RLSE-RS TO TC354-RS.
079194     MOVE FRT-CARRIER TO TC354-OLD-CARRIER.
079195     MOVE FRT-BILL-NO TO TC354-OLD-FRT-BILL.
079196     MOVE CARRIER-BUF TO TC354-NEW-CARRIER.
079197     MOVE FREIGHT-NO-BUF TO TC354-NEW-FRT-BILL.
           MOVE 0 TO COND-WORD.
           WRITE DDAILYTC-REC-O FROM BUF-DDAILYTC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
079280     IF NOT GOOD-CALL
079290           MOVE "DBPUT2 DDAILYTC SMODFRTS 360" TO BU-DISPLAY-MSG
079300           PERFORM 990-BLOWUP THRU 999-EXIT.

      *------JSB 03/18/97
      *------IF CARRIER HAS CHANGED...
      *------FIND ANY DRCVTRAK RECORDS FOR RECEIVING SLIP AND UPDATE
      *------CARRIER AND EXPEDITE CARRIER FLAG.
           MOVE DE-PO                           TO  WS-PO.
           MOVE DE-RLSE                         TO  WS-RLSE.
           MOVE DE-RS                           TO  WS-RS.
           MOVE PO-RLSE-RS TO RCVSLIP OF DRCVTRAK-REC-O.
           MOVE ZEROS TO ITEMNO OF DRCVTRAK-REC-O.
           START DRCVTRAK-O KEY NOT < EXTERNALLY-DESCRIBED-KEY
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
       360-LOOP.
           READ DRCVTRAK-O NEXT INTO BUF-DRCVTRAK
             AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               GO TO 370-UPDATE-DPOFREIGHT.
           IF RCVTRAK-RCV-SLIP NOT = PO-RLSE-RS
               GO TO 370-UPDATE-DPOFREIGHT.
           MOVE CARRIER-BUF TO RCVTRAK-CARRIER.
      *----------CHECK IF CARRIER IS EXPEDITE FREIGHT CARRIER
           MOVE CARRIER-BUF TO KCARCDE OF CARRIER-REC.
           READ CARRIER-FILE
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-READ.
           IF FILE-STATUS NOT = "00"
               MOVE SPACES TO RCVTRAK-EXPD-CARR
           ELSE
               IF KCAREXP OF CARRIER-REC NOT = "Y "
                   MOVE SPACES TO RCVTRAK-EXPD-CARR
               ELSE
                   MOVE "X" TO RCVTRAK-EXPD-CARR
               END-IF
           END-IF.
           REWRITE DRCVTRAK-REC-O FROM BUF-DRCVTRAK
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
079290           MOVE "REWRITE DRCVTRAK SMODFRTS 360" TO BU-DISPLAY-MSG
079300           PERFORM 990-BLOWUP THRU 999-EXIT.
079310
079370 370-UPDATE-DPOFREIGHT.
079510*************************************************************
079520*         UPDATE DPOFREIGHT SEGMENT WITH NEW DATA           *
079530*************************************************************
080100     MOVE DE-PO                           TO  WS-PO.
080200     MOVE DE-RLSE                         TO  WS-RLSE.
080300     MOVE DE-RS                           TO  WS-RS.
080400     MOVE PO-RLSE-RS                      TO  PO-ARG.
080500
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPOFREIGHT-REC-O.
           START DPOFREIGHT-O KEY = PORCVNO OF DPOFREIGHT-REC-O
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
080800
080900     IF NOT GOOD-CALL
081000           MOVE "DBFIND3 DFREIGHT SMODFRTS 335" TO BU-DISPLAY-MSG
081100           PERFORM 990-BLOWUP THRU 999-EXIT.
081200
           MOVE 0 TO COND-WORD.
           READ DPOFREIGHT-O NEXT INTO BUF-DPOFREIGHT
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPOFREIGHT-REC-O NOT = PO-ARG
               MOVE 15 TO COND-WORD.
081500     IF NOT GOOD-CALL
081600           MOVE "DBGET3 DFREIGHT SMODFRTS 335" TO BU-DISPLAY-MSG
081700           PERFORM 990-BLOWUP THRU 999-EXIT.
081800
           MOVE 0 TO COND-WORD.
           DELETE DPOFREIGHT-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
081820     IF NOT GOOD-CALL
081830        MOVE "DBDELETE DPOFREIGHT SMODFRTS 335" TO BU-DISPLAY-MSG
081840        PERFORM 990-BLOWUP THRU 999-EXIT.
081850
081900         MOVE TYPE-FREIGHT-BUF            TO  FRT-TYPE.
082000         MOVE EMPLOYEE-BUF                TO  FRT-EMPL.
082100         MOVE P-SLIP-NO-BUF               TO  FRT-PACK-SLIP.
082200         MOVE CARRIER-BUF                 TO  FRT-CARRIER.
082300         MOVE FREIGHT-NO-BUF              TO  FRT-BILL-NO.
               MOVE FREIGHT-CHARGES-BUF9        TO  FRT-CHARGES-9.
               IF FRT-CHARGES-9 < 1
                  MOVE ZEROES                   TO  FRT-CHARGES-9.
082500         MOVE ORIGIN-BUF                  TO  FRT-SPLC.
082600         MOVE CARR-WT-BUF                 TO  FRT-CARRIER-WT.
082700         MOVE OUR-WT-BUF                  TO  FRT-OUR-WT.
082800         MOVE CAR-NO-BUF                  TO  FRT-RAIL-CAR.
082900         MOVE LOT-NO-BUF                  TO  FRT-LOT.
083000         MOVE SEALS-BUF                   TO  FRT-SEALS.
083100         MOVE OSD-NO-BUF                  TO  FRT-OSD.
               MOVE COMMENT-BUF                 TO  FRT-OSD-CLAIM.
083200         MOVE SAVE-PRO-DATE               TO FRT-BILL-DATE.
               IF SAVE-PRO-DATE-YY = "  "
                   MOVE "  " TO FRT-CC
               ELSE
               IF SAVE-PRO-DATE-YY > "70"
                   MOVE "19" TO FRT-CC
               ELSE
                   MOVE "20" TO FRT-CC.
083300         MOVE Z-BILL-BUF                  TO  FRT-ZBILL.
083400         MOVE SPACES                      TO  FRT-REFERBACK.
083500
           MOVE 0 TO COND-WORD.
           WRITE DPOFREIGHT-REC-O FROM BUF-DPOFREIGHT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
083800     IF NOT GOOD-CALL
083900           MOVE "DBUPDT3 DFREIGHT SMODFRTS 335" TO BU-DISPLAY-MSG
084000           PERFORM 990-BLOWUP THRU 999-EXIT.

      *----------  READ IN LITERALS FOR RECEIVING SLIP
           MOVE 64               TO LANG-SETNUM.
           MOVE 2                           TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER              TO MSG3.
           MOVE 4                           TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER              TO MSG4.
           MOVE 5                           TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER              TO MSG5.
           MOVE 6                           TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER              TO MSG6.
           MOVE 7                           TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER              TO MSG7.
           MOVE 8                           TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER              TO MSG8.
           MOVE 9                           TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER              TO MSG9.
           MOVE 10                           TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER              TO MSG10.
           MOVE 11                           TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER              TO MSG11.
           MOVE 12                           TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER              TO MSG12.
           MOVE 13                           TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER              TO MSG13.
           MOVE 14                           TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER              TO MSG14.
           MOVE 15                           TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER              TO MSG15.
           MOVE 16                           TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER              TO MSG16.
           MOVE 17                           TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER              TO  MSG17.
           MOVE 18                           TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER              TO MSG18.
           MOVE 19                           TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER              TO MSG19.
           MOVE 20                           TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER              TO MSG20.
           MOVE 21                           TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER              TO MSG21.
           MOVE 22                           TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER              TO MSG22.
           MOVE 23                           TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER              TO MSG23.
           MOVE 34                           TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER              TO MSG25.
           MOVE 54               TO LANG-SETNUM.
           MOVE 60                          TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER              TO MSG24.
084600*************************************************************
084700*         OPEN THREE SPOOLFILES AND START THE PRINTER       *
084800*************************************************************
           MOVE SPOOL-PRT-NO TO OVRPRTF-TOFILE-NUM.
           MOVE "MCPRT"      TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
090800     OPEN OUTPUT ONLINE-PRT.
090900
           IF ACCTG-PRT-NO NOT = ZEROES
              MOVE ACCTG-PRT-NO TO OVRPRTF-TOFILE-NUM
              MOVE "MCPRT2"     TO OVRPRTF-FILE
              PERFORM 996-OVERRIDE-PRINT-FILE
              OPEN OUTPUT ACCTG-PRT.

092100     IF PRINT-PRT-NO NOT = ZEROES
              MOVE PRINT-PRT-NO TO OVRPRTF-TOFILE-NUM
              MOVE "MCPRT3"     TO OVRPRTF-FILE
              PERFORM 996-OVERRIDE-PRINT-FILE
088400        OPEN OUTPUT THIRD-PRT.
088500     MOVE SPACES TO PRINT-RCD.
088600     MOVE 1 TO LINE-ADV.
088700     PERFORM 900-PRINT-LINE THRU 909-EXIT.
088800     MOVE DATE-FORMATTED-TIME-OUT TO PRT-TIME.
088900     MOVE  DE-PO      TO DISP-PO.
089000     MOVE  DE-RLSE    TO DISP-RLSE.
089100     MOVE  DE-RS      TO DISP-RS.
089200     MOVE DISPLAY-PO-RLSE-RS  TO  PRT-RS.
089300
089400     MOVE  HDR-1  TO PRINT-LINE.
089500     MOVE 2 TO LINE-ADV.
089600     PERFORM 900-PRINT-LINE THRU 909-EXIT.
089700
089800     MOVE  HDR-2 TO PRINT-LINE.
089900     MOVE 1 TO LINE-ADV.
090000     PERFORM 900-PRINT-LINE THRU 909-EXIT.
090100
090200     MOVE HDR-2A   TO   PRINT-LINE.
090300     MOVE 1                   TO   LINE-ADV.
090400     PERFORM 900-PRINT-LINE THRU 909-EXIT.
090500
090600     MOVE HDR-2B  TO PRINT-LINE.
090700     MOVE 1                  TO   LINE-ADV.
090800     PERFORM 900-PRINT-LINE THRU 909-EXIT.
090900
091000     MOVE HDR-2C  TO   PRINT-LINE.
091100     MOVE 1                  TO   LINE-ADV.
091200     PERFORM 900-PRINT-LINE THRU 909-EXIT.
091300
           MOVE HDR-2D  TO   PRINT-LINE.
           MOVE 1                  TO   LINE-ADV.
           PERFORM 900-PRINT-LINE THRU 909-EXIT.

           MOVE HDR-2E  TO   PRINT-LINE.
           MOVE 1                  TO   LINE-ADV.
           PERFORM 900-PRINT-LINE THRU 909-EXIT.

           MOVE HDR-2F  TO   PRINT-LINE.
           MOVE 2                  TO   LINE-ADV.
           PERFORM 900-PRINT-LINE THRU 909-EXIT.

091400     MOVE  HDR-3      TO PRINT-LINE.
091500     MOVE 2 TO LINE-ADV.
091600     PERFORM 900-PRINT-LINE THRU 909-EXIT.
091700
           MOVE  HDR-4      TO PRINT-LINE.
           MOVE 2 TO LINE-ADV.
           PERFORM 900-PRINT-LINE THRU 909-EXIT.

091800     IF Z-BILL-BUF = SPACES
091900         NEXT SENTENCE
092000     ELSE
092100         MOVE Z-BILL-BUF    TO  PRT-Z-BILL
092200         MOVE PRT-Z-BILL-NO TO  PRINT-LINE
092300         MOVE 2             TO  LINE-ADV
092400         PERFORM 900-PRINT-LINE THRU 909-EXIT.
092500*************************************************************
092600*         CLOSE THREE SPOOLFILES AND STOP PRINTERS          *
092700*************************************************************
097400     CLOSE ONLINE-PRT.
097500     IF ACCTG-PRT-NO NOT = ZEROES
098700             CLOSE ACCTG-PRT.
098800
098900     IF PRINT-PRT-NO NOT = ZEROES
097800             CLOSE THIRD-PRT.

      *----------  IF THE USER ENTERS FREIGHT TERMS THAT ARE DIFFERENT
      *            THAN THE TERMS ENTERED ON THE PO, RECORD THAT FACT
           IF TYPE-FREIGHT-BUF = SAVE-PO-TERM
              NEXT SENTENCE
           ELSE
              PERFORM 800-DIFFERENT-TERMS.
097900
098000     GO TO 300-MAIN.
098100 399-EXIT.  EXIT.
098200
      *----------  ADD THE DIFFERING FREIGHT TERMS TO A KSAM FILE
       800-DIFFERENT-TERMS.
            MOVE SPACES TO KFRTERMS-REC.
            MOVE DDAILYTC-DATE     TO FREIGHT-YMD.
            IF FREIGHT-YY > "70"
                MOVE "19"          TO FREIGHT-CC
            ELSE
                MOVE "20"          TO FREIGHT-CC.
            MOVE FREIGHT-DATE-CN   TO KTERMDAT.
      ****  MOVE DDAILYTC-DATE TO KTERMDAT.
            MOVE DDAILYTC-TIME TO KTERMTIM.
            MOVE PO-VEN-CODE TO KTERMVEN.
            MOVE SAVE-PO TO KTERMPO.
            MOVE SAVE-PO-TERM TO KTERMPOTRM.
            MOVE TYPE-FREIGHT-BUF TO KTERMRCVRT.
            MOVE ZEROES TO COND-WORD.
            WRITE KFRTERMS-REC
                 INVALID KEY MOVE 99 TO COND-WORD.
            IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
            IF COND-WORD NOT = 0
               MOVE "BAD WRITE OF KFRTERMS" TO BU-DISPLAY-MSG
               MOVE KTERMDAT TO BU-DISPLAY-FLD (2)
               MOVE KTERMPO TO BU-DISPLAY-FLD (3)
               MOVE FILE-STATUS TO BU-DISPLAY-FLD (4)
               PERFORM 990-BLOWUP THRU 999-EXIT.
098300 900-PRINT-LINE.
098400     WRITE PRINT-RCD BEFORE ADVANCING LINE-ADV LINES.
098500     IF ACCTG-PRT-NO NOT = ZEROES
               MOVE PRINT-LINE TO PRINT-ACCTG
098600         WRITE ACCTG-RCD BEFORE ADVANCING LINE-ADV LINES.
098700     IF PRINT-PRT-NO NOT = ZEROES
             MOVE PRINT-LINE TO PRINT-THIRD
098800       WRITE THIRD-RCD BEFORE ADVANCING LINE-ADV LINES.
098900 909-EXIT.  EXIT.
100500
100600 940-VSETERROR.
           MOVE B"1" TO IND (99).
           MOVE B"1" TO IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE1
                                  DE-MESSAGE-LINE2.
101800 949-EXIT.  EXIT.
       COPY OVRPFCALL IN COPYLIB.
103000 990-BLOWUP.
103100     MOVE VIEW-NFNAME TO BU-DISPLAY-FLD (1).
103200     MOVE PO-ARG TO BU-DISPLAY-FLD (2).
103300     MOVE BASE TO BASE.
103400     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
103500           VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
103600           BU-DISPLAY-FLDS.
103700 999-EXIT.  EXIT.
103800
103900 999-CATREAD.
            MOVE LANG-SETNUM TO CATREAD-MSG-SET.
            MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
            CALL "CCATREAD" USING CATREAD-PARMS.
            MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
105500 999-CATREAD-EXIT.
105600     EXIT.
