       IDENTIFICATION DIVISION.
       PROGRAM-ID.          SMTLSCRN.
       AUTHOR.              CA YODER.
       DATE-WRITTEN.        FEBRUARY 1997.
       DATE-COMPILED.
      *INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
      *
      *D  THIS PROGRAM DISPLAYS THE FIRST TWO SCREENS COMMON TO
      *D  THE MATERIALS CONTROL REPORTS.
      *

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.

       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZMTLCNTL-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                   PIC X(1500).

       WORKING-STORAGE SECTION.
       01  OPTION-AREA                   PIC X(220).
       01  END-FILE                      PIC X(1).
       01  SUB                           PIC S9(4) BINARY.
       01  SUB2                          PIC S9(4) BINARY.
       01  WORK-LINE                     PIC X(80).
       01  NUM-INPUT-RECS                PIC S9(4) BINARY.
       01  HOLD-PRINT-FILE               PIC X(10).
       01  FILE-TYPE                     PIC X(7)  VALUE "*FILE".
       01  CHKOBJ-STATUS                 PIC X(2).
       COPY FUNCTDEF IN COPYLIB.

       77  OPTION-FLAG                   PIC X(1)  VALUE "Y".
       77  INDX                          PIC 9(1)  VALUE 1.
       77  CALL-PGM-NAME                 PIC X(10).

       01  HOLD-NUM.
           05  HOLD-NUM-1                PIC X.
           05  HOLD-NUM-2                PIC X.

      *************************************************************
      **                                                          **
      **          S U B P R O G R A M   A R E A S                 **
      **                                                          **
      **************************************************************

       COPY TSHWRDFM   IN COPYLIB.
       COPY DISPDAT2   IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.
       COPY CATREAD    IN COPYLIB.
       COPY TBLOWUP    IN COPYLIB.
       COPY TLSHIFT    IN COPYLIB.
       COPY TRSHIFT    IN COPYLIB.
       COPY TDATECHK   IN COPYLIB.

      **************************************************************
      **                                                          **
      **           D A T A B A S E   W O R K                      **
      **                                                          **
      **************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X  VALUE "0".
           05  FILE-STATUS-2             PIC X  VALUE "0".
       COPY DBSTAT     IN COPYLIB.

      **************************************************************
      **                                                          **
      **                V I E W   W O R K                         **
      **                                                          **
      **************************************************************

       01  MESSAGE-BUFFER.
           05  MSG-TEXT.
               10  MESSAGE-BUFFER-1      PIC X(1)  VALUE SPACES.
               10  FILLER                PIC X(67) VALUE SPACES.
           05  MSG-FLD                   PIC X(8)   VALUE SPACES.
           05  MSG-FLD-9 REDEFINES MSG-FLD PIC ZZZZZZZ9.

       01  FIELD-NUMBER                  PIC S9(4) COMP-4 VALUE ZERO.


       LINKAGE SECTION.

       01  BASE.
           05  BASE-1-2                  PIC X(2).
           05  FILLER                    PIC X(10).

       COPY VCOMLINK IN COPYLIB.

       COPY LANGSUB  IN COPYLIB.

       01  PASSED-RPT-NUMBER             PIC S9(4) COMP-4.

      **************************************************************
      **                                                          **
      **                 S C R E E N   D A T A                    **
      **                                                          **
      **************************************************************

       COPY MTLSCNTL IN COPYLIB.

       PROCEDURE DIVISION USING BASE,
                                VIEW-COMAREA,
                                LANGUAGE-PARMS,
                                PASSED-RPT-NUMBER,
                                MSCRN-DATA-LINE.

       1000-HOUSEKEEPING.
           OPEN I-O DISPLAY-FILE.
           PERFORM 6000-MAIN THRU 6990-MAIN-X.
           PERFORM 7005-RESET-DEFAULTS.
           CLOSE DISPLAY-FILE.
           GOBACK.

       2100-BLOWUP.
           MOVE PASSED-RPT-NUMBER        TO  BU-DISPLAY-FLD9 (1).
           MOVE "SMTLSCRN"               TO  BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE BU-PGM-NAME
             STATUS-AREA VIEW-COMAREA FILE-STATUS
             BU-DISPLAY-MSG BU-DISPLAY-FLDS.

      **************************************************************
      **                                                          **
      **               M A I N   P R O G R A M                    **
      **                                                          **
      **************************************************************

       6000-MAIN.
           PERFORM 7000-FIND-TITLE.
      *--------- IF USER PRESSED F4 FROM ZRSCREEN "ARE YOU SURE YOU
      *--------- WANT TO CONTINUE" SCREEN, THERE MAY BE DATA IN THE
      *--------- BUFFERS, SO DON'T SET TO DEFAULT.
           IF MSCRN-MIN-VALUE NOT NUMERIC
               MOVE 0                    TO  MSCRN-MIN-VALUE.
           IF PASSED-RPT-NUMBER = 35
               IF MSCRN-MIN-TOTAL NOT NUMERIC
                   MOVE 0                TO  MSCRN-MIN-TOTAL.
           IF MSCRN-COST-OPT = SPACES
               MOVE "A"                  TO  MSCRN-COST-OPT.
           IF PASSED-RPT-NUMBER = 30
               IF MSCRN-PRJ-MNTH NOT NUMERIC
                   MOVE 0                TO  MSCRN-PRJ-MNTH
               END-IF
               IF MSCRN-PRJ-OVR NOT NUMERIC
                   MOVE 0                TO  MSCRN-PRJ-OVR.
           IF PASSED-RPT-NUMBER = 66
               IF MSCRN-ONH-MNTH NOT NUMERIC
                   MOVE 0                TO  MSCRN-ONH-MNTH
               END-IF
               IF MSCRN-OVR-USE-COST NOT NUMERIC
                   MOVE 0                TO  MSCRN-OVR-USE-COST.

       6100-SHOWFORM.
           MOVE "SELECT"                 TO  VIEW-NFNAME.
           MOVE 7                        TO  SRF-KEYSET.
           MOVE "I" TO SRF-FKEY (6), SRF-FKEY (1).
           MOVE MSCRN-1                  TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           MOVE DISPLAY-REC              TO  MSCRN-1.

           IF VIEW-LASTKEY = EXIT-PROGRAM
               GO TO 6990-MAIN-X.

      *--------- VALIDATE SELECT OPTION.
           IF MSCRN-SELECT-OPT NOT = "  "
               MOVE MSCRN-SELECT-OPT         TO  HOLD-NUM
               IF HOLD-NUM-1 = " "
                   MOVE "0"                  TO  HOLD-NUM-1
                   MOVE HOLD-NUM             TO  MSCRN-SELECT-OPT
               END-IF
               IF HOLD-NUM-2 = " "
                   MOVE HOLD-NUM-1           TO  HOLD-NUM-2
                   MOVE "0"                  TO  HOLD-NUM-1
                   MOVE HOLD-NUM             TO  MSCRN-SELECT-OPT
               END-IF
               IF HOLD-NUM = "01" OR "02" OR "03" OR "04" OR "05"
                                  OR "06" OR "07" OR "08" OR "09"
                                  OR "10"
                   NEXT SENTENCE
               ELSE
                   MOVE 000                  TO  LANG-SETNUM
                   MOVE 20                   TO  LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER       TO  MSCRN-MSGLINE-1
                   MOVE B"1" TO IND (99)  IND (10)
                   GO TO 6100-SHOWFORM.

      *--------- VALIDATE SECONDARY SELECT OPTION.
           IF MSCRN-SELECT-OPT2 NOT = "  "
               MOVE MSCRN-SELECT-OPT2        TO  HOLD-NUM
               IF HOLD-NUM-1 = " "
                   MOVE "0"                  TO  HOLD-NUM-1
                   MOVE HOLD-NUM             TO  MSCRN-SELECT-OPT2
               END-IF
               IF HOLD-NUM-2 = " "
                   MOVE HOLD-NUM-1           TO  HOLD-NUM-2
                   MOVE "0"                  TO  HOLD-NUM-1
                   MOVE HOLD-NUM             TO  MSCRN-SELECT-OPT2
               END-IF
               IF HOLD-NUM = "01" OR "02" OR "03" OR "04" OR "05"
                                  OR "06" OR "07" OR "08" OR "09"
                                  OR "10"
                   NEXT SENTENCE
               ELSE
                   MOVE 000                  TO  LANG-SETNUM
                   MOVE 20                   TO  LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER       TO  MSCRN-MSGLINE-1
                   MOVE B"1" TO IND (99)  IND (12)
                   GO TO 6100-SHOWFORM.

      *--------- PRIMARY AND SECONDARY SELECT CANNOT BE THE SAME.
           IF MSCRN-SELECT-OPT > "  " AND MSCRN-SELECT-OPT2 > "  "
               IF MSCRN-SELECT-OPT = MSCRN-SELECT-OPT2
                   MOVE 19                   TO  LANG-SETNUM
                   MOVE 048                  TO  LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER       TO  MSCRN-MSGLINE-1
                   MOVE B"1" TO IND (99)  IND (12)
                   GO TO 6100-SHOWFORM.

      *--------- VALIDATE SORT OPTION.
           IF MSCRN-SORT-OPT NOT = "  "
               MOVE MSCRN-SORT-OPT           TO  HOLD-NUM
               IF HOLD-NUM-2 = " "
                   MOVE HOLD-NUM-1           TO  HOLD-NUM-2
                   MOVE "0"                  TO  HOLD-NUM-1
                   MOVE HOLD-NUM             TO  MSCRN-SORT-OPT
               END-IF
               IF HOLD-NUM-1 = " "
                   MOVE "0"                  TO  HOLD-NUM-1
                   MOVE HOLD-NUM             TO  MSCRN-SORT-OPT
               END-IF
               IF MSCRN-SORT-OPT = "01" OR "02" OR "03" OR "04" OR "05"
                                        OR "06" OR "07" OR "08" OR "09"
                                        OR "10"
                   NEXT SENTENCE
               ELSE
                   MOVE 000                  TO  LANG-SETNUM
                   MOVE 20                   TO  LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER       TO  MSCRN-MSGLINE-1
                   MOVE B"1" TO IND (99)  IND (11)
                   GO TO 6100-SHOWFORM.

      *--------- MAKE SURE A "TO" RANGE VALUE IS ENTERED.
           IF MSCRN-SELECT-OPT NOT = "  "
               IF MSCRN-TO-RANGE = SPACES
                   MOVE 09                   TO  LANG-SETNUM
                   MOVE 082                  TO  LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER       TO  MSCRN-MSGLINE-1
                   MOVE B"1" TO IND (99)  IND (14)
                   GO TO 6100-SHOWFORM.

      *--------- SECONDARY SELECT.
      *--------- MAKE SURE A "TO" RANGE VALUE IS ENTERED.
           IF MSCRN-SELECT-OPT2 NOT = "  "
               IF MSCRN-TO-RANGE2 = SPACES
                   MOVE 09                   TO  LANG-SETNUM
                   MOVE 082                  TO  LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER       TO  MSCRN-MSGLINE-1
                   MOVE B"1" TO IND (99)  IND (16)
                   GO TO 6100-SHOWFORM.

      *--------- MAKE SURE "FROM" VALUE IS LESS THAN "TO" VALUE.
           IF MSCRN-SELECT-OPT NOT = "  "
               IF MSCRN-FROM-RANGE > MSCRN-TO-RANGE
                   MOVE 08                   TO  LANG-SETNUM
                   MOVE 006                  TO  LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER       TO  MSCRN-MSGLINE-1
                   MOVE B"1" TO IND (99)  IND (13)
                   GO TO 6100-SHOWFORM.

      *--------- SECONDARY SELECT.
      *--------- MAKE SURE "FROM" VALUE IS LESS THAN "TO" VALUE.
           IF MSCRN-SELECT-OPT2 NOT = "  "
               IF MSCRN-FROM-RANGE2 > MSCRN-TO-RANGE2
                   MOVE 08                   TO  LANG-SETNUM
                   MOVE 006                  TO  LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER       TO  MSCRN-MSGLINE-1
                   MOVE B"1" TO IND (99)  IND (15)
                   GO TO 6100-SHOWFORM.

           IF VIEW-LASTKEY = 4
               GO TO 6110-SCREEN-2.

       6110-SCREEN-2.
           MOVE "INCLUDE"                TO  VIEW-NFNAME.
       6120-SHOWFORM-2.
           MOVE 7                        TO  SRF-KEYSET.
           MOVE "I" TO SRF-FKEY (6), SRF-FKEY (1).
           MOVE MSCRN-2                  TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           MOVE DISPLAY-REC              TO  MSCRN-2.

           IF VIEW-LASTKEY = EXIT-PROGRAM
               GO TO 6990-MAIN-X.

           IF VIEW-LASTKEY = 4
               GO TO 6100-SHOWFORM.

           IF MSCRN-MIN-OPT > " " AND MSCRN-MIN-VALUE NOT > 0
               MOVE 35                   TO  LANG-SETNUM
               MOVE 059                  TO  LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER       TO  MSCRN-MSGLINE-2
               MOVE B"1" TO IND (99)  IND (15)
               GO TO 6120-SHOWFORM-2.

      *------- SLOW MOVING ITEMS REPORT MUST HAVE DATE ENTERED.
           IF PASSED-RPT-NUMBER = 29 AND MSCRN-DATE = SPACES
               MOVE 20                   TO  LANG-SETNUM
               MOVE 062                  TO  LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER       TO  MSCRN-MSGLINE-2
               MOVE B"1" TO IND (99)  IND (16)
               MOVE "X"                  TO  MSCRN-USE-OPT
               GO TO 6120-SHOWFORM-2.

           IF MSCRN-USE-OPT > " " AND MSCRN-DATE = SPACES
               MOVE 30                   TO  LANG-SETNUM
               MOVE 020                  TO  LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER       TO  MSCRN-MSGLINE-2
               MOVE B"1" TO IND (99)  IND (16)
               GO TO 6120-SHOWFORM-2.

           IF MSCRN-USE-OPT > " "
               MOVE SPACES               TO  DATE-MSG
               MOVE MSCRN-DATE           TO  DATE-VALIDATE-IN
               MOVE 3                    TO  DATE-MODE
               CALL "TDATECHK" USING DATE-CHECK-AREA
               IF DATE-MSG NOT = SPACES
                   MOVE DATE-MSG         TO  MSCRN-MSGLINE-2
                   MOVE B"1" TO IND (99)  IND (16)
                   GO TO 6120-SHOWFORM-2.

      *--------- VALIDATE COST OPTION.
           IF MSCRN-COST-OPT NOT = "A" AND MSCRN-COST-OPT NOT = "M"
                                       AND MSCRN-COST-OPT NOT = "R"
                   MOVE 000                  TO  LANG-SETNUM
                   MOVE 20                   TO  LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER       TO  MSCRN-MSGLINE-2
                   MOVE B"1" TO IND (99)  IND (12)
                   GO TO 6120-SHOWFORM-2.

      *------- IF THE UNIT VALUE/USAGE DATA IS ENTERED, BUT THE
      *------- OPTIONS ARE NOT MARKED, MOVE SPACES TO THE VALUES.
           IF MSCRN-MIN-OPT = SPACES AND MSCRN-MIN-VALUE > 0
               MOVE ZEROES               TO  MSCRN-MIN-VALUE.
           IF MSCRN-USE-OPT = SPACES AND MSCRN-DATE > SPACES
               MOVE SPACES               TO  MSCRN-DATE.

           IF PASSED-RPT-NUMBER = 35
               GO TO 6130-SCREEN-3
           ELSE
           IF PASSED-RPT-NUMBER = 12
               GO TO 6140-SCREEN-3-HU
           ELSE
           IF PASSED-RPT-NUMBER = 29
               GO TO 6150-SCREEN-3-SM
           ELSE
           IF PASSED-RPT-NUMBER = 30
               GO TO 6160-SCREEN-3-PO
           ELSE
           IF PASSED-RPT-NUMBER = 66
               GO TO 6170-SCREEN-3-OH
           ELSE
               GO TO 6990-MAIN-X.

      *------- INVENTORY VALUATION SCREEN.
       6130-SCREEN-3.
           MOVE "INVVAL"                 TO  VIEW-NFNAME.
       6130-SHOWFORM-3.
           MOVE 7                        TO  SRF-KEYSET.
           MOVE "I" TO SRF-FKEY (6), SRF-FKEY (1).
           MOVE MSCRN-3                  TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           MOVE DISPLAY-REC              TO  MSCRN-3.

           IF MSCRN-INV-WRKSH = "X" AND MSCRN-TOT-VAL = "X"
               MOVE 03                   TO  LANG-SETNUM
               MOVE 072                  TO  LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER       TO  MSCRN-MSGLINE-3
               MOVE B"1" TO IND (99)  IND (10)
               GO TO 6130-SHOWFORM-3.

      *----------- CAN'T PRINT INVENTORY LEVELS IF NO SORT OPTION
      *----------- CHOSEN.
           IF MSCRN-TOT-VAL = "X" AND MSCRN-CODE-OPT = "X"
                                  AND MSCRN-SORT-OPT = SPACES
               MOVE " "                  TO  MSCRN-CODE-OPT.

           IF VIEW-LASTKEY = EXIT-PROGRAM
               GO TO 6990-MAIN-X.

           IF VIEW-LASTKEY = 4
               GO TO 6110-SCREEN-2.

           GO TO 6990-MAIN-X.

      *------- HIGH USAGE SCREEN.
       6140-SCREEN-3-HU.
           MOVE "HIGHUSE"                TO  VIEW-NFNAME.
       6140-SHOWFORM-3-HU.
           MOVE 7                        TO  SRF-KEYSET.
           MOVE "I" TO SRF-FKEY (6), SRF-FKEY (1).
           MOVE MSCRN-3                  TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           MOVE DISPLAY-REC              TO  MSCRN-3.

           IF VIEW-LASTKEY = EXIT-PROGRAM
               GO TO 6990-MAIN-X.

           IF VIEW-LASTKEY = 4
               GO TO 6110-SCREEN-2.

           GO TO 6990-MAIN-X.

      *------- SLOW MOVE SCREEN.
       6150-SCREEN-3-SM.
           MOVE "SLOWMOVE"               TO  VIEW-NFNAME.
       6150-SHOWFORM-3-SM.
           MOVE 7                        TO  SRF-KEYSET.
           MOVE "I" TO SRF-FKEY (6), SRF-FKEY (1).
           MOVE MSCRN-3                  TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           MOVE DISPLAY-REC              TO  MSCRN-3.

           IF VIEW-LASTKEY = EXIT-PROGRAM
               GO TO 6990-MAIN-X.

           IF VIEW-LASTKEY = 4
               GO TO 6110-SCREEN-2.

           GO TO 6990-MAIN-X.

      *------- PROJECTED OVERAGE SCREEN.
       6160-SCREEN-3-PO.
           MOVE "PROJOVER"               TO  VIEW-NFNAME.
       6160-SHOWFORM-3-PO.
           MOVE 7                        TO  SRF-KEYSET.
           MOVE "I" TO SRF-FKEY (6), SRF-FKEY (1).
           MOVE MSCRN-3                  TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           MOVE DISPLAY-REC              TO  MSCRN-3.

           IF MSCRN-PRJ-MNTH = SPACES
               MOVE "00"                 TO  MSCRN-PRJ-MNTH.

           IF VIEW-LASTKEY = EXIT-PROGRAM
               GO TO 6990-MAIN-X.

           IF VIEW-LASTKEY = 4
               GO TO 6110-SCREEN-2.

           GO TO 6990-MAIN-X.

       6170-SCREEN-3-OH.
           MOVE "ONHPROJ"                TO  VIEW-NFNAME.
       6170-SHOWFORM-3-OH.
           MOVE 7                        TO  SRF-KEYSET.
           MOVE "I" TO SRF-FKEY (6), SRF-FKEY (1).
           MOVE MSCRN-3                  TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           MOVE DISPLAY-REC              TO  MSCRN-3.

           IF VIEW-LASTKEY = EXIT-PROGRAM
               GO TO 6990-MAIN-X.

           IF VIEW-LASTKEY = 4
               GO TO 6110-SCREEN-2.

           IF MSCRN-ONH-PRJ-OPT NOT = "1" AND
              MSCRN-ONH-PRJ-OPT NOT = "2"
               MOVE 25                   TO  LANG-SETNUM
               MOVE 030                  TO  LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER       TO  MSCRN-MSGLINE-3
               MOVE B"1" TO IND (99)  IND (10)
               GO TO 6170-SHOWFORM-3-OH.

           IF MSCRN-ONH-MNTH = SPACES
               MOVE "00"                 TO  MSCRN-ONH-MNTH.

           GO TO 6990-MAIN-X.


       6990-MAIN-X.
           EXIT.

       7000-FIND-TITLE.
           IF PASSED-RPT-NUMBER = 10
               MOVE "              R10 - USAGE REPORT             "
                               TO  MSCRN-TITLE-1   MSCRN-TITLE-2
           ELSE
           IF PASSED-RPT-NUMBER = 12
               MOVE "           R20 - HIGH USAGE REPORT           "
                               TO  MSCRN-TITLE-1   MSCRN-TITLE-2
                                   MSCRN-TITLE-3
               MOVE "X"        TO  MSCRN-HIGH-USE
           ELSE
           IF PASSED-RPT-NUMBER = 29
               MOVE "        R29 - SLOW MOVING ITEMS REPORT       "
                               TO  MSCRN-TITLE-1   MSCRN-TITLE-2
                                   MSCRN-TITLE-3
               MOVE "X"        TO  MSCRN-SLOW-MOVE
                                   MSCRN-USE-OPT
           ELSE
           IF PASSED-RPT-NUMBER = 30
               MOVE "      R30 - OVERAGE MATERIAL VALUATION       "
                               TO  MSCRN-TITLE-1   MSCRN-TITLE-2
                                   MSCRN-TITLE-3
               MOVE "X"        TO  MSCRN-PROJ-OVR
           ELSE
           IF PASSED-RPT-NUMBER = 33
               MOVE "         R22 - INSURANCE ITEMS REPORT        "
                               TO  MSCRN-TITLE-1   MSCRN-TITLE-2
               MOVE "X"        TO  MSCRN-INS-OPT
           ELSE
           IF PASSED-RPT-NUMBER = 32
               MOVE "        R21 - FREE STORES ITEMS REPORT       "
                               TO  MSCRN-TITLE-1   MSCRN-TITLE-2
           ELSE
           IF PASSED-RPT-NUMBER = 34
               MOVE "     R21 - ORDER ENGINEERING ITEMS REPORT    "
                               TO  MSCRN-TITLE-1   MSCRN-TITLE-2
           ELSE
           IF PASSED-RPT-NUMBER = 35
               MOVE "    R11 - INVENTORY VALUATION ITEMS REPORT   "
                               TO  MSCRN-TITLE-1   MSCRN-TITLE-2
                                   MSCRN-TITLE-3
           ELSE
           IF PASSED-RPT-NUMBER = 36
               MOVE "      R25 - OUTSIDE REPAIR ITEMS REPORT      "
                               TO  MSCRN-TITLE-1   MSCRN-TITLE-2
               MOVE "X"        TO  MSCRN-OR-OPT
           ELSE
           IF PASSED-RPT-NUMBER = 37
               MOVE "    R25 - MAINTENANCE REPAIR ITEMS REPORT    "
                               TO  MSCRN-TITLE-1   MSCRN-TITLE-2
               MOVE "X"        TO  MSCRN-MR-OPT
           ELSE
           IF PASSED-RPT-NUMBER = 39
               MOVE "         R27 - WRITE DOWN ITEMS REPORT       "
                               TO  MSCRN-TITLE-1   MSCRN-TITLE-2
               MOVE "X"        TO  MSCRN-WD-OPT
           ELSE
           IF PASSED-RPT-NUMBER = 24
               MOVE "         R24 - OBSOLETE ITEMS REPORT         "
                               TO  MSCRN-TITLE-1   MSCRN-TITLE-2
               MOVE "X"        TO  MSCRN-OBS-OPT
           ELSE
           IF PASSED-RPT-NUMBER = 43
               MOVE "          R24 - IMPORT ITEMS REPORT          "
                               TO  MSCRN-TITLE-1   MSCRN-TITLE-2
               MOVE "X"        TO  MSCRN-IMP-OPT
           ELSE
           IF PASSED-RPT-NUMBER = 48
               MOVE "         R31 - CRITICAL ITEMS REPORT         "
                               TO  MSCRN-TITLE-1   MSCRN-TITLE-2
               MOVE "X"        TO  MSCRN-CRITM-OPT
           ELSE
           IF PASSED-RPT-NUMBER = 66
               MOVE "  R33 - ONHAND OVER PROJECTED USAGE REPORT   "
                               TO  MSCRN-TITLE-1   MSCRN-TITLE-2
                                   MSCRN-TITLE-3
               MOVE "X"        TO  MSCRN-ONH-OVR-PRJ.

       7005-RESET-DEFAULTS.
      *------- IF USER ACCIDENTALLY ERASED DEFAULTS SET BEFORE, RESET
      *------- THEM.
           IF PASSED-RPT-NUMBER = 24
               MOVE "X"        TO  MSCRN-OBS-OPT.
           IF PASSED-RPT-NUMBER = 29
               MOVE "X"        TO  MSCRN-SLOW-MOVE
                                   MSCRN-USE-OPT.
           IF PASSED-RPT-NUMBER = 30
               MOVE "X"        TO  MSCRN-PROJ-OVR.
           IF PASSED-RPT-NUMBER = 32
      *------- STOCKOUT OPTION NOT VALID FOR FREE STORES.
               MOVE " "        TO  MSCRN-STOCK-OPT
               MOVE "X"        TO  MSCRN-FREESTR-OPT.
           IF PASSED-RPT-NUMBER = 33
               MOVE "X"        TO  MSCRN-INS-OPT.
           IF PASSED-RPT-NUMBER = 34
               MOVE "X"        TO  MSCRN-OE-OPT.
           IF PASSED-RPT-NUMBER = 36
               MOVE "X"        TO  MSCRN-OR-OPT.
           IF PASSED-RPT-NUMBER = 37
               MOVE "X"        TO  MSCRN-MR-OPT.
           IF PASSED-RPT-NUMBER = 39
               MOVE "X"        TO  MSCRN-WD-OPT.
           IF PASSED-RPT-NUMBER = 43
               MOVE "X"        TO  MSCRN-IMP-OPT.
           IF PASSED-RPT-NUMBER = 48
               MOVE "X"        TO  MSCRN-CRITM-OPT.
           IF PASSED-RPT-NUMBER = 66
               MOVE "X"        TO  MSCRN-ONH-OVR-PRJ.
           IF MSCRN-SELECT-OPT = "  "
               MOVE SPACES     TO  MSCRN-FROM-RANGE  MSCRN-TO-RANGE.
           IF MSCRN-SELECT-OPT2 = "  "
               MOVE SPACES     TO  MSCRN-FROM-RANGE2 MSCRN-TO-RANGE2.

       COPY DISPCALL IN COPYLIB.
       COPY DISPCAL2 IN COPYLIB.
       COPY HCATREAD IN COPYLIB.
