000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.
000400     SONORDER.
000500 AUTHOR.
000600     KURT MOVSESIAN.
000700*REMARKS.
000800*
000900*************************************************************
001000**                                                         **
001100**  THIS SUBROUTINE CALCULATES ONORDER IN TERMS OF THE     **
001200**  STOREROOM UNIT OF MEASURE.  3 VALUES ARE RETURNED      **
001300**   1) TOTAL ONORDER                                      **
001400**   2) TOTAL STOREROOM ONORDER                            **
001500**   3) TOTAL DIRECT CHARGE ONORDER (UNITS ORDERED BUT NOT **
001600**                                   FOR THE STOREROOM)    **
001700**                                                         **
001800*************************************************************
      *C 06/10/96   JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   RECOMPILE PROGRAM TO PICK UP NEW FILE FORMATS.
      *C
      *C 02/18/02   BRUCE GEISER
      *C   CHANGE COMPLETE FLAG CHECK TO FIND "*".
001800*************************************************************
001900
002000
002100
002200 ENVIRONMENT DIVISION.
002300 CONFIGURATION SECTION.
002400 SOURCE-COMPUTER.  HP-3000.
002500 OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MSTORERM
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DPOITEM
                  ASSIGN TO DATABASE-MCFLCS1001
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

002700
002800 DATA DIVISION.
       FILE SECTION.
       FD  MSTORERM
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  DPOITEM
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-REC.
           COPY DDS-MCRPCS1000  OF MCFLCS1001.

       FD  MPLTINFO
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

002900
003000
003100 WORKING-STORAGE SECTION.
003200 77  QTY-STILL-OPEN               PIC S9(8)V9(4) VALUE ZEROS.
003300 77  STR-ORD-QTY                  PIC S9(8)      VALUE ZEROS.
003400 77  SUB                          PIC S9(4) COMP-4 VALUE ZEROS.
003500 77  STR-DEPT-TABLE-LOADED-SW     PIC X(1)       VALUE SPACES.
003600     88  STR-DEPT-TABLE-LOADED                   VALUE "Y".
003700
003800 01  STOREROOM-DEPT-TABLE.
003900     05  STORE-DEPT  OCCURS 6 TIMES
004000             INDEXED BY DEPT-SUB  PIC X(4).
004100
004200
004300**************************************************************
004400**************************************************************
004500**                                                          **
004600**                DATABASE I/O BUFFER AREA                  **
004700**                                                          **
004800**************************************************************
004900**************************************************************
005000
005100 COPY MSTORERM IN COPYLIB.
005200
005300 COPY DPOITEM IN COPYLIB.
005400
005500 COPY MPLTINFO IN COPYLIB.
005600
005700*********************
005800*                   *
005900*   DATA SET NAMES  *
006000*                   *
006100*********************
006200
006300 01  DSET-NAMES.
006400     05  DSET-DPOITEM           PIC X(16)  VALUE "DPOITEM;".
006500     05  DSET-MSTORERM          PIC X(16)  VALUE "MSTORERM;".
006600     05  DSET-MPLTINFO          PIC X(16)  VALUE "MPLTINFO;".
006700
006800 COPY DBMODES IN COPYLIB.
006900
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

007000 01 ITEMS-LISTING.
007100     05  ALL-ITEMS              PIC XX    VALUE "@;".
007200     05  CODE-SEARCH            PIC X(10) VALUE "CORP-CODE;".
007300
007400 01  ARG-VALUES.
007500     05  PLT-ARG                PIC X(4)  VALUE SPACES.
007600
007700
007800 LINKAGE SECTION.
007900
008000 01  BASE                         PIC X(10).
008100
008200 01  CODE-ARG                     PIC X(8).
008300
008400 COPY SONORDER IN COPYLIB.
008500
008600 01  COMPANY-SAVE.
008700     05  FILLER                   PIC X(2).
008800         88  AKRON-PLANT                   VALUE "11".
008900     05  FILLER                   PIC X(1).
009000
009100 COPY DBSTAT IN COPYLIB.
009200
009300 01  BU-DISPLAY-MSG.
009400     05  BU-DISPLAY-MSG-1         PIC X(1).
009500     05  FILLER                   PIC X(59).
009600
009700 01  BU-DISPLAY-FLDS.
009800     05  BU-DISPLAY-LINE  OCCURS 5 TIMES.
009900         10  BU-DISPLAY-FLD       PIC X(14).
010000         10  BU-DISPLAY-FLD9      PIC S9(8).
010100
010200
010300
010400 PROCEDURE DIVISION USING BASE,
010500                          CODE-ARG,
010600                          SONORDER-PARMS,
010700                          COMPANY-SAVE,
010800                          STATUS-AREA,
010900                          BU-DISPLAY-MSG,
011000                          BU-DISPLAY-FLDS.
011100
011200 PROC-DIV SECTION 01.
011300
011400
011500 1-BEGIN.
           OPEN INPUT MSTORERM, DPOITEM, MPLTINFO.
011600     PERFORM 6-MAIN THRU 6-M-X.
           CLOSE MSTORERM, DPOITEM, MPLTINFO.
011800     GOBACK.
011900
012000
012100******************************************************
012200**                                                  **
012300**   BLOWUP ROUTINE                                 **
012400**                                                  **
012500******************************************************
012600
012700 2-BLOWUP.
012800     MOVE "SONORDER"            TO  BU-DISPLAY-FLD (5).
012900     MOVE CODE-ARG              TO  BU-DISPLAY-FLD (4).
013000     GOBACK.
013100
013200
013300
013400**************************************************
013500*                                                *
013600*     6 - M A I N                                *
013700*                                                *
013800**************************************************
013900
014000
014100 6-MAIN.
014200     MOVE ZEROS                   TO  SONORDER-TOTAL-ONORDER,
014300                                      SONORDER-STR-ONORDER,
014400                                      SONORDER-DIR-ONORDER.
014500*    CALL "DBGET" USING BASE, DSET-MSTORERM, MODE7,
014600*       STATUS-AREA, ALL-ITEMS, BUF-MSTORERM, CODE-ARG.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC.
           READ MSTORERM INTO BUF-MSTORERM
              INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
014700     IF COND-WORD NOT = 0
014800         MOVE "GET MSTORERM 6-M" TO BU-DISPLAY-MSG
014900         GO TO 2-BLOWUP.
015000
015100     PERFORM 61-CALC-ONORDER  THRU  61-CO-X.
015200
015300 6-M-X.
015400     EXIT.
015500
015600 61-CALC-ONORDER.
015700*    CALL "DBFIND" USING BASE, DSET-DPOITEM, MODE1,
015800*        STATUS-AREA, CODE-SEARCH, CODE-ARG.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DPOITEM-REC.
           START DPOITEM KEY = EXTERNALLY-DESCRIBED-KEY
             INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 0 TO COND-WORD
                   GO TO 61-CO-X
               ELSE
                   MOVE 99 TO COND-WORD.
015900     IF COND-WORD NOT = 0
016000         MOVE "FIND DPOITEM 61-CO" TO BU-DISPLAY-MSG
016100         GO TO 2-BLOWUP.
016200
016300*    IF CHAIN-LENG = 0
016400*        GO TO 61-CO-X.
016500
016600     IF SONORDER-COMPUTE-DIR-ONORDER
016700         PERFORM 611-INIT-STR-DEPTS  THRU  611-ISD-X.
016800
016900 61-GET-DPOITEM.
017000*    CALL "DBGET" USING BASE, DSET-DPOITEM, MODE5,
017100*        STATUS-AREA, ALL-ITEMS, BUF-DPOITEM, CODE-ARG.
           MOVE 0 TO COND-WORD.
           READ DPOITEM NEXT INTO BUF-DPOITEM AT END
               MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF CORPCDE OF DPOITEM-REC NOT = CODE-ARG
               MOVE 15 TO COND-WORD.
017200     IF COND-WORD NOT = 0
017300         IF COND-WORD = 15
017400             GO TO 61-CO-X
017500         ELSE
017600             MOVE "GET DPOITEM  61-GD" TO BU-DISPLAY-MSG
017700             GO TO 2-BLOWUP.
017800
017900     IF ITM-COMPLETE-FLAG > SPACE
018000         GO TO 61-GET-DPOITEM.
018100
           IF ITM-PO-REL = "999"
               GO TO 61-GET-DPOITEM.

018200     IF ITM-QTY-ORD > ITM-QTY-DLVR
018300         NEXT SENTENCE
018400     ELSE
018500         GO TO 61-GET-DPOITEM.
018600
018700     SUBTRACT ITM-QTY-DLVR  FROM  ITM-QTY-ORD
018800         GIVING QTY-STILL-OPEN.
018900     MOVE ZEROS          TO  STR-ORD-QTY.
019000     IF ITM-UM = STR-UM
019100         ADD QTY-STILL-OPEN   TO  STR-ORD-QTY ROUNDED
019200     ELSE
019300     IF ITM-UM = STR-UM1
019400         MULTIPLY QTY-STILL-OPEN  BY  STR-UM1-CF
019500             GIVING  STR-ORD-QTY ROUNDED
019600     ELSE
019700     IF ITM-UM = STR-UM2
019800         MULTIPLY QTY-STILL-OPEN  BY  STR-UM2-CF
019900             GIVING  STR-ORD-QTY ROUNDED
020000     ELSE
020100         MOVE "PO UM NOT VALID FOR CODE" TO BU-DISPLAY-MSG
020200         MOVE ITM-PO-RCV-NO       TO  BU-DISPLAY-FLD (3)
020300         GO TO 2-BLOWUP.
020400
020500     ADD STR-ORD-QTY              TO  SONORDER-TOTAL-ONORDER.
020600     IF SONORDER-COMPUTE-DIR-ONORDER
020700         PERFORM 611-DETERMINE-ONORDER-TYPE  THRU  611-DOT-X.
020800
020900     GO TO 61-GET-DPOITEM.
021000
021100 61-CO-X.
021200     EXIT.
021300
021400 611-DETERMINE-ONORDER-TYPE.
021500     IF AKRON-PLANT
021600         GO TO 611-DOT-X.
021700
021800     SET DEPT-SUB  TO  1.
021900     SEARCH STORE-DEPT
022000          ; AT END
022100             ADD STR-ORD-QTY      TO  SONORDER-DIR-ONORDER
022200          ; WHEN STORE-DEPT (DEPT-SUB) = ITM-SUB-DETL
022300             ADD STR-ORD-QTY      TO  SONORDER-STR-ONORDER.
022400
022500 611-DOT-X.
022600     EXIT.
022700
022800 611-INIT-STR-DEPTS.
022900     IF AKRON-PLANT OR STR-DEPT-TABLE-LOADED
023000         GO TO 611-ISD-X.
023100
023200     MOVE "DSTR"                  TO  PLT-ARG.
023300*    CALL "DBGET" USING BASE, DSET-MPLTINFO, MODE7,
023400*        STATUS-AREA, ALL-ITEMS, BUF-MPLTINFO, PLT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
023500     IF COND-WORD NOT = ZEROS
023600         IF COND-WORD = 17
023700             MOVE SPACES          TO  STOREROOM-DEPT-TABLE
023800         ELSE
023900             MOVE "GET MPLTINFO * 611-ISD" TO BU-DISPLAY-MSG
024000             GO TO 2-BLOWUP.
024100
024200     PERFORM 6111-LOAD-STR-DEPTS  THRU  6111-LSD-X
024300         VARYING SUB FROM 1 BY 1
024400             UNTIL SUB > 6.
024500     MOVE "Y"                  TO  STR-DEPT-TABLE-LOADED-SW.
024600
024700 611-ISD-X.
024800     EXIT.
024900
025000
025100 6111-LOAD-STR-DEPTS.
025200     MOVE MPLTINFO-DEPT-STR (SUB) TO  STORE-DEPT (SUB).
025300
025400 6111-LSD-X.
025500     EXIT.
