000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.           SOPNRAV.
000400 AUTHOR.               K MOVSESIAN.
000500 DATE-WRITTEN.         SEPT. 11, 1989.
000600*INSTALLATION.         GOODYEAR TIRE AND RUBBER CO.
000700
000800***************************************************************
000900**                                                           **
001000**   S O P N R A V  -  THIS PROGRAMS CALCULATES OPEN         **
001100**   RECIEVER AND OPEN INVOICE UNITS AND DOLLARS FOR BOTH    **
001200**   STOREROOM AND DIRECT CHARGE DEPARTMENTS.  THE CALLING   **
001300**   PROGRAM MUST SUPPLY THE CORPORATE CODE.                 **
001400**   PAID DIRECT CHARGE INVOICE UNITS AND DOLLARS ARE ALSO   **
001500**   RETURNED.                                               **
001600**                                                           **
001700***************************************************************
      *                                                             *
      *C  06/21/1996   CA YODER                                     *
      *C    RE-COMPILED TO PICK UP CENTURY DATABASE CHANGES.        *
      *                                                             *
      ***************************************************************
      *C
      *C  MAY 1997     JE COFFMAN
      *C    ADDED CODE TO INCLUDE THE FRANCHISED ISSUE UNITS
      *C    AND DOLLARS FOR DANVILLE'S OUTSOURCING OF THE STOREROOM.
      *
001800
001900
002000 ENVIRONMENT DIVISION.
002100 CONFIGURATION SECTION.
002200 SOURCE-COMPUTER.      HP-3000.
002300 OBJECT-COMPUTER.      HP-3000.
002500
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MACCOUNT-INFO-IK-I
               ASSIGN TO DATABASE-MCFLCA0101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DTRANS-MC-I
               ASSIGN TO DATABASE-MCFLCA0701
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
002600
002700 DATA DIVISION.
       FILE SECTION.
002800
      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       FD  MACCOUNT-INFO-IK-I
           LABEL RECORDS ARE STANDARD.
       01  MACCOUNT-INFO-IK-REC-I.
           COPY DDS-MCRPCA0100  OF MCFLCA0101.

       FD  DTRANS-MC-I
           LABEL RECORDS ARE STANDARD.
       01  DTRANS-MC-REC-I.
           COPY DDS-MCRPCA0700  OF MCFLCA0701.


      *------ FD STATEMENT AREA FOR IBM ONLY ------*
002900 WORKING-STORAGE SECTION.
003000 77  SAVE-UNIT-COST               PIC S9(10)V9(4) VALUE ZEROS.
003100
003200************************************************************
003300**                                                        **
003400**           D A T A B A S E   B U F F E R S              **
003500**                                                        **
003600************************************************************
003700
003800 COPY MACTINFO IN COPYLIB.
003900
004000 COPY DTRANS IN COPYLIB.
004100
004200
004300**********************************************************
004400*              D A T A    B A S E                        *
004500**********************************************************
004600
       01  FILE-STATUS.
           05  FILE-STATUS-1    PIC X(1) VALUE "0".
           05  FILE-STATUS-2    PIC X(1) VALUE "0".

004700 COPY DBMODES IN COPYLIB.
004800
004900 01  DATASET-NAMES.
005000     05  DSET-MACCT       PIC X(16)  VALUE "MACCOUNT-INFO;".
005100     05  DSET-DTRANS      PIC X(16)  VALUE "DTRANS;".
005200
005300 01  ITEMS-LISTING.
005400     05  ALL-ITEMS        PIC X(2)   VALUE "@;".
005500     05  MATL-KEY         PIC X(10)  VALUE "MATL-CODE;".
005600
005700
005800 01  IMAGE-ARGS.
005900     05  MACCT-KEY        PIC X(4)   VALUE SPACES.
006000     05  MATL-CODE-ARG    PIC X(8)   VALUE SPACES.
006100
006200
006300 LINKAGE SECTION.
006400
006500 01  ACCTG-BASE                   PIC X(10).
006600
       COPY SOPNRAV IN COPYLIB.
008100
008200 COPY DBSTAT IN COPYLIB.
008300
008400 01  BU-DISPLAY-MSG.
008500     05  BU-DISPLAY-MSG-1         PIC X(1).
008600     05  FILLER                   PIC X(59).
008700
008800 01  BU-DISPLAY-FLDS.
008900     05  BU-DISPLAY-LINE  OCCURS 5 TIMES.
009000         10  BU-DISPLAY-FLD       PIC X(14).
009100         10  BU-DISPLAY-FLD9      PIC S9(8).
009200
009300
009400 PROCEDURE DIVISION USING  ACCTG-BASE,
009500                           SOPNRAV-PARMS,
009600                           STATUS-AREA,
009700                           BU-DISPLAY-MSG,
009800                           BU-DISPLAY-FLDS.
009900
010000
010100 001-BEGIN SECTION.
010200
010300 010-MAINLINE.
           PERFORM 9999-OPEN-STUFF.
           MOVE ZERO TO SAVE-UNIT-COST.
010400     IF SOPNRAV-STR-DEPT = SPACES
010500         PERFORM 100-GET-STR-DEPT.
010600
010700     MOVE ZEROS                   TO S-STR-OPEN-RCVR-UNITS,
010800                                     S-STR-OPEN-RCVR-DLRS,
010900                                     S-DIR-OPEN-RCVR-UNITS,
011000                                     S-DIR-OPEN-RCVR-DLRS,
011100                                     S-STR-OPEN-INV-UNITS,
011200                                     S-STR-OPEN-INV-DLRS,
011300                                     S-DIR-OPEN-INV-UNITS,
011400                                     S-DIR-OPEN-INV-DLRS,
011500                                     S-DIR-PAID-INV-UNITS,
011600                                     S-DIR-PAID-INV-DLRS,
                                           S-ISS-FRAN-UNITS,
                                           S-ISS-FRAN-DLRS.

011700     IF SOPNRAV-MATL-CODE = SPACES OR "NON-STR"
011800         NEXT SENTENCE
011900     ELSE
012000         PERFORM 200-START-ITEM.
012100
           PERFORM 9999-CLOSE-STUFF.
012200
012300     GOBACK.
012400
012500
012600
012700 100-GET-STR-DEPT.
012800****************************************************
012900**   GET STOREROOM DEPT FROM MACCOUNT-INFO        **
013000**   KEY IS EQUAL TO 'SDPT'.  THE STOREROOM DEPT. **
013100****************************************************
013200
013300     MOVE "SDPT" TO MACCT-KEY.
           PERFORM 9999-DBGET7-MACCOUNT-INFO-IK-I.
014100     IF GOOD-CALL
014200         MOVE MACCT-STR-DEPT      TO  SOPNRAV-STR-DEPT
014300     ELSE
014400         MOVE "GET MACCOUNT-INFO 'SDPT'* 100"
014500               TO BU-DISPLAY-MSG
014600         MOVE MACCT-KEY           TO  BU-DISPLAY-FLD (3)
014700         PERFORM 990-BLOWUP.
014800
014900
015000 200-START-ITEM.
015100     MOVE SOPNRAV-MATL-CODE       TO MATL-CODE-ARG.
           PERFORM 9999-DBFIND-DTRANS-MC-I.
015400     IF NOT GOOD-CALL
015500         IF NO-ENTRY
015600             NEXT SENTENCE
015700         ELSE
015800             MOVE "FIND DTRANS * 200-PM" TO BU-DISPLAY-MSG
015900             PERFORM 990-BLOWUP
016000     ELSE
016100         PERFORM 300-GET-DTRANS THRU 300-GD-X
016200             UNTIL END-OF-CHAIN.
016300
016400
016500 300-GET-DTRANS.
           PERFORM 9999-DBGET5-DTRANS-MC-I.
016800     IF COND-WORD NOT = 0
016900         IF COND-WORD = 15
017000             GO TO 300-GD-X
017100         ELSE
017200             MOVE "GET DTRANS *300-GD" TO BU-DISPLAY-MSG
017300             PERFORM 990-BLOWUP
017400     ELSE
017500         IF TRANS-CODE = "REC"
017600             PERFORM 500-CALC-OPEN-RCVR
017700         ELSE
017800         IF TRANS-CODE = "INV"
017900             PERFORM 510-CALC-OPEN-INV
018000         ELSE
018100         IF TRANS-CODE = "DCHG"
018200             PERFORM 520-CALC-OPEN-DCHG
018300         ELSE
018400         IF TRANS-CODE = "FRT"
018500             PERFORM 530-CALC-OPEN-FRT
               ELSE
               IF TRANS-CODE-TRANS = "ISS"
                   IF TRANS-CODE-FRAN-ID = " "
                       NEXT SENTENCE
                   ELSE
                   ADD TRANS-QTY   TO S-ISS-FRAN-UNITS
                   ADD TRANS-VALUE TO S-ISS-FRAN-DLRS.
018600
018700 300-GD-X.
018800     EXIT.
018900
019000*****************************************************************
019100**  CALCULATE STOREROOM OPEN RECEIVERS.  TRANS-CODE = 'REC' AND
019200**  BALANCE-QTY NOT = ZERO
019300*****************************************************************
019400
019500 500-CALC-OPEN-RCVR.
019600     IF TRANS-BALANCE-QTY = ZEROS
019700         NEXT SENTENCE
019800     ELSE
019900         COMPUTE SAVE-UNIT-COST ROUNDED =
020000             TRANS-VALUE / TRANS-QTY
020100         ADD TRANS-BALANCE-QTY    TO S-STR-OPEN-RCVR-UNITS
020200         IF TRANS-CLASS = "206"
020300             NEXT SENTENCE
020400         ELSE
020500             COMPUTE S-STR-OPEN-RCVR-DLRS ROUNDED =
020600                 S-STR-OPEN-RCVR-DLRS +
020700                     (TRANS-BALANCE-QTY * SAVE-UNIT-COST).
020800
020900
021000*****************************************************************
021100**  CALCULATE OPEN INVOICES FOR BOTH STOREROOM AND DIRECT CHARGE.
021200**  OPEN INVOICES HAVE A BALANCE QUANTITY NOT = ZEROS.
021300**  ALSO CALCULATE DIRECT CHARGE INVOICE PAYMENTS MONTH TO DATE
021400**  THESE ARE INVOICES WITHOUT A DOCUMENT NUMBER = 'PROC'
021500*****************************************************************
021600
021700 510-CALC-OPEN-INV.
021800     IF TRANS-DEPT = SOPNRAV-STR-DEPT
021900         IF TRANS-BALANCE-QTY = ZEROS
022000             NEXT SENTENCE
022100         ELSE
022200             COMPUTE SAVE-UNIT-COST ROUNDED =
022300                 TRANS-VALUE / TRANS-QTY
022400             ADD TRANS-BALANCE-QTY TO S-STR-OPEN-INV-UNITS
022500             IF TRANS-CLASS = 206
022600                 NEXT SENTENCE
022700             ELSE
022800                 COMPUTE S-STR-OPEN-INV-DLRS ROUNDED =
022900                     S-STR-OPEN-INV-DLRS +
023000                         (TRANS-BALANCE-QTY * SAVE-UNIT-COST)
023100     ELSE
023200         IF TRANS-BALANCE-QTY = ZEROS
023300             NEXT SENTENCE
023400         ELSE
023500             COMPUTE SAVE-UNIT-COST ROUNDED =
023600                 TRANS-VALUE / TRANS-QTY
023700             ADD TRANS-BALANCE-QTY TO S-DIR-OPEN-INV-UNITS
023800             COMPUTE S-DIR-OPEN-INV-DLRS ROUNDED =
023900                 S-DIR-OPEN-INV-DLRS +
024000                     (TRANS-BALANCE-QTY * SAVE-UNIT-COST).
024100
024200     IF TRANS-DOCUMENT-NUM = "PROC"
024300         NEXT SENTENCE
024400     ELSE
024500         IF TRANS-DEPT NOT = SOPNRAV-STR-DEPT
024600             ADD TRANS-QTY TO S-DIR-PAID-INV-UNITS
024700             ADD TRANS-VALUE TO S-DIR-PAID-INV-DLRS.
024800
024900*****************************************************************
025000**  CALCULATE DIRECT CHARGE OPEN RECEIVERS.  TRANS-CODE = 'DCHG'
025100**  AND BALANCE-QTY NOT = ZERO
025200*****************************************************************
025300
025400 520-CALC-OPEN-DCHG.
025500     IF TRANS-BALANCE-QTY = ZEROS
025600         NEXT SENTENCE
025700     ELSE
025800         COMPUTE SAVE-UNIT-COST ROUNDED =
025900             TRANS-VALUE / TRANS-QTY
026000         ADD TRANS-BALANCE-QTY    TO S-DIR-OPEN-RCVR-UNITS
026100         COMPUTE S-DIR-OPEN-RCVR-DLRS ROUNDED =
026200             S-DIR-OPEN-RCVR-DLRS +
026300                 (TRANS-BALANCE-QTY * SAVE-UNIT-COST).
026400
026500*****************************************************************
026600**  CALCULATE DIRECT CHARGE FREIGHT PAYMENTS MONTH TO DATE
026700**  (TRANS-CODE =FRT AND DOCUMENT NUMBER NOT = 'PROC').
026800**  ADD THE FREIGHT DOLLARS TO DIRECT CHARGE INVOICE PAYTMENTS
026900**  SINCE THEY ARE INCLUDED AS A PAYMENT.
027000*****************************************************************
027100
027200 530-CALC-OPEN-FRT.
027300     IF TRANS-DOCUMENT-NUM = "PROC"
027400         NEXT SENTENCE
027500     ELSE
027600         IF TRANS-DEPT NOT = SOPNRAV-STR-DEPT
027700             ADD TRANS-VALUE TO S-DIR-PAID-INV-DLRS.
027800
027900
028000 990-BLOWUP.
028100     MOVE "SOPNRAV"              TO BU-DISPLAY-FLD (5).
028200     MOVE SOPNRAV-MATL-CODE      TO BU-DISPLAY-FLD (4).
028300     GOBACK.

       9999-DBGET7-MACCOUNT-INFO-IK-I.
           MOVE 0 TO COND-WORD.
           MOVE MACCT-KEY TO INFOKEY OF MACCOUNT-INFO-IK-REC-I.
           READ MACCOUNT-INFO-IK-I INTO BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
               IF FILE-STATUS NOT = "00"
                   MOVE 99 TO COND-WORD.

       9999-DBFIND-DTRANS-MC-I.
           MOVE 0 TO COND-WORD.
           MOVE MATL-CODE-ARG TO MATLCODE OF DTRANS-MC-REC-I.
           START DTRANS-MC-I KEY = MATLCODE OF DTRANS-MC-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD.

       9999-DBGET5-DTRANS-MC-I.
           MOVE 0 TO COND-WORD.
           READ DTRANS-MC-I NEXT INTO BUF-DTRANS
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
           ELSE
           IF MATLCODE OF DTRANS-MC-REC-I NOT = MATL-CODE-ARG
               MOVE 15 TO COND-WORD.

       9999-OPEN-STUFF.
           OPEN INPUT MACCOUNT-INFO-IK-I   .
           OPEN INPUT DTRANS-MC-I          .

       9999-CLOSE-STUFF.
           CLOSE      MACCOUNT-INFO-IK-I   .
           CLOSE      DTRANS-MC-I          .

