       IDENTIFICATION DIVISION.
       PROGRAM-ID.     SPCSPAYT.
       AUTHOR.         CA YODER.
       INSTALLATION.   THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
       DATE-WRITTEN.   OCTOBER 1995.
       DATE-COMPILED.
      *D* * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *D*                                                         *
      *D*   SPCSPAYT:   PAYMENT TERMS SUBPROGRAM.                 *
      *D*                                                         *
      *D*   THIS PROGRAM IS USED TO LOAD PAYMENT TERMS INTO       *
      *D*   THE STORES DATA BASE FOR STARTUP ON CSIS.             *
      *D*                                                         *
      *D*   ** COPIED FROM SPAYTERM AND MODIFIED **               *
      *D*                                                         *
      *D*   THIS PROGRAM IS CALLED BY SPUROPT.                    *
      *D*                                                         *
      *D* * * * * * * * * * * * * * * * * * * * * * * * * * * * * *

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT DISPLAY-FILE
                   ASSIGN TO WORKSTATION-ZSTARTUP-SI
                   ORGANIZATION IS TRANSACTION
                   ACCESS IS SEQUENTIAL
                   FILE STATUS IS DISPLAY-STATUS
                   CONTROL-AREA IS WS-CONTROL.

            SELECT MPLTINFO-PK-O
                ASSIGN TO DATABASE-MCFLCS0501
                ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                FILE STATUS IS FILE-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                   PIC X(2000).
       FD  MPLTINFO-PK-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-PK-REC-O.
           COPY DDS-MCRPCS0500 OF MCFLCS0501.

       WORKING-STORAGE SECTION.
       77  HANDLE-BLOWUP-FLAG            PIC X VALUE "Y".
       77  WS-EDI-INSTAL                 PIC X VALUE SPACE.
005000 01  ARG-VALUES.
005100     05  MPLTINFO-ARG              PIC X(4)   VALUE SPACES.
005200     05  PLT-ARG                   PIC X(4)   VALUE SPACES.
005300
       01  DISPLAY-STATUS                PIC XX.
       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X VALUE SPACE.
           05  FILE-STATUS-2             PIC X VALUE SPACE.


      *************************************************************
      *************************************************************
      **                                                         **
      **              D A T A    B A S E    A R E A              **
      **                                                         **
      *************************************************************
      *************************************************************

       COPY MPLTINFO IN COPYLIB.
       01  MESSAGE-BUFFER.
           05  MSG-TEXT                  PIC X(64)  VALUE SPACES.
           05  MSG-FLD                   PIC X(12)  VALUE SPACES.
       01  MESSAGE-BUFFER-1.
           05  MSG-TEXT-1                PIC X(64)  VALUE SPACES.
           05  MSG-FLD-1                 PIC X(12)  VALUE SPACES.
       01  TMP-CODE-ARG.
           05  FILLER                    PIC X(3)   VALUE "TMP".
           05  TMP-CODE-IN               PIC X(1).
       01  TMD-CODE-ARG.
           05  FILLER                    PIC X(3)   VALUE "TMD".
           05  TMD-CODE-IN               PIC X(1).
       01  DELETE-TMP-TMD                PIC X(3).
           88  DELETE-TMP                           VALUE "TMP".
           88  DELETE-TMD                           VALUE "TMD".
       01  DISC-NUM-VALUE-FIGURES.
           05  DISC-PERCENT              PIC 9V9(4)  VALUE ZEROES.
           05  DISC-NUM-VALUE-OUT        PIC 99V99   VALUE ZEROES.
       COPY DBSTAT IN COPYLIB.
      *************************************************************
      *************************************************************
      **                                                         **
      **                 TERMINAL I/O DATA AREA                  **
      **                                                         **
      *************************************************************
      *************************************************************

011100 COPY FUNCTDEF IN COPYLIB.
011200
       01  PAYTERMS-SCREEN.
           05  DISCOUNT-AMOUNT.
               10  DISC-CODE             PIC X(1).
               10  DISC-DESC             PIC X(5).
9210CK         10  DISC-NUM-VALUE        PIC V99999.
               10  DISC-NUM-VALUE-X REDEFINES DISC-NUM-VALUE
                                         PIC X(5).
           05  TIME-FRAME-OF-DISCOUNT.
               10  TIME-FRAME-CODE       PIC X(1).
               10  TIME-FRAME-DESC       PIC X(18).
               10  DAYS-OR-PROX          PIC 9(3).
               10  DAYS-OR-PROX-X REDEFINES DAYS-OR-PROX
                                         PIC X(3).
               10  DAYS-OR-PROX-FLAG     PIC X(1).
               10  DAYS-OR-PROX-MLT      PIC 9(3).
               10  DAYS-OR-PROX-MLT-X REDEFINES DAYS-OR-PROX-MLT
                                         PIC X(3).
               10  DAYS-OR-PROX-MLT-FLAG PIC X(1).
           05  PAYTERMS-MSGLINE          PIC X(79).
           05  CMDLINE                   PIC X(79).
           05  ERR-MSGLINE               PIC X(79).

       COPY CATREAD    IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.
       COPY TBLOWUP    IN COPYLIB.
       COPY TSHWRDFM   IN COPYLIB.
       COPY WSCONTROL  IN COPYLIB.

      *************************************************************
      *************************************************************
      **                                                         **
      **               LINKAGE   SECTION                         **
      **                                                         **
      *************************************************************
      *************************************************************

       LINKAGE SECTION.

       01  BASE                          PIC X(10).
       COPY VCOMLINK IN COPYLIB.
       COPY LANGSUB  IN COPYLIB.

      *************************************************************
      **#########################################################**
      *************************************************************
      **                                                         **
      **          P R O C E D U R E    D I V I S I O N           **
      **                                                         **
      *************************************************************
      **#########################################################**
      *************************************************************

       PROCEDURE DIVISION USING BASE,
                                VIEW-COMAREA,
                                LANGUAGE-PARMS.

       0-SBUYRCODE-SEC SECTION 1.

       0-BEGIN-HERE.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-X.
           PERFORM 2-EOJ.

       1-HSK.
           MOVE "SPCSPAYT" TO BU-PGM-NAME.
           OPEN I-O DISPLAY-FILE, MPLTINFO-PK-O.
           MOVE SPACES     TO BUF-MPLTINFO.
           MOVE "N"        TO WS-EDI-INSTAL.
           MOVE "EDI "     TO MPLTINFO-ARG PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-O.
           IF COND-WORD = 0
               IF EDI-INSTAL = "Y"
                   MOVE "Y" TO WS-EDI-INSTAL.
           PERFORM 9999-RESET-MPLTINFO-PK-O.

       2-EOJ.
           CLOSE DISPLAY-FILE, MPLTINFO-PK-O.
           GOBACK.
      ******************************************************
      **                 BLOWUP ROUTINE                   **
      ******************************************************

       2100-BLOWUP.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
                 VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                 BU-DISPLAY-AREA.


      **************************************************
      *                                                *
      *                  6 - M A I N                   *
      *                                                *
      **************************************************
       6-MAIN.
           IF WS-EDI-INSTAL = "Y"
               MOVE "EPAYTERMS" TO VIEW-NFNAME
           ELSE
           MOVE "PAYTERMS" TO VIEW-NFNAME.
           MOVE SPACES TO PAYTERMS-SCREEN.
       6-SHOW-FORM.
           MOVE PAYTERMS-SCREEN TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC     TO PAYTERMS-SCREEN.
           IF VIEW-LASTKEY = 3
               GO TO 6-MAIN-X.

           IF VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERR-MSGLINE
               MOVE B"1" TO IND(99)
               GO TO 6-SHOW-FORM
           ELSE
           IF VIEW-LASTKEY = 1
               PERFORM 65-HELP-SCREEN THRU 65-HELP-SCREEN-X
               GO TO 6-MAIN
           ELSE
           IF VIEW-LASTKEY = 2
               PERFORM 61-ADD-PAYTERMS THRU 61-ADD-PAYTERMS-X
           ELSE
           IF VIEW-LASTKEY = 4
               PERFORM 63-DELETE-PAYTERMS THRU 63-DELETE-PAYTERMS-X
           ELSE
           IF VIEW-LASTKEY = 5
               PERFORM 62-MODIFY-PAYTERMS THRU 62-MODIFY-PAYTERMS-X
           ELSE
           IF VIEW-LASTKEY = 6
               IF WS-EDI-INSTAL = "Y"
                   CALL "SPCSEPAY" USING BASE, VIEW-COMAREA,
                                    LANGUAGE-PARMS
               ELSE
      *****    INVALID FUNCTION KEY    *****
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERR-MSGLINE
               MOVE B"1" TO IND(99)
               GO TO 6-SHOW-FORM.

           GO TO 6-MAIN.

       6-MAIN-X.
           EXIT.


       61-ADD-PAYTERMS.
           MOVE SPACES TO PAYTERMS-SCREEN.
           MOVE ZEROS  TO DISC-NUM-VALUE,
                          DAYS-OR-PROX,
                          DAYS-OR-PROX-MLT.

       61-PUT-BUFFER.
      ***  INPUT DATA ABOVE AND PRESS 'ENTER'  ***
           MOVE   9 TO LANG-SETNUM.
           MOVE  20 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO PAYTERMS-MSGLINE.

       61-SHOW-FORM.
           MOVE "PAYTERMSA" TO VIEW-NFNAME.
           MOVE PAYTERMS-SCREEN TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC     TO PAYTERMS-SCREEN.
           IF VIEW-LASTKEY = 3
               GO TO 61-ADD-PAYTERMS-X.

           IF VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERR-MSGLINE
               MOVE B"1" TO IND(99)
               GO TO 61-SHOW-FORM
           ELSE
           IF VIEW-LASTKEY = 1
               PERFORM 65-HELP-SCREEN THRU 65-HELP-SCREEN-X
               GO TO 61-SHOW-FORM.

       61-EDIT-CHECK.
           IF DISC-CODE NOT = SPACES
               MOVE DISC-CODE    TO TMP-CODE-IN
               MOVE TMP-CODE-ARG TO MPLTINFO-ARG
               MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-O
               START MPLTINFO-PK-O KEY = PLTINFOKEY OF MPLTINFO-PK-REC-O
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-START
               IF FILE-STATUS = "00"
      ****   DISCOUNT CODE ALREADY EXISTS --- CANNOT ADD  ****
                   MOVE   4 TO LANG-SETNUM
                   MOVE   6 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO ERR-MSGLINE
                   MOVE B"1" TO IND(99), IND(6)
                   GO TO 61-SHOW-FORM
               ELSE
               IF FILE-STATUS-1 = "2"
                   IF DISC-DESC = SPACES
      *DESCRIPTION REQUIRED
                       MOVE 30042 TO CATREAD-MSG-NUMBER
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE MESSAGE-BUFFER TO ERR-MSGLINE
                       MOVE B"1" TO IND(99), IND(7)
                       GO TO 61-SHOW-FORM
                   END-IF
                   IF DISC-NUM-VALUE-X = SPACES
      *DISCOUNT PERCENT REQUIRED
                       MOVE 66144 TO CATREAD-MSG-NUMBER
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE MESSAGE-BUFFER TO ERR-MSGLINE
                       MOVE B"1" TO IND(99), IND(18)
                       GO TO 61-SHOW-FORM
                   END-IF
                   PERFORM 611-ADD-MPLTINFO
               ELSE
                   MOVE "START MPLTINFO ERROR IN 61-GET-BUFFER"
                       TO BU-DISPLAY-MSG
                   MOVE TMP-CODE-ARG TO BU-DISPLAY-FLD (1)
                   PERFORM 2100-BLOWUP.

           IF TIME-FRAME-CODE NOT = SPACES
               MOVE TIME-FRAME-CODE TO TMD-CODE-IN
               MOVE TMD-CODE-ARG    TO MPLTINFO-ARG
               MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-O
               START MPLTINFO-PK-O KEY = PLTINFOKEY OF MPLTINFO-PK-REC-O
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-START
               IF FILE-STATUS = "00"
      **** TIME FRAME CODE ALREADY EXISTS -- CANNOT ADD  ****
                   MOVE  20 TO LANG-SETNUM
                   MOVE  37 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO ERR-MSGLINE
                   MOVE B"1" TO IND(99), IND(16)
                   GO TO 61-SHOW-FORM
               ELSE
               IF FILE-STATUS-1 = "2"
                   IF DAYS-OR-PROX-MLT = SPACES
                       MOVE ZEROS TO DAYS-OR-PROX-MLT
                       MOVE "N"   TO DAYS-OR-PROX-MLT-FLAG
                   END-IF
                   IF TIME-FRAME-DESC = SPACES
      *DESCRIPTION REQUIRED
                       MOVE 30042 TO CATREAD-MSG-NUMBER
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE MESSAGE-BUFFER TO ERR-MSGLINE
                       MOVE B"1" TO IND(99), IND(10)
                       GO TO 61-SHOW-FORM
                   END-IF
                   IF DAYS-OR-PROX = SPACES
      *DAYS OR PROX REQUIRED
                       MOVE 66146 TO CATREAD-MSG-NUMBER
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE MESSAGE-BUFFER TO ERR-MSGLINE
                       MOVE B"1" TO IND(99), IND(11)
                       GO TO 61-SHOW-FORM
                   END-IF
                   IF DAYS-OR-PROX-FLAG = SPACES
      *DAYS OR PROX FLAG REQUIRED
                       MOVE 66143 TO CATREAD-MSG-NUMBER
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE MESSAGE-BUFFER TO ERR-MSGLINE
                       MOVE B"1" TO IND(99), IND(12)
                       GO TO 61-SHOW-FORM
                   END-IF
                   IF DAYS-OR-PROX-FLAG  = "N" OR "D" OR "P"
                       NEXT SENTENCE
                   ELSE
      *VALID ENTRIES ARE 'D' FOR DAYS, 'P' FOR PROX, 'N' FOR N/A
                       MOVE 66147 TO CATREAD-MSG-NUMBER
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE MESSAGE-BUFFER TO ERR-MSGLINE
                       MOVE B"1" TO IND(99), IND(12)
                       GO TO 61-SHOW-FORM
                   END-IF
                   IF DAYS-OR-PROX-MLT NOT = ZEROS AND
                       DAYS-OR-PROX-FLAG NOT = "P"
      *MUST BE P(PROX) WHEN SELECTING MULTIPLE DAYS
                       MOVE 66145 TO CATREAD-MSG-NUMBER
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE MESSAGE-BUFFER TO ERR-MSGLINE
                       MOVE B"1" TO IND(99), IND(12)
                       MOVE "P"  TO DAYS-OR-PROX-MLT-FLAG
                       GO TO 61-SHOW-FORM
                   END-IF
                   IF DAYS-OR-PROX-MLT NOT = ZEROS AND
                       DAYS-OR-PROX-MLT-FLAG NOT = "P"
      *MUST BE P(PROX) WHEN SELECTING MULTIPLE DAYS
                       MOVE 66145 TO CATREAD-MSG-NUMBER
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE MESSAGE-BUFFER TO ERR-MSGLINE
                       MOVE B"1" TO IND(99), IND(17)
                       GO TO 61-SHOW-FORM
                   END-IF
                   PERFORM 612-ADD-MPLTINFO
               ELSE
                   MOVE "START MPLTINFO ERROR IN 61-GET-BUFFER"
                       TO BU-DISPLAY-MSG
                   MOVE TMD-CODE-ARG TO BU-DISPLAY-FLD (1)
                   PERFORM 2100-BLOWUP.

           GO TO 61-ADD-PAYTERMS.

       61-ADD-PAYTERMS-X.
           EXIT.

       611-ADD-MPLTINFO.
           MOVE SPACES         TO BUF-MPLTINFO.
           MOVE TMP-CODE-ARG   TO MPLTINFO-KEY.
           MOVE DISC-DESC      TO MPLTINFO-DISC-AMNT-DESC.
      *    DIVIDE DISC-NUM-VALUE BY 100 GIVING DISC-PERCENT.
      *    MOVE DISC-PERCENT   TO MPLTINFO-DISC-AMNT.
           MOVE DISC-NUM-VALUE TO MPLTINFO-DISC-AMNT.
           WRITE MPLTINFO-PK-REC-O FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "WRT MPLTINFO ERROR IN 611-ADD-MPLTINFO"
                    TO BU-DISPLAY-MSG
               MOVE TMP-CODE-ARG TO BU-DISPLAY-FLD (1)
               PERFORM 2100-BLOWUP.

       612-ADD-MPLTINFO.
           MOVE SPACES                TO BUF-MPLTINFO.
           MOVE TMD-CODE-ARG          TO MPLTINFO-KEY.
           MOVE TIME-FRAME-DESC       TO MPLTINFO-TMD-DESC.
           MOVE DAYS-OR-PROX          TO MPLTINFO-D-OR-P.
           MOVE DAYS-OR-PROX-FLAG     TO MPLTINFO-TIME-FLAG.
           MOVE DAYS-OR-PROX-MLT      TO MPLTINFO-D-OR-P-2.
           MOVE DAYS-OR-PROX-MLT-FLAG TO MPLTINFO-D-OR-P-FLAG.
           WRITE MPLTINFO-PK-REC-O FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "WRT MPLTINFO ERROR IN 612-ADD-MPLTINFO"
                    TO BU-DISPLAY-MSG
               MOVE TMD-CODE-ARG TO BU-DISPLAY-FLD (1)
               PERFORM 2100-BLOWUP.

       62-MODIFY-PAYTERMS.
           MOVE SPACES TO PAYTERMS-SCREEN.
           MOVE ZEROS  TO DISC-NUM-VALUE,
                          DAYS-OR-PROX,
                          DAYS-OR-PROX-MLT.
       62-PUT-BUFFER.
      ***  INPUT DATA ABOVE AND PRESS 'ENTER'  ***
           MOVE   9 TO LANG-SETNUM.
           MOVE  20 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO PAYTERMS-MSGLINE.

       62-SHOW-FORM.
           MOVE "PAYTERMSM" TO VIEW-NFNAME.
           MOVE PAYTERMS-SCREEN TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC     TO PAYTERMS-SCREEN.
           IF VIEW-LASTKEY = 3
               GO TO 62-MODIFY-PAYTERMS-X.
           IF VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERR-MSGLINE
               MOVE B"1" TO IND(99)
               GO TO 62-SHOW-FORM
           ELSE
           IF VIEW-LASTKEY = 1
               PERFORM 65-HELP-SCREEN THRU 65-HELP-SCREEN-X
               GO TO 62-SHOW-FORM.

       62-EDIT-CHECK.
           IF DISC-CODE NOT = SPACES
               MOVE DISC-CODE    TO TMP-CODE-IN
               MOVE TMP-CODE-ARG TO MPLTINFO-ARG
               MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-O
               READ MPLTINFO-PK-O INTO BUF-MPLTINFO
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS-1 = "2"
      ****   DISCOUNT CODE DOES NOT EXIST --- CANNOT MODIFY OR DELETE ****
                   MOVE   4 TO LANG-SETNUM
                   MOVE   7 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO ERR-MSGLINE
                   MOVE B"1" TO IND(99), IND(6)
                   GO TO 62-SHOW-FORM
               ELSE
               IF FILE-STATUS = "00"
                   PERFORM 621-MODIFY-MPLTINFO
                           THRU 621-MODIFY-MPLTINFO-X
               ELSE
                   MOVE "READ MPLTINFO ERROR IN 62-GET-BUFFER"
                       TO BU-DISPLAY-MSG
                   MOVE TMP-CODE-ARG TO BU-DISPLAY-FLD (1)
                   PERFORM 2100-BLOWUP.

           IF TIME-FRAME-CODE NOT = SPACES
               MOVE TIME-FRAME-CODE TO TMD-CODE-IN
               MOVE TMD-CODE-ARG    TO MPLTINFO-ARG
               MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-O
               READ MPLTINFO-PK-O INTO BUF-MPLTINFO
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS-1 = "2"
      ****  TIME FRAME CODE DOES NOT EXIST -- CANNOT MODIFY OR DELETE ****
                   MOVE  20 TO LANG-SETNUM
                   MOVE  38 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO ERR-MSGLINE
                   MOVE B"1" TO IND(99), IND(16)
                   GO TO 62-SHOW-FORM
               ELSE
               IF FILE-STATUS = "00"
                   PERFORM 622-MODIFY-MPLTINFO
                               THRU 622-MODIFY-MPLTINFO-X
               ELSE
                   MOVE "READ MPLTINFO ERROR IN 62-GET-BUFFER"
                       TO BU-DISPLAY-MSG
                   MOVE TMD-CODE-ARG TO BU-DISPLAY-FLD (1)
                   PERFORM 2100-BLOWUP.

           GO TO 62-MODIFY-PAYTERMS.

       62-MODIFY-PAYTERMS-X.
           EXIT.

       621-MODIFY-MPLTINFO.
           MOVE "PAYTERMSMX" TO VIEW-NFNAME.
           MOVE MPLTINFO-DISC-AMNT-DESC TO DISC-DESC.
      *    MULTIPLY MPLTINFO-DISC-AMNT BY 100 GIVING DISC-NUM-VALUE-OUT.
      *    MOVE DISC-NUM-VALUE-OUT      TO DISC-NUM-VALUE.
           MOVE MPLTINFO-DISC-AMNT      TO DISC-NUM-VALUE.
      ***  INPUT DATA ABOVE AND PRESS 'ENTER'  ***
           MOVE   9 TO LANG-SETNUM.
           MOVE  20 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO PAYTERMS-MSGLINE.

       621-SHOW-FORM.
           MOVE PAYTERMS-SCREEN TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC     TO PAYTERMS-SCREEN.
           IF VIEW-LASTKEY = 3
      *------- DO A START > HIGH-VALUES TO UNLOCK
               MOVE HIGH-VALUES TO PLTINFOKEY OF MPLTINFO-PK-REC-O
               START MPLTINFO-PK-O KEY > PLTINFOKEY OF MPLTINFO-PK-REC-O
                   INVALID KEY MOVE "00" TO FILE-STATUS
               END-START
               GO TO 621-MODIFY-MPLTINFO-X.
           IF VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERR-MSGLINE
               MOVE B"1" TO IND(99)
               GO TO 621-SHOW-FORM
           ELSE
           IF VIEW-LASTKEY = 1
               PERFORM 65-HELP-SCREEN THRU 65-HELP-SCREEN-X
               GO TO 621-SHOW-FORM.

           IF DISC-DESC = SPACES
      *DESCRIPTION REQUIRED
               MOVE 30042 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERR-MSGLINE
               MOVE B"1" TO IND(99), IND(7)
               GO TO 621-SHOW-FORM.
           IF DISC-NUM-VALUE-X = SPACES
      *DISCOUNT PERCENT REQUIRED
               MOVE 66144 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERR-MSGLINE
               MOVE B"1" TO IND(99), IND(18)
               GO TO 621-SHOW-FORM.
           MOVE DISC-DESC      TO MPLTINFO-DISC-AMNT-DESC.
      *    DIVIDE DISC-NUM-VALUE BY 100 GIVING DISC-PERCENT.
      *    MOVE DISC-PERCENT   TO MPLTINFO-DISC-AMNT.
           MOVE DISC-NUM-VALUE TO MPLTINFO-DISC-AMNT.
           REWRITE MPLTINFO-PK-REC-O FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              MOVE "REWRITE MPLTINFO ERROR IN 621-REPLACE-MPLTINFO"
                   TO BU-DISPLAY-MSG
              MOVE TMP-CODE-ARG TO BU-DISPLAY-FLD (1)
              PERFORM 2100-BLOWUP.

       621-MODIFY-MPLTINFO-X.
            EXIT.

       622-MODIFY-MPLTINFO.
           MOVE "PAYTERMSMX" TO VIEW-NFNAME.
           MOVE MPLTINFO-TMD-DESC    TO TIME-FRAME-DESC.
           MOVE MPLTINFO-D-OR-P      TO DAYS-OR-PROX.
           MOVE MPLTINFO-TIME-FLAG   TO DAYS-OR-PROX-FLAG.
           MOVE MPLTINFO-D-OR-P-2    TO DAYS-OR-PROX-MLT.
           MOVE MPLTINFO-D-OR-P-FLAG TO DAYS-OR-PROX-MLT-FLAG.
      ***  INPUT DATA ABOVE AND PRESS 'ENTER'  ***
           MOVE   9 TO LANG-SETNUM.
           MOVE  20 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO PAYTERMS-MSGLINE.

       622-SHOW-FORM.
           MOVE PAYTERMS-SCREEN TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC     TO PAYTERMS-SCREEN.
           IF VIEW-LASTKEY = 3
      *------- DO A START > HIGH-VALUES TO UNLOCK
               MOVE HIGH-VALUES TO PLTINFOKEY OF MPLTINFO-PK-REC-O
               START MPLTINFO-PK-O KEY > PLTINFOKEY OF MPLTINFO-PK-REC-O
                   INVALID KEY MOVE "00" TO FILE-STATUS
               END-START
               GO TO 622-MODIFY-MPLTINFO-X.
           IF VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERR-MSGLINE
               MOVE B"1" TO IND(99)
               GO TO 622-SHOW-FORM
           ELSE
           IF VIEW-LASTKEY = 1
               PERFORM 65-HELP-SCREEN THRU 65-HELP-SCREEN-X
               GO TO 622-SHOW-FORM.

           IF DAYS-OR-PROX-MLT = SPACES
               MOVE ZEROS TO DAYS-OR-PROX-MLT
               MOVE "N"   TO DAYS-OR-PROX-MLT-FLAG.
           IF DAYS-OR-PROX-X = SPACES
               MOVE ZEROS TO DAYS-OR-PROX.

           IF TIME-FRAME-DESC = SPACES
      *DESCRIPTION REQUIRED
               MOVE 30042 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERR-MSGLINE
               MOVE B"1" TO IND(99), IND(10)
               GO TO 622-SHOW-FORM.
           IF DAYS-OR-PROX-FLAG = SPACES
      *DAYS OR PROX FLAG REQUIRED
               MOVE 66143 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERR-MSGLINE
               MOVE B"1" TO IND(99), IND(12)
               GO TO 622-SHOW-FORM.
           IF DAYS-OR-PROX-FLAG  = "N" OR "D" OR "P"
               NEXT SENTENCE
           ELSE
      *VALID ENTRIES ARE 'D' FOR DAYS, 'P' FOR PROX, 'N' FOR N/A
               MOVE 66147 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERR-MSGLINE
               MOVE B"1" TO IND(99), IND(12)
               GO TO 622-SHOW-FORM.
           IF DAYS-OR-PROX-MLT NOT = ZEROS AND
               DAYS-OR-PROX-FLAG NOT = "P"
      *MUST BE P(PROX) WHEN SELECTING MULTIPLE DAYS
               MOVE 66145 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERR-MSGLINE
               MOVE B"1" TO IND(99), IND(12)
               MOVE "P"  TO DAYS-OR-PROX-MLT-FLAG
               GO TO 622-SHOW-FORM.
           IF DAYS-OR-PROX-MLT NOT = ZEROS AND
               DAYS-OR-PROX-MLT-FLAG NOT = "P"
      *MUST BE P(PROX) WHEN SELECTING MULTIPLE DAYS
               MOVE 66145 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERR-MSGLINE
               MOVE B"1" TO IND(99), IND(17)
               GO TO 622-SHOW-FORM.
           MOVE TIME-FRAME-DESC       TO MPLTINFO-TMD-DESC.
           MOVE DAYS-OR-PROX          TO MPLTINFO-D-OR-P.
           MOVE DAYS-OR-PROX-FLAG     TO MPLTINFO-TIME-FLAG.
           MOVE DAYS-OR-PROX-MLT      TO MPLTINFO-D-OR-P-2.
           MOVE DAYS-OR-PROX-MLT-FLAG TO MPLTINFO-D-OR-P-FLAG.
           REWRITE MPLTINFO-PK-REC-O FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              MOVE "REWRITE MPLTINFO ERROR IN 622-REPLACE-MPLTINFO"
                   TO BU-DISPLAY-MSG
              MOVE TMD-CODE-ARG TO BU-DISPLAY-FLD (1)
              PERFORM 2100-BLOWUP.

       622-MODIFY-MPLTINFO-X.
           EXIT.

       63-DELETE-PAYTERMS.
           MOVE "PAYTERMSD" TO VIEW-NFNAME.
           MOVE SPACES TO PAYTERMS-SCREEN.
           MOVE ZEROS  TO DISC-NUM-VALUE,
                          DAYS-OR-PROX,
                          DAYS-OR-PROX-MLT.

      ***  INPUT DATA ABOVE AND PRESS 'ENTER'  ***
           MOVE   9 TO LANG-SETNUM.
           MOVE  20 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO PAYTERMS-MSGLINE.

       63-SHOW-FORM.
           MOVE PAYTERMS-SCREEN TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC     TO PAYTERMS-SCREEN.
           IF VIEW-LASTKEY = 3
               GO TO 63-DELETE-PAYTERMS-X.
           IF VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERR-MSGLINE
               MOVE B"1" TO IND(99)
               GO TO 63-SHOW-FORM
           ELSE
           IF VIEW-LASTKEY = 1
               PERFORM 65-HELP-SCREEN THRU 65-HELP-SCREEN-X
               GO TO 63-SHOW-FORM.

       63-EDIT-CHECK.
           IF DISC-CODE NOT = SPACES
               MOVE DISC-CODE    TO TMP-CODE-IN
               MOVE TMP-CODE-ARG TO MPLTINFO-ARG, BU-DISPLAY-FLD (1)
               MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-O
               READ MPLTINFO-PK-O INTO BUF-MPLTINFO
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS-1 = "2"
      ****   DISCOUNT CODE DOES NOT EXIST --- CANNOT MODIFY OR DELETE ****
                   MOVE   4 TO LANG-SETNUM
                   MOVE   7 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO  ERR-MSGLINE
                   MOVE B"1" TO IND(99), IND(6)
                   GO TO 63-SHOW-FORM
               ELSE
               IF FILE-STATUS = "00"
                   MOVE "TMP" TO DELETE-TMP-TMD
                   PERFORM 631-DELETE-MPLTINFO
                               THRU 631-DELETE-MPLTINFO-X
               ELSE
                   MOVE "READ MPLTINFO ERROR IN 63-GET-BUFFER"
                       TO BU-DISPLAY-MSG
                   PERFORM 2100-BLOWUP.

           IF TIME-FRAME-CODE NOT = SPACES
               MOVE TIME-FRAME-CODE TO TMD-CODE-IN
               MOVE TMD-CODE-ARG    TO MPLTINFO-ARG, BU-DISPLAY-FLD (1)
               MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-O
               READ MPLTINFO-PK-O INTO BUF-MPLTINFO
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS-1 = "2"
      ****  TIME FRAME CODE DOES NOT EXIST -- CANNOT MODIFY OR DELETE ****
                   MOVE  20 TO LANG-SETNUM
                   MOVE  38 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO ERR-MSGLINE
                   MOVE B"1" TO IND(99), IND(16)
                   GO TO 63-SHOW-FORM
               ELSE
               IF FILE-STATUS = "00"
                   MOVE "TMD" TO DELETE-TMP-TMD
                   PERFORM 631-DELETE-MPLTINFO
                               THRU 631-DELETE-MPLTINFO-X
               ELSE
                   MOVE "READ MPLTINFO ERROR IN 63-GET-BUFFER"
                       TO BU-DISPLAY-MSG
                   PERFORM 2100-BLOWUP.

           GO TO 63-DELETE-PAYTERMS.

       63-DELETE-PAYTERMS-X.
           EXIT.

       631-DELETE-MPLTINFO.
           MOVE "PAYTERMSDX" TO VIEW-NFNAME.

       631-SHOW-FORM.
           IF DELETE-TMP
               MOVE MPLTINFO-DISC-AMNT-DESC TO DISC-DESC
      *        MULTIPLY MPLTINFO-DISC-AMNT BY 100
      *             GIVING DISC-NUM-VALUE-OUT
      *        MOVE DISC-NUM-VALUE-OUT      TO DISC-NUM-VALUE
               MOVE MPLTINFO-DISC-AMNT      TO DISC-NUM-VALUE
           ELSE
               MOVE MPLTINFO-TMD-DESC  TO TIME-FRAME-DESC
               MOVE MPLTINFO-D-OR-P    TO DAYS-OR-PROX
               MOVE MPLTINFO-TIME-FLAG TO DAYS-OR-PROX-FLAG
               MOVE MPLTINFO-D-OR-P-2  TO DAYS-OR-PROX-MLT
               MOVE MPLTINFO-D-OR-P-FLAG TO DAYS-OR-PROX-MLT-FLAG.
      ***  PRESS 'f2' TO DELETE OR 'f8' TO EXIT (LEAVE UNCHANGED)  ***
           MOVE  16 TO LANG-SETNUM.
           MOVE  82 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO PAYTERMS-MSGLINE.

           MOVE PAYTERMS-SCREEN TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC     TO PAYTERMS-SCREEN.
           IF VIEW-LASTKEY = 8
      *------- DO A START > HIGH-VALUES TO UNLOCK
               MOVE HIGH-VALUES TO PLTINFOKEY OF MPLTINFO-PK-REC-O
               START MPLTINFO-PK-O KEY > PLTINFOKEY OF MPLTINFO-PK-REC-O
                   INVALID KEY MOVE "00" TO FILE-STATUS
               END-START
               GO TO 631-DELETE-MPLTINFO-X.
           IF VIEW-LASTKEY = 0 OR
              VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 3 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7
      *****    INVALID FUNCTION KEY    *****
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERR-MSGLINE
               MOVE B"1" TO IND(99)
               GO TO 631-SHOW-FORM.

       631-MAIN-DELETE-MPLTINFO.
           DELETE MPLTINFO-PK-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DELETE MPLTINFO ERROR IN 631-DELETE-MPLTINFO"
                   TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

       631-DELETE-MPLTINFO-X.
           EXIT.


       65-HELP-SCREEN.
           MOVE "HELP2" TO VIEW-NFNAME.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.

       65-HELP-SCREEN-X.
           EXIT.

       COPY DISPCALL IN COPYLIB.

       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.

       9999-GETKEY-MPLTINFO-PK-O.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-O.
           READ MPLTINFO-PK-O INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MPLTINFO-PK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-RESET-MPLTINFO-PK-O.
           MOVE HIGH-VALUES TO PLTINFOKEY OF MPLTINFO-PK-REC-O.
           START MPLTINFO-PK-O KEY > PLTINFOKEY OF MPLTINFO-PK-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-DELETE-MPLTINFO-PK-O.
           MOVE 0 TO COND-WORD.
           DELETE MPLTINFO-PK-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "DELETE ERR 9999-DELETE-MPLTINFO-PK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-PUT-MPLTINFO-PK-O.
           MOVE 0 TO COND-WORD.
           WRITE MPLTINFO-PK-REC-O FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-MPLTINFO-PK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

056800 COPY MLOCKCAL IN COPYLIB.
056900 COPY UNLOCK   IN COPYLIB.
057000 COPY DLOCKCAL IN COPYLIB.
057100*COPY SCRNCALL IN COPYLIB.
       9999-UPDATE-MPLTINFO-PK-O.
           MOVE 0 TO COND-WORD.
           REWRITE MPLTINFO-PK-REC-O FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "UPDATE ERR 9999-UPDATE-MPLTINFO-PK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

