       IDENTIFICATION DIVISION.
       PROGRAM-ID.     SPCSINST.
       AUTHOR.         CA YODER.
       INSTALLATION.   THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
       DATE-WRITTEN.   SEPTEMBER 1995.
       DATE-COMPILED.
      *REMARKS.
      **************************************************************
      *                                                            *
      *D   SPCSINST     STANDARD INSTRUCTION SUBPROGRAM            *
      *D                                                           *
      *D   ** COPIED FROM SSTDINST AND MODIFIED **                 *
      *D                                                           *
      **************************************************************
      *C                                                           *
      *C 06/29/98   CA YODER                                       *
      *C  PROGRAM WAS BLOWING UP IF THE "CREF" KEY DID NOT EXIST   *
      *C  IN MCOMMENT, BUT IT DID EXIST IN DCOMMENT.  HOWEVER,     *
      *C  THIS CASE COULD OCCUR IF THE STANDARD INSTRUCTIONS WERE  *
      *C  BLANKED OUT.  ADDED LOGIC TO INSERT DCOMMENT IF IT       *
      *C  DOESN'T EXIST.                                           *
      *C                                                           *

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT DISPLAY-FILE
                   ASSIGN TO WORKSTATION-ZSTARTUP-SI
                   ORGANIZATION IS TRANSACTION
                   ACCESS IS SEQUENTIAL
                   FILE STATUS IS DISPLAY-STATUS
                   CONTROL-AREA IS WS-CONTROL.
            SELECT MCOMMENT-O
                   ASSIGN TO DATABASE-MCFLCS1801
                   ORGANIZATION IS INDEXED
                   ACCESS IS DYNAMIC
                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   FILE STATUS IS FILE-STATUS.
            SELECT DCOMMENT-O
                   ASSIGN TO DATABASE-MCFLCS1901
                   ORGANIZATION IS INDEXED
                   ACCESS IS DYNAMIC
                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                       PIC X(2000).
       FD  MCOMMENT-O
           LABEL RECORDS ARE STANDARD.
       01  MCOMMENT-O-REC.
           COPY DDS-MCRPCS1800 OF MCFLCS1801.
       FD  DCOMMENT-O
           LABEL RECORDS ARE STANDARD.
       01  DCOMMENT-O-REC.
           COPY DDS-MCRPCS1900 OF MCFLCS1901.
       WORKING-STORAGE SECTION.

       01  LINE-NUM-FOR-DCOMMENT      PIC 9(4)  VALUE ZEROES.
       01  FILE-STATUS.
           05  FILE-STATUS-1          PIC X     VALUE SPACE.
           05  FILE-STATUS-2          PIC X     VALUE SPACE.
      *************************************************************
      **                                                         **
      **              D A T A    B A S E    A R E A              **
      **                                                         **
      *************************************************************
      *************************************************************

       COPY MCOMMENT IN COPYLIB.
       COPY DCOMMENT IN COPYLIB.

       COPY DBSTAT IN COPYLIB.
       01  COMMENT-ARG                     PIC X(4)  VALUE SPACES.

       01  MESSAGE-BUFFER.
           05  MSG-TEXT                    PIC X(64)  VALUE SPACES.
           05  MSG-FLD                     PIC X(12)  VALUE SPACES.
           05  MSG-FLD-9 REDEFINES MSG-FLD
                                           PIC Z(11)9.
      *************************************************************
      *************************************************************
      **                                                         **
      **                 TERMINAL I/O DATA AREA                  **
      **                                                         **
      *************************************************************
      *************************************************************

       01  STND-INST-SCREEN.
           05  SHIPPING-INST-TBL.
               10  SHIPPING-INST OCCURS 4 TIMES
               INDEXED BY DCOMMENT-INDX1 PIC X(72).
           05  ZBILL-TBL.
               10  ZBILL-INST OCCURS 4 TIMES
               INDEXED BY DCOMMENT-INDX2 PIC X(72).
      *    05  STND-INST-MSGLINE         PIC X(79).
           05  STND-CMD-LINE             PIC X(79).
           05  STND-ERR-MSGLINE          PIC X(79).

       COPY TBLOWUP IN COPYLIB.
       COPY CATREAD IN COPYLIB.
       COPY DISPDATA IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.

      *************************************************************
      *************************************************************
      **                                                         **
      **               LINKAGE   SECTION                         **
      **                                                         **
      *************************************************************
      *************************************************************

       LINKAGE SECTION.

       01  BASE                          PIC X(10).

       COPY VCOMLINK IN COPYLIB.

       COPY LANGSUB IN COPYLIB.


      *************************************************************
      **#########################################################**
      *************************************************************
      **                                                         **
      **          P R O C E D U R E    D I V I S I O N           **
      **                                                         **
      *************************************************************
      **#########################################################**
      *************************************************************

       PROCEDURE DIVISION USING BASE,
                                VIEW-COMAREA,
                                LANGUAGE-PARMS.


       MAIN-PGM SECTION 01.

       BEGIN-HERE.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-X.
           PERFORM 2-EOJ.

       1-HSK.
           MOVE "SPCSINST" TO BU-PGM-NAME.
           OPEN I-O DISPLAY-FILE, MCOMMENT-O, DCOMMENT-O.

       2-EOJ.
           CLOSE DISPLAY-FILE, MCOMMENT-O, DCOMMENT-O.
           GOBACK.

      ******************************************************
      **                 BLOWUP ROUTINE                   **
      ******************************************************

       2-BLOWUP.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
               BU-DISPLAY-AREA.

      **************************************************
      *                                                *
      *                  6 - M A I N                   *
      *                                                *
      **************************************************

       6-MAIN.
           MOVE "STNDINST" TO VIEW-NFNAME.

       6-PUT-BUFFER.
           MOVE SPACES TO STND-INST-SCREEN.
           PERFORM 61-READ-DCOMMENT.

      ***  INPUT DATA ABOVE AND PRESS 'ENTER'  ***
      *    MOVE   9 TO LANG-SETNUM.
      *    MOVE  20 TO LANG-MSGNUM.
      *    PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
      *    MOVE MESSAGE-BUFFER TO STND-INST-MSGLINE.

       6-SHOW-FORM.
           MOVE STND-INST-SCREEN TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC      TO STND-INST-SCREEN.

       6-READ-FIELDS.
           IF VIEW-LASTKEY = 3
               GO TO 6-MAIN-X.
           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO STND-ERR-MSGLINE
               MOVE B"1" TO IND(99)
               GO TO 6-SHOW-FORM.

           PERFORM 611-REPLACE-DCOMMENT THRU 611-REPLACE-DCOMMENT-X.
           PERFORM 612-REPLACE-DCOMMENT THRU 612-REPLACE-DCOMMENT-X.

       6-MAIN-X.
           EXIT.

       61-READ-DCOMMENT.
           MOVE SPACES TO SHIPPING-INST-TBL, ZBILL-TBL,
                          BUF-DCOMMENT.
           SET DCOMMENT-INDX1 TO 1.

           MOVE "CREL" TO COMMENT-ARG, BU-DISPLAY-FLD (1).
           MOVE COMMENT-ARG TO MCOMCOMMNT OF MCOMMENT-O-REC.
           READ MCOMMENT-O INTO BUF-MCOMMENT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                    PERFORM 611-FAKE-DCOMMENT
               ELSE
                   MOVE "READ  MCOMMENT AREA IN 61-READ-DCOMMENT"
                       TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP
           ELSE
                MOVE COMMENT-ARG TO MCOMCOMMNT OF DCOMMENT-O-REC
                START DCOMMENT-O KEY = MCOMCOMMNT OF DCOMMENT-O-REC
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                END-START
                IF FILE-STATUS = "23"
                   PERFORM 611-PUT-DCOMMENT
                ELSE
                IF FILE-STATUS NOT = "00"
                   MOVE "START DCOMMENT AREA IN 61-READ-DCOMMENT"
                       TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP
                ELSE
                   PERFORM 611-GET-DCOMMENT THRU 611-GD-X.

           SET DCOMMENT-INDX2 TO 1.
           MOVE "CMZB"      TO COMMENT-ARG, BU-DISPLAY-FLD (1).
           MOVE COMMENT-ARG TO MCOMCOMMNT OF MCOMMENT-O-REC.
           READ MCOMMENT-O INTO BUF-MCOMMENT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                    PERFORM 612-FAKE-DCOMMENT
               ELSE
                   MOVE "READ  MCOMMENT AREA IN 61-READ-DCOMMENT"
                       TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP
           ELSE
                MOVE COMMENT-ARG TO MCOMCOMMNT OF DCOMMENT-O-REC
                START DCOMMENT-O KEY = MCOMCOMMNT OF DCOMMENT-O-REC
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                END-START
                IF FILE-STATUS = "23"
                   PERFORM 612-PUT-DCOMMENT
                ELSE
                IF FILE-STATUS NOT = "00"
                   MOVE "START DCOMMENT AREA IN 61-READ-DCOMMENT"
                       TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP
                ELSE
                   PERFORM 612-GET-DCOMMENT THRU 612-GD-X.
      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO MCOMCOMMNT OF MCOMMENT-O-REC.
           START MCOMMENT-O KEY > MCOMCOMMNT OF MCOMMENT-O-REC
               INVALID KEY MOVE "00" TO FILE-STATUS.
           MOVE HIGH-VALUES TO MCOMCOMMNT OF DCOMMENT-O-REC.
           START DCOMMENT-O KEY > MCOMCOMMNT OF DCOMMENT-O-REC
               INVALID KEY MOVE "00" TO FILE-STATUS.

       611-GET-DCOMMENT.
           READ DCOMMENT-O   NEXT INTO BUF-DCOMMENT
               AT END GO TO 611-GD-X.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO 611-GD-X
               ELSE
                   MOVE "GET DCOMMENT ERROR IN 61-READ-DCOMMENT"
                       TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP.
           IF MCOMCOMMNT OF DCOMMENT-O-REC NOT = COMMENT-ARG
               GO TO 611-GD-X.
           IF DCOM-LINE-NO = "0000"
               NEXT SENTENCE
           ELSE
           IF DCOM-LINE-NO IS GREATER THAN "0004"
               GO TO 611-GD-X
           ELSE
               MOVE DCOM-DATA-LINE TO
                           SHIPPING-INST (DCOMMENT-INDX1)
               IF DCOMMENT-INDX1 IS LESS THAN 4
                   SET DCOMMENT-INDX1 UP BY 1.
           GO TO 611-GET-DCOMMENT.

       611-GD-X.
           EXIT.

       612-GET-DCOMMENT.
           READ DCOMMENT-O   NEXT INTO BUF-DCOMMENT
               AT END GO TO 611-GD-X.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO 612-GD-X
               ELSE
                   MOVE "GET DCOMMENT ERROR IN 61-READ-DCOMMENT"
                       TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP.
           IF MCOMCOMMNT OF DCOMMENT-O-REC NOT = COMMENT-ARG
               GO TO 612-GD-X.
           IF DCOM-LINE-NO = "0000"
               NEXT SENTENCE
           ELSE
           IF DCOM-LINE-NO IS GREATER THAN "0004"
               GO TO 612-GD-X
           ELSE
               MOVE DCOM-DATA-LINE TO
                           ZBILL-INST (DCOMMENT-INDX2)
               IF DCOMMENT-INDX2 IS LESS THAN 4
                   SET DCOMMENT-INDX2 UP BY 1.
           GO TO 612-GET-DCOMMENT.

       612-GD-X.
           EXIT.

       611-FAKE-DCOMMENT.
           MOVE SPACES  TO BUF-MCOMMENT.
           MOVE "CREL"  TO MCOM-COMMENT-NO.
           WRITE MCOMMENT-O-REC FROM BUF-MCOMMENT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "WRITE MCOMMENT 611-FC" TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.
      ***  THIS RELEASE AUTHORIZES ONE SHIPMENT,   ***
      ***  PARTIALS WILL BE PERMITTED ONLY         ***
           MOVE   9 TO LANG-SETNUM.
           MOVE  94 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO SHIPPING-INST (DCOMMENT-INDX1).
           SET DCOMMENT-INDX1 UP BY 1.

      ***  UPON APPROVAL OF BUYER.  ANY PARTIALS   ***
      ***  PERMITTED MUST REFERENCE THIS           ***
           MOVE   9 TO LANG-SETNUM.
           MOVE  95 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO SHIPPING-INST (DCOMMENT-INDX1).
           SET DCOMMENT-INDX1 UP BY 1.

      ***  PARTICULAR PURCHASE ORDER AND RELEASE NUMBER.  ***
           MOVE   9 TO LANG-SETNUM.
           MOVE  96 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO SHIPPING-INST (DCOMMENT-INDX1).

           MOVE 1 TO LINE-NUM-FOR-DCOMMENT.
           PERFORM 611-PROCESS-DCOMMENT-LINE
             VARYING DCOMMENT-INDX1 FROM 1 BY 1
               UNTIL DCOMMENT-INDX1 IS GREATER THAN 4.

      *--------- IF MCOMMENT EXISTS, BUT DCOMMENT DOESN'T, PERFORM
      *--------- THIS PARAGRAPH.
       611-PUT-DCOMMENT.
      ***  THIS RELEASE AUTHORIZES ONE SHIPMENT,   ***
      ***  PARTIALS WILL BE PERMITTED ONLY         ***
           MOVE   9 TO LANG-SETNUM.
           MOVE  94 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO SHIPPING-INST (DCOMMENT-INDX1).
           SET DCOMMENT-INDX1 UP BY 1.

      ***  UPON APPROVAL OF BUYER.  ANY PARTIALS   ***
      ***  PERMITTED MUST REFERENCE THIS           ***
           MOVE   9 TO LANG-SETNUM.
           MOVE  95 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO SHIPPING-INST (DCOMMENT-INDX1).
           SET DCOMMENT-INDX1 UP BY 1.

      ***  PARTICULAR PURCHASE ORDER AND RELEASE NUMBER.  ***
           MOVE   9 TO LANG-SETNUM.
           MOVE  96 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO SHIPPING-INST (DCOMMENT-INDX1).

           MOVE 1 TO LINE-NUM-FOR-DCOMMENT.
           PERFORM 611-PROCESS-DCOMMENT-LINE
             VARYING DCOMMENT-INDX1 FROM 1 BY 1
               UNTIL DCOMMENT-INDX1 IS GREATER THAN 4.

       612-FAKE-DCOMMENT.
           MOVE SPACES  TO BUF-MCOMMENT.
           MOVE "CMZB"  TO MCOM-COMMENT-NO.
           WRITE MCOMMENT-O-REC FROM BUF-MCOMMENT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "WRITE MCOMMENT 612-FC" TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.
      ***  IN THE EVENT THIS MATERIAL IS NOT       ***
           MOVE   9 TO LANG-SETNUM.
           MOVE  97 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO ZBILL-INST (DCOMMENT-INDX2).
           SET DCOMMENT-INDX2 UP BY 1.

      ***  RETURNED.  THIS DOCUMENT BECOMES A      ***
           MOVE   9 TO LANG-SETNUM.
           MOVE  98 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO ZBILL-INST (DCOMMENT-INDX2).
           SET DCOMMENT-INDX2 UP BY 1.

      ***  LEGAL BILLING.                              .  ***
           MOVE   9 TO LANG-SETNUM.
           MOVE  99 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO ZBILL-INST (DCOMMENT-INDX2).

           MOVE 1 TO LINE-NUM-FOR-DCOMMENT.
           PERFORM 612-PROCESS-DCOMMENT-LINE
             VARYING DCOMMENT-INDX2 FROM 1 BY 1
               UNTIL DCOMMENT-INDX2 IS GREATER THAN 4.

      *--------- IF MCOMMENT EXISTS, BUT DCOMMENT DOESN'T, PERFORM
      *--------- THIS PARAGRAPH.
       612-PUT-DCOMMENT.
      ***  IN THE EVENT THIS MATERIAL IS NOT       ***
           MOVE   9 TO LANG-SETNUM.
           MOVE  97 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO ZBILL-INST (DCOMMENT-INDX2).
           SET DCOMMENT-INDX2 UP BY 1.

      ***  RETURNED.  THIS DOCUMENT BECOMES A      ***
           MOVE   9 TO LANG-SETNUM.
           MOVE  98 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO ZBILL-INST (DCOMMENT-INDX2).
           SET DCOMMENT-INDX2 UP BY 1.

      ***  LEGAL BILLING.                              .  ***
           MOVE   9 TO LANG-SETNUM.
           MOVE  99 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO ZBILL-INST (DCOMMENT-INDX2).

           MOVE 1 TO LINE-NUM-FOR-DCOMMENT.
           PERFORM 612-PROCESS-DCOMMENT-LINE
             VARYING DCOMMENT-INDX2 FROM 1 BY 1
               UNTIL DCOMMENT-INDX2 IS GREATER THAN 4.

       611-REPLACE-DCOMMENT.
           MOVE "CREL"  TO COMMENT-ARG.
           MOVE COMMENT-ARG TO MCOMCOMMNT OF DCOMMENT-O-REC.
           START DCOMMENT-O KEY = MCOMCOMMNT OF DCOMMENT-O-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ  MCOMMENT ERROR IN 611-REPLACE-DCOMMENT"
                   TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP
            ELSE
               PERFORM 61X-GET-DELETE-DCOMMENT THRU 61X-GDD-X.
           MOVE  1  TO LINE-NUM-FOR-DCOMMENT.

           PERFORM 611-PROCESS-DCOMMENT-LINE
              VARYING DCOMMENT-INDX1 FROM 1 BY 1
               UNTIL DCOMMENT-INDX1 IS GREATER THAN 4.
       611-REPLACE-DCOMMENT-X.
           EXIT.

       612-REPLACE-DCOMMENT.
           MOVE "CMZB"  TO COMMENT-ARG.
           MOVE COMMENT-ARG TO MCOMCOMMNT OF DCOMMENT-O-REC.
           START DCOMMENT-O KEY = MCOMCOMMNT OF DCOMMENT-O-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ  MCOMMENT ERROR IN 612-REPLACE-DCOMMENT"
                   TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP
            ELSE
               PERFORM 61X-GET-DELETE-DCOMMENT THRU 61X-GDD-X.
           MOVE  1  TO LINE-NUM-FOR-DCOMMENT.

           PERFORM 612-PROCESS-DCOMMENT-LINE
              VARYING DCOMMENT-INDX2 FROM 1 BY 1
               UNTIL DCOMMENT-INDX2 IS GREATER THAN 4.

       612-REPLACE-DCOMMENT-X.
           EXIT.

       61X-GET-DELETE-DCOMMENT.
           READ DCOMMENT-O   NEXT INTO BUF-DCOMMENT
               AT END GO TO 61X-GDD-X.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO 61X-GDD-X
               ELSE
                   MOVE "GET DCOMMENT ERROR IN 61X-GET-DELETE-DCOMMENT"
                       TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP.
           IF MCOMCOMMNT OF DCOMMENT-O-REC NOT = COMMENT-ARG
               GO TO 61X-GDD-X.

           DELETE DCOMMENT-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
            MOVE "DELETE DCOMMENT ERROR IN 61X-GET-DELETE-DCOMMENT"
                TO BU-DISPLAY-MSG
            GO TO 2-BLOWUP.
           GO TO 61X-GET-DELETE-DCOMMENT.

       61X-GDD-X.
           EXIT.

       611-PROCESS-DCOMMENT-LINE.
           IF SHIPPING-INST (DCOMMENT-INDX1) = SPACES
             NEXT SENTENCE
           ELSE
             MOVE SPACES                        TO BUF-DCOMMENT
             MOVE "CREL"                        TO DCOM-COMMENT-NO
             MOVE LINE-NUM-FOR-DCOMMENT         TO DCOM-LINE-NO
             MOVE SHIPPING-INST (DCOMMENT-INDX1) TO DCOM-DATA-LINE
             WRITE DCOMMENT-O-REC FROM BUF-DCOMMENT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
             END-WRITE
             IF FILE-STATUS NOT = "00"
               MOVE "PUT DCOMMENT ERROR IN 611-PROCESS-DCOMMENT-LINE"
                   TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP
             ELSE
               ADD  1  TO LINE-NUM-FOR-DCOMMENT.

       612-PROCESS-DCOMMENT-LINE.
           IF ZBILL-INST (DCOMMENT-INDX2) = SPACES
             NEXT SENTENCE
           ELSE
             MOVE SPACES                        TO BUF-DCOMMENT
             MOVE "CMZB"                        TO DCOM-COMMENT-NO
             MOVE LINE-NUM-FOR-DCOMMENT         TO DCOM-LINE-NO
             MOVE ZBILL-INST (DCOMMENT-INDX2) TO DCOM-DATA-LINE
             WRITE DCOMMENT-O-REC FROM BUF-DCOMMENT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
             END-WRITE
             IF FILE-STATUS NOT = "00"
               MOVE "PUT DCOMMENT ERROR IN 612-PROCESS-DCOMMENT-LINE"
                   TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP
             ELSE
               ADD  1  TO LINE-NUM-FOR-DCOMMENT.
      *********************************************************
       COPY DISPCALL IN COPYLIB.
       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.
