       IDENTIFICATION DIVISION.
       PROGRAM-ID.     SPCSRCVO.
       AUTHOR.         CA YODER.
       INSTALLATION.   THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
       DATE-WRITTEN.   OCTOBER 1995.
       DATE-COMPILED.
      *REMARKS.
      *D***********************************************************
      *D*                                                         *
      *D*  SPCSRCVO    USER OPTIONS SUBPROGRAM                    *
      *D*                                                         *
      *D*  CALLED BY:  SRCVOPT                                    *
      *D*                                                         *
      *D***********************************************************
      *
      *C*

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT DISPLAY-FILE
                   ASSIGN TO WORKSTATION-ZSTARTUP-SI
                   ORGANIZATION IS TRANSACTION
                   ACCESS IS SEQUENTIAL
                   FILE STATUS IS DISPLAY-STATUS
                   CONTROL-AREA IS WS-CONTROL.
            SELECT MPLTINFO-O
                   ASSIGN TO DATABASE-MCFLCS0501
                   ORGANIZATION IS INDEXED
                   ACCESS IS DYNAMIC
                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   FILE STATUS IS FILE-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                   PIC X(2000).
       FD  MPLTINFO-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-O-REC.
           COPY DDS-MCRPCS0500 OF MCFLCS0501.

       WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X VALUE SPACE.
           05  FILE-STATUS-2             PIC X VALUE SPACE.

      *************************************************************
      **                                                         **
      **           P R O G R A M   V A R I A B L E S             **
      **                                                         **
      *************************************************************
       77  LINE-NO                       PIC 9(2)  VALUE 1.

       01  REPLACE-SW                    PIC X(1).
           88  REPLACE-SW-ON          VALUE "Y".

      *************************************************************
      **                                                         **
      **              D A T A    B A S E    A R E A              **
      **                                                         **
      *************************************************************
       COPY MPLTINFO IN COPYLIB.
       COPY MPLTST   IN COPYLIB.
       01  MPLTINFO-ARG                  PIC X(4).
       COPY DBSTAT IN COPYLIB.

      *************************************************************
      **                                                         **
      **              V I E W   W O R K   A R E A                **
      **                                                         **
      *************************************************************
       01  MESSAGE-BUFFER.
           05  MSG-TEXT                  PIC X(64)  VALUE SPACES.
           05  MSG-FLD                   PIC X(12)  VALUE SPACES.
           05  MSG-FLD-9 REDEFINES MSG-FLD
                                         PIC Z(11)9.

      *************************************************************
      **                                                         **
      **                 TERMINAL I/O DATA AREA                  **
      **                                                         **
      *************************************************************

       01  USER-OPTION-SCREEN.
           05  CAPITAL-ITEMS.
               10  CAPITAL-ITEM-INDIC    PIC X(1).
               10  CAPITAL-ITEM-PRT      PIC X(2).
           05  TC326-SW                  PIC X(1).
           05  CHAT-RCVG-REQUIRED-SW     PIC X(1).
           05  DOCK-SPECIAL-PRINT        PIC X(1).
           05  S1-CMDLINE                PIC X(79).
           05  S1-MSGLINE                PIC X(79).

      *************************************************************
      **                                                         **
      **         S U B P R O G R A M   A R E A S                 **
      **                                                         **
      *************************************************************
       COPY TBLOWUP  IN COPYLIB.
       COPY CATREAD  IN COPYLIB.
       COPY DISPDATA IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.

      *************************************************************
      **                                                         **
      **               LINKAGE   SECTION                         **
      **                                                         **
      *************************************************************
       LINKAGE SECTION.

       01  BASE                          PIC X(10).
       COPY VCOMLINK IN COPYLIB.
       COPY LANGSUB IN COPYLIB.

      *************************************************************
      **#########################################################**
      *************************************************************
      **                                                         **
      **          P R O C E D U R E    D I V I S I O N           **
      **                                                         **
      *************************************************************
      **#########################################################**
      *************************************************************

       PROCEDURE DIVISION USING BASE,
                                VIEW-COMAREA,
                                LANGUAGE-PARMS.


       1-START.
           OPEN I-O DISPLAY-FILE, MPLTINFO-O.
           PERFORM 60-SCREEN1  THRU 60-SCREEN1-X.
           CLOSE DISPLAY-FILE, MPLTINFO-O.
           GOBACK.

      ******************************************************
      **                 BLOWUP ROUTINE                   **
      ******************************************************
       2-BLOWUP.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
               BU-DISPLAY-AREA.

      **************************************************
      *                                                *
      *         M A I N    P R O C E S S I N G         *
      *                                                *
      **************************************************

       60-SCREEN1.
           MOVE "SPCSRCVO"             TO  BU-PGM-NAME.
           MOVE "RCVOPT1"              TO  VIEW-NFNAME.

       60-PUT-BUFFER.
           MOVE SPACES                 TO  USER-OPTION-SCREEN.
           PERFORM 601-READ-MPLTINFO.

       60-SHOW-FORM.
           MOVE USER-OPTION-SCREEN     TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC            TO  USER-OPTION-SCREEN.
           IF VIEW-LASTKEY = 3
               GO TO 60-SCREEN1-X.
           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9                TO  LANG-SETNUM
               MOVE  10                TO  LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER     TO  S1-MSGLINE
               MOVE B"1"               TO  IND(99)
               GO TO 60-SHOW-FORM.

       60-REPLACE-MPLTINFO.
           IF CAPITAL-ITEM-INDIC = "Y" AND
                   (CAPITAL-ITEM-PRT = SPACES OR ZERO)
               MOVE "SPOOLER NUMBER MUST BE ENTERED" TO S1-MSGLINE
               MOVE B"1"               TO  IND(99)
                                           IND(23)
               GO TO 60-SHOW-FORM.

           IF CAPITAL-ITEM-INDIC = "N"
               MOVE ZEROS              TO  CAPITAL-ITEM-PRT.
           MOVE "POPT"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           MOVE CAPITAL-ITEM-PRT       TO  MPLTINFO-CAP-ITEM-PRT.
           PERFORM 9-REWRITE-MPLTINFO.

           MOVE "P326"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           MOVE TC326-SW               TO  MPLTINFO-P326-SW.
           PERFORM 9-REWRITE-MPLTINFO.

           MOVE "CHAT"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           MOVE CHAT-RCVG-REQUIRED-SW  TO  MPLTINFO-CHAT-RCVG-REQUIRED.
           PERFORM 9-REWRITE-MPLTINFO.

           MOVE "OVSH"                 TO MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           MOVE DOCK-SPECIAL-PRINT TO MPLTINFO-DOCK-SPECIAL-PRINT.
           PERFORM 9-REWRITE-MPLTINFO.



       60-SCREEN1-X.
           EXIT.

       601-READ-MPLTINFO.
           MOVE "POPT"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           IF FILE-STATUS-1 = "2"
               MOVE SPACES             TO  BUF-MPLTINFO
               MOVE "POPT"             TO  MPLTINFO-KEY
               MOVE ZEROS              TO  MPLTINFO-CAP-ITEM-PRT
               MOVE "N"                TO  CAPITAL-ITEM-INDIC
               MOVE SPACES             TO  CAPITAL-ITEM-PRT
               PERFORM 9-WRITE-MPLTINFO
           ELSE
           IF FILE-STATUS = "00"
               IF MPLTINFO-CAP-ITEM-PRT > ZERO
                   MOVE "Y"            TO  CAPITAL-ITEM-INDIC
                   MOVE MPLTINFO-CAP-ITEM-PRT  TO  CAPITAL-ITEM-PRT
               ELSE
                   MOVE "N"            TO  CAPITAL-ITEM-INDIC
                   MOVE SPACES         TO  CAPITAL-ITEM-PRT
               END-IF
           END-IF.

           MOVE "P326"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           IF FILE-STATUS-1 = "2"
               MOVE SPACES             TO  BUF-MPLTINFO
               MOVE "P326"             TO  MPLTINFO-KEY
               MOVE "N"                TO  MPLTINFO-P326-SW
               PERFORM 9-WRITE-MPLTINFO
           ELSE
           MOVE MPLTINFO-P326-SW       TO  TC326-SW.

           MOVE "CHAT"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           IF FILE-STATUS-1 = "2"
               MOVE SPACES             TO  BUF-MPLTINFO
               MOVE "CHAT"             TO  MPLTINFO-KEY
               MOVE "N"                TO  MPLTINFO-CHAT-PURCH-REQUIRED
               MOVE "Y"                TO  MPLTINFO-CHAT-RCVG-REQUIRED
                                           CHAT-RCVG-REQUIRED-SW
               PERFORM 9-WRITE-MPLTINFO
           ELSE
           MOVE MPLTINFO-CHAT-RCVG-REQUIRED  TO  CHAT-RCVG-REQUIRED-SW.

           MOVE "OVSH"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           IF FILE-STATUS = "2"
               MOVE "N"                TO  MPLTINFO-DOCK-SPECIAL-PRINT
               PERFORM 9-WRITE-MPLTINFO
           ELSE
               MOVE MPLTINFO-DOCK-SPECIAL-PRINT TO DOCK-SPECIAL-PRINT.

      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO PLTINFOKEY OF MPLTINFO-O-REC.
           START MPLTINFO-O KEY > PLTINFOKEY OF MPLTINFO-O-REC
               INVALID KEY MOVE "00"     TO  FILE-STATUS.

      ***************************************************************
      **                                                           **
      **          P E R F O R M E D    R O U T I N E S             **
      **                                                           **
      ***************************************************************

       9-READ-MPLTINFO.
           MOVE 0                      TO  COND-WORD.
           MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               NEXT SENTENCE
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "READ MPLTINFO ERROR IN 9-READ-MPLTINFO"
                                       TO  BU-DISPLAY-MSG
               MOVE MPLTINFO-ARG       TO  BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

       9-WRITE-MPLTINFO.
           WRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "WRT MPLTINFO ERROR IN 9-WRITE-MPLTINFO"
                                       TO  BU-DISPLAY-MSG
               MOVE MPLTINFO-KEY       TO  BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

       9-REWRITE-MPLTINFO.
           REWRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "REWRITE  ERROR IN 9-REWRITE-MPLTINFO"
                                       TO  BU-DISPLAY-MSG
               MOVE MPLTINFO-KEY       TO  BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

       COPY DISPCALL IN COPYLIB.

       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM        TO  CATREAD-MSG-SET
               MOVE LANG-MSGNUM        TO  CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT       TO  MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.
