       IDENTIFICATION DIVISION.
       PROGRAM-ID.     SPCSINVC.
       AUTHOR.         CA YODER.
       INSTALLATION.   THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
       DATE-WRITTEN.   OCTOBER 1995.
       DATE-COMPILED.
      *REMARKS.
      **************************************************************
      *                                                            *
      *D   SPCSINVC     INVOICING USER OPTIONS                     *
      *D                                                           *
      *D   CALLED BY:  TCSISOPT                                    *
      *D                                                           *
      **************************************************************
      *C
      *C  6/03/2003   CA YODER
      *C    ADDED SWITCH TO SPECIFY IF UPDATES ARE ALLOWED ON THE
      *C    AP9 SCREEN.
      *C
      *C  6/01/2004   CA YODER
      *C    ADDED FIELDS TO SET PARAMETERS FOR TPAYIRPT.
      *C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT DISPLAY-FILE
                   ASSIGN TO WORKSTATION-ZSTARTUP-SI
                   ORGANIZATION IS TRANSACTION
                   ACCESS IS SEQUENTIAL
                   FILE STATUS IS DISPLAY-STATUS
                   CONTROL-AREA IS WS-CONTROL.
            SELECT MPLTINFO-O
                   ASSIGN TO DATABASE-MCFLCS0501
                   ORGANIZATION IS INDEXED
                   ACCESS IS DYNAMIC
                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                       PIC X(2000).
       FD  MPLTINFO-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-O-REC.
           COPY DDS-MCRPCS0500 OF MCFLCS0501.
       WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1                 PIC X VALUE SPACE.
           05  FILE-STATUS-2                 PIC X VALUE SPACE.

      *************************************************************
      **                                                         **
      **              D A T A    B A S E    A R E A              **
      **                                                         **
      *************************************************************
      *************************************************************

       COPY MPLTINFO IN COPYLIB.
       COPY DBSTAT IN COPYLIB.
       01  MPLTINFO-ARG                    PIC X(4).
       01  MESSAGE-BUFFER.
           05  MSG-TEXT                    PIC X(64)  VALUE SPACES.
           05  MSG-FLD                     PIC X(12)  VALUE SPACES.
           05  MSG-FLD-9 REDEFINES MSG-FLD
                                           PIC Z(11)9.
      *************************************************************
      *************************************************************
      **                                                         **
      **                 TERMINAL I/O DATA AREA                  **
      **                                                         **
      *************************************************************
      *************************************************************

       01  INV-OPTION-SCREEN.
           05  INV-PREPAY-SW             PIC X(1).
           05  DISCOUNT-TAX-SW           PIC X(1).
           05  AUTO-GEN-SW               PIC X(1).
           05  LAST-ABST                 PIC 9.
           05  UPD-AP9-SW                PIC X(1).
           05  PCT-AMOUNT                PIC 99.
           05  DOLLAR-AMOUNT             PIC 9(4).
           05  PRNT-MSGLINE2             PIC X(79).
           05  CMDLINE2                  PIC X(79).
           05  ERR-MSGLINE2              PIC X(79).

       COPY TBLOWUP IN COPYLIB.
       COPY CATREAD IN COPYLIB.
       COPY DISPDATA IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.

      *************************************************************
      *************************************************************
      **                                                         **
      **               LINKAGE   SECTION                         **
      **                                                         **
      *************************************************************
      *************************************************************

       LINKAGE SECTION.

       01  BASE                          PIC X(10).

       COPY VCOMLINK IN COPYLIB.

       COPY LANGSUB IN COPYLIB.


      *************************************************************
      **#########################################################**
      *************************************************************
      **                                                         **
      **          P R O C E D U R E    D I V I S I O N           **
      **                                                         **
      *************************************************************
      **#########################################################**
      *************************************************************

       PROCEDURE DIVISION USING BASE,
                                VIEW-COMAREA,
                                LANGUAGE-PARMS.


       MAIN-PGM SECTION 01.

       BEGIN-HERE.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-X.
           PERFORM 2-EOJ.

       1-HSK.
           MOVE "SPCSINVC" TO BU-PGM-NAME.
           OPEN I-O DISPLAY-FILE, MPLTINFO-O.

       2-EOJ.
           CLOSE DISPLAY-FILE, MPLTINFO-O.
           GOBACK.

      ******************************************************
      **                 BLOWUP ROUTINE                   **
      ******************************************************

       2-BLOWUP.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
               BU-DISPLAY-AREA.

      **************************************************
      *                                                *
      *                  6 - M A I N                   *
      *                                                *
      **************************************************

       6-MAIN.
           MOVE SPACES TO INV-OPTION-SCREEN.

       6-READ-DATABASE.
           PERFORM 62-READ-MPLTINFO.

       6-PERFORM-PAGES.
           MOVE "INV1" TO VIEW-NFNAME.
           PERFORM 62-PAGE-1  THRU 62-PAGE-1-X.

       6-MAIN-X.
           EXIT.

       62-PAGE-1.
       62-PUT-BUFFER.

      ***  INPUT DATA ABOVE AND PRESS 'ENTER'  ***
           MOVE   9 TO LANG-SETNUM.
           MOVE  20 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO PRNT-MSGLINE2.

       62-SHOW-FORM.
           MOVE INV-OPTION-SCREEN TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC TO INV-OPTION-SCREEN.
           IF VIEW-LASTKEY = 3
               GO TO 62-PAGE-1-X.
           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERR-MSGLINE2
               MOVE B"1" TO IND(99)
               GO TO 62-SHOW-FORM.

       62-REPLACE-MPLTINFO.
           MOVE "PINV"                 TO MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           MOVE INV-PREPAY-SW          TO MPLTINFO-INV-PREPAY-SW
           MOVE PCT-AMOUNT             TO MPLTINFO-INV-PCT.
           MOVE DOLLAR-AMOUNT          TO MPLTINFO-INV-DOLLAR-AMT.
           PERFORM 9-REWRITE-MPLTINFO.

           MOVE "PREG"                 TO MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           IF DISCOUNT-TAX-SW = "B"
               MOVE "N"                TO MPLTINFO-DISCOUNT-TAX-SW
           ELSE
               MOVE "Y"                TO MPLTINFO-DISCOUNT-TAX-SW.
           PERFORM 9-REWRITE-MPLTINFO.

           MOVE "PODL"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           MOVE AUTO-GEN-SW            TO  MPLTINFO-INVOICE-IND.
           MOVE UPD-AP9-SW             TO  MPLTINFO-UPD-AP9.
           ADD 2 TO LAST-ABST GIVING MPLTINFO-INV-LAST-ABST.
           PERFORM 9-REWRITE-MPLTINFO.


       62-PAGE-1-X.
           EXIT.

       62-READ-MPLTINFO.
           MOVE "PINV"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           IF FILE-STATUS-1 = "2"
               MOVE SPACES             TO  BUF-MPLTINFO
               MOVE "PINV"             TO  MPLTINFO-KEY
               MOVE "N"                TO  MPLTINFO-INV-PREPAY-SW,
                                           INV-PREPAY-SW
               MOVE 0                  TO  MPLTINFO-INV-PCT
                                           MPLTINFO-INV-DOLLAR-AMT
               PERFORM 9-WRITE-MPLTINFO
           ELSE
               MOVE MPLTINFO-INV-PREPAY-SW TO  INV-PREPAY-SW
               MOVE 0                  TO  PCT-AMOUNT
                                           DOLLAR-AMOUNT
               IF MPLTINFO-INV-PCT NUMERIC
                   IF MPLTINFO-INV-PCT > 0
                       MOVE MPLTINFO-INV-PCT TO PCT-AMOUNT
                   END-IF
               END-IF
               IF MPLTINFO-INV-DOLLAR-AMT NUMERIC
                   IF MPLTINFO-INV-DOLLAR-AMT > 0
                       MOVE MPLTINFO-INV-DOLLAR-AMT TO DOLLAR-AMOUNT
                   END-IF
               END-IF.


            MOVE "PREG"                 TO  MPLTINFO-ARG.
            PERFORM 9-READ-MPLTINFO.
            IF FILE-STATUS-1 = "2"
               MOVE "MPLTINFO PREG NOT FOUND*631-RM" TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.
            IF MPLTINFO-DISCOUNT-TAX-SW = "Y"
                MOVE "A"                TO  DISCOUNT-TAX-SW
            ELSE
                MOVE "B"                TO  DISCOUNT-TAX-SW.

           MOVE "PODL"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           IF FILE-STATUS-1 = "2"
               MOVE SPACES             TO BUF-MPLTINFO
               MOVE "PODL"             TO MPLTINFO-KEY
               MOVE "N"                TO MPLTINFO-INVOICE-IND
                                          AUTO-GEN-SW
                                          MPLTINFO-UPD-AP9
               MOVE 2                  TO MPLTINFO-INV-LAST-ABST
               PERFORM 9-WRITE-MPLTINFO.

           IF MPLTINFO-INV-LAST-ABST IS NUMERIC
              SUBTRACT 2 FROM MPLTINFO-INV-LAST-ABST GIVING LAST-ABST
           ELSE
              MOVE 0 TO LAST-ABST.
           MOVE MPLTINFO-INVOICE-IND   TO AUTO-GEN-SW.
           IF MPLTINFO-UPD-AP9 = " "
               MOVE "N"                TO UPD-AP9-SW
           ELSE
               MOVE MPLTINFO-UPD-AP9   TO UPD-AP9-SW.

       9-READ-MPLTINFO.
           MOVE 0                      TO  COND-WORD.
           MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               NEXT SENTENCE
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "READ MPLTINFO ERROR IN 9-READ-MPLTINFO"
                                       TO  BU-DISPLAY-MSG
               MOVE MPLTINFO-ARG       TO  BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

       9-REWRITE-MPLTINFO.
           REWRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "REWRITE  ERROR IN 9-REWRITE-MPLTINFO"
                                       TO  BU-DISPLAY-MSG
               MOVE MPLTINFO-KEY       TO  BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

       9-WRITE-MPLTINFO.
           WRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "WRT MPLTINFO ERROR IN 9-WRITE-MPLTINFO"
                                       TO  BU-DISPLAY-MSG
               MOVE MPLTINFO-KEY       TO  BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

       COPY DISPCALL IN COPYLIB.
      *********************************************************
       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.
