000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    SPCSEPAY.
000400 AUTHOR.        CA YODER.
000500 DATE-WRITTEN.  OCTOBER 1995.
000600 DATE-COMPILED.
000700 INSTALLATION.  THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
000800*REMARKS.
000900**************************************************************
001000*                                                            *
001100*D   SPCSEPAY           EDI   PAYMENT TERMS SUBPROGRAM       *
001200*                                                            *
001300*D    THIS PROGRAM IS USED TO ADD/MODIFY/DELETE EDI CODES    *
001400*D    FOR PAYMENT TERMS.                                     *
001500*D                                                           *
      *D    ** COPIED FROM SEDIPAY AND MODIFIED **                 *
      *D                                                           *
001600*D    THIS PROGRAM IS CALLED BY:                             *
001700*D                      1.  SPCSPAYT                         *
001800*D                                                           *
001900**************************************************************
002000
002100 ENVIRONMENT DIVISION.
002200 CONFIGURATION SECTION.
002300 SOURCE-COMPUTER.  HP-3000.
002400 OBJECT-COMPUTER.  HP-3000.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZSTARTUP-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

            SELECT MPLTINFO-PK-O
                ASSIGN TO DATABASE-MCFLCS0501
                ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                FILE STATUS IS FILE-STATUS.
002500
002600 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                   PIC X(2000).

       FD  MPLTINFO-PK-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-PK-REC-O.
           COPY DDS-MCRPCS0500 OF MCFLCS0501.
002800
002700 WORKING-STORAGE SECTION.
002800
002900 77  WS-MODE                       PIC X(1)       VALUE " ".
003000     88 ADD-MODE                                  VALUE "A".
003100     88 MODIFY-MODE                               VALUE "M".
003200     88 DELETE-MODE                               VALUE "D".
003300 77  HANDLE-BLOWUP-FLAG            PIC X(1)       VALUE "Y".
003400 77  WS-EDI-INSTAL                 PIC X(1)       VALUE SPACES.
003500 77  PASSED-SPOOL-PRT              PIC S9(2) COMP VALUE 0.
       01  DISPLAY-STATUS                PIC XX.
       01  FILE-STATUS                   PIC XX.
003600 01  WS-EDI-PAY-CODE.
003700     05  WS-TMP-CODE               PIC X(1)       VALUE SPACES.
003800     05  WS-TMD-CODE               PIC X(1)       VALUE SPACES.
003900
004000 01  FMTD-PERCENTAGE-DISC.
           05  FPD-X.
004100         10  FMT-PER-DISC-INT      PIC 99.
004200         10  FMT-PER-DIS-FRAC      PIC 9(3).
           05  FPD-9 REDEFINES FPD-X     PIC 9(5).
004300*************************************************************
004400*************************************************************
004500**                                                         **
004600**              D A T A    B A S E    A R E A              **
004700**                                                         **
004800*************************************************************
004900*************************************************************
005000
005100 COPY MPLTINFO IN COPYLIB.
005200
005300 01  DSET-NAMES.
005400     05  DSET-NAME                 PIC X(16)  VALUE SPACES.
005500     05  DSET-MPLTINFO             PIC X(16)  VALUE "MPLTINFO;".
005600
005700 01  ARG-VALUES.
005800     05  MPLTINFO-ARG              PIC X(4)   VALUE SPACES.
005900     05  PLT-ARG                   PIC X(4)   VALUE SPACES.
006000
006100 01  SEARCH-ITEMS.
006200     05  ALL-ITEMS                 PIC X(2)  VALUE "@;".
006300
006400 01  DB-LOG-VALUES.
006500     05  DB-LOG-TEXT               PIC X(8)  VALUE "SPCSEPAY".
006600     05  DB-LOG-TEXT-LEN           PIC S9(4) COMP  VALUE -8.
006700
006800 01  MESSAGE-BUFLEN                PIC S9(4) COMP VALUE 78.
006900 01  MESSAGE-ACTLEN                PIC S9(4) COMP VALUE 78.
007000 01  MSG-ACTUALEN                  PIC S9(4) COMP VALUE 78.
007100 01  FIELD-NUMBER                  PIC S9(4) COMP VALUE 1.
007200
007300 01  MESSAGE-BUFFER.
007400     05  MSG-TEXT                  PIC X(66)  VALUE SPACES.
007500     05  MSG-FLD                   PIC X(12)  VALUE SPACES.
007600
006600 01  MESSAGE-BUFFER-1.
006700     05  MSG-TEXT-1                PIC X(66)  VALUE SPACES.
006800     05  MSG-FLD-1                 PIC X(12)  VALUE SPACES.
006900
007700 01  TMP-CODE-ARG.
007800     05  FILLER                    PIC X(3)   VALUE "TMP".
007900     05  TMP-CODE-IN               PIC X(1).
008000
008100 01  TMD-CODE-ARG.
008200     05  FILLER                    PIC X(3)   VALUE "TMD".
008300     05  TMD-CODE-IN               PIC X(1).
008400
008500 01  TM-CODE-ARG.
008600     05  FILLER                    PIC X(2)   VALUE "TM".
008700     05  TM-CODE-IN                PIC X(2)   VALUE SPACES.
008800
008900 01  DELETE-TMP-TMD                PIC X(3).
009000     88  DELETE-TMP                           VALUE "TMP".
009100     88  DELETE-TMD                           VALUE "TMD".
009200
009300 01  DISC-NUM-VALUE-FIGURES.
009400     05  DISC-PERCENT              PIC 9V9(4)  VALUE ZEROES.
009500     05  DISC-NUM-VALUE-OUT        PIC 99V99   VALUE ZEROES.
009600
009700 COPY DBMODES IN COPYLIB.
009800
009900 COPY DBSTAT IN COPYLIB.
010000
010100 COPY MULTLOCK IN COPYLIB.
010200
010300*************************************************************
010400*************************************************************
010500**                                                         **
010600**                 TERMINAL I/O DATA AREA                  **
010700**                                                         **
010800*************************************************************
010900*************************************************************
011000
011100 COPY FUNCTDEF IN COPYLIB.
011200
011300
011400 01  DE-FIELDS-1.
011500     05  WS-MESSAGE-LINE-HELP      PIC X(79).
           05  DE-COMMAND-LINE-1         PIC X(79).
011600
011700 01  DE-FIELDS-2.
011800     05  SCREEN-MODE               PIC X(35).
011900     05  EDI-PAY-CODE              PIC X(2).
012000     05  PAY-TERMS-TYPE            PIC X(2).
012100     05  PAY-TIME-REF              PIC X(3).
012200     05  TIME-RELATION             PIC X(2).
012300     05  TYPE-OF-PERIOD            PIC X(3).
012400     05  NO-OF-PERIODS             PIC 9(3).
           05  N-O-P-X REDEFINES NO-OF-PERIODS
                                         PIC X(3).
           05  NO-OF-PERIODS-P           PIC 9(3).
           05  N-O-P-P-X REDEFINES NO-OF-PERIODS
                                         PIC X(3).
012500     05  PERIOD-DISCOUNT.
012600         10  PERCENT-DISCOUNT-INT  PIC 9(2).
               10  P-D-I-X REDEFINES PERCENT-DISCOUNT-INT
                                         PIC X(2).
012700         10  PERCENT-DISCOUNT-FRAC PIC 9(3).
               10  P-D-F-X REDEFINES PERCENT-DISCOUNT-FRAC
                                         PIC X(3).
012800     05  PAYMENT-NET-DAYS          PIC 9(3).
           05  P-N-D-X REDEFINES PAYMENT-NET-DAYS
                                         PIC X(3).
012900     05  WS-MESSAGE-LINE           PIC X(79).
           05  DE-COMMAND-LINE-2         PIC X(79).
           05  DE-MESSAGE-LINE-2         PIC X(79).
013000
013100*************************************************************
013200*************************************************************
013300**                                                         **
013400**                 COMMUNICATIONS AREAS                    **
013500**                                                         **
013600*************************************************************
013700*************************************************************
013800
011100
       COPY CATREAD    IN COPYLIB.

       COPY IOFEEDBACK IN COPYLIB.

013900 COPY TSHWRDFM   IN COPYLIB.
014000***** NOTE THAT "TSCRPRT2" ALSO USES PASSED-SPOOL-PRT, *****
014100***** AND VIEW-COMAREA AS PARAMETERS IN ADDITION TO    *****
014200***** THOSE LISTED BELOW.                              *****
014300
014400 01  TSCRPRT2-PARAMETERS.
014500     05  TSCRPRT2-PRINTCNTL        PIC S9(4) COMP VALUE 0.
014600     05  TSCRPRT2-PAGECNTL         PIC S9(4) COMP VALUE 49.
014700     05  TSCRPRT2-SPOOLSW          PIC X(1)  VALUE "N".
014800
014900 01  TSCRPRT2-ERROR-SW             PIC X(1)  VALUE "N".
015000
015100 01  TSCRPRT2-DISPLAY-AREA.
015200     05     FILLER                 PIC X(2).
015300     05  TSCRPRT2-MSG              PIC X(27).
015400     05     FILLER                 PIC X(2).
015500     05  TSCRPRT2-STAT             PIC S9(4).
015600     05     FILLER                 PIC X(2).
015700     05  TSCRPRT2-FLD              PIC X(14).
015800     05     FILLER                 PIC X(2).
015900
016000 COPY TBLOWUP IN COPYLIB.
016100
       COPY WSCONTROL IN COPYLIB.
016200*************************************************************
016300*************************************************************
016400**                                                         **
016500**               LINKAGE   SECTION                         **
016600**                                                         **
016700*************************************************************
016800*************************************************************
016900
017000 LINKAGE SECTION.
017100
017200 01  BASE                          PIC X(10).
017300
017400 COPY VCOMLINK IN COPYLIB.
017500
017600 COPY LANGSUB  IN COPYLIB.
017700
017800
017900*************************************************************
018000**#########################################################**
018100*************************************************************
018200**                                                         **
018300**          P R O C E D U R E    D I V I S I O N           **
018400**                                                         **
018500*************************************************************
018600**#########################################################**
018700*************************************************************
018800
018900 PROCEDURE DIVISION USING BASE,
019000                          VIEW-COMAREA,
019100                          LANGUAGE-PARMS.
019200
019300 0-SBUYRCODE-SEC SECTION 1.
019400
019500 0-BEGIN-HERE.
019600     PERFORM 1-HSK.
019700     PERFORM 6-MAIN THRU 6-MAIN-X.
019800     PERFORM 2-EOJ.
019900
020000 1-HSK.
020100     MOVE "SPCSEPAY" TO BU-PGM-NAME.
017500     OPEN I-O DISPLAY-FILE, MPLTINFO-PK-O.
           PERFORM 9999-RESET-MPLTINFO-PK-O.
           MOVE "N"          TO WS-EDI-INSTAL.
020300     MOVE "EDI "       TO MPLTINFO-ARG PLT-ARG.
020400     PERFORM 9999-GETKEY-MPLTINFO-PK-O.
020500     IF  COND-WORD = 0
020600         IF  EDI-INSTAL = "Y"
020700             MOVE  "Y"  TO  WS-EDI-INSTAL.
           PERFORM 9999-RESET-MPLTINFO-PK-O.

021200 2-EOJ.
           CLOSE DISPLAY-FILE, MPLTINFO-PK-O.
021300     GOBACK.
021400
021500******************************************************
021600**                 BLOWUP ROUTINE                   **
021700******************************************************
021800
021900 2100-BLOWUP.
022000     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
022100           VIEW-COMAREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
022200           BU-DISPLAY-AREA.
022300
022400
024400**************************************************
024500*                                                *
024600*                  6 - M A I N                   *
024700*                                                *
024800**************************************************
024900 6-MAIN.
025000     MOVE "EPAYTERMSM" TO VIEW-NFNAME.
025100     PERFORM 9999-GETNEXTFORM.
025200
025300 6-PUT-WINDOW.
025400     MOVE SPACES TO MESSAGE-BUFFER.
025500     PERFORM 9999-PUTWINDOW.
025600
025700 6-SHOW-FORM.
025800     MOVE 4                  TO SRF-KEYSET.
025900     MOVE "I"                TO SRF-FKEY(7).
026000     PERFORM 9999-DO-SCREEN-1.
026100
026200     IF VIEW-LASTKEY = EXIT-PROGRAM
026300         GO TO 6-MAIN-X.
026400
026900     IF VIEW-LASTKEY = F1-KEY
027000        PERFORM  65-HELP-SCREEN THRU 65-HELP-SCREEN-X
027100        GO TO 6-MAIN
027200     ELSE
027300     IF VIEW-LASTKEY = F2-KEY
027400         MOVE  "A"  TO  WS-MODE
027500         PERFORM 61-ADD-EDI-PAYTERMS THRU 61-ADD-EDI-PAYTERMS-X
027600     ELSE
027700     IF VIEW-LASTKEY = F4-KEY
027800         MOVE  "M"  TO  WS-MODE
027900         PERFORM 62-MODIFY-EDI-PAYTERMS THRU
028000                 62-MODIFY-EDI-PAYTERMS-X
028100     ELSE
028200     IF VIEW-LASTKEY = F5-KEY
028300         MOVE  "D"  TO  WS-MODE
028400         PERFORM 63-DELETE-EDI-PAYTERMS THRU
028500                 63-DELETE-EDI-PAYTERMS-X.
028600
028700     GO TO 6-MAIN.
028800
028900 6-MAIN-X.
029000     EXIT.
029100
029200
029300 61-ADD-EDI-PAYTERMS.
029400     MOVE "EPAYTERMCD" TO VIEW-NFNAME.
029500     PERFORM 9999-GETNEXTFORM.
029600     MOVE SPACES                  TO DE-FIELDS-1 DE-FIELDS-2.
029700     MOVE "A  D  D    O  N  L  Y" TO SCREEN-MODE.
029800     PERFORM 99-GET-EDI-CODE THRU 99-GET-EDI-CODE-EXIT.
029900     IF  VIEW-LASTKEY = EXIT-PROGRAM
030000         GO TO 61-ADD-EDI-PAYTERMS-X.
030100 61-GET-EDI-ADD-FORM.
030200     MOVE "EPAYTERMSA"            TO VIEW-NFNAME.
030300     PERFORM 9999-GETNEXTFORM.
030400*** INPUT DATA ABOVE AND THEN PRESS ENTER
           MOVE 09020              TO CATREAD-MSG-NUMBER.
030700     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
030800     MOVE MESSAGE-BUFFER     TO WS-MESSAGE-LINE.
030900     MOVE SPACES             TO MESSAGE-BUFFER.
031000     PERFORM 9999-PUTWINDOW.
031100     MOVE 01                 TO PAY-TERMS-TYPE.
031200     MOVE 05                 TO PAY-TIME-REF.
031300     MOVE 03                 TO TIME-RELATION.
           MOVE ZEROES             TO NO-OF-PERIODS
                                      NO-OF-PERIODS-P
                                      PERCENT-DISCOUNT-INT
                                      PAYMENT-NET-DAYS.
031400     MOVE 6                  TO SRF-KEYSET.
031500     MOVE "I"                TO SRF-FKEY(7)
031600                                SRF-FKEY(2).
031700*    MOVE " AFE"             TO SRF-FKEY(1).
031800 61-ADD-EDI-ACCEPT-SCREEN.
031900     PERFORM 9999-DO-SCREEN-2.
032000
032100     IF VIEW-LASTKEY = EXIT-PROGRAM
032200         GO TO 61-ADD-EDI-PAYTERMS-X.
032300
032800     IF VIEW-LASTKEY = F1-KEY
032900         PERFORM 65-HELP-SCREEN THRU 65-HELP-SCREEN-X
033000         GO TO 61-GET-EDI-ADD-FORM.
033100
033200     IF VIEW-LASTKEY = ENTER-KEY
033300        PERFORM 99-MOVE-SCREEN1-TO-BUFFER
033400        MOVE DSET-MPLTINFO           TO DSET-NAME
033500        PERFORM 9999-DSET-LOCK
033600        PERFORM 9999-PUT-MPLTINFO-PK-O
033700        PERFORM 9999-UNLOCK.
033800
033900     GO TO 61-ADD-EDI-PAYTERMS.
034000
034100 61-ADD-EDI-PAYTERMS-X.
034200     EXIT.
034300
034400 62-MODIFY-EDI-PAYTERMS.
034500     MOVE "EPAYTERMCD"               TO VIEW-NFNAME.
034600     PERFORM 9999-GETNEXTFORM.
034700     MOVE SPACES                     TO DE-FIELDS-1 DE-FIELDS-2.
034800     MOVE "M  O  D  I  F  Y    O  N  L  Y" TO SCREEN-MODE.
034900     PERFORM 99-GET-EDI-CODE THRU 99-GET-EDI-CODE-EXIT.
035000     IF  VIEW-LASTKEY = EXIT-PROGRAM
035100         GO TO 62-MODIFY-EDI-PAYTERMS-X.
035200 62-GET-EDI-MODIFY-FORM.
035300     MOVE "EPAYTERMSA"               TO VIEW-NFNAME.
035400     PERFORM 9999-GETNEXTFORM.
           MOVE 09020                      TO CATREAD-MSG-NUMBER.
035500*** INPUT DATA ABOVE AND THEN PRESS ENTER
035800     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
035900     MOVE MESSAGE-BUFFER             TO WS-MESSAGE-LINE.
036000     MOVE SPACES                     TO MESSAGE-BUFFER.
036100     PERFORM 9999-PUTWINDOW.
036200     PERFORM 99-MOVE-BUFFER-TO-SCREEN1.
036300     MOVE 6                          TO SRF-KEYSET.
036400     MOVE "I"                        TO SRF-FKEY(7)
036500                                        SRF-FKEY(2).
036600*    MOVE " AFE"                     TO SRF-FKEY(1).
036700 62-MODIFY-EDI-ACCEPT-SCREEN.
036800     PERFORM 9999-DO-SCREEN-2.
036900
037000     IF VIEW-LASTKEY = EXIT-PROGRAM
037100         GO TO 62-MODIFY-EDI-PAYTERMS-X.
037200
037700     IF VIEW-LASTKEY = F1-KEY
037800         PERFORM 65-HELP-SCREEN THRU 65-HELP-SCREEN-X
037900         GO TO 62-GET-EDI-MODIFY-FORM.
038000
038100     IF VIEW-LASTKEY = ENTER-KEY
038200        MOVE SPACES                 TO BUF-MPLTINFO
038300        PERFORM 99-MOVE-SCREEN1-TO-BUFFER
038400        MOVE DSET-MPLTINFO          TO DSET-NAME
038500        PERFORM 9999-DSET-LOCK
038600        PERFORM 9999-UPDATE-MPLTINFO-PK-O
038700        PERFORM 9999-UNLOCK.
038800
038900     GO TO 62-MODIFY-EDI-PAYTERMS.
039000
039100 62-MODIFY-EDI-PAYTERMS-X.
039200     EXIT.
039300
039400 63-DELETE-EDI-PAYTERMS.
039500     MOVE "EPAYTERMCD"              TO VIEW-NFNAME.
039600     PERFORM 9999-GETNEXTFORM.
039700     MOVE SPACES                    TO DE-FIELDS-1 DE-FIELDS-2.
039800     MOVE "D  E  L  E  T  E    O  N  L  Y" TO SCREEN-MODE.
039900     PERFORM 99-GET-EDI-CODE THRU 99-GET-EDI-CODE-EXIT.
040000     IF  VIEW-LASTKEY = EXIT-PROGRAM
040100         GO TO 63-DELETE-EDI-PAYTERMS-X.
040200 63-GET-EDI-DELETE-FORM.
040300     MOVE "EPAYTERMSD"              TO VIEW-NFNAME.
040400     PERFORM 9999-GETNEXTFORM.
           MOVE 16082                     TO CATREAD-MSG-NUMBER.
040500***  PRESS 'f2' TO DELETE OR 'f8' TO EXIT (LEAVE UNCHANGED)  ***
040800     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
040900     MOVE MESSAGE-BUFFER            TO WS-MESSAGE-LINE.
041000     MOVE SPACES                    TO MESSAGE-BUFFER.
041100     PERFORM 9999-PUTWINDOW.
041200     PERFORM 99-MOVE-BUFFER-TO-SCREEN1.
041300     MOVE 6                         TO SRF-KEYSET.
041400     MOVE "I"                       TO SRF-FKEY(7)
041500                                       SRF-FKEY(1).
041600 63-DELETE-EDI-ACCEPT-SCREEN.
041700     PERFORM 9999-DO-SCREEN-2.
041800
041900     IF VIEW-LASTKEY = EXIT-PROGRAM
042000         GO TO 63-DELETE-EDI-PAYTERMS-X.
042100
042600     IF VIEW-LASTKEY = F2-KEY
042700        MOVE DSET-MPLTINFO          TO DSET-NAME
042800        PERFORM 9999-DSET-LOCK
042900        PERFORM 9999-DELETE-MPLTINFO-PK-O
043000        PERFORM 9999-UNLOCK.
043100
043200     GO TO 63-DELETE-EDI-PAYTERMS.
043300
043400 63-DELETE-EDI-PAYTERMS-X.
043500     EXIT.
043600
043700 65-HELP-SCREEN.
043800     MOVE "HELP6"                   TO VIEW-NFNAME.
043900     PERFORM 9999-GETNEXTFORM.
044000     MOVE SPACES                    TO DE-FIELDS-1.
044100 65-PUT-WINDOW.
044200     MOVE SPACES                    TO MESSAGE-BUFFER.
044300     PERFORM 9999-PUTWINDOW.
044400
044500 65-SHOW-FORM.
044600     MOVE 8                         TO SRF-KEYSET.
044700     MOVE "I"                       TO SRF-FKEY(7).
044800     PERFORM 9999-DO-SCREEN-1.
044900
045300 65-HELP-SCREEN-X.
045400     EXIT.
045500
       999-CATREAD.
           MOVE SPACES                    TO MESSAGE-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT          TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.    EXIT.
047500
047600 99-GET-EDI-CODE.
047700     MOVE 8                         TO SRF-KEYSET.
047800     MOVE "I"                       TO SRF-FKEY(7).
047900     PERFORM 9999-DO-SCREEN-2.
048000
048100     IF VIEW-LASTKEY = EXIT-PROGRAM
048200         GO TO 99-GET-EDI-CODE-EXIT.
048300
048800     MOVE EDI-PAY-CODE             TO WS-EDI-PAY-CODE TM-CODE-IN.
048900     MOVE WS-TMP-CODE               TO TMP-CODE-IN.
049000     MOVE WS-TMD-CODE               TO TMD-CODE-IN.
049100
049200     MOVE TMP-CODE-ARG              TO MPLTINFO-ARG, PLT-ARG.
049300     PERFORM 9999-GETKEY-MPLTINFO-PK-O.
049400     IF  COND-WORD = 17
               MOVE 03192                 TO CATREAD-MSG-NUMBER
049500*    CSIS CODES DOES NOT EXIST
049800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
049900         MOVE MESSAGE-BUFFER        TO WS-MESSAGE-LINE
050000         MOVE SPACES                TO MESSAGE-BUFFER
050100         GO TO 99-GET-EDI-CODE.
050200
050300     MOVE TMD-CODE-ARG   TO MPLTINFO-ARG, PLT-ARG.
050400     PERFORM 9999-GETKEY-MPLTINFO-PK-O.
050500     IF  COND-WORD = 17
               MOVE 03192                 TO CATREAD-MSG-NUMBER
050600*    CSIS CODES DOES NOT EXIST
050900         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
051000         MOVE MESSAGE-BUFFER        TO WS-MESSAGE-LINE
051100         MOVE SPACES                TO MESSAGE-BUFFER
051200         GO TO 99-GET-EDI-CODE.
051300
051400     MOVE TM-CODE-ARG               TO MPLTINFO-ARG, PLT-ARG.
051500     PERFORM 9999-GETKEY-MPLTINFO-PK-O.
051600     IF  COND-WORD = 0
051700         IF  MODIFY-MODE OR DELETE-MODE
051800             NEXT SENTENCE
051900         ELSE
               MOVE 05053                 TO CATREAD-MSG-NUMBER
052000*EDI CODES EXIST CANNOT ADD
052300         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
052400         MOVE MESSAGE-BUFFER        TO WS-MESSAGE-LINE
052500         MOVE SPACES                TO MESSAGE-BUFFER
052600         GO TO 99-GET-EDI-CODE
052700     ELSE
052800     IF  MODIFY-MODE OR DELETE-MODE
               MOVE 05054                 TO CATREAD-MSG-NUMBER
052900*EDI CODES DOES NOT EXIST CANNOT MODIFY OR DELETE
053200         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
053300         MOVE MESSAGE-BUFFER        TO WS-MESSAGE-LINE
053400         MOVE SPACES                TO MESSAGE-BUFFER
053500         GO TO 99-GET-EDI-CODE
053600     ELSE
053700     NEXT SENTENCE.
053800
053900 99-GET-EDI-CODE-EXIT.
054000     EXIT.
054100
054200 99-MOVE-SCREEN1-TO-BUFFER.
054300     MOVE TM-CODE-ARG               TO MPLTINFO-KEY.
054400     MOVE PAY-TERMS-TYPE            TO MPLTINFO-PAY-TERMS-TYPE.
054500     MOVE PAY-TIME-REF              TO MPLTINFO-PAY-TIME-REF.
054600     MOVE TIME-RELATION             TO MPLTINFO-TIME-RELATION.
054700     MOVE TYPE-OF-PERIOD            TO MPLTINFO-TYPE-OF-PERIOD.
           IF N-O-P-X = "   "
               MOVE ZEROES                TO MPLTINFO-NO-OF-PERIODS
           ELSE
054800     MOVE NO-OF-PERIODS             TO MPLTINFO-NO-OF-PERIODS.
           IF N-O-P-P-X = "   "
               MOVE ZEROES                TO MPLTINFO-NO-OF-PERIODS-P
           ELSE
           MOVE NO-OF-PERIODS-P           TO MPLTINFO-NO-OF-PERIODS-P.
           IF P-D-I-X = "  "
               MOVE ZEROES                TO FMT-PER-DISC-INT
           ELSE
054900     MOVE PERCENT-DISCOUNT-INT      TO FMT-PER-DISC-INT.
           IF P-D-I-X = "   "
               MOVE ZEROES                TO FMT-PER-DIS-FRAC
           ELSE
055000     MOVE PERCENT-DISCOUNT-FRAC     TO FMT-PER-DIS-FRAC.
055100     MOVE FPD-9                     TO MPLTINFO-PERCENT-DISCOUNT.
           IF P-N-D-X = "   "
               MOVE ZEROES                TO MPLTINFO-PAYMENT-NET-DAYS
           ELSE
055200     MOVE PAYMENT-NET-DAYS          TO MPLTINFO-PAYMENT-NET-DAYS.
055300
055400 99-MOVE-BUFFER-TO-SCREEN1.
055500     MOVE MPLTINFO-PAY-TERMS-TYPE   TO PAY-TERMS-TYPE.
055600     MOVE MPLTINFO-PAY-TIME-REF     TO PAY-TIME-REF.
055700     MOVE MPLTINFO-TIME-RELATION    TO TIME-RELATION.
055800     MOVE MPLTINFO-TYPE-OF-PERIOD   TO TYPE-OF-PERIOD.
055900     MOVE MPLTINFO-NO-OF-PERIODS    TO NO-OF-PERIODS.
           MOVE MPLTINFO-NO-OF-PERIODS-P  TO NO-OF-PERIODS-P.
056000     MOVE MPLTINFO-PERCENT-DISCOUNT TO FPD-9.
056100     MOVE FMT-PER-DISC-INT          TO PERCENT-DISCOUNT-INT.
056200     MOVE FMT-PER-DIS-FRAC          TO PERCENT-DISCOUNT-FRAC.
056300     MOVE MPLTINFO-PAYMENT-NET-DAYS TO PAYMENT-NET-DAYS.
056400
       9999-GETKEY-MPLTINFO-PK-O.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-O.
           READ MPLTINFO-PK-O INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MPLTINFO-PK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-RESET-MPLTINFO-PK-O.
           MOVE HIGH-VALUES TO PLTINFOKEY OF MPLTINFO-PK-REC-O.
           START MPLTINFO-PK-O KEY > PLTINFOKEY OF MPLTINFO-PK-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-DELETE-MPLTINFO-PK-O.
           MOVE 0 TO COND-WORD.
           DELETE MPLTINFO-PK-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "DELETE ERR 9999-DELETE-MPLTINFO-PK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-PUT-MPLTINFO-PK-O.
           MOVE 0 TO COND-WORD.
           WRITE MPLTINFO-PK-REC-O FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-MPLTINFO-PK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

056800 COPY MLOCKCAL IN COPYLIB.
056900 COPY UNLOCK   IN COPYLIB.
057000 COPY DLOCKCAL IN COPYLIB.
057100 COPY SCRNCALL IN COPYLIB.
057200 COPY SCRNCL1  IN COPYLIB.
057300 COPY SCRNCL2  IN COPYLIB.
       9999-UPDATE-MPLTINFO-PK-O.
           MOVE 0 TO COND-WORD.
           REWRITE MPLTINFO-PK-REC-O FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "UPDATE ERR 9999-UPDATE-MPLTINFO-PK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

