       IDENTIFICATION DIVISION.
       PROGRAM-ID.     SPCSPURO.
       AUTHOR.         CA YODER.
       INSTALLATION.   THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
       DATE-WRITTEN.   OCTOBER 1995.
       DATE-COMPILED.
      *REMARKS.
      *D***********************************************************
      *D*                                                         *
      *D*  SPCSPURO    PURCHASING USER OPTIONS SUBPROGRAM         *
      *D*                                                         *
      *D*  ** COPIED FROM SUSEROPT AND MODIFIED **                *
      *D*                                                         *
      *D*  CALLED BY:  SPUROPT                                    *
      *D*                                                         *
      *D***********************************************************
      *
      *C*  4/02/1997   CA YODER   REQ #6651
      *C*    ADDED SWITCH TO ALLOW A PLANT TO SPECIFY IF SPECIAL
      *C*    PRINT CHARACTERS SHOULD BE USED IN PURCHASE ORDER
      *C*    PRINTOUTS.
      *C*
      *C*  8/18/1997   CA YODER
      *C*    ADDED SWITCH TO SPECIFY IF ERRORS FROM TLOADPO SHOULD
      *C*    BE WRITTEN TO MCFPPOFILE FOR RE-PROCESSING USING ATM
      *C*    FUNCTION.
      *C*
      *C*  9/20/1999   CA YODER
      *C*    ADDED SWITCH TO INDICATE IF PS2 SHOULD VERIFY THAT
      *C*    RELEASES MEET THE VENDOR'S MINIMUM ORDER VALUE.  THE
      *C*    NUMBER OF DAYS THAT THE RELEASE SHOULD REMAIN IN THE
      *C*    BATCH FILE BEFORE AN ERROR MESSAGE IS PRINTED CAN
      *C*    ALSO BE SPECIFIED.
      *C*
      *C*  10/31/2000  CA YODER     UNC REQUEST
      *C*    ADDED OPTION TO SPECIFY AN ISO PROCEDURE NUMBER FOR
      *C*    THE ON-TIME DELIVERY TRACKING REPORT.
      *C*
      *C*  10/01/2003  CA YODER     TMS REQUEST
      *C*    ADDED OPTION TO INDICATE IF THE LAST ITEM ON A PO CAN
      *C*    BE REMOVED THROUGH THE ITEM DELETE SCREEN IN PU1.
      *C*

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT DISPLAY-FILE
                   ASSIGN TO WORKSTATION-ZSTARTUP-SI
                   ORGANIZATION IS TRANSACTION
                   ACCESS IS SEQUENTIAL
                   FILE STATUS IS DISPLAY-STATUS
                   CONTROL-AREA IS WS-CONTROL.
            SELECT MPLTINFO-O
                   ASSIGN TO DATABASE-MCFLCS0501
                   ORGANIZATION IS INDEXED
                   ACCESS IS DYNAMIC
                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   FILE STATUS IS FILE-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                   PIC X(2000).
       FD  MPLTINFO-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-O-REC.
           COPY DDS-MCRPCS0500 OF MCFLCS0501.

       WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X VALUE SPACE.
           05  FILE-STATUS-2             PIC X VALUE SPACE.

      *************************************************************
      **                                                         **
      **           P R O G R A M   V A R I A B L E S             **
      **                                                         **
      *************************************************************
       77  LINE-NO                       PIC 9(2)  VALUE 1.

       01  REPLACE-SW                    PIC X(1).
           88  REPLACE-SW-ON          VALUE "Y".

      *************************************************************
      **                                                         **
      **              D A T A    B A S E    A R E A              **
      **                                                         **
      *************************************************************
       COPY MPLTINFO IN COPYLIB.
       COPY MPLTST   IN COPYLIB.
       01  MPLTINFO-ARG                  PIC X(4).
       COPY DBSTAT IN COPYLIB.

      *************************************************************
      **                                                         **
      **              V I E W   W O R K   A R E A                **
      **                                                         **
      *************************************************************
       01  MESSAGE-BUFFER.
           05  MSG-TEXT                  PIC X(64)  VALUE SPACES.
           05  MSG-FLD                   PIC X(12)  VALUE SPACES.
           05  MSG-FLD-9 REDEFINES MSG-FLD
                                         PIC Z(11)9.

      *************************************************************
      **                                                         **
      **                 TERMINAL I/O DATA AREA                  **
      **                                                         **
      *************************************************************
       01  USER-OPTION-SCREEN.
           05  BUYER-REDISPLAY-SW        PIC X(1).
           05  SW-VENDOR-ADDR-SW         PIC X(1).
           05  CUR-CODE-REQUIRED-SW      PIC X(1).
           05  MATCONT-COMP-PO-SW        PIC X(1).
           05  PO-COMPARE-PRICE-SW       PIC X(1).
           05  PO-COMPARE-PERCENT        PIC 9V99.
           05  REQ-PRINT-MANUF-SW        PIC X(1).
           05  S1-CMDLINE                PIC X(79).
           05  S1-MSGLINE                PIC X(79).

       01  USER-OPTION-SCREEN2.
           05  ADDTL-DATA-SW             PIC X(1).
           05  ACTIVE-NWO-SW             PIC X.
           05  COMP-PRIME-PO-SW          PIC X(1).
           05  CHAT-PURCH-REQUIRED-SW    PIC X(1).
           05  NUM-MONTHS                PIC 9(2).
           05  LOADPO-VEN                PIC X(10).
           05  ORDER-COST                PIC 9(6).
           05  PO-PRINT-ASCII-SW         PIC X(1).
           05  TLOADPO-ERR-SW            PIC X(1).
           05  S2-CMDLINE                PIC X(79).
           05  S2-MSGLINE                PIC X(79).

       01  USER-OPTION-SCREEN3.
           05  CHECK-RLS-VAL             PIC X(1).
           05  RLS-VAL-DAYS              PIC 9(2).
           05  DOC-NUM                   PIC X(15).
           05  DELETE-LAST-ITEM-SW       PIC X(1).
           05  S3-CMDLINE                PIC X(79).
           05  S3-MSGLINE                PIC X(79).

      *************************************************************
      **                                                         **
      **         S U B P R O G R A M   A R E A S                 **
      **                                                         **
      *************************************************************
       COPY TBLOWUP  IN COPYLIB.
       COPY CATREAD  IN COPYLIB.
       COPY DISPDATA IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.

       LINKAGE SECTION.

       01  BASE                          PIC X(10).
       COPY VCOMLINK IN COPYLIB.
       COPY LANGSUB  IN COPYLIB.

      *************************************************************
      **#########################################################**
      *************************************************************
      **                                                         **
      **          P R O C E D U R E    D I V I S I O N           **
      **                                                         **
      *************************************************************
      **#########################################################**
      *************************************************************

       PROCEDURE DIVISION  USING BASE,
                                 VIEW-COMAREA,
                                 LANGUAGE-PARMS.

       1-START.
           OPEN I-O DISPLAY-FILE, MPLTINFO-O.
           PERFORM 60-SCREEN1  THRU 60-SCREEN-X.
           IF VIEW-LASTKEY NOT = 3
               PERFORM 61-SCREEN2  THRU 61-SCREEN2-X.
           IF VIEW-LASTKEY NOT = 3
               PERFORM 62-SCREEN3  THRU 62-SCREEN3-X.
           CLOSE DISPLAY-FILE, MPLTINFO-O.
           GOBACK.

      ******************************************************
      **                 BLOWUP ROUTINE                   **
      ******************************************************
       2-BLOWUP.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
               BU-DISPLAY-AREA.

      **************************************************
      *                                                *
      *         M A I N    P R O C E S S I N G         *
      *                                                *
      **************************************************

       60-SCREEN1.
           MOVE "PUROPT1"              TO  VIEW-NFNAME.
           MOVE SPACES                 TO  USER-OPTION-SCREEN.
           PERFORM 601-READ-MPLTINFO.

       60-SHOW-FORM.
           MOVE USER-OPTION-SCREEN     TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC            TO  USER-OPTION-SCREEN.
           IF VIEW-LASTKEY = 3
               GO TO 60-SCREEN-X.
           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9                TO  LANG-SETNUM
               MOVE  10                TO  LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER     TO  S2-MSGLINE
               MOVE B"1"               TO  IND(99)
               GO TO 60-SHOW-FORM.

       60-REPLACE-MPLTINFO.
           MOVE "POPT"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           MOVE BUYER-REDISPLAY-SW     TO MPLTINFO-BUYER-REDISPLAY-SW.
           IF SW-VENDOR-ADDR-SW = "R"
               MOVE "Y"                TO  MPLTINFO-SW-VENDOR-ADDR-SW
           ELSE
               MOVE "N"                TO MPLTINFO-SW-VENDOR-ADDR-SW.
           MOVE CUR-CODE-REQUIRED-SW TO MPLTINFO-CUR-CODE-REQUIRED-SW.
           MOVE MATCONT-COMP-PO-SW     TO MPLTINFO-MATCONT-COMP-PO-SW.
           MOVE PO-COMPARE-PRICE-SW    TO MPLTINFO-PO-COMPARE-PRICE-SW.
           IF PO-COMPARE-PRICE-SW = "N"
               MOVE ZEROS              TO MPLTINFO-PO-COMPARE-PERCENT
           ELSE
               MOVE PO-COMPARE-PERCENT TO MPLTINFO-PO-COMPARE-PERCENT.
           MOVE REQ-PRINT-MANUF-SW     TO MPLTINFO-REQ-PRINT-MANUF-SW.
           PERFORM 9-REWRITE-MPLTINFO.

       60-SCREEN-X.
           EXIT.

       601-READ-MPLTINFO.
           MOVE "POPT"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           IF FILE-STATUS-1 = "2"
               MOVE SPACES             TO BUF-MPLTINFO
               MOVE "POPT"             TO MPLTINFO-KEY
               MOVE "Y"                TO MPLTINFO-BUYER-REDISPLAY-SW
               MOVE "N"                TO MPLTINFO-SW-VENDOR-ADDR-SW
               MOVE "N"                TO MPLTINFO-CUR-CODE-REQUIRED-SW
9210CK         MOVE "N"                TO MPLTINFO-MATCONT-COMP-PO-SW
               MOVE "N"                TO MPLTINFO-PO-COMPARE-PRICE-SW
               MOVE ZEROS              TO MPLTINFO-PO-COMPARE-PERCENT
               MOVE "N"                TO MPLTINFO-REQ-PRINT-MANUF-SW
               MOVE "Y"                TO MPLTINFO-ADDTL-DATA-EDIT-SW
               PERFORM 9-WRITE-MPLTINFO.

           IF MPLTINFO-BUYER-REDISPLAY-SW = "N"
               MOVE "N"                TO  BUYER-REDISPLAY-SW
           ELSE
               MOVE "Y"                TO  BUYER-REDISPLAY-SW.

           IF MPLTINFO-SW-VENDOR-ADDR-SW = "Y"
               MOVE "R"                TO  SW-VENDOR-ADDR-SW
           ELSE
               MOVE "L"                TO  SW-VENDOR-ADDR-SW.

           IF MPLTINFO-CUR-CODE-REQUIRED-SW = "Y"
               MOVE "Y"                TO  CUR-CODE-REQUIRED-SW
           ELSE
               MOVE "N"                TO  CUR-CODE-REQUIRED-SW.

           IF MPLTINFO-MATCONT-COMP-PO-SW = "Y"
               MOVE "Y"                TO  MATCONT-COMP-PO-SW
           ELSE
               MOVE "N"                TO  MATCONT-COMP-PO-SW.

           IF MPLTINFO-PO-COMPARE-PRICE-SW = "Y"
               MOVE "Y"                TO  PO-COMPARE-PRICE-SW
               MOVE MPLTINFO-PO-COMPARE-PERCENT TO PO-COMPARE-PERCENT
           ELSE
               MOVE "N"                TO  PO-COMPARE-PRICE-SW
               MOVE ZEROS              TO  PO-COMPARE-PERCENT.

           IF MPLTINFO-REQ-PRINT-MANUF-SW = "Y"
               MOVE "Y"                TO  REQ-PRINT-MANUF-SW
           ELSE
               MOVE "N"                TO  REQ-PRINT-MANUF-SW.

      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO PLTINFOKEY OF MPLTINFO-O-REC.
           START MPLTINFO-O KEY > PLTINFOKEY OF MPLTINFO-O-REC
               INVALID KEY MOVE "00"     TO  FILE-STATUS.


       61-SCREEN2.
           MOVE "PUROPT2"              TO  VIEW-NFNAME.
           MOVE SPACES                 TO  USER-OPTION-SCREEN2.
           PERFORM 611-READ-MPLTINFO.

       61-SHOW-FORM.
           MOVE USER-OPTION-SCREEN2    TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC            TO  USER-OPTION-SCREEN2.
           IF VIEW-LASTKEY = 3
               GO TO 61-SCREEN2-X.
           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9                TO  LANG-SETNUM
               MOVE  10                TO  LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER     TO  S2-MSGLINE
               MOVE B"1"               TO  IND(99)
               GO TO 61-SHOW-FORM.

       61-REPLACE-MPLTINFO.
           MOVE "POPT"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           MOVE ADDTL-DATA-SW          TO  MPLTINFO-ADDTL-DATA-EDIT-SW.
           MOVE LOADPO-VEN             TO  MPLTINFO-LOADPO-VEN.
           MOVE PO-PRINT-ASCII-SW      TO  MPLTINFO-ASCII-PO-PRNTS.
           PERFORM 9-REWRITE-MPLTINFO.

           MOVE "PODL"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           MOVE ACTIVE-NWO-SW          TO  MPLTINFO-NWACTIVE-SW.
           MOVE NUM-MONTHS             TO  MPLTINFO-SREL-DEL-MTH.
           MOVE TLOADPO-ERR-SW         TO  MPLTINFO-TLOADPO-ERR-SW.
           MOVE DELETE-LAST-ITEM-SW    TO  MPLTINFO-LAST-ITEM-SW.
           PERFORM 9-REWRITE-MPLTINFO.

           MOVE "PCPO"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           MOVE COMP-PRIME-PO-SW       TO  MPLTINFO-PCPO-SW.
           PERFORM 9-REWRITE-MPLTINFO.

           MOVE "CHAT"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           MOVE CHAT-PURCH-REQUIRED-SW TO  MPLTINFO-CHAT-PURCH-REQUIRED.
           PERFORM 9-REWRITE-MPLTINFO.

           MOVE "P 20"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           MOVE ORDER-COST             TO  MPLTINFO-EXP-ORDER-COST.
           MOVE ZEROS                  TO  MPLTINFO-ORDER-COST.
           PERFORM 9-REWRITE-MPLTINFO.

       61-SCREEN2-X.
           EXIT.

       611-READ-MPLTINFO.
           MOVE "POPT"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           IF FILE-STATUS-1 = "2"
               MOVE SPACES             TO BUF-MPLTINFO
               MOVE "POPT"             TO MPLTINFO-KEY
               MOVE "Y"                TO MPLTINFO-BUYER-REDISPLAY-SW
               MOVE "N"                TO MPLTINFO-SW-VENDOR-ADDR-SW
               MOVE "N"                TO MPLTINFO-CUR-CODE-REQUIRED-SW
               MOVE "N"                TO MPLTINFO-MATCONT-COMP-PO-SW
               MOVE "N"                TO MPLTINFO-PO-COMPARE-PRICE-SW
               MOVE ZEROS              TO MPLTINFO-PO-COMPARE-PERCENT
               MOVE "N"                TO MPLTINFO-REQ-PRINT-MANUF-SW
               MOVE "Y"                TO MPLTINFO-ADDTL-DATA-EDIT-SW
               MOVE SPACES             TO MPLTINFO-LOADPO-VEN
               MOVE "Y"                TO MPLTINFO-ASCII-PO-PRNTS
               PERFORM 9-WRITE-MPLTINFO.

           IF MPLTINFO-ADDTL-DATA-EDIT-SW = "N"
               MOVE "N"                TO  ADDTL-DATA-SW
           ELSE
               MOVE "Y"                TO  ADDTL-DATA-SW.

           IF MPLTINFO-LOADPO-VEN NOT = SPACES
               MOVE MPLTINFO-LOADPO-VEN   TO  LOADPO-VEN
           ELSE
               MOVE SPACES                TO  LOADPO-VEN.

           IF MPLTINFO-ASCII-PO-PRNTS NOT = SPACES
               MOVE MPLTINFO-ASCII-PO-PRNTS   TO  PO-PRINT-ASCII-SW
           ELSE
               MOVE "Y"                       TO  PO-PRINT-ASCII-SW.

           MOVE "PODL"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           IF FILE-STATUS-1 = "2"
               MOVE SPACES             TO BUF-MPLTINFO
               MOVE "PODL"             TO MPLTINFO-KEY
               MOVE 2                  TO MPLTINFO-INV-LAST-ABST
               PERFORM 9-WRITE-MPLTINFO.

           IF MPLTINFO-NWACTIVE-SW = "Y"
               MOVE "Y"                TO ACTIVE-NWO-SW
           ELSE
               MOVE "N"                TO ACTIVE-NWO-SW.

      *------ NUMBER OF MONTHS TO KEEP SHIPPING RELEASE AUDIT DATA.
      *------ IF THE FIELD DOESN'T EXIST, DEFAULT TO 6 MONTHS.
           IF MPLTINFO-SREL-DEL-MTH NUMERIC AND
                  MPLTINFO-SREL-DEL-MTH NOT = ZERO
               MOVE MPLTINFO-SREL-DEL-MTH  TO NUM-MONTHS
           ELSE
               MOVE 06                     TO NUM-MONTHS.

      *------ TLOADPO ERROR TO HOLD FILE SWITCH.
           IF MPLTINFO-TLOADPO-ERR-SW NOT = SPACES
               MOVE MPLTINFO-TLOADPO-ERR-SW   TO  TLOADPO-ERR-SW
           ELSE
               MOVE "N"                       TO  TLOADPO-ERR-SW.

      *------ DELETE LAST PO ITEM SWITCH.
           IF MPLTINFO-LAST-ITEM-SW NOT = SPACES
               MOVE MPLTINFO-LAST-ITEM-SW     TO  DELETE-LAST-ITEM-SW
           ELSE
               MOVE "Y"                       TO  DELETE-LAST-ITEM-SW.

           MOVE "PCPO"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           IF FILE-STATUS-1 = "2"
               MOVE SPACES             TO  BUF-MPLTINFO
               MOVE "PCPO"             TO  MPLTINFO-KEY
               MOVE "N"                TO  MPLTINFO-PCPO-SW
               PERFORM 9-WRITE-MPLTINFO
           ELSE
           MOVE MPLTINFO-PCPO-SW       TO  COMP-PRIME-PO-SW.

           MOVE "CHAT"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           IF FILE-STATUS-1 = "2"
               MOVE SPACES             TO  BUF-MPLTINFO
               MOVE "CHAT"             TO  MPLTINFO-KEY
               MOVE "N"                TO  MPLTINFO-CHAT-PURCH-REQUIRED
                                           CHAT-PURCH-REQUIRED-SW
               MOVE "Y"                TO  MPLTINFO-CHAT-RCVG-REQUIRED
               PERFORM 9-WRITE-MPLTINFO
           ELSE
           MOVE MPLTINFO-CHAT-PURCH-REQUIRED TO  CHAT-PURCH-REQUIRED-SW.

           MOVE "P 20"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           IF FILE-STATUS-1 = "2"
               MOVE SPACES             TO  BUF-MPLTINFO
               MOVE "P 20"             TO  MPLTINFO-KEY
               MOVE ZEROS              TO  MPLTINFO-ORDER-COST
                                           MPLTINFO-EXP-ORDER-COST
               MOVE ZEROS              TO  ORDER-COST
               PERFORM 9-WRITE-MPLTINFO
           ELSE
               IF MPLTINFO-ORDER-COST  = ZEROS
                   MOVE MPLTINFO-EXP-ORDER-COST TO ORDER-COST
               ELSE
                   MOVE MPLTINFO-ORDER-COST     TO ORDER-COST
               END-IF
           END-IF.

      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO PLTINFOKEY OF MPLTINFO-O-REC.
           START MPLTINFO-O KEY > PLTINFOKEY OF MPLTINFO-O-REC
               INVALID KEY MOVE "00"   TO  FILE-STATUS.

       62-SCREEN3.
           MOVE "PUROPT3"              TO  VIEW-NFNAME.
           INITIALIZE USER-OPTION-SCREEN3.
           PERFORM 621-READ-MPLTINFO.

       62-SHOW-FORM.
           MOVE USER-OPTION-SCREEN3    TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC            TO  USER-OPTION-SCREEN3.
           IF VIEW-LASTKEY = 3
               GO TO 62-SCREEN3-X.
           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9                TO  LANG-SETNUM
               MOVE  10                TO  LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER     TO  S3-MSGLINE
               MOVE B"1"               TO  IND(99)
               GO TO 62-SHOW-FORM.

       62-REPLACE-MPLTINFO.
           MOVE "PODL"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           MOVE CHECK-RLS-VAL          TO  MPLTINFO-CHECK-RLS-VAL.
           MOVE RLS-VAL-DAYS           TO  MPLTINFO-RLS-VAL-DAYS.
           MOVE DELETE-LAST-ITEM-SW    TO  MPLTINFO-LAST-ITEM-SW.
           PERFORM 9-REWRITE-MPLTINFO.

           MOVE "ISO "                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           MOVE DOC-NUM                TO  ISO-DOC-NUM.
           PERFORM 9-REWRITE-MPLTINFO.

       62-SCREEN3-X.
           EXIT.

       621-READ-MPLTINFO.
           MOVE "PODL"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           IF FILE-STATUS-1 = "2"
               MOVE SPACES             TO BUF-MPLTINFO
               MOVE "PODL"             TO MPLTINFO-KEY
               MOVE 2                  TO MPLTINFO-INV-LAST-ABST
               PERFORM 9-WRITE-MPLTINFO.

           MOVE MPLTINFO-CHECK-RLS-VAL TO CHECK-RLS-VAL.

           IF CHECK-RLS-VAL = " "
               MOVE "N"                TO CHECK-RLS-VAL.

           IF MPLTINFO-RLS-VAL-DAYS NUMERIC
               MOVE MPLTINFO-RLS-VAL-DAYS
                                       TO RLS-VAL-DAYS
           ELSE
               MOVE 0                  TO RLS-VAL-DAYS.

           IF MPLTINFO-LAST-ITEM-SW > SPACES
               MOVE MPLTINFO-LAST-ITEM-SW TO DELETE-LAST-ITEM-SW
           ELSE
               MOVE "Y"                TO  DELETE-LAST-ITEM-SW.

           MOVE "ISO "                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           MOVE ISO-DOC-NUM            TO  DOC-NUM.

      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO PLTINFOKEY OF MPLTINFO-O-REC.
           START MPLTINFO-O KEY > PLTINFOKEY OF MPLTINFO-O-REC
               INVALID KEY MOVE "00"   TO  FILE-STATUS.

      ***************************************************************
      **                                                           **
      **          P E R F O R M E D    R O U T I N E S             **
      **                                                           **
      ***************************************************************

       9-READ-MPLTINFO.
           MOVE 0                      TO  COND-WORD.
           MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               NEXT SENTENCE
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "READ MPLTINFO ERROR IN 9-READ-MPLTINFO"
                                       TO  BU-DISPLAY-MSG
               MOVE MPLTINFO-ARG       TO  BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

       9-WRITE-MPLTINFO.
           WRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "WRT MPLTINFO ERROR IN 9-WRITE-MPLTINFO"
                                       TO  BU-DISPLAY-MSG
               MOVE MPLTINFO-KEY       TO  BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

       9-REWRITE-MPLTINFO.
           REWRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "REWRITE  ERROR IN 9-REWRITE-MPLTINFO"
                                       TO  BU-DISPLAY-MSG
               MOVE MPLTINFO-KEY       TO  BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

       COPY DISPCALL IN COPYLIB.

       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM        TO  CATREAD-MSG-SET
               MOVE LANG-MSGNUM        TO  CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT       TO  MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.
