000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.     SPCSMODE.
       AUTHOR.         CA YODER.
000400 DATE-WRITTEN.   OCTOBER 1995.
000500 DATE-COMPILED.
000600 INSTALLATION.   THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
000700*REMARKS.
000800**************************************************************
000900*                                                            *
001000*    SPCSMODE                TRANSPORTATION MODE SUBPROGRAM  *
001100*                                                            *
001200*     THIS PROGRAM IS USED TO ADD, DELETE, AND MODIFY        *
001300*     TRANSPORTATION MODES FOR ELECTRONIC DATA INTERCHANGE.  *
001400*                                                            *
      *     ** COPIED FROM SEDITRMO AND MODIFIED **                *
      *                                                            *
001500*     THIS PROGRAM IS CALLED BY:                             *
001600*                       1.  SPCSTRAN                         *
001700*                                                            *
001800**************************************************************
001900
002000 ENVIRONMENT DIVISION.
002100 CONFIGURATION SECTION.
002200 SOURCE-COMPUTER.  IBM-AS400.
002300 OBJECT-COMPUTER.  IBM-AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZSTARTUP-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

            SELECT MPLTINFO-PK-O
                ASSIGN TO DATABASE-MCFLCS0501
                ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                FILE STATUS IS FILE-STATUS.
002500
002500 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                   PIC X(2000).

       FD  MPLTINFO-PK-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-PK-REC-O.
           COPY DDS-MCRPCS0500 OF MCFLCS0501.

002600 WORKING-STORAGE SECTION.
002700
002800 77  HANDLE-BLOWUP-FLAG            PIC X          VALUE "Y".
002900 77  PASSED-SPOOL-PRT              PIC S9(2) COMP VALUE 0.
003000 77  SUB1                          PIC 9.
003100 77  WS-EDI-INSTAL                 PIC X.
003200
003300*************************************************************
003400*************************************************************
003500**                                                         **
003600**              D A T A    B A S E    A R E A              **
003700**                                                         **
003800*************************************************************
003900*************************************************************
004000
004100 01  DSET-NAMES.
004200     05  DSET-NAME                 PIC X(16)  VALUE SPACES.
004300     05  DSET-MPLTINFO             PIC X(16)  VALUE "MPLTINFO;".
004400
       01  DISPLAY-STATUS                PIC XX.

004500 01  ARG-VALUES.
004600     05  PLT-ARG                   PIC X(4).
004700
004800 01  SEARCH-ITEMS.
004900     05  ALL-ITEMS                 PIC X(2)  VALUE "@;".
005000
005100 01  DB-LOG-VALUES.
005200     05  DB-LOG-TEXT               PIC X(8)  VALUE "SPCSMODE".
005300     05  DB-LOG-TEXT-LEN           PIC S9(4) COMP  VALUE -8.
005400
       01  FILE-STATUS                   PIC XX.

005500 01  MESSAGE-BUFLEN                PIC S9(4) COMP VALUE 76.
005600 01  MESSAGE-ACTLEN                PIC S9(4) COMP VALUE 76.
005700 01  MSG-ACTUALEN                  PIC S9(4) COMP VALUE 76.
005800 01  FIELD-NUMBER                  PIC S9(4) COMP VALUE 1.
005900
006000 01  MESSAGE-BUFFER.
006100     05  MSG-TEXT                  PIC X(64)  VALUE SPACES.
006200     05  MSG-FLD                   PIC X(12)  VALUE SPACES.
006300     05  FILLER                    PIC X(04)  VALUE SPACES.
006400
006000 01  MESSAGE-BUFFER-1.
006100     05  MSG-TEXT-1                PIC X(64)  VALUE SPACES.
006200     05  MSG-FLD-1                 PIC X(12)  VALUE SPACES.
006300     05  FILLER                    PIC X(04)  VALUE SPACES.
006400
006500 COPY DBMODES  IN COPYLIB.
006600
006700 COPY DBSTAT   IN COPYLIB.
006800
006900 COPY MULTLOCK IN COPYLIB.
007000
007100 COPY MPLTINFO IN COPYLIB.
007200
007300*************************************************************
007400*************************************************************
007500**                                                         **
007600**                 TERMINAL I/O DATA AREA                  **
007700**                                                         **
007800*************************************************************
007900*************************************************************
008000
008100 01  DE-FIELDS-1.
008200     05  ADD-MT-INFO OCCURS 3.
008300         10  MT-MODE-A             PIC XX.
008400         10  MT-DESC-A             PIC X(20).
008500     05  MODIFY-MT-INFO.
008600         10  MT-MODE-M             PIC XX.
008700         10  MT-DESC-M             PIC X(20).
008800     05  DELETE-MT-INFO.
008900         10  MT-MODE-D             PIC XX.
009000         10  MT-DESC-D             PIC X(20).
009100     05  MT-MSGLINE1               PIC X(79).
           05  DE-COMMAND-LINE-1         PIC X(79).
009200
       COPY FUNCTDEF   IN COPYLIB.

       COPY IOFEEDBACK IN COPYLIB.

009300 01  MT-MODE-ARG.
009400     05  FILLER                   PIC XX    VALUE "MT".
009500     05  MT-MODE-IN               PIC XX.
009600
009700 COPY TSHWRDFM  IN COPYLIB.
009800
       COPY WSCONTROL IN COPYLIB.
009900*************************************************************
010000*************************************************************
010100**                                                         **
010200**                 COMMUNICATIONS AREAS                    **
010300**                                                         **
010400*************************************************************
010500*************************************************************
010600
010700 COPY CATREAD  IN COPYLIB.
010800
010900***** NOTE THAT "TSCRPRT2" ALSO USES PASSED-SPOOL-PRT, *****
011000***** AND VIEW-COMAREA AS PARAMETERS IN ADDITION TO    *****
011100***** THOSE LISTED BELOW.                              *****
011200
011300 01  TSCRPRT2-PARAMETERS.
011400     05  TSCRPRT2-PRINTCNTL        PIC S9(4) COMP VALUE 0.
011500     05  TSCRPRT2-PAGECNTL         PIC S9(4) COMP VALUE 49.
011600     05  TSCRPRT2-SPOOLSW          PIC X(1)  VALUE "N".
011700
011800 01  TSCRPRT2-ERROR-SW             PIC X(1)  VALUE "N".
011900
012000 01  TSCRPRT2-DISPLAY-AREA.
012100     05     FILLER                 PIC X(2).
012200     05  TSCRPRT2-MSG              PIC X(27).
012300     05     FILLER                 PIC X(2).
012400     05  TSCRPRT2-STAT             PIC S9(4).
012500     05     FILLER                 PIC X(2).
012600     05  TSCRPRT2-FLD              PIC X(14).
012700     05     FILLER                 PIC X(2).
012800
012900 COPY TBLOWUP   IN COPYLIB.
013000
013100*************************************************************
013200*************************************************************
013300**                                                         **
013400**               LINKAGE   SECTION                         **
013500**                                                         **
013600*************************************************************
013700*************************************************************
013800
013900 LINKAGE SECTION.
014000
014100 01  BASE                          PIC X(10).
014200
014300 COPY VCOMLINK  IN COPYLIB.
014400
014500 COPY LANGSUB   IN COPYLIB.
014600
014800*************************************************************
014900**#########################################################**
015000*************************************************************
015100**                                                         **
015200**          P R O C E D U R E    D I V I S I O N           **
015300**                                                         **
015400*************************************************************
015500**#########################################################**
015600*************************************************************
015700
015800 PROCEDURE DIVISION USING BASE,
015900                          VIEW-COMAREA,
016000                          LANGUAGE-PARMS.
016100
016200 0-SPCSMODE-SEC SECTION 1.
016300
016400 0-BEGIN-HERE.
016500     PERFORM 1-HSK.
016600     PERFORM 6-MAIN THRU 6-MAIN-X.
016700     PERFORM 2-EOJ.
016800
016900 1-HSK.
017000     MOVE "SPCSMODE" TO BU-PGM-NAME.
           OPEN I-O   DISPLAY-FILE.
           OPEN I-O   MPLTINFO-PK-O.
017100     MOVE "N" TO WS-EDI-INSTAL.
017200     MOVE "EDI " TO PLT-ARG.
017300     PERFORM 9999-GETKEY-MPLTINFO-PK-O.
017400     IF COND-WORD = 0
017500         IF EDI-INSTAL = "Y" MOVE "Y" TO WS-EDI-INSTAL.
           PERFORM 9999-RESET-MPLTINFO-PK-O.
017900
018000 2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE MPLTINFO-PK-O.
018100     GOBACK.
018200
018300******************************************************
018400**                 BLOWUP ROUTINE                   **
018500******************************************************
018600
018700 2100-BLOWUP.
018800     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
018900           VIEW-COMAREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
019000           BU-DISPLAY-AREA.
019100
019200**************************************************
019300*                                                *
019400*                  6 - M A I N                   *
019500*                                                *
019600**************************************************
019700 6-MAIN.
019800     MOVE "TRANMODE" TO VIEW-NFNAME.
019900     PERFORM 9999-GETNEXTFORM.
020000     MOVE SPACES TO MESSAGE-BUFFER.
020100     PERFORM 9999-PUTWINDOW.
020200     MOVE SPACES TO DE-FIELDS-1.
020300
020400***  INPUT DATA ABOVE AND PRESS 'ENTER'  ***
020500     MOVE   9 TO LANG-SETNUM.
020600     MOVE  20 TO LANG-MSGNUM.
020700     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
020800     MOVE MESSAGE-BUFFER TO MT-MSGLINE1.
020900 6-MAIN-LOOP.
           MOVE "ERROR LINE" TO MESSAGE-BUFFER-1.
021000     PERFORM 9999-DO-SCREEN-1.
021100     IF VIEW-LASTKEY = 3 GO TO 6-MAIN-X.
021200     IF VIEW-LASTKEY = 5
021300         GO TO 6-MAIN-LOOP
021400     ELSE
021500     IF VIEW-LASTKEY = 1
               PERFORM 69-HELP-SCREEN THRU 69-HELP-SCREEN-X
               GO TO 6-MAIN
           ELSE
021600     IF VIEW-LASTKEY = 2 OR
021700        VIEW-LASTKEY = 3 OR
021800        VIEW-LASTKEY = 4 OR
021900        VIEW-LASTKEY = 6 OR
022000        VIEW-LASTKEY = 7
022100*****    INVALID FUNCTION KEY    *****
022200         MOVE   9 TO LANG-SETNUM
022300         MOVE  10 TO LANG-MSGNUM
022400         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
022500         MOVE MESSAGE-BUFFER TO MT-MSGLINE1
022600         GO TO 6-MAIN-LOOP.
022700     MOVE 0 TO SUB1.
022800
022900 6-EDIT-CHECKS.
023000     ADD 1 TO SUB1.
023100     IF MT-MODE-A (SUB1) NOT = "  " AND MT-MODE-M NOT = "  "
023200         AND MT-MODE-D NOT = "  "
023300         MOVE   3 TO LANG-SETNUM
023400         MOVE  62 TO LANG-MSGNUM
023500         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
023600         MOVE 19 TO SRF-ERROR-FLD
023700         GO TO 6-MAIN-LOOP.
023800
023900     IF MT-MODE-A (SUB1) NOT = "  "
024000        MOVE MT-MODE-A (SUB1)  TO MT-MODE-IN
024100        MOVE MT-MODE-ARG       TO PLT-ARG
024200        PERFORM 9999-GETKEY-MPLTINFO-PK-O
024300        IF GOOD-CALL
024400****     TRANSPORTATION MODE ALREADY EXISTS     ****
024500            MOVE  20 TO LANG-SETNUM
024600            MOVE  66 TO LANG-MSGNUM
024700            PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
024800            MOVE 19 TO SRF-ERROR-FLD
024900            GO TO 6-MAIN-LOOP
025000        ELSE
025100        IF NO-ENTRY
025200            PERFORM 61-ADD-MT THRU 61-AM-X
025300        ELSE
025400        MOVE "GET MPLTINFO ERROR IN 6-EDIT-CHECK"
025500            TO BU-DISPLAY-MSG
025600        MOVE MT-MODE-A (SUB1) TO BU-DISPLAY-FLD (1)
025700        PERFORM 2100-BLOWUP.
025800
025900     IF MT-MODE-M NOT = "  "
026000        MOVE MT-MODE-M   TO MT-MODE-IN
026100        MOVE MT-MODE-ARG TO PLT-ARG
026200        PERFORM 9999-GETKEY-MPLTINFO-PK-O
026300        IF NO-ENTRY
026400****     TRANSPORTATION MODE DOES NOT EXIST    ****
026500            MOVE  20 TO LANG-SETNUM
026600            MOVE  67 TO LANG-MSGNUM
026700            PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
026800            MOVE 25 TO SRF-ERROR-FLD
026900            PERFORM 9999-SHOWFORM
027000            GO TO 6-MAIN-LOOP
027100        ELSE
027200        IF GOOD-CALL
027300            MOVE 13 TO LANG-SETNUM
027400            MOVE 58 TO LANG-MSGNUM
027500            PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
027600            MOVE MESSAGE-BUFFER TO MT-MSGLINE1
027700            MOVE MPLTINFO-MT-DESC TO MT-DESC-M
027800            PERFORM 6-MAIN-LOOP
027900            PERFORM 62-MODIFY-MT THRU 62-MM-X
028000        ELSE
028100        MOVE "GET MPLTINFO ERROR IN 6-EDIT-CHECK"
028200            TO BU-DISPLAY-MSG
028300        MOVE PLT-ARG TO BU-DISPLAY-FLD (1)
028400        PERFORM 2100-BLOWUP.
028500
028600     IF MT-MODE-D NOT = "  "
028700         PERFORM 63-DELETE-MT THRU 63-DM-X.
028800
028900     GO TO 6-MAIN.
029000
029100 6-MAIN-X.    EXIT.
029200
029300 61-ADD-MT.
029400     MOVE  1               TO NUMBER-OF-DSETS-LOCKED.
029500     MOVE DSET-MPLTINFO    TO DSET-NAME-1.
029600     PERFORM 9999-MULTI-LOCK.
029700     MOVE SPACES            TO BUF-MPLTINFO.
029800     MOVE MT-MODE-A (SUB1)  TO MT-MODE-IN.
029900     MOVE MT-MODE-ARG       TO MPLTINFO-KEY.
030000     MOVE MT-DESC-A (SUB1)  TO MPLTINFO-MT-DESC.
030100     PERFORM 9999-PUT-MPLTINFO-PK-O.
030200     PERFORM 9999-UNLOCK.
030300     ADD 1 TO SUB1.
030400     IF MT-MODE-A (SUB1) NOT = "  " GO TO 61-ADD-MT.
030500 61-AM-X.    EXIT.
030600
030700 62-MODIFY-MT.
030800     MOVE  1               TO NUMBER-OF-DSETS-LOCKED.
030900     MOVE DSET-MPLTINFO    TO DSET-NAME-1.
031000     PERFORM 9999-MULTI-LOCK.
031100     MOVE MT-DESC-M TO MPLTINFO-MT-DESC.
031200     PERFORM 9999-UPDATE-MPLTINFO-PK-O.
031300     PERFORM 9999-UNLOCK.
031400 62-MM-X.    EXIT.
031500
031600 63-DELETE-MT.
031700     MOVE 1 TO NUMBER-OF-DSETS-LOCKED.
031800     MOVE DSET-MPLTINFO  TO DSET-NAME-1.
031900     PERFORM 9999-MULTI-LOCK.
032000     MOVE MT-MODE-D   TO MT-MODE-IN.
032100     MOVE MT-MODE-ARG TO PLT-ARG.
032200     PERFORM 9999-GETKEY-MPLTINFO-PK-O.
032300     IF NO-ENTRY
032400         GO TO 63-DM-X
032500     ELSE
032600     IF GOOD-CALL
032700          PERFORM 9999-DELETE-MPLTINFO-PK-O
032800     ELSE
032900     MOVE "GET MPLTINFO ERROR IN 63-DELETE-MT"
033000         TO BU-DISPLAY-MSG
033100     MOVE PLT-ARG TO BU-DISPLAY-FLD (1)
033200     PERFORM 2100-BLOWUP.
033300     PERFORM 9999-UNLOCK.
033400 63-DM-X.    EXIT.
033500
       69-HELP-SCREEN.
           MOVE "HELP10" TO VIEW-NFNAME.
           PERFORM 9999-GETNEXTFORM.
           MOVE SPACES TO DE-FIELDS-1.
           MOVE SPACES TO MESSAGE-BUFFER.
           PERFORM 9999-PUTWINDOW.
           PERFORM 9999-DO-SCREEN-1.
       69-HELP-SCREEN-X.    EXIT.

       999-CATREAD.
            IF CATREAD-MSG-NUMBER = ZEROES
                MOVE LANG-SETNUM TO CATREAD-MSG-SET
                MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
            MOVE SPACES TO MESSAGE-BUFFER.
            CALL "CCATREAD" USING CATREAD-PARMS.
            MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.    EXIT.

033600*********************************************************
       9999-DELETE-MPLTINFO-PK-O.
           MOVE 0 TO COND-WORD.
           DELETE MPLTINFO-PK-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "DELETE ERR 9999-DELETE-MPLTINFO-PK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETKEY-MPLTINFO-PK-O.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-O.
           READ MPLTINFO-PK-O INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MPLTINFO-PK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-RESET-MPLTINFO-PK-O.
           MOVE HIGH-VALUES TO PLTINFOKEY OF MPLTINFO-PK-REC-O.
           START MPLTINFO-PK-O KEY > PLTINFOKEY OF MPLTINFO-PK-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

034000 COPY MLOCKCAL IN COPYLIB.
       9999-PUT-MPLTINFO-PK-O.
           MOVE 0 TO COND-WORD.
           WRITE MPLTINFO-PK-REC-O FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-MPLTINFO-PK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-UPDATE-MPLTINFO-PK-O.
           MOVE 0 TO COND-WORD.
           REWRITE MPLTINFO-PK-REC-O FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "UPDATE ERR 9999-UPDATE-MPLTINFO-PK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

034300 COPY SCRNCALL IN COPYLIB.
034400 COPY SCRNCL1  IN COPYLIB.
034500 COPY UNLOCK   IN COPYLIB.
