       IDENTIFICATION DIVISION.
       PROGRAM-ID.     SPCSMATL.
       AUTHOR.         CA YODER.
       INSTALLATION.   THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
       DATE-WRITTEN.   OCTOBER 1995.
       DATE-COMPILED.
      *REMARKS.
      **************************************************************
      *                                                            *
      *D   SPCSMATL     MATERIALS CONTROL USER OPTIONS             *
      *D                                                           *
      *D   CALLED BY:  TCSISOPT                                    *
      *D                                                           *
      **************************************************************
      *C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT DISPLAY-FILE
                   ASSIGN TO WORKSTATION-ZSTARTUP-SI
                   ORGANIZATION IS TRANSACTION
                   ACCESS IS SEQUENTIAL
                   FILE STATUS IS DISPLAY-STATUS
                   CONTROL-AREA IS WS-CONTROL.
            SELECT MPLTINFO-O
                   ASSIGN TO DATABASE-MCFLCS0501
                   ORGANIZATION IS INDEXED
                   ACCESS IS DYNAMIC
                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                       PIC X(2000).
       FD  MPLTINFO-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-O-REC.
           COPY DDS-MCRPCS0500 OF MCFLCS0501.
       WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1                 PIC X VALUE SPACE.
           05  FILE-STATUS-2                 PIC X VALUE SPACE.

       01  CARRY-COST-FIGURES.
           05  CARRY-COST-PERCENT     PIC 9V9(2)  VALUE ZEROES.
           05  CARRY-COST-OUT         PIC 9(2)    VALUE ZEROES.

      *************************************************************
      **                                                         **
      **              D A T A    B A S E    A R E A              **
      **                                                         **
      *************************************************************
      *************************************************************

       COPY MPLTINFO IN COPYLIB.
       COPY DBSTAT IN COPYLIB.
       01  MPLTINFO-ARG                    PIC X(4).
       01  MESSAGE-BUFFER.
           05  MSG-TEXT                    PIC X(64)  VALUE SPACES.
           05  MSG-FLD                     PIC X(12)  VALUE SPACES.
           05  MSG-FLD-9 REDEFINES MSG-FLD
                                           PIC Z(11)9.
      *************************************************************
      *************************************************************
      **                                                         **
      **                 TERMINAL I/O DATA AREA                  **
      **                                                         **
      *************************************************************
      *************************************************************

       01  MATL-OPTION-SCREEN.
           05  AVG-COST-SW               PIC X(1).
           05  ORDER-COST                PIC 9(6).
           05  CARRY-COST                PIC 9(2).
           05  PRNT-MSGLINE2             PIC X(79).
           05  CMDLINE2                  PIC X(79).
           05  ERR-MSGLINE2              PIC X(79).

       COPY TBLOWUP IN COPYLIB.
       COPY CATREAD IN COPYLIB.
       COPY DISPDATA IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.

      *************************************************************
      *************************************************************
      **                                                         **
      **               LINKAGE   SECTION                         **
      **                                                         **
      *************************************************************
      *************************************************************

       LINKAGE SECTION.

       01  BASE                          PIC X(10).

       COPY VCOMLINK IN COPYLIB.

       COPY LANGSUB IN COPYLIB.


      *************************************************************
      **#########################################################**
      *************************************************************
      **                                                         **
      **          P R O C E D U R E    D I V I S I O N           **
      **                                                         **
      *************************************************************
      **#########################################################**
      *************************************************************

       PROCEDURE DIVISION USING BASE,
                                VIEW-COMAREA,
                                LANGUAGE-PARMS.


       MAIN-PGM SECTION 01.

       BEGIN-HERE.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-X.
           PERFORM 2-EOJ.

       1-HSK.
           MOVE "SPCSMATL" TO BU-PGM-NAME.
           OPEN I-O DISPLAY-FILE, MPLTINFO-O.

       2-EOJ.
           CLOSE DISPLAY-FILE, MPLTINFO-O.
           GOBACK.

      ******************************************************
      **                 BLOWUP ROUTINE                   **
      ******************************************************

       2-BLOWUP.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
               BU-DISPLAY-AREA.

      **************************************************
      *                                                *
      *                  6 - M A I N                   *
      *                                                *
      **************************************************

       6-MAIN.
           MOVE SPACES TO MATL-OPTION-SCREEN.

       6-READ-DATABASE.
           PERFORM 62-READ-MPLTINFO.

       6-PERFORM-PAGES.
           MOVE "MATLC1" TO VIEW-NFNAME.
           PERFORM 62-PAGE-1  THRU 62-PAGE-1-X.

       6-MAIN-X.
           EXIT.

       62-PAGE-1.
       62-PUT-BUFFER.

      ***  INPUT DATA ABOVE AND PRESS 'ENTER'  ***
           MOVE   9 TO LANG-SETNUM.
           MOVE  20 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO PRNT-MSGLINE2.

       62-SHOW-FORM.
           MOVE MATL-OPTION-SCREEN TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC TO MATL-OPTION-SCREEN.
           IF VIEW-LASTKEY = 3
               GO TO 62-PAGE-1-X.
           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERR-MSGLINE2
               MOVE B"1" TO IND(99)
               GO TO 62-SHOW-FORM.

       62-REPLACE-MPLTINFO.
           MOVE "PAVG" TO MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           IF AVG-COST-SW = "N"
              IF FILE-STATUS  = "00"
                 DELETE MPLTINFO-O
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                 END-DELETE
                 IF FILE-STATUS NOT = "00"
                    MOVE "DELETE MPLTINFO*60-RM" TO BU-DISPLAY-MSG
                    MOVE MPLTINFO-ARG   TO  BU-DISPLAY-FLD (1)
                    PERFORM 2-BLOWUP.
           IF AVG-COST-SW = "Y"
              IF FILE-STATUS-1 = "2"
                 MOVE SPACES TO BUF-MPLTINFO
                 MOVE "PAVG" TO MPLTINFO-KEY
                 WRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                 END-WRITE
                 IF FILE-STATUS NOT = "00"
                    MOVE "WRITE MPLTINFO*60-RM" TO BU-DISPLAY-MSG
                    MOVE MPLTINFO-KEY   TO  BU-DISPLAY-FLD (1)
                    PERFORM 2-BLOWUP.

           MOVE "P 20" TO MPLTINFO-ARG, BU-DISPLAY-FLD (1).
           PERFORM 9-READ-MPLTINFO.
           IF FILE-STATUS-1 = "2"
               MOVE SPACES     TO BUF-MPLTINFO
               MOVE "P 20"     TO MPLTINFO-KEY
               MOVE ZEROS      TO MPLTINFO-ORDER-COST
               MOVE ORDER-COST TO MPLTINFO-EXP-ORDER-COST
               DIVIDE CARRY-COST BY 100 GIVING CARRY-COST-PERCENT
               MOVE CARRY-COST-PERCENT TO MPLTINFO-CARRY-COST
               WRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-WRITE
               IF FILE-STATUS NOT = "00"
                   MOVE "WRITE MPLTINFO ERROR IN 62-REPLACE-MPLTINFO"
                        TO BU-DISPLAY-MSG
                   PERFORM 2-BLOWUP
               ELSE
                   NEXT SENTENCE
           ELSE
           IF FILE-STATUS = "00"
               MOVE ORDER-COST TO MPLTINFO-EXP-ORDER-COST
               MOVE ZEROS      TO MPLTINFO-ORDER-COST
               DIVIDE CARRY-COST BY 100 GIVING CARRY-COST-PERCENT
               MOVE CARRY-COST-PERCENT TO MPLTINFO-CARRY-COST
               PERFORM 9-REWRITE-MPLTINFO.

       62-PAGE-1-X.
           EXIT.

       62-READ-MPLTINFO.
           MOVE "PAVG"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           IF FILE-STATUS-1 = "2"
               MOVE "N"                TO  AVG-COST-SW
           ELSE
               MOVE "Y"                TO  AVG-COST-SW.

           MOVE "P 20" TO MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO
           IF FILE-STATUS = "00"
               MULTIPLY MPLTINFO-CARRY-COST BY 100
                                GIVING CARRY-COST-OUT
               MOVE CARRY-COST-OUT TO CARRY-COST
               IF MPLTINFO-ORDER-COST = ZEROS
                   MOVE MPLTINFO-EXP-ORDER-COST TO ORDER-COST
               ELSE
                   MOVE MPLTINFO-ORDER-COST     TO ORDER-COST
           ELSE
           IF FILE-STATUS-1 = "2"
               MOVE ZEROS           TO CARRY-COST
                                       ORDER-COST.

       9-READ-MPLTINFO.
           MOVE 0                      TO  COND-WORD.
           MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               NEXT SENTENCE
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "READ MPLTINFO ERROR IN 9-READ-MPLTINFO"
                                       TO  BU-DISPLAY-MSG
               MOVE MPLTINFO-ARG       TO  BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

       9-REWRITE-MPLTINFO.
           REWRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "REWRITE  ERROR IN 9-REWRITE-MPLTINFO"
                                       TO  BU-DISPLAY-MSG
               MOVE MPLTINFO-KEY       TO  BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

       9-WRITE-MPLTINFO.
           WRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "WRT MPLTINFO ERROR IN 9-WRITE-MPLTINFO"
                                       TO  BU-DISPLAY-MSG
               MOVE MPLTINFO-KEY       TO  BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

       COPY DISPCALL IN COPYLIB.
      *********************************************************
       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.
