       IDENTIFICATION DIVISION.
       PROGRAM-ID.     SPLTINFO.
       AUTHOR.         ANNETTE M. KRAUSS.
       INSTALLATION.   THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
       DATE-WRITTEN.   JUNE 6, 1987.
       DATE-COMPILED.
      *REMARKS.
      **************************************************************
      *                                                            *
      *D   SPLTINFO    PLANT INFORMATION SUBPROGRAM                *
      *                                                            *
      *D    THIS PROGRAM IS USED TO ENTER THE COMPANY CODE,        *
      *D    PRIME, TERRITORY, ADDRESS, SHIPPING LOCATION AND       *
      *D    ALTERNATE ADDRESS.                                     *
      *D                                                           *
      **************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT DISPLAY-FILE
                   ASSIGN TO WORKSTATION-ZPLTSTUP-SI
                   ORGANIZATION IS TRANSACTION
                   ACCESS IS SEQUENTIAL
                   FILE STATUS IS DISPLAY-STATUS
                   CONTROL-AREA IS WS-CONTROL.
            SELECT MPLTINFO-O
                   ASSIGN TO DATABASE-MCFLCS0501
                   ORGANIZATION IS INDEXED
                   ACCESS IS DYNAMIC
                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   FILE STATUS IS FILE-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC             PIC X(2000).
       FD  MPLTINFO-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-O-REC.
           COPY DDS-MCRPCS0500 OF MCFLCS0501.

       WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1        PIC X VALUE SPACE.
           05  FILE-STATUS-2        PIC X VALUE SPACE.
      *************************************************************
      **                                                         **
      **              D A T A    B A S E    A R E A              **
      **                                                         **
      *************************************************************
      *************************************************************

       COPY MPLTINFO IN COPYLIB.

       COPY DBSTAT IN COPYLIB.

       01  MESSAGE-BUFFER.
           05  MSG-TEXT                    PIC X(64)  VALUE SPACES.
           05  MSG-FLD                     PIC X(12)  VALUE SPACES.
           05  MSG-FLD-9 REDEFINES MSG-FLD
                                           PIC Z(11)9.
      *************************************************************
      *************************************************************
      **                                                         **
      **                 TERMINAL I/O DATA AREA                  **
      **                                                         **
      *************************************************************
      *************************************************************


       01  PLANT-SCREEN.
           05  COMPANY-CODE              PIC X(3).
           05  PRIME                     PIC X(3).
           05  TERRITORY                 PIC X(4).
           05  PO-ADDRESS.
               10  COMPANY-NAME          PIC X(35).
               10  PLANT-NAME            PIC X(35).
               10  ADDRESS1              PIC X(35).
               10  ADDRESS2              PIC X(35).
           05  SHIPPING-LOC              PIC X(29).
           05  PLANT-FAX-NO              PIC X(20).
           05  PLANT-TELEX-NO            PIC X(20).
           05  ALT-PO-ADDRESS.
               10  ALT-COMPANY-NAME      PIC X(35).
               10  ALT-PLANT-NAME        PIC X(35).
               10  ALT-ADDRESS1          PIC X(35).
               10  ALT-ADDRESS2          PIC X(35).
           05  PLANT-MSGLINE             PIC X(79).
           05  CMD-LINE                  PIC X(79).
           05  MSG-LINE                  PIC X(79).

       COPY TBLOWUP    IN COPYLIB.
       COPY CATREAD    IN COPYLIB.
       COPY DISPDATA   IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.

      *************************************************************
      *************************************************************
      **                                                         **
      **               LINKAGE   SECTION                         **
      **                                                         **
      *************************************************************
      *************************************************************

       LINKAGE SECTION.

       01  BASE                          PIC X(10).

       COPY VCOMLINK IN COPYLIB.

       COPY LANGSUB IN COPYLIB.


      *************************************************************
      **#########################################################**
      *************************************************************
      **                                                         **
      **          P R O C E D U R E    D I V I S I O N           **
      **                                                         **
      *************************************************************
      **#########################################################**
      *************************************************************

       PROCEDURE DIVISION USING BASE,
                                VIEW-COMAREA,
                                LANGUAGE-PARMS.


       MAIN-PGM SECTION 01.

       BEGIN-HERE.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-X.
           PERFORM 2-EOJ.

       1-HSK.
           MOVE "SPLTINFO" TO BU-PGM-NAME.
           OPEN I-O MPLTINFO-O, DISPLAY-FILE.

       2-EOJ.
           CLOSE MPLTINFO-O, DISPLAY-FILE.
           GOBACK.

      ******************************************************
      **                 BLOWUP ROUTINE                   **
      ******************************************************

       2-BLOWUP.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
               BU-DISPLAY-AREA.

      **************************************************
      *                                                *
      *                  6 - M A I N                   *
      *                                                *
      **************************************************

       6-MAIN.
           MOVE "PLTINFO" TO VIEW-NFNAME.

       6-PUT-BUFFER.
           MOVE SPACES TO PLANT-SCREEN.
           PERFORM 61-READ-MPLTINFO.

      ***  INPUT DATA ABOVE AND PRESS 'ENTER'  ***
           MOVE   9 TO LANG-SETNUM.
           MOVE  20 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO PLANT-MSGLINE.

       6-SHOW-FORM.
           MOVE PLANT-SCREEN TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC  TO PLANT-SCREEN.

       6-READ-FIELDS.
           IF VIEW-LASTKEY = 3
               GO TO 6-MAIN-X.

           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE B"1" TO IND(99)
               GO TO 6-SHOW-FORM.

       6-REPLACE-MPLTINFO.
           MOVE "P 01" TO BU-DISPLAY-FLD (1),
                          PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO.
           IF FILE-STATUS-1 = "2"
               MOVE SPACES       TO BUF-MPLTINFO
               MOVE "P 01"       TO MPLTINFO-KEY
               MOVE COMPANY-CODE TO MPLTINFO-COMPANY
               MOVE PRIME        TO MPLTINFO-PRIME
               MOVE TERRITORY    TO MPLTINFO-TERR
               MOVE PLANT-NAME   TO MPLTINFO-PLT-NAME
               WRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               IF FILE-STATUS NOT = "00"
                   MOVE "1WRITE ERROR MPLTINFO P 01"
                       TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP
               ELSE
                   NEXT SENTENCE
           ELSE
           IF FILE-STATUS = "00"
               MOVE COMPANY-CODE TO MPLTINFO-COMPANY
               MOVE PRIME        TO MPLTINFO-PRIME
               MOVE TERRITORY    TO MPLTINFO-TERR
               MOVE PLANT-NAME   TO MPLTINFO-PLT-NAME
               REWRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               IF FILE-STATUS NOT = "00"
                   MOVE "1REWRITE ERROR MPLTINFO P 01"
                       TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP
               ELSE
                   NEXT SENTENCE
           ELSE
               MOVE "1READ ERROR MPLTINFO P 01"
                   TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

           MOVE "P 00" TO BU-DISPLAY-FLD (1),
                          PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO.
           IF FILE-STATUS-1 = "2"
               MOVE SPACES TO BUF-MPLTINFO
               MOVE "P 00" TO MPLTINFO-KEY
               MOVE COMPANY-NAME TO MPLTINFO-DATA
               WRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               IF FILE-STATUS NOT = "00"
                   MOVE "2WRITE ERROR MPLTINFO P 00"
                       TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP
               ELSE
                   NEXT SENTENCE
           ELSE
           IF FILE-STATUS = "00"
               MOVE COMPANY-NAME TO MPLTINFO-DATA
               REWRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               IF FILE-STATUS NOT = "00"
                   MOVE "2REWRITE ERROR MPLTINFO P 00"
                       TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP
               ELSE
                   NEXT SENTENCE
           ELSE
               MOVE "2READ ERROR MPLTINFO P 00"
                   TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

           MOVE "P 10" TO  BU-DISPLAY-FLD (1),
                           PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO.
           IF FILE-STATUS-1 = "2"
               MOVE SPACES   TO BUF-MPLTINFO
               MOVE "P 10"   TO MPLTINFO-KEY
               MOVE ADDRESS1 TO MPLTINFO-DATA
               WRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               IF FILE-STATUS NOT = "00"
                   MOVE "3WRITE ERROR MPLTINFO P 10"
                       TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP
               ELSE
                   NEXT SENTENCE
           ELSE
           IF FILE-STATUS = "00"
               MOVE ADDRESS1 TO MPLTINFO-DATA
               REWRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               IF FILE-STATUS NOT = "00"
                   MOVE "3REWRITE ERROR MPLTINFO P 10"
                       TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP
               ELSE
                   NEXT SENTENCE
           ELSE
               MOVE "3READ ERROR MPLTINFO P 10"
                    TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

           MOVE "P 11" TO  BU-DISPLAY-FLD (1),
                           PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO.
           IF FILE-STATUS-1 = "2"
               MOVE SPACES   TO BUF-MPLTINFO
               MOVE "P 11"   TO MPLTINFO-KEY
               MOVE ADDRESS2 TO MPLTINFO-DATA
               WRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               IF FILE-STATUS NOT = "00"
                   MOVE "4WRITE ERROR MPLTINFO P 11"
                       TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP
               ELSE
                   NEXT SENTENCE
           ELSE
           IF FILE-STATUS = "00"
               MOVE ADDRESS2 TO MPLTINFO-DATA
               REWRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               IF FILE-STATUS NOT = "00"
                   MOVE "4REWRITE ERROR MPLTINFO P 11"
                       TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP
               ELSE
                   NEXT SENTENCE
           ELSE
               MOVE "4READ ERROR MPLTINFO P 11"
                    TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

           MOVE "P 12" TO  BU-DISPLAY-FLD (1),
                           PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO.
           IF FILE-STATUS-1 = "2"
               MOVE SPACES   TO BUF-MPLTINFO
               MOVE "P 12"   TO MPLTINFO-KEY
               MOVE SHIPPING-LOC TO MPLTINFO-DATA
               WRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               IF FILE-STATUS NOT = "00"
                   MOVE "5WRITE ERROR MPLTINFO P 12"
                       TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP
               ELSE
                   NEXT SENTENCE
           ELSE
           IF FILE-STATUS = "00"
               MOVE SHIPPING-LOC TO MPLTINFO-DATA
               REWRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               IF FILE-STATUS NOT = "00"
                   MOVE "5REWRITE ERROR MPLTINFO P 12"
                       TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP
               ELSE
                   NEXT SENTENCE
           ELSE
               MOVE "5READ ERROR MPLTINFO P 12"
                    TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

           MOVE "P 13" TO PLTINFOKEY OF MPLTINFO-O-REC
                          BU-DISPLAY-FLD (1).
           READ MPLTINFO-O INTO BUF-MPLTINFO.
           IF FILE-STATUS-1 = "2"
               MOVE SPACES   TO BUF-MPLTINFO
               MOVE "P 13"   TO MPLTINFO-KEY
               MOVE PLANT-FAX-NO       TO MPLTINFO-PLANT-FAX-NO
               MOVE PLANT-TELEX-NO     TO MPLTINFO-PLANT-TELEX-NO
               WRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               IF FILE-STATUS NOT = "00"
                   MOVE "5WRITE ERROR MPLTINFO P 13"
                       TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP
               ELSE
               NEXT SENTENCE
           ELSE
           IF FILE-STATUS = "00"
               MOVE PLANT-FAX-NO     TO MPLTINFO-PLANT-FAX-NO
               MOVE PLANT-TELEX-NO   TO MPLTINFO-PLANT-TELEX-NO
               REWRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               IF FILE-STATUS NOT = "00"
                   MOVE "6REWRITE ERROR MPLTINFO P 13"
                       TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP
               ELSE
               NEXT SENTENCE
           ELSE
           MOVE "6READ ERROR MPLTINFO P 13" TO BU-DISPLAY-MSG
           GO TO 2-BLOWUP.
           MOVE "PA01" TO BU-DISPLAY-FLD (1),
                          PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO.
           IF FILE-STATUS-1 = "2"
               MOVE SPACES   TO BUF-MPLTINFO
               MOVE "PA01"   TO MPLTINFO-KEY
               MOVE ALT-PLANT-NAME TO MPLTINFO-PLT-NAME
               WRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               IF FILE-STATUS NOT = "00"
                   MOVE "6WRITE ERROR MPLTINFO PA01"
                       TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP
               ELSE
                   NEXT SENTENCE
           ELSE
           IF FILE-STATUS = "00"
               MOVE ALT-PLANT-NAME TO MPLTINFO-PLT-NAME
               REWRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               IF FILE-STATUS NOT = "00"
                   MOVE "6REWRITE ERROR MPLTINFO PA01"
                       TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP
               ELSE
                   NEXT SENTENCE
           ELSE
               MOVE "6READ ERROR MPLTINFO PA01"
                    TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

           MOVE "PA00" TO BU-DISPLAY-FLD (1),
                          PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO.
           IF FILE-STATUS-1 = "2"
               MOVE SPACES   TO BUF-MPLTINFO
               MOVE "PA00"   TO MPLTINFO-KEY
               MOVE ALT-COMPANY-NAME TO MPLTINFO-DATA
               WRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               IF FILE-STATUS NOT = "00"
                   MOVE "9WRITE ERROR MPLTINFO PA00"
                       TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP
               ELSE
                   NEXT SENTENCE
           ELSE
           IF FILE-STATUS = "00"
               MOVE ALT-COMPANY-NAME TO MPLTINFO-DATA
               REWRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               IF FILE-STATUS NOT = "00"
                   MOVE "9REWRITE ERROR MPLTINFO PA00"
                       TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP
               ELSE
                   NEXT SENTENCE
           ELSE
               MOVE "9READ ERROR MPLTINFO PA00"
                    TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

           MOVE "PA10" TO BU-DISPLAY-FLD (1),
                          PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO.
           IF FILE-STATUS-1 = "2"
               MOVE SPACES   TO BUF-MPLTINFO
               MOVE "PA10"   TO MPLTINFO-KEY
               MOVE ALT-ADDRESS1 TO MPLTINFO-DATA
               WRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               IF FILE-STATUS NOT = "00"
                   MOVE "7WRITE ERROR MPLTINFO PA10"
                       TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP
               ELSE
                   NEXT SENTENCE
           ELSE
           IF FILE-STATUS = "00"
               MOVE ALT-ADDRESS1 TO MPLTINFO-DATA
               REWRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               IF FILE-STATUS NOT = "00"
                   MOVE "7REWRITE ERROR MPLTINFO PA10"
                       TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP
               ELSE
                   NEXT SENTENCE
           ELSE
               MOVE "7READ ERROR MPLTINFO PA10"
                    TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

           MOVE "PA11" TO BU-DISPLAY-FLD (1),
                          PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO.
           IF FILE-STATUS-1 = "2"
               MOVE SPACES   TO BUF-MPLTINFO
               MOVE "PA11"   TO MPLTINFO-KEY
               MOVE ALT-ADDRESS2 TO MPLTINFO-DATA
               WRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               IF FILE-STATUS NOT = "00"
                   MOVE "8WRITE ERROR MPLTINFO PA11"
                       TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP
               ELSE
                   NEXT SENTENCE
           ELSE
           IF FILE-STATUS = "00"
               MOVE ALT-ADDRESS2 TO MPLTINFO-DATA
               REWRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               IF FILE-STATUS NOT = "00"
                   MOVE "8REWRITE ERROR MPLTINFO PA11"
                       TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP
               ELSE
                   NEXT SENTENCE
           ELSE
               MOVE "8READ ERROR MPLTINFO PA11"
                    TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

       6-MAIN-X.
           EXIT.

       61-READ-MPLTINFO.
           MOVE "P 01" TO PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO.
           IF FILE-STATUS = "00"
               MOVE MPLTINFO-COMPANY  TO COMPANY-CODE
               MOVE MPLTINFO-PRIME    TO PRIME
               MOVE MPLTINFO-TERR     TO TERRITORY
               MOVE MPLTINFO-PLT-NAME TO PLANT-NAME
           ELSE
           IF FILE-STATUS-1 NOT = "2"
               MOVE "1READ MPLTINFO ERROR IN 61-READ-MPLTINFO"
                   TO BU-DISPLAY-MSG
               MOVE "P 01" TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

           MOVE "P 00" TO PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO.
           IF FILE-STATUS = "00"
               MOVE MPLTINFO-DATA TO COMPANY-NAME
           ELSE
           IF FILE-STATUS-1 NOT = "2"
               MOVE "2GET MPLTINFO ERROR IN 61-READ-MPLTINFO"
                   TO BU-DISPLAY-MSG
               MOVE "P 00" TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

           MOVE "P 10" TO PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO.
           IF FILE-STATUS = "00"
               MOVE MPLTINFO-DATA TO ADDRESS1
           ELSE
           IF FILE-STATUS-1 NOT = "2"
               MOVE "3GET MPLTINFO ERROR IN 61-READ-MPLTINFO"
                   TO BU-DISPLAY-MSG
               MOVE "P 10" TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

           MOVE "P 11" TO PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO.
           IF FILE-STATUS = "00"
               MOVE MPLTINFO-DATA TO ADDRESS2
           ELSE
           IF FILE-STATUS-1 NOT = "2"
               MOVE "4GET MPLTINFO ERROR IN 61-READ-MPLTINFO"
                   TO BU-DISPLAY-MSG
               MOVE "P 11" TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

           MOVE "P 12" TO PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO.
           IF FILE-STATUS = "00"
               MOVE MPLTINFO-DATA TO SHIPPING-LOC
           ELSE
           IF FILE-STATUS-1 = "2"
      ****     ATTN CENTRAL RECV  RED'G D/   *****
               MOVE   1 TO LANG-SETNUM
               MOVE  35 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO SHIPPING-LOC
           ELSE
               MOVE "5GET MPLTINFO ERROR IN 61-READ-MPLTINFO"
                   TO BU-DISPLAY-MSG
               MOVE "P 12" TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

           MOVE "P 13" TO PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO.
           IF FILE-STATUS = "00"
               MOVE MPLTINFO-PLANT-FAX-NO   TO PLANT-FAX-NO
               MOVE MPLTINFO-PLANT-TELEX-NO TO PLANT-TELEX-NO
           ELSE
           IF FILE-STATUS-1 = "2"
      ****     ATTN CENTRAL RECV  RED'G D/   *****
               MOVE   1 TO LANG-SETNUM
               MOVE  35 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO SHIPPING-LOC
           ELSE
               MOVE "5GET MPLTINFO ERROR IN 61-READ-MPLTINFO"
                   TO BU-DISPLAY-MSG
               MOVE "P 12" TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

           MOVE "PA01" TO PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO.
           IF FILE-STATUS = "00"
               MOVE MPLTINFO-PLT-NAME TO ALT-PLANT-NAME
           ELSE
           IF FILE-STATUS-1 NOT = "2"
               MOVE "6GET MPLTINFO ERROR IN 61-READ-MPLTINFO"
                   TO BU-DISPLAY-MSG
               MOVE "PA01" TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

           MOVE "PA00" TO PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO.
           IF FILE-STATUS = "00"
               MOVE MPLTINFO-DATA TO ALT-COMPANY-NAME
           ELSE
           IF FILE-STATUS-1 NOT = "2"
               MOVE "9GET MPLTINFO ERROR IN 61-READ-MPLTINFO"
                   TO BU-DISPLAY-MSG
               MOVE "PA00" TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

           MOVE "PA10" TO PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO.
           IF FILE-STATUS = "00"
               MOVE MPLTINFO-DATA TO ALT-ADDRESS1
           ELSE
           IF FILE-STATUS-1 NOT = "2"
               MOVE "7GET MPLTINFO ERROR IN 61-READ-MPLTINFO"
                   TO BU-DISPLAY-MSG
               MOVE "PA10" TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

           MOVE "PA11" TO PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO.
           IF FILE-STATUS = "00"
               MOVE MPLTINFO-DATA TO ALT-ADDRESS2
           ELSE
           IF FILE-STATUS-1 NOT = "2"
               MOVE "8GET MPLTINFO ERROR IN 61-READ-MPLTINFO"
                   TO BU-DISPLAY-MSG
               MOVE "PA11" TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.
      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO PLTINFOKEY OF MPLTINFO-O-REC.
           START MPLTINFO-O KEY > PLTINFOKEY OF MPLTINFO-O-REC
               INVALID KEY MOVE "00" TO FILE-STATUS.
       COPY DISPCALL IN COPYLIB.
       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.
