       IDENTIFICATION DIVISION.
       PROGRAM-ID.             SPMCLNDR.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT WO-PLANNED
                  ASSIGN       TO DATABASE-MCFLMM1101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZPMMAINT-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  WO-PLANNED
           LABEL RECORDS ARE STANDARD.
       01  WO-PLANNED-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  ERR-CD              PIC -9999.
       77  ARG-NO              PIC 9(9).
       77  CNUM-BUF            PIC X(04).
       77  CNAM-BUF            PIC X(16).
       77  ERR-SW              PIC X(01) VALUE "N".
       77  WS-RET-CODE         PIC XX    VALUE "0 ".
       77  TRUE-VAL            PIC 1     VALUE B"1".
       77  SAVE-YEAR           PIC X(4)  VALUE SPACES.
       77  SAVE-MONTH          PIC X(2)  VALUE SPACES.

       01  CURR-DATE.
           05  CD-YY           PIC 99.
           05  CD-MM           PIC 99.
           05  CD-DD           PIC 99.

       01  DB-ERROR.
           05  DB-TYPE   PIC X(08) VALUE SPACES.
           05  FILLER    PIC X(21) VALUE " ERROR - COND-WORD = ".
           05  CON-WORD  PIC -9999.

       01  ERROR-MESSAGES.
           05  MONTH-ERR       PIC X(78)
                               VALUE "MONTH MUST EQUAL 01 - 12".
           05  YEAR-SPACE-ERR  PIC X(78)
                               VALUE "YEAR CAN NOT BE SPACES".
           05  YEAR-ERR        PIC X(78) VALUE "YEAR CAN NOT BE LESS THA
      -    "N 1990 OR GREATER THAN 2059".

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       01  LINK-DATA.
           05  LINK-EQUIP      PIC X(06).
           05  LINK-WONUM      PIC X(10).
           05  LINK-ZONE-PRI   PIC X(06).
           05  LINK-YRMO.
               10  LINK-DATA-X.
                   15  LD-YEAR PIC X(04).
                   15  LD-MONTH PIC X(02).
               10  LINK-DATA-9 REDEFINES LINK-DATA-X.
                   15  LD-YR   PIC 9(04).
                   15  LD-YRB  REDEFINES LD-YR.
                       20  LDYR3 PIC 9(03).
                       20  LDYRL PIC 9.
                   15  LD-MON  PIC 9(02).

       01  MASTER-WO.
           05  MWO-NUM.
               10  MWO-NUMBER  PIC X(06).
               10  MWO-YEAR    PIC X.
           05  FILLER          PIC XXX VALUE "000".

       01  SCREEN-DATA.
           05  SD-EQUIP        PIC X(06).
           05  SD-WONUM.
               10  SD-WO       PIC X(07).
               10  SD-SUF      PIC X(03).
           05  SD-MONTH.
               10  SD-MO1      PIC X(01).
               10  SD-MO2      PIC X(01).
           05  SD-MON-99       REDEFINES SD-MONTH.
               10  SD-MONTH9   PIC 9(02).
           05  SD-YEAR.
               10  SD-CT       PIC X(02).
               10  SD-YY       PIC X(02).
           05  ERRMSG          PIC X(79).

       01  TODAYS-DATE.
           05  TD-YEARMO.
               10  TD-CT       PIC 99.
               10  TD-YY       PIC 99.
               10  TD-MM       PIC 99.
           05  TD-DD           PIC 99.

           COPY CATREAD        IN  COPYLIB.

           COPY SCREENIO       IN  COPYLIB.

           COPY LANGSUB        IN  COPYLIB.

       01  WO-PLANNED-DATA.
           COPY DWOPLAN        IN  COPYLIB.

       01  MESSAGE-BUFFER-DATA.
           COPY ERRORLIN       IN  COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.
           COPY DBPARMS        IN  COPYLIB.

       01  LAST-WO-USED-DATA.
           COPY MLASTWO        IN  COPYLIB.

       PROCEDURE DIVISION      USING DBPARAMETERS
                               LAST-WO-USED-DATA.
       1-HOUSEKEEPING.
           OPEN INPUT          WO-PLANNED
           OPEN I-O            DISPLAY-FILE.
           MOVE SPACES         TO MWO-NUM.
           MOVE SPACES         TO SCREEN-DATA.
           ACCEPT CURR-DATE    FROM DATE.
           MOVE CD-YY          TO TD-YY.
           MOVE CD-MM          TO TD-MM.
           MOVE CD-DD          TO TD-DD.
           MOVE 20             TO TD-CT.
           IF TD-YY > 90
               MOVE 19         TO TD-CT.
           MOVE TD-MM          TO SD-MONTH9.
           MOVE TD-CT          TO SD-CT.
           MOVE TD-YY          TO SD-YY.
           MOVE SD-YEAR        TO SAVE-YEAR.
           MOVE SD-MONTH       TO SAVE-MONTH.
           MOVE MASTER-WO      TO SD-WONUM.

       6-MAIN.
           MOVE "VCALSELECT"   TO SCREEN-NAME.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

       6-SHOWFORM.
           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATIS = "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ DISPLAY-FILE   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS = "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"        TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC     TO SCREEN-DATA.

           IF ERR-SW = "Y"
               MOVE "N"         TO ERR-SW
               MOVE SPACES      TO ERRMSG.

           IF KEY-HIT = 3 OR 8
               GO TO END-OF-JOB.

           IF SD-EQUIP = SPACES
               GO TO 6-SHOWFORM.

           IF SD-WO   = SPACES
               GO TO 6-SHOWFORM.

           MOVE "0 "           TO WS-RET-CODE.
           MOVE SD-WO          TO MWO-NUM.
           CALL "TALWONO"      USING SD-WONUM WS-RET-CODE.
           MOVE SD-WONUM       TO WONUM OF WO-PLANNED-REC.
           READ WO-PLANNED     INTO WO-PLANNED-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      ******************************************************************
      **    MESSAGE 035/040:
      ** INVALID WORKORDER NUMBER
      ******************************************************************
               MOVE  35        TO LANG-SETNUM
               MOVE  40        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE   1        TO FIELD-NUMBER
               PERFORM 99-ERROR
               GO TO 6-MAIN.

           IF WO-START-STATUS NOT = "AA"
      ******************************************************************
      **    MESSAGE 049/053:
      ** WORKORDER IS NOT DESIGNATED AS A 'PM' WORKORDER
      ******************************************************************
               MOVE  49        TO LANG-SETNUM
               MOVE  53        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE   1        TO FIELD-NUMBER
               PERFORM 99-ERROR
               GO TO 6-MAIN.

           IF APPROVAL-CODE-P NOT = "A "
      *********************************************************************
      **    MESSAGE 039/050:
      ** MASTER PM WORKORDER IS NOT APPROVED, CANNOT INITIATE PM SCHEDULE
      *********************************************************************
               MOVE  39        TO LANG-SETNUM
               MOVE  50        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE  4         TO FIELD-NUMBER
               PERFORM 99-ERROR
               GO TO 6-MAIN.

           IF EQUIP-NUM-P NOT = SD-EQUIP
      ******************************************************************
      **    MESSAGE 031/036:
      ** EQUIPMENT NUMBER ON WORKORDER DOES NOT MATCH EQUIPMENT ENTERED-
      ******************************************************************
               MOVE  31        TO LANG-SETNUM
               MOVE  36        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE   1        TO FIELD-NUMBER
               PERFORM 99-ERROR
               GO TO 6-MAIN.

           IF SD-YEAR = SPACES
               MOVE YEAR-SPACE-ERR TO MESSAGE-BUFFER
               PERFORM 99-ERROR
               GO TO 6-MAIN.

           IF SD-YEAR < "1990"
               MOVE YEAR-ERR   TO MESSAGE-BUFFER
               PERFORM 99-ERROR
               GO TO 6-MAIN.

           IF SD-YEAR > "2059"
               MOVE YEAR-ERR   TO MESSAGE-BUFFER
               PERFORM 99-ERROR
               GO TO 6-MAIN.

           IF SD-MONTH = SPACES
               MOVE MONTH-ERR  TO MESSAGE-BUFFER
               PERFORM 99-ERROR
               GO TO 6-MAIN.

           IF SD-MO2 = SPACE
               MOVE SD-MO1     TO SD-MO2
               MOVE "0"        TO SD-MO1.

           IF SD-MO1 = SPACE
               MOVE "0"        TO SD-MO1.

           IF SD-MONTH = "00" OR "0 " OR " 0"
               MOVE MONTH-ERR  TO MESSAGE-BUFFER
               PERFORM 99-ERROR
               GO TO 6-SHOWFORM.

           IF SD-MONTH NOT NUMERIC
      **********************************************************************
      **    MESSAGE 035/031:
      ** INVALID MONTH
      **********************************************************************
               MOVE  35        TO LANG-SETNUM
               MOVE  31        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE   2        TO FIELD-NUMBER
               PERFORM 99-ERROR
               GO TO 6-MAIN.

           IF SD-MON-99 > 12
      **********************************************************************
      **    MESSAGE 035/031:
      ** INVALID MONTH
      **********************************************************************
               MOVE  35        TO LANG-SETNUM
               MOVE  31        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE   2        TO FIELD-NUMBER
               PERFORM 99-ERROR
               GO TO 6-MAIN.

           MOVE SD-EQUIP       TO LINK-EQUIP.
           MOVE SD-WONUM       TO LINK-WONUM.
           MOVE ZONE-PRIORITY-P TO LINK-ZONE-PRI.
           MOVE SD-MONTH       TO LD-MONTH.
           MOVE SD-YEAR        TO LD-YEAR.

           IF KEY-HIT = 5
               CALL "SPMSEESK" USING LINK-DATA
                               DBPARAMETERS
                               LANGUAGE-PARMS
           ELSE
           IF KEY-HIT = 6
               CALL "SPMFIXDT" USING LINK-DATA
           ELSE
           IF KEY-HIT = 7
               CALL "SPMCLBLD" USING LINK-DATA
                               DBPARAMETERS
                               LANGUAGE-PARMS.
           GO TO 6-MAIN.

       END-OF-JOB.
           CLOSE               WO-PLANNED.
           CLOSE               DISPLAY-FILE.
           GOBACK.

       99-ERROR.
           MOVE MESSAGE-BUFFER TO ERRMSG.
           MOVE TRUE-VAL       TO IND(FIELD-NUMBER) IND(99).
           MOVE "Y"            TO ERR-SW.

       999-CATREAD.
           MOVE LANG-SETNUM    TO CATREAD-MSG-SET.
           MOVE LANG-MSGNUM    TO CATREAD-MSG-NUM.
           MOVE SPACES         TO MESSAGE-BUFFER,
           CALL "CCATREAD"     USING CATREAD-PARMS.
           IF CATREAD-MSG-NOT-FOUND
               MOVE "***ERROR***" TO MESSAGE-BUFFER
           ELSE
               MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.       EXIT.

