       IDENTIFICATION DIVISION.
       PROGRAM-ID.             SPMCLBLD.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
      *REMARKS.                PREVENTIVE MAINTENANCE SYSTEM
      *                        CALENDAR BUILD PROGRAM.
      *                        CREATE CALENDAR ENTRIES BY ENTERING
      *                        A LIST OF SPECIFIC DATES.
      *                        ****.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PM-SCHEDULE
                  ASSIGN       TO DATABASE-MCFLMM4401
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT PM-PR-SCHED
                  ASSIGN       TO DATABASE-MCFLMM4406
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZPMMAINT-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
        FILE SECTION.
        FD  PM-SCHEDULE
            LABEL RECORDS ARE STANDARD.
        01  PM-SCHED-REC.
            COPY DDS-ALL-FORMATS OF MCFLMM4401.

        FD  PM-PR-SCHED
            LABEL RECORDS ARE STANDARD.
        01  PM-PR-REC.
            COPY DDS-ALL-FORMATS OF MCFLMM4406.

        FD  DISPLAY-FILE
            LABEL RECORDS ARE OMITTED.
        01  DISPLAY-REC        PIC X(2000).

       WORKING-STORAGE SECTION.
       77  HELP-SW             PIC 9(04)  VALUE 0.
       77  TRUE-VAL            PIC 1      VALUE B"1".
       77  LAST-PR-TIME        PIC 9(07)  VALUE 0.
       77  CENTURY-P           PIC S9(4).
       77  WS-LAST-PR-TIME     PIC 9(07).
       77  HOLD-PR             PIC X(02)  VALUE "  ".
       77  HOLD-LEVEL          PIC X(02)  VALUE "  ".
       77  HOLD-DAY            PIC X(02)  VALUE "  ".
       77  HOLD-MONTH          PIC X(02)  VALUE "  ".
       77  HOLD-YEAR           PIC X(04)  VALUE "  ".
       77  D-PARM              PIC X.
       77  L-PARM              PIC X.

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X      VALUE "0".
           05 FILE-STAT-2      PIC X      VALUE "0".

       01  CURR-DATE.
           05  CNT-YY          PIC 99.
           05  CNT-MM          PIC 99.
           05  CNT-DD          PIC 99.

       01  TODAYS-DATE.
           05  TD-YEARMO.
               10  TD-CT       PIC 99.
               10  TD-YY       PIC 99.
               10  TD-MM       PIC 99.
           05  TD-DD           PIC 99.

       01  COMPARE-DATE.
           05  COMPARE-YRMO.
               10  CD-YEAR     PIC 9999.
               10  CD-MM       PIC 99.
           05  CD-DD           PIC 99.

       01  GREG-DATE.
           05  G-YEAR          PIC XXXX.
           05  G-MONTH         PIC XX.
           05  G-DAY           PIC XX.

       01  JUL-SIGN            PIC S9(06).
       01  JUL-DATE            PIC  X(07).
       01  JULIAN-DATE         REDEFINES JUL-DATE
                               PIC  9(07).
       01  FILLER              REDEFINES JUL-DATE.
           05  J-YEAR          PIC 9999.
           05  J-DAY           PIC 999.

       01  DEL-PR.
           05  DPR-RDT         PIC X(08).
           05  DPR-EQP         PIC X(06).
           05  DPR-PRD         PIC X(08).
           05  DPR-PRID        PIC X(10).

       01  PR-DATE.
           05  PR-DATE-YRMO.
               10  PR-DATE-YYYY.
                   15  PR-DATE-CT  PIC 99.
                   15  PR-DATE-YY  PIC 99.
               10  PR-DATE-MM      PIC 99.
           05  PR-DATE-DD          PIC 99.

       01  PR-ID.
           05  PR-DAY          PIC 9(03) VALUE 999.
           05  PR-TIME         PIC 9(07) VALUE ZEROS.

       01  WS-PR-ID.
           05  WS-PR-DAY       PIC 9(03).
           05  WS-PR-TIME.
             10  WS-PR-TIME-9  PIC 9(07).

       01  TIME-IN.
           05  TI-7            PIC 9(07).
           05  TI-8            PIC 9(01).

       01  SCREEN-DATA.
           05  SD-WONUM        PIC X(10).
           05  SD-EQUIP        PIC X(06).
           05  MONTH-D         PIC X(06).
           05  DAY-D           PIC X(06).
           05  SD-LINE-1.
               10 M-1          PIC XX.
               10 D-1          PIC XX.
               10 Y-1          PIC XXXX.
               10 L-1          PIC XX.
               10 PR-1         PIC XX.
           05  SD-LINE-2.
               10 M-2          PIC XX.
               10 D-2          PIC XX.
               10 Y-2          PIC XXXX.
               10 L-2          PIC XX.
               10 PR-2         PIC XX.
           05  SD-LINE-3.
               10 M-3          PIC XX.
               10 D-3          PIC XX.
               10 Y-3          PIC XXXX.
               10 L-3          PIC XX.
               10 PR-3         PIC XX.
           05  SD-LINE-4.
               10 M-4          PIC XX.
               10 D-4          PIC XX.
               10 Y-4          PIC XXXX.
               10 L-4          PIC XX.
               10 PR-4         PIC XX.
           05  SD-LINE-5.
               10 M-5          PIC XX.
               10 D-5          PIC XX.
               10 Y-5          PIC XXXX.
               10 L-5          PIC XX.
               10 PR-5         PIC XX.
           05  SD-LINE-6.
               10 M-6          PIC XX.
               10 D-6          PIC XX.
               10 Y-6          PIC XXXX.
               10 L-6          PIC XX.
               10 PR-6         PIC XX.
           05  SD-LINE-7.
               10 M-7          PIC XX.
               10 D-7          PIC XX.
               10 Y-7          PIC XXXX.
               10 L-7          PIC XX.
               10 PR-7         PIC XX.
           05  SD-LINE-8.
               10 M-8          PIC XX.
               10 D-8          PIC XX.
               10 Y-8          PIC XXXX.
               10 L-8          PIC XX.
               10 PR-8         PIC XX.
           05  SD-LINE-9.
               10 M-9          PIC XX.
               10 D-9          PIC XX.
               10 Y-9          PIC XXXX.
               10 L-9          PIC XX.
               10 PR-9         PIC XX.
           05  SD-LINE-10.
               10 M-10         PIC XX.
               10 D-10         PIC XX.
               10 Y-10         PIC XXXX.
               10 L-10         PIC XX.
               10 PR-10        PIC XX.
           05  SD-LINE-11.
               10 M-11         PIC XX.
               10 D-11         PIC XX.
               10 Y-11         PIC XXXX.
               10 L-11         PIC XX.
               10 PR-11        PIC XX.
           05  SD-LINE-12.
               10 M-12         PIC XX.
               10 D-12         PIC XX.
               10 Y-12         PIC XXXX.
               10 L-12         PIC XX.
               10 PR-12        PIC XX.
           05  SD-ERRMSG       PIC X(79).

       01  LINE-DATA.
           05 M-L.
               10 M-L1         PIC X.
               10 M-L2         PIC X.
           05 M9               REDEFINES M-L PIC 99.
           05 D-L.
               10 D-L1         PIC X.
               10 D-L2         PIC X.
           05 D9               REDEFINES D-L PIC 99.
           05 Y-L              PIC XXXX.
           05 Y9               REDEFINES Y-L PIC 9999.
           05 L-L.
               10 L-L1         PIC X.
               10 L-L2         PIC X.
           05 L9               REDEFINES L-L PIC 99.
           05 PR-L.
               10 PR-L1        PIC X.
               10 PR-L2        PIC X.
           05 PR9              REDEFINES PR-L PIC 99.

       01  BU-DISPLAY-AREA.
           05  FILLER          PIC XX.
           05  BU-DISPLAY-MSG  PIC X(27).
           05  FILLER          PIC XX.
           05  BU-DISPLAY-STAT PIC S9(4).
           05  FILLER          PIC XX.
           05  BU-DISPLAY-FLD  PIC X(14).
           05  FILLER          PIC XX.

           COPY CATREAD        IN COPYLIB.

           COPY SCREENIO       IN COPYLIB.

           COPY VCOMLINK       IN COPYLIB.

       01  MESSAGE-DATA.
           COPY ERRORLIN       IN COPYLIB.

       01  PMS-DATA1.
           COPY DPMSCHED       IN COPYLIB.

       01  PMS-DATA2.
           COPY DPMSCHED       IN COPYLIB.

       LINKAGE SECTION.
       01  LINK-DATA.
           05 LINK-EQUIP       PIC X(06).
           05 LINK-WONUM.
               10 LINK-WO      PIC X(07).
               10 LINK-SUF     PIC X(03).
           05 LINK-ZONE-PRI    PIC X(06).
           05 LINK-YRMO.
               10 LINK-DATA-X.
                   15  LD-YEAR     PIC X(04).
                   15  LD-MONTH    PIC X(02).
               10 LINK-DATA-9      REDEFINES LINK-DATA-X.
                   15  LD-YR       PIC 9(04).
                   15  LD-YRB      REDEFINES LD-YR.
                       20  LDYR3   PIC 9(03).
                       20  LDYRL   PIC 9.
                   15  LD-MON      PIC 9(02).

       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

           COPY LANGSUB        IN COPYLIB.

       PROCEDURE DIVISION      USING LINK-DATA
                               DBPARAMETERS
                               LANGUAGE-PARMS.
       BEGIN-PROC.
           OPEN I-O            PM-SCHEDULE
                               PM-PR-SCHED
                               DISPLAY-FILE.

           ACCEPT CURR-DATE    FROM DATE.
           MOVE CNT-YY         TO TD-YY.
           MOVE CNT-MM         TO TD-MM.
           MOVE CNT-DD         TO TD-DD.
           MOVE 20             TO TD-CT.
           IF TD-YY > 90
               MOVE 19         TO TD-CT.

           IF TODAYS-DATE > "20600100"
             MOVE "VFIXABORT"  TO SCREEN-NAME
             WRITE DISPLAY-REC FORMAT IS SCREEN-NAME
                 INDIC ARE SCREEN-INDICATORS
             IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB
             ELSE
               READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
                   INDIC ARE SCREEN-INDICATORS
               IF SCREEN-STATUS NOT = "00"
                 DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
                 GO TO END-OF-JOB
               ELSE
                 GOBACK.

           MOVE ZEROS          TO WS-LAST-PR-TIME.
           MOVE "VBUILDCAL"    TO SCREEN-NAME.

       SETFORM.
           MOVE SPACES         TO SCREEN-DATA MESSAGE-BUFFER PMS-DATA1
                                  PMS-DATA2 HOLD-PR HOLD-LEVEL
                                  HOLD-DAY HOLD-MONTH HOLD-YEAR.
           MOVE LINK-WONUM     TO SD-WONUM.
           MOVE LINK-EQUIP     TO SD-EQUIP.
           MOVE "Month:"       TO MONTH-D.
           MOVE " Day: "       TO DAY-D.
           IF DATE-FLAG = 3
               MOVE " Day: "   TO MONTH-D
               MOVE "Month:"   TO DAY-D.

       SHOWFORM.
           MOVE SCREEN-DATA    TO DISPLAY-REC.
           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO SCREEN-DATA.

           IF KEY-HIT = 3 OR 8
               GO TO END-OF-JOB.

           IF KEY-HIT = 7
               MOVE 47         TO HELP-SW
               CALL "SPMHELPM" USING HELP-SW
               GO TO SHOWFORM.

           IF KEY-HIT = 4
               PERFORM FILL-DATA THRU FD-EXIT
               GO TO SHOWFORM.

       EDIT-SCREEN-DATA.
           IF SD-LINE-1  NOT = SPACES
               MOVE SD-LINE-1  TO LINE-DATA
               MOVE 0          TO FIELD-NUMBER
               PERFORM EDIT-DATA THRU ED-EXIT
               IF FIELD-NUMBER NOT = 0
                   PERFORM 99-ERROR
                   GO TO SHOWFORM
               ELSE
               MOVE LINE-DATA  TO SD-LINE-1.

           IF SD-LINE-2  NOT = SPACES
               MOVE SD-LINE-2  TO LINE-DATA
               MOVE 0          TO FIELD-NUMBER
               PERFORM EDIT-DATA THRU ED-EXIT
               IF FIELD-NUMBER NOT = 0
                   ADD  5      TO FIELD-NUMBER
                   PERFORM 99-ERROR
                   GO TO SHOWFORM
               ELSE
               MOVE LINE-DATA  TO SD-LINE-2.

           IF SD-LINE-3  NOT = SPACES
               MOVE SD-LINE-3  TO LINE-DATA
               MOVE 0          TO FIELD-NUMBER
               PERFORM EDIT-DATA THRU ED-EXIT
               IF FIELD-NUMBER NOT = 0
                   ADD 10      TO FIELD-NUMBER
                   PERFORM 99-ERROR
                   GO TO SHOWFORM
               ELSE
               MOVE LINE-DATA  TO SD-LINE-3.

           IF SD-LINE-4  NOT = SPACES
               MOVE SD-LINE-4  TO LINE-DATA
               MOVE 0          TO FIELD-NUMBER
               PERFORM EDIT-DATA THRU ED-EXIT
               IF FIELD-NUMBER NOT = 0
                   ADD 15      TO FIELD-NUMBER
                   PERFORM 99-ERROR
                   GO TO SHOWFORM
               ELSE
               MOVE LINE-DATA  TO SD-LINE-4.

           IF SD-LINE-5  NOT = SPACES
               MOVE SD-LINE-5  TO LINE-DATA
               MOVE 0          TO FIELD-NUMBER
               PERFORM EDIT-DATA THRU ED-EXIT
               IF FIELD-NUMBER NOT = 0
                   ADD 20      TO FIELD-NUMBER
                   PERFORM 99-ERROR
                   GO TO SHOWFORM
               ELSE
               MOVE LINE-DATA  TO SD-LINE-5.

           IF SD-LINE-6  NOT = SPACES
               MOVE SD-LINE-6  TO LINE-DATA
               MOVE 0          TO FIELD-NUMBER
               PERFORM EDIT-DATA THRU ED-EXIT
               IF FIELD-NUMBER NOT = 0
                   ADD 25      TO FIELD-NUMBER
                   PERFORM 99-ERROR
                   GO TO SHOWFORM
               ELSE
               MOVE LINE-DATA  TO SD-LINE-6.

           IF SD-LINE-7  NOT = SPACES
               MOVE SD-LINE-7  TO LINE-DATA
               MOVE 0          TO FIELD-NUMBER
               PERFORM EDIT-DATA THRU ED-EXIT
               IF FIELD-NUMBER NOT = 0
                   ADD 30      TO FIELD-NUMBER
                   PERFORM 99-ERROR
                   GO TO SHOWFORM
               ELSE
               MOVE LINE-DATA  TO SD-LINE-7.

           IF SD-LINE-8  NOT = SPACES
               MOVE SD-LINE-8  TO LINE-DATA
               MOVE 0          TO FIELD-NUMBER
               PERFORM EDIT-DATA THRU ED-EXIT
               IF FIELD-NUMBER NOT = 0
                   ADD 35      TO FIELD-NUMBER
                   PERFORM 99-ERROR
                   GO TO SHOWFORM
               ELSE
               MOVE LINE-DATA  TO SD-LINE-8.

           IF SD-LINE-9  NOT = SPACES
               MOVE SD-LINE-9  TO LINE-DATA
               MOVE 0          TO FIELD-NUMBER
               PERFORM EDIT-DATA THRU ED-EXIT
               IF FIELD-NUMBER NOT = 0
                   ADD 40      TO FIELD-NUMBER
                   PERFORM 99-ERROR
                   GO TO SHOWFORM
               ELSE
               MOVE LINE-DATA  TO SD-LINE-9.

           IF SD-LINE-10 NOT = SPACES
               MOVE SD-LINE-10 TO LINE-DATA
               MOVE 0          TO FIELD-NUMBER
               PERFORM EDIT-DATA THRU ED-EXIT
               IF FIELD-NUMBER NOT = 0
                   ADD 45      TO FIELD-NUMBER
                   PERFORM 99-ERROR
                   GO TO SHOWFORM
               ELSE
               MOVE LINE-DATA  TO SD-LINE-10.

           IF SD-LINE-11 NOT = SPACES
               MOVE SD-LINE-11 TO LINE-DATA
               MOVE 0          TO FIELD-NUMBER
               PERFORM EDIT-DATA THRU ED-EXIT
               IF FIELD-NUMBER NOT = 0
                   ADD 50      TO FIELD-NUMBER
                   PERFORM 99-ERROR
                   GO TO SHOWFORM
               ELSE
               MOVE LINE-DATA  TO SD-LINE-11.

           IF SD-LINE-12 NOT = SPACES
               MOVE SD-LINE-12 TO LINE-DATA
               MOVE 0          TO FIELD-NUMBER
               PERFORM EDIT-DATA THRU ED-EXIT
               IF FIELD-NUMBER NOT = 0
                   ADD 55      TO FIELD-NUMBER
                   PERFORM 99-ERROR
                   GO TO SHOWFORM
               ELSE
               MOVE LINE-DATA  TO SD-LINE-12.

       WRITE-SCREEN-DATA.
           IF SD-LINE-1  NOT = SPACES
               MOVE SD-LINE-1  TO LINE-DATA
               PERFORM WRITE-SCHEDULE THRU WS-EXIT
               MOVE SPACES     TO SD-LINE-1.

           IF SD-LINE-2  NOT = SPACES
               MOVE SD-LINE-2  TO LINE-DATA
               PERFORM WRITE-SCHEDULE THRU WS-EXIT
               MOVE SPACES     TO SD-LINE-2.

           IF SD-LINE-3  NOT = SPACES
               MOVE SD-LINE-3  TO LINE-DATA
               PERFORM WRITE-SCHEDULE THRU WS-EXIT
               MOVE SPACES     TO SD-LINE-3.

           IF SD-LINE-4  NOT = SPACES
               MOVE SD-LINE-4  TO LINE-DATA
               PERFORM WRITE-SCHEDULE THRU WS-EXIT
               MOVE SPACES     TO SD-LINE-4.

           IF SD-LINE-5  NOT = SPACES
               MOVE SD-LINE-5  TO LINE-DATA
               PERFORM WRITE-SCHEDULE THRU WS-EXIT
               MOVE SPACES     TO SD-LINE-5.

           IF SD-LINE-6  NOT = SPACES
               MOVE SD-LINE-6  TO LINE-DATA
               PERFORM WRITE-SCHEDULE THRU WS-EXIT
               MOVE SPACES     TO SD-LINE-6.

           IF SD-LINE-7  NOT = SPACES
               MOVE SD-LINE-7  TO LINE-DATA
               PERFORM WRITE-SCHEDULE THRU WS-EXIT
               MOVE SPACES     TO SD-LINE-7.

           IF SD-LINE-8  NOT = SPACES
               MOVE SD-LINE-8  TO LINE-DATA
               PERFORM WRITE-SCHEDULE THRU WS-EXIT
               MOVE SPACES     TO SD-LINE-8.

           IF SD-LINE-9  NOT = SPACES
               MOVE SD-LINE-9  TO LINE-DATA
               PERFORM WRITE-SCHEDULE THRU WS-EXIT
               MOVE SPACES     TO SD-LINE-9.

           IF SD-LINE-10 NOT = SPACES
               MOVE SD-LINE-10 TO LINE-DATA
               PERFORM WRITE-SCHEDULE THRU WS-EXIT
               MOVE SPACES     TO SD-LINE-10.

           IF SD-LINE-11 NOT = SPACES
               MOVE SD-LINE-11 TO LINE-DATA
               PERFORM WRITE-SCHEDULE THRU WS-EXIT
               MOVE SPACES     TO SD-LINE-11.

           IF SD-LINE-12 NOT = SPACES
               MOVE SD-LINE-12 TO LINE-DATA
               PERFORM WRITE-SCHEDULE THRU WS-EXIT
               MOVE SPACES     TO SD-LINE-12.

           GO TO SETFORM.

       EDIT-DATA.
           IF M-L = SPACES
               MOVE HOLD-MONTH TO M-L.
           IF D-L = SPACES
               MOVE HOLD-DAY   TO D-L.
           IF Y-L = SPACES
               MOVE HOLD-YEAR  TO Y-L.
           IF L-L = SPACES
               MOVE HOLD-LEVEL TO L-L.
           IF PR-L = SPACES
               MOVE HOLD-PR    TO PR-L.

           IF M-L = SPACES  OR "00"
               MOVE 1          TO FIELD-NUMBER.
           IF D-L = SPACES  OR "00"
               MOVE 2          TO FIELD-NUMBER.
           IF Y-L = SPACES  OR "0000"
               MOVE 3          TO FIELD-NUMBER.
           IF L-L = SPACES  OR "00"
               MOVE 4          TO FIELD-NUMBER.
           IF PR-L = SPACES
               MOVE "00"       TO PR-L.

           IF FIELD-NUMBER NOT = 0
      *M********************************************************************
      *M    MESSAGE 035/105
      *M   INVALID ENTRY
      *M********************************************************************
               MOVE  35        TO LANG-SETNUM
               MOVE 105        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               GO TO ED-EXIT.

           IF M-L2 = SPACE
               MOVE M-L1       TO M-L2
               MOVE 0          TO M-L1.
           IF M-L2 = SPACE
               MOVE M-L1       TO M-L2
               MOVE 0          TO M-L1.
           IF M-L1 = SPACE
               MOVE 0          TO M-L1.

           IF D-L2 = SPACE
               MOVE D-L1       TO D-L2
               MOVE 0          TO D-L1.
           IF D-L2 = SPACE
               MOVE D-L1       TO D-L2
               MOVE 0          TO D-L1.
           IF D-L1 = SPACE
               MOVE 0          TO D-L1.

           IF L-L2 = SPACE
               MOVE L-L1       TO L-L2
               MOVE 0          TO L-L1.
           IF L-L2 = SPACE
               MOVE L-L1       TO L-L2
               MOVE 0          TO L-L1.
           IF L-L1 = SPACE
               MOVE 0          TO L-L1.

           IF PR-L2 = SPACE
               MOVE PR-L1      TO PR-L2
               MOVE 0          TO PR-L1.
           IF PR-L2 = SPACE
               MOVE PR-L1      TO PR-L2
               MOVE 0          TO PR-L1.
           IF PR-L1 = SPACE
               MOVE 0          TO PR-L1.

           IF M-L NOT NUMERIC
               MOVE 1          TO FIELD-NUMBER.
           IF D-L NOT NUMERIC
               MOVE 2          TO FIELD-NUMBER.
           IF Y-L NOT NUMERIC
               MOVE 3          TO FIELD-NUMBER.
           IF L-L NOT NUMERIC
               MOVE 4          TO FIELD-NUMBER.
           IF PR-L NOT NUMERIC
               MOVE 5          TO FIELD-NUMBER.

           IF FIELD-NUMBER NOT = 0
      *M********************************************************************
      *M    MESSAGE 020/047:
      *M T47: THIS ENTRY MUST BE NUMERIC
      *M********************************************************************
               MOVE  20        TO LANG-SETNUM
               MOVE  47        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               GO TO ED-EXIT.

           IF DATE-FLAG = 1
               IF M9 > 0 AND M9 < 13
                   IF D9 > 0 AND D9 < 32
                       NEXT SENTENCE
                   ELSE
      *C********************************************************************
      *C    MESSAGE 035/030:
      *C  INVALID DAY
      *C********************************************************************
                   MOVE 35     TO LANG-SETNUM
                   MOVE 30     TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE  2     TO FIELD-NUMBER
                   GO TO ED-EXIT
               ELSE
      *C********************************************************************
      *C    MESSAGE 035/031:
      *C  INVALID MONTH
      *C********************************************************************
                   MOVE 35     TO LANG-SETNUM
                   MOVE 31     TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE  1     TO FIELD-NUMBER
                   GO TO ED-EXIT
           ELSE
               IF M9 > 0 AND M9 < 32
                   IF D9 > 0 AND D9 < 13
                       NEXT SENTENCE
                   ELSE
      *C********************************************************************
      *C    MESSAGE 035/031:
      *C  INVALID MONTH
      *C********************************************************************
                   MOVE 35     TO LANG-SETNUM
                   MOVE 31     TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE  2     TO FIELD-NUMBER
                   GO TO ED-EXIT
               ELSE
      *C********************************************************************
      *C    MESSAGE 035/030:
      *C  INVALID DAY
      *C********************************************************************
               MOVE 35         TO LANG-SETNUM
               MOVE 30         TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE  1         TO FIELD-NUMBER
               GO TO ED-EXIT.

           MOVE PR-L           TO HOLD-PR.
           MOVE L-L            TO HOLD-LEVEL.
           MOVE Y-L            TO HOLD-YEAR.
           MOVE M-L            TO HOLD-MONTH.
           MOVE D-L            TO HOLD-DAY.
           MOVE Y9             TO CD-YEAR.
           MOVE M9             TO CD-MM.
           MOVE D9             TO CD-DD.

           IF DATE-FLAG = 3
               MOVE D9         TO CD-MM
               MOVE M9         TO CD-DD.

           IF TODAYS-DATE > COMPARE-DATE
               MOVE  SPACES    TO LINE-DATA
               MOVE  SCREEN-DATA TO DISPLAY-REC
               GO TO ED-EXIT.

       ED-EXIT.                EXIT.

       FILL-DATA.
           IF SD-LINE-1  NOT = SPACES
               MOVE SD-LINE-1  TO LINE-DATA
               PERFORM FILL-LINE THRU FL-EXIT
               MOVE LINE-DATA  TO SD-LINE-1.

           IF SD-LINE-2  NOT = SPACES
               MOVE SD-LINE-2  TO LINE-DATA
               PERFORM FILL-LINE THRU FL-EXIT
               MOVE LINE-DATA  TO SD-LINE-2.

           IF SD-LINE-3  NOT = SPACES
               MOVE SD-LINE-3  TO LINE-DATA
               PERFORM FILL-LINE THRU FL-EXIT
               MOVE LINE-DATA  TO SD-LINE-3.

           IF SD-LINE-4  NOT = SPACES
               MOVE SD-LINE-4  TO LINE-DATA
               PERFORM FILL-LINE THRU FL-EXIT
               MOVE LINE-DATA  TO SD-LINE-4.

           IF SD-LINE-5  NOT = SPACES
               MOVE SD-LINE-5  TO LINE-DATA
               PERFORM FILL-LINE THRU FL-EXIT
               MOVE LINE-DATA  TO SD-LINE-5.

           IF SD-LINE-6  NOT = SPACES
               MOVE SD-LINE-6  TO LINE-DATA
               PERFORM FILL-LINE THRU FL-EXIT
               MOVE LINE-DATA  TO SD-LINE-6.

           IF SD-LINE-7  NOT = SPACES
               MOVE SD-LINE-7  TO LINE-DATA
               PERFORM FILL-LINE THRU FL-EXIT
               MOVE LINE-DATA  TO SD-LINE-7.

           IF SD-LINE-8  NOT = SPACES
               MOVE SD-LINE-8  TO LINE-DATA
               PERFORM FILL-LINE THRU FL-EXIT
               MOVE LINE-DATA  TO SD-LINE-8.

           IF SD-LINE-9  NOT = SPACES
               MOVE SD-LINE-9  TO LINE-DATA
               PERFORM FILL-LINE THRU FL-EXIT
               MOVE LINE-DATA  TO SD-LINE-9.

           IF SD-LINE-10 NOT = SPACES
               MOVE SD-LINE-10 TO LINE-DATA
               PERFORM FILL-LINE THRU FL-EXIT
               MOVE LINE-DATA  TO SD-LINE-10.

           IF SD-LINE-11 NOT = SPACES
               MOVE SD-LINE-11 TO LINE-DATA
               PERFORM FILL-LINE THRU FL-EXIT
               MOVE LINE-DATA  TO SD-LINE-11.

           IF SD-LINE-12 NOT = SPACES
               MOVE SD-LINE-12 TO LINE-DATA
               PERFORM FILL-LINE THRU FL-EXIT
               MOVE LINE-DATA  TO SD-LINE-12.

       FD-EXIT.                EXIT.

       FILL-LINE.
           IF M-L = SPACES
               MOVE HOLD-MONTH TO M-L.
           IF D-L = SPACES
               MOVE HOLD-DAY   TO D-L.
           IF Y-L = SPACES
               MOVE HOLD-YEAR  TO Y-L.
           IF L-L = SPACES
               MOVE HOLD-LEVEL TO L-L.
           IF PR-L = SPACES
               MOVE HOLD-PR    TO PR-L.

           MOVE PR-L           TO HOLD-PR.
           MOVE L-L            TO HOLD-LEVEL.
           MOVE Y-L            TO HOLD-YEAR.
           MOVE M-L            TO HOLD-MONTH.
           MOVE D-L            TO HOLD-DAY.

       FL-EXIT.                EXIT.

       WRITE-SCHEDULE.
           MOVE Y9             TO CD-YEAR.
           MOVE M9             TO CD-MM.
           MOVE D9             TO CD-DD.

           IF DATE-FLAG = 3
               MOVE D9         TO CD-MM
               MOVE M9         TO CD-DD.

           PERFORM FIND-AND-DELETE THRU FAD-EXIT.

           MOVE SPACES         TO PMS-DATA1.
           MOVE COMPARE-DATE   TO SCH-RELEASE-DATE   OF PMS-DATA1.
           MOVE COMPARE-YRMO   TO SCH-RELEASE-YRMO   OF PMS-DATA1.
           MOVE "CL  "         TO SCH-REC-TYPE       OF PMS-DATA1.
           MOVE LINK-EQUIP     TO SCH-EQUIP-NUM      OF PMS-DATA1.
           MOVE LINK-WONUM     TO SCH-WO-NUM         OF PMS-DATA1.
           MOVE LINK-ZONE-PRI  TO SCH-ZONE-PRI       OF PMS-DATA1.
           MOVE L9             TO SCH-LEVEL          OF PMS-DATA1.
           MOVE 5              TO SCH-PRIORITY       OF PMS-DATA1.

           IF PR9 IS NUMERIC AND PR9 > 0
               MOVE PR9        TO SCH-REST-PR        OF PMS-DATA1
               PERFORM CALC-PR-DATE THRU CPD-EXIT
               PERFORM CALC-PR-ID   THRU CPI-EXIT
               MOVE    PR-ID   TO SCH-PR-ID          OF PMS-DATA1
               MOVE    PR-DATE TO SCH-PREREL-DATE    OF PMS-DATA1.

           WRITE PM-SCHED-REC  FROM PMS-DATA1
               INVALID KEY     GO TO WS-EXIT.
           IF FILE-STAT NOT = "00"
               DISPLAY "   "
               DISPLAY "  WRITE RELEASE RECORD:"
               DISPLAY PMS-DATA1
               DISPLAY "  FILE-STATUS = " FILE-STAT
               DISPLAY "   ".

           IF PR9 IS NUMERIC AND PR9 = 0
               GO TO WS-EXIT.

           MOVE "PR"           TO SCH-REC-PR         OF PMS-DATA1.
           MOVE SCH-RELEASE-DATE                     OF PMS-DATA1
                               TO SCH-PREREL-DATE    OF PMS-DATA1.
           MOVE PR-DATE        TO SCH-RELEASE-DATE   OF PMS-DATA1.
           MOVE PR-DATE-YRMO   TO SCH-RELEASE-YRMO   OF PMS-DATA1.

           WRITE PM-SCHED-REC  FROM PMS-DATA1
               INVALID KEY     GO TO WS-EXIT.
           IF FILE-STAT NOT = "00"
               DISPLAY "   "
               DISPLAY "  WRITE PRE-RELEASE RECORD:"
               DISPLAY PMS-DATA1
               DISPLAY "  FILE-STATUS = " FILE-STAT
               DISPLAY "   ".

       WS-EXIT.                EXIT.

       FIND-AND-DELETE.
           MOVE COMPARE-DATE   TO PMRLSEDATE         OF PM-SCHED-REC.
           START PM-SCHEDULE   KEY = PMRLSEDATE      OF PM-SCHED-REC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO FAD-EXIT.

       DELETE-LOOP.
           READ PM-SCHEDULE    NEXT INTO PMS-DATA1
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO FAD-EXIT.

           IF SCH-RELEASE-DATE OF PMS-DATA1 NOT = COMPARE-DATE
               GO TO FAD-EXIT.

           IF SCH-EQUIP-NUM    OF PMS-DATA1 NOT = LINK-EQUIP
               GO TO DELETE-LOOP.

           IF SCH-WO           OF PMS-DATA1 NOT = LINK-WO
               GO TO DELETE-LOOP.

           IF SCH-REC-TYPE     OF PMS-DATA1     = "CLPR"
               GO TO DELETE-LOOP.

           IF SCH-REC-TYP      OF PMS-DATA1 NOT = "CL"
               GO TO DELETE-LOOP.

           IF SCH-PREREL-DATE  OF PMS-DATA1 NOT = SPACES
               MOVE SCH-RELEASE-DATE   OF PMS-DATA1  TO DPR-RDT
               MOVE SCH-EQUIP-NUM      OF PMS-DATA1  TO DPR-EQP
               MOVE SCH-PREREL-DATE    OF PMS-DATA1  TO DPR-PRD
               MOVE SCH-PR-ID          OF PMS-DATA1  TO DPR-PRID
               PERFORM DELETE-PR-LOOP  THRU DELETE-PR-EXIT.

           DELETE              PM-SCHEDULE
              INVALID KEY      GO TO FAD-EXIT.
           IF FILE-STAT NOT = "00"
               DISPLAY "   "
               DISPLAY "  DELETE RELEASE RECORD:"
               DISPLAY PMS-DATA1
               DISPLAY "  FILE-STATUS = " FILE-STAT
               DISPLAY "   ".

           GO TO DELETE-LOOP.

       FAD-EXIT.               EXIT.

       DELETE-PR-LOOP.
           MOVE DPR-RDT        TO PMPRERELDT         OF PM-PR-SCHED.
           START PM-PR-SCHED   KEY = PMPRERELDT      OF PM-PR-SCHED
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO DELETE-PR-EXIT.

       READ-PR-LOOP.
           READ PM-PR-SCHED    NEXT INTO PMS-DATA2
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO DELETE-PR-EXIT.

           IF SCH-PREREL-DATE  OF PMS-DATA2 NOT = DPR-RDT
               GO TO DELETE-PR-EXIT.

           IF SCH-PR-ID        OF PMS-DATA2 NOT = DPR-PRID
               GO TO READ-PR-LOOP.

           DELETE              PM-PR-SCHED
               INVALID KEY     GO TO DELETE-PR-EXIT.
           IF FILE-STAT NOT = "00"
               DISPLAY "   "
               DISPLAY "  DELETE PRE-RELEASE RECORD:"
               DISPLAY PMS-DATA2
               DISPLAY "  FILE-STATUS = " FILE-STAT
               DISPLAY "   ".

           GO TO READ-PR-LOOP.

       DELETE-PR-EXIT.           EXIT.

       CALC-PR-DATE.
           MOVE SCH-RELEASE-DATE
                               OF PMS-DATA1 TO GREG-DATE.
           MOVE SPACES         TO JUL-DATE D-PARM L-PARM.
           CALL "JULGREG"      USING
                               GREG-DATE
                               JUL-DATE
                               D-PARM
                               L-PARM.

           MOVE J-DAY          TO JUL-SIGN.
           SUBTRACT SCH-REST-PR
                               OF PMS-DATA1 FROM JUL-SIGN.
           PERFORM UNTIL       JUL-SIGN > 0
               ADD 365         TO JUL-SIGN
               SUBTRACT 1      FROM J-YEAR
           END-PERFORM.

           MOVE JUL-SIGN       TO J-DAY.
           MOVE SPACES         TO GREG-DATE.
           CALL "JULGREG"      USING
                               GREG-DATE
                               JUL-DATE
                               D-PARM
                               L-PARM.

           MOVE GREG-DATE      TO PR-DATE.

       CPD-EXIT.               EXIT.

       CALC-PR-ID.
           MOVE TODAYS-DATE    TO GREG-DATE.
           MOVE SPACES         TO JUL-DATE D-PARM L-PARM.
           CALL "JULGREG"      USING
                               GREG-DATE
                               JUL-DATE
                               D-PARM
                               L-PARM.

           MOVE J-DAY          TO WS-PR-DAY PR-DAY.
           ACCEPT TIME-IN      FROM TIME.
           MOVE TI-7           TO WS-PR-TIME.
           IF WS-PR-TIME-9 NOT > WS-LAST-PR-TIME
               ADD 1           TO WS-LAST-PR-TIME GIVING WS-PR-TIME-9.
           MOVE WS-PR-TIME-9   TO PR-TIME WS-LAST-PR-TIME.

       CPI-EXIT.               EXIT.

       END-OF-JOB.
           CLOSE               PM-SCHEDULE
                               PM-PR-SCHED
                               DISPLAY-FILE.
           GOBACK.

       999-CATREAD.
           MOVE LANG-SETNUM    TO CATREAD-MSG-SET.
           MOVE LANG-MSGNUM    TO CATREAD-MSG-NUM.
           MOVE SPACES         TO MESSAGE-BUFFER,
           CALL "CCATREAD"     USING CATREAD-PARMS.
           IF CATREAD-MSG-NOT-FOUND
               MOVE "***ERROR***" TO MESSAGE-BUFFER
           ELSE
               MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.       EXIT.

       99-ERROR.
           MOVE MESSAGE-BUFFER TO SD-ERRMSG.
           MOVE TRUE-VAL       TO IND(FIELD-NUMBER) IND(99).

