       IDENTIFICATION DIVISION.
       PROGRAM-ID.             SPMFIXDT.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
      *REMARKS.                PREVENTIVE MAINTENANCE FIXED-DATE
      *                        AND CALENDAR RELEASE PROGRAMS.
      *                        UPDATE CALENDAR SCHEDULES PROGRAM.
      *                        ****.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PM-SCHEDULE
                  ASSIGN       TO DATABASE-MCFLMM4402
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZPMMAINT-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
        FILE SECTION.
        FD  PM-SCHEDULE
            LABEL RECORDS      ARE STANDARD.
        01  PM-SCHED-REC.
            COPY DDS-ALL-FORMATS OF MCFLMM4402.

        FD  DISPLAY-FILE
            LABEL RECORDS      ARE OMITTED.
        01  DISPLAY-REC        PIC X(2000).

       WORKING-STORAGE SECTION.
       77  TRUE-VAL            PIC 1      VALUE B"1".
       77  SUB                 PIC 9(04)  VALUE 0 COMP.
       77  R-CTR               PIC 9(04)  VALUE 0 COMP.
       77  HELP-SW             PIC 9(04)  VALUE 0.
       77  SAVE-DATA           PIC X(06)  VALUE SPACES.
       77  MO-NAME             PIC X(09)  VALUE SPACES.
       77  RET-CODE            PIC XX     VALUE "0 ".
       77  MO-ERROR            PIC X(76)  VALUE SPACES.
       77  MARK                PIC X.
       77  ANSWER-FIELD        PIC X.

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       01  CURR-DATE.
           05  CD-YY           PIC 99.
           05  CD-MM           PIC 99.
           05  CD-DD           PIC 99.

       01  TODAYS-DATE.
           05  TD-YEARMO.
               10  TD-CT       PIC 99.
               10  TD-YY       PIC 99.
               10  TD-MM       PIC 99.
           05  TD-DD           PIC 99.

       01  SAVE-FIELDS.
           05  W-SAVE.
               10  W-SAVE1     PIC X.
               10  W-SAVE2     PIC X.
           05  W-SAVE-9        REDEFINES W-SAVE
                               PIC 99.
           05  R-SAVE          PIC X.

       01  R-SAVE-TABLE.
           05  RESTRICT        OCCURS 31 TIMES.
               10 R-1          PIC X.
               10 R-2          PIC X.
               10 R-PRX        PIC XX.
               10 R-PR         REDEFINES R-PRX
                               PIC 99.
           05  R-TAB           OCCURS 31 TIMES
                               PIC X.

       01  SCREEN-DATA.
           05  SD-TITLE        PIC X(50).
           05  SD-WEEK-1.
               10  SD-WK1.
                   15 SDWK11   PIC XXX.
                   15 SDWK12   PIC XXX.
                   15 SDWK13   PIC XXX.
                   15 SDWK14   PIC XXX.
                   15 SDWK15   PIC XXX.
                   15 SDWK16   PIC XXX.
                   15 SDWK17   PIC XXX.
               10  W1-LEV-R.
                   15 W1-L1    PIC XX.
                   15 W1-R1    PIC X.
                   15 W1-L2    PIC XX.
                   15 W1-R2    PIC X.
                   15 W1-L3    PIC XX.
                   15 W1-R3    PIC X.
                   15 W1-L4    PIC XX.
                   15 W1-R4    PIC X.
                   15 W1-L5    PIC XX.
                   15 W1-R5    PIC X.
                   15 W1-L6    PIC XX.
                   15 W1-R6    PIC X.
                   15 W1-L7    PIC XX.
                   15 W1-R7    PIC X.
           05  SD-WEEK-2.
               10  SD-WK2.
                   15 SDWK21   PIC XXX.
                   15 SDWK22   PIC XXX.
                   15 SDWK23   PIC XXX.
                   15 SDWK24   PIC XXX.
                   15 SDWK25   PIC XXX.
                   15 SDWK26   PIC XXX.
                   15 SDWK27   PIC XXX.
               10  W2-LEV-R.
                   15 W2-L1    PIC XX.
                   15 W2-R1    PIC X.
                   15 W2-L2    PIC XX.
                   15 W2-R2    PIC X.
                   15 W2-L3    PIC XX.
                   15 W2-R3    PIC X.
                   15 W2-L4    PIC XX.
                   15 W2-R4    PIC X.
                   15 W2-L5    PIC XX.
                   15 W2-R5    PIC X.
                   15 W2-L6    PIC XX.
                   15 W2-R6    PIC X.
                   15 W2-L7    PIC XX.
                   15 W2-R7    PIC X.
           05  SD-WEEK-3.
               10  SD-WK3.
                   15 SDWK31   PIC XXX.
                   15 SDWK32   PIC XXX.
                   15 SDWK33   PIC XXX.
                   15 SDWK34   PIC XXX.
                   15 SDWK35   PIC XXX.
                   15 SDWK36   PIC XXX.
                   15 SDWK37   PIC XXX.
               10  W3-LEV-R.
                   15 W3-L1    PIC XX.
                   15 W3-R1    PIC X.
                   15 W3-L2    PIC XX.
                   15 W3-R2    PIC X.
                   15 W3-L3    PIC XX.
                   15 W3-R3    PIC X.
                   15 W3-L4    PIC XX.
                   15 W3-R4    PIC X.
                   15 W3-L5    PIC XX.
                   15 W3-R5    PIC X.
                   15 W3-L6    PIC XX.
                   15 W3-R6    PIC X.
                   15 W3-L7    PIC XX.
                   15 W3-R7    PIC X.
           05  SD-WEEK-4.
               10  SD-WK4.
                   15 SDWK41   PIC XXX.
                   15 SDWK42   PIC XXX.
                   15 SDWK43   PIC XXX.
                   15 SDWK44   PIC XXX.
                   15 SDWK45   PIC XXX.
                   15 SDWK46   PIC XXX.
                   15 SDWK47   PIC XXX.
               10  W4-LEV-R.
                   15 W4-L1    PIC XX.
                   15 W4-R1    PIC X.
                   15 W4-L2    PIC XX.
                   15 W4-R2    PIC X.
                   15 W4-L3    PIC XX.
                   15 W4-R3    PIC X.
                   15 W4-L4    PIC XX.
                   15 W4-R4    PIC X.
                   15 W4-L5    PIC XX.
                   15 W4-R5    PIC X.
                   15 W4-L6    PIC XX.
                   15 W4-R6    PIC X.
                   15 W4-L7    PIC XX.
                   15 W4-R7    PIC X.
           05  SD-WEEK-5.
               10  SD-WK5.
                   15 SDWK51   PIC XXX.
                   15 SDWK52   PIC XXX.
                   15 SDWK53   PIC XXX.
                   15 SDWK54   PIC XXX.
                   15 SDWK55   PIC XXX.
                   15 SDWK56   PIC XXX.
                   15 SDWK57   PIC XXX.
               10  W5-LEV-R.
                   15 W5-L1    PIC XX.
                   15 W5-R1    PIC X.
                   15 W5-L2    PIC XX.
                   15 W5-R2    PIC X.
                   15 W5-L3    PIC XX.
                   15 W5-R3    PIC X.
                   15 W5-L4    PIC XX.
                   15 W5-R4    PIC X.
                   15 W5-L5    PIC XX.
                   15 W5-R5    PIC X.
                   15 W5-L6    PIC XX.
                   15 W5-R6    PIC X.
                   15 W5-L7    PIC XX.
                   15 W5-R7    PIC X.
           05  SD-WEEK-6.
               10  SD-WK6.
                   15 SDWK61   PIC XXX.
                   15 SDWK62   PIC XXX.
               10  W6-LEV-R.
                   15 W6-L1    PIC XX.
                   15 W6-R1    PIC X.
                   15 W6-L2    PIC XX.
                   15 W6-R2    PIC X.
           05  SD-ERRMSG       PIC X(79).

       01  SCREEN-REST.
           05  BANNER-DATA.
               10  B-LEVEL     PIC X(02).
               10  B-EQUIP     PIC X(06).
               10  B-WO        PIC X(10).
               10  B-MONTH     PIC X(09).
               10  B-DAY       PIC 9(02).
               10  B-YEAR      PIC X(04).
           05  PR-CYC-X.
               10  PR-1        PIC X.
               10  PR-2        PIC X.
           05  PR-CYCLE        REDEFINES PR-CYC-X
                               PIC 99.
           05  REST-NS.
               10  R-A         PIC X.
               10  R-B         PIC X.
               10  R-C         PIC X.
               10  R-D         PIC X.
           05  SR-ERRMSG       PIC X(79).

       01  MO-DATA.
           05  WEEK-1          PIC X(21).
           05  WEEK-2          PIC X(21).
           05  WEEK-3          PIC X(21).
           05  WEEK-4          PIC X(21).
           05  WEEK-5          PIC X(21).
           05  WEEK-6          PIC X(06).

       01  HEADER.
           05  HD-MONTH        PIC X(09)  VALUE SPACES.
           05  FILLER          PIC X(02)  VALUE SPACES.
           05  HD-YEAR         PIC X(04)  VALUE SPACES.
           05  FILLER          PIC X(11)  VALUE     "    EQUIP: ".
           05  HD-EQUIP        PIC X(06)  VALUE SPACES.
           05  FILLER          PIC X(08)  VALUE     "    WO: ".
           05  HD-WONUM        PIC X(10)  VALUE SPACES.

       01  BU-DISPLAY-AREA.
           05  FILLER          PIC XX.
           05  BU-DISPLAY-MSG  PIC X(27).
           05  FILLER          PIC XX.
           05  BU-DISPLAY-STAT PIC S9(4).
           05  FILLER          PIC XX.
           05  BU-DISPLAY-FLD  PIC X(14).
           05  FILLER          PIC XX.

           COPY CATREAD        IN COPYLIB.

           COPY SCREENIO       IN COPYLIB.

           COPY LANGSUB        IN COPYLIB.

       01  MESSAGE-DATA.
           COPY ERRORLIN       IN COPYLIB.

       01  PM-SCHED-DATA.
           COPY DPMSCHED       IN COPYLIB.

           COPY DAYTABLE       IN COPYLIB.

       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       LINKAGE SECTION.
       01  LINK-DATA.
           05 LINK-EQUIP       PIC X(06).
           05 LINK-WONUM       PIC X(10).
           05 LINK-ZONE-PRI    PIC X(06).
           05 LINK-YRMO.
               10 LINK-DATA-X.
                   15  LD-YEAR     PIC X(04).
                   15  LD-MONTH    PIC X(02).
               10 LINK-DATA-9      REDEFINES LINK-DATA-X.
                   15  LD-YR       PIC 9(04).
                   15  LD-YRB      REDEFINES LD-YR.
                       20  LDYR3   PIC 9(03).
                       20  LDYRL   PIC 9.
                   15  LD-MON      PIC 9(02).

       PROCEDURE DIVISION      USING LINK-DATA.
       BEGIN-PROC.
           OPEN INPUT          PM-SCHEDULE.
           OPEN I-O            DISPLAY-FILE.

           ACCEPT CURR-DATE    FROM DATE.
           MOVE CD-YY          TO TD-YY.
           MOVE CD-MM          TO TD-MM.
           MOVE CD-DD          TO TD-DD.
           MOVE 20             TO TD-CT.
           IF TD-YY > 90
               MOVE 19         TO TD-CT.

           IF TODAYS-DATE > "20600100"
             MOVE "VFIXABORT"  TO SCREEN-NAME
             WRITE DISPLAY-REC FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
             IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB
             ELSE
               READ DISPLAY-FILE FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
               IF SCREEN-STATUS NOT = "00"
                 DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
                 GO TO END-OF-JOB
               ELSE
                 GOBACK.

           IF LINK-YRMO < TD-YEARMO
               MOVE TD-YEARMO  TO LINK-YRMO.

           MOVE "VCALENDAR"    TO SCREEN-NAME.
           MOVE SPACES         TO SCREEN-DATA MESSAGE-BUFFER
                                  PM-SCHED-DATA SAVE-DATA
                                  R-SAVE-TABLE DAY-STORAGE.
           PERFORM GET-SCREEN-DATA THRU GSD-EXIT.
           IF MESSAGE-BUFFER NOT = SPACES
               GO TO SHOWFORM.


       SHOWFORM.
           MOVE SCREEN-DATA    TO DISPLAY-REC.
           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO SCREEN-DATA.

           IF KEY-HIT = 3 OR 8
               PERFORM UNLOAD-LEVELS
               PERFORM PUT-SCREEN-DATA THRU PSD-EXIT
               GO TO END-OF-JOB.

           IF KEY-HIT = 1
               PERFORM UNLOAD-LEVELS
               PERFORM PUT-SCREEN-DATA THRU PSD-EXIT
               PERFORM SUBTRACT-MONTH
               GO TO SHOWFORM.

           IF KEY-HIT = 2
               PERFORM UNLOAD-LEVELS
               PERFORM PUT-SCREEN-DATA THRU PSD-EXIT
               PERFORM ADD-MONTH
               GO TO SHOWFORM.

           IF KEY-HIT = 6
               CALL "SPMEXPND" USING LINK-DATA
                               DBPARAMETERS
                               LANGUAGE-PARMS
               MOVE "VCALENDAR" TO SCREEN-NAME
               GO TO SHOWFORM.

           IF KEY-HIT = 7
               MOVE 46         TO HELP-SW
               CALL "SPMHELPM" USING HELP-SW
               GO TO SHOWFORM.

           PERFORM UNLOAD-LEVELS.
           PERFORM PUT-SCREEN-DATA THRU PSD-EXIT.
           MOVE SPACES         TO SCREEN-DATA MO-ERROR.
           PERFORM GET-SCREEN-DATA THRU GSD-EXIT.
           IF MO-ERROR NOT = SPACES
               MOVE SAVE-DATA  TO LINK-YRMO
               MOVE SPACES     TO SCREEN-DATA MO-ERROR
               PERFORM GET-SCREEN-DATA THRU GSD-EXIT.
           GO TO SHOWFORM.

       ADD-MONTH.
           MOVE LINK-YRMO      TO SAVE-DATA.
           ADD 1               TO LD-MON.
           IF LD-MON > 12
               MOVE 1          TO LD-MON
               ADD  1          TO LD-YR.
           MOVE SPACES         TO SCREEN-DATA MO-ERROR.
           PERFORM GET-SCREEN-DATA THRU GSD-EXIT.
           IF MO-ERROR NOT = SPACES
               MOVE SAVE-DATA  TO LINK-YRMO
               MOVE SPACES     TO SCREEN-DATA MO-ERROR
               PERFORM GET-SCREEN-DATA THRU GSD-EXIT.

       SUBTRACT-MONTH.
           MOVE LINK-YRMO      TO SAVE-DATA.
           SUBTRACT 1          FROM LD-MON.
           IF LD-MON < 1
               MOVE 12         TO LD-MON
               SUBTRACT 1      FROM LD-YR.
           IF LINK-YRMO < TD-YEARMO
               MOVE SAVE-DATA  TO LINK-YRMO.
           MOVE SPACES         TO SCREEN-DATA MO-ERROR.
           PERFORM GET-SCREEN-DATA THRU GSD-EXIT.
           IF MO-ERROR NOT = SPACES
               MOVE SAVE-DATA  TO LINK-YRMO
               MOVE SPACES     TO SCREEN-DATA MO-ERROR
               PERFORM GET-SCREEN-DATA THRU GSD-EXIT.

       GET-SCREEN-DATA.
           CALL "CALENDAR"     USING LINK-YRMO
                               MO-NAME
                               MO-DATA
                               MO-ERROR.
           IF MO-ERROR NOT = SPACES
               MOVE MO-ERROR   TO MESSAGE-BUFFER
               PERFORM 99-ERROR
               GO TO GSD-EXIT.

           MOVE MO-NAME        TO HD-MONTH.
           MOVE LD-YEAR        TO HD-YEAR.
           MOVE LINK-EQUIP     TO HD-EQUIP.
           MOVE LINK-WONUM     TO HD-WONUM.
           MOVE HEADER         TO SD-TITLE.
           MOVE WEEK-1         TO SD-WK1.
           MOVE WEEK-2         TO SD-WK2.
           MOVE WEEK-3         TO SD-WK3.
           MOVE WEEK-4         TO SD-WK4.
           MOVE WEEK-5         TO SD-WK5.
           MOVE WEEK-6         TO SD-WK6.
           MOVE SPACES         TO MO-ERROR DAY-TABLE-DATA.
           CALL "SPMMODAT"     USING DAY-TABLE-DATA
                               LINK-DATA
                               DBPARAMETERS
                               MO-ERROR.
           IF MO-ERROR NOT = SPACES
               MOVE MO-ERROR   TO MESSAGE-BUFFER
               PERFORM 99-ERROR
               GO TO GSD-EXIT.

           PERFORM LOAD-LEVELS.

       GSD-EXIT.    EXIT.

       PUT-SCREEN-DATA.
           IF SCREEN-NAME NOT = "VCALENDAR"
               MOVE "VCALENDAR" TO SCREEN-NAME.

           MOVE SPACES         TO MO-ERROR.
           CALL "SPMSCHUP"     USING DAY-TABLE-DATA
                               LINK-DATA
                               DBPARAMETERS
                               MO-ERROR.
           IF MO-ERROR NOT = SPACES
               MOVE MO-ERROR   TO MESSAGE-BUFFER
               PERFORM 99-ERROR
               DISPLAY "  ERROR:"
               DISPLAY MESSAGE-BUFFER
               ACCEPT ANSWER-FIELD
               GO TO PSD-EXIT.

       PSD-EXIT.    EXIT.

       LOAD-LEVELS.
           MOVE 0              TO SUB.
           MOVE SPACES         TO R-SAVE-TABLE.
           IF SDWK11 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W1-R1
               MOVE W-SAVE     TO W1-L1.
           IF SDWK12 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W1-R2
               MOVE W-SAVE     TO W1-L2.
           IF SDWK13 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W1-R3
               MOVE W-SAVE     TO W1-L3.
           IF SDWK14 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W1-R4
               MOVE W-SAVE     TO W1-L4.
           IF SDWK15 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W1-R5
               MOVE W-SAVE     TO W1-L5.
           IF SDWK16 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W1-R6
               MOVE W-SAVE     TO W1-L6.
           IF SDWK17 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W1-R7
               MOVE W-SAVE     TO W1-L7.
           IF SDWK21 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W2-R1
               MOVE W-SAVE     TO W2-L1.
           IF SDWK22 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W2-R2
               MOVE W-SAVE     TO W2-L2.
           IF SDWK23 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W2-R3
               MOVE W-SAVE     TO W2-L3.
           IF SDWK24 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W2-R4
               MOVE W-SAVE     TO W2-L4.
           IF SDWK25 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W2-R5
               MOVE W-SAVE     TO W2-L5.
           IF SDWK26 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W2-R6
               MOVE W-SAVE     TO W2-L6.
           IF SDWK27 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W2-R7
               MOVE W-SAVE     TO W2-L7.
           IF SDWK31 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W3-R1
               MOVE W-SAVE     TO W3-L1.
           IF SDWK32 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W3-R2
               MOVE W-SAVE     TO W3-L2.
           IF SDWK33 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W3-R3
               MOVE W-SAVE     TO W3-L3.
           IF SDWK34 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W3-R4
               MOVE W-SAVE     TO W3-L4.
           IF SDWK35 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W3-R5
               MOVE W-SAVE     TO W3-L5.
           IF SDWK36 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W3-R6
               MOVE W-SAVE     TO W3-L6.
           IF SDWK37 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W3-R7
               MOVE W-SAVE     TO W3-L7.
           IF SDWK41 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W4-R1
               MOVE W-SAVE     TO W4-L1.
           IF SDWK42 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W4-R2
               MOVE W-SAVE     TO W4-L2.
           IF SDWK43 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W4-R3
               MOVE W-SAVE     TO W4-L3.
           IF SDWK44 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W4-R4
               MOVE W-SAVE     TO W4-L4.
           IF SDWK45 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W4-R5
               MOVE W-SAVE     TO W4-L5.
           IF SDWK46 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W4-R6
               MOVE W-SAVE     TO W4-L6.
           IF SDWK47 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W4-R7
               MOVE W-SAVE     TO W4-L7.
           IF SDWK51 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W5-R1
               MOVE W-SAVE     TO W5-L1.
           IF SDWK52 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W5-R2
               MOVE W-SAVE     TO W5-L2.
           IF SDWK53 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W5-R3
               MOVE W-SAVE     TO W5-L3.
           IF SDWK54 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W5-R4
               MOVE W-SAVE     TO W5-L4.
           IF SDWK55 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W5-R5
               MOVE W-SAVE     TO W5-L5.
           IF SDWK56 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W5-R6
               MOVE W-SAVE     TO W5-L6.
           IF SDWK57 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W5-R7
               MOVE W-SAVE     TO W5-L7.
           IF SDWK61 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W6-R1
               MOVE W-SAVE     TO W6-L1.
           IF SDWK62 NOT = "   "
               PERFORM LOAD-LEVEL-DATA
               MOVE R-TAB(SUB) TO W6-R2
               MOVE W-SAVE     TO W6-L2.

       LOAD-LEVEL-DATA.
           ADD 1               TO SUB.
           MOVE "--"           TO W-SAVE.
           IF DAY-DATA(SUB) NOT = SPACES
               MOVE DD-LEVEL(SUB) TO W-SAVE.
           IF DD-REST-1(SUB) NOT = SPACE
               MOVE DD-REST-1(SUB) TO R-1(SUB)
               MOVE "*"        TO R-TAB(SUB).
           IF DD-REST-PR(SUB) IS NUMERIC AND DD-REST-PR(SUB) > 0
               MOVE DD-REST-PR(SUB) TO R-PR(SUB)
               MOVE "*"        TO R-TAB(SUB).

       UNLOAD-LEVELS.
           MOVE SPACE          TO R-SAVE.
           MOVE 0              TO SUB.
           PERFORM EDIT-LEVELS.
           MOVE SPACES         TO DAY-STORAGE.
           MOVE 0              TO SUB.

           IF SDWK11 NOT = "   "
               ADD 1           TO SUB
               IF W1-L1 = "--" OR "  "
                   MOVE SPACE  TO W1-R1
               ELSE
               IF W1-R1 = " " OR "*"
                   MOVE W1-L1  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W1-L1  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W1-R1
                   PERFORM UNLOAD-LEVEL-DATA
           ELSE
               MOVE SPACES     TO W1-L1 W1-R1.

           IF SDWK12 NOT = "   "
               ADD 1           TO SUB
               IF W1-L2 = "--" OR "  "
                   MOVE SPACE  TO W1-R2
               ELSE
               IF W1-R2 = " " OR "*"
                   MOVE W1-L2  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W1-L2  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W1-R2
                   PERFORM UNLOAD-LEVEL-DATA
           ELSE
               MOVE SPACES     TO W1-L2 W1-R2.

           IF SDWK13 NOT = "   "
               ADD 1           TO SUB
               IF W1-L3 = "--" OR "  "
                   MOVE SPACE  TO W1-R3
               ELSE
               IF W1-R3 = " " OR "*"
                   MOVE W1-L3  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W1-L3  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W1-R3
                   PERFORM UNLOAD-LEVEL-DATA
           ELSE
               MOVE SPACES     TO W1-L3 W1-R3.

           IF SDWK14 NOT = "   "
               ADD 1           TO SUB
               IF W1-L4 = "--" OR "  "
                   MOVE SPACE  TO W1-R4
               ELSE
               IF W1-R4 = " " OR "*"
                   MOVE W1-L4  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W1-L4  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W1-R4
                   PERFORM UNLOAD-LEVEL-DATA
           ELSE
               MOVE SPACES     TO W1-L4 W1-R4.

           IF SDWK15 NOT = "   "
               ADD 1           TO SUB
               IF W1-L5 = "--" OR "  "
                   MOVE SPACE  TO W1-R5
               ELSE
               IF W1-R5 = " " OR "*"
                   MOVE W1-L5  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W1-L5  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W1-R5
                   PERFORM UNLOAD-LEVEL-DATA
           ELSE
               MOVE SPACES     TO W1-L5 W1-R5.

           IF SDWK16 NOT = "   "
               ADD 1           TO SUB
               IF W1-L6 = "--" OR "  "
                   MOVE SPACE  TO W1-R6
               ELSE
               IF W1-R6 = " " OR "*"
                   MOVE W1-L6  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W1-L6  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W1-R6
                   PERFORM UNLOAD-LEVEL-DATA
           ELSE
               MOVE SPACES     TO W1-L6 W1-R6.

           IF SDWK17 NOT = "   "
               ADD 1           TO SUB
               IF W1-L7 = "--" OR "  "
                   MOVE SPACE  TO W1-R7
               ELSE
               IF W1-R7 = " " OR "*"
                   MOVE W1-L7  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W1-L7  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W1-R7
                   PERFORM UNLOAD-LEVEL-DATA
           ELSE
               MOVE SPACES     TO W1-L7 W1-R7.

           IF SDWK21 NOT = "   "
               ADD 1           TO SUB
               IF W2-L1 = "--" OR "  "
                   MOVE SPACE  TO W2-R1
               ELSE
               IF W2-R1 = " " OR "*"
                   MOVE W2-L1  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W2-L1  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W2-R1
                   PERFORM UNLOAD-LEVEL-DATA.

           IF SDWK22 NOT = "   "
               ADD 1           TO SUB
               IF W2-L2 = "--" OR "  "
                   MOVE SPACE  TO W2-R2
               ELSE
               IF W2-R2 = " " OR "*"
                   MOVE W2-L2  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W2-L2  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W2-R2
                   PERFORM UNLOAD-LEVEL-DATA.

           IF SDWK23 NOT = "   "
               ADD 1           TO SUB
               IF W2-L3 = "--" OR "  "
                   MOVE SPACE  TO W2-R3
               ELSE
               IF W2-R3 = " " OR "*"
                   MOVE W2-L3  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W2-L3  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W2-R3
                   PERFORM UNLOAD-LEVEL-DATA.

           IF SDWK24 NOT = "   "
               ADD 1           TO SUB
               IF W2-L4 = "--" OR "  "
                   MOVE SPACE  TO W2-R4
               ELSE
               IF W2-R4 = " " OR "*"
                   MOVE W2-L4  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W2-L4  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W2-R4
                   PERFORM UNLOAD-LEVEL-DATA.

           IF SDWK25 NOT = "   "
               ADD 1           TO SUB
               IF W2-L5 = "--" OR "  "
                   MOVE SPACE  TO W2-R5
               ELSE
               IF W2-R5 = " " OR "*"
                   MOVE W2-L5  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W2-L5  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W2-R5
                   PERFORM UNLOAD-LEVEL-DATA.

           IF SDWK26 NOT = "   "
               ADD 1           TO SUB
               IF W2-L6 = "--" OR "  "
                   MOVE SPACE  TO W2-R6
               ELSE
               IF W2-R6 = " " OR "*"
                   MOVE W2-L6  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W2-L6  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W2-R6
                   PERFORM UNLOAD-LEVEL-DATA.

           IF SDWK27 NOT = "   "
               ADD 1           TO SUB
               IF W2-L7 = "--" OR "  "
                   MOVE SPACE  TO W2-R7
               ELSE
               IF W2-R7 = " " OR "*"
                   MOVE W2-L7  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W2-L7  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W2-R7
                   PERFORM UNLOAD-LEVEL-DATA.

           IF SDWK31 NOT = "   "
               ADD 1           TO SUB
               IF W3-L1 = "--" OR "  "
                   MOVE SPACE  TO W3-R1
               ELSE
               IF W3-R1 = " " OR "*"
                   MOVE W3-L1  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W3-L1  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W3-R1
                   PERFORM UNLOAD-LEVEL-DATA.

           IF SDWK32 NOT = "   "
               ADD 1           TO SUB
               IF W3-L2 = "--" OR "  "
                   MOVE SPACE  TO W3-R2
               ELSE
               IF W3-R2 = " " OR "*"
                   MOVE W3-L2  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W3-L2  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W3-R2
                   PERFORM UNLOAD-LEVEL-DATA.

           IF SDWK33 NOT = "   "
               ADD 1           TO SUB
               IF W3-L3 = "--" OR "  "
                   MOVE SPACE  TO W3-R3
               ELSE
               IF W3-R3 = " " OR "*"
                   MOVE W3-L3  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W3-L3  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W3-R3
                   PERFORM UNLOAD-LEVEL-DATA.

           IF SDWK34 NOT = "   "
               ADD 1           TO SUB
               IF W3-L4 = "--" OR "  "
                   MOVE SPACE  TO W3-R4
               ELSE
               IF W3-R4 = " " OR "*"
                   MOVE W3-L4  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W3-L4  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W3-R4
                   PERFORM UNLOAD-LEVEL-DATA.

           IF SDWK35 NOT = "   "
               ADD 1           TO SUB
               IF W3-L5 = "--" OR "  "
                   MOVE SPACE  TO W3-R5
               ELSE
               IF W3-R5 = " " OR "*"
                   MOVE W3-L5  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W3-L5  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W3-R5
                   PERFORM UNLOAD-LEVEL-DATA.

           IF SDWK36 NOT = "   "
               ADD 1           TO SUB
               IF W3-L6 = "--" OR "  "
                   MOVE SPACE  TO W3-R6
               ELSE
               IF W3-R6 = " " OR "*"
                   MOVE W3-L6  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W3-L6  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W3-R6
                   PERFORM UNLOAD-LEVEL-DATA.

           IF SDWK37 NOT = "   "
               ADD 1           TO SUB
               IF W3-L7 = "--" OR "  "
                   MOVE SPACE  TO W3-R7
               ELSE
               IF W3-R7 = " " OR "*"
                   MOVE W3-L7  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W3-L7  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W3-R7
                   PERFORM UNLOAD-LEVEL-DATA.

           IF SDWK41 NOT = "   "
               ADD 1           TO SUB
               IF W4-L1 = "--" OR "  "
                   MOVE SPACE  TO W4-R1
               ELSE
               IF W4-R1 = " " OR "*"
                   MOVE W4-L1  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W4-L1  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W4-R1
                   PERFORM UNLOAD-LEVEL-DATA.

           IF SDWK42 NOT = "   "
               ADD 1           TO SUB
               IF W4-L2 = "--" OR "  "
                   MOVE SPACE  TO W4-R2
               ELSE
               IF W4-R2 = " " OR "*"
                   MOVE W4-L2  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W4-L2  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W4-R2
                   PERFORM UNLOAD-LEVEL-DATA.

           IF SDWK43 NOT = "   "
               ADD 1           TO SUB
               IF W4-L3 = "--" OR "  "
                   MOVE SPACE  TO W4-R3
               ELSE
               IF W4-R3 = " " OR "*"
                   MOVE W4-L3  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W4-L3  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W4-R3
                   PERFORM UNLOAD-LEVEL-DATA.

           IF SDWK44 NOT = "   "
               ADD 1           TO SUB
               IF W4-L4 = "--" OR "  "
                   MOVE SPACE  TO W4-R4
               ELSE
               IF W4-R4 = " " OR "*"
                   MOVE W4-L4  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W4-L4  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W4-R4
                   PERFORM UNLOAD-LEVEL-DATA.

           IF SDWK45 NOT = "   "
               ADD 1           TO SUB
               IF W4-L5 = "--" OR "  "
                   MOVE SPACE  TO W4-R5
               ELSE
               IF W4-R5 = " " OR "*"
                   MOVE W4-L5  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W4-L5  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W4-R5
                   PERFORM UNLOAD-LEVEL-DATA.

           IF SDWK46 NOT = "   "
               ADD 1           TO SUB
               IF W4-L6 = "--" OR "  "
                   MOVE SPACE  TO W4-R6
               ELSE
               IF W4-R6 = " " OR "*"
                   MOVE W4-L6  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W4-L6  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W4-R6
                   PERFORM UNLOAD-LEVEL-DATA.

           IF SDWK47 NOT = "   "
               ADD 1           TO SUB
               IF W4-L7 = "--" OR "  "
                   MOVE SPACE  TO W4-R7
               ELSE
               IF W4-R7 = " " OR "*"
                   MOVE W4-L7  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W4-L7  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W4-R7
                   PERFORM UNLOAD-LEVEL-DATA.

           IF SDWK51 NOT = "   "
               ADD 1           TO SUB
               IF W5-L1 = "--" OR "  "
                   MOVE SPACE  TO W5-R1
               ELSE
               IF W5-R1 = " " OR "*"
                   MOVE W5-L1  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W5-L1  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W5-R1
                   PERFORM UNLOAD-LEVEL-DATA
           ELSE
               MOVE SPACES     TO W5-L1 W5-R1.

           IF SDWK52 NOT = "   "
               ADD 1           TO SUB
               IF W5-L2 = "--" OR "  "
                   MOVE SPACE  TO W5-R2
               ELSE
               IF W5-R2 = " " OR "*"
                   MOVE W5-L2  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W5-L2  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W5-R2
                   PERFORM UNLOAD-LEVEL-DATA
           ELSE
               MOVE SPACES     TO W5-L2 W5-R2.

           IF SDWK53 NOT = "   "
               ADD 1           TO SUB
               IF W5-L3 = "--" OR "  "
                   MOVE SPACE  TO W5-R3
               ELSE
               IF W5-R3 = " " OR "*"
                   MOVE W5-L3  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W5-L3  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W5-R3
                   PERFORM UNLOAD-LEVEL-DATA
           ELSE
               MOVE SPACES     TO W5-L3 W5-R3.

           IF SDWK54 NOT = "   "
               ADD 1           TO SUB
               IF W5-L4 = "--" OR "  "
                   MOVE SPACE  TO W5-R4
               ELSE
               IF W5-R4 = " " OR "*"
                   MOVE W5-L4  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W5-L4  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W5-R4
                   PERFORM UNLOAD-LEVEL-DATA
           ELSE
               MOVE SPACES     TO W5-L4 W5-R4.

           IF SDWK55 NOT = "   "
               ADD 1           TO SUB
               IF W5-L5 = "--" OR "  "
                   MOVE SPACE  TO W5-R5
               ELSE
               IF W5-R5 = " " OR "*"
                   MOVE W5-L5  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W5-L5  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W5-R5
                   PERFORM UNLOAD-LEVEL-DATA
           ELSE
               MOVE SPACES     TO W5-L5 W5-R5.

           IF SDWK56 NOT = "   "
               ADD 1           TO SUB
               IF W5-L6 = "--" OR "  "
                   MOVE SPACE  TO W5-R6
               ELSE
               IF W5-R6 = " " OR "*"
                   MOVE W5-L6  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W5-L6  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W5-R6
                   PERFORM UNLOAD-LEVEL-DATA
           ELSE
               MOVE SPACES     TO W5-L6 W5-R6.

           IF SDWK57 NOT = "   "
               ADD 1           TO SUB
               IF W5-L7 = "--" OR "  "
                   MOVE SPACE  TO W5-R7
               ELSE
               IF W5-R7 = " " OR "*"
                   MOVE W5-L7  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W5-L7  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W5-R7
                   PERFORM UNLOAD-LEVEL-DATA
           ELSE
               MOVE SPACES     TO W5-L7 W5-R7.

           IF SDWK61 NOT = "   "
               ADD 1           TO SUB
               IF W6-L1 = "--" OR "  "
                   MOVE SPACE  TO W6-R1
               ELSE
               IF W6-R1 = " " OR "*"
                   MOVE W6-L1  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W6-L1  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W6-R1
                   PERFORM UNLOAD-LEVEL-DATA
           ELSE
               MOVE SPACES     TO W6-L1 W6-R1.

           IF SDWK62 NOT = "   "
               ADD 1           TO SUB
               IF W6-L2 = "--" OR "  "
                   MOVE SPACE  TO W6-R2
               ELSE
               IF W6-R2 = " " OR "*"
                   MOVE W6-L2  TO W-SAVE
                   PERFORM UNLOAD-LEVEL-DATA
               ELSE
                   MOVE W6-L2  TO W-SAVE
                   PERFORM EXPAND-RESTRICTIONS THRU ER-EXIT
                   MOVE MARK   TO W6-R2
                   PERFORM UNLOAD-LEVEL-DATA
           ELSE
               MOVE SPACES     TO W6-L2 W6-R2.

       UNLOAD-LEVEL-DATA.
           MOVE SPACES         TO PM-SCHED-DATA.
           MOVE LINK-YRMO      TO SCH-RELEASE-YRMO.
           MOVE LD-YEAR        TO SCH-RELEASE-DATE.
           MOVE LD-MONTH       TO SCH-REL-MO.
           MOVE SUB            TO SCH-REL-DAY.
           MOVE "CL  "         TO SCH-REC-TYPE.
           MOVE LINK-EQUIP     TO SCH-EQUIP-NUM.
           MOVE LINK-WONUM     TO SCH-WO-NUM.
           MOVE LINK-ZONE-PRI  TO SCH-ZONE-PRI.
           MOVE SPACES         TO SCH-PREREL-DATE.
           MOVE W-SAVE-9       TO SCH-LEVEL.
           MOVE SPACES         TO SCH-PR-ID.
           MOVE RESTRICT(SUB)  TO SCH-RESTRICT.
           MOVE PM-SCHED-DATA  TO DAY-DATA(SUB).
           IF SCH-RELEASE-DATE < TODAYS-DATE
               MOVE SPACES     TO DAY-DATA(SUB).

       EXPAND-RESTRICTIONS.
           IF SCREEN-NAME NOT = "VRESTRICT"
               MOVE "VRESTRICT" TO SCREEN-NAME.

           MOVE SPACES         TO SCREEN-REST.
           MOVE W-SAVE-9       TO B-LEVEL.
           MOVE LINK-EQUIP     TO B-EQUIP.
           MOVE LINK-WONUM     TO B-WO.
           MOVE MO-NAME        TO B-MONTH.
           MOVE SUB            TO B-DAY.
           MOVE LD-YEAR        TO B-YEAR.

           IF R-PRX(SUB) = SPACES
               MOVE ZEROS      TO PR-CYCLE
           ELSE
               MOVE R-PR(SUB)  TO PR-CYCLE.

           IF R-1(SUB) = "A"
               MOVE "X"        TO R-A
           ELSE
           IF R-1(SUB) = "B"
               MOVE "X"        TO R-B
           ELSE
           IF R-1(SUB) = "C"
               MOVE "X"        TO R-C
           ELSE
           IF R-1(SUB) = "D"
               MOVE "X"        TO R-D.

           MOVE SCREEN-REST    TO DISPLAY-REC.
           PERFORM SHOWFORM-REST THRU SR-EXIT.
           GO TO ER-EXIT.

       SHOWFORM-REST.
           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO SCREEN-REST.

           IF KEY-HIT = 3 OR 8
               GO TO SR-EXIT.

           IF KEY-HIT = 7
               MOVE 461        TO HELP-SW
               CALL "SPMHELPM" USING HELP-SW
               GO TO SHOWFORM-REST.

           IF PR-2 = SPACE
               MOVE PR-1       TO PR-2
               MOVE 0          TO PR-1.
           IF PR-2 = SPACE
               MOVE PR-1       TO PR-2
               MOVE 0          TO PR-1.
           IF PR-1 = SPACE
               MOVE 0          TO PR-1.

           IF PR-CYC-X NOT NUMERIC
      *M********************************************************************
      *M    MESSAGE 020/047:
      *M T47: THIS ENTRY MUST BE NUMERIC
      *M********************************************************************
               MOVE  20        TO LANG-SETNUM
               MOVE  47        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE  12        TO FIELD-NUMBER
               PERFORM 99-ERROR
               GO TO SHOWFORM-REST.

           MOVE 0              TO R-CTR.
           IF R-A NOT = SPACE
               MOVE "X"        TO R-A
               ADD 1           TO R-CTR.
           IF R-B NOT = SPACE
               MOVE "X"        TO R-B
               ADD 1           TO R-CTR.
           IF R-C NOT = SPACE
               MOVE "X"        TO R-C
               ADD 1           TO R-CTR.
           IF R-D NOT = SPACE
               MOVE "X"        TO R-D
               ADD 1           TO R-CTR.

           IF R-CTR > 1
      *M********************************************************************
      *M    MESSAGE 041/026:
      *M ONLY ONE FIELD MAY BE SELECTED
      *M********************************************************************
               MOVE  41        TO LANG-SETNUM
               MOVE  26        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               PERFORM 99-ERROR
               GO TO SHOWFORM-REST.

           MOVE PR-CYCLE       TO R-PR(SUB) DD-REST-PR(SUB).
           MOVE SPACE          TO R-1 (SUB) DD-REST-1 (SUB)
                                  R-2 (SUB) DD-REST-2 (SUB).
           MOVE "*"            TO MARK.
           IF R-A NOT = SPACE
               MOVE "A"        TO R-1(SUB) DD-REST-1(SUB).
           IF R-B NOT = SPACE
               MOVE "B"        TO R-1(SUB) DD-REST-1(SUB).
           IF R-C NOT = SPACE
               MOVE "C"        TO R-1(SUB) DD-REST-1(SUB).
           IF R-D NOT = SPACE
               MOVE "D"        TO R-1(SUB) DD-REST-1(SUB).

           IF PR-CYCLE = 0 AND DD-REST-1(SUB) = SPACE
               MOVE SPACE      TO MARK.

       SR-EXIT.                EXIT.

       ER-EXIT.                EXIT.

       EDIT-LEVELS.
           IF SDWK11 NOT = "   "
             ADD 1             TO SUB
             IF W1-L1 = "--" OR "  "
               MOVE "--"       TO W1-L1
             ELSE
               MOVE W1-R1      TO R-SAVE
               MOVE W1-L1      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W1-R1
               MOVE W-SAVE     TO W1-L1.

           IF SDWK12 NOT = "   "
             ADD 1             TO SUB
             IF W1-L2 = "--" OR "  "
               MOVE "--"       TO W1-L2
             ELSE
               MOVE W1-R2      TO R-SAVE
               MOVE W1-L2      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W1-R2
               MOVE W-SAVE     TO W1-L2.

           IF SDWK13 NOT = "   "
             ADD 1             TO SUB
             IF W1-L3 = "--" OR "  "
               MOVE "--"       TO W1-L3
             ELSE
               MOVE W1-R3      TO R-SAVE
               MOVE W1-L3      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W1-R3
               MOVE W-SAVE     TO W1-L3.

           IF SDWK14 NOT = "   "
             ADD 1             TO SUB
             IF W1-L4 = "--" OR "  "
               MOVE "--"       TO W1-L4
             ELSE
               MOVE W1-R4      TO R-SAVE
               MOVE W1-L4      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W1-R4
               MOVE W-SAVE     TO W1-L4.

           IF SDWK15 NOT = "   "
             ADD 1             TO SUB
             IF W1-L5 = "--" OR "  "
               MOVE "--"       TO W1-L5
             ELSE
               MOVE W1-R5      TO R-SAVE
               MOVE W1-L5      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W1-R5
               MOVE W-SAVE     TO W1-L5.

           IF SDWK16 NOT = "   "
             ADD 1             TO SUB
             IF W1-L6 = "--" OR "  "
               MOVE "--"       TO W1-L6
             ELSE
               MOVE W1-R6      TO R-SAVE
               MOVE W1-L6      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W1-R6
               MOVE W-SAVE     TO W1-L6.

           IF SDWK17 NOT = "   "
             ADD 1             TO SUB
             IF W1-L7 = "--" OR "  "
               MOVE "--"       TO W1-L7
             ELSE
               MOVE W1-R7      TO R-SAVE
               MOVE W1-L7      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W1-R7
               MOVE W-SAVE     TO W1-L7.

           IF SDWK21 NOT = "   "
             ADD 1             TO SUB
             IF W2-L1 = "--" OR "  "
               MOVE "--"       TO W2-L1
             ELSE
               MOVE W2-R1      TO R-SAVE
               MOVE W2-L1      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W2-R1
               MOVE W-SAVE     TO W2-L1.

           IF SDWK22 NOT = "   "
             ADD 1             TO SUB
             IF W2-L2 = "--" OR "  "
               MOVE "--"       TO W2-L2
             ELSE
               MOVE W2-R2      TO R-SAVE
               MOVE W2-L2      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W2-R2
               MOVE W-SAVE     TO W2-L2.

           IF SDWK23 NOT = "   "
             ADD 1             TO SUB
             IF W2-L3 = "--" OR "  "
               MOVE "--"       TO W2-L3
             ELSE
               MOVE W2-R3      TO R-SAVE
               MOVE W2-L3      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W2-R3
               MOVE W-SAVE     TO W2-L3.

           IF SDWK24 NOT = "   "
             ADD 1             TO SUB
             IF W2-L4 = "--" OR "  "
               MOVE "--"       TO W2-L4
             ELSE
               MOVE W2-R4      TO R-SAVE
               MOVE W2-L4      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W2-R4
               MOVE W-SAVE     TO W2-L4.

           IF SDWK25 NOT = "   "
             ADD 1             TO SUB
             IF W2-L5 = "--" OR "  "
               MOVE "--"       TO W2-L5
             ELSE
               MOVE W2-R5      TO R-SAVE
               MOVE W2-L5      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W2-R5
               MOVE W-SAVE     TO W2-L5.

           IF SDWK26 NOT = "   "
             ADD 1             TO SUB
             IF W2-L6 = "--" OR "  "
               MOVE "--"       TO W2-L6
             ELSE
               MOVE W2-R6      TO R-SAVE
               MOVE W2-L6      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W2-R6
               MOVE W-SAVE     TO W2-L6.

           IF SDWK27 NOT = "   "
             ADD 1             TO SUB
             IF W2-L7 = "--" OR "  "
               MOVE "--"       TO W2-L7
             ELSE
               MOVE W2-R7      TO R-SAVE
               MOVE W2-L7      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W2-R7
               MOVE W-SAVE     TO W2-L7.

           IF SDWK31 NOT = "   "
             ADD 1             TO SUB
             IF W3-L1 = "--" OR "  "
               MOVE "--"       TO W3-L1
             ELSE
               MOVE W3-R1      TO R-SAVE
               MOVE W3-L1      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W3-R1
               MOVE W-SAVE     TO W3-L1.

           IF SDWK32 NOT = "   "
             ADD 1             TO SUB
             IF W3-L2 = "--" OR "  "
               MOVE "--"       TO W3-L2
             ELSE
               MOVE W3-R2      TO R-SAVE
               MOVE W3-L2      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W3-R2
               MOVE W-SAVE     TO W3-L2.

           IF SDWK33 NOT = "   "
             ADD 1             TO SUB
             IF W3-L3 = "--" OR "  "
               MOVE "--"       TO W3-L3
             ELSE
               MOVE W3-R3      TO R-SAVE
               MOVE W3-L3      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W3-R3
               MOVE W-SAVE     TO W3-L3.

           IF SDWK34 NOT = "   "
             ADD 1             TO SUB
             IF W3-L4 = "--" OR "  "
               MOVE "--"       TO W3-L4
             ELSE
               MOVE W3-R4      TO R-SAVE
               MOVE W3-L4      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W3-R4
               MOVE W-SAVE     TO W3-L4.

           IF SDWK35 NOT = "   "
             ADD 1             TO SUB
             IF W3-L5 = "--" OR "  "
               MOVE "--"       TO W3-L5
             ELSE
               MOVE W3-R5      TO R-SAVE
               MOVE W3-L5      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W3-R5
               MOVE W-SAVE     TO W3-L5.

           IF SDWK36 NOT = "   "
             ADD 1             TO SUB
             IF W3-L6 = "--" OR "  "
               MOVE "--"       TO W3-L6
             ELSE
               MOVE W3-R6      TO R-SAVE
               MOVE W3-L6      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W3-R6
               MOVE W-SAVE     TO W3-L6.

           IF SDWK37 NOT = "   "
             ADD 1             TO SUB
             IF W3-L7 = "--" OR "  "
               MOVE "--"       TO W3-L7
             ELSE
               MOVE W3-R7      TO R-SAVE
               MOVE W3-L7      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W3-R7
               MOVE W-SAVE     TO W3-L7.

           IF SDWK41 NOT = "   "
             ADD 1             TO SUB
             IF W4-L1 = "--" OR "  "
               MOVE "--"       TO W4-L1
             ELSE
               MOVE W4-R1      TO R-SAVE
               MOVE W4-L1      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W4-R1
               MOVE W-SAVE     TO W4-L1.

           IF SDWK42 NOT = "   "
             ADD 1             TO SUB
             IF W4-L2 = "--" OR "  "
               MOVE "--"       TO W4-L2
             ELSE
               MOVE W4-R2      TO R-SAVE
               MOVE W4-L2      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W4-R2
               MOVE W-SAVE     TO W4-L2.

           IF SDWK43 NOT = "   "
             ADD 1             TO SUB
             IF W4-L3 = "--" OR "  "
               MOVE "--"       TO W4-L3
             ELSE
               MOVE W4-R3      TO R-SAVE
               MOVE W4-L3      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W4-R3
               MOVE W-SAVE     TO W4-L3.

           IF SDWK44 NOT = "   "
             ADD 1             TO SUB
             IF W4-L4 = "--" OR "  "
               MOVE "--"       TO W4-L4
             ELSE
               MOVE W4-R4      TO R-SAVE
               MOVE W4-L4      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W4-R4
               MOVE W-SAVE     TO W4-L4.

           IF SDWK45 NOT = "   "
             ADD 1             TO SUB
             IF W4-L5 = "--" OR "  "
               MOVE "--"       TO W4-L5
             ELSE
               MOVE W4-R5      TO R-SAVE
               MOVE W4-L5      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W4-R5
               MOVE W-SAVE     TO W4-L5.

           IF SDWK46 NOT = "   "
             ADD 1             TO SUB
             IF W4-L6 = "--" OR "  "
               MOVE "--"       TO W4-L6
             ELSE
               MOVE W4-R6      TO R-SAVE
               MOVE W4-L6      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W4-R6
               MOVE W-SAVE     TO W4-L6.

           IF SDWK47 NOT = "   "
             ADD 1             TO SUB
             IF W4-L7 = "--" OR "  "
               MOVE "--"       TO W4-L7
             ELSE
               MOVE W4-R7      TO R-SAVE
               MOVE W4-L7      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W4-R7
               MOVE W-SAVE     TO W4-L7.

           IF SDWK51 NOT = "   "
             ADD 1             TO SUB
             IF W5-L1 = "--" OR "  "
               MOVE "--"       TO W5-L1
             ELSE
               MOVE W5-R1      TO R-SAVE
               MOVE W5-L1      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W5-R1
               MOVE W-SAVE     TO W5-L1.

           IF SDWK52 NOT = "   "
             ADD 1             TO SUB
             IF W5-L2 = "--" OR "  "
               MOVE "--"       TO W5-L2
             ELSE
               MOVE W5-R2      TO R-SAVE
               MOVE W5-L2      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W5-R2
               MOVE W-SAVE     TO W5-L2.

           IF SDWK53 NOT = "   "
             ADD 1             TO SUB
             IF W5-L3 = "--" OR "  "
               MOVE "--"       TO W5-L3
             ELSE
               MOVE W5-R3      TO R-SAVE
               MOVE W5-L3      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W5-R3
               MOVE W-SAVE     TO W5-L3.

           IF SDWK54 NOT = "   "
             ADD 1             TO SUB
             IF W5-L4 = "--" OR "  "
               MOVE "--"       TO W5-L4
             ELSE
               MOVE W5-R4      TO R-SAVE
               MOVE W5-L4      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W5-R4
               MOVE W-SAVE     TO W5-L4.

           IF SDWK55 NOT = "   "
             ADD 1             TO SUB
             IF W5-L5 = "--" OR "  "
               MOVE "--"       TO W5-L5
             ELSE
               MOVE W5-R5      TO R-SAVE
               MOVE W5-L5      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W5-R5
               MOVE W-SAVE     TO W5-L5.

           IF SDWK56 NOT = "   "
             ADD 1             TO SUB
             IF W5-L6 = "--" OR "  "
               MOVE "--"       TO W5-L6
             ELSE
               MOVE W5-R6      TO R-SAVE
               MOVE W5-L6      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W5-R6
               MOVE W-SAVE     TO W5-L6.

           IF SDWK57 NOT = "   "
             ADD 1             TO SUB
             IF W5-L7 = "--" OR "  "
               MOVE "--"       TO W5-L7
             ELSE
               MOVE W5-R7      TO R-SAVE
               MOVE W5-L7      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W5-R7
               MOVE W-SAVE     TO W5-L7.

           IF SDWK61 NOT = "   "
             ADD 1             TO SUB
             IF W6-L1 = "--" OR "  "
               MOVE "--"       TO W6-L1
             ELSE
               MOVE W6-R1      TO R-SAVE
               MOVE W6-L1      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W6-R1
               MOVE W-SAVE     TO W6-L1.

           IF SDWK62 NOT = "   "
             ADD 1             TO SUB
             IF W6-L2 = "--" OR "  "
               MOVE "--"       TO W6-L2
             ELSE
               MOVE W6-R2      TO R-SAVE
               MOVE W6-L2      TO W-SAVE
               PERFORM EDIT-LEVEL-DATA
               MOVE R-SAVE     TO W6-R2
               MOVE W-SAVE     TO W6-L2.

       EDIT-LEVEL-DATA.
           IF W-SAVE1 = " " OR "-"
              MOVE "0"         TO W-SAVE1.

           IF W-SAVE2 = " " OR "-"
              MOVE W-SAVE1     TO W-SAVE2
              MOVE "0"         TO W-SAVE1.

           IF W-SAVE NOT NUMERIC
              MOVE SPACE       TO R-SAVE
              MOVE "--"        TO W-SAVE.

           IF W-SAVE = "00"
              MOVE SPACE       TO R-SAVE
              MOVE "--"        TO W-SAVE.

           IF R-SAVE = SPACE AND R-TAB(SUB) = "*"
              MOVE "*"         TO R-SAVE
           ELSE
           IF R-SAVE = SPACE
              MOVE SPACES      TO RESTRICT(SUB) R-TAB(SUB)
           ELSE
           IF "*"   = R-SAVE AND R-TAB(SUB)
              NEXT SENTENCE
           ELSE
           IF R-SAVE NOT = " "
              MOVE "Y"         TO R-SAVE.

       END-OF-JOB.
           CLOSE               PM-SCHEDULE
                               DISPLAY-FILE.
           GOBACK.

       999-CATREAD.
           MOVE LANG-SETNUM    TO CATREAD-MSG-SET.
           MOVE LANG-MSGNUM    TO CATREAD-MSG-NUM.
           MOVE SPACES         TO MESSAGE-BUFFER,
           CALL "CCATREAD"     USING CATREAD-PARMS.
           IF CATREAD-MSG-NOT-FOUND
               MOVE "***ERROR***" TO MESSAGE-BUFFER
           ELSE
               MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.       EXIT.

       99-ERROR.
           IF SCREEN-NAME = "VCALENDAR"
               MOVE MESSAGE-BUFFER TO SD-ERRMSG
           ELSE
               MOVE MESSAGE-BUFFER TO SR-ERRMSG.
           MOVE TRUE-VAL       TO IND(FIELD-NUMBER) IND(99).

