       IDENTIFICATION DIVISION.
       PROGRAM-ID.             SPMHDI.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
      *REMARKS.                ON-LINE HELP DISPLAY SCREENS FOR THE
      *                        MMIS PM SCHEDULE MAINTENANCE PROGRAM
      *                        FOR THE "HOW-DO-I" FUNCTION.
      *                         ****.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZPMHDI-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  SCREEN-SAVE         PIC X(10).

       01  SCREEN-DATA.
           05  HDI-NUM         PIC XX.
           05  SCREEN-MSGS.
               10  CMDMSG      PIC X(79).
               10  ERRMSG      PIC X(79).

           COPY SCREENIO       IN COPYLIB.

       PROCEDURE DIVISION.
       BEGIN.
           OPEN I-O            DISPLAY-FILE.
           MOVE "VHDI1"        TO SCREEN-NAME SCREEN-SAVE.
           MOVE SPACES         TO SCREEN-DATA.

       SHOWFORM.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO SCREEN-DATA.

           IF KEY-HIT = 3 OR 8
               GO TO END-OF-JOB.

           IF KEY-HIT = 1
               IF SCREEN-SAVE = "VHDI1"
                   GO TO SHOWFORM
               ELSE
               IF SCREEN-SAVE = "VHDI2"
                   MOVE "VHDI1"  TO SCREEN-NAME SCREEN-SAVE
                   GO TO SHOWFORM
               ELSE
               IF SCREEN-SAVE = "VHDI3"
                   MOVE "VHDI2"  TO SCREEN-NAME SCREEN-SAVE
                   GO TO SHOWFORM
               ELSE
               IF SCREEN-SAVE = "VHDI4"
                   MOVE "VHDI3"  TO SCREEN-NAME SCREEN-SAVE
                   GO TO SHOWFORM.

           IF KEY-HIT = 2
               IF SCREEN-SAVE = "VHDI1"
                   MOVE "VHDI2"  TO SCREEN-NAME SCREEN-SAVE
                   GO TO SHOWFORM
               ELSE
               IF SCREEN-SAVE = "VHDI2"
                   MOVE "VHDI3"  TO SCREEN-NAME SCREEN-SAVE
                   GO TO SHOWFORM
               ELSE
               IF SCREEN-SAVE = "VHDI3"
                   MOVE "VHDI4"  TO SCREEN-NAME SCREEN-SAVE
                   GO TO SHOWFORM
               ELSE
               IF SCREEN-SAVE = "VHDI4"
                   GO TO SHOWFORM.

           IF HDI-NUM = "  "
               GO TO SHOWFORM.

           IF HDI-NUM = " 1" OR "01" OR "1 "
               MOVE "VHDIS1"   TO SCREEN-NAME
               GO TO SHOWFORM-2.

           IF HDI-NUM = " 2" OR "02" OR "2 "
               MOVE "VHDIS2"   TO SCREEN-NAME
               GO TO SHOWFORM-2.

           IF HDI-NUM = " 3" OR "03" OR "3 "
               MOVE "VHDIS3"   TO SCREEN-NAME
               GO TO SHOWFORM-2.

           IF HDI-NUM = " 4" OR "04" OR "4 "
               MOVE "VHDIS4"   TO SCREEN-NAME
               GO TO SHOWFORM-2.

           IF HDI-NUM = " 5" OR "05" OR "5 "
               MOVE "VHDIS5"   TO SCREEN-NAME
               GO TO SHOWFORM-2.

           IF HDI-NUM = " 6" OR "06" OR "6 "
               MOVE "VHDIS6"   TO SCREEN-NAME
               GO TO SHOWFORM-2.

           IF HDI-NUM = " 7" OR "07" OR "7 "
               MOVE "VHDIS7"   TO SCREEN-NAME
               GO TO SHOWFORM-2.

           IF HDI-NUM = "11"
               MOVE "VHDIS11"  TO SCREEN-NAME
               GO TO SHOWFORM-2.

           IF HDI-NUM = "12"
               MOVE "VHDIS12"  TO SCREEN-NAME
               GO TO SHOWFORM-2.

           IF HDI-NUM = "13"
               MOVE "VHDIS13"  TO SCREEN-NAME
               GO TO SHOWFORM-2.

           IF HDI-NUM = "21"
               MOVE "VHDIS21"  TO SCREEN-NAME
               GO TO SHOWFORM-2.

           IF HDI-NUM = "22"
               MOVE "VHDIS22"  TO SCREEN-NAME
               GO TO SHOWFORM-2.

           IF HDI-NUM = "23"
               MOVE "VHDIS23"  TO SCREEN-NAME
               GO TO SHOWFORM-2.

           IF HDI-NUM = "24"
               MOVE "VHDIS24"  TO SCREEN-NAME
               GO TO SHOWFORM-2.

           IF HDI-NUM = "25"
               MOVE "VHDIS25"  TO SCREEN-NAME
               GO TO SHOWFORM-2.

           IF HDI-NUM = "26"
               MOVE "VHDIS26"  TO SCREEN-NAME
               GO TO SHOWFORM-2.

           IF HDI-NUM = "27"
               MOVE "VHDIS27"  TO SCREEN-NAME
               GO TO SHOWFORM-2.

           IF HDI-NUM = "31"
               MOVE "VHDIS31"  TO SCREEN-NAME
               GO TO SHOWFORM-2.

           IF HDI-NUM = "32"
               MOVE "VHDIS32"  TO SCREEN-NAME
               GO TO SHOWFORM-2.

           IF HDI-NUM = "33"
               MOVE "VHDIS33"  TO SCREEN-NAME
               GO TO SHOWFORM-2.

           MOVE SPACES         TO SCREEN-DATA.
           GO TO SHOWFORM.

       SHOWFORM-2.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE SCREEN-SAVE    TO SCREEN-NAME.
           MOVE SPACES         TO SCREEN-DATA.
           GO TO SHOWFORM.

       END-OF-JOB.
           CLOSE               DISPLAY-FILE.
           GOBACK.

