       IDENTIFICATION DIVISION.
       PROGRAM-ID.             SPMINWOI.
       AUTHOR.                 J.S. BUNGO.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       SPECIAL-NAMES.          LOCAL-DATA       IS LOCAL-DATA-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZPMMAINT-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

           SELECT PM-SCHEDULE
                  ASSIGN       TO DATABASE-MCFLMM4405
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-PLANNED
                  ASSIGN       TO DATABASE-MCFLMM1101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT OUT-FILE
                  ASSIGN       TO DISK-PMINWOI
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE  IS DYNAMIC
                  RELATIVE KEY IS ACT-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT SORT-FILE
                  ASSIGN       TO DISK-SORTFILE.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS       ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       FD  PM-SCHEDULE
           LABEL RECORDS       ARE STANDARD.
       01  PM-SCHED-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM4405.

       FD  WO-PLANNED
           LABEL RECORDS       ARE STANDARD.
       01  WO-PLANNED-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.

       FD  OUT-FILE            RECORD CONTAINS 66 CHARACTERS
           LABEL RECORDS       ARE OMITTED
           DATA RECORD         IS OUT-REC.
       01  OUT-REC.
           05  OUT-EQUIP       PIC X(6).
           05  OUT-WO-NUM.
               10  OUT-WO      PIC X(7).
               10  OUT-WO-SUF  PIC X(3).
           05  OUT-DESCRIPT    PIC X(30).
           05  OUT-JOBP        PIC X(10).
           05  OUT-SCHED       PIC X(10).

       SD  SORT-FILE           RECORD CONTAINS 66 CHARACTERS
           DATA RECORD         IS SORT-REC.
       01  SORT-REC.
           05  SORT-WO         PIC X(10).
           05  SORT-EQUIP      PIC X(6).
           05  SORT-DESCRIPT   PIC X(30).
           05  SORT-JOBP       PIC X(10).
           05  SORT-SCHED      PIC X(10).

       WORKING-STORAGE SECTION.
       77  SUB                 PIC 9(04) VALUE 0.
       77  HELP-SW             PIC 9(04) VALUE 0.
       77  EOF-SW              PIC 9(04) VALUE 0.
       77  ACT-KEY             PIC 9(08).
       77  MAX-KEY             PIC 9(08).
       77  PAGE-KEY            PIC 9(08)  VALUE 0.
       77  ZONE-KEY            PIC X(04)  VALUE SPACES.
       77  LAST-SORT-WO        PIC X(10)  VALUE SPACES.

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM PIC X(08) VALUE "SPMINWOI".
           05  PROGRAM-TYPE    PIC X(02) VALUE "IN".
           05  PROGRAM-RELEASE PIC X(12) VALUE " J0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESCA1 PIC X(30) VALUE
                   "DISPLAYS A LIST OF WORKORDERS ".
               10  PROG-DESCA2 PIC X(30) VALUE
                   "AND THEIR SCHEDULE NAMES      ".
               10  PROG-DESCB1 PIC X(60) VALUE
                   "THAT HAVE BEEN INITIATED.     ".
               10  PROG-FUNC1  PIC X(30) VALUE
                   "RUNS FROM THE f6 KEY OF THE RE".
               10  PROG-FUNC2  PIC X(30) VALUE
                   "PORTS AND INQUIRIES MENU.     ".
           05  PASSWORD-FLAG   PIC X.

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       01  SCREEN-DATA.
           05  ZONE-BUF        PIC X(04).
           05  SCREEN-LINE     OCCURS 19 TIMES.
               10  EQUIP-BUF   PIC X(06).
               10  WO-BUF      PIC X(10).
               10  DESCRIP-BUF PIC X(30).
               10  JOBP-BUF    PIC X(10).
               10  SCHED-BUF   PIC X(10).
           05  CMDMSG          PIC X(79).
           05  ERRMSG          PIC X(79).

       01  DB-ERROR.
           05  DB-TYPE         PIC X(08) VALUE SPACES.
           05  FILLER          PIC X(21) VALUE " ERROR - FILE-STAT = ".
           05  CON-WORD        PIC XX.

           COPY SCREENIO       IN COPYLIB.

           COPY CATREAD        IN COPYLIB.

           COPY JCWAREA        IN COPYLIB.

       01  MESSAGE-FILE-DATA.  COPY ERRORLIN IN COPYLIB.

       01  PM-SCHED-DATA.      COPY DPMSCHED IN COPYLIB.

       01  WO-PLANNED-DATA.    COPY DWOPLAN  IN COPYLIB.

       LINKAGE SECTION.
           COPY VCOMLINK       IN COPYLIB.

       01  DBPARAMETERS.       COPY DBPARMS  IN COPYLIB.

           COPY LANGSUB        IN COPYLIB.

       PROCEDURE DIVISION      USING VIEW-COMAREA
                               DBPARAMETERS
                               LANGUAGE-PARMS.

       OPEN-FILES-SECTION      SECTION 01.
       OPEN-FILES.
           ACCEPT MC-LOCAL-DATA-AREA FROM LOCAL-DATA-AREA.
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          WO-PLANNED
                               PM-SCHEDULE.

       BEGIN-PROC.
           CALL "CLPMINWOI".
           MOVE SPACES         TO LAST-SORT-WO.
           MOVE SPACES         TO SCREEN-DATA MESSAGE-BUFFER.

           IF JCW-ZJCW-269 = "    "
               CALL "TRTVZONE" USING ZONE-KEY
               IF ZONE-KEY = SPACES
                   GO TO END-OF-JOB
               ELSE
                   GO TO MAIN
           ELSE
               MOVE JCW-ZJCW-269  TO ZONE-KEY.

           GO TO MAIN.

       END-OF-JOB.
           CLOSE               DISPLAY-FILE
                               PM-SCHEDULE
                               WO-PLANNED.
           GOBACK.

       MAIN.
           MOVE SPACES         TO SCREEN-DATA MESSAGE-BUFFER.
           OPEN OUTPUT         OUT-FILE.
           MOVE 0              TO EOF-SW ACT-KEY PAGE-KEY.
           SORT SORT-FILE      ASCENDING KEY
                               SORT-EQUIP
                               SORT-WO
             INPUT  PROCEDURE  SORTIN-INIT-INQ
                               THRU SORT-IP-EXIT
             OUTPUT PROCEDURE  SORTOUT-INIT-INQ
                               THRU SORT-WF-EXIT.

           IF ACT-KEY = 0
      **********************************************************************
      **    MESSAGE 040/011:
      ** NO RECORDS FOUND WHICH MATCH YOUR SELECTION
      **********************************************************************
               MOVE  40        TO LANG-SETNUM
               MOVE  11        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE CATREAD-MSG-TEXT TO ERRMSG
               MOVE "    "     TO JCW-ZJCW-269
               MOVE "VINITWOI" TO SCREEN-NAME
               MOVE ALL B"0"   TO SCREEN-INDICATORS
               MOVE     B"1"   TO IND(99)
               GO TO SHOWFORM.

           CLOSE               OUT-FILE.
           OPEN I-O            OUT-FILE.
           MOVE 0              TO ACT-KEY.
           MOVE "VINITWOI"     TO SCREEN-NAME.
           MOVE 69             TO HELP-SW.

       RESET-SCREEN.
           MOVE SPACES         TO SCREEN-DATA MESSAGE-BUFFER.
           PERFORM FILL-SCREEN THRU FS-EXIT.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

       SHOWFORM.
           MOVE SCREEN-DATA    TO DISPLAY-REC.
           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               CLOSE           OUT-FILE
               GO TO END-OF-JOB.

           READ DISPLAY-FILE   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               CLOSE           OUT-FILE
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 3 OR 8
               CLOSE           OUT-FILE
               GO TO END-OF-JOB.

           IF ACT-KEY = 0
               CLOSE           OUT-FILE
               GO TO BEGIN-PROC.

           IF KEY-HIT = 1
               CLOSE           OUT-FILE
               MOVE "    "     TO JCW-ZJCW-269
               GO TO BEGIN-PROC.

           IF KEY-HIT = 2
               IF ACT-KEY NOT > 19
                   GO TO SHOWFORM
               ELSE
                   COMPUTE ACT-KEY = ACT-KEY - PAGE-KEY - 19
                   MOVE 0      TO EOF-SW
                   GO TO RESET-SCREEN.

           IF KEY-HIT = 4
               IF EOF-SW = 1
                   GO TO SHOWFORM
               ELSE
                   GO TO RESET-SCREEN.

           IF KEY-HIT = 7
               CALL "SPMHELPM" USING HELP-SW
               GO TO SHOWFORM.

           GO TO SHOWFORM.

       FILL-SCREEN.
           MOVE 0              TO SUB PAGE-KEY.
           MOVE ZONE-KEY       TO ZONE-BUF.
           PERFORM FILL-LINE   THRU FL-EXIT UNTIL SUB = 19.

       FS-EXIT.    EXIT.

       FILL-LINE.
           ADD 1               TO ACT-KEY SUB PAGE-KEY.
           MOVE SPACES         TO OUT-REC.
           READ OUT-FILE       INVALID KEY
               MOVE 1          TO EOF-SW
               MOVE 19         TO SUB
               GO TO FL-EXIT.

           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               MOVE 19         TO SUB
               SUBTRACT 1      FROM ACT-KEY PAGE-KEY
               GO TO FL-EXIT.

           MOVE OUT-WO-NUM     TO WO-BUF(SUB).
           MOVE OUT-EQUIP      TO EQUIP-BUF(SUB).
           MOVE OUT-DESCRIPT   TO DESCRIP-BUF(SUB).
           MOVE OUT-JOBP       TO JOBP-BUF(SUB).
           MOVE OUT-SCHED      TO SCHED-BUF(SUB).

       FL-EXIT.                EXIT.

       999-CATREAD.
           MOVE SPACES         TO CATREAD-MSG-TEXT.
           MOVE LANG-SETNUM    TO CATREAD-MSG-SET.
           MOVE LANG-MSGNUM    TO CATREAD-MSG-NUM.
           CALL "CCATREAD"     USING CATREAD-PARMS.
           IF CATREAD-MSG-NOT-FOUND
               MOVE "***ERROR MSG NOT FOUND***" TO CATREAD-MSG-TEXT.

       999-CATREAD-EXIT.       EXIT.

       SORTIN-INIT-INQ-SECTION SECTION 02.
       SORTIN-INIT-INQ.
           PERFORM SORT-MAIN   THRU SORT-M-EXIT.
           GO TO SORT-IP-EXIT.

       SORT-MAIN.
           MOVE ZONE-KEY       TO ZONE OF PM-SCHEDULE.
           START PM-SCHEDULE   KEY >= ZONE OF PM-SCHEDULE
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO SORT-M-EXIT.

       SORT-DBGET.
           MOVE SPACES         TO SORT-REC.
           READ PM-SCHEDULE    NEXT INTO PM-SCHED-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "10" OR "14" OR "46"
               GO TO SORT-M-EXIT
           ELSE
           IF FILE-STAT NOT = "00"
               MOVE "READ    " TO DB-TYPE
               MOVE FILE-STAT  TO CON-WORD
               MOVE DB-ERROR   TO ERRMSG
               MOVE 1          TO FIELD-NUMBER
               MOVE B"1"       TO IND(FIELD-NUMBER) IND(99)
               GO TO SORT-M-EXIT.

           IF SCH-ZONE NOT = ZONE-KEY
               GO TO SORT-M-EXIT.

           IF SCH-REC-TYP = "CL" OR "RI" OR "MS" OR "DN"
               GO TO SORT-DBGET.

           IF SCH-REC-TYP = "DM"
               NEXT SENTENCE
           ELSE
           IF SCH-LEVEL NOT = 01
               GO TO SORT-DBGET.

           IF SCH-REC-PR NOT = SPACES
               GO TO SORT-DBGET.

           MOVE "000"          TO SCH-WO-SUFF.
           MOVE SCH-WO-NUM     TO WONUM OF WO-PLANNED.
           READ WO-PLANNED     INTO WO-PLANNED-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "23"
                GO TO SORT-DBGET
           ELSE
           IF FILE-STAT NOT = "00"
               MOVE "READ    " TO DB-TYPE
               MOVE FILE-STAT  TO CON-WORD
               MOVE DB-ERROR   TO ERRMSG
               MOVE 1          TO FIELD-NUMBER
               MOVE B"1"       TO IND(FIELD-NUMBER) IND(99)
               GO TO SORT-M-EXIT.

           MOVE WO-NUM-PLANNED   TO SORT-WO.
           MOVE EQUIP-NUM-P      TO SORT-EQUIP.
           MOVE DESCRIPTION-1-P  TO SORT-DESCRIPT.
           MOVE PM-JOBPLAN-KEY   TO SORT-JOBP.
           MOVE PM-SCHEDULE-KEY  TO SORT-SCHED.

           RELEASE             SORT-REC.
           GO TO SORT-DBGET.

       SORT-M-EXIT.            EXIT.

       SORT-IP-EXIT.           EXIT.

       SORTOUT-INIT-INQ-SECT   SECTION 03.
       SORTOUT-INIT-INQ.
           RETURN SORT-FILE    AT END
               MOVE ACT-KEY    TO MAX-KEY
               GO TO SORT-WF-EXIT.

           IF SORT-WO = LAST-SORT-WO
               GO TO SORTOUT-INIT-INQ.

           MOVE SORT-WO        TO LAST-SORT-WO.
           ADD 1               TO ACT-KEY.
           MOVE SORT-REC       TO OUT-REC.
           WRITE OUT-REC       INVALID KEY
               DISPLAY "WRITE OUT-FILE ERR"
               GO TO SORT-WF-EXIT.

           GO TO SORTOUT-INIT-INQ.

       SORT-WF-EXIT.           EXIT.

