       IDENTIFICATION DIVISION.
       PROGRAM-ID.             SPMJPDEL.
       AUTHOR.                 J S  BUNGO.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
       DATE-WRITTEN.           AUGUST 4, 1992
      *REMARKS.
      **************************************************************
      *D  SPMJPDEL  -  THIS PROGRAM WILL DELETE AN ENTIRE PM MASTER
      *D               JOBPLAN GIVEN THE JOBPLAN NAME.
      *
      *   JOBPLANS MAY ONLY BE DELETED IF ALL WORKORDERS HAVE BEEN
      *   CLOSED THAT REFER TO IT (WO WITH STATUS OF FF IS CLOSED).
      *   IF THIS PROGRAM IS CALLED AND THE JOBPLAN NAME HAS A
      *   PROCESS FLAG OF OTHER THAN SPACES, IT WILL DELETE THE
      *   JOBPLAN NAME WITH NO UPDATE TO THE PM-JOBPLAN-KEYS
      *   DATASET.   THIS WILL ALLOW THIS PROGRAM TO BE USED ALSO
      *   AS A UTILITY PROGRAM TO DELETE JOBPLANS FROM THE SYSTEM,
      *   SUCH AS FROM THE RENUMBER PROGRAM SPMRENUM.
      *
      *   THE LINKAGE VARIABLE RETURN-BYTE WILL RETURN "0" OR "1"
      *   FOR SUCCESSFUL OR UNSUCCESSFUL EXECUTION RESPECTIVELY.
      *   E1 RETURNS ANY MESSAGES.
      **************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        HP-3000.
       OBJECT-COMPUTER.        HP-3000.
       SPECIAL-NAMES.          I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT WO-PLANNED
                  ASSIGN TO DATABASE-MCFLMM1106
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STAT.
           SELECT PM-JOBPLAN
                  ASSIGN TO DATABASE-MCFLMM4101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS FILE-STAT.
           SELECT PM-JOBPLAN-KEYS
                  ASSIGN TO DATABASE-MCFLMM4002
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS FILE-STAT.

       DATA DIVISION.
       FILE SECTION.
       FD  WO-PLANNED
           LABEL RECORDS ARE STANDARD.
       01  WO-PLANNED-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1106.
       FD  PM-JOBPLAN
           LABEL RECORDS ARE STANDARD.
       01  PM-JOBPLAN-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM4101.
       FD  PM-JOBPLAN-KEYS
           LABEL RECORDS ARE STANDARD.
       01  PM-JOBP-KEYS-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM4002.

       WORKING-STORAGE SECTION.
       01  BASE                    PIC X(16).
       01  FILE-STAT               PIC X(02).
       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "SPMJPDEL".
           05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " J0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A1    PIC X(30) VALUE
                   "MASTER JOBPLAN COMPLETE DELETE".
               10  PROG-DESC-A2    PIC X(30) VALUE SPACES.
               10  PROG-DESC-B1    PIC X(30) VALUE SPACES.
               10  PROG-DESC-B2    PIC X(30) VALUE SPACES.
               10  PROG-FUNCTION1  PIC X(30) VALUE
                   "RUNS FROM PROGRAM XPMMAINT.   ".
               10  PROG-FUNCTION2  PIC X(30) VALUE
                   "                              ".
           05  PASSWORD-FLAG       PIC X.

       01  DB-ERROR.
           05  DB-TYPE   PIC X(08) VALUE SPACES.
           05  DB-FILE   PIC X(18) VALUE SPACES.
           05  FILLER    PIC X(21) VALUE " ERROR - COND-WORD = ".
           05  CON-WORD  PIC -9999.

       01  DELETE-PMJPK-ALL-FLAG PIC X(1).
           88  DELETE-PMJPK-ALL  VALUE "Y".

       01  PROCESSING-FLAG     PIC X(2).
       01  PROCESS-ERROR       PIC X(2)   VALUE "XX".

           COPY TBLOWUP        IN COPYLIB.
           COPY CATREAD        IN COPYLIB.
           COPY DBSTAT         IN COPYLIB.
       01  WO-PLANNED-DATA.    COPY DWOPLAN  IN COPYLIB.
       01  MESSAGE-DATA.       COPY ERRORLIN IN COPYLIB.
       01  PM-JOBPLAN-DATA.    COPY DPMJBPLN IN COPYLIB.
       01  PM-JOBP-KEYS-DATA.  COPY DPMJBKEY IN COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.       COPY DBPARMS  IN COPYLIB.
       01  E1                  PIC X(78).
           COPY VCOMLINK       IN COPYLIB.
           COPY LANGSUB        IN COPYLIB.
       01  DELETE-NAME         PIC X(10).

       PROCEDURE DIVISION USING DBPARAMETERS
                                E1
                                VIEW-COMAREA
                                LANGUAGE-PARMS
                                DELETE-NAME.
       BEGIN.
           MOVE "MMISA;" TO BASE.
           MOVE SPACES TO E1.
           MOVE "0" TO RETURN-BYTE.
           MOVE LOW-VALUES     TO STATUS-AREA.
      *----OPEN ALL DATABASE FILES
           OPEN INPUT WO-PLANNED.
           OPEN I-O PM-JOBPLAN
                    PM-JOBPLAN-KEYS.

           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "N"
                MOVE "1" TO RETURN-BYTE
                GO TO END-OF-JOB.

           PERFORM GET-PROCESSING-FLAG THRU GET-PROCESSING-FLAG-EXIT.
           IF PROCESSING-FLAG = SPACES
               PERFORM CHECK-WO-PLANNED THRU CHECK-WO-PLANNED-EXIT.
           IF PROCESSING-FLAG = SPACES
               PERFORM PUT-PMJPK-DELETE THRU PUT-PMJPK-DELETE-EXIT.
           IF PROCESSING-FLAG = SPACES
               MOVE "N" TO DELETE-PMJPK-ALL-FLAG
               PERFORM DELETE-JOBP-KEYS THRU DELETE-JOBP-KEYS-EXIT.
           IF PROCESSING-FLAG NOT = PROCESS-ERROR
               PERFORM DELETE-ALL-JOBPLAN THRU DELETE-ALL-JOBPLAN-EXIT.
           IF PROCESSING-FLAG = SPACES
               MOVE "Y" TO DELETE-PMJPK-ALL-FLAG
               PERFORM DELETE-JOBP-KEYS THRU DELETE-JOBP-KEYS-EXIT.
           IF PROCESSING-FLAG = SPACES
      ******************************************************************
      *M    MESSAGE 036/018:
      *M  JOBPLAN HAS BEEN DELETED SUCCESSFULLY
      ******************************************************************
               MOVE 36   TO CATREAD-MSG-SET
               MOVE 18   TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE CATREAD-MSG-TEXT TO E1.

       END-OF-JOB.
           CLOSE WO-PLANNED
                 PM-JOBPLAN
                 PM-JOBPLAN-KEYS.
           GOBACK.

       GET-PROCESSING-FLAG.
            MOVE SPACES         TO PM-JOBP-KEYS-DATA.
            MOVE DELETE-NAME TO PMJOBPKEY OF PM-JOBPLAN-KEYS.
            START PM-JOBPLAN-KEYS KEY = PMJOBPKEY OF PM-JOBPLAN-KEYS
                INVALID KEY MOVE FILE-STAT TO FILE-STAT.
            IF FILE-STAT NOT = "00"
      ******************************************************************
      *M    MESSAGE 036/008:
      *M  JOBPLAN DOES NOT EXIST
      ******************************************************************
               MOVE 36   TO CATREAD-MSG-SET
               MOVE 08   TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE CATREAD-MSG-TEXT TO E1
               MOVE "1" TO RETURN-BYTE
               MOVE PROCESS-ERROR TO PROCESSING-FLAG
               GO TO GET-PROCESSING-FLAG-EXIT.

      *------ LOOP THROUGH CHAIN IN CASE THERE IS A "DELETE" RECORD.
      *       DELETE SUPERCEDES KEYREC.  IF NO DELETE OR KEYREC THEN
      *       ACT AS THOUGH THERE WAS A DELETE RECORD.
            MOVE SPACES TO PROCESSING-FLAG.
       GET-FLAG-LOOP.
            READ PM-JOBPLAN-KEYS NEXT INTO PM-JOBP-KEYS-DATA
                AT END MOVE FILE-STAT TO FILE-STAT.
            IF FILE-STAT NOT = "00"
               IF FILE-STAT = "10" OR "14" OR "46"
                   GO TO GET-PROCESSING-FLAG-EXIT
               ELSE
                   MOVE FILE-STAT  TO CON-WORD COND-WORD
                   MOVE "DBGET   " TO DB-TYPE
                   MOVE "1" TO RETURN-BYTE
                   MOVE "PM-JOBP-KEYS" TO DB-FILE
                   MOVE DB-ERROR   TO E1
                   MOVE PROCESS-ERROR TO PROCESSING-FLAG
                   GO TO GET-PROCESSING-FLAG-EXIT.
            IF PMJPK-JOBP-KEY NOT = DELETE-NAME
                GO TO GET-PROCESSING-FLAG-EXIT.

            IF RECORD-KEY = "KEYREC"
               MOVE PROCESS-FLAG TO PROCESSING-FLAG
               GO TO GET-FLAG-LOOP
            ELSE IF RECORD-KEY = "DELETE"
               MOVE SPACES TO PROCESSING-FLAG
            ELSE
               GO TO GET-FLAG-LOOP.
       GET-PROCESSING-FLAG-EXIT.
           EXIT.

       CHECK-WO-PLANNED.
            MOVE DELETE-NAME TO PMJOBPKEY OF WO-PLANNED.
            START WO-PLANNED KEY = PMJOBPKEY OF WO-PLANNED
                INVALID KEY MOVE FILE-STAT TO FILE-STAT.
            IF FILE-STAT NOT = "00"
                GO TO CHECK-WO-PLANNED-EXIT.
       CHECK-WO-LOOP.
           READ WO-PLANNED NEXT INTO WO-PLANNED-DATA
               AT END MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               IF PM-JOBPLAN-KEY NOT = DELETE-NAME
                   GO TO CHECK-WO-PLANNED-EXIT
               END-IF
               IF WO-STATUS-P = "FF"
                   GO TO CHECK-WO-LOOP
               ELSE
      ******************************************************************
      *M    MESSAGE 042/146:
      *M  PLANNED WORKORDER REFERENCES JOBPLAN NAME, CANNOT DELETE
      ******************************************************************
                   MOVE 42 TO CATREAD-MSG-SET
                   MOVE 146 TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE CATREAD-MSG-TEXT TO E1
                   MOVE "1" TO RETURN-BYTE
                   MOVE PROCESS-ERROR TO PROCESSING-FLAG
           ELSE IF FILE-STAT = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
                   MOVE FILE-STAT  TO CON-WORD COND-WORD
                   MOVE "DBGET   " TO DB-TYPE
                   MOVE "WO-PLANNED" TO DB-FILE
                   MOVE DB-ERROR   TO E1
                   MOVE "1" TO RETURN-BYTE
                   MOVE PROCESS-ERROR TO PROCESSING-FLAG.
       CHECK-WO-PLANNED-EXIT.
           EXIT.

       PUT-PMJPK-DELETE.
           MOVE SPACES TO PM-JOBP-KEYS-DATA.
           MOVE "DELETE" TO RECORD-KEY.
           MOVE DELETE-NAME TO PMJPK-JOBP-KEY.
           MOVE "9999" TO PMJPK-TASK-NUM.
           WRITE PM-JOBP-KEYS-REC FROM PM-JOBP-KEYS-DATA
               INVALID KEY MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "DBPUT  " TO DB-TYPE
               MOVE FILE-STAT TO CON-WORD COND-WORD
               MOVE "PM-JOP-KEYS" TO DB-FILE
               MOVE DELETE-NAME TO BU-DISPLAY-FLD (2)
               MOVE RECORD-KEY TO BU-DISPLAY-FLD (3)
               MOVE "DBPUT ERR - PUT-PMJPK-DELETE" TO BU-DISPLAY-MSG
               PERFORM 999-BLOWUP.
       PUT-PMJPK-DELETE-EXIT.
           EXIT.

       DELETE-JOBP-KEYS.
           MOVE SPACES TO PM-JOBP-KEYS-DATA.
            MOVE DELETE-NAME TO PMJOBPKEY OF PM-JOBPLAN-KEYS.
            START PM-JOBPLAN-KEYS KEY = PMJOBPKEY OF PM-JOBPLAN-KEYS
                INVALID KEY MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO DELETE-JOBP-KEYS-EXIT.
       DELETE-JOBPK-LOOP.
           READ PM-JOBPLAN-KEYS NEXT INTO PM-JOBP-KEYS-DATA
               AT END MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
                IF FILE-STAT = "10" OR "14" OR "46"
                    GO TO DELETE-JOBP-KEYS-EXIT
                ELSE
                    MOVE "DBGET  " TO DB-TYPE
                    MOVE FILE-STAT TO CON-WORD
                    MOVE "PM-JOBP-KEYS" TO DB-FILE
                    MOVE DB-ERROR TO E1
                    MOVE "1" TO RETURN-BYTE
                    MOVE PROCESS-ERROR TO PROCESSING-FLAG
                    GO TO DELETE-JOBP-KEYS-EXIT.
           IF PMJPK-JOBP-KEY NOT = DELETE-NAME
               GO TO DELETE-JOBP-KEYS-EXIT.

           IF NOT DELETE-PMJPK-ALL
               IF RECORD-KEY = "DELETE"
                   GO TO DELETE-JOBPK-LOOP.

           DELETE PM-JOBPLAN-KEYS
               INVALID KEY MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE FILE-STAT TO CON-WORD COND-WORD
               MOVE DELETE-NAME TO BU-DISPLAY-FLD (2)
               MOVE RECORD-KEY TO BU-DISPLAY-FLD (3)
               MOVE PMJPK-TASK-NUM TO BU-DISPLAY-FLD (4)
               MOVE "DBDELETE ERR - DELETE-JOBP-KEYS" TO BU-DISPLAY-MSG
               PERFORM 999-BLOWUP.
           IF PROCESSING-FLAG NOT = PROCESS-ERROR
               GO TO DELETE-JOBPK-LOOP.
       DELETE-JOBP-KEYS-EXIT.
           EXIT.

       DELETE-ALL-JOBPLAN.
           MOVE SPACES         TO PM-JOBPLAN-DATA.
           MOVE DELETE-NAME TO PMJOBPKEY OF PM-JOBPLAN.
           START PM-JOBPLAN KEY = PMJOBPKEY OF PM-JOBPLAN
               INVALID KEY MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      ******************************************************************
      *M    MESSAGE 036/008:
      *M  JOBPLAN DOES NOT EXIST
      ******************************************************************
               MOVE 36   TO CATREAD-MSG-SET
               MOVE 08   TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE CATREAD-MSG-TEXT TO E1
               MOVE "1" TO RETURN-BYTE
               MOVE PROCESS-ERROR TO PROCESSING-FLAG
               GO TO DELETE-ALL-JOBPLAN-EXIT.

           PERFORM DELETE-JOBP-LOOP THRU DELETE-JOBP-LOOP-EXIT
               UNTIL FILE-STAT NOT = "00".
       DELETE-ALL-JOBPLAN-EXIT.
           EXIT.

       DELETE-JOBP-LOOP.
           READ PM-JOBPLAN NEXT INTO PM-JOBPLAN-DATA
               AT END MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "10" OR "14" OR "46"
               GO TO DELETE-JOBP-LOOP-EXIT
           ELSE
           IF FILE-STAT NOT = "00"
               MOVE FILE-STAT  TO CON-WORD COND-WORD
               MOVE "DBGET   " TO DB-TYPE
               MOVE DB-ERROR   TO E1
               MOVE "1" TO RETURN-BYTE
               MOVE PROCESS-ERROR TO PROCESSING-FLAG
               GO TO DELETE-JOBP-LOOP.
           IF JOBPLAN-KEY NOT = DELETE-NAME
               MOVE "10" TO FILE-STAT
               GO TO DELETE-JOBP-LOOP-EXIT.

           PERFORM DELETE-JOBPLAN THRU DELETE-JOBPLAN-EXIT.
       DELETE-JOBP-LOOP-EXIT.
           EXIT.

       DELETE-JOBPLAN.
           DELETE PM-JOBPLAN
               INVALID KEY MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE FILE-STAT TO CON-WORD COND-WORD
               MOVE DELETE-NAME TO BU-DISPLAY-FLD (2)
               MOVE PMJP-SEQ-LINE TO BU-DISPLAY-FLD (3)
               MOVE "DBDELETE ERR - DELETE-JOBPLAN" TO BU-DISPLAY-MSG
               PERFORM 999-BLOWUP.
           MOVE SPACES         TO PM-JOBPLAN-DATA.
       DELETE-JOBPLAN-EXIT.
           EXIT.

       999-CATREAD.
           MOVE SPACES         TO CATREAD-MSG-TEXT.
           CALL "CCATREAD" USING CATREAD-PARMS.
           IF CATREAD-MSG-NOT-FOUND
               MOVE "SPMJPDEL - CATREAD ERROR" TO E1
               MOVE "1" TO RETURN-BYTE
               GO TO END-OF-JOB.
       999-CATREAD-EXIT.    EXIT.

       999-BLOWUP.
           MOVE "SPMJPDEL" TO BU-PGM-NAME.
           MOVE VIEW-NFNAME TO BU-DISPLAY-FLD (1).
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
                                VIEW-COMAREA, COND-WORD,
                                BU-DISPLAY-MSG, BU-DISPLAY-FLDS.
      *******************>>>  END OF FILE  <<<*********************
