       IDENTIFICATION DIVISION.
       PROGRAM-ID.             SPMJPINQ.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.  GOODYEAR TIRE & RUBBER CO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        HP-3000.
       OBJECT-COMPUTER.        HP-3000.
       SPECIAL-NAMES.          I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZPMMAINT-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

           SELECT PM-JOBPLAN-KEYS
                  ASSIGN       TO DATABASE-MCFLMM4001
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT PM-JOBPLAN-KEY
                  ASSIGN       TO DATABASE-MCFLMM4002
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT OUT-FILE
                  ASSIGN       TO DISK-PMJPINQ
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE  IS DYNAMIC
                  RELATIVE KEY IS ACT-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT SORT-FILE
                  ASSIGN       TO DISK-SORTFILE.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       FD  PM-JOBPLAN-KEYS
           LABEL RECORDS ARE STANDARD.
       01  PM-JOBP-KEYS-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM4001.

       FD  PM-JOBPLAN-KEY
           LABEL RECORDS ARE STANDARD.
       01  PM-JOBP-KEY-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM4002.

       FD  OUT-FILE RECORD CONTAINS 71 CHARACTERS
           LABEL RECORDS ARE OMITTED
           DATA RECORD IS OUT-REC.
       01  OUT-REC.
           05  OUT-FILL        PIC X.
           05  OUT-NAME        PIC X(10).
           05  OUT-TITLE       PIC X(50).
           05  OUT-OWNER       PIC X(04).
           05  OUT-DATE.
               10  OUT-YY      PIC 99.
               10  OUT-MM      PIC 99.
               10  OUT-DD      PIC 99.

       SD  SORT-FILE RECORD CONTAINS 71 CHARACTERS
           DATA RECORD IS SORT-REC.
       01  SORT-REC.
           05  SORT-FILL       PIC X.
           05  SORT-NAME.
               10  SN0         PIC X.
               10  SN1         PIC X.
               10  SN2         PIC X.
               10  SN3         PIC X.
               10  SN4         PIC X.
               10  SN5         PIC X.
               10  SN6         PIC X.
               10  SN7         PIC X.
               10  SN8         PIC X.
               10  SN9         PIC X.
           05  SORT-TITLE      PIC X(50).
           05  SORT-OWNER      PIC X(04).
           05  SORT-DATE.
               10  SORT-YY     PIC 99.
               10  SORT-MM     PIC 99.
               10  SORT-DD     PIC 99.

       WORKING-STORAGE SECTION.
       77  KEYREC                    PIC X(06) VALUE "KEYREC".
       77  JP-KEY-NAME               PIC X(10).
       77  SUB                       PIC 9(04) VALUE 0  COMP.
       77  MOD-SW                    PIC 9(04) VALUE 0  COMP.
       77  WOINQ-SW                  PIC 9(04) VALUE 0  COMP.
       77  EOF-SW                    PIC S9(4) VALUE 0  COMP.
       77  HELP-SW                   PIC 9(04) VALUE 0.
       77  ACT-KEY                   PIC 9999  VALUE 0.
       77  MAX-KEY                   PIC 9999  VALUE 0.
       77  SAVE-KEY                  PIC 9999  VALUE 0.
       77  MOD-KEY                   PIC 9999  VALUE 0.
       77  PAGE-KEY                  PIC 9999  VALUE 0.

       01  DISPLAY-STATUS            PIC X(02).
       01  SRF-INDICATORS.
           05  IND OCCURS 99 TIMES   PIC 1 INDICATOR 01.
       01  WS-CONTROL.
           05  FUNCTION-NUM          PIC X(02).
           05  TERMINAL-ID           PIC X(10).
           05  FORMAT-NAME           PIC X(10).

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "SPMJPINQ".
           05  PROGRAM-TYPE        PIC X(02) VALUE "IN".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " J0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A     PIC X(60) VALUE
           "DISPLAYS A LIST OF JOBPLAN NAMES WITH THEIR TITLES, OWNERS".
               10  PROG-DESC-B     PIC X(60) VALUE
           "AND CREATE DATES FOR THE NEW PM JOBPLAN FORMAT.           ".
               10  PROG-FUNCTION   PIC X(60) VALUE
           "RUNS FROM THE f6 KEY OF THE REPORTS AND INQUIRIES MENU.   ".
           05  PASSWORD-FLAG       PIC X.

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       01  SELECT-BUFFER.
           05  JP-NAME-BUF.
               10  JP0         PIC X.
               10  JP1         PIC X.
               10  JP2         PIC X.
               10  JP3         PIC X.
               10  JP4         PIC X.
               10  JP5         PIC X.
               10  JP6         PIC X.
               10  JP7         PIC X.
               10  JP8         PIC X.
               10  JP9         PIC X.
           05  CRTR-BUF        PIC X(04).
           05  CMDMSG          PIC X(79).
           05  ERRMSG          PIC X(79).

       01  SCREEN-BUFFER.
           05  DLINE           OCCURS 19 TIMES.
               10  DSEL        PIC X.
               10  DDATA.
                   15  DNAME   PIC X(10).
                   15  DTITLE  PIC X(50).
                   15  FILLER  PIC X(12).
           05  CMDMSG2         PIC X(79).
           05  ERRMSG2         PIC X(79).

       01  MODIFY-SCREEN.
           05  M-JP-NAME       PIC X(10).
           05  M-JP-TITLE      PIC X(50).
           05  CMDMSGM         PIC X(79).
           05  ERRMSGM         PIC X(79).

       01  LINE-IN.
           05  LI-SEL          PIC X.
           05  LI-NAME         PIC X(10).
           05  LI-TITLE        PIC X(50).
           05  LI-OWNER        PIC X(04).
           05  LI-DATE.
               10  LI-MM       PIC XX.
               10  SLASH1      PIC X.
               10  LI-DD       PIC XX.
               10  SLASH2      PIC X.
               10  LI-YY       PIC XX.

       01  DB-ERROR.
           05  DB-TYPE   PIC X(08) VALUE SPACES.
           05  FILLER    PIC X(21) VALUE " ERROR - FILE-STAT = ".
           05  CON-WORD  PIC XX.

       01  SCREEN-PRINT-PARMS.
           05  PRINTCNTL              PIC S9(4)  VALUE ZERO  COMP.
           05  PAGECNTL               PIC S9(4)  VALUE 49    COMP.
           05  SPOOLFIL-OPEN-SW       PIC X      VALUE "N".
       01  PASSED-SPOOL-PRT           PIC S9(2)              COMP.
       01  FATAL-ERR-SW               PIC X.
       01  BU-DISPLAY-AREA.
           05  FILLER                 PIC XX.
           05  BU-DISPLAY-MSG         PIC X(27).
           05  FILLER                 PIC XX.
           05  BU-DISPLAY-STAT        PIC S9(4).
           05  FILLER                 PIC XX.
           05  BU-DISPLAY-FLD         PIC X(14).
           05  FILLER                 PIC XX.

       01  MESSAGE-BUF                PIC X(79).

           COPY CATREAD        IN COPYLIB.

           COPY IOFEEDBACK     IN COPYLIB.

           COPY TDATESUB       IN COPYLIB.

       01  MESSAGE-FILE-DATA.  COPY ERRORLIN IN COPYLIB.

       01  PM-JOBP-KEY-DATA.   COPY DPMJBKEY IN COPYLIB.

       LINKAGE SECTION.
           COPY VCOMLINK       IN COPYLIB.

       01  DBPARAMETERS.       COPY DBPARMS  IN COPYLIB.

           COPY LANGSUB        IN COPYLIB.

       PROCEDURE DIVISION USING VIEW-COMAREA
                                DBPARAMETERS
                                LANGUAGE-PARMS.
       BEGIN-SORT SECTION 01.
       BEGIN-SRT.
           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "N"
               GOBACK.

           CALL "CLOUTJP".

       OPEN-FILES.
           OPEN I-O            DISPLAY-FILE.
           OPEN I-O            PM-JOBPLAN-KEY.
           OPEN INPUT          PM-JOBPLAN-KEYS.

       CLEAR-BUFFERS.
           MOVE SPACES         TO SELECT-BUFFER MESSAGE-BUFFER.
           MOVE ALL B"0"       TO SRF-INDICATORS.

       BEGIN-PROC.
           PERFORM HSK THRU HSK-EXIT.
           GO TO MAIN.

       END-OF-JOB.
           CLOSE               PM-JOBPLAN-KEY.
           CLOSE               PM-JOBPLAN-KEYS.
           CLOSE               DISPLAY-FILE.
           GOBACK.

       HSK.
           MOVE 0              TO DATE-MODE.
           MOVE 66             TO HELP-SW.
           MOVE DATE-FLAG      TO DATE-CODE.
           MOVE "VJPINQSEL"    TO VIEW-NFNAME.

       SHOWFORM-SELECT.
           MOVE SELECT-BUFFER  TO DISPLAY-REC.
           WRITE DISPLAY-REC   FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               GO TO END-OF-JOB.
           MOVE ALL B"0"       TO SRF-INDICATORS.

           READ DISPLAY-FILE   FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK   FROM I-O-FEEDBACK-AREA.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3          TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.
           MOVE DISPLAY-REC    TO SELECT-BUFFER.

           IF VIEW-LASTKEY = 3 OR 8
               GO TO END-OF-JOB.

           IF VIEW-LASTKEY = 7
               CALL "SPMHELPM" USING HELP-SW
               GO TO SHOWFORM-SELECT.

           IF VIEW-LASTKEY NOT = 0
               GO TO SHOWFORM-SELECT.

       HSK-EXIT.    EXIT.

       MAIN.
           OPEN OUTPUT         OUT-FILE.
           MOVE 0              TO ACT-KEY.
           SORT SORT-FILE ASCENDING KEY SORT-NAME
               INPUT  PROCEDURE SORTIN-INQ
               OUTPUT PROCEDURE SORTOUT-INQ.
           CLOSE               OUT-FILE.

           IF ACT-KEY = 0
      **********************************************************************
      **    MESSAGE 040/011:
      ** NO RECORDS FOUND WHICH MATCH YOUR SELECTION
      **********************************************************************
               MOVE  40        TO LANG-SETNUM
               MOVE  11        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE CATREAD-MSG-TEXT TO ERRMSG
               MOVE 1          TO FIELD-NUMBER
               PERFORM SET-ERROR
               GO TO BEGIN-PROC.

           OPEN I-O            OUT-FILE.
           MOVE 0              TO ACT-KEY.
           MOVE "VJPNAMEI"     TO VIEW-NFNAME.

       RESET-SCREEN.
           MOVE 66             TO HELP-SW.
           MOVE SPACES         TO SCREEN-BUFFER MESSAGE-BUFFER.
           PERFORM FILL-SCREEN THRU FS-EXIT.
           MOVE ALL B"0"       TO SRF-INDICATORS.

       SHOWFORM.
           MOVE SCREEN-BUFFER  TO DISPLAY-REC.
           WRITE DISPLAY-REC   FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               CLOSE           OUT-FILE
               GO TO END-OF-JOB.
           MOVE ALL B"0"       TO SRF-INDICATORS.

           READ DISPLAY-FILE   FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK   FROM I-O-FEEDBACK-AREA.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3          TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.

           IF VIEW-LASTKEY = 3 OR 8
               CLOSE           OUT-FILE
               GO TO END-OF-JOB.

           IF VIEW-LASTKEY = 1
               CLOSE           OUT-FILE
               GO TO CLEAR-BUFFERS.

           IF VIEW-LASTKEY = 2
               IF ACT-KEY NOT > 19
                   GO TO SHOWFORM
               ELSE
                   COMPUTE ACT-KEY = ACT-KEY - PAGE-KEY - 19
                   MOVE 0 TO EOF-SW
                   GO TO RESET-SCREEN.

           IF VIEW-LASTKEY = 4
               IF EOF-SW = 1
                   GO TO SHOWFORM
               ELSE
                   GO TO RESET-SCREEN.

           IF VIEW-LASTKEY = 7
               CALL "SPMHELPM" USING HELP-SW
               GO TO SHOWFORM.

           IF VIEW-LASTKEY NOT = 0
               GO TO SHOWFORM.

           MOVE DISPLAY-REC    TO SCREEN-BUFFER.
           PERFORM CHECK-FOR-MODIFY-FLAG.
           PERFORM CHECK-FOR-WO-INQUIRY.

           GO TO SHOWFORM.

       CHECK-FOR-MODIFY-FLAG.
           MOVE 0              TO MOD-SW SUB.
           PERFORM CHECK-MODIFY-LOOP UNTIL SUB = 19.
           IF MOD-SW = 1
               MOVE 0          TO MOD-SW
               MOVE "VJPNAMEI" TO VIEW-NFNAME
               MOVE 66         TO HELP-SW.

       CHECK-MODIFY-LOOP.
           ADD 1               TO MOD-KEY SUB.
           IF DSEL(SUB) = "M"
               IF DNAME(SUB) NOT = SPACES
                   MOVE 1      TO MOD-SW
                   MOVE DNAME(SUB) TO JP-KEY-NAME M-JP-NAME
                   MOVE DTITLE(SUB) TO M-JP-TITLE
                   PERFORM MODIFY-TITLE THRU MT-EXIT
                   MOVE M-JP-TITLE TO DTITLE(SUB)
                   MOVE SPACE  TO DSEL(SUB).

       FILL-SCREEN.
           MOVE 0              TO SUB PAGE-KEY.
           PERFORM FILL-LINE   THRU FL-EXIT UNTIL SUB = 19.
           MOVE ACT-KEY        TO SAVE-KEY.

       FS-EXIT.    EXIT.

       FILL-LINE.
           ADD 1               TO ACT-KEY SUB PAGE-KEY.
           IF SUB = 1
               MOVE ACT-KEY    TO MOD-KEY
               SUBTRACT 1      FROM MOD-KEY.

           MOVE SPACES         TO OUT-REC.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               MOVE 19         TO SUB
               GO TO FL-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               MOVE 19         TO SUB
               SUBTRACT 1 FROM ACT-KEY PAGE-KEY
               GO TO FL-EXIT.

           MOVE OUT-REC        TO LINE-IN.
           MOVE SPACES         TO LI-DATE.
           MOVE "/"            TO SLASH1 SLASH2.

           MOVE OUT-YY         TO DATE-IN-YY.
           MOVE OUT-MM         TO DATE-IN-MD.
           MOVE OUT-DD         TO DATE-IN-DM.
           CALL "TDATECHK"     USING DATE-CHECK-AREA.
           MOVE DATE-OUT-YY    TO LI-YY.
           MOVE DATE-OUT-MD    TO LI-MM.
           MOVE DATE-OUT-DM    TO LI-DD.
           MOVE LINE-IN        TO DLINE(SUB).

       FL-EXIT.    EXIT.

       MODIFY-TITLE.
           MOVE JP-KEY-NAME    TO PMJOBPKEY OF PM-JOBPLAN-KEY.
           START PM-JOBPLAN-KEY KEY = PMJOBPKEY OF PM-JOBPLAN-KEY
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO MT-EXIT.

       MODIFY-DBGET.
           READ PM-JOBPLAN-KEY NEXT INTO PM-JOBP-KEY-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT  = "10" OR "14" OR "46"
               GO TO MT-EXIT.

           IF PMJPK-JOBP-KEY NOT = JP-KEY-NAME
               GO TO MT-EXIT.

           IF RECORD-KEY NOT = "KEYREC"
               GO TO MODIFY-DBGET.

           MOVE "VJPMODIFY"    TO VIEW-NFNAME.
           MOVE 67             TO HELP-SW.

       MODIFY-SHOWFORM.
           MOVE MODIFY-SCREEN  TO DISPLAY-REC.
           WRITE DISPLAY-REC   FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               CLOSE           OUT-FILE
               GO TO END-OF-JOB.
           MOVE ALL B"0"       TO SRF-INDICATORS.

           READ DISPLAY-FILE   FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK   FROM I-O-FEEDBACK-AREA.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3          TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.

           IF VIEW-LASTKEY = 3 OR 8
               GO TO MT-EXIT.

           IF VIEW-LASTKEY = 7
               CALL "SPMHELPM" USING HELP-SW
               GO TO MODIFY-SHOWFORM.

           IF VIEW-LASTKEY NOT = 0
               GO TO MODIFY-SHOWFORM.

           MOVE DISPLAY-REC    TO MODIFY-SCREEN.
           IF M-JP-TITLE = SPACES
      **********************************************************************
      **    MESSAGE 030/042:
      ** DESCRIPTION REQUIRED
      **********************************************************************
               MOVE  30        TO LANG-SETNUM
               MOVE  42        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE CATREAD-MSG-TEXT TO ERRMSGM
               MOVE 2          TO FIELD-NUMBER
               PERFORM SET-ERROR
               GO TO MODIFY-SHOWFORM.

       MODIFY-WRITE.
           MOVE M-JP-TITLE     TO PMJPK-KEY-TITLE.
           REWRITE PM-JOBP-KEY-REC FROM PM-JOBP-KEY-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE FILE-STAT  TO CON-WORD
               MOVE "REWRITE"  TO DB-TYPE
               MOVE DB-ERROR   TO MESSAGE-BUFFER
               MOVE 2          TO FIELD-NUMBER
               PERFORM SET-ERROR
               GO TO MODIFY-SHOWFORM.

           MOVE MOD-KEY        TO ACT-KEY.
           READ OUT-FILE       INVALID KEY
               MOVE SAVE-KEY   TO ACT-KEY
               GO TO MT-EXIT.

           MOVE M-JP-TITLE     TO OUT-TITLE.
           REWRITE OUT-REC     INVALID KEY
               MOVE SAVE-KEY   TO ACT-KEY
               GO TO MT-EXIT.

           MOVE SAVE-KEY       TO ACT-KEY.

       MT-EXIT.    EXIT.

       CHECK-FOR-WO-INQUIRY.
           MOVE 0              TO WOINQ-SW SUB.
           PERFORM CHECK-WOINQ-LOOP UNTIL SUB = 19.
           IF WOINQ-SW = 1
               MOVE 0          TO WOINQ-SW
               MOVE "VJPNAMEI" TO VIEW-NFNAME
               MOVE 66         TO HELP-SW.

       CHECK-WOINQ-LOOP.
           ADD 1               TO SUB.
           IF DSEL(SUB) = "W"
               IF DNAME(SUB) NOT = SPACES
                   MOVE 1      TO WOINQ-SW
                   MOVE DNAME(SUB) TO JP-KEY-NAME
                   MOVE SPACES TO MESSAGE-BUF
                   CALL "SPMJPWOI" USING VIEW-COMAREA
                                         DBPARAMETERS
                                         LANGUAGE-PARMS
                                         JP-KEY-NAME
                                         MESSAGE-BUF
                   IF MESSAGE-BUF NOT = SPACES
                       MOVE SPACE TO DSEL (SUB)
                       MOVE MESSAGE-BUF TO ERRMSG2
                       MOVE 2          TO FIELD-NUMBER
                       PERFORM SET-ERROR
                       MOVE 19 TO SUB
                   ELSE
                       MOVE SPACE  TO DSEL(SUB).
       SET-ERROR.
           MOVE B"1"           TO IND (FIELD-NUMBER)  IND (99).

       999-CATREAD.
           MOVE SPACES         TO CATREAD-MSG-TEXT.
           MOVE LANG-SETNUM    TO CATREAD-MSG-SET.
           MOVE LANG-MSGNUM    TO CATREAD-MSG-NUM.
           CALL "CCATREAD"     USING CATREAD-PARMS.
           IF CATREAD-MSG-NOT-FOUND
                MOVE "***ERROR MSG NOT FOUND***" TO CATREAD-MSG-TEXT.

       999-CATREAD-EXIT.    EXIT.

       SORTIN-INQ SECTION 02.
       SORTIN.
           PERFORM SORT-MAIN   THRU SORT-M-EXIT
           GO TO SORT-IP-EXIT.

       SORT-MAIN.
           MOVE KEYREC         TO RECKEY OF PM-JOBPLAN-KEYS.
           START PM-JOBPLAN-KEYS KEY = RECKEY OF PM-JOBPLAN-KEYS
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO SORT-M-EXIT.

       SORT-DBGET.
           MOVE SPACES         TO SORT-REC.
           READ PM-JOBPLAN-KEYS NEXT INTO PM-JOBP-KEY-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "10" OR "14" OR "46"
               GO TO SORT-M-EXIT
           ELSE
           IF FILE-STAT NOT = "00"
               MOVE "DBGET   " TO DB-TYPE
               MOVE FILE-STAT  TO CON-WORD
               MOVE DB-ERROR   TO ERRMSG
               MOVE 1          TO FIELD-NUMBER
               PERFORM SET-ERROR
               GO TO SORT-M-EXIT.

           IF RECORD-KEY NOT = KEYREC
               MOVE "10"       TO FILE-STAT
               GO TO SORT-M-EXIT.

           MOVE PMJPK-JOBP-KEY TO SORT-NAME.

           IF CRTR-BUF = SPACES OR PMJPK-ORIGINATOR
               NEXT SENTENCE
           ELSE
               GO TO SORT-DBGET.

           IF JP-NAME-BUF = SPACES
               NEXT SENTENCE
           ELSE
           IF JP0 = SN0 OR SPACES
             IF JP1 = SN1 OR SPACES
               IF JP2 = SN2 OR SPACES
                 IF JP3 = SN3 OR SPACES
                   IF JP4 = SN4 OR SPACES
                     IF JP5 = SN5 OR SPACES
                       IF JP6 = SN6 OR SPACES
                         IF JP7 = SN7 OR SPACES
                           IF JP8 = SN8 OR SPACES
                             IF JP9 = SN9 OR SPACES
                                 NEXT SENTENCE
                             ELSE
                                 GO TO SORT-DBGET
                           ELSE
                               GO TO SORT-DBGET
                         ELSE
                             GO TO SORT-DBGET
                       ELSE
                           GO TO SORT-DBGET
                     ELSE
                         GO TO SORT-DBGET
                   ELSE
                       GO TO SORT-DBGET
                 ELSE
                     GO TO SORT-DBGET
               ELSE
                   GO TO SORT-DBGET
             ELSE
                 GO TO SORT-DBGET
           ELSE
               GO TO SORT-DBGET.

           MOVE PMJPK-KEY-TITLE  TO SORT-TITLE.
           MOVE PMJPK-ORIGINATOR TO SORT-OWNER.
           MOVE PMJPK-DATE-STAMP TO SORT-DATE.

           RELEASE SORT-REC.
           GO TO SORT-DBGET.

       SORT-M-EXIT.    EXIT.

       SORT-IP-EXIT.    EXIT.

       SORTOUT-INQ SECTION 03.
       SORTOUT.
           RETURN SORT-FILE    AT END
               MOVE ACT-KEY    TO MAX-KEY
               GO TO SORT-WF-EXIT.
           ADD 1               TO ACT-KEY.
           MOVE SORT-REC       TO OUT-REC.
           WRITE OUT-REC       INVALID KEY
               DISPLAY "WRITE OUT-FILE ERR"
               GO TO SORT-WF-EXIT.
           GO TO SORTOUT-INQ.

       SORT-WF-EXIT.    EXIT.
