       IDENTIFICATION DIVISION.
       PROGRAM-ID.             SPMSINIT.
       AUTHOR.                 J. BUNGO.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
      *REMARKS.           **** SCREEN PROGRAM FOR INITIATING OR SIMULATING
      *                        PREVENTATIVE MAINTENANCE SCHEDULES.
      *                        ****.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        HP-3000.
       OBJECT-COMPUTER.        HP-3000.
       SPECIAL-NAMES.          I-O-FEEDBACK IS I-O-FEEDBACK-AREA.


       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZPMMAINT-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS SCREEN-STATUS
                  MAJOR-MINOR
                  CONTROL-AREA IS WS-CONTROL.
           SELECT PM-MSTR-SCHED
                  ASSIGN TO DATABASE-MCFLMM4301
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS FILE-STAT.
           SELECT WO-PLANNED
                  ASSIGN TO DATABASE-MCFLMM1101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STAT.
           SELECT EQP-EQUIPMENT
                  ASSIGN TO DATABASE-MCFLMM0201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STAT.
           SELECT PRINT-FILE
                  ASSIGN TO PRINTER-MCPRT.


       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).
       FD  PM-MSTR-SCHED
           LABEL RECORDS ARE STANDARD.
       01  PMS-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM4301.
       FD  WO-PLANNED
           LABEL RECORDS ARE STANDARD.
       01  PWO-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.
       FD  EQP-EQUIPMENT
           LABEL RECORDS ARE STANDARD.
       01  EQP-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0201.
       FD  PRINT-FILE RECORD CONTAINS 80 CHARACTERS
           LABEL RECORD IS OMITTED
           DATA RECORD IS PRINT-REC.
       01  PRINT-REC.
           05  PRINT-REC-1.
               10  REC-1-1            PIC X(10).
               10  REC-1-2            PIC X(10).
               10  REC-1-3            PIC X(38).
               10  REC-1-4            PIC X(22).
           05  PRINT-REC-2 REDEFINES PRINT-REC-1.
               10  REC-2-1            PIC X(30).
               10  REC-2-2            PIC X(50).
           05  PRINT-REC-3 REDEFINES PRINT-REC-1.
               10  REC-3-1            PIC X(46).
               10  REC-3-2            PIC X(06).
               10  REC-3-3            PIC X(28).


       WORKING-STORAGE SECTION.
       77  FIND-SW             PIC S9(4) VALUE 0      COMP.
       77  EQUIP-KEY           PIC X(06) VALUE SPACES.
       77  WO-KEY              PIC X(10) VALUE SPACES.
       77  SCHED-KEY           PIC X(10) VALUE SPACES.
       77  TRUE-VAL     VALUE B"1"  PIC 1.
       77  BASE                PIC X(16) VALUE "  MMISA;".
       77  HELP-SW             PIC 9(04).
       77  PRINT-HEAD          PIC X(01).

       01  SCREEN-DATA.
           05  INIT-EQUIP      PIC X(06).
           05  INIT-WONUM.
               10  INIT-WO     PIC X(07).
               10  INIT-WO-SUFF PIC X(03).
           05  INIT-SCHED      PIC X(10).
           05  INIT-DATE.
               10  ID-YYYY.
                   15  ID-CT   PIC XX.
                   15  ID-YY   PIC XX.
               10  ID-MM       PIC XX.
               10  ID-DD       PIC XX.
           05  CMDMSG          PIC X(79).
           05  ERRMSG          PIC X(79).

       01  SCREEN-STATUS       PIC X(2).

       COPY DISPDAT2           IN COPYLIB.

       01  SRF-INDICATORS.
           05  IND OCCURS 99 TIMES PIC 1 INDICATOR 01.

       01  FILE-STAT.
           05  FILE-STAT-1     PIC X(1).
           05  FILE-STAT-2     PIC X(1).

       01  CURRENTDATE.
           05  CD-CT           PIC 99.
           05  CD-YMD.
             10  CD-YY         PIC 99.
             10  CD-MM         PIC 99.
             10  CD-DD         PIC 99.
       01  CURRENTDATE2 REDEFINES CURRENTDATE.
           05  CD-YYYY         PIC 9(04).
           05  FILLER          PIC 9(04).

       01  CURR-DATE.
           05  CURR-DATE-YYYY.
               10  CURR-DATE-CT PIC 99.
               10  CURR-DATE-YY PIC 99.
           05  CURR-DATE-MM     PIC 99.
           05  CURR-DATE-DD     PIC 99.

       01  TODAYS-DATE.
           05  TD-YYYY.
               10  TD-CT        PIC 99.
               10  TD-YY        PIC 99.
           05  TD-MM            PIC 99.
           05  TD-DD            PIC 99.

       01  PRINT-DATE.
           05  P1  PIC X(26) VALUE "    **       AS OF DATE:  ".
           05  P2Y PIC X(04).
           05  FILLER PIC X(01) VALUE "/".
           05  P2M PIC X(02).
           05  FILLER PIC X(01) VALUE "/".
           05  P2D  PIC X(02).
           05  P1  PIC X(08) VALUE "      **".
       01  PRINT-INIT.
           05  FILLER   PIC X(14) VALUE "INITIATION OF ".
           05  PI-EQP   PIC X(6)  VALUE SPACES.
           05  FILLER   PIC X(2)  VALUE ", ".
           05  PI-WO    PIC X(10) VALUE SPACES.
           05  FILLER   PIC X(23) VALUE " WITH INITIATION DATE: ".
           05  PI-DATE.
               10  PI-Y PIC X(04) VALUE SPACES.
               10  FILLER PIC X(1) VALUE "/".
               10  PI-M PIC X(02)  VALUE SPACES.
               10  FILLER PIC X(1) VALUE "/".
               10  PI-D PIC X(02) VALUE SPACES.

       01  DB-ERROR.
           05  DB-TYPE         PIC X(08)  VALUE SPACES.
           05  DB-FILE         PIC X(18)  VALUE SPACES.
           05  FILLER          PIC X(30)
                               VALUE " SPMSINIT ERROR - COND-WORD = ".
           05  CON-WORD        PIC -9999.

       01  RETURN-COD.
           05  RET-CODE        PIC X.
           05  FILLER          PIC X.

       01  SEL-WO              PIC X(10).
       01  MESSAGE-BUF         PIC X(79).

           COPY CATREAD        IN COPYLIB.

           COPY IOFEEDBACK     IN COPYLIB.

           COPY OVRPFDATA      IN COPYLIB.

           COPY TBLOWUP        IN COPYLIB.

           COPY DBSTAT         IN COPYLIB.

       01  WO-PLANNED-DATA.    COPY DWOPLAN  IN COPYLIB.

       01  PM-MSCHED-DATA.     COPY DPMMSTSC IN COPYLIB.

       01  EQP-EQUIP-DATA.     COPY MEQPFILE IN COPYLIB.

       01  INIT-PARMS.
           05  PARM-EQUIP      PIC X(06).
           05  PARM-WONUM      PIC X(10).
           05  PARM-SCHED      PIC X(10).
           05  PARM-DATE       PIC X(8).

       LINKAGE SECTION.
       01  DBPARAMETERS.       COPY DBPARMS  IN COPYLIB.

           COPY VCOMLINK       IN COPYLIB.

           COPY LANGSUB        IN COPYLIB.

       01  INIT-SIM-FLAG       PIC X(01).
           88  INITIATOR                    VALUE "I".
           88  SIMULATOR                    VALUE "S".

       PROCEDURE DIVISION USING DBPARAMETERS
                                VIEW-COMAREA
                                LANGUAGE-PARMS
                                INIT-SIM-FLAG.
       BEGIN-PROC.
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          WO-PLANNED
                               EQP-EQUIPMENT
                               PM-MSTR-SCHED.
      *    MOVE 0              TO OVRPRTF-TOFILE-NUM.
           MOVE "P "           TO OVRPRTF-TOFILE-NUM-X.
           COPY OVRPFCALL      IN COPYLIB.
           OPEN OUTPUT         PRINT-FILE.

           ACCEPT CD-YMD FROM DATE.
           IF CD-YY > 60
               MOVE 19 TO CD-CT
           ELSE
               MOVE 20 TO CD-CT
           END-IF.

           MOVE ALL B"0"       TO SRF-INDICATORS.
           MOVE LOW-VALUES     TO STATUS-AREA.
           MOVE SPACES         TO SCREEN-DATA.
           MOVE ZEROS          TO INIT-WO-SUFF.
           MOVE CD-CT          TO ID-CT  TD-CT.
           MOVE CD-YY          TO ID-YY  TD-YY.
           MOVE CD-MM          TO ID-MM  TD-MM.
           MOVE CD-DD          TO ID-DD  TD-DD.
           MOVE "F"            TO PRINT-HEAD.

       INITIATE-LOOP.
           IF INITIATOR
               MOVE "VINITIATE"    TO VIEW-NFNAME
               MOVE 54 TO HELP-SW
           ELSE
               MOVE "VSIMULATE"    TO VIEW-NFNAME
               MOVE 43 TO HELP-SW.

       SHOWFORM.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC  FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.
           MOVE ALL B"0" TO SRF-INDICATORS.

           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.
           MOVE DISPLAY-REC TO SCREEN-DATA.

           IF VIEW-LASTKEY = 1
               MOVE SPACES TO MESSAGE-BUF
               MOVE SPACES TO SEL-WO
               CALL "SEQPWOIQ" USING VIEW-COMAREA DBPARAMETERS
                                     LANGUAGE-PARMS INIT-EQUIP
                                     SEL-WO MESSAGE-BUF
               IF MESSAGE-BUF NOT = SPACES
                   MOVE MESSAGE-BUF TO ERRMSG
                   MOVE B"1" TO IND (1)  IND (99)
                   GO TO SHOWFORM
               ELSE
                   MOVE SEL-WO TO INIT-WO
                   GO TO INITIATE-LOOP.

           IF VIEW-LASTKEY = 3 OR 8
               GO TO END-OF-JOB.

           IF VIEW-LASTKEY = 7
               CALL "SPMHELPM" USING HELP-SW
               GO TO INITIATE-LOOP.

           IF VIEW-LASTKEY NOT = 0
               GO TO SHOWFORM.

           IF ID-YYYY IS NUMERIC
               IF ID-MM > "00" AND ID-MM < "13"
                   IF ID-DD > "00" AND ID-DD < "32"
                       NEXT SENTENCE
                   ELSE
      **********************************************************************
      **    MESSAGE 035/030:
      ** INVALID DAY
      **********************************************************************
                       MOVE 35 TO LANG-SETNUM
                       MOVE 30 TO LANG-MSGNUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE TRUE-VAL TO IND (5)  IND (99)
                       GO TO SHOWFORM
               ELSE
      **********************************************************************
      **    MESSAGE 035/031:
      ** INVALID MONTH
      **********************************************************************
                   MOVE  35    TO LANG-SETNUM
                   MOVE  31    TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE TRUE-VAL TO IND (4)  IND (99)
                   GO TO SHOWFORM
           ELSE
      **********************************************************************
      **    MESSAGE 035/032:
      ** INVALID YEAR
      **********************************************************************
               MOVE  35        TO LANG-SETNUM
               MOVE  32        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE  TRUE-VAL TO IND (3)  IND (99)
               GO TO SHOWFORM.

           MOVE INIT-EQUIP     TO EQUIP-KEY PARM-EQUIP.
           MOVE INIT-DATE      TO CURR-DATE PARM-DATE.

           MOVE EQUIP-KEY TO EQPNUM OF EQP-EQUIPMENT.
           READ EQP-EQUIPMENT INTO EQP-EQUIP-DATA
               INVALID KEY MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      **********************************************************************
      **    MESSAGE 031/010:
      ** EQUIPMENT NUMBER DOES NOT EXIST
      **********************************************************************
               MOVE  31        TO LANG-SETNUM
               MOVE  10        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE  TRUE-VAL TO IND (1)  IND (99)
               GO TO SHOWFORM.

           CALL "TALWONO" USING INIT-WONUM RETURN-COD.
           IF RET-CODE = "1"
      *M********************************************************************
      *M    MESSAGE 035/040:
      *M INVALID WORKORDER NUMBER
      *M********************************************************************
               MOVE  35        TO LANG-SETNUM
               MOVE  40        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE  TRUE-VAL TO IND (2)  IND (99)
               GO TO SHOWFORM
           END-IF.

           MOVE INIT-WONUM     TO WO-KEY  PARM-WONUM.
           MOVE WO-KEY TO WONUM OF WO-PLANNED.
           READ WO-PLANNED INTO WO-PLANNED-DATA
               INVALID KEY MOVE FILE-STAT TO FILE-STAT
           END-READ.
           IF FILE-STAT NOT = "00"
      **********************************************************************
      **    MESSAGE 049/056:
      ** WORKORDER NUMBER DOES NOT EXIST
      **********************************************************************
               MOVE  49        TO LANG-SETNUM
               MOVE  56        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE  TRUE-VAL TO IND (2)  IND (99)
               GO TO SHOWFORM
           END-IF.

           IF WO-START-STATUS NOT = "AA"
      **********************************************************************
      **    MESSAGE 049/053:
      ** WORKORDER IS NOT A PM WORKORDER
      **********************************************************************
               MOVE  49        TO LANG-SETNUM
               MOVE  53        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE  TRUE-VAL TO IND (2)  IND (99)
               GO TO SHOWFORM
           END-IF.

           IF INITIATOR
               IF APPROVAL-CODE-P NOT = "A "
      **********************************************************************
      **    MESSAGE 039/050:
      ** MASTER PM WORKORDER IS NOT APPROVED, CANNOT INITIATE PM SCHEDULE
      **********************************************************************
                   MOVE  39        TO LANG-SETNUM
                   MOVE  50        TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE  TRUE-VAL TO IND (2)  IND (99)
                   GO TO SHOWFORM
               END-IF
           END-IF.

           IF EQUIP-NUM-P NOT = INIT-EQUIP
      **********************************************************************
      **    MESSAGE 031/036:
      ** EQUIPMENT NUMBER ON WORKORDER DOES NOT MATCH EQUIPMENT ENTERED
      **********************************************************************
               MOVE  31        TO LANG-SETNUM
               MOVE  36        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE  TRUE-VAL TO IND (1)  IND (99)
               GO TO SHOWFORM
           END-IF.

           MOVE PM-SCHEDULE-KEY TO SCHED-KEY.

           IF SIMULATOR AND INIT-SCHED NOT = SPACES
               MOVE INIT-SCHED TO SCHED-KEY.

           MOVE SCHED-KEY TO PMSCHEDKEY OF PM-MSTR-SCHED.
           MOVE "01" TO PMLEVEL OF PM-MSTR-SCHED.
           READ PM-MSTR-SCHED INTO PM-MSCHED-DATA
               INVALID KEY MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      **********************************************************************
      **    MESSAGE 039/055:
      ** MASTER SCHEDULE DOES NOT EXIST FOR MASTER WORKORDER
      **********************************************************************
               MOVE  39        TO LANG-SETNUM
               MOVE  55        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE  TRUE-VAL TO IND (2)  IND (99)
               GO TO SHOWFORM.

           MOVE SCHED-KEY TO PARM-SCHED.

           IF PRINT-HEAD = "F"
             MOVE "    ****************************************"
                                 TO PRINT-REC
             WRITE PRINT-REC AFTER ADVANCING 2
             MOVE "    **                                    **"
                                 TO PRINT-REC
             WRITE PRINT-REC
             MOVE "    **   THE PM LEVEL INITIATION MODULE   **"
                                 TO PRINT-REC
             WRITE PRINT-REC
             MOVE "    **                                    **"
                                 TO PRINT-REC
             WRITE PRINT-REC
             MOVE CD-YYYY        TO P2Y
             MOVE CD-MM          TO P2M
             MOVE CD-DD          TO P2D
             MOVE PRINT-DATE     TO PRINT-REC
             WRITE PRINT-REC
             MOVE "    **                                    **"
                               TO PRINT-REC
             WRITE PRINT-REC
             MOVE "    ****************************************"
                                 TO PRINT-REC
             WRITE PRINT-REC
             MOVE "T" TO PRINT-HEAD
           END-IF.
           MOVE SPACES TO PRINT-REC.
           WRITE PRINT-REC.
           MOVE INIT-WONUM TO PI-WO.
           MOVE INIT-EQUIP TO PI-EQP.
           MOVE ID-YYYY TO PI-Y.
           MOVE ID-MM TO PI-M.
           MOVE ID-DD TO PI-D.
           MOVE PRINT-INIT TO PRINT-REC.
           WRITE PRINT-REC.


       INITIATE-SCHEDULE.
           CALL "SPMINITL" USING DBPARAMETERS
                                 VIEW-COMAREA
                                 LANGUAGE-PARMS
                                 INIT-SIM-FLAG
                                 INIT-PARMS.
           IF INITIATOR
      **********************************************************************
      **    MESSAGE 042/145:
      ** PM SCHEDULE HAS BEEN INITIATED FOR EQUIPMENT
      **********************************************************************
               MOVE  42        TO LANG-SETNUM
               MOVE  145       TO LANG-MSGNUM
           ELSE
      **********************************************************************
      **    MESSAGE 042/148:
      ** PM SCHEDULE HAS BEEN SIMULATED FOR EQUIPMENT
      **********************************************************************
               MOVE  42        TO LANG-SETNUM
               MOVE  148       TO LANG-MSGNUM
           END-IF.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE  TRUE-VAL TO IND (1)  IND (99).
           GO TO SHOWFORM.

       999-CATREAD.
           MOVE SPACES TO CATREAD-MSG-TEXT.
           MOVE LANG-SETNUM TO CATREAD-MSG-SET.
           MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           IF CATREAD-MSG-NOT-FOUND
               MOVE "*ERROR ON THIS FIELD*" TO CATREAD-MSG-TEXT.
           MOVE CATREAD-MSG-TEXT TO ERRMSG.

       999-CATREAD-EXIT.    EXIT.

       999-BLOWUP.
            MOVE "SPMSINIT" TO BU-PGM-NAME.
            MOVE VIEW-NFNAME TO BU-DISPLAY-FLD (1).
            CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
                                 VIEW-COMAREA, FILE-STAT,
                                 BU-DISPLAY-MSG, BU-DISPLAY-FLDS.

       END-OF-JOB.
            CLOSE DISPLAY-FILE
                  PM-MSTR-SCHED
                  EQP-EQUIPMENT
                  WO-PLANNED
                  PRINT-FILE.
            GOBACK.
