       IDENTIFICATION DIVISION.
       PROGRAM-ID.             SPMSKWOI.
       AUTHOR.                 J.S. BUNGO.
       INSTALLATION.  GOODYEAR TIRE & RUBBER CO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        HP-3000.
       OBJECT-COMPUTER.        HP-3000.
       SPECIAL-NAMES.          I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZPMMAINT-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

           SELECT WO-PLANNED
                  ASSIGN TO DATABASE-MCFLMM1107
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS FILE-STAT.

           SELECT OUT-FILE
                  ASSIGN TO DISK-PMSKWOI
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE IS DYNAMIC
                  RELATIVE KEY IS ACT-KEY
                  FILE STATUS IS FILE-STAT.

           SELECT SORT-FILE
                  ASSIGN TO DISK-SORTFILE.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       FD  WO-PLANNED
           LABEL RECORDS ARE STANDARD.
       01  WO-PLANNED-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1107.

       FD  OUT-FILE RECORD CONTAINS 56 CHARACTERS
           LABEL RECORDS ARE OMITTED
           DATA RECORD IS OUT-REC.
       01  OUT-REC.
           05  OUT-WO-NUM.
               10  OUT-WO      PIC X(07).
               10  OUT-WO-SUF  PIC X(03).
           05  OUT-EQUIP       PIC X(06).
           05  OUT-DESCRIPT    PIC X(30).
           05  OUT-JOBP        PIC X(10).

       SD  SORT-FILE RECORD CONTAINS 56 CHARACTERS
           DATA RECORD IS SORT-REC.
       01  SORT-REC.
           05  SORT-WO         PIC X(10).
           05  SORT-EQUIP      PIC X(06).
           05  SORT-DESCRIPT   PIC X(30).
           05  SORT-JOBP       PIC X(10).

       WORKING-STORAGE SECTION.
       77  SUB                       PIC 9(04) VALUE 0  COMP.
       77  SUFFIX-SW                 PIC 9(04) VALUE 0  COMP.
       77  EOF-SW                    PIC S9(4) VALUE 0  COMP.
       77  HELP-SW                   PIC 9(04) VALUE 0.
       77  ACT-KEY                   PIC 9999  VALUE 0.
       77  MAX-KEY                   PIC 9999  VALUE 0.
       77  SKIP-SUF                  PIC 9999  VALUE 0.
       77  SAVE-KEY                  PIC 9999  VALUE 0.
       77  PAGE-NO                   PIC 9999  VALUE 0.
       77  LAST-SORT-WO              PIC X(10) VALUE SPACES.

       01  PAGE-TABLE.
           05  PAGE-KEYS OCCURS 100 TIMES.
               10  PAGE-KEY          PIC 9999 VALUE 0.

       01  DISPLAY-STATUS            PIC X(02).
       01  SRF-INDICATORS.
           05  IND OCCURS 99 TIMES   PIC 1 INDICATOR 01.
       01  WS-CONTROL.
           05  FUNCTION-NUM          PIC X(02).
           05  TERMINAL-ID           PIC X(10).
           05  FORMAT-NAME           PIC X(10).

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "SPMJPWOI".
           05  PROGRAM-TYPE        PIC X(02) VALUE "IN".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " J0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A     PIC X(60) VALUE
           "DISPLAYS A LIST OF WORKORDERS LINKED TO A JOBPLAN         ".
               10  PROG-DESC-B     PIC X(60) VALUE SPACES.
               10  PROG-FUNCTION   PIC X(60) VALUE
           "RUNS FROM THE f6 KEY OF THE REPORTS AND INQUIRIES MENU.   ".
           05  PASSWORD-FLAG       PIC X.

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       01  SCREEN-BUFFER.
           05  SK-NAME-BUF     PIC X(10).
           05  SCREEN-LINE     OCCURS 20 TIMES.
               10  WO-BUF      PIC X(10).
               10  EQUIP-BUF   PIC X(06).
               10  DESCRIPT-BUF PIC X(30).
               10  JOBP-BUF   PIC X(10).
           05  CMDMSG          PIC X(79).
           05  ERRMSG          PIC X(79).

       01  DB-ERROR.
           05  DB-TYPE   PIC X(08) VALUE SPACES.
           05  FILLER    PIC X(21) VALUE " ERROR - FILE-STAT = ".
           05  CON-WORD  PIC XX.

       01  SCREEN-PRINT-PARMS.
           05  PRINTCNTL              PIC S9(4)  VALUE ZERO  COMP.
           05  PAGECNTL               PIC S9(4)  VALUE 49    COMP.
           05  SPOOLFIL-OPEN-SW       PIC X      VALUE "N".
       01  PASSED-SPOOL-PRT           PIC S9(2)              COMP.
       01  FATAL-ERR-SW               PIC X.
       01  BU-DISPLAY-AREA.
           05  FILLER                 PIC XX.
           05  BU-DISPLAY-MSG         PIC X(27).
           05  FILLER                 PIC XX.
           05  BU-DISPLAY-STAT        PIC S9(4).
           05  FILLER                 PIC XX.
           05  BU-DISPLAY-FLD         PIC X(14).
           05  FILLER                 PIC XX.

       COPY CATREAD            IN COPYLIB.

       COPY IOFEEDBACK         IN COPYLIB.

       01  MESSAGE-FILE-DATA.  COPY ERRORLIN IN COPYLIB.

       01  WO-PLANNED-DATA.    COPY DWOPLAN  IN COPYLIB.

       LINKAGE SECTION.
           COPY VCOMLINK       IN COPYLIB.

       01  DBPARAMETERS.       COPY DBPARMS  IN COPYLIB.

           COPY LANGSUB        IN COPYLIB.

       01  SK-NAME-KEY         PIC X(10).
       01  MESSAGE-BUF         PIC X(79).

       PROCEDURE DIVISION USING VIEW-COMAREA
                                DBPARAMETERS
                                LANGUAGE-PARMS
                                SK-NAME-KEY
                                MESSAGE-BUF.
       BEGIN-SORT SECTION 01.
       BEGIN-PROC.
           PERFORM HSK THRU HSK-EXIT.
           GO TO MAIN.

       HSK.
           CALL "CLSKWOI".

           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          WO-PLANNED.

           MOVE SPACES         TO SCREEN-BUFFER MESSAGE-BUFFER.
           MOVE ALL B"0"       TO SRF-INDICATORS.
       HSK-EXIT.
           EXIT.

       END-OF-JOB.
           CLOSE               WO-PLANNED.
           CLOSE               DISPLAY-FILE.
           GOBACK.

       MAIN.
           OPEN OUTPUT         OUT-FILE.
           MOVE 0              TO ACT-KEY.
           SORT SORT-FILE ASCENDING KEY SORT-WO
               INPUT  PROCEDURE SORTIN-INQ
               OUTPUT PROCEDURE SORTOUT-INQ.
           CLOSE               OUT-FILE.

           IF ACT-KEY = 0
      **********************************************************************
      **    MESSAGE 040/011:
      ** NO RECORDS FOUND WHICH MATCH YOUR SELECTION
      **********************************************************************
               MOVE  40        TO LANG-SETNUM
               MOVE  11        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE CATREAD-MSG-TEXT TO MESSAGE-BUF
               GO TO END-OF-JOB.

           OPEN I-O            OUT-FILE.
           MOVE 0              TO SUFFIX-SW.
           MOVE 0              TO ACT-KEY.
           MOVE 1              TO PAGE-NO.
           MOVE ACT-KEY        TO PAGE-KEY (PAGE-NO).
           MOVE "VSKWOI"       TO VIEW-NFNAME.

       RESET-SCREEN.
           MOVE 681            TO HELP-SW.
           MOVE SPACES         TO SCREEN-BUFFER MESSAGE-BUFFER.
           PERFORM FILL-SCREEN THRU FS-EXIT.
           MOVE ALL B"0"       TO SRF-INDICATORS.

       SHOWFORM.
           MOVE SCREEN-BUFFER  TO DISPLAY-REC.
           WRITE DISPLAY-REC   FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               CLOSE           OUT-FILE
               GO TO END-OF-JOB.
           MOVE ALL B"0"       TO SRF-INDICATORS.

           READ DISPLAY-FILE   FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK   FROM I-O-FEEDBACK-AREA.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3          TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.

           IF VIEW-LASTKEY = 3 OR 8
               CLOSE           OUT-FILE
               GO TO END-OF-JOB.

           IF VIEW-LASTKEY = 1
               CLOSE           OUT-FILE
               OPEN I-O        OUT-FILE
               MOVE 1 TO SUFFIX-SW
               MOVE 0 TO ACT-KEY
               GO TO RESET-SCREEN.

           IF VIEW-LASTKEY = 2
               IF PAGE-NO = 1
                   GO TO SHOWFORM
               ELSE
                   SUBTRACT 1 FROM PAGE-NO
                   MOVE PAGE-KEY (PAGE-NO) TO ACT-KEY
                   MOVE 0 TO EOF-SW
                   GO TO RESET-SCREEN.

           IF VIEW-LASTKEY = 4
               IF EOF-SW = 1
                   GO TO SHOWFORM
               ELSE
                   ADD 1 TO PAGE-NO
                   MOVE ACT-KEY TO PAGE-KEY (PAGE-NO)
                   GO TO RESET-SCREEN.

           IF VIEW-LASTKEY = 6
               MOVE 0 TO SUFFIX-SW
               MOVE 0 TO ACT-KEY
               CLOSE OUT-FILE
               OPEN I-O OUT-FILE
               GO TO RESET-SCREEN.

           IF VIEW-LASTKEY = 7
               CALL "SPMHELPM" USING HELP-SW
               GO TO SHOWFORM.

           GO TO SHOWFORM.


       FILL-SCREEN.
           MOVE SK-NAME-KEY    TO SK-NAME-BUF.
           MOVE 0              TO SUB.
           PERFORM FILL-LINE   THRU FL-EXIT UNTIL SUB = 20.
           MOVE ACT-KEY        TO SAVE-KEY.

       FS-EXIT.    EXIT.

       FILL-LINE.
           ADD 1               TO ACT-KEY SUB.

           MOVE SPACES         TO OUT-REC.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               MOVE 20         TO SUB
               GO TO FL-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               MOVE 20         TO SUB
               SUBTRACT 1 FROM ACT-KEY
               GO TO FL-EXIT.
           IF SUFFIX-SW = 0
               IF OUT-WO-SUF NOT = "000"
                   SUBTRACT 1 FROM SUB
                   GO TO FL-EXIT.

           MOVE OUT-WO-NUM     TO WO-BUF (SUB).
           MOVE OUT-EQUIP      TO EQUIP-BUF (SUB).
           MOVE OUT-DESCRIPT   TO DESCRIPT-BUF (SUB).
           MOVE OUT-JOBP       TO JOBP-BUF (SUB).

       FL-EXIT.    EXIT.

       SET-ERROR.
           MOVE B"1"           TO IND (FIELD-NUMBER)  IND (99).

       999-CATREAD.
           MOVE SPACES         TO CATREAD-MSG-TEXT.
           MOVE LANG-SETNUM    TO CATREAD-MSG-SET.
           MOVE LANG-MSGNUM    TO CATREAD-MSG-NUM.
           CALL "CCATREAD"     USING CATREAD-PARMS.
           IF CATREAD-MSG-NOT-FOUND
                MOVE "***ERROR MSG NOT FOUND***" TO CATREAD-MSG-TEXT.

       999-CATREAD-EXIT.    EXIT.

       SORTIN-INQ SECTION 02.
       SORTIN.
           PERFORM SORT-MAIN   THRU SORT-M-EXIT
           GO TO SORT-IP-EXIT.

       SORT-MAIN.
           MOVE SK-NAME-KEY    TO PMSCHEDKEY OF WO-PLANNED.
           START WO-PLANNED KEY = PMSCHEDKEY OF WO-PLANNED
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO SORT-M-EXIT.

       SORT-DBGET.
           MOVE SPACES         TO SORT-REC.
           READ WO-PLANNED NEXT INTO WO-PLANNED-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "10" OR "14" OR "46"
               GO TO SORT-M-EXIT
           ELSE
           IF FILE-STAT NOT = "00"
               MOVE "DBGET   " TO DB-TYPE
               MOVE FILE-STAT  TO CON-WORD
               MOVE DB-ERROR   TO ERRMSG
               MOVE 1          TO FIELD-NUMBER
               PERFORM SET-ERROR
               GO TO SORT-M-EXIT.

           IF PM-SCHEDULE-KEY NOT = SK-NAME-KEY
               MOVE "10"       TO FILE-STAT
               GO TO SORT-M-EXIT.

           IF WO-NUM-SUFF-P NOT = "000"
               IF WO-STATUS-P = "CW" OR "DW" OR "FF"
                   GO TO SORT-DBGET.

           MOVE WO-NUM-PLANNED TO SORT-WO.
           MOVE EQUIP-NUM-P TO SORT-EQUIP.
           MOVE DESCRIPTION-1-P TO SORT-DESCRIPT.
           MOVE PM-JOBPLAN-KEY TO SORT-JOBP.

           RELEASE SORT-REC.
           GO TO SORT-DBGET.

       SORT-M-EXIT.    EXIT.

       SORT-IP-EXIT.    EXIT.

       SORTOUT-INQ SECTION 03.
       SORTOUT.
           RETURN SORT-FILE    AT END
               MOVE ACT-KEY    TO MAX-KEY
               GO TO SORT-WF-EXIT.
           IF SORT-WO = LAST-SORT-WO
               GO TO SORTOUT-INQ.
           MOVE SORT-WO TO LAST-SORT-WO.
           ADD 1               TO ACT-KEY.
           MOVE SORT-REC       TO OUT-REC.
           WRITE OUT-REC       INVALID KEY
               DISPLAY "WRITE OUT-FILE ERR"
               GO TO SORT-WF-EXIT.
           GO TO SORTOUT-INQ.

       SORT-WF-EXIT.    EXIT.
