       IDENTIFICATION DIVISION.
       PROGRAM-ID.             SPMSMREL.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
      *REMARKS.           **** PREVENTIVE MAINTENANCE WORKORDER
      *                        MANUAL RELEASE PROGRAM
      *                        ****.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       SPECIAL-NAMES.          I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZPMMAINT-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS WS-CONTROL.

           SELECT PM-MASTER-SCHED
                  ASSIGN       TO DATABASE-MCFLMM4301
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-PLANNED
                  ASSIGN       TO DATABASE-MCFLMM1101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT EQP-EQUIPMENT
                  ASSIGN       TO DATABASE-MCFLMM0201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT PRINT-FILE
                  ASSIGN       TO PRINTER-MCPRT.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       FD  PM-MASTER-SCHED
           LABEL RECORDS ARE STANDARD.
       01  PMS-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM4301.

       FD  WO-PLANNED
           LABEL RECORDS ARE STANDARD.
       01  PWO-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.

       FD  EQP-EQUIPMENT
           LABEL RECORDS ARE STANDARD.
       01  EQP-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0201.

       FD  PRINT-FILE RECORD CONTAINS 80 CHARACTERS
           LABEL RECORD IS OMITTED
           DATA RECORD IS PRINT-REC.
       01  PRINT-REC.
           05  PRINT-REC-1.
               10  REC-1-1            PIC X(10).
               10  REC-1-2            PIC X(10).
               10  REC-1-3            PIC X(38).
               10  REC-1-4            PIC X(22).
           05  PRINT-REC-2 REDEFINES PRINT-REC-1.
               10  REC-2-1            PIC X(30).
               10  REC-2-2            PIC X(50).
           05  PRINT-REC-3 REDEFINES PRINT-REC-1.
               10  REC-3-1            PIC X(46).
               10  REC-3-2            PIC X(06).
               10  REC-3-3            PIC X(28).

       WORKING-STORAGE SECTION.
       77  FIND-SW          PIC S9(4)   VALUE 0      COMP.
       77  USER-CODE        PIC X(08)   VALUE SPACES.
       77  EQUIP-KEY        PIC X(06)   VALUE SPACES.
       77  WO-KEY           PIC X(10)   VALUE SPACES.
       77  LEVEL-KEY        PIC 99      VALUE 0.
       77  SCHED-KEY        PIC X(10)   VALUE SPACES.
       77  TRUE-VAL   VALUE B"1"      PIC 1.
       77  BASE             PIC X(24)   VALUE SPACES.
       77  HELP-SW          PIC 9(04).
       77  PRINT-HEAD       PIC X(01).

       01  RETURN-COD.
           05  RET-CODE     PIC X(1).
           05  FILLER       PIC X(1).

       01  SCREEN-DATA.
           05  INIT-EQUIP      PIC X(06).
           05  INIT-WO.
               10  INIT-WO-NUM  PIC X(07).
               10  INIT-WO-SUF  PIC X(03).
           05  INIT-LEVEL.
               10  INIT-LEVEL-1 PIC X(01).
               10  INIT-LEVEL-2 PIC X(01).
           05  CMDMSG           PIC X(79).
           05  ERRMSG           PIC X(79).

       01  SCREEN-STATUS        PIC X(2).

       COPY DISPDAT2           IN COPYLIB.

       01  DISPLAY-STATUS       PIC X(2).

       01  SRF-INDICATORS.
           05  IND OCCURS 99 TIMES PIC 1 INDICATOR 01.

       01  FILE-STAT.
           05  FILE-STAT-1      PIC X.
           05  FILE-STAT-2      PIC X.

       01  CURR-DATE.
           05  CD-MM                    PIC 99.
           05  FILLER                   PIC X.
           05  CD-DD                    PIC 99.
           05  FILLER                   PIC X.
           05  CD-YY                    PIC 99.

       01  TODAYS-DATE.
           05  TD-YYYY.
               10  TD-CT                PIC 99.
               10  TD-YY                PIC 99.
           05  TD-MM                    PIC 99.
           05  TD-DD                    PIC 99.

       01  DATE-HOLD.
           05  DH-YY                    PIC 99.
           05  DH-MM                    PIC 99.
           05  DH-DD                    PIC 99.

       01  CRAFT-TABLE.
           05 C-R-ENTRY OCCURS 200 TIMES INDEXED BY CRAFT-INDEX.
              10 CRAFT                 PIC X(2).
              10 RATE                  PIC 999999V99.

       01  RELEASE-MESSAGE.
           05  FILLER                  PIC X(11) VALUE SPACES.
           05  RELEASE-MSG-WO          PIC X(10) VALUE SPACES.
           05  FILLER                  PIC X(58) VALUE SPACES.

       01  PRINT-DATE.
           05  P1  PIC X(26) VALUE "    **       AS OF DATE:  ".
           05  P2  PIC X(10).
           05  P3  PIC X(08) VALUE "      **".

       01  PRINT-DATA.
           05  PRINT-1                 PIC X(80).
           05  PRINT-2                 PIC X(80).
           05  PRINT-3                 PIC X(80).
           05  PRINT-4                 PIC X(80).
           05  PRINT-5                 PIC X(80).
           05  PRINT-6                 PIC X(80).
           05  PRINT-7                 PIC X(80).
           05  PRINT-8                 PIC X(80).
           05  PRINT-9                 PIC X(80).
           05  PRINT-0                 PIC X(80).
           05  PRINT-ERR               PIC X(02).

       01  SEL-WO        PIC X(10).
       01  MESSAGE-BUF   PIC X(79).

       01  DB-ERROR.
           05  DB-TYPE   PIC X(08) VALUE SPACES.
           05  DB-FILE   PIC X(18) VALUE SPACES.
           05  FILLER    PIC X(30)
                         VALUE " SPMSMREL ERROR - COND-WORD = ".
           05  CON-WORD  PIC -9999.

           COPY CATREAD        IN COPYLIB.

           COPY IOFEEDBACK     IN COPYLIB.

           COPY OVRPFDATA      IN COPYLIB.

           COPY TBLOWUP        IN COPYLIB.

           COPY DBSTAT         IN COPYLIB.

       01  WO-PLANNED-DATA.    COPY DWOPLAN  IN COPYLIB.

       01  PM-MSCHED-DATA.     COPY DPMMSTSC IN COPYLIB.

       01  PM-SCHED-DATA.      COPY DPMSCHED IN COPYLIB.

       01  EQP-EQUIP-DATA.     COPY MEQPFILE IN COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.       COPY DBPARMS  IN COPYLIB.

           COPY VCOMLINK       IN COPYLIB.

           COPY LANGSUB        IN COPYLIB.

       PROCEDURE DIVISION      USING DBPARAMETERS
                               VIEW-COMAREA
                               LANGUAGE-PARMS.
       BEGIN-PROC.
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          PM-MASTER-SCHED
                               EQP-EQUIPMENT
                               WO-PLANNED.
      *    MOVE 0              TO OVRPRTF-TOFILE-NUM.
           MOVE "P "           TO OVRPRTF-TOFILE-NUM-X.
           COPY OVRPFCALL      IN COPYLIB.
           OPEN OUTPUT         PRINT-FILE.
           MOVE LOW-VALUES     TO STATUS-AREA.

           ACCEPT DATE-HOLD    FROM DATE.
           MOVE DH-YY          TO CD-YY.
           MOVE DH-MM          TO CD-MM.
           MOVE DH-DD          TO CD-DD.

           IF CD-YY > 60
               MOVE 19         TO TD-CT
           ELSE
               MOVE 20         TO TD-CT.

           MOVE CD-YY          TO DH-YY TD-YY.
           MOVE CD-MM          TO DH-MM TD-MM.
           MOVE CD-DD          TO DH-DD TD-DD.
           MOVE "F"            TO PRINT-HEAD.

       INITIATE-WORKORDER.
           MOVE "VMRELEASE"    TO VIEW-NFNAME.
           MOVE 55             TO HELP-SW.
           MOVE ALL B"0"       TO SRF-INDICATORS.
           MOVE SPACES         TO SCREEN-DATA.
           MOVE ZEROS          TO INIT-WO-SUF.

       SHOWFORM.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK   FROM I-O-FEEDBACK-AREA.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SRF-INDICATORS.

           IF VIEW-LASTKEY = 1
               MOVE SPACES     TO MESSAGE-BUF
               MOVE SPACES     TO SEL-WO
               CALL "SEQPWOIQ" USING VIEW-COMAREA DBPARAMETERS
                               LANGUAGE-PARMS INIT-EQUIP
                               SEL-WO MESSAGE-BUF
               IF MESSAGE-BUF NOT = SPACES
                   MOVE MESSAGE-BUF TO ERRMSG
                   MOVE B"1"   TO IND (1)  IND (99)
                   GO TO SHOWFORM
               ELSE
                   MOVE SEL-WO TO INIT-WO
                   MOVE ZEROS  TO INIT-WO-SUF
                   MOVE "VMRELEASE" TO VIEW-NFNAME
                   GO TO SHOWFORM.

           IF VIEW-LASTKEY = 3 OR 8
               GO TO END-OF-JOB.

           IF VIEW-LASTKEY = 7
               CALL "SPMHELPM" USING HELP-SW
               GO TO SHOWFORM.

           IF VIEW-LASTKEY NOT = 0
               GO TO SHOWFORM.

           MOVE SPACES         TO CRAFT-TABLE.
           CALL "TSETCRFT"     USING DBPARAMETERS CRAFT-TABLE.
           IF CRAFT-TABLE = SPACES
               MOVE    "FAILURE TO LOAD CRAFT/RATE TABLE" TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 2
               GO TO END-OF-JOB.

           IF INIT-EQUIP = SPACES
      **********************************************************************
      **   MESSAGE 031/016:
      **  EQUIPMENT NUMBER IS REQUIRED
      **********************************************************************
               MOVE 31         TO LANG-SETNUM
               MOVE 16         TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL   TO IND (1)  IND (99)
               GO TO SHOWFORM.

           MOVE INIT-EQUIP     TO EQUIP-KEY
                                  EQPNUM OF EQP-EQUIPMENT.
           READ EQP-EQUIPMENT  INTO EQP-EQUIP-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
             IF FILE-STAT-1 = "2"
      **********************************************************************
      **   MESSAGE 031/010:
      **  EQUIPMENT NUMBER DOES NOT EXIST
      **********************************************************************
               MOVE 31         TO LANG-SETNUM
               MOVE 10         TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL   TO IND (1)  IND (99)
               GO TO SHOWFORM
             ELSE
               MOVE FILE-STAT  TO CON-WORD
               MOVE "READ EQP-EQUIPMENT ERROR" TO BU-DISPLAY-MSG
               MOVE EQUIP-KEY  TO BU-DISPLAY-FLD (2)
               PERFORM 999-BLOWUP.

           IF INIT-LEVEL = "  "
      **********************************************************************
      **   MESSAGE 038/013:
      **  LEVEL NUMBER IS REQUIRED
      **********************************************************************
               MOVE 38         TO LANG-SETNUM
               MOVE 13         TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL   TO IND (2)  IND (99)
               GO TO SHOWFORM.

           IF INIT-LEVEL-2 = " "
               MOVE INIT-LEVEL-1 TO INIT-LEVEL-2
               MOVE "0"        TO INIT-LEVEL-1.

           IF INIT-LEVEL-1 = " "
               MOVE "0"        TO INIT-LEVEL-1.

           IF INIT-LEVEL = "00"
      **********************************************************************
      **   MESSAGE 038/019:
      **  LEVEL NUMBER MAY NOT BE 00
      **********************************************************************
               MOVE 38         TO LANG-SETNUM
               MOVE 19         TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL   TO IND (2)  IND (99)
               GO TO SHOWFORM.

           IF INIT-LEVEL IS NOT NUMERIC
      **********************************************************************
      **   MESSAGE 038/014:
      **  LEVEL NUMBER MUST BE NUMERIC
      **********************************************************************
               MOVE 38         TO LANG-SETNUM
               MOVE 14         TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL   TO IND (2)  IND (99)
               GO TO SHOWFORM.

           MOVE INIT-LEVEL     TO LEVEL-KEY.

       EDIT-APPR-CODE-SUFFIX.
           CALL "TALWONO"      USING INIT-WO RETURN-COD.
           IF RET-CODE = "1"
      **********************************************************************
      **   MESSAGE 035/040:
      **  INVALID WORKORDER NUMBER
      **********************************************************************
               MOVE 35         TO LANG-SETNUM
               MOVE 40         TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL   TO IND (3)  IND (99)
               GO TO SHOWFORM.

           MOVE INIT-WO        TO WO-KEY
                                  WONUM OF WO-PLANNED.
           READ WO-PLANNED     INTO WO-PLANNED-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      **********************************************************************
      **   MESSAGE 049/056:
      **  WORKORDER DOES NOT EXIST
      **********************************************************************
               MOVE 49         TO LANG-SETNUM
               MOVE 56         TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL   TO IND (3)  IND (99)
               GO TO SHOWFORM.

           IF APPROVAL-CODE-P NOT = "A "
      **********************************************************************
      **    MESSAGE 039/049:
      **  MASTER PM WORKORDER NOT APPROVED, CANNOT CREATE A SUFFIX
      **********************************************************************
               MOVE 39         TO LANG-SETNUM
               MOVE 49         TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL   TO IND (3)  IND (99)
               GO TO SHOWFORM.

           IF WO-STATUS-P NOT = "OO"
      **********************************************************************
      **    MESSAGE 039/052:
      **  MASTER PM WORKORDER IS CLOSED, CANNOT CREATE A SUFFIX
      **********************************************************************
               MOVE 39         TO LANG-SETNUM
               MOVE 52         TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL   TO IND (3)  IND (99)
               GO TO SHOWFORM.

           MOVE PM-SCHEDULE-KEY TO SCHED-KEY
                                   PMSCHEDKEY OF PM-MASTER-SCHED.
           START PM-MASTER-SCHED KEY = PMSCHEDKEY OF PM-MASTER-SCHED
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      **********************************************************************
      **    MESSAGE 039/055:
      **  MASTER SCHEDULE DOES NOT EXIST FOR MASTER WORKORDER
      **********************************************************************
               MOVE 39         TO LANG-SETNUM
               MOVE 55         TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL   TO IND (3)  IND (99)
               GO TO SHOWFORM.

           IF PRINT-HEAD = "F"
             MOVE "    ****************************************"
                               TO PRINT-REC
             WRITE PRINT-REC AFTER ADVANCING 2
             MOVE "    **                                    **"
                               TO PRINT-REC
             WRITE PRINT-REC
             MOVE "    **   CREATE MANUAL WORKORDER MODULE   **"
                               TO PRINT-REC
             WRITE PRINT-REC
             MOVE "    **                                    **"
                               TO PRINT-REC
             WRITE PRINT-REC
             MOVE TODAYS-DATE  TO P2
             MOVE PRINT-DATE   TO PRINT-REC
             WRITE PRINT-REC
             MOVE "    **                                    **"
                               TO PRINT-REC
             WRITE PRINT-REC
             MOVE "    ****************************************"
                               TO PRINT-REC
             WRITE PRINT-REC
             MOVE SPACES       TO PRINT-REC
             WRITE PRINT-REC
           END-IF.


       DBGET-INIT-LOOP.
           READ PM-MASTER-SCHED NEXT INTO PM-MSCHED-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "10" OR "14" OR "46"
               READ PM-MASTER-SCHED PRIOR INTO PM-MSCHED-DATA
                   AT END      MOVE FILE-STAT TO FILE-STAT
               END-READ
               MOVE ZEROS      TO PMS-CYCLE
               GO TO CREATE-NEW-WORKORDER
           ELSE
           IF FILE-STAT NOT = "00"
               MOVE "READ NEXT PM-MASTER-SCHEDULE" TO BU-DISPLAY-MSG
               MOVE SCHED-KEY  TO BU-DISPLAY-FLD (2)
               PERFORM 999-BLOWUP.

           IF PMS-SCHED-KEY NOT = SCHED-KEY
               READ PM-MASTER-SCHED PRIOR INTO PM-MSCHED-DATA
                   AT END      MOVE FILE-STAT TO FILE-STAT
               END-READ
               MOVE ZEROS      TO PMS-CYCLE
               GO TO CREATE-NEW-WORKORDER.

           IF PMS-LEVEL = LEVEL-KEY
               GO TO CREATE-NEW-WORKORDER.

           GO TO DBGET-INIT-LOOP.

       CREATE-NEW-WORKORDER.
           MOVE "MAN-RLSE"     TO USER-CODE.
           MOVE SPACES         TO PM-SCHED-DATA.
           MOVE TODAYS-DATE    TO SCH-RELEASE-DATE.
           MOVE TD-YYYY        TO SCH-REL-YRMO-YR.
           MOVE TD-MM          TO SCH-REL-YRMO-MO.
           MOVE "MR"           TO SCH-REC-TYP.
           MOVE EQUIP-NUM-P    TO SCH-EQUIP-NUM.
           MOVE WO-NUM-PLANNED TO SCH-WO-NUM.
           MOVE ZONE-PRIORITY-P TO SCH-ZONE-PRI.
           MOVE INIT-LEVEL     TO SCH-LEVEL.
           MOVE PMS-CRITICAL   TO SCH-CRITICAL.
           MOVE PMS-CYCLE      TO SCH-CYCLE.
           MOVE PMS-LOOK-AHEAD TO SCH-LOOK-AHEAD.
           MOVE PMS-PRE-REL    TO SCH-PRE-REL.
           MOVE PMS-PRTY       TO SCH-PRIORITY.

           CALL "SPMNEWWO"     USING DBPARAMETERS
                               PM-SCHED-DATA
                               CRAFT-TABLE
                               USER-CODE
                               PRINT-DATA.

           PERFORM PRINT-PRINT-DATA THRU PP-DATA-EXIT.

           IF SCH-WO-SUFF NOT = "000"
      **********************************************************************
      **    MESSAGE 049/068:
      **  WORKORDER {          } HAS BEEN RELEASED
      **********************************************************************
               MOVE 49         TO LANG-SETNUM
               MOVE 68         TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL   TO IND (1)  IND(99)
               MOVE SPACES     TO PRINT-REC
               MOVE ERRMSG     TO RELEASE-MESSAGE
               MOVE SCH-WO-NUM TO RELEASE-MSG-WO
               MOVE RELEASE-MESSAGE TO ERRMSG
               WRITE PRINT-REC AFTER ADVANCING 2
               MOVE SPACES     TO PRINT-REC
               WRITE PRINT-REC.

           GO TO SHOWFORM.

       999-CATREAD.
           MOVE SPACES         TO CATREAD-MSG-TEXT.
           MOVE LANG-SETNUM    TO CATREAD-MSG-SET.
           MOVE LANG-MSGNUM    TO CATREAD-MSG-NUM.
           CALL "CCATREAD"     USING CATREAD-PARMS.
           IF CATREAD-MSG-NOT-FOUND
               MOVE "*ERROR ON THIS FIELD*" TO CATREAD-MSG-TEXT.

           MOVE CATREAD-MSG-TEXT TO ERRMSG.

       999-CATREAD-EXIT.       EXIT.

       999-BLOWUP.
           MOVE "SPMSMREL"     TO BU-PGM-NAME.
           MOVE VIEW-NFNAME    TO BU-DISPLAY-FLD (1).
           CALL "TBLOWUP"      USING BASE, BU-PGM-NAME, STATUS-AREA,
                               VIEW-COMAREA, FILE-STAT,
                               BU-DISPLAY-MSG, BU-DISPLAY-FLDS.

       PRINT-PRINT-DATA.
           IF PRINT-DATA = SPACES GO TO PP-DATA-EXIT.

           IF PRINT-1 NOT = SPACES
               MOVE PRINT-1    TO PRINT-REC
               WRITE PRINT-REC.

           IF PRINT-2 NOT = SPACES
               MOVE PRINT-2    TO PRINT-REC
               WRITE PRINT-REC.

           IF PRINT-3 NOT = SPACES
               MOVE PRINT-3    TO PRINT-REC
               WRITE PRINT-REC.

           IF PRINT-4 NOT = SPACES
               MOVE PRINT-4    TO PRINT-REC
               WRITE PRINT-REC.

           IF PRINT-5 NOT = SPACES
               MOVE PRINT-5    TO PRINT-REC
               WRITE PRINT-REC.

           IF PRINT-6 NOT = SPACES
               MOVE PRINT-6    TO PRINT-REC
               WRITE PRINT-REC.

           IF PRINT-7 NOT = SPACES
               MOVE PRINT-7    TO PRINT-REC
               WRITE PRINT-REC.

           IF PRINT-8 NOT = SPACES
               MOVE PRINT-8    TO PRINT-REC
               WRITE PRINT-REC.

           IF PRINT-9 NOT = SPACES
               MOVE PRINT-9    TO PRINT-REC
               WRITE PRINT-REC.

           IF PRINT-0 NOT = SPACES
               MOVE PRINT-0    TO PRINT-REC
               WRITE PRINT-REC.

       PP-DATA-EXIT.           EXIT.

       END-OF-JOB.
           CLOSE               PM-MASTER-SCHED.
           CLOSE               EQP-EQUIPMENT.
           CLOSE               WO-PLANNED.
           CLOSE               PRINT-FILE.
           GOBACK.

