       IDENTIFICATION DIVISION.
       PROGRAM-ID.             SPMSKINQ.
       AUTHOR.                 J.S. BUNGO.
       INSTALLATION.  GOODYEAR TIRE & RUBBER CO.
      *C****************************************************************
      *C  W. ROXBURY   05-28-94                                       **
      *C  ADDED ABILITY TO DISPLAY SCHEDULES FROM MASTER NAME LIST    **
      *C****************************************************************
      *C  11-14-96   W. ROXBURY
      *C  ADDED ABILITY TO PRINT SCHEDULES BY PRESSING THE F6 KEY.
      *C****************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       SPECIAL-NAMES.          C01 IS NEW-PAGE.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZPMMAINT-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

           SELECT PM-MSTR-SCHED
                  ASSIGN       TO DATABASE-MCFLMM4301
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT PRINT-FILE
                  ASSIGN       TO PRINTER-MCPRT
                  FILE STATUS  IS FILE-STAT.

           SELECT OUT-FILE
                  ASSIGN       TO DISK-PMSKINQ
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE  IS DYNAMIC
                  RELATIVE KEY IS ACT-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT SORT-FILE
                  ASSIGN       TO DISK-SORTFILE.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       FD  PM-MSTR-SCHED
           LABEL RECORDS       ARE STANDARD.
       01  PM-MSCHED-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM4301.

       FD  PRINT-FILE
           LABEL RECORD        IS OMITTED
           RECORD CONTAINS     79 CHARACTERS.
       01  PRINT-REC           PIC X(79).

       FD  OUT-FILE RECORD CONTAINS 26 CHARACTERS
           LABEL RECORDS       ARE OMITTED
           DATA RECORD         IS OUT-REC.
       01  OUT-REC.
           05  OUT-NAME        PIC X(10).
           05  OUT-CREATOR     PIC X(04).
           05  OUT-CHANGE-BY   PIC X(04).
           05  OUT-CHANGE-DATE.
               10  OUT-YY      PIC X(04).
               10  OUT-MM      PIC X(02).
               10  OUT-DD      PIC X(02).

       SD  SORT-FILE RECORD CONTAINS 26 CHARACTERS
           DATA RECORD         IS SORT-REC.
       01  SORT-REC.
           05  SORT-NAME.
               10  SN0         PIC X.
               10  SN1         PIC X.
               10  SN2         PIC X.
               10  SN3         PIC X.
               10  SN4         PIC X.
               10  SN5         PIC X.
               10  SN6         PIC X.
               10  SN7         PIC X.
               10  SN8         PIC X.
               10  SN9         PIC X.
           05  SORT-CREATOR    PIC X(04).
           05  SORT-CHANGE-BY  PIC X(04).
           05  SORT-CHANGE-DATE PIC X(08).

       WORKING-STORAGE SECTION.
       77  SK-KEY-NAME         PIC X(10).
       77  SUB                 PIC 9(04)  VALUE 0  COMP.
       77  SUBD                PIC 9(04)  VALUE 0  COMP.
       77  INQ-SW              PIC 9(04)  VALUE 0  COMP.
       77  EOF-SW              PIC S9(4)  VALUE 0  COMP.
       77  HELP-SW             PIC 9(04)  VALUE 0.
       77  SKIP-SW             PIC 9(04)  VALUE 0.
       77  ACT-KEY             PIC 9(08)  VALUE 0.
       77  MAX-KEY             PIC 9(08)  VALUE 0.
       77  SAVE-KEY            PIC 9(08)  VALUE 0.
       77  PAGE-KEY            PIC 9(08)  VALUE 0.
       77  PRINT-SW            PIC 9      VALUE 0.
           88  PRINT-SWITCH-IS-OFF        VALUE 0.
       77  INCLUDE-SW          PIC 9      VALUE 0.
           88  INCLUDED                   VALUE 1.
       77  LINE-CTR            PIC 99     VALUE 60.
       77  PAGE-CTR            PIC 99     VALUE 0.
       77  EQ-LINE             PIC X(79)  VALUE ALL "=".
       77  DASH-LINE           PIC X(79)  VALUE ALL "-".
       77  DASH-SKIP           PIC X(79)  VALUE ALL "- ".

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "SPMSKINQ".
           05  PROGRAM-TYPE        PIC X(02) VALUE "IN".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " J0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A     PIC X(60) VALUE
           "DISPLAYS A LIST OF SCHEDULE NAMES WITH THEIR CREATORS,    ".
               10  PROG-DESC-B     PIC X(60) VALUE
           "CHANGER, AND CHANGE DATE.                                 ".
               10  PROG-FUNCTION   PIC X(60) VALUE
           "RUNS FROM THE f6 KEY OF THE REPORTS AND INQUIRIES MENU.   ".
           05  PASSWORD-FLAG       PIC X.

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       01  SELECT-BUFFER.
           05  SK-NAME-BUF.
               10  SK0         PIC X.
               10  SK1         PIC X.
               10  SK2         PIC X.
               10  SK3         PIC X.
               10  SK4         PIC X.
               10  SK5         PIC X.
               10  SK6         PIC X.
               10  SK7         PIC X.
               10  SK8         PIC X.
               10  SK9         PIC X.
           05  CRTR-BUF        PIC X(04).
           05  CMDMSG          PIC X(79).
           05  ERRMSG          PIC X(79).

       01  SCREEN-DATA.
           05  DLINE           OCCURS 19 TIMES.
               10  DSEL        PIC X.
               10  DDATA.
                   15  DNAME        PIC X(10).
                   15  DCREATOR     PIC X(04).
                   15  DCHANGE-BY   PIC X(04).
                   15  DCHANGE-DATE PIC X(10).
           05  CMDMSG2         PIC X(79).
           05  ERRMSG2         PIC X(79).

       01  PSCHED-DATA.
           05  CMDMSGP         PIC X(79).
           05  ERRMSGP         PIC X(79).

       01  LEVEL-BUFFER.
           05  MSTR-SCHED-NAME PIC X(10).
           05  CREATOR-BUF     PIC X(04).
           05  LEVEL-LIST      PIC X(240).
           05  LIST-TABLE      REDEFINES LEVEL-LIST.
               10  LIST        OCCURS 12 TIMES
                               PIC X(20).
           05  SCREEN-MSGS.
               10  CMDMSGD     PIC X(79).
               10  ERRMSGD     PIC X(79).

       01  LEVEL-DISP.
           05  LD-NUM                    PIC Z9.
           05  LD-NUM9 REDEFINES LD-NUM  PIC 99.
           05  LD-CYCLE                  PIC ZZZ9.
           05  LD-PRE-REL                PIC ZZZ9.
           05  LD-CRIT                   PIC ZZZ9.
           05  LD-LOOK                   PIC ZZZ9.
           05  LD-PRTY                   PIC 9.
           05  LD-FIX                    PIC X.

       01  DISPLAY-DATE.
           05  DD-MM           PIC XX.
           05  FILLER          PIC X  VALUE "/".
           05  DD-DD           PIC XX.
           05  FILLER          PIC X  VALUE "/".
           05  DD-YYYY         PIC XXXX.

       01  DATE-HEADER.
           05  FILLER          PIC X(10) VALUE SPACES.
           05  FILLER          PIC X(07) VALUE "DATE:  ".
           05  P-DATE.
               10  P-DATE-MM   PIC X(02)  VALUE SPACES.
               10  FILLER      PIC X(01)  VALUE "/".
               10  P-DATE-DD   PIC X(02)  VALUE SPACES.
               10  FILLER      PIC X(01)  VALUE "/".
               10  P-DATE-YY   PIC X(02)  VALUE SPACES.
           05  FILLER          PIC X(10) VALUE SPACES.
           05  FILLER          PIC X(07) VALUE "TIME:  ".
           05  P-TIME          PIC X(08) VALUE SPACES.
           05  FILLER          PIC X(12) VALUE SPACES.
           05  FILLER          PIC X(05) VALUE "PAGE:".
           05  ZPAGE           PIC ZZZ   VALUE SPACES.
           05  FILLER          PIC X(10) VALUE SPACES.

       01  TITLE-HEADER.
           05  FILLER          PIC X(20) VALUE "                    ".
           05  FILLER          PIC X(20) VALUE "  P M   M A S T E R ".
           05  FILLER          PIC X(20) VALUE "  S C H E D U L E S ".
           05  FILLER          PIC X(19) VALUE "                   ".

       01  TEXT-HEADER.
           05  FILLER          PIC X(20) VALUE "            NAME    ".
           05  FILLER          PIC X(20) VALUE "           CREATOR  ".
           05  FILLER          PIC X(20) VALUE "    CHANGED BY      ".
           05  FILLER          PIC X(19) VALUE "CHANGED ON         ".

       01  TEXT-HEADER-I.
           05  FILLER          PIC X(20) VALUE "  NAME              ".
           05  FILLER          PIC X(20) VALUE " CREATOR      CHANGE".
           05  FILLER          PIC X(20) VALUE "D BY      CHANGED ON".
           05  FILLER          PIC X(19) VALUE "                   ".

       01  LEVEL-HEADER1.
           05  FILLER          PIC X(20) VALUE "            CYCLE   ".
           05  FILLER          PIC X(20) VALUE "PRE-RELEASE   CRITIC".
           05  FILLER          PIC X(20) VALUE "AL    LOOK-AHEAD    ".
           05  FILLER          PIC X(19) VALUE "          FIXED/   ".

       01  LEVEL-HEADER2.
           05  FILLER          PIC X(20) VALUE "    LEVEL   (DAYS)  ".
           05  FILLER          PIC X(20) VALUE "  (DAYS)      (DAYS)".
           05  FILLER          PIC X(20) VALUE "       (DAYS)       ".
           05  FILLER          PIC X(19) VALUE "PRIORITY  DYNAMIC  ".

       01  PRINT-LINE.
           05  FILLER          PIC X(12) VALUE SPACES.
           05  P-SCHED         PIC X(10).
           05  FILLER          PIC X(10) VALUE SPACES.
           05  P-CREATOR       PIC X(04).
           05  FILLER          PIC X(11) VALUE SPACES.
           05  P-MODIFIER      PIC X(04).
           05  FILLER          PIC X(09) VALUE SPACES.
           05  P-DATEMOD       PIC X(10).
           05  FILLER          PIC X(09) VALUE SPACES.

       01  PRINT-LINE-I.
           05  FILLER          PIC X(02) VALUE SPACES.
           05  I-SCHED         PIC X(10).
           05  FILLER          PIC X(10) VALUE SPACES.
           05  I-CREATOR       PIC X(04).
           05  FILLER          PIC X(11) VALUE SPACES.
           05  I-MODIFIER      PIC X(04).
           05  FILLER          PIC X(09) VALUE SPACES.
           05  I-DATEMOD       PIC X(10).
           05  FILLER          PIC X(06) VALUE SPACES.
           05  I-CONT          PIC X(11) VALUE SPACES.
           05  FILLER          PIC X(02) VALUE SPACES.

       01  LEVEL-PRINT.
           05  FILLER          PIC X(05) VALUE SPACES.
           05  PLD-NUM         PIC Z9.
           05  FILLER          PIC X(05) VALUE SPACES.
           05  PLD-CYCLE       PIC ZZZ9.
           05  FILLER          PIC X(06) VALUE SPACES.
           05  PLD-PRE-REL     PIC ZZZ9.
           05  FILLER          PIC X(08) VALUE SPACES.
           05  PLD-CRIT        PIC ZZZ9.
           05  FILLER          PIC X(09) VALUE SPACES.
           05  PLD-LOOK        PIC ZZZ9.
           05  FILLER          PIC X(12) VALUE SPACES.
           05  PLD-PRTY        PIC 9.
           05  FILLER          PIC X(08) VALUE SPACES.
           05  PLD-FIX         PIC X.
           05  FILLER          PIC X(06) VALUE SPACES.

       01  CUR-DATE.
           05  CUR-YY          PIC X(02).
           05  CUR-MM          PIC X(02).
           05  CUR-DD          PIC X(02).

       01  TIME-BUFFER.
           05  TIME-BUF.
               10  HRS         PIC XX.
               10  MIN         PIC XX.
               10  SEC         PIC XX.
           05  TIME-EXP.
               10  TIME-H      PIC XX.
               10  FILLER      PIC X  VALUE ":".
               10  TIME-M      PIC XX.
               10  FILLER      PIC X  VALUE ":".
               10  TIME-S      PIC XX.

       01  DB-ERROR.
           05  DB-TYPE   PIC X(08) VALUE SPACES.
           05  FILLER    PIC X(21) VALUE " ERROR - FILE-STAT = ".
           05  CON-WORD  PIC XX.

           COPY CATREAD        IN COPYLIB.

           COPY SCREENIO       IN COPYLIB.

           COPY VCOMAREA       IN COPYLIB.

           COPY LANGSUB        IN COPYLIB.

           COPY OVRPFDATA      IN COPYLIB.

       01  MESSAGE-FILE-DATA.
           COPY ERRORLIN       IN COPYLIB.

       01  PM-MSCHED-DATA.
           COPY DPMMSTSC       IN COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       PROCEDURE DIVISION      USING DBPARAMETERS.
       BEGIN-SORT SECTION 01.
       BEGIN-SRT.
           CALL "TPWORD"       USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "N"
               GOBACK.

           CALL "CLOUTSK".

       OPEN-FILES.
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          PM-MSTR-SCHED.
      *    MOVE 0              TO PRINT-SW
      *                           OVRPRTF-TOFILE-NUM.
           MOVE 0              TO PRINT-SW.
           MOVE "P "           TO OVRPRTF-TOFILE-NUM-X.
           MOVE "MCPRT"        TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.

       CLEAR-BUFFERS.
           MOVE SPACES         TO SELECT-BUFFER MESSAGE-BUFFER.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

       BEGIN-PROC.
           PERFORM HSK         THRU HSK-EXIT.
           GO TO MAIN.

       END-OF-JOB.
           CLOSE               PM-MSTR-SCHED.
           CLOSE               DISPLAY-FILE.
           GOBACK.

       HSK.
           MOVE 68             TO HELP-SW.
           MOVE "VSKINQSEL"    TO SCREEN-NAME.

       SHOWFORM-SELECT.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SELECT-BUFFER  TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO SELECT-BUFFER.

           IF KEY-HIT = 3 OR 8
               GO TO END-OF-JOB.

           IF KEY-HIT = 7
               CALL "SPMHELPM" USING HELP-SW
               GO TO SHOWFORM-SELECT.

           IF KEY-HIT NOT = 0
               GO TO SHOWFORM-SELECT.

       HSK-EXIT.               EXIT.

       MAIN.
           OPEN OUTPUT         OUT-FILE.
           MOVE 0              TO EOF-SW ACT-KEY PAGE-KEY PAGE-CTR.
           MOVE 60             TO LINE-CTR.
           SORT SORT-FILE ASCENDING KEY SORT-NAME
               INPUT  PROCEDURE SORTIN-INQ
               OUTPUT PROCEDURE SORTOUT-INQ.
           CLOSE               OUT-FILE.

           IF ACT-KEY = 0
      **********************************************************************
      **    MESSAGE 040/011:
      ** NO RECORDS FOUND WHICH MATCH YOUR SELECTION
      **********************************************************************
               MOVE  40        TO LANG-SETNUM
               MOVE  11        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE CATREAD-MSG-TEXT TO ERRMSG
               MOVE 1          TO FIELD-NUMBER
               PERFORM SET-ERROR
               GO TO BEGIN-PROC.

           OPEN I-O            OUT-FILE.
           MOVE 0              TO ACT-KEY.
           MOVE "VSKNAMEI"     TO SCREEN-NAME.

       RESET-SCREEN.
           MOVE 68             TO HELP-SW.
           MOVE SPACES         TO SCREEN-DATA MESSAGE-BUFFER.
           PERFORM FILL-SCREEN THRU FS-EXIT.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

       SHOWFORM.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 3 OR 8
               CLOSE           OUT-FILE
               GO TO END-OF-JOB.

           IF KEY-HIT = 1
               CLOSE           OUT-FILE
               GO TO CLEAR-BUFFERS.

           IF KEY-HIT = 2
               IF ACT-KEY NOT > 19
                   GO TO SHOWFORM
               ELSE
                   COMPUTE ACT-KEY = ACT-KEY - PAGE-KEY - 19
                   MOVE 0 TO EOF-SW
                   GO TO RESET-SCREEN.

           IF KEY-HIT = 4
               IF EOF-SW = 1
                   GO TO SHOWFORM
               ELSE
                   GO TO RESET-SCREEN.

           IF KEY-HIT = 6
               MOVE 1          TO PRINT-SW
               MOVE 0          TO INCLUDE-SW
               PERFORM SHOWFORM-PRINT THRU SP-EXIT
               CLOSE           OUT-FILE
               ACCEPT CUR-DATE FROM DATE
               MOVE CUR-YY     TO P-DATE-YY
               MOVE CUR-MM     TO P-DATE-MM
               MOVE CUR-DD     TO P-DATE-DD
               ACCEPT TIME-BUF FROM TIME
               MOVE HRS        TO TIME-H
               MOVE MIN        TO TIME-M
               MOVE SEC        TO TIME-S
               MOVE TIME-EXP   TO P-TIME
               GO TO MAIN.

           IF KEY-HIT = 7
               CALL "SPMHELPM" USING HELP-SW
               GO TO SHOWFORM.

           IF KEY-HIT NOT = 0
               GO TO SHOWFORM.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           PERFORM CHECK-FOR-INQUIRY.

           GO TO SHOWFORM.

       SHOWFORM-PRINT.
           MOVE "PSCHED"       TO SCREEN-NAME.
           MOVE "00"           TO SCREEN-STATUS.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 3 OR 8
               CLOSE           OUT-FILE
               GO TO END-OF-JOB.

           IF KEY-HIT = 1
               GO TO SP-EXIT.

           IF KEY-HIT = 2
               MOVE 1          TO INCLUDE-SW
               GO TO SP-EXIT.

           IF KEY-HIT = 6
               CLOSE           OUT-FILE
               GO TO MAIN.

           GO TO SHOWFORM-PRINT.

       SP-EXIT.                EXIT.

       FILL-SCREEN.
           MOVE 0              TO SUB PAGE-KEY.
           PERFORM FILL-LINE   THRU FL-EXIT UNTIL SUB = 19.
           MOVE ACT-KEY        TO SAVE-KEY.

       FS-EXIT.                EXIT.

       FILL-LINE.
           ADD 1               TO ACT-KEY SUB PAGE-KEY.
           MOVE SPACES         TO OUT-REC.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               MOVE 19         TO SUB
               GO TO FL-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               MOVE 19         TO SUB
               SUBTRACT 1 FROM ACT-KEY PAGE-KEY
               GO TO FL-EXIT.

           MOVE OUT-NAME       TO DNAME(SUB).
           MOVE OUT-CREATOR    TO DCREATOR(SUB).
           IF OUT-CHANGE-BY NOT = SPACES
               MOVE OUT-CHANGE-BY  TO DCHANGE-BY(SUB)
               MOVE OUT-YY     TO DD-YYYY
               MOVE OUT-MM     TO DD-MM
               MOVE OUT-DD     TO DD-DD
               MOVE DISPLAY-DATE TO DCHANGE-DATE(SUB)
           ELSE
               MOVE SPACES     TO DCHANGE-BY(SUB)
                                  DCHANGE-DATE(SUB).

       FL-EXIT.                EXIT.

       CHECK-FOR-INQUIRY.
           MOVE 0              TO INQ-SW SUB.
           PERFORM CHECK-INQ-LOOP UNTIL SUB = 19.
           IF INQ-SW = 1
               MOVE 0          TO INQ-SW
               MOVE "VSKNAMEI" TO SCREEN-NAME
               MOVE 68         TO HELP-SW.

       CHECK-INQ-LOOP.
           ADD 1               TO SUB.
           IF DSEL(SUB) = "D"
               IF DNAME(SUB) NOT = SPACES
                   MOVE 1      TO INQ-SW
                   PERFORM DISPLAY-SCHEDULE THRU DS-EXIT
                   MOVE SPACE  TO DSEL(SUB).

           IF DSEL(SUB) = "W"
               IF DNAME(SUB) NOT = SPACES
                   MOVE 1      TO INQ-SW
                   MOVE DNAME(SUB) TO SK-KEY-NAME
                   MOVE SPACES TO MESSAGE-BUFFER
                   CALL "SPMSKWOI" USING VIEW-COMAREA
                                         DBPARAMETERS
                                         LANGUAGE-PARMS
                                         SK-KEY-NAME
                                         MESSAGE-BUFFER
                   IF MESSAGE-BUFFER NOT = SPACES
                       MOVE SPACE TO DSEL(SUB)
                       MOVE MESSAGE-BUFFER TO ERRMSG2
                       MOVE 2  TO FIELD-NUMBER
                       PERFORM SET-ERROR
                       MOVE 19 TO SUB
                   ELSE
                       MOVE SPACE  TO DSEL(SUB).

       DISPLAY-SCHEDULE.
           MOVE "VPMLEVEL"     TO SCREEN-NAME.
           MOVE SPACES         TO LEVEL-BUFFER MESSAGE-BUFFER.
           MOVE DNAME(SUB)     TO MSTR-SCHED-NAME.
           PERFORM READ-LOOP   THRU READ-EXIT.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

       DS-SHOWFORM.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE LEVEL-BUFFER   TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

       DS-EXIT.                EXIT.

       READ-LOOP.
           MOVE 0              TO SUBD.
           MOVE MSTR-SCHED-NAME TO PMSCHEDKEY OF PM-MSTR-SCHED.
           START PM-MSTR-SCHED KEY = PMSCHEDKEY OF PM-MSTR-SCHED
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO READ-EXIT.

       DBGET-READ-LOOP.
           READ PM-MSTR-SCHED  NEXT INTO PM-MSCHED-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO READ-EXIT.

           IF PMS-SCHED-KEY NOT = MSTR-SCHED-NAME
               GO TO READ-EXIT.

           ADD 1               TO SUBD.

           IF SUBD = 1
               MOVE PMS-CREATOR TO CREATOR-BUF.
           MOVE PMS-LEVEL      TO LD-NUM.
           MOVE PMS-CYCLE      TO LD-CYCLE.
           MOVE PMS-PRE-REL    TO LD-PRE-REL.
           MOVE PMS-CRITICAL   TO LD-CRIT.
           MOVE PMS-LOOK-AHEAD TO LD-LOOK.
           MOVE PMS-PRIORITY   TO LD-PRTY.
           MOVE PMS-REC-TYP    TO LD-FIX.
           MOVE LEVEL-DISP     TO LIST(SUBD).
           GO TO DBGET-READ-LOOP.

       READ-EXIT.              EXIT.

       SET-ERROR.
           MOVE B"1"           TO IND(FIELD-NUMBER) IND(99).

       999-CATREAD.
           MOVE SPACES         TO CATREAD-MSG-TEXT.
           MOVE LANG-SETNUM    TO CATREAD-MSG-SET.
           MOVE LANG-MSGNUM    TO CATREAD-MSG-NUM.
           CALL "CCATREAD"     USING CATREAD-PARMS.
           IF CATREAD-MSG-NOT-FOUND
                MOVE "***ERROR MSG NOT FOUND***" TO CATREAD-MSG-TEXT.

       999-CATREAD-EXIT.       EXIT.

       SORTIN-INQ SECTION 02.
       SORTIN.
           PERFORM SORT-MAIN   THRU SORT-M-EXIT
           GO TO SORT-IP-EXIT.

       SORT-MAIN.
           MOVE LOW-VALUES     TO PMSCHEDKEY OF PM-MSTR-SCHED.
           START PM-MSTR-SCHED
               KEY NOT LESS    THAN PMSCHEDKEY OF PM-MSTR-SCHED
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO SORT-M-EXIT.

       SORT-DBGET.
           MOVE SPACES         TO SORT-REC.
           READ PM-MSTR-SCHED  NEXT INTO PM-MSCHED-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "10" OR "14" OR "46"
               GO TO SORT-M-EXIT
           ELSE
           IF FILE-STAT NOT = "00"
               MOVE "DBGET   " TO DB-TYPE
               MOVE FILE-STAT  TO CON-WORD
               MOVE DB-ERROR   TO ERRMSG
               MOVE 1          TO FIELD-NUMBER
               PERFORM SET-ERROR
               GO TO SORT-M-EXIT.

           IF PMS-LEVEL NOT = "01"
               GO TO SORT-DBGET.

           MOVE PMS-SCHED-KEY TO SORT-NAME.

           IF SK-NAME-BUF = SPACES
               NEXT SENTENCE
           ELSE
           IF SK0 = SN0 OR SPACES
             IF SK1 = SN1 OR SPACES
               IF SK2 = SN2 OR SPACES
                 IF SK3 = SN3 OR SPACES
                   IF SK4 = SN4 OR SPACES
                     IF SK5 = SN5 OR SPACES
                       IF SK6 = SN6 OR SPACES
                         IF SK7 = SN7 OR SPACES
                           IF SK8 = SN8 OR SPACES
                             IF SK9 = SN9 OR SPACES
                                 NEXT SENTENCE
                             ELSE
                                 GO TO SORT-DBGET
                           ELSE
                               GO TO SORT-DBGET
                         ELSE
                             GO TO SORT-DBGET
                       ELSE
                           GO TO SORT-DBGET
                     ELSE
                         GO TO SORT-DBGET
                   ELSE
                       GO TO SORT-DBGET
                 ELSE
                     GO TO SORT-DBGET
               ELSE
                   GO TO SORT-DBGET
             ELSE
                 GO TO SORT-DBGET
           ELSE
               GO TO SORT-DBGET.

           IF CRTR-BUF = SPACES OR PMS-CREATOR
               NEXT SENTENCE
           ELSE
               GO TO SORT-DBGET.

           MOVE PMS-CREATOR    TO SORT-CREATOR.
           MOVE PMS-CHANGED-BY TO SORT-CHANGE-BY.
           MOVE PMS-CHANGED-DATE TO SORT-CHANGE-DATE.

           RELEASE SORT-REC.
           GO TO SORT-DBGET.

       SORT-M-EXIT.            EXIT.

       SORT-IP-EXIT.           EXIT.

       SORTOUT-INQ SECTION 03.
       SORTOUT.
           OPEN OUTPUT         OUT-FILE.
           PERFORM SORT-READ-LOOP THRU SRL-EXIT.
           CLOSE               OUT-FILE.
           PERFORM SORT-PRINT-LOOP THRU SPL-EXIT.
           GO TO SORT-WF-EXIT.

       SORT-READ-LOOP.
           RETURN SORT-FILE    AT END
               MOVE ACT-KEY    TO MAX-KEY
               GO TO SRL-EXIT.
           ADD 1               TO ACT-KEY.
           MOVE SORT-REC       TO OUT-REC.
           WRITE OUT-REC       INVALID KEY
               DISPLAY "WRITE OUT-FILE ERR"
               GO TO SRL-EXIT.
           GO TO SORT-READ-LOOP.

       SRL-EXIT.               EXIT.

       SORT-PRINT-LOOP.
           IF PRINT-SWITCH-IS-OFF
               GO TO SPL-EXIT.

      *    MOVE 0              TO OVRPRTF-TOFILE-NUM.
           MOVE "P "           TO OVRPRTF-TOFILE-NUM-X.
           MOVE "MCPRT"        TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           MOVE 0              TO ACT-KEY.
           OPEN INPUT          OUT-FILE.
           OPEN OUTPUT         PRINT-FILE.

       PRINT-LOOP.
           IF LINE-CTR > 58
               PERFORM PRINT-HEADINGS.

           ADD 1               TO ACT-KEY.
           MOVE SPACES         TO OUT-REC.
           READ OUT-FILE       INVALID KEY
               GO TO PL-EXIT.
           IF ACT-KEY > MAX-KEY
               GO TO PL-EXIT.

           MOVE OUT-NAME       TO P-SCHED I-SCHED.
           MOVE OUT-CREATOR    TO P-CREATOR I-CREATOR.
           IF OUT-CHANGE-BY NOT = SPACES
               MOVE OUT-CHANGE-BY  TO P-MODIFIER I-MODIFIER
               MOVE OUT-YY     TO DD-YYYY
               MOVE OUT-MM     TO DD-MM
               MOVE OUT-DD     TO DD-DD
               MOVE DISPLAY-DATE TO P-DATEMOD I-DATEMOD
           ELSE
               MOVE SPACES     TO P-MODIFIER I-MODIFIER
                                  P-DATEMOD I-DATEMOD.

           IF INCLUDED
               MOVE SPACES     TO I-CONT
               MOVE PRINT-LINE-I TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1 LINES
               MOVE DASH-SKIP  TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1 LINES
               ADD  2          TO LINE-CTR
           ELSE
               MOVE PRINT-LINE TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1 LINES
               ADD  1          TO LINE-CTR.

           MOVE 0              TO SKIP-SW.

           IF INCLUDED
               PERFORM PRINT-LEVEL THRU PLEVEL-EXIT.

           GO TO PRINT-LOOP.

       PL-EXIT.
           CLOSE               OUT-FILE.
           CLOSE               PRINT-FILE.
           MOVE 0              TO PRINT-SW.
           GO TO SPL-EXIT.

       PRINT-HEADINGS.
           ADD  1              TO PAGE-CTR.
           MOVE PAGE-CTR       TO ZPAGE.
           MOVE DATE-HEADER    TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING NEW-PAGE.
           MOVE DASH-LINE      TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 1 LINES.
           MOVE TITLE-HEADER   TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 1 LINES.
           MOVE DASH-LINE      TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 1 LINES.

           IF INCLUDED
               MOVE TEXT-HEADER-I  TO PRINT-REC
               WRITE PRINT-REC     AFTER ADVANCING 1 LINES
           ELSE
               MOVE TEXT-HEADER    TO PRINT-REC
               WRITE PRINT-REC     AFTER ADVANCING 1 LINES.

           IF INCLUDED
               MOVE DASH-SKIP  TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1 LINES
               MOVE LEVEL-HEADER1 TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1 LINES
               MOVE LEVEL-HEADER2 TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1 LINES.

           MOVE EQ-LINE        TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 1 LINES.
           MOVE 6              TO LINE-CTR.

           IF INCLUDED         MOVE 9 TO LINE-CTR.

           MOVE 1              TO SKIP-SW.

       PRINT-LEVEL.
           MOVE SPACES         TO LEVEL-PRINT.
           MOVE OUT-NAME       TO MSTR-SCHED-NAME.
           PERFORM READ-LOOP2  THRU READ-EXIT2.

       PLEVEL-EXIT.            EXIT.

       READ-LOOP2.
           MOVE MSTR-SCHED-NAME TO PMSCHEDKEY OF PM-MSTR-SCHED.
           START PM-MSTR-SCHED KEY = PMSCHEDKEY OF PM-MSTR-SCHED
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO READ-EXIT2.

       DBGET-READ-LOOP2.
           READ PM-MSTR-SCHED  NEXT INTO PM-MSCHED-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE SPACES     TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1 LINES
               ADD  1          TO LINE-CTR
               GO TO READ-EXIT2.

           IF PMS-SCHED-KEY NOT = MSTR-SCHED-NAME
               MOVE SPACES     TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1 LINES
               ADD  1          TO LINE-CTR
               GO TO READ-EXIT2.

           IF SKIP-SW = 1
               MOVE "(CONTINUED)" TO I-CONT
               MOVE PRINT-LINE-I TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1 LINES
               MOVE DASH-SKIP  TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1 LINES
               ADD  2          TO LINE-CTR.

           MOVE PMS-LEVEL      TO PLD-NUM.
           MOVE PMS-CYCLE      TO PLD-CYCLE.
           MOVE PMS-PRE-REL    TO PLD-PRE-REL.
           MOVE PMS-CRITICAL   TO PLD-CRIT.
           MOVE PMS-LOOK-AHEAD TO PLD-LOOK.
           MOVE PMS-PRIORITY   TO PLD-PRTY.
           MOVE PMS-REC-TYP    TO PLD-FIX.

           MOVE LEVEL-PRINT    TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 1 LINES.
           ADD  1              TO LINE-CTR.
           MOVE 0              TO SKIP-SW.
           IF LINE-CTR > 58
               PERFORM PRINT-HEADINGS.

           GO TO DBGET-READ-LOOP2.

       READ-EXIT2.             EXIT.

       COPY OVRPFCALL IN COPYLIB.

       SPL-EXIT.               EXIT.

       SORT-WF-EXIT.           EXIT.

      *************  END OF FILE  -  SPMSKINQ  *****************
