       IDENTIFICATION DIVISION.
       PROGRAM-ID.             SPMWRTMS.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PM-MASTER-FILE
                  ASSIGN       TO DATABASE-MCFLMM4701
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-PLANNED
                  ASSIGN       TO DATABASE-MCFLMM1101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

       DATA DIVISION.
       FILE SECTION.
       FD  PM-MASTER-FILE
           LABEL RECORDS       ARE STANDARD
           DATA RECORD         IS PMREC.
       01  PMREC.
           COPY DDS-ALL-FORMATS OF MCFLMM4701.

       FD  WO-PLANNED
           LABEL RECORDS ARE STANDARD.
       01  WO-PLANNED-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.

       WORKING-STORAGE SECTION.
       77  ACD-SW              PIC X   VALUE "A".
       77  CNUM-BUF            PIC X(04).

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       01  WORKORDER.
           05  WO-BASE         PIC X(07).
           05  WO-SUFF         PIC XXX.

       01  CURR-DATE.
           05  CD-YY           PIC 99.
           05  CD-MM           PIC 99.
           05  CD-DD           PIC 99.

       01  TIME-BUFF.
           05  TIME-HHMM.
               10  TIME-HH     PIC 99.
               10  TIME-MM     PIC 99.
           05  TIME-REST       PIC 9(04).

       01  TODAYS-DATE.
           05  TD-YYYY.
               10  TD-CT       PIC 99.
               10  TD-YY       PIC 99.
           05  TD-MM           PIC 99.
           05  TD-DD           PIC 99.

       01  WO-MESSAGE-A.
           05  FILLER          PIC X(18) VALUE "DATE/TIME STAMP:  ".
           05  DATE-BUF.
               10  DATE-MM     PIC X(02) VALUE SPACES.
               10  DATE-SL1    PIC X     VALUE SPACES.
               10  DATE-DD     PIC X(02) VALUE SPACES.
               10  DATE-SL2    PIC X     VALUE SPACES.
               10  DATE-CT     PIC X(02) VALUE SPACES.
               10  DATE-YY     PIC X(02) VALUE SPACES.
           05  FILLER          PIC X(04) VALUE " AT ".
           05  TIME-BUF.
               10  TIME-HR     PIC X(02) VALUE SPACES.
               10  TIME-COL    PIC X     VALUE SPACES.
               10  TIME-MN     PIC X(02) VALUE SPACES.
           05  FILLER          PIC X(27) VALUE SPACES.

       01  WO-MESSAGE-B.
           05  FILLER          PIC X(13) VALUE "PM WORKORDER ".
           05  WO-BUF          PIC X(10) VALUE SPACES.
           05  FILLER          PIC X(15) VALUE " FOR EQUIPMENT ".
           05  EQP-BUF         PIC X(06).
           05  FILLER          PIC X(26) VALUE SPACES.

       01  WO-MESSAGE-C.
           05  FILLER          PIC X(14) VALUE "DESCRIPTION:  ".
           05  DESC-BUF        PIC X(30) VALUE SPACES.
           05  FILLER          PIC X(26) VALUE SPACES.

       01  DB-ERROR.
           05  DB-TYPE         PIC X(08) VALUE SPACES.
           05  DB-FILE         PIC X(16) VALUE SPACES.
           05  FILLER          PIC X(20) VALUE " ERROR  FILE-STAT = ".
           05  CON-WORD        PIC XX.
           05  FILLER          PIC X(02) VALUE SPACES.
           05  DB-PARA         PIC X(20) VALUE SPACES.

       01  WO-PLANNED-DATA.
           COPY DWOPLAN        IN COPYLIB.

       01  MESSAGE-DATA.
           COPY DWOMSG         IN COPYLIB.

       01  PM-MASTER-DATA.
           COPY DPMMASTR       IN COPYLIB.

       LINKAGE SECTION.
       01  MSG-SW              PIC X.

       01  WO-LINK-DATA.
           05  WO-NUMBER       PIC X(10).
           05  WO-EQUIP        PIC X(06).
           05  WO-DESC         PIC X(30).

       01  ERROR-MESSAGE.
           05  ERROR-TEXT      PIC X(70).
           05  ERROR-FILL      PIC X(06).
           05  ERROR-CODE      REDEFINES ERROR-FILL
                               PIC 9(06).

       PROCEDURE DIVISION      USING MSG-SW
                               WO-LINK-DATA
                               ERROR-MESSAGE.

       START-PROCESSING.
           OPEN INPUT          WO-PLANNED.
           OPEN INPUT          PM-MASTER-FILE.
           MOVE WO-NUMBER      TO WORKORDER.
           MOVE "000"          TO WO-SUFF.

           MOVE WORKORDER      TO WONUM OF WO-PLANNED.
           READ WO-PLANNED     INTO WO-PLANNED-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE FILE-STAT  TO CON-WORD
               MOVE "READ    " TO DB-TYPE
               MOVE "WO-PLANNED" TO DB-FILE
               MOVE "GET-WO-DATA" TO DB-PARA
               MOVE DB-ERROR   TO ERROR-TEXT
               GO TO END-OF-JOB.

           MOVE SPACES         TO MESSAGE-DATA ERROR-MESSAGE.
           ACCEPT CURR-DATE    FROM DATE.
           MOVE CD-YY          TO TD-YY DATE-YY.
           MOVE CD-MM          TO TD-MM DATE-MM.
           MOVE CD-DD          TO TD-DD DATE-DD.
           MOVE "/"            TO DATE-SL1 DATE-SL2.
           MOVE 20             TO TD-CT.
           IF TD-YY > 70
               MOVE 19         TO TD-CT.
           MOVE TD-CT          TO DATE-CT.
           MOVE TODAYS-DATE    TO DATE-INIT-CN.

           ACCEPT TIME-BUFF    FROM TIME.
           MOVE TIME-HHMM      TO TIME-INIT.
           MOVE TIME-HH        TO TIME-HR.
           MOVE TIME-MM        TO TIME-MN.
           MOVE ":"            TO TIME-COL.
           MOVE "9999"         TO FROM-CC.
           MOVE "PM AUTO MESSAGE SYSTEM      "
                               TO FROM-SIGNON.

       SELECT-MESSAGE.
           MOVE WO-NUMBER      TO WO-BUF.
           MOVE WO-EQUIP       TO EQP-BUF.
           MOVE WO-DESC        TO DESC-BUF.
           MOVE WO-MESSAGE-A   TO MESSAGE-1.
           MOVE WO-MESSAGE-B   TO MESSAGE-2.
           MOVE WO-MESSAGE-C   TO MESSAGE-3.
           IF MSG-SW = "1"
               PERFORM SELECT-MESSAGE-1
           ELSE
           IF MSG-SW = "2"
               PERFORM SELECT-MESSAGE-2
           ELSE
           IF MSG-SW = "3"
               PERFORM SELECT-MESSAGE-3
           ELSE
           IF MSG-SW = "4"
               PERFORM SELECT-MESSAGE-4
           ELSE
           IF MSG-SW = "5"
               PERFORM SELECT-MESSAGE-5
           ELSE
           IF MSG-SW = "6"
               PERFORM SELECT-MESSAGE-6
           ELSE
               MOVE
              "MESSAGE CODE IS INCORRECT, MUST BE NUMBER FROM 1 TO 6"
                               TO ERROR-TEXT
               GO TO END-OF-JOB.

       RUN-MESSAGE-LOOP.
           IF ENGINEER-P NOT = SPACES
               MOVE ENGINEER-P TO CNUM-BUF
               PERFORM GET-WHO-LOOP THRU GWL-EXIT.

           IF PLANNER-P NOT = SPACES
               MOVE PLANNER-P  TO CNUM-BUF
               PERFORM GET-WHO-LOOP THRU GWL-EXIT.

           IF SCHEDULER-P NOT = SPACES
               MOVE SCHEDULER-P TO CNUM-BUF
               PERFORM GET-WHO-LOOP THRU GWL-EXIT.

       END-OF-JOB.
            CLOSE              PM-MASTER-FILE.
            CLOSE              WO-PLANNED.
            GOBACK.

       SELECT-MESSAGE-1.
           MOVE "WORKORDER IS RELEASED TO THE FLOOR FOR LABOR."
                               TO MESSAGE-4.

       SELECT-MESSAGE-2.
           MOVE
           "WORKORDER IS PRE-RELEASED TO THE PLANNER FOR SCHEDULING."
                               TO MESSAGE-4.

       SELECT-MESSAGE-3.
           MOVE "WORKORDER HAS BEEN COMPLETED (CLOSED CW STATUS)."
                               TO MESSAGE-4.

       SELECT-MESSAGE-4.
           STRING "MASTER SCHEDULE " PM-SCHEDULE-KEY
               " HAS BEEN CHANGED." DELIMITED BY SIZE
                               INTO MESSAGE-4.
           MOVE "WORKORDER MUST BE RE-SCHEDULED (REINITIATED)."
                               TO MESSAGE-5.

       SELECT-MESSAGE-5.
           MOVE "WORKORDER HAS BEEN AUTOMATICALLY REINITIATED."
                               TO MESSAGE-4.

       SELECT-MESSAGE-6.
           MOVE "WORKORDER SCHEDULE WILL EXPIRE IN 100 DAYS."
                               TO MESSAGE-4.
           MOVE "WORKORDER MUST BE RE-SCHEDULED (REINITIATED)."
                               TO MESSAGE-5.

       GET-WHO-LOOP.
           MOVE CNUM-BUF       TO PERCCNUM OF PM-MASTER-FILE.
           READ PM-MASTER-FILE INTO PM-MASTER-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO GWL-EXIT.

           IF MSG-SW = "1"
               IF MSGSW1 = "XX"
                   NEXT SENTENCE
               ELSE
                   GO TO GWL-EXIT
           ELSE
           IF MSG-SW = "2"
               IF MSGSW2 = "XX"
                   NEXT SENTENCE
               ELSE
                   GO TO GWL-EXIT
           ELSE
           IF MSG-SW = "3"
               IF MSGSW3 = "XX"
                   NEXT SENTENCE
               ELSE
                   GO TO GWL-EXIT
           ELSE
           IF MSG-SW = "4"
               IF MSGSW4 = "XX"
                   NEXT SENTENCE
               ELSE
                   GO TO GWL-EXIT
           ELSE
           IF MSG-SW = "5"
               IF MSGSW5 = "XX"
                   NEXT SENTENCE
               ELSE
                   GO TO GWL-EXIT
           ELSE
           IF MSG-SW = "6"
               IF MSGSW6 = "XX"
                   NEXT SENTENCE
               ELSE
                   GO TO GWL-EXIT
           ELSE
               GO TO GWL-EXIT.

           MOVE CNUM-BUF       TO TO-CC.
           PERFORM WRITE-MESSAGE.

       GWL-EXIT.               EXIT.

       WRITE-MESSAGE.
           MOVE "A"            TO ACD-SW.
           CALL "TUPDATEM"     USING
                               MESSAGE-DATA
                               ACD-SW
                               ERROR-MESSAGE.
      *
      *    IF RETURN-ERROR NOT = SPACES
      *        STRING "CALLING PROGRAM:  SPMWRTMS "
      *               "ERROR IN PROGRAM TUPDATEM  "
      *        DELIMITED BY SIZE INTO RETURN-ERROR
      *        MOVE 1          TO   RET-CODE
      *        GO TO CLOSE-EXIT.

      *******************  END OF PROGRAM  -  SPMWRTMS  *****************
