000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.  SPOHTDL.
000500 AUTHOR.      KURT MOVSESIAN/JIM COFFMAN (MAINTAINER).
000800
000900******************************************************
001000*                                                    *
001100*   S P O H T D L                                    *
001200*                                                    *
001300*D  THIS SUB PROGRAM DELETES PO INFORMATION OUT      *
001400*D  OF THE STORES HISTORY DATA BASE 'STHIST'         *
001500*                                                    *
001600******************************************************
001700*   N O T E    T H I S   S U B R O U T I N E   I S   *
001800*         C A L L E D    B Y :                       *
001900*      1. SPOHIST                                    *
002000******************************************************
      *C 02/21/94  JEFF BUNGO  REQ #6449
      *C   ADDED NEW FIELDS TO HISTORY DATABASES TO MATCH
      *C   THE LIVE DATABASES.  CHANGED/RECOMPILED THIS PROGRAM
      *C   TO USE THE NEW FIELDS IN HISTORY.
      *C
      *C 07/22/96  CA YODER
      *C   RE-COMPILED PROGRAM TO PICK UP CENTURY DATABASE CHANGES.

002100
002200
002300
002400 ENVIRONMENT DIVISION.
002500 CONFIGURATION SECTION.
002600 SOURCE-COMPUTER.  HP-3000.
002700 OBJECT-COMPUTER.  HP-3000.
       SPECIAL-NAMES.  I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
012800
012900 INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT DPORECDH-O
                  ASSIGN TO DATABASE-MCFLST0301
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPORECDH-I
                  ASSIGN TO DATABASE-MCFLST0302
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPOITEMH-O
                  ASSIGN TO DATABASE-MCFLST0401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPODESCH-O
                  ASSIGN TO DATABASE-MCFLST0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DVENDORH-O
                  ASSIGN TO DATABASE-MCFLST0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPOFREIGHTH-O
                  ASSIGN TO DATABASE-MCFLST0701
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DRCVITEMH-O
                  ASSIGN TO DATABASE-MCFLST0601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DINVRCDH-O
                  ASSIGN TO DATABASE-MCFLST0802
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DINVITMH-O
                  ASSIGN TO DATABASE-MCFLST0901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DINVACCTH-O
                  ASSIGN TO DATABASE-MCFLST1001
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DRCVCORRH-O
                  ASSIGN TO DATABASE-MCFLST5401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  DPORECDH-O
           LABEL RECORDS ARE STANDARD.
       01  DPORECDH-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLST0301.

       FD  DPORECDH-I
           LABEL RECORDS ARE STANDARD.
       01  DPORECDH-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLST0302.

       FD  DPOITEMH-O
           LABEL RECORDS ARE STANDARD.
       01  DPOITEMH-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLST0401.

       FD  DPODESCH-O
           LABEL RECORDS ARE STANDARD.
       01  DPODESCH-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLST0501.

       FD  DVENDORH-O
           LABEL RECORDS ARE STANDARD.
       01  DVENDORH-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLST0201.

       FD  DPOFREIGHTH-O
           LABEL RECORDS ARE STANDARD.
       01  DPOFREIGHTH-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLST0701.

       FD  DRCVITEMH-O
           LABEL RECORDS ARE STANDARD.
       01  DRCVITEMH-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLST0601.

       FD  DINVRCDH-O
           LABEL RECORDS ARE STANDARD.
       01  DINVRCDH-REC-O.
           COPY DDS-ALL-FORMATS OF MCFLST0802.

       FD  DINVITMH-O
           LABEL RECORDS ARE STANDARD.
       01  DINVITMH-REC-O.
           COPY DDS-ALL-FORMATS OF MCFLST0901.

       FD  DINVACCTH-O
           LABEL RECORDS ARE STANDARD.
       01  DINVACCTH-REC-O.
           COPY DDS-ALL-FORMATS OF MCFLST1001.

       FD  DRCVCORRH-O
           LABEL RECORDS ARE STANDARD.
       01  DRCVCORRH-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLST5401.

003800 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
003700
003800 01  WORK-AREA.
003900     05  SAVE-LAST-RCVR         PIC 9(3)  VALUE ZEROS.
004000
004100**************************************************************
004200**************************************************************
004300**                                                          **
004400**                DATABASE I/O BUFFER AREA                  **
004500**                                                          **
004600**************************************************************
004700**************************************************************
004800
004900
005000************************************************
005100*                                              *
005200*   I/O BUFFERS FOR STORES HISTORY DATA BASE   *
005300*                                              *
005400************************************************
005500
005600 COPY DPORECDH IN COPYLIB.
005700
005800 COPY DPOITEMH IN COPYLIB.
005900
006000 COPY DPODESCH IN COPYLIB.
006100
006200 COPY DRCVITMH IN COPYLIB.
006300
006400 COPY DPOFRTH IN COPYLIB.
006500
006600 COPY DINVRCDH IN COPYLIB.
006700
006800 COPY DINVITMH IN COPYLIB.
006900
007000 COPY DINVACTH IN COPYLIB.
007100
007200 COPY DVENDORH IN COPYLIB.

       COPY DRCVCORH IN COPYLIB.
007300
007400*********************
007500*                   *
007600*   DATA SET NAMES  *
007700*                   *
007800*********************
007900
008000 01  DSET-NAMES.
008100     05  DSET-NAME              PIC X(16)  VALUE SPACES.
008200     05  DSET-DPORECD           PIC X(16)  VALUE "DPORECD;".
008300     05  DSET-DPOITEM           PIC X(16)  VALUE "DPOITEM;".
008400     05  DSET-DPOFREIGHT        PIC X(16)  VALUE "DPOFREIGHT;".
008500     05  DSET-DINVRCD           PIC X(16)  VALUE "DINVRCD;".
008600     05  DSET-DINVITM           PIC X(16)  VALUE "DINVITM;".
008700     05  DSET-DINVACCT          PIC X(16)  VALUE "DINVACCT;".
008800     05  DSET-DVENDOR           PIC X(16)  VALUE "DVENDOR;".
008900
009000********* DSET NAMES FOR STORES HISTORY 'STHIST'
009100
009200     05  DSET-DPODESC-H         PIC X(16)  VALUE "DPODESC;".
009300     05  DSET-DRCVITEM-H        PIC X(16)  VALUE "DRCVITEM;".
009400
009800 COPY DBSTAT IN COPYLIB.
009900
010000 01 ITEMS-LISTING.
010100     05  ALL-ITEMS              PIC XX    VALUE "@;".
010200     05  PO-SEARCH              PIC X(10) VALUE "PO-RCV-NO;".
010300     05  VEN-SEARCH             PIC X(10) VALUE "VEN-CODE;".
010400     05  REG-SEARCH             PIC X(16)
010500                                VALUE "REGISTER-NUMBER;".
010600
010700 01  ARG-VALUES.
010800     05  PO-ARG                 PIC X(14) VALUE SPACES.
010900     05  VEN-ARG                PIC X(10) VALUE SPACES.
011000     05  REGISTER-ARG           PIC X(6)  VALUE SPACES.
011100     05  RCVR-ARG.
011200         10  RCVR-PO-NUM        PIC X(7)  VALUE SPACES.
011300         10  RCVR-PO-REL        PIC X(3)  VALUE SPACES.
011400         10  RCVR-PO-RCVR       PIC 9(3)  VALUE ZEROS.
011500         10  RCVR-DUP-ID        PIC X     VALUE SPACES.
011600
011700
012400 COPY TDATECHK IN COPYLIB.
012500
012600 COPY TBLOWUP IN COPYLIB.
012700
012800 LINKAGE SECTION.
012900
013000 01  BASE-STHIST      PIC X(10).
013100
013200 01  BUILD-PO-NUMBER.
013300     05  BUILD-PO-NUM           PIC X(7).
013400     05  BUILD-PO-REL           PIC X(3).
013500     05  BUILD-PO-RCVR          PIC 9(3).
013600     05  BUILD-PO-DUP-ID        PIC 9.
013700
013800
013900 PROCEDURE DIVISION USING  BASE-STHIST,
014000                           BUILD-PO-NUMBER.
014100
014200
014300
014400 PO-HISTORY-DELETE SECTION 15.
       BEGIN-HERE.
           OPEN I-O DPORECDH-O, DPOITEMH-O, DPODESCH-O, DVENDORH-O,
                    DPOFREIGHTH-O, DRCVITEMH-O, DINVRCDH-O, DINVITMH-O,
                    DINVACCTH-O, DRCVCORRH-O.
           OPEN INPUT DPORECDH-I.

014500
014600     PERFORM 6-MAIN  THRU  6-MAIN-X.
014700
           CLOSE DPORECDH-O, DPOITEMH-O, DPODESCH-O, DVENDORH-O,
                 DPOFREIGHTH-O, DRCVITEMH-O, DINVRCDH-O, DINVITMH-O,
                 DINVACCTH-O, DPORECDH-I, DRCVCORRH-O.
014800     GOBACK.
014900
015000
015100
015200******************************************************
015300**                                                  **
015400**   BLOWUP ROUTINE                                 **
015500**                                                  **
015600******************************************************
015700
015800 2-BLOWUP.
015900     MOVE "SPOHTDL"  TO BU-PGM-NAME.
016000     CALL "TBLOWUP" USING BASE-STHIST, BU-PGM-NAME, STATUS-AREA,
016100         DUMMY-VIEW-AREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
016200             BU-DISPLAY-FLDS.
016300
016400
016500
016600 6-MAIN.
017600     MOVE BUILD-PO-NUMBER       TO  PO-ARG,
017700                                    BU-DISPLAY-FLD (1).
018300
018400     PERFORM 62-DELETE-PO-HISTORY  THRU  62-DPH-X.
018500
018600     PERFORM 63-DELETE-RECEIVING-HISTORY  THRU  63-DRH-X.
018700
018800     PERFORM 64-DELETE-INVOICING-HISTORY  THRU  64-DIH-X.
019500
019600 6-MAIN-X.
019700     EXIT.
019800
019900
020000
020100 62-DELETE-PO-HISTORY.
           MOVE ZEROS TO SAVE-LAST-RCVR.
021100     MOVE SPACES   TO  BUF-DPORECD-H.

           MOVE PO-ARG TO PORCVNO OF DPORECDH-REC-O.
           START DPORECDH-O KEY = PORCVNO OF DPORECDH-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 62-DELETE-ITEMS
               ELSE
                   MOVE "START DPORECDH *62-DPH" TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP.
021000
           MOVE 0 TO COND-WORD.
           READ DPORECDH-O NEXT INTO BUF-DPORECD-H
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPORECDH-REC-O NOT = PO-ARG
               MOVE 15 TO COND-WORD.
021200*A   CALL "DBGET" USING BASE-STHIST, DSET-DPORECD, MODE5,
021300*A         STATUS-AREA, ALL-ITEMS, BUF-DPORECD-H, PO-ARG.
021400     IF COND-WORD NOT = 0
021500         IF COND-WORD = 15
021600             GO TO 62-DELETE-ITEMS
021700         ELSE
021800             MOVE "GET DPORECD*62-DPH" TO BU-DISPLAY-MSG
021900             GO TO 2-BLOWUP.
022000
022100     MOVE POH-LAST-RCVR         TO  SAVE-LAST-RCVR.
022200
022300 62-DELETE-HEADER.
           DELETE DPORECDH-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
022700         MOVE "DELETE DPORECD*62-DH" TO BU-DISPLAY-MSG
022800         GO TO 2-BLOWUP.
022900
023000 62-DELETE-ITEMS.
023100     PERFORM 621-DELETE-PO-ITEMS  THRU  621-DPI-X.
023200
023300     PERFORM 622-DELETE-VENDOR-NAME  THRU  622-DVN-X.
023400
023500 62-DPH-X.
023600     EXIT.
023700
023800
023900 621-DELETE-PO-ITEMS.
           MOVE PO-ARG TO PORCVNO OF DPOITEMH-REC-O.
           START DPOITEMH-O KEY = PORCVNO OF DPOITEMH-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
024400             GO TO 621-DPI-X
024500         ELSE
024600             MOVE "FIND DPOITEM * 621-DPI" TO BU-DISPLAY-MSG
024700             GO TO 2-BLOWUP.
024800
024900 621-GET-DPOITEM.
           MOVE 0 TO COND-WORD.
           READ DPOITEMH-O NEXT INTO BUF-DPOITEM-H
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPOITEMH-REC-O NOT = PO-ARG
               MOVE 15 TO COND-WORD.
025000*A   CALL "DBGET" USING BASE-STHIST, DSET-DPOITEM, MODE5,
025100*A         STATUS-AREA, ALL-ITEMS, BUF-DPOITEM-H, PO-ARG.
025200     IF COND-WORD NOT = 0
025300         IF COND-WORD = 15
025400             GO TO 621-FIND-DPODESC
025500         ELSE
025600             MOVE "GET DPOITEM*621-GD" TO BU-DISPLAY-MSG
025700             GO TO 2-BLOWUP.
025800
025900
026000 621-DELETE-DPOITEM.
           DELETE DPOITEMH-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
026400         MOVE "DELETE DPOITEM*621-DD" TO BU-DISPLAY-MSG
026500         GO TO 2-BLOWUP.
026600
026700     GO TO 621-GET-DPOITEM.
026800
026900 621-FIND-DPODESC.
           MOVE PO-ARG TO PORCVNO OF DPODESCH-REC-O.
           START DPODESCH-O KEY = PORCVNO OF DPODESCH-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
027400             GO TO 621-DPI-X
027500         ELSE
027600             MOVE "FIND DPODESC*621-FD" TO BU-DISPLAY-MSG
027700             GO TO 2-BLOWUP.
027800
027900 621-GET-DPODESC.
           MOVE 0 TO COND-WORD.
           READ DPODESCH-O NEXT INTO BUF-DPODESC-H
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPODESCH-REC-O NOT = PO-ARG
               MOVE 15 TO COND-WORD.
028000*A   CALL "DBGET" USING BASE-STHIST, DSET-DPODESC-H, MODE5,
028100*A       STATUS-AREA, ALL-ITEMS, BUF-DPODESC-H, PO-ARG.
028200     IF COND-WORD NOT = 0
028300         IF COND-WORD = 15
028400             GO TO 621-DPI-X
028500         ELSE
028600             MOVE "GET DPODESC*621-GD" TO BU-DISPLAY-MSG
028700             GO TO 2-BLOWUP.
028800
028900 621-DELETE-DPODESC.
           DELETE DPODESCH-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
029300         MOVE "DELETE DPODESC*621-PD" TO BU-DISPLAY-MSG
029400         GO TO 2-BLOWUP.
029500
029600     GO TO 621-GET-DPODESC.
029700
029800 621-DPI-X.
029900     EXIT.
030000
030100
030200 622-DELETE-VENDOR-NAME.
030300     MOVE POH-VEN-CODE          TO  VEN-ARG.
           MOVE VEN-ARG TO VENCDE OF DPORECDH-REC-I.
           START DPORECDH-I KEY = VENCDE OF DPORECDH-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
030800             NEXT SENTENCE
030900         ELSE
031000             MOVE "FIND DPORECD*622-DVN" TO BU-DISPLAY-MSG
031100             GO TO 2-BLOWUP
           ELSE
               GO TO 622-DVN-X.

           MOVE VEN-ARG TO VENCDE OF DVENDORH-REC-O.
           START DVENDORH-O KEY = VENCDE OF DVENDORH-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 622-DVN-X
               ELSE
032000             MOVE "FIND DVENDOR * 622-DVN" TO BU-DISPLAY-MSG
032100             GO TO 2-BLOWUP.
032200
032300 622-GET-DVENDOR.
           MOVE 0 TO COND-WORD.
           READ DVENDORH-O NEXT INTO BUF-DVENDOR-H
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF VENCDE OF DVENDORH-REC-O NOT = VEN-ARG
               MOVE 15 TO COND-WORD.
032400*A   CALL "DBGET" USING BASE-STHIST, DSET-DVENDOR, MODE5,
032500*A         STATUS-AREA, ALL-ITEMS, BUF-DVENDOR-H, VEN-ARG.
032600     IF COND-WORD NOT = 0
032700         IF COND-WORD = 15
032800             GO TO 622-DVN-X
032900         ELSE
033000             MOVE "GET DVENDOR*622-GD" TO BU-DISPLAY-MSG
033100             GO TO 2-BLOWUP.
033200
033300
033400 622-DELETE-DVENDOR.
           DELETE DVENDORH-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
033800         MOVE "PUT DVENDOR*622-PD" TO BU-DISPLAY-MSG
033900         GO TO 2-BLOWUP.
034000
034100     GO TO 622-GET-DVENDOR.
034200
034300 622-DVN-X.
034400     EXIT.
034500
034600
034700
034800
034900 63-DELETE-RECEIVING-HISTORY.
035000     MOVE BUILD-PO-NUMBER       TO  RCVR-ARG.
035100
035200****** LOAD ALL FREIGHT BILLS FOUND UNDER THE PO NUMBER KEY
035300****** SINCE THESE FREIGHT BILLS CAN BE PUT OUT BY THE INVOICE
035400****** PROCESSING PROGRAM.
035500
035600     PERFORM 631-DELETE-FREIGHT-INFO  THRU  631-DFI-X.
035700
035800 63-DELETE-RCVR-LOOP.
035900     IF SAVE-LAST-RCVR = RCVR-PO-RCVR
036000         GO TO 63-DRH-X.
036100     ADD 1  TO  RCVR-PO-RCVR.
036200     PERFORM 631-DELETE-FREIGHT-INFO  THRU  631-DFI-X.
036300
036400******** LOAD RECEIVING SLIP ITEMS
036500
036600     PERFORM 632-DELETE-RCV-SLIP  THRU  632-DRS-X.
036700
036800     GO TO 63-DELETE-RCVR-LOOP.
036900
037000 63-DRH-X.
037100     EXIT.
037200
037300 631-DELETE-FREIGHT-INFO.
           MOVE RCVR-ARG TO PORCVNO OF DPOFREIGHTH-REC-O.
           START DPOFREIGHTH-O KEY = PORCVNO OF DPOFREIGHTH-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
037800             GO TO 631-DFI-X
037900         ELSE
038000             MOVE "FIND DPOFREIGHT * 631-DFI" TO BU-DISPLAY-MSG
038100             GO TO 2-BLOWUP.
038200
038300 631-GET-FREIGHT-LOOP.
           MOVE 0 TO COND-WORD.
           READ DPOFREIGHTH-O NEXT INTO BUF-DPOFREIGHT-H
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPOFREIGHTH-REC-O NOT = RCVR-ARG
               MOVE 15 TO COND-WORD.
038400*A   CALL "DBGET" USING BASE-STHIST, DSET-DPOFREIGHT, MODE5,
038500*A         STATUS-AREA, ALL-ITEMS, BUF-DPOFREIGHT-H, RCVR-ARG.
038600     IF COND-WORD NOT = 0
038700         IF COND-WORD = 15
038800             GO TO 631-DFI-X
038900         ELSE
039000             MOVE "GET DPOFREIGHT*631-GFL" TO BU-DISPLAY-MSG
039100             GO TO 2-BLOWUP.
039200
039300 631-DELETE-FREIGHT.
           DELETE DPOFREIGHTH-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
039700         MOVE "DELETE DPOFREIGHT*631-DF" TO BU-DISPLAY-MSG
039800         GO TO 2-BLOWUP.
039900
040000     GO TO 631-GET-FREIGHT-LOOP.
040100
040200 631-DFI-X.
040300     EXIT.
040400
040500 632-DELETE-RCV-SLIP.
           MOVE RCVR-ARG TO PORCVNO OF DRCVITEMH-REC-O.
           START DRCVITEMH-O KEY = PORCVNO OF DRCVITEMH-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
041000             GO TO 632-DRS-X
041100         ELSE
041200             MOVE "FIND DRCVITEM * 632-DRS" TO BU-DISPLAY-MSG
041300             GO TO 2-BLOWUP.
041400
041500 632-GET-RCVR-ITEM-LOOP.
           MOVE 0 TO COND-WORD.
           READ DRCVITEMH-O NEXT INTO BUF-DRCVITEM-H
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DRCVITEMH-REC-O NOT = RCVR-ARG
               MOVE 15 TO COND-WORD.
041600*A   CALL "DBGET" USING BASE-STHIST, DSET-DRCVITEM-H, MODE5,
041700*A         STATUS-AREA, ALL-ITEMS, BUF-DRCVITEM-H, RCVR-ARG.
041800     IF COND-WORD NOT = 0
041900         IF COND-WORD = 15
042000             GO TO 632-DELETE-RCVR-DESC
042100         ELSE
042200             MOVE "GET DRCVITEM*632-GRIL" TO BU-DISPLAY-MSG
042300             GO TO 2-BLOWUP.
042400
042500 632-DELETE-RCVR-ITEM.
           DELETE DRCVITEMH-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
042900         MOVE "DELETE DRCVITEM*632-PDC" TO BU-DISPLAY-MSG
043000         GO TO 2-BLOWUP.
043100
043200     GO TO 632-GET-RCVR-ITEM-LOOP.
043300
043400 632-DELETE-RCVR-DESC.
           MOVE RCVR-ARG TO PORCVNO OF DPODESCH-REC-O.
           START DPODESCH-O KEY = PORCVNO OF DPODESCH-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
043900             GO TO 632-DELETE-RCVR-CORRECTIONS
044000         ELSE
044100             MOVE "FIND DPODESC * 632-DRD" TO BU-DISPLAY-MSG
044200             GO TO 2-BLOWUP.
044300
044400 632-GET-RCVR-DESC.
           MOVE 0 TO COND-WORD.
           READ DPODESCH-O NEXT INTO BUF-DPODESC-H
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPODESCH-REC-O NOT = RCVR-ARG
               MOVE 15 TO COND-WORD.
044500*A   CALL "DBGET" USING BASE-STHIST, DSET-DPODESC-H, MODE5,
044600*A         STATUS-AREA, ALL-ITEMS, BUF-DPODESC-H, RCVR-ARG.
044700     IF COND-WORD NOT = 0
044800         IF COND-WORD = 15
044900             GO TO 632-DELETE-RCVR-CORRECTIONS
045000         ELSE
045100             MOVE "GET DPODESC*632-GRD" TO BU-DISPLAY-MSG
045200             GO TO 2-BLOWUP.
045300
045400 632-DELETE-DPODESC.
           DELETE DPODESCH-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
045800         MOVE "DELETE DPODESC*632-DD" TO BU-DISPLAY-MSG
045900         GO TO 2-BLOWUP.
046000
046100     GO TO 632-GET-RCVR-DESC.

       632-DELETE-RCVR-CORRECTIONS.
           MOVE RCVR-ARG TO PORCVNO OF DRCVCORRH-REC-O.
           START DRCVCORRH-O KEY = PORCVNO OF DRCVCORRH-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
043900             GO TO 632-DRS-X
044000         ELSE
044100             MOVE "FIND DRCVCORRH * 632-DRC" TO BU-DISPLAY-MSG
044200             GO TO 2-BLOWUP.
044300
044400 632-GET-RCVR-CORRECTIONS.
           MOVE 0 TO COND-WORD.
           READ DRCVCORRH-O NEXT INTO BUF-DRCVCORR-H
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DRCVCORRH-REC-O NOT = RCVR-ARG
               MOVE 15 TO COND-WORD.
044700     IF COND-WORD NOT = 0
044800         IF COND-WORD = 15
044900             GO TO 632-DRS-X
045000         ELSE
045100             MOVE "GET DRCVCORRH*632-GRD" TO BU-DISPLAY-MSG
045200             GO TO 2-BLOWUP.
045300
045400 632-DELETE-DRCVCORRH.
           DELETE DRCVCORRH-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
045800         MOVE "DELETE DRCVCORRH*632-DD" TO BU-DISPLAY-MSG
045900         GO TO 2-BLOWUP.
046000
046100     GO TO 632-GET-RCVR-CORRECTIONS.

046200
046300 632-DRS-X.
046400     EXIT.
046500
046600
046700
046800 64-DELETE-INVOICING-HISTORY.
           MOVE PO-ARG TO PORCVNO OF DINVRCDH-REC-O.
           START DINVRCDH-O KEY = PORCVNO OF DINVRCDH-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
047300             GO TO 64-DIH-X
047400         ELSE
047500             MOVE "FIND DINVRCD * 64-DIH" TO BU-DISPLAY-MSG
047600             GO TO 2-BLOWUP.
047700
047800 64-GET-DINVRCD.
           MOVE 0 TO COND-WORD.
           READ DINVRCDH-O NEXT INTO BUF-DINVRCD-H
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DINVRCDH-REC-O NOT = PO-ARG
               MOVE 15 TO COND-WORD.
047900*A   CALL "DBGET" USING BASE-STHIST, DSET-DINVRCD, MODE5,
048000*A         STATUS-AREA, ALL-ITEMS, BUF-DINVRCD-H, PO-ARG.
048100     IF COND-WORD NOT = 0
048200         IF COND-WORD = 15
048300             GO TO 64-DIH-X
048400         ELSE
048500             MOVE "GET DINVRCD*64-GD" TO BU-DISPLAY-MSG
048600             GO TO 2-BLOWUP.
048700
048800
048900 64-DELETE-DINVRCD.
           DELETE DINVRCDH-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
049300         MOVE "DELETE DINVRCD*64-DD" TO BU-DISPLAY-MSG
049400         GO TO 2-BLOWUP.
049500
049600     MOVE INVH-REG-NO           TO  REGISTER-ARG.
049700     PERFORM 641-DELETE-ITEMS-INFO  THRU  641-DII-X.
049800
049900     PERFORM 642-DELETE-ITEM-ACCT-INFO  THRU  642-DIAI-X.
050000
050100     GO TO 64-GET-DINVRCD.
050200
050300 64-DIH-X.
050400     EXIT.
050500
050600 641-DELETE-ITEMS-INFO.
           MOVE REGISTER-ARG TO REGISTERNO OF DINVITMH-REC-O.
           START DINVITMH-O KEY = REGISTERNO OF DINVITMH-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
051100             GO TO 641-DII-X
051200         ELSE
051300             MOVE "FIND DINVITM * 641-DII" TO BU-DISPLAY-MSG
051400             GO TO 2-BLOWUP.
051500
051600 641-GET-DINVITM.
           MOVE 0 TO COND-WORD.
           READ DINVITMH-O NEXT INTO BUF-DINVITM-H
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF REGISTERNO OF DINVITMH-REC-O NOT = REGISTER-ARG
               MOVE 15 TO COND-WORD.
051700*A   CALL "DBGET" USING BASE-STHIST, DSET-DINVITM, MODE5,
051800*A         STATUS-AREA, ALL-ITEMS, BUF-DINVITM-H, REGISTER-ARG.
051900     IF COND-WORD NOT = 0
052000         IF COND-WORD = 15
052100             GO TO 641-DII-X
052200         ELSE
052300             MOVE "GET DINVITM*641-GD" TO BU-DISPLAY-MSG
052400             GO TO 2-BLOWUP.
052500
052600*****************************************************
052700**   CHECK TO MAKE SURE REGISTER ITEM IS TIED TO
052800**   THE CORRECT PO.
052900*****************************************************
053000
053100     IF INVITMH-PO-NUM = INVH-PO-RLSE
053200         NEXT SENTENCE
053300     ELSE
053400         GO TO 641-GET-DINVITM.
053500
           DELETE DINVITMH-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
053900         MOVE "DELETE DINVITM*641-DD" TO BU-DISPLAY-MSG
054000         GO TO 2-BLOWUP.
054100
054200     GO TO 641-GET-DINVITM.
054300
054400 641-DII-X.
054500     EXIT.
054600
054700 642-DELETE-ITEM-ACCT-INFO.
           MOVE REGISTER-ARG TO REGISTERNO OF DINVACCTH-REC-O.
           START DINVACCTH-O KEY = REGISTERNO OF DINVACCTH-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
055200             GO TO 642-DIAI-X
055300         ELSE
055400             MOVE "FIND DINVACCT * 642-DIAI" TO BU-DISPLAY-MSG
055500             GO TO 2-BLOWUP.
055600
055700 642-GET-DINVACCT.
           MOVE 0 TO COND-WORD.
           READ DINVACCTH-O NEXT INTO BUF-DINVACCT-H
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF REGISTERNO OF DINVACCTH-REC-O NOT = REGISTER-ARG
               MOVE 15 TO COND-WORD.
055800*A   CALL "DBGET" USING BASE-STHIST, DSET-DINVACCT, MODE5,
055900*A         STATUS-AREA, ALL-ITEMS, BUF-DINVACCT-H, REGISTER-ARG.
056000     IF COND-WORD NOT = 0
056100         IF COND-WORD = 15
056200             GO TO 642-DIAI-X
056300         ELSE
056400             MOVE "GET DINVACCT*642-GD" TO BU-DISPLAY-MSG
056500             GO TO 2-BLOWUP.
056600
056700*****************************************************
056800**   CHECK TO MAKE SURE REGISTER ITEM IS TIED TO
056900**   THE CORRECT PO.
057000*****************************************************
057100
057200     IF INVACCTH-PO-NUM = INVH-PO-RLSE
057300         NEXT SENTENCE
057400     ELSE
057500         GO TO 642-GET-DINVACCT.
057600
           DELETE DINVACCTH-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
058000         MOVE "DELETE DINVACCT*642-DD" TO BU-DISPLAY-MSG
058100         GO TO 2-BLOWUP.
058200
058300     GO TO 642-GET-DINVACCT.
058400
058500 642-DIAI-X.
058600     EXIT.
