000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    SPOHCHK.
000400 AUTHOR.        MOVSESIAN/JIM COFFMAN (MAINTAINER).
000500 DATE-WRITTEN.  APRIL 7, 1988.
000700
000900**************************************************************
001000*                                                            *
001100*   S P O H C H K    PURCHASE ORDER HISTORY DELETION DATE    *
001200*    CHECK.  THIS PROGRAM CHECKS THE HISTORY DATA BASE TO    *
001300*    SEE IF A PURCHASE ORDERS BEEN DELETED.  THE DATA SET    *
001400*    'DPODELETE' CONTAINS THE PO NUMBER AND DELETE DATE      *
001500*    FROM THE HISTORY DATA BASE.  IF PO NUMBER IS FOUND      *
001600*    A SCREEN IS DISPLAYED SHOWING THE PO NUMBER AND         *
001700*    DELETION DATE SO THE USER CAN REQUEST THE CORRECT       *
001800*    TAPE OF DELETED ORDERS FROM DATA PROCESSING.            *
001900*                                                            *
      **************************************************************

      *****************************************************************
      **          M O D I F I C A T I O N    H I S T O R Y
      *****************************************************************
      *C MAR 10, 2005  D.RAUCH       DCR01    REQUEST# 2005-78515
      *C    DISPLAY FILE PROCESSING CHANGED FROM USING ZCSISINQ
      *C    NEW DISPLAY FILE ZSPOHCHK  CREATED - FORMATS COPIED
      *C    FROM ZCSISINQ.
      *C---------------------------------------------------------------
      *C MMM DD, CCYY  XXXNAMEXXX    XXX01    REQUEST# 2005-XXXXX
      *C    XXXXXXXXXXXXXXXXXX DESC XXXXXXXXXXXXXXXXXXXXXXXXXXXXX
      *****************************************************************
002200
002300 ENVIRONMENT DIVISION.
002400 CONFIGURATION SECTION.
002500 SOURCE-COMPUTER.    HP-3000.
002600 OBJECT-COMPUTER.    HP-3000.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

002700 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZSPOHCHK-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

           SELECT DPODELETE-I
                  ASSIGN TO DATABASE-MCFLST1101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

002800
002900 DATA DIVISION.
       FILE SECTION.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
DCR01  01  DISPLAY-REC             PIC X(2000).

       FD  DPODELETE-I
           LABEL RECORDS ARE STANDARD.
       01  DPODELETE-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLST1101.

003000
003100 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
003200
003300 77  FATAL-ERR-SW                 PIC X            VALUE "N".
003400 77  SUB                          PIC S9(4) COMP-4 VALUE ZEROS.
003500
003600 01  MESSAGE-BUFFER.
003700     05  MSG-TEXT              PIC X(68)    VALUE SPACE.
003800     05  MSG-FLD               PIC X(8)     VALUE SPACE.
003900     05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC ZZZZZZZ9.
004000
004300 01  FIELD-NUMBER              PIC S9(4)    VALUE 1   COMP-4.
004400
004500************************************************************
004600**             S C R E E N   B U F F E R S                **
004700************************************************************
004800
004900 01  SCREEN-1.
005000     05  DE1-COMPANY-CODE         PIC X(3).
005100     05  DE1-PO-NUMBER            PIC X(10).
005200     05  DE1-PO-TABLE OCCURS 8 TIMES.
005300         10  DE1-PO-DELETE-DATE   PIC X(8).
           05  DE1-COMMAND-LINE         PIC X(79).
           05  DE1-MESSAGE-LINE         PIC X(79).
005400
       COPY DISPDATA IN COPYLIB.

       COPY IOFEEDBACK IN COPYLIB.

       COPY CATREAD IN COPYLIB.

005500*************************************************************
005600*                  DATABASE AREAS                           *
005700*************************************************************
005800
005900 COPY DBSTAT     IN COPYLIB.
006000
006500 01  DATASET-NAMES.
006600     05  DSET-NAME             PIC X(16)    VALUE SPACE.
006700     05  DSET-DPODELETE        PIC X(16)    VALUE "DPODELETE;".
006800
006900 01  ITEMS-LISTING.
007000     05  ALL-ITEMS             PIC X(2)     VALUE "@;".
007100     05  PO-SEARCH             PIC X(10)    VALUE "PO-RCV-NO;".
007300
007400*************************************************************
007500**             D A T A B A S E   B U F F E R S             **
007600*************************************************************
007700 COPY DPODELET   IN COPYLIB.
007800
008400********************************
008500**   PARAMETERS FOR CALLING   **
008600**   'TDATECHK'               **
008700********************************
008800
008900 COPY TDATECHK IN COPYLIB.
009000
       COPY CCHKOBJ IN COPYLIB.

009100*************************************************************
009200**          E R R O R   M E S S A G E   A R E A S          **
009300*************************************************************
009400 COPY TBLOWUP    IN COPYLIB.
009500
009600 LINKAGE SECTION.
009700
009800 01  BASE                         PIC X(10).
009900
010000 01  BASE-STHIST.
010100     05  BASE-STHIST-OPEN-INDIC   PIC X(2).
010200     05  BASE-STHIST-NAME         PIC X(8).
010300
010400 01  PO-ARG                       PIC X(14).
010500
010600 COPY SPOHCHK IN COPYLIB.
010700
010800 COPY VCOMLINK   IN COPYLIB.
010900
011000*************************************************************
011100**                                                         **
011200**      S C R E E N   P R I N T   P A R A M E T E R S      **
011300**                                                         **
011400*************************************************************
011500
011600 01  SCREEN-PRINT-PARMS.
011700     05  PRINT-CTL             PIC S9(4)    COMP-4.
011800     05  PAGE-CTL              PIC S9(4)    COMP-4.
011900     05  SPOOLFIL-OPEN-SW      PIC X.
012000
012100 01  PASS-SPOOL-PRT-NO         PIC S9(2)    COMP-4.
012200
012300 COPY LANGSUB    IN COPYLIB.
012400
012500
012600 PROCEDURE DIVISION USING BASE,
012700                          BASE-STHIST,
012800                          PO-ARG,
012900                          SPOHCHK-PARMS,
013000                          VIEW-COMAREA,
013100                          SCREEN-PRINT-PARMS,
013200                          PASS-SPOOL-PRT-NO,
013300                          LANGUAGE-PARMS.
013400
013500
013600 0-BEGIN.
           OPEN I-O DISPLAY-FILE.
013700
013800     PERFORM 6-MAIN  THRU 6-M-X.
013900
           CLOSE DPODELETE-I, DISPLAY-FILE.
014000     GOBACK.
014100
014200************************************************************
014300************************************************************
014400*                    B L O W U P                           *
014500*     CHECK FOR IMAGE, VIEW, OR SPOOL ERROR.  CLOSE        *
014600*     FILES, GET OUT OF BLOCK MODE, AND DISPLAY            *
014700*     APPROPRIATE ERROR MESSAGE ON SCREEN.                 *
014800*                                                          *
014900*     ALSO APPENDS THE ERROR MESSAGE TO A FILE CALLED      *
015000*     BLOWUP.PUB.  TO READ THIS FILE, RUN "XBLPRT.OBJECT". *
015100*                                                          *
015200*         |||  PROGRAM IS ABORTED IN TBLOWUP  |||          *
015300************************************************************
015400************************************************************
015500
015600 2-BLOWUP.
015700     MOVE "SPOHCHK"               TO BU-PGM-NAME.
015800     MOVE PO-ARG                  TO BU-DISPLAY-FLD (1).
           IF FILE-STATUS NUMERIC
               MOVE FILE-STATUS TO COND-WORD.
015900     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
016000           VIEW-COMAREA, FILE-STATUS,  BU-DISPLAY-MSG,
016100               BU-DISPLAY-FLDS.
016200 2-BLOWUP-X.
016300     EXIT.
016400
019100
019200 4-PGM-ERROR.
           MOVE B"1" TO IND (FIELD-NUMBER), IND(99).
           MOVE MESSAGE-BUFFER TO DE1-MESSAGE-LINE.
020000
020100 4-PGM-ERROR-X.
020200     EXIT.
020300
023600
023700**************************************************
023800*                                                *
023900*     6 - M A I N                                *
024000*                                                *
024100**************************************************
024200
024300 6-MAIN.
024400     MOVE SPACES                  TO SPOHCHK-ERR-SW.
024500     PERFORM 60-CHECK-FOR-PO THRU 60-CFP-X.
024600
024700     IF SPOHCHK-ERR-SW = "Y"
024800         NEXT SENTENCE
024900     ELSE
025000         PERFORM 61-PROCESS-SCREEN-1  THRU  61-PS1-X.
025100
025200 6-M-X.
025300     EXIT.
025400
025500*********************************************************
025600**   IF THE HISTORY DATA BASE FIELD IS SET TO 'NO DB'
025700**   THIS MEANS THE PLANT DOESNT HAVE A STHIST DATA BASE
025800**   THEREFORE SET THE ERR SWITCH TO 'Y' AND EXIT
025900**   THE SUBROUTINE.  IF THE DATA BASE ISNT OPEN THEN
026000**   OPEN IT AND THEN CHECK THE DATA SET 'DPODELETE' TO
026100**   SEE IF THE CHAIN LENGTH IS ZERO IS SO THEN THE PO
026200**   NUMBER SUPPLIED HAS NOT BEEN DELETED AND SET THE
026300**   ERROR SWITCH TO 'Y' AND EXIT.
026400********************************************************
026500
026600 60-CHECK-FOR-PO.
026700     IF BASE-STHIST-NAME = "NO DB"
026800         MOVE "Y"                 TO SPOHCHK-ERR-SW
026900     ELSE
027000     IF BASE-STHIST-OPEN-INDIC = SPACES
027100         PERFORM 601-OPEN-HIST-DB
027200         IF BASE-STHIST-NAME = "NO DB"
027300             MOVE "Y"             TO SPOHCHK-ERR-SW.
027400
027500     IF SPOHCHK-ERR-SW = "Y"
027600         NEXT SENTENCE
027700     ELSE
               MOVE PO-ARG TO PORCVNO OF DPODELETE-REC-I
               START DPODELETE-I KEY = PORCVNO OF DPODELETE-REC-I
                  INVALID KEY MOVE FILE-STATUS TO FILE-STATUS END-START
               IF FILE-STATUS NOT = "00"
                   IF FILE-STATUS-1 = "2"
                       MOVE "Y" TO SPOHCHK-ERR-SW
                   ELSE
028400                 MOVE "START DPODELETE *60-CFP" TO BU-DISPLAY-MSG
028500                 GO TO 2-BLOWUP.
027800*A       CALL "DBFIND" USING BASE-STHIST, DSET-DPODELETE, MODE1,
027900*A           STATUS-AREA, PO-SEARCH, PO-ARG
028000*A       IF COND-WORD NOT = 0
028100*A           IF COND-WORD = 17
028200*A               MOVE "Y"         TO SPOHCHK-ERR-SW
028300*A           ELSE
028400*A               MOVE "FIND DPODELETE *60-CFP" TO BU-DISPLAY-MSG
028500*A               GO TO 2-BLOWUP
028600*A       ELSE
028700*A           IF CHAIN-LENG = 0
028800*A               MOVE "Y"         TO SPOHCHK-ERR-SW.
028900
029000 60-CFP-X.
029100     EXIT.
029200
029300
029400 601-OPEN-HIST-DB.
      *    MOVE "MCFLST1101" TO CHKOBJ-FILE-NAME.
      *    CALL "CCHKOBJ" USING CHKOBJ-FILE-NAME,
      *                       CHKOBJ-RETURN-STATUS.
      *    IF CHKOBJ-RETURN-STATUS NOT = "00"
      *         MOVE "NO DB" TO BASE-STHIST-NAME
      *    ELSE
           OPEN INPUT DPODELETE-I.
           IF FILE-STATUS = "90"
                MOVE "NO DB" TO BASE-STHIST-NAME.
030700
030800 61-PROCESS-SCREEN-1.
030900     MOVE "FPOHCHK"               TO  VIEW-NFNAME.
032200
032300     MOVE SPACES                  TO  SCREEN-1.
032400     MOVE SPOHCHK-COMPANY-CODE    TO  DE1-COMPANY-CODE.
032500     MOVE PO-ARG                  TO  DE1-PO-NUMBER.
032600     MOVE ZEROS                   TO  COND-WORD.
032700     PERFORM 611-GET-DPODELETE-ENTRIES
032800         VARYING SUB FROM 1 BY 1
032900             UNTIL END-OF-CHAIN OR
033000                   SUB > 8.
033800
033900 61-SHOWFORM-SCREEN-1.
           MOVE SCREEN-1       TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC    TO SCREEN-1.
034600
034700     IF VIEW-LASTKEY = 3
034800         NEXT SENTENCE
034900     ELSE
035400     IF VIEW-LASTKEY = 1 OR
035500        VIEW-LASTKEY = 2 OR
035600        VIEW-LASTKEY = 4 OR
035700        VIEW-LASTKEY = 5 OR
035800        VIEW-LASTKEY = 6 OR
035900        VIEW-LASTKEY = 7 OR
035900        VIEW-LASTKEY = 8
036100*        "* INVALID FUNCTION KEY ENTERED *"
036200         MOVE   9                 TO LANG-SETNUM
036300         MOVE  10                 TO LANG-MSGNUM
036400         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
036500         MOVE 99                  TO FIELD-NUMBER
036600         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
036700         GO TO 61-SHOWFORM-SCREEN-1.

036900 61-PS1-X.
037000     EXIT.
037100
037200 611-GET-DPODELETE-ENTRIES.
           READ DPODELETE-I NEXT INTO BUF-DPODELETE-H
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPODELETE-REC-I NOT = PO-ARG
               MOVE 15 TO COND-WORD.
037300*A   CALL "DBGET" USING BASE-STHIST, DSET-DPODELETE, MODE5,
037400*A       STATUS-AREA, ALL-ITEMS, BUF-DPODELETE-H, PO-ARG.
037500     IF COND-WORD NOT = 0
037600         IF END-OF-CHAIN
037700             NEXT SENTENCE
037800         ELSE
037900             MOVE "GET DPODELETE * 611-GDE" TO BU-DISPLAY-MSG
038000             GO TO 2-BLOWUP
038100     ELSE
038200         MOVE 4                   TO DATE-MODE
038300         MOVE PODEL-DELETE-DATE   TO DATE-VALIDATE-IN
038400         CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
038500         MOVE DATE-SLASH-OUT      TO DE1-PO-DELETE-DATE (SUB).
038600
038700
       COPY DISPCALL IN COPYLIB.
038800
038900 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
040500 999-CATREAD-EXIT.
040600     EXIT.
