       IDENTIFICATION DIVISION.

       PROGRAM-ID.     SPOMOD2.
       AUTHOR.         EXLTECH, LLC - DAN RAUCH

      *****************************************************************
      **              MAINTAIN ARIBA BUYER PO FIELDS
      **         -----------------------------------------
      ** CURRENTLY THE ONLY MAINTAINABLE FIELDS ON AN ARIBA BUYER PO
      ** ARE:
      **      1) EXPECT DATE ------------>>  DPORECD
      **      2) ??????????? ------------>>  ???????
      **
      *****************************************************************

      *================================================================
       ENVIRONMENT DIVISION.
      *===============================================================
       CONFIGURATION SECTION.

       SOURCE-COMPUTER.       IBM-AS400.
       OBJECT-COMPUTER.       IBM-AS400.
       SPECIAL-NAMES.         LOCAL-DATA LDA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT DISPLAY-FILE  ASSIGN TO WORKSTATION-ZPOMOD2-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS WS-FILE-STATUS
                  CONTROL-AREA IS WS-KEYBOARD-RETURN-AREA.

           SELECT PO-HEADER-FILE ASSIGN TO DATABASE-MCFLCS0901
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS IS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

      *================================================================
       DATA DIVISION.
      *================================================================
       FILE SECTION.

       FD  DISPLAY-FILE.
       01  DISPLAY-REC.
       COPY DDS-ALL-FORMATS OF ZPOMOD2.

       FD  PO-HEADER-FILE.
       01  PO-HEADER-REC.
       COPY DDS-ALL-FORMATS OF MCFLCS0901.
       COPY DPORECD    IN COPYLIB.

      *----------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *----------------------------------------------------------------
       COPY FILESTATUS IN COPYLIB.
       COPY DTSPARMS2  IN COPYLIB.
       COPY KEYBDRTN   IN COPYLIB.

      *****************************************************************
      *  ALL PROGRAM INDICATORS
      *****************************************************************
       01  WS-ALL-INDICATORS.

           03  IN99              PIC 1   INDIC 99   VALUE B"0".
               88  DISPLAY-ERROR-MSSG-OFF           VALUE B"0".
               88  DISPLAY-ERROR-MSSG-ON            VALUE B"1".

           03  IN50              PIC 1   INDIC 50   VALUE B"0".
               88  EDATEMM-ERROR-OFF                VALUE B"0".
               88  EDATEMM-ERROR-ON                 VALUE B"1".
           03  IN51              PIC 1   INDIC 51   VALUE B"0".
               88  EDATEDD-ERROR-OFF                VALUE B"0".
               88  EDATEDD-ERROR-ON                 VALUE B"1".
           03  IN52              PIC 1   INDIC 52   VALUE B"0".
               88  EDATEYY-ERROR-OFF                VALUE B"0".
               88  EDATEYY-ERROR-ON                 VALUE B"1".


       01  WS-ALL-SCREEN-FIELDS.
            03  WS-H01-FLDS.
                05  FILLER            PIC X              VALUE SPACE.

            03  WS-S01-FLDS.
                05  EDATEMM           PIC X(02)          VALUE SPACE.
                05  EDATEDD           PIC X(02)          VALUE SPACE.
                05  EDATEYY           PIC X(02)          VALUE SPACE.
                05  DUMMY             PIC X(01)          VALUE SPACE.

            03  WS-B01-FLDS.
                05  MSSG              PIC X(78)          VALUE SPACE.

      *****************************************************************
      *  PROGRAM MESSAGES
      *****************************************************************
       01  WS-PROGRAM-MESSAGES.
           03  WS-CANT-BE-BLANK           PIC X(78)     VALUE
               "Field can NOT be blank - Must be NUMERIC".

           03  WS-BAD-DATE-MSG           PIC X(78)     VALUE
               "Expect Date Must be equal OR greater than Today".

           03  WS-BAD-YY-MSG             PIC X(78)     VALUE
               "Year field should = CURRENT Year OR NEXT Year".

           03  WS-BAD-MM-MSG             PIC X(78)     VALUE
               "Month is Invalid - Must be 1 thru 12".

           03  WS-BAD-DD-MSG1            PIC X(78)     VALUE
               "Day is Invalid - Must be 1 thru 31".

           03  WS-BAD-DD-MSG2            PIC X(78)     VALUE
               "Day is Invalid for the Month entered".

           03  WS-INIT-MSG               PIC X(78)     VALUE
               "Change field(s) appropriately and Press <ENTER>".

      *****************************************************************
      *  MISCELLANEOUS WORK FIELDS
      *****************************************************************
       01  WS-MISCELLANEOUS-FIELDS.

           03  WS-SAVE-PORCVNO      PIC X(14)       VALUE SPACE.
           03  WS-SAVE-YY           PIC 99          VALUE ZERO.
           03  WS-SAVE-CEN          PIC XX          VALUE SPACE.

           03  WS-WORK-FLD          PIC 9(2)V9999   VALUE ZERO.
           03  WS-WORK-FLD-R1 REDEFINES WS-WORK-FLD.
               05  FILLER      PIC 9(02).
               05  WS-LEFTOVER PIC 9(04).

           03  WS-DATE-ERROR-SW     PIC X(01)       VALUE SPACE.
               88  DATE-ERROR-NO                    VALUES "0".
               88  DATE-ERROR-YES         VALUES "1" "2" "3".
               88  DATE-ERROR-MM                    VALUE "1".
               88  DATE-ERROR-DD                    VALUE "2".
               88  DATE-ERROR-YY                    VALUE "3".

           03  WS-TODAYS-DATE       PIC X(08)       VALUE SPACE.
           03  WS-SAVE-EDATE8.
               05  WS-SAVE-EDATE-CC  PIC X(02)      VALUE SPACE.
               05  WS-SAVE-EDATE-YY  PIC X(02)      VALUE SPACE.
               05  WS-SAVE-EDATE-MM  PIC X(02)      VALUE SPACE.
               05  WS-SAVE-EDATE-DD  PIC X(02)      VALUE SPACE.

           03  WS-THIS-YEAR         PIC 9(02)       VALUE ZERO.
           03  WS-NEXT-YEAR         PIC 9(02)       VALUE ZERO.
           03  WS-NEXT-YEAR-R1  REDEFINES WS-NEXT-YEAR.
               05  WS-NEXT-YEAR-A  PIC X(02).

           03  WS-CHECK-DATE8.
               05  WS-CHEK-EDATE-CC  PIC X(02)      VALUE SPACE.
               05  WS-CHEK-EDATE-YY  PIC X(02)      VALUE SPACE.
               05  WS-CHEK-EDATE-MM  PIC X(02)      VALUE SPACE.
               05  WS-CHEK-EDATE-DD  PIC X(02)      VALUE SPACE.

           03  WS-EDIT-ERRORS-SW PIC X(01)          VALUE "N".
               88  EDIT-ERRORS-NO                   VALUE "N".
               88  EDIT-ERRORS-YES                  VALUE "Y".

       COPY LANGSUB IN COPYLIB.
      *================================================================
      *=             L I N K A G E    S E C T I O N
      *================================================================
       LINKAGE SECTION.
       01  LS-PORCVNO            PIC X(14).

      *================================================================
      *=             P R O C E D U R E    D I V I S I O N
      *================================================================
       PROCEDURE DIVISION  USING LS-PORCVNO.
       0000-PROGRAM-ENTRY.

           OPEN  I-O    DISPLAY-FILE
                        PO-HEADER-FILE.

           PERFORM 0010-INITIALIZE       THRU 0010-EXIT.

           PERFORM 1000-PROCESS-SCREEN-1 THRU 1000-EXIT
                   UNTIL KB-F03-KEY.

           CLOSE        DISPLAY-FILE
                        PO-HEADER-FILE.


       0000-PROGRAM-END.
           GOBACK.

      *****************************************************************
      ** 1ST TIME PROCESSING ROUTINE
      *****************************************************************
       0010-INITIALIZE.

           SET  KB-ENTER-KEY     TO TRUE.
           SET  EDIT-ERRORS-NO   TO TRUE.
           MOVE LS-PORCVNO       TO WS-SAVE-PORCVNO.

           CALL "GETDTSTMP2" USING WS-SYSTEM-DATE-TIME2.
           MOVE WS-SYSTEM-DATE2      TO  WS-TODAYS-DATE.
           MOVE WS-SYSTEM-DATE2-YEAR TO  WS-THIS-YEAR.
           MOVE WS-SYSTEM-DATE2-CEN  TO  WS-SAVE-CEN.

           COMPUTE WS-NEXT-YEAR  =  (WS-THIS-YEAR + 1).

           PERFORM 9000-READK-PO-HEADER1 THRU 9000-READK1-EXIT.
           PERFORM 2000-BUILD-S01        THRU 2000-EXIT.

       0010-EXIT.
            EXIT.

      *****************************************************************
      ***  MAIN PROCESSING LOOP ROUTINE
      *****************************************************************
       1000-PROCESS-SCREEN-1.

           PERFORM 8000-DISPLAY-SCREEN-S01 THRU 8000-DSP1-EXIT.
           IF  KB-F03-KEY
               GO TO 1000-EXIT
           END-IF.

      ***  F05 - REFRESH FROM DB RECORD AND REDISPLAY
           IF  KB-F05-KEY
               PERFORM 2000-BUILD-S01      THRU 2000-EXIT
               GO TO 1000-EXIT
           END-IF.

           PERFORM 1100-EDIT-S01           THRU 1100-EXIT.
           IF  EDIT-ERRORS-YES
               GO TO 1000-EXIT
           END-IF.

           PERFORM 3000-UPDATE-DB          THRU 3000-EXIT.
           SET  KB-F03-KEY       TO TRUE.

       1000-EXIT.
            EXIT.

      *****************************************************************
      ***  EDIT SCREEN S01
      *****************************************************************
       1100-EDIT-S01.

           SET  EDIT-ERRORS-NO       TO TRUE.

      ***  DATE FIELD - MM
      ***  FIELD CAN'T BE BLANK - MUST BE NUMERIC
           IF  EDATEMM  OF WS-S01-FLDS = SPACE
           OR  EDATEMM  OF WS-S01-FLDS NOT NUMERIC
               MOVE WS-CANT-BE-BLANK  TO MSSG OF WS-B01-FLDS
               SET  EDATEMM-ERROR-ON     TO TRUE
               GO TO 1100-EDIT-ERROR
           END-IF.

      ***  DATE FIELD - DD
      ***  FIELD CAN'T BE BLANK - MUST BE NUMERIC
           IF  EDATEDD  OF WS-S01-FLDS = SPACE
           OR  EDATEDD  OF WS-S01-FLDS NOT NUMERIC
               MOVE WS-CANT-BE-BLANK  TO MSSG OF WS-B01-FLDS
               SET  EDATEDD-ERROR-ON     TO TRUE
               GO TO 1100-EDIT-ERROR
           END-IF.

      ***  DATE FIELD - YY
      ***  FIELD CAN'T BE BLANK - MUST BE NUMERIC
           IF  EDATEYY  OF WS-S01-FLDS = SPACE
           OR  EDATEYY  OF WS-S01-FLDS NOT NUMERIC
               MOVE WS-CANT-BE-BLANK  TO MSSG OF WS-B01-FLDS
               SET  EDATEYY-ERROR-ON     TO TRUE
               GO TO 1100-EDIT-ERROR
           END-IF.


      **---------------------------------------------------------------
      ***  CHECK DATE VALIDITY AND SET FLD ATTRIB INDIC ACCORDINGLY
      **---------------------------------------------------------------
           MOVE WS-SAVE-CEN             TO WS-CHEK-EDATE-CC.
           MOVE EDATEYY  OF WS-S01-FLDS TO WS-CHEK-EDATE-YY.
           MOVE EDATEMM  OF WS-S01-FLDS TO WS-CHEK-EDATE-MM.
           MOVE EDATEDD  OF WS-S01-FLDS TO WS-CHEK-EDATE-DD.

           PERFORM 1110-EDIT-DATE       THRU 1110-EXIT.
           IF  DATE-ERROR-YES

               IF  DATE-ERROR-MM
                   SET  EDATEMM-ERROR-ON  TO TRUE
               END-IF

               IF  DATE-ERROR-DD
                   SET  EDATEDD-ERROR-ON  TO TRUE
               END-IF

               IF  DATE-ERROR-YY
                   SET  EDATEYY-ERROR-ON  TO TRUE
               END-IF

               GO TO 1100-EDIT-ERROR

           END-IF.


           MOVE WS-SAVE-CEN             TO WS-SAVE-EDATE-CC.
           MOVE EDATEYY  OF WS-S01-FLDS TO WS-SAVE-EDATE-YY.
           MOVE EDATEMM  OF WS-S01-FLDS TO WS-SAVE-EDATE-MM.
           MOVE EDATEDD  OF WS-S01-FLDS TO WS-SAVE-EDATE-DD.

      ***  YEAR FIELD SHOULD = CURRENT OR NEXT YEAR
           IF  EDATEYY  OF WS-S01-FLDS > WS-NEXT-YEAR-A
               MOVE WS-BAD-YY-MSG     TO MSSG OF WS-B01-FLDS
               SET  EDATEYY-ERROR-ON     TO TRUE
               GO TO 1100-EDIT-ERROR
           END-IF.


      ***  EXPECT DATE SHOULD BE >= TODAYS DATE CCYYMMDD
           IF WS-SAVE-EDATE8 < WS-TODAYS-DATE
              MOVE WS-BAD-DATE-MSG   TO MSSG OF WS-B01-FLDS
              GO TO 1100-EDIT-ERROR
           END-IF.

           GO TO 1100-EXIT.

       1100-EDIT-ERROR.

           SET  EDIT-ERRORS-YES      TO TRUE.
           SET  DISPLAY-ERROR-MSSG-ON  TO TRUE.

       1100-EXIT.
            EXIT.

      **@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
      ** NOTE: I WROTE MY OWN DATE VALIDATION LOGIC SO EACH FIELD
      **       COULD BE EDITTED SEPARATELY AND APPROPRIATE ERROR
      **       MESSAGES BE DISPLAYED ACCORDINGLY.
      **@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
      *****************************************************************
      ***  EDIT DATE
      *****************************************************************
       1110-EDIT-DATE.

           SET  DATE-ERROR-NO        TO TRUE.

      ***  MONTH MUST BE 1 THRU 12
           IF  WS-CHEK-EDATE-MM  < "01"
           OR  WS-CHEK-EDATE-MM  > "12"
              MOVE WS-BAD-MM-MSG     TO MSSG OF WS-B01-FLDS
              SET  DATE-ERROR-MM     TO TRUE
              GO TO 1110-EXIT
           END-IF.

      ***  DAY MUST BE 1 THRU 31
           IF  WS-CHEK-EDATE-DD  < "01"
           OR  WS-CHEK-EDATE-DD  > "31"
              MOVE WS-BAD-DD-MSG1    TO MSSG OF WS-B01-FLDS
              SET  DATE-ERROR-DD     TO TRUE
              GO TO 1110-EXIT
           END-IF.

      ***  DAY MUST BE APPROPRIATE FOR THE MONTH ENTERED
           IF  WS-CHEK-EDATE-DD  > "30"
               IF   WS-CHEK-EDATE-MM  = "02"
               OR   WS-CHEK-EDATE-MM  = "04"
               OR   WS-CHEK-EDATE-MM  = "06"
               OR   WS-CHEK-EDATE-MM  = "09"
               OR   WS-CHEK-EDATE-MM  = "11"
                   MOVE WS-BAD-DD-MSG2    TO MSSG OF WS-B01-FLDS
                   SET  DATE-ERROR-DD     TO TRUE
                   GO TO 1110-EXIT
               END-IF
           END-IF.


      ***  CHECK FEBRUARY
           IF  WS-CHEK-EDATE-MM  = "02"
               IF  WS-CHEK-EDATE-DD  > "29"
                   MOVE WS-BAD-DD-MSG2    TO MSSG OF WS-B01-FLDS
                   SET  DATE-ERROR-DD     TO TRUE
                   GO TO 1110-EXIT
               END-IF
           END-IF.

      ***  CHECK FEBRUARY FOR LEAP YEAR
           IF  WS-CHEK-EDATE-MM  = "02"

               MOVE  WS-CHEK-EDATE-YY   TO WS-SAVE-YY
               COMPUTE  WS-WORK-FLD = (WS-SAVE-YY / 4)

      ***  NOT LEAP YEAR - DAY CAN'T BE > 28
               IF  WS-LEFTOVER > ZERO
               AND WS-CHEK-EDATE-DD  > "28"
                   MOVE WS-BAD-DD-MSG2    TO MSSG OF WS-B01-FLDS
                   SET  DATE-ERROR-DD     TO TRUE
                   GO TO 1110-EXIT
               END-IF

      ***  LEAP YEAR - DAY CAN'T BE > 29 - SHOULD BE CAUGHT ABOVE
               IF  WS-LEFTOVER = ZERO
               AND WS-CHEK-EDATE-DD  > "29"
                   MOVE WS-BAD-DD-MSG2    TO MSSG OF WS-B01-FLDS
                   SET  DATE-ERROR-DD     TO TRUE
                   GO TO 1110-EXIT
               END-IF

           END-IF.

       1110-EXIT.
            EXIT.
      *****************************************************************
      ***  BUILD SCREEN S01
      *****************************************************************
       2000-BUILD-S01.

           MOVE PO-EXPECT-DATE-CN TO WS-SAVE-EDATE8.
           MOVE WS-SAVE-EDATE-MM  TO EDATEMM  OF WS-S01-FLDS.
           MOVE WS-SAVE-EDATE-DD  TO EDATEDD  OF WS-S01-FLDS.
           MOVE WS-SAVE-EDATE-YY  TO EDATEYY  OF WS-S01-FLDS.

       2000-EXIT.
            EXIT.

      *****************************************************************
      ***  UPDATE PO HEADER
      *****************************************************************
       3000-UPDATE-DB.

           PERFORM 9000-READK-PO-HEADER2 THRU 9000-READK2-EXIT.

           MOVE WS-SAVE-EDATE8 TO  PO-EXPECT-DATE-CN.
           PERFORM 9000-REWRT-PO-HEADER  THRU 9000-REWRT-EXIT.

       3000-EXIT.
            EXIT.

      *****************************************************************
      ** DISPLAY SCREEN FORMAT S01
      *****************************************************************
       8000-DISPLAY-SCREEN-S01.

      *****MOVE CORR WS-H01-FLDS    TO H01-O.
           WRITE DISPLAY-REC FORMAT "H01"
      *******    INDICATORS ARE WS-ALL-INDICATORS.
           END-WRITE.

           IF  EDIT-ERRORS-NO
               MOVE WS-INIT-MSG   TO MSSG  OF WS-B01-FLDS
           END-IF.

           MOVE CORR WS-B01-FLDS    TO B01-O.
           WRITE DISPLAY-REC FORMAT "B01"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

           MOVE CORR WS-S01-FLDS    TO S01-O.
           WRITE DISPLAY-REC FORMAT "S01"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

           INITIALIZE  WS-S01-FLDS  WS-B01-FLDS.

           READ  DISPLAY-FILE FORMAT "S01"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-READ.
           MOVE CORR S01-I   TO WS-S01-FLDS.

           SET  EDATEMM-ERROR-OFF TO TRUE.
           SET  EDATEDD-ERROR-OFF TO TRUE.
           SET  EDATEYY-ERROR-OFF TO TRUE.
           SET  DISPLAY-ERROR-MSSG-OFF TO TRUE.

       8000-DSP1-EXIT.
            EXIT.

      *----------------------------------------------------------------
      *
      *                ALL FILE I-O'S BELOW THIS POINT
      *
      *----------------------------------------------------------------

      *****************************************************************
      *** READ BY KEY PO HEADER (DB RECORD NOT LOCKED)
      *****************************************************************
       9000-READK-PO-HEADER1.

           INITIALIZE BUF-DPORECD.
           MOVE WS-SAVE-PORCVNO  TO PO-RCV-NO.

           READ PO-HEADER-FILE NO LOCK
           END-READ.

       9000-READK1-EXIT.
            EXIT.
      *****************************************************************
      *** READ BY KEY PO HEADER FOR UPDATE (DB RECORD LOCKED FOR UPD)
      *****************************************************************
       9000-READK-PO-HEADER2.

           INITIALIZE BUF-DPORECD.
           MOVE WS-SAVE-PORCVNO  TO PO-RCV-NO.

           READ PO-HEADER-FILE
           END-READ.

       9000-READK2-EXIT.
            EXIT.
      *****************************************************************
      *** REWRITE PO-HEADER
      *****************************************************************
       9000-REWRT-PO-HEADER.

           REWRITE PO-HEADER-REC
           END-REWRITE.

       9000-REWRT-EXIT.
            EXIT.
      *****************************************************************
      ***              END  OF  SOURCE  MEMBER
      *****************************************************************
