000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    SPOSINST.
000500 AUTHOR.        KURT MOVSESIAN/JIM COFFMAN (MAINTAINER).
000800
000900******************************************************
001000*                                                    *
001100*     S P O S I N S T                                *
001200*    SUBROUTINE FOR SELECTING STANDARD INSTRUCTIONS. *
001300*    THIS PROGRAM DISPLAYS A SCREEN FOR SELECTING    *
001400*    STANDARD INSTRUCTIONS AND CONFIRMING ORDER      *
001500*    VERBAGE FOR PRINT PURPOSES.  ONCE THE           *
001600*    SELECTIONS ARE MADE THEY ARE RETURNED TO THE    *
001700*    CALLING PROGRAM.   THE FORM USED BY THIS        *
001800*    SUBROUTINE IS 'PURORD4' AND IS LOCATED IN THE   *
001900*    FORMFILE 'VPURORD.FLANG001' THEREFORE THIS      *
002000*    FORMFILE MUST BE OPENED FIRST.                  *
002100*    PO NUMBER IS OPTIONAL BUT IF IT IS PASSED IT    *
002200*    WILL BE DISPLAYED ON THE SCREEN.                *
002300*    COMPANY CODE SHOULD BE PASSED FOR SCREEN        *
002400*    DISPLAY PURPOSES.                               *
002500*                                                    *
002600*      01 SPOSINST-PARMS.                            *
002700*         05  SPOSINST-STD-INST X(36) - ARRAY        *
002800*              CONTAINING UP TO 12 (3 BYTE) STANDARD *
002900*              INSTRUCTIONS                          *
003000*         05  SPOSINST-CONFIRMING-FLAG  X(1) - 'X'   *
003100*              DENOTES THIS IS A CONFIRMING ORDER    *
003200*         05  SPOSINST-CONFIRM-VERBAGE X(34) -       *
003300*              CONFIRMING ORDER FREE VERBAGE WHICH   *
003400*              IS OPTIONAL                           *
003500*         05  SPOSINST-COMPANY-CODE X(3) - COMPANY   *
003600*              CODE WHICH SHOULD BE PASSED BY        *
003700*              CALLING PROGRAM.                      *
003800*                                                    *
003900*        SPOSINST-STD-INST, SPOSINST-CONFIRMING-FLAG,*
004000*        SPOSINST-CONFIRM-VERBAGE ARE THE VARIABLES  *
004100*        RETURNED BY THIS SUBROUTINE.                *
004200******************************************************
      *C
      *C  02/03/1998   CA YODER   REQ #97-018
      *C    COMMENTED OUT SENTENCE TO MOVE SPACES TO STANDARD
      *C    INSTRUCTIONS PARAMETER SINCE TPURORD WILL BE FILLING
      *C    IN VALUES FROM DVENDOR IF THEY EXIST.
      *C
004300
004400
004500 ENVIRONMENT DIVISION.
004600 CONFIGURATION SECTION.
004700 SOURCE-COMPUTER.  HP-3000.
004800 OBJECT-COMPUTER.  HP-3000.
004900
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
005100
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZPURORD-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

           SELECT MCOMMENT-I
                  ASSIGN TO DATABASE-MCFLCS1801
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DCOMMENT-I
                  ASSIGN TO DATABASE-MCFLCS1901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

005200 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                  PIC X(2000).
      *    COPY DD-PURORD4-O OF ZPURORD.

       FD  MCOMMENT-I
           LABEL RECORDS ARE STANDARD.
       01  MCOMMENT-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCS1801.

       FD  DCOMMENT-I
           LABEL RECORDS ARE STANDARD.
       01  DCOMMENT-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCS1901.

005300
005400 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

005600
005700**********************
005800*                    *
005900*  S W I T C H E S   *
006000*                    *
006100**********************
006200
006300 01  SWITCH-AREA.
006400     05  FATAL-ERR-SW             PIC X   VALUE SPACES.
006600
006700 01  SAVE-AREAS.
006800     05  SAVE-COND-WORD           PIC S9(4)  COMP-4 VALUE ZEROS.
006900
007000 01  SUB-AREA  COMP-4.
007100     05  SUB                     PIC S99     VALUE ZEROS.
007200     05  INST-SUB                PIC S99     VALUE ZEROS.
007300
007400
007500*************************************
007600*                                   *
007700*   DATA BASE ADDRESS TABLE FOR     *
007800*   FOR WRITING STD INSTRUCTIONS TO *
007900*   SCREEN                          *
008000*                                   *
008100*************************************
008200
008300 01  DB-ADDR-TABLE.
008400     05  DATA-BASE-ADDR OCCURS 60 TIMES.
008500         10  COMMENT-ADDR     PIC X(4).
008600
008900 01  WORK-AREA.
009000     05  TERM-PAGE-CTR           PIC 9(2)    VALUE ZEROS.
009100
009200 01  WORK-AREA-KEYS.
009300     05  BUILD-COMMENT-NO.
009400         10  BUILD-COM-PREFIX       PIC X     VALUE "C".
009500         10  BUILD-COM-NO           PIC X(3)  VALUE SPACES.
009600
009700
009800 01  MESSAGE-BUFFER.
009900     05  MSG-TEXT              PIC X(66)    VALUE SPACE.
010000     05  MSG-FLD               PIC X(10)    VALUE SPACE.
010100     05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC Z(9)9.
010200
010700 01  FIELD-NUMBER              PIC S9(4)    VALUE 1    COMP-4.
011300
       COPY DISPDATA IN COPYLIB.

       COPY IOFEEDBACK IN COPYLIB.

       COPY CATREAD IN COPYLIB.
011400
011500**************************************************************
011600**************************************************************
011700**                                                          **
011800**             TERMINAL I/O DATA AREA                       **
011900**                                                          **
012000**************************************************************
012100**************************************************************
012200
012300 01  SCREEN-4.
012400     05  DE4-COMPANY-CODE            PIC X(3).
012500     05  DE4-PO                      PIC X(7).
012600     05  DE4-PO-REL                    PIC X(3).
012700     05  DE4-CONFIRMING-ORDER        PIC X.
012800     05  DE4-CONFIRMING-VERB         PIC X(34).
012900     05  DE4-INSTRUCT-LIST.
013000         10  DE4-INSTRUCT-NO  OCCURS 12 TIMES   PIC X(3).
012900     05  DE4-RCV-INSTRUCT-LIST.
013000         10  DE4-RCV-INSTRUCT-NO  OCCURS 12 TIMES   PIC X(3).
013100     05  DE4-INSTRUCT-INQ.
013200         10  DE4-INSTRUCT-TABLE OCCURS 8 TIMES.
                   15  DE4-INST-TYPE       PIC X(1).
013300             15  DE4-INST-NO         PIC X(3).
013400             15  DE4-INST-FIRST-LINE PIC X(72).
013500     05  DE4-MSG                     PIC X(68).
           05  DE4-COMMAND-LINE            PIC X(79).
           05  DE4-MESSAGE-LINE            PIC X(79).
013600
013700**************************************************************
013800**************************************************************
013900**                                                          **
014000**                DATABASE I/O BUFFER AREA                  **
014100**                                                          **
014200**************************************************************
014300**************************************************************
014400
014500 COPY MCOMMENT IN COPYLIB.
014600
014700 COPY DCOMMENT IN COPYLIB.
014800
014900 COPY DBSTAT IN COPYLIB.
015200
015300*********************
015400*                   *
015500*   DATA SET NAMES  *
015600*                   *
015700*********************
015800
015900 01  DSET-NAMES.
016000     05  DSET-MCOMMENT          PIC X(16)  VALUE "MCOMMENT;".
016100     05  DSET-DCOMMENT          PIC X(16)  VALUE "DCOMMENT;".
016200
016300 01 ITEMS-LISTING.
016400     05  ALL-ITEMS              PIC XX    VALUE "@;".
016500     05  COMMENT-SEARCH  PIC X(16) VALUE "MCOM-COMMENT-NO;".
016600
016700 01 ARG-VALUES.
016800     05  COMMENT-ARG            PIC X(4)  VALUE SPACES.
016900
017200
       01  ESCAPE-WORKAREA.
017300     05  EXP-PRT-SEQ            PIC X(5)   VALUE "*EXP*".
017700     05  COMP-PRT-SEQ           PIC X(5)   VALUE "*CMP*".
018500
018600*************************************************************
018700**                                                         **
018800**          E R R O R   M E S S A G E   A R E A S          **
018900**                                                         **
019000*************************************************************
019100
019200 COPY TBLOWUP IN COPYLIB.
019400
019500 LINKAGE SECTION.
019600
019700 01  BASE                         PIC X(10).
019800
019900 01  BUILD-PO-SEARCH.
020000     05  PO-PREFIX                PIC X.
020100     05  PO-NO-REL.
020200         10  PO-NO                PIC X(7).
020300         10  PO-REL               PIC X(3).
020400     05  PO-RCV                   PIC X(3).
020500
020600 COPY VCOMLINK IN COPYLIB.
020700
020800***********************************
020900**  PARAMETERS FOR 'SPOSINST'
021000***********************************
021100
021200 COPY SPOSINST IN COPYLIB.
021300
021400 COPY ESCNAME IN COPYLIB.
021500
021600**************************************
021700*                                    *
021800*  PRINTCNTL IS SET TO 1 THIS CAUSES *
021900*  THE FIELD ON A SCREEN PRINTOUT    *
022000*  TO BE UNDERLINED                  *
022100*                                    *
022200*  PAGECNTL IS SET TO 49 (OCTAL 61)  *
022300*  THIS CAUSE THE LP TO EJECT AFTER  *
022400*  THE SCREEN IS PRINTED             *
022500*                                    *
022600**************************************
022700
022800 01  SCREEN-PRINT-PARMS.
022900     05  PRINTCNTL             PIC S9(4)    COMP-4.
023000     05  PAGECNTL              PIC S9(4)    COMP-4.
023100     05  SPOOLFIL-OPEN-SW      PIC X.
023200
023300 01  PASSED-SPOOL-PRT          PIC S9(2)    COMP-4.
023400
023500 COPY LANGSUB IN COPYLIB.
023600
023700
023800 PROCEDURE DIVISION USING BASE,
023900                          BUILD-PO-SEARCH,
024000                          VIEW-COMAREA,
024100                          SPOSINST-PARMS,
024200                          ESC-NAME,
024300                          SCREEN-PRINT-PARMS,
024400                          PASSED-SPOOL-PRT,
024500                          LANGUAGE-PARMS.
024600
024700 PROC-DIV SECTION 04.
024800
024900 BEGIN-HERE.
           OPEN INPUT MCOMMENT-I, DCOMMENT-I.
           OPEN I-O DISPLAY-FILE.

025000     PERFORM 64-PROCESS-STD-INST  THRU 64-PSI-X.
 25100
           CLOSE MCOMMENT-I, DCOMMENT-I, DISPLAY-FILE.
025200     GOBACK.
025300
025400
025500******************************************************
025600**                                                  **
025700**   BLOWUP ROUTINE                                 **
025800**                                                  **
025900******************************************************
026000
026100 2-BLOWUP.
026200     MOVE "SPOSINST" TO  BU-PGM-NAME.
           IF FILE-STATUS NUMERIC
               MOVE FILE-STATUS  TO COND-WORD.
026300     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
026400         VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
026500             BU-DISPLAY-FLDS.
026600
029500
029600 4-PGM-ERROR.
           MOVE B"1" TO IND(FIELD-NUMBER), IND(99).
030400
030500 4-PGM-ERROR-X.
030600     EXIT.
032600
032700
032800 64-PROCESS-STD-INST.
032900**** MOVE SPACES                  TO SPOSINST-STD-INST,
033000     MOVE SPACES                  TO SPOSINST-CONFIRMING-FLAG,
033100                                     SPOSINST-CONFIRM-VERBAGE
                                           SPOSINST-RCV-INST.
033900     MOVE "PURORD4"               TO VIEW-NFNAME.
034400
034500     MOVE SPACES                  TO SCREEN-4.
           IF SPOSINST-STD-INST > SPACES
               MOVE SPOSINST-STD-INST   TO DE4-INSTRUCT-LIST
           ELSE
               MOVE SPACES              TO SPOSINST-STD-INST.
034600     MOVE SPOSINST-COMPANY-CODE   TO DE4-COMPANY-CODE.
034700     MOVE PO-NO                   TO DE4-PO.
034800     MOVE PO-REL                  TO DE4-PO-REL.
035100     MOVE 1                       TO TERM-PAGE-CTR.
035500     MOVE SPACES                  TO DB-ADDR-TABLE.
           MOVE 0 TO COND-WORD.
           READ MCOMMENT-I FIRST INTO BUF-MCOMMENT
               AT END MOVE 11 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   GO TO 64-CHECK-FOR-STD-INST
               ELSE
                   MOVE 99 TO COND-WORD.
036800     IF MCOM-KEY-PREFIX  = "C" OR "R"
037200         MOVE MCOM-COMMENT-NO     TO COMMENT-ADDR (1)
034900         GO TO 64-CHECK-FOR-STD-INST.

035000 64-GET-FIRST-ADDR.
           MOVE 0 TO COND-WORD.
           READ MCOMMENT-I NEXT INTO BUF-MCOMMENT
               AT END MOVE 11 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   MOVE 11  TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
035800*A   CALL "DBGET" USING BASE, DSET-MCOMMENT, MODE2,
035900*A       STATUS-AREA, ALL-ITEMS, BUF-MCOMMENT, COMMENT-ARG.
036000     IF COND-WORD NOT = 0
036100         IF COND-WORD = 11
036200             GO TO 64-CHECK-FOR-STD-INST
036300         ELSE
036400             MOVE "GET MCOMMENT * 64-GFA"  TO  BU-DISPLAY-MSG
036500             MOVE COMMENT-ARG              TO  BU-DISPLAY-FLD (2)
036600             GO TO 2-BLOWUP.
036700
036800     IF MCOM-KEY-PREFIX = "C" OR "R"
037200         MOVE MCOM-COMMENT-NO     TO COMMENT-ADDR (1)
037100     ELSE
037000         GO TO 64-GET-FIRST-ADDR.
037300
037400 64-CHECK-FOR-STD-INST.
037500     IF COMMENT-ADDR (1) = SPACES
037600*        "NO P.O. STANDARD INSTRUCTIONS EXIST IN SYSTEM"
037700         MOVE  14                 TO LANG-SETNUM
037800         MOVE   8                 TO LANG-MSGNUM
037900         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
038000         MOVE MESSAGE-BUFFER      TO DE4-INST-FIRST-LINE (1)
038100         GO TO 64-WRITE-MSG-LINE.
038200
038300 64-GET-COMMENT-CALC.
           MOVE 0 TO COND-WORD.
038400     MOVE COMMENT-ADDR (TERM-PAGE-CTR)
               TO MCOMCOMMNT OF MCOMMENT-REC-I.
           READ MCOMMENT-I INTO BUF-MCOMMENT
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
038500*A   CALL "DBGET" USING BASE, DSET-MCOMMENT, MODE4,
038600*A       STATUS-AREA, ALL-ITEMS, BUF-MCOMMENT, CALC-ADDR.
038700     IF COND-WORD NOT = 0
038800         MOVE "GET MCOMMENT * 64-GCC" TO BU-DISPLAY-MSG
039000         GO TO 2-BLOWUP.
039100
039200     MOVE SPACES                  TO DE4-INSTRUCT-INQ.
039300     MOVE 1                       TO INST-SUB.
039400     GO TO 64-FIND-DCOMMENT.
039500
039600********************************************
039700*                                          *
039800*  DO A SERIAL READ OF MCOMMENT TO FIND    *
039900*  ALL COMMENTS SO I CAN PRINT FIRST LINE  *
040000*  OF EACH COMMENT TO THE TERMINAL         *
040100*                                          :
040200********************************************
040300
040400 64-SERIAL-READ-MCOMMENT.
           MOVE 0 TO COND-WORD.
           READ MCOMMENT-I NEXT INTO BUF-MCOMMENT
               AT END MOVE 11 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   MOVE 11  TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
040500*A   CALL "DBGET" USING BASE, DSET-MCOMMENT, MODE2,
040600*A       STATUS-AREA, ALL-ITEMS, BUF-MCOMMENT, COMMENT-ARG.
040700     IF COND-WORD NOT = 0
040800         IF COND-WORD = 11
040900             GO TO 64-WRITE-MSG-LINE
041000         ELSE
041100             MOVE "GET MCOMMENT * 64-SRM"  TO  BU-DISPLAY-MSG
041200             MOVE COMMENT-ARG          TO  BU-DISPLAY-FLD (2)
041300             GO TO 2-BLOWUP.
041400
041500     IF MCOM-KEY-PREFIX = "C" OR "R"
               NEXT SENTENCE
           ELSE
041600         GO TO 64-SERIAL-READ-MCOMMENT.
041700
041800     ADD 1                        TO INST-SUB.
041900     IF INST-SUB > 8
042000         ADD 1                    TO TERM-PAGE-CTR
042100         MOVE MCOM-COMMENT-NO     TO COMMENT-ADDR (TERM-PAGE-CTR)
042200         GO TO 64-WRITE-MSG-LINE.
042300
042400 64-FIND-DCOMMENT.
           IF MCOM-KEY-PREFIX = "R"
              MOVE "*"                  TO DE4-INST-TYPE(INST-SUB)
           ELSE
              MOVE " "                  TO DE4-INST-TYPE(INST-SUB).
042500     MOVE MCOM-KEY-NUM            TO DE4-INST-NO (INST-SUB).
042600     MOVE MCOM-COMMENT-NO         TO COMMENT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE COMMENT-ARG TO MCOMCOMMNT OF DCOMMENT-REC-I.
           START DCOMMENT-I KEY = MCOMCOMMNT OF DCOMMENT-REC-I
               INVALID KEY MOVE 0 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 0 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
042700*A   CALL "DBFIND" USING BASE, DSET-DCOMMENT, MODE1,
042800*A       STATUS-AREA, COMMENT-SEARCH, COMMENT-ARG.
042900     IF COND-WORD NOT = 0
043000         MOVE "FIND DCOMMENT * 64-FD" TO  BU-DISPLAY-MSG
043100         MOVE COMMENT-ARG             TO  BU-DISPLAY-FLD (2)
043200         GO TO 2-BLOWUP.
           MOVE 0 TO COND-WORD.
           READ DCOMMENT-I NEXT INTO BUF-DCOMMENT
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF MCOMCOMMNT OF DCOMMENT-REC-I NOT = COMMENT-ARG
               MOVE 15 TO COND-WORD.
043300*A   CALL "DBGET" USING BASE, DSET-DCOMMENT, MODE5,
043400*A       STATUS-AREA, ALL-ITEMS, BUF-DCOMMENT, COMMENT-ARG.
043500     IF COND-WORD NOT = 0
043600         IF COND-WORD = 15
043700*            " NO INSTRUCTION ON FILE "
043800             MOVE  14 TO LANG-SETNUM
043900             MOVE  54 TO LANG-MSGNUM
044000             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
044100             MOVE MESSAGE-BUFFER TO DE4-INST-FIRST-LINE (INST-SUB)
044200             GO TO 64-SERIAL-READ-MCOMMENT
044300         ELSE
044400             MOVE "GET DCOMMENT * 64-FD" TO  BU-DISPLAY-MSG
044500             MOVE COMMENT-ARG            TO  BU-DISPLAY-FLD (2)
044600             GO TO 2-BLOWUP.
044700
044800***************************************
044900*                                     *
045000*  CHECK TO DETERMINE PRINT TYPE OF   *
045100*  EITHER EXPANDED, COMPRESSED, OR    *
045200*  REGULAR PRINT                      *
045300*                                     *
045400***************************************
045500
045600     IF EXP-PRT-START = EXP-PRT-SEQ
045700         MOVE EXP-DATA-COMMENT    TO
045800             DE4-INST-FIRST-LINE (INST-SUB)
045900     ELSE
046000     IF COMP-PRT-START = COMP-PRT-SEQ
046100         MOVE COMP-DATA-COMMENT   TO
046200             DE4-INST-FIRST-LINE (INST-SUB)
046300     ELSE
046400         MOVE DCOM-DATA-LINE      TO
046500             DE4-INST-FIRST-LINE (INST-SUB).
046600
046700     GO TO 64-SERIAL-READ-MCOMMENT.
046800
046900 64-WRITE-MSG-LINE.
047000     MOVE COND-WORD               TO SAVE-COND-WORD.
047100     IF SAVE-COND-WORD = 11  AND  TERM-PAGE-CTR > 1
047200*        "PRESS 'f4' TO SEE PREVIOUS STD. INSTRUCTIONS"
047300         MOVE  16                 TO LANG-SETNUM
047400         MOVE  12                 TO LANG-MSGNUM
047500         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
047600         MOVE MESSAGE-BUFFER      TO DE4-MSG
047700     ELSE
047800     IF INST-SUB > 8  AND  TERM-PAGE-CTR > 2
047900*        "PRESS 'f4' TO SEE PREV STD. INSTRUCTION  'f5' TO "
048000*        "SEE MORE STD. INST"
048100         MOVE  16                 TO LANG-SETNUM
048200         MOVE  13                 TO LANG-MSGNUM
048300         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
048400         MOVE MESSAGE-BUFFER      TO DE4-MSG
048500     ELSE
048600     IF INST-SUB > 8
048700*        "PRESS 'f5' TO SEE MORE STD. INSTRUCTIONS"
048800         MOVE  16                 TO LANG-SETNUM
048900         MOVE  16                 TO LANG-MSGNUM
049000         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
049100         MOVE MESSAGE-BUFFER      TO DE4-MSG
049200     ELSE
049300     IF TERM-PAGE-CTR = 1
049400         MOVE SPACES              TO DE4-MSG
049500     ELSE
049600         MOVE "PAGE PROBLEM INST" TO BU-DISPLAY-MSG
049700         MOVE TERM-PAGE-CTR       TO BU-DISPLAY-FLD (2)
049800         MOVE INST-SUB            TO BU-DISPLAY-FLD9 (1)
049900         GO TO 2-BLOWUP.
050000
051500 64-READ-SCREEN-4.
           MOVE SCREEN-4       TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC    TO SCREEN-4.
052200
053600     IF VIEW-LASTKEY = 3
053700         GO TO 64-PSI-X
053800     ELSE
053900     IF VIEW-LASTKEY = 1
054100         MOVE SPACES              TO MESSAGE-BUFFER
054200         MOVE 40                  TO FIELD-NUMBER
054300         MOVE B"1" TO IND(FIELD-NUMBER)
054400         GO TO 64-READ-SCREEN-4
054500     ELSE
054600     IF VIEW-LASTKEY = 2 OR
054700        VIEW-LASTKEY = 6 OR
054800        VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
055000*        "INVALID FUNCTION KEY ENTERED"
055100         MOVE   9 TO LANG-SETNUM
055200         MOVE  10 TO LANG-MSGNUM
055300         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE4-MESSAGE-LINE
055400         MOVE 35  TO  FIELD-NUMBER
055500         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
055600         GO TO 64-READ-SCREEN-4.
055700
055800     IF SAVE-COND-WORD = 11  AND  TERM-PAGE-CTR > 1
055900         IF VIEW-LASTKEY = 5
056100*            "INVALID FUNCTION KEY ENTERED"
056200             MOVE   9 TO LANG-SETNUM
056300             MOVE  10 TO LANG-MSGNUM
056400             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE4-MESSAGE-LINE
056500             MOVE 35  TO  FIELD-NUMBER
056600             PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
056700             GO TO 64-READ-SCREEN-4
056800         ELSE
056900         IF VIEW-LASTKEY = 4
057200             SUBTRACT 1 FROM TERM-PAGE-CTR
057300             GO TO 64-GET-COMMENT-CALC
057400         ELSE
057500             NEXT SENTENCE
057600     ELSE
057700     IF INST-SUB > 8  AND  TERM-PAGE-CTR > 2
057800         IF VIEW-LASTKEY = 5
058100             GO TO 64-GET-COMMENT-CALC
058200         ELSE
058300         IF VIEW-LASTKEY = 4
058600             SUBTRACT 2 FROM TERM-PAGE-CTR
058700             GO TO 64-GET-COMMENT-CALC
058800         ELSE
058900             NEXT SENTENCE
059000     ELSE
059100     IF INST-SUB > 8
059200         IF VIEW-LASTKEY = 5
059500             GO TO 64-GET-COMMENT-CALC
059600         ELSE
059700         IF VIEW-LASTKEY = 4
059900*            "INVALID FUNCTION KEY ENTERED"
060000             MOVE   9 TO LANG-SETNUM
060100             MOVE  10 TO LANG-MSGNUM
060200             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE4-MESSAGE-LINE
060300             MOVE 35  TO  FIELD-NUMBER
060400             PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
060500             GO TO 64-READ-SCREEN-4
060600         ELSE
060700             NEXT SENTENCE
060800     ELSE
060900     IF TERM-PAGE-CTR = 1
061000         IF VIEW-LASTKEY = 4 OR 5
061200*            "INVALID FUNCTION KEY ENTERED"
061300             MOVE   9 TO LANG-SETNUM
061400             MOVE  10 TO LANG-MSGNUM
061500             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE4-MESSAGE-LINE
061600             MOVE 35  TO  FIELD-NUMBER
061700             PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
061800             GO TO 64-READ-SCREEN-4.
063700
063800 64-EDIT-CONFIRMING-ORDER.
063900     IF DE4-CONFIRMING-VERB  NOT =  SPACES
064000         IF DE4-CONFIRMING-ORDER  =  SPACES
064100*          "ENTER 'X' IN CONFIRMING ORDER TO USE CONFIRMING FREE "
064200*               "VERBAGE"
064300           MOVE   5 TO LANG-SETNUM
064400           MOVE  34 TO LANG-MSGNUM
064500           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                 MOVE MESSAGE-BUFFER TO DE4-MESSAGE-LINE
064600           MOVE 35  TO  FIELD-NUMBER
064700           PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
064800           GO TO 64-READ-SCREEN-4.
064900
065000     MOVE 0                       TO SUB.
065100
065200***************************************
065300*                                     *
065400*  EDIT COMMENTS FOR VALID COMMENT NO.*
065500*                                     *
065600***************************************
065700
065800 64-EDIT-COMMENT-NO.
065900     ADD 1 TO SUB.
066000     IF SUB  >  12
               MOVE 0 TO SUB.
066100         GO TO 64-EDIT-RCV-COMMENT-NO.
066200
066300     IF DE4-INSTRUCT-NO (SUB) = SPACES
066400         GO TO 64-EDIT-COMMENT-NO.
066500     MOVE DE4-INSTRUCT-NO (SUB)   TO BUILD-COM-NO.
           MOVE "C" TO BUILD-COM-PREFIX.
066600     MOVE BUILD-COMMENT-NO        TO COMMENT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE COMMENT-ARG TO MCOMCOMMNT OF MCOMMENT-REC-I.
           READ MCOMMENT-I INTO BUF-MCOMMENT
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
066700*A   CALL "DBGET" USING BASE, DSET-MCOMMENT, MODE7,
066800*A       STATUS-AREA, ALL-ITEMS, BUF-MCOMMENT, COMMENT-ARG.
066900     IF COND-WORD NOT = 0
067000         IF COND-WORD = 17
067100*            "INSTRUCTION NUMBER DOES NOT EXIST"
067200             MOVE   9 TO LANG-SETNUM
067300             MOVE  60 TO LANG-MSGNUM
067400             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE4-MESSAGE-LINE
067500             MOVE SUB  TO  FIELD-NUMBER
067600             IF FIELD-NUMBER > 6
067700                 ADD 33           TO FIELD-NUMBER
067800                 PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
067900                 GO TO 64-READ-SCREEN-4
068000             ELSE
068100                 PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
068200                 GO TO 64-READ-SCREEN-4
068300         ELSE
068400             MOVE "GET MCOMMENT * 64-ECN" TO BU-DISPLAY-MSG
068500             MOVE COMMENT-ARG             TO BU-DISPLAY-FLD (2)
068600             GO TO 2-BLOWUP.
068700
068800     GO TO 64-EDIT-COMMENT-NO.
068900
065200*******************************************
065300*                                         *
065400*  EDIT RCV COMMENTS FOR VALID COMMENT NO.*
065500*                                         *
065600*******************************************
065700
065800 64-EDIT-RCV-COMMENT-NO.
065900     ADD 1 TO SUB.
066000     IF SUB  >  12
066100         GO TO 64-SAVE-STD-INST.
066200
066300     IF DE4-RCV-INSTRUCT-NO (SUB) = SPACES
066400         GO TO 64-EDIT-RCV-COMMENT-NO.
066500     MOVE DE4-RCV-INSTRUCT-NO (SUB)   TO BUILD-COM-NO.
           MOVE "R" TO BUILD-COM-PREFIX.
066600     MOVE BUILD-COMMENT-NO        TO COMMENT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE COMMENT-ARG TO MCOMCOMMNT OF MCOMMENT-REC-I.
           READ MCOMMENT-I INTO BUF-MCOMMENT
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
066900     IF COND-WORD NOT = 0
067000         IF COND-WORD = 17
067100*            "INSTRUCTION NUMBER DOES NOT EXIST"
067200             MOVE   9 TO LANG-SETNUM
067300             MOVE  60 TO LANG-MSGNUM
067400             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE4-MESSAGE-LINE
067500             MOVE SUB  TO  FIELD-NUMBER
067600             IF FIELD-NUMBER > 6
067700                 ADD 59           TO FIELD-NUMBER
067800                 PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
067900                 GO TO 64-READ-SCREEN-4
068000             ELSE
068100                 PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
068200                 GO TO 64-READ-SCREEN-4
068300         ELSE
068400             MOVE "GET MCOMMENT * 64-ERCN" TO BU-DISPLAY-MSG
068500             MOVE COMMENT-ARG             TO BU-DISPLAY-FLD (2)
068600             GO TO 2-BLOWUP.
068700
068800     GO TO 64-EDIT-RCV-COMMENT-NO.
068900
069000*****************************************************
069100*                                                   *
069200*  SAVE STD. INST. AND CONFIRMING ORDER INFO.       *
069300*  IN DPODATAITM USE ITEM NUMBER '000001'           *
      *                                                   *
      *  SAVE RCV. INSTRUCTIONS IN DPODATAITM USE '000002'*
069400*                                                   *
069500*****************************************************
069600
069700 64-SAVE-STD-INST.
069800     MOVE DE4-INSTRUCT-LIST       TO SPOSINST-STD-INST.
069900     MOVE DE4-CONFIRMING-ORDER    TO SPOSINST-CONFIRMING-FLAG.
070000     MOVE DE4-CONFIRMING-VERB     TO SPOSINST-CONFIRM-VERBAGE.
           MOVE DE4-RCV-INSTRUCT-LIST   TO SPOSINST-RCV-INST.
070100
070200 64-PSI-X.
070300     EXIT.
070400
070500 COPY DISPCALL IN COPYLIB.
072700
072800 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
074300 999-CATREAD-EXIT.
074400     EXIT.
