       IDENTIFICATION DIVISION.
       PROGRAM-ID.     SPRQUSER.
       AUTHOR.         CA YODER.
       INSTALLATION.   THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
       DATE-WRITTEN.   NOVEMBER 1996.
       DATE-COMPILED.
      *REMARKS.
      **************************************************************
      *                                                            *
      *D   SPRQUSER     REQUISITION USER OPTIONS                   *
      *D                                                           *
      *D   CALLED BY:  TREQOPT                                     *
      *D                                                           *
      **************************************************************
      *C
      *C 10/15/97  JEFF BUNGO
      *C    ADD REQUISITION OPTION TO REQUIRE A USERID TO NOTIFY
      *C    WHEN A REQ HAS BEEN RECEIVED AT THE DOCK.  THIS REQUIREMENT
      *C    FLAG WILL BE ADDED TO THE PDER MPLTINFO KEY.
      *C
      *C 01/06/97  CA YODER
      *C    ADD OPTION TO DELETE REQUISITIONS RETURNED TO THE ORIGINATOR
      *C    & NUMBER OF MONTHS TO KEEP REQS.
      *C
      *C OCTOBER 1999  JE COFFMAN
      *C    ADDED OPTION FOR MEDICINE HAT TO ALLOW REQUISITIONS TO BE
      *C    PASSED FROM CSIS TO SYNERGY R/3.
      *C
      *C JUNE 2002     CA YODER    LAWTON REQUEST
      *C    ADDED OPTION TO SPECIFY IF REQUISITION BUDGET AMOUNT SHOULD
      *C    BE CHECKED AT PO ITEM CREATION.  IF SO, SPECIFY THE
      *C    PERCENTAGE AS WELL.
      *C

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT DISPLAY-FILE
                   ASSIGN TO WORKSTATION-ZSTARTUP-SI
                   ORGANIZATION IS TRANSACTION
                   ACCESS IS SEQUENTIAL
                   FILE STATUS IS DISPLAY-STATUS
                   CONTROL-AREA IS WS-CONTROL.
            SELECT MPLTINFO-O
                   ASSIGN TO DATABASE-MCFLCS0501
                   ORGANIZATION IS INDEXED
                   ACCESS IS DYNAMIC
                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                       PIC X(2000).
       FD  MPLTINFO-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-O-REC.
           COPY DDS-MCRPCS0500 OF MCFLCS0501.
       WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1                 PIC X VALUE SPACE.
           05  FILE-STATUS-2                 PIC X VALUE SPACE.

      *************************************************************
      **                                                         **
      **              D A T A    B A S E    A R E A              **
      **                                                         **
      *************************************************************
      *************************************************************

       COPY MPLTINFO IN COPYLIB.
       COPY DBSTAT IN COPYLIB.
       01  MPLTINFO-ARG                    PIC X(4).
       01  MESSAGE-BUFFER.
           05  MSG-TEXT                    PIC X(64)  VALUE SPACES.
           05  MSG-FLD                     PIC X(12)  VALUE SPACES.
           05  MSG-FLD-9 REDEFINES MSG-FLD
                                           PIC Z(11)9.
      *************************************************************
      *************************************************************
      **                                                         **
      **                 TERMINAL I/O DATA AREA                  **
      **                                                         **
      *************************************************************
      *************************************************************

       01  REQ-OPTION-SCREEN.
           05  CURRENCY-SW               PIC X(1).
           05  ACCT-DATA-SW              PIC X(1).
           05  DEPT-EXP-REQ-SW           PIC X(1).
           05  REQUIRE-USERID            PIC X(1).
           05  DELT-REQS-SW              PIC X(1).
           05  DELT-MONTHS               PIC 9(2).
           05  SYNR3-SW                  PIC X(1).
           05  PRNT-MSGLINE2             PIC X(79).
           05  CMDLINE2                  PIC X(79).
           05  ERR-MSGLINE2              PIC X(79).

       01  REQ-OPTION-SCREEN-2.
           05  FIN-OR-FIR-SW             PIC X(1).
           05  AUTH-FLAG-SW              PIC X(1).
           05  AUTH-EXP                  PIC X(6).
           05  RQ-COMPARE-PRICE-SW       PIC X(1).
           05  RQ-COMPARE-PERCENT        PIC 9V99.
           05  CMDLINE-2                 PIC X(79).
           05  ERR-MSGLINE-2             PIC X(79).

       COPY TBLOWUP IN COPYLIB.
       COPY CATREAD IN COPYLIB.
       COPY DISPDATA IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.

      *************************************************************
      *************************************************************
      **                                                         **
      **               LINKAGE   SECTION                         **
      **                                                         **
      *************************************************************
      *************************************************************

       LINKAGE SECTION.

       01  BASE                          PIC X(10).

       COPY VCOMLINK IN COPYLIB.

       COPY LANGSUB IN COPYLIB.


      *************************************************************
      **#########################################################**
      *************************************************************
      **                                                         **
      **          P R O C E D U R E    D I V I S I O N           **
      **                                                         **
      *************************************************************
      **#########################################################**
      *************************************************************

       PROCEDURE DIVISION USING BASE,
                                VIEW-COMAREA,
                                LANGUAGE-PARMS.


       MAIN-PGM SECTION 01.

       BEGIN-HERE.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-X.
           PERFORM 2-EOJ.

       1-HSK.
           MOVE "SPRQUSER" TO BU-PGM-NAME.
           OPEN I-O DISPLAY-FILE, MPLTINFO-O.

       2-EOJ.
           CLOSE DISPLAY-FILE, MPLTINFO-O.
           GOBACK.

      ******************************************************
      **                 BLOWUP ROUTINE                   **
      ******************************************************

       2-BLOWUP.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
               BU-DISPLAY-AREA.

      **************************************************
      *                                                *
      *                  6 - M A I N                   *
      *                                                *
      **************************************************

       6-MAIN.
           MOVE SPACES TO REQ-OPTION-SCREEN.

       6-READ-DATABASE.
           PERFORM 62-READ-MPLTINFO.

       6-PERFORM-PAGES.
           MOVE "REQ1" TO VIEW-NFNAME.
           PERFORM 61-PAGE-1  THRU 61-PAGE-1-X.
           MOVE "REQ2" TO VIEW-NFNAME.
           PERFORM 62-PAGE-1  THRU 62-PAGE-1-X.

       6-MAIN-X.
           EXIT.

       61-PAGE-1.
       61-PUT-BUFFER.

      ***  INPUT DATA ABOVE AND PRESS 'ENTER'  ***
           MOVE   9 TO LANG-SETNUM.
           MOVE  20 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO PRNT-MSGLINE2.

       61-SHOW-FORM.
           MOVE REQ-OPTION-SCREEN TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC TO REQ-OPTION-SCREEN.
           IF VIEW-LASTKEY = 3
               GO TO 61-PAGE-1-X.
           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERR-MSGLINE2
               MOVE B"1" TO IND(99)
               GO TO 61-SHOW-FORM.

       61-REPLACE-MPLTINFO.
           MOVE "PREQ"                 TO MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           MOVE CURRENCY-SW            TO MPLTINFO-REQ-CURR-SW.
           MOVE DELT-REQS-SW           TO MPLTINFO-REQ-DEL-SW.
           IF DELT-REQS-SW = "N"
               MOVE 0                  TO MPLTINFO-REQ-DEL-MTH
           ELSE
               MOVE DELT-MONTHS        TO MPLTINFO-REQ-DEL-MTH.
           MOVE SYNR3-SW               TO MPLTINFO-REQ-SYNR3-SW.
           MOVE FIN-OR-FIR-SW          TO MPLTINFO-FIN-OR-FIR-SW.
           MOVE AUTH-FLAG-SW           TO MPLTINFO-AUTH-FLAG-SW.
           IF AUTH-FLAG-SW = "Y"
               IF AUTH-EXP NOT = "      "
                   MOVE AUTH-EXP       TO MPLTINFO-AUTH-EXP.
           PERFORM 9-REWRITE-MPLTINFO.

           MOVE "PDER"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           MOVE DEPT-EXP-REQ-SW        TO  MPLTINFO-PDER-SW.
           MOVE REQUIRE-USERID         TO  MPLTINFO-PDER-USERID.
           PERFORM 9-REWRITE-MPLTINFO.

           MOVE "PACD"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           MOVE ACCT-DATA-SW           TO  MPLTINFO-PACD-SW.
           PERFORM 9-REWRITE-MPLTINFO.

       61-PAGE-1-X.
           EXIT.

       62-PAGE-1.
       62-PUT-BUFFER.

      ***  INPUT DATA ABOVE AND PRESS 'ENTER'  ***
           MOVE   9 TO LANG-SETNUM.
           MOVE  20 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO PRNT-MSGLINE2.

       62-SHOW-FORM.
           MOVE REQ-OPTION-SCREEN-2 TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC TO REQ-OPTION-SCREEN-2.
           IF VIEW-LASTKEY = 3
               GO TO 62-PAGE-1-X.
           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERR-MSGLINE2
               MOVE B"1" TO IND(99)
               GO TO 62-SHOW-FORM.

       62-REPLACE-MPLTINFO.
           MOVE "PREQ"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           MOVE FIN-OR-FIR-SW          TO  MPLTINFO-FIN-OR-FIR-SW.
           MOVE AUTH-FLAG-SW           TO  MPLTINFO-AUTH-FLAG-SW.
           IF AUTH-FLAG-SW = "Y"
               IF AUTH-EXP NOT = "      "
                   MOVE AUTH-EXP       TO  MPLTINFO-AUTH-EXP.
           MOVE RQ-COMPARE-PRICE-SW    TO MPLTINFO-RQ-COMPARE-PRICE-SW.
           IF RQ-COMPARE-PRICE-SW NOT = "Y"
               MOVE 0                  TO MPLTINFO-RQ-COMPARE-PERCENT
           ELSE
           MOVE RQ-COMPARE-PERCENT     TO MPLTINFO-RQ-COMPARE-PERCENT.
           PERFORM 9-REWRITE-MPLTINFO.

       62-PAGE-1-X.    EXIT.

       62-READ-MPLTINFO.
           MOVE "PREQ"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           IF FILE-STATUS-1 = "2"
               MOVE SPACES             TO  BUF-MPLTINFO
               MOVE "PREQ"             TO  MPLTINFO-KEY
               MOVE "N"                TO  MPLTINFO-REQ-CURR-SW
                                           CURRENCY-SW
               PERFORM 9-WRITE-MPLTINFO
           ELSE
               IF MPLTINFO-RQ-COMPARE-PRICE-SW = SPACES
                   MOVE "N"            TO  RQ-COMPARE-PRICE-SW
               ELSE
                   MOVE MPLTINFO-RQ-COMPARE-PRICE-SW
                                               TO  RQ-COMPARE-PRICE-SW
               END-IF
               IF MPLTINFO-RQ-COMPARE-PERCENT NOT NUMERIC
                   MOVE 0              TO  RQ-COMPARE-PERCENT
               ELSE
                   MOVE MPLTINFO-RQ-COMPARE-PERCENT
                                       TO  RQ-COMPARE-PERCENT
               END-IF
               IF MPLTINFO-REQ-CURR-SW = SPACES
                   MOVE "N"            TO  CURRENCY-SW
               ELSE
                   MOVE MPLTINFO-REQ-CURR-SW   TO  CURRENCY-SW
               END-IF
               IF MPLTINFO-REQ-DEL-SW = SPACES
                   MOVE "N"                    TO  DELT-REQS-SW
               ELSE
                   MOVE MPLTINFO-REQ-DEL-SW    TO  DELT-REQS-SW
               END-IF
               IF MPLTINFO-REQ-DEL-MTH NOT NUMERIC
                   MOVE 0                      TO  DELT-MONTHS
               ELSE
                   MOVE MPLTINFO-REQ-DEL-MTH   TO  DELT-MONTHS
               END-IF
               IF MPLTINFO-REQ-SYNR3-SW = SPACES
                   MOVE "N"                    TO  SYNR3-SW
               ELSE
                   MOVE MPLTINFO-REQ-SYNR3-SW  TO  SYNR3-SW
               END-IF
               IF MPLTINFO-FIN-OR-FIR-SW = " "
                   MOVE "N"           TO  MPLTINFO-FIN-OR-FIR-SW
               ELSE
                   MOVE MPLTINFO-FIN-OR-FIR-SW TO  FIN-OR-FIR-SW
               END-IF
               IF MPLTINFO-AUTH-FLAG-SW = " "
                   MOVE "N"           TO  MPLTINFO-AUTH-FLAG-SW
                                          AUTH-FLAG-SW
               ELSE
               MOVE MPLTINFO-AUTH-FLAG-SW      TO  AUTH-FLAG-SW
               MOVE MPLTINFO-AUTH-EXP          TO  AUTH-EXP
               END-IF.

           MOVE "PDER"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           IF FILE-STATUS-1 = "2"
               MOVE SPACES             TO  BUF-MPLTINFO
               MOVE "PDER"             TO  MPLTINFO-KEY
               MOVE "Y"                TO  MPLTINFO-PDER-SW
               MOVE "N"                TO  MPLTINFO-PDER-USERID
               PERFORM 9-WRITE-MPLTINFO
           ELSE
           MOVE MPLTINFO-PDER-SW       TO  DEPT-EXP-REQ-SW
           MOVE MPLTINFO-PDER-USERID   TO  REQUIRE-USERID.

           MOVE "PACD"                 TO  MPLTINFO-ARG.
           PERFORM 9-READ-MPLTINFO.
           IF FILE-STATUS-1 = "2"
               MOVE SPACES             TO  BUF-MPLTINFO
               MOVE "PACD"             TO  MPLTINFO-KEY
               MOVE "Y"                TO  MPLTINFO-PACD-SW
               PERFORM 9-WRITE-MPLTINFO
           ELSE
           MOVE MPLTINFO-PACD-SW       TO  ACCT-DATA-SW.

       9-READ-MPLTINFO.
           MOVE 0                      TO  COND-WORD.
           MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               NEXT SENTENCE
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "READ MPLTINFO ERROR IN 9-READ-MPLTINFO"
                                       TO  BU-DISPLAY-MSG
               MOVE MPLTINFO-ARG       TO  BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

       9-REWRITE-MPLTINFO.
           REWRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "REWRITE  ERROR IN 9-REWRITE-MPLTINFO"
                                       TO  BU-DISPLAY-MSG
               MOVE MPLTINFO-KEY       TO  BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

       9-WRITE-MPLTINFO.
           WRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "WRT MPLTINFO ERROR IN 9-WRITE-MPLTINFO"
                                       TO  BU-DISPLAY-MSG
               MOVE MPLTINFO-KEY       TO  BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

       COPY DISPCALL IN COPYLIB.
      *********************************************************
       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.
