       IDENTIFICATION DIVISION.
       PROGRAM-ID.     SPSEDISP.
       AUTHOR.         CA YODER.
       INSTALLATION.   THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
       DATE-WRITTEN.   OCTOBER 1995.
       DATE-COMPILED.
      *REMARKS.
      **************************************************************
      *                                                            *
      *D   SPSEDISP     SYSTEM DISPLAY VALUES SUBPROGRAM           *
      *                                                            *
      *D   ** COPIED FROM SMSCINFO AND MODIFIED **                 *
      *D                                                           *
      *D   CALLED BY:  TSETOPT                                     *
      *D                                                           *
      **************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA,
                      LOCAL-DATA   IS LOCAL-DATA-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT DISPLAY-FILE
                   ASSIGN TO WORKSTATION-ZSTARTUP-SI
                   ORGANIZATION IS TRANSACTION
                   ACCESS IS SEQUENTIAL
                   FILE STATUS IS DISPLAY-STATUS
                   CONTROL-AREA IS WS-CONTROL.
            SELECT MPLTINFO-O
                   ASSIGN TO DATABASE-MCFLCS0501
                   ORGANIZATION IS INDEXED
                   ACCESS IS DYNAMIC
                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   FILE STATUS IS FILE-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC             PIC X(2000).
       FD  MPLTINFO-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-O-REC.
           COPY DDS-MCRPCS0500 OF MCFLCS0501.

       WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1        PIC X VALUE SPACE.
           05  FILE-STATUS-2        PIC X VALUE SPACE.
       01  CARRY-COST-FIGURES.
           05  CARRY-COST-PERCENT     PIC 9V9(2)  VALUE ZEROES.
           05  CARRY-COST-OUT         PIC 9(2)    VALUE ZEROES.
       01  SAVE-EURO-DATE-FORMAT      PIC X(3)    VALUE "NO ".
      *************************************************************
      **                                                         **
      **              D A T A    B A S E    A R E A              **
      **                                                         **
      *************************************************************
      *************************************************************

       COPY MPLTINFO IN COPYLIB.
       COPY DBSTAT   IN COPYLIB.
       01  MPLTINFO-ARG                    PIC X(4).
       01  MESSAGE-BUFFER.
           05  MSG-TEXT                    PIC X(64)  VALUE SPACES.
           05  MSG-FLD                     PIC X(12)  VALUE SPACES.
           05  MSG-FLD-9 REDEFINES MSG-FLD
                                           PIC Z(11)9.

      **************************************************************
      **                                                          **
      **            C O M M A N D   A R E A                       **
      **                                                          **
      **************************************************************
       COPY CCHKOBJ IN COPYLIB.
       COPY CCRTFILE IN COPYLIB.
       COPY CDLTFILE IN COPYLIB.
      *************************************************************
      *************************************************************
      **                                                         **
      **                 TERMINAL I/O DATA AREA                  **
      **                                                         **
      *************************************************************
      *************************************************************

       01  MISC-SCREEN.
           05  LANG-INFO.
               10  LANG1                 PIC X(3).
               10  LANG2                 PIC X(3).
           05  ALT-DECI-FORMAT           PIC X(1).
           05  EURO-DATE-FORMAT          PIC X(1).
           05  MISC-MSGLINE              PIC X(79).
           05  CMDLINE                   PIC X(79).
           05  ERR-MSGLINE               PIC X(79).

       COPY TBLOWUP    IN COPYLIB.
       COPY CATREAD    IN COPYLIB.
       COPY DISPDATA   IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.
       COPY JCWAREA    IN COPYLIB.

      *************************************************************
      *************************************************************
      **                                                         **
      **               LINKAGE   SECTION                         **
      **                                                         **
      *************************************************************
      *************************************************************

       LINKAGE SECTION.

       01  BASE                          PIC X(10).
       COPY VCOMLINK IN COPYLIB.
       COPY LANGSUB IN COPYLIB.


      *************************************************************
      **#########################################################**
      *************************************************************
      **                                                         **
      **          P R O C E D U R E    D I V I S I O N           **
      **                                                         **
      *************************************************************
      **#########################################################**
      *************************************************************

       PROCEDURE DIVISION USING BASE,
                                VIEW-COMAREA,
                                LANGUAGE-PARMS.


       MAIN-PGM SECTION 01.

       BEGIN-HERE.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-X.
           PERFORM 2-EOJ.

       1-HSK.
           MOVE "SPSEDISP" TO BU-PGM-NAME.
           OPEN I-O DISPLAY-FILE, MPLTINFO-O.
           ACCEPT MC-LOCAL-DATA-AREA FROM LOCAL-DATA-AREA.

       2-EOJ.
           CLOSE DISPLAY-FILE, MPLTINFO-O.
           GOBACK.

      ******************************************************
      **                 BLOWUP ROUTINE                   **
      ******************************************************

       2-BLOWUP.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
               BU-DISPLAY-AREA.


      **************************************************
      *                                                *
      *                  6 - M A I N                   *
      *                                                *
      **************************************************

       6-MAIN.
           MOVE SPACES TO MISC-SCREEN.
           PERFORM 61-READ-MPLTINFO.

       6-PUT-BUFFER.

      ***  INPUT DATA ABOVE AND PRESS 'ENTER'  ***
           MOVE   9 TO LANG-SETNUM.
           MOVE  20 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO MISC-MSGLINE.

       6-SHOW-FORM.
           MOVE "SYSVAL"  TO VIEW-NFNAME.
           MOVE MISC-SCREEN TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC TO MISC-SCREEN.

       6-READ-FIELDS.
           IF VIEW-LASTKEY = 3
               GO TO 6-MAIN-X.
           IF VIEW-LASTKEY = 1
               PERFORM 62-HELP-SCREEN THRU 62-HELP-SCREEN-X
               GO TO 6-SHOW-FORM
           ELSE
           IF VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERR-MSGLINE
               MOVE B"1" TO IND(99)
               GO TO 6-SHOW-FORM.

       6-REPLACE-MPLTINFO.
           MOVE "PLAN" TO MPLTINFO-ARG, BU-DISPLAY-FLD (1).
           MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE SPACES TO BUF-MPLTINFO
               MOVE "PLAN" TO MPLTINFO-KEY
               MOVE LANG1  TO PRIMARY-LANGUAGE
               MOVE LANG2  TO SECONDARY-LANGUAGE
               WRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-WRITE
               IF FILE-STATUS NOT = "00"
                   MOVE "5WRT MPLTINFO ERROR IN 6-REPLACE-MPLTINFO"
                       TO BU-DISPLAY-MSG
                   PERFORM 2-BLOWUP
               ELSE
                   NEXT SENTENCE
           ELSE
           IF FILE-STATUS = "00"
               MOVE LANG1  TO PRIMARY-LANGUAGE
               MOVE LANG2  TO SECONDARY-LANGUAGE
               REWRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-REWRITE
               IF FILE-STATUS NOT = "00"
                   MOVE "5REWRITE ERROR IN 6-REPLACE-MPLTINFO"
                       TO BU-DISPLAY-MSG
               ELSE
                   NEXT SENTENCE
           ELSE
               MOVE "5READ MPLTINFO ERROR IN 6-REPLACE-MPLTINFO"
                   TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.


           MOVE "PDEC" TO MPLTINFO-ARG, BU-DISPLAY-FLD (1).
           MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               IF ALT-DECI-FORMAT = SPACES
                   DELETE MPLTINFO-O
                       INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                   END-DELETE
                   IF FILE-STATUS NOT = "00"
                      MOVE "6DEL MPLTINFO ERROR IN 6-REPLACE-MPLTINFO"
                          TO BU-DISPLAY-MSG
                      PERFORM 2-BLOWUP
                   ELSE
                      NEXT SENTENCE
               ELSE
                   NEXT SENTENCE
           ELSE
           IF FILE-STATUS-1 = "2"
               IF ALT-DECI-FORMAT = "X"
                   MOVE "PDEC" TO MPLTINFO-KEY
                   MOVE SPACES TO MPLTINFO-DATA
                   WRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
                      INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                   END-WRITE
                   IF FILE-STATUS NOT = "00"
                       MOVE "7WRT ERR IN 6-REPLACE-MPLTINFO"
                           TO BU-DISPLAY-MSG
                       PERFORM 2-BLOWUP
                   ELSE
                       NEXT SENTENCE
               ELSE
                   NEXT SENTENCE
           ELSE
               MOVE "7READ MPLTINFO ERROR IN 6-REPLACE-MPLTINFO"
                   TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

           IF SAVE-EURO-DATE-FORMAT = "YES"
               MOVE "NO" TO SAVE-EURO-DATE-FORMAT
               IF EURO-DATE-FORMAT = "X"
                   NEXT SENTENCE
               ELSE
      **************************************
      **
      **   EUROPEAN DATECODE NO LONGER WANTED
      **
      **************************************
                  MOVE "DATECODE"      TO  DLTFILE-FILE-NAME
                  CALL "CDLTFILE" USING DLTFILE-LIB-NAME,
                                        DLTFILE-FILE-NAME,
                                        DLTFILE-RETURN-STATUS
                  IF DLTFILE-RETURN-STATUS NOT = "00"
                   MOVE "DLTFILE DATECODE FAILED" TO BU-DISPLAY-MSG
                   MOVE DLTFILE-RETURN-STATUS     TO BU-DISPLAY-FLD (1)
                   GO TO 2-BLOWUP
               ELSE
                   NEXT SENTENCE
           ELSE
           IF EURO-DATE-FORMAT = "X"
      **************************************
      **
      **   EUROPEAN DATE FORMAT WANTED
      **
      **************************************
               MOVE "DATECODE" TO  CCRTFILE-FILE
               MOVE 1          TO  CCRTFILE-RECORD-LENGTH,
                                   CCRTFILE-NO-RECORDS,
                                   CCRTFILE-INCREMENT-AMT,
                                   CCRTFILE-NO-INCREMENTS
               CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                     CCRTFILE-FILE,
                                     CCRTFILE-RECORD-LENGTH,
                                     CCRTFILE-NO-RECORDS,
                                     CCRTFILE-INCREMENT-AMT,
                                     CCRTFILE-NO-INCREMENTS,
                                     CCRTFILE-STATUS
               IF CCRTFILE-STATUS NOT = "00"
                   MOVE "CCRTFILE CREATE FAILED"  TO  BU-DISPLAY-MSG
                   MOVE CCRTFILE-STATUS          TO  BU-DISPLAY-FLD (1)
                   GO TO 2-BLOWUP.

       6-MAIN-X.
           EXIT.

       61-DELETE-MPLTINFO.
           DELETE MPLTINFO-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 NOT = "2"
                   MOVE "DELETE MPLTINFO ERROR IN 6-DELETE-MPLTINFO"
                       TO BU-DISPLAY-MSG
                   PERFORM 2-BLOWUP.

       61-READ-MPLTINFO.
           MOVE "PLAN" TO MPLTINFO-ARG.
           MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               MOVE PRIMARY-LANGUAGE   TO LANG1
               MOVE SECONDARY-LANGUAGE TO LANG2
           ELSE
           IF FILE-STATUS-1 NOT = "2"
               MOVE "5READ MPLTINFO ERROR IN 61-READ-MPLTINFO"
                   TO BU-DISPLAY-MSG
               MOVE "PLAN" TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

           MOVE "PDEC" TO MPLTINFO-ARG.
           MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               MOVE "X" TO ALT-DECI-FORMAT
           ELSE
           IF FILE-STATUS-1 NOT = "2"
               MOVE "6READ MPLTINFO ERROR IN 61-READ-MPLTINFO"
                   TO BU-DISPLAY-MSG
               MOVE "PDEC" TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO PLTINFOKEY OF MPLTINFO-O-REC.
           START MPLTINFO-O KEY > PLTINFOKEY OF MPLTINFO-O-REC
               INVALID KEY MOVE "00" TO FILE-STATUS.

           MOVE "DATECODE"   TO  CHKOBJ-FILE-NAME.
           CALL "CCHKOBJ" USING CHKOBJ-FILE-NAME,
                                CHKOBJ-RETURN-STATUS.
           IF CHKOBJ-RETURN-STATUS  = "00"
               MOVE "YES" TO SAVE-EURO-DATE-FORMAT
               MOVE "X"   TO EURO-DATE-FORMAT.

       62-HELP-SCREEN.
           MOVE "HELP" TO VIEW-NFNAME.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.

       62-HELP-SCREEN-X.
            EXIT.

       COPY DISPCALL IN COPYLIB.
      *********************************************************
       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.
           EXIT.
