001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.    SQTREPRT.
001300 AUTHOR.        BARBARA WINTER.
001400 DATE-WRITTEN.  MAY  1987.
001500*INSTALLATION.  GOODYEAR TIRE AND RUBBER CO.
001600*
001700*REMARKS.
001800*D QUOTE CREATE REPRINT PROGRAM.
001900******************************************************************
002000******************************************************************
002100*                      S Q T R E P R T                           *
002200*    THIS IS THE SCREEN PROGRAM THAT ASKS FOR A QUOTE NUMBER     *
002300*    AND THEN REPRINTS THE QUOTE.                                *
002400******************************************************************
      *C     6/04/94  MARVIN MITCHELL REQUEST #94-017
      *C     ADDED TWO MORE PRINTER OPTIONS FOR PRINTING QUOTES,
      *C     AND LOGIC THAT CHECKS FOR A VALID SELECTION.
      *C
      *C     8/08/94  MARVIN MITCHELL
      *C     CHANGED ALL REFERENCES TO COPYCSIS AND COPYMMIS TO COPYLIB.
      *C
002500 ENVIRONMENT DIVISION.
002600 CONFIGURATION SECTION.
002700 SOURCE-COMPUTER.    HP-3000.
002800 OBJECT-COMPUTER.    HP-3000.
       SPECIAL-NAMES.  I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
002900 INPUT-OUTPUT SECTION.
003000 FILE-CONTROL.
            SELECT DVENDITM3-I
              ASSIGN TO DATABASE-MCFLCS0803
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZUDCQUOT-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS DYNAMIC
                  RELATIVE KEY IS RELATIVE-RECNO
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

003300
003400 DATA DIVISION.
003500 FILE SECTION.
       FD  DVENDITM3-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM3-REC-I.
           COPY DDS-MCRPCS0800  OF MCFLCS0803.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC          PIC X(2000).
003700
004600 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1           PIC X.
           05  FILE-STATUS-2           PIC X.
004800
      *------ WS CONTROL AREA
       01  MAJOR-MINOR                 PIC XXXX.
       01  WS-CONTROL.
           02  FUNCTION-NUM            PIC XX.
                   88  EXIT-KEY-F8-USED                     VALUE "08". LVW000LS
                   88  REFRESH-KEY-F4-USED                  VALUE "04". LVW000LS
                   88  ENTER-KEY-USED                       VALUE "00". LVW000LS
                   88  F1-KEY-USED                          VALUE "01". LVW000LS
                   88  F2-KEY-USED                          VALUE "02". LVW000LS
                   88  F3-KEY-USED                          VALUE "03". LVW000LS
                   88  F4-KEY-USED                          VALUE "04". LVW000LS
                   88  F5-KEY-USED                          VALUE "05". LVW000LS
                   88  F6-KEY-USED                          VALUE "06". LVW000LS
                   88  F7-KEY-USED                          VALUE "07". LVW000LS
                   88  F8-KEY-USED                          VALUE "08". LVW000LS
           02 FUN-KEY REDEFINES FUNCTION-NUM PIC XX.
           02 TERMINAL-ID PIC X(10).
           02 FORMAT-NAME PIC X(10).

       01  DISPLAY-STATUS              PIC X(2).

       01  SRF-INDICATORS.
           05  IND OCCURS 99 TIMES   PIC 1 INDICATOR 01.

       01  RELATIVE-RECNO         PIC 9(9).
       COPY IOFEEDBACK OF COPYLIB.
006600*---------- VSETERROR AND VPUTWINDOW
006700 01  MESSAGE-BUFFER           PIC X(76)  VALUE SPACES.
006800 01  MESSAGE-BUFFER-RD REDEFINES MESSAGE-BUFFER.
006900     05  MSG-BUFFER           PIC X(68).
007000     05  MSG-VALUE            PIC X(8).
007300 01  FIELD-NUMBER             PIC S9(4)  VALUE 1   COMP-4.
008100
008200 COPY TDATECHK OF COPYLIB.
       COPY CATREAD  OF COPYLIB.
008500 01  RET-CODE                 PIC X(2)   VALUE "00".
008600*---------- TBLOWUP (PRINTS ERRORS TO AN ERROR FILE "BLOWUP.PUB" +)
008700*---------- (ABORTS PROGRAM.  RUN XBLPRT.OBJECT TO READ ERRORS.)
008800 01  BU-DISPLAY-MSG           PIC X(60)  VALUE SPACES.
008900 01  BU-PGM-NAME              PIC X(8)   VALUE "SQTREPRT".
009000 01  BU-DISPLAY-AREA          PIC X(110) VALUE ALL "0".
009100 01  BU-DISPLAY-FLDS REDEFINES BU-DISPLAY-AREA.
009200     05  BU-DISPLAY-LINE OCCURS 5 TIMES.
009300         10  BU-DISPLAY-FLD   PIC X(14).
009400         10  BU-DISPLAY-FLD9  PIC S9(8).
030200 01  STRMRPT-COMAREA.
030300     05  STRM-RET-CODE            PIC X(2)  VALUE "00".
030400     05  STRM-MODE                PIC S9(4) VALUE ZEROS COMP-4.
030500     05  STRM-CO-CODE.
030600         10  CO-CODE-PREFIX       PIC X(2)  VALUE SPACES.
030700         10  CO-CODE-LAST-DIGIT   PIC X     VALUE SPACES.
030800     05  STRM-PRE-RUN-CARDS.
030900         10  STRM-PRE-RUN-CARD1   PIC X(80) VALUE SPACES.
031000         10  STRM-PRE-RUN-CARD2   PIC X(80) VALUE SPACES.
031100         10  STRM-PRE-RUN-CARD3   PIC X(80) VALUE SPACES.
031200         10  STRM-PRE-RUN-CARD4   PIC X(80) VALUE SPACES.
031300     05  STRM-RUN-CARD            PIC X(80) VALUE SPACES.
031400     05  STRM-JOB-NAME            PIC X(8)  VALUE "SQTREPRT".
006400     05  AREA1.
006500         07  ST-PRT               PIC 9(2) COMP-4.
006600         07  ST-QUOTE             PIC X(10).
006700         07  ST-PLT               PIC X(3).
006900         07  FILLER               PIC X(65).
           05  PARM2                    PIC X(670).
032800     05  STRM-OPTION-CARD2-CTR    PIC X(1)  VALUE SPACES.
032900     05  STRM-OPTION-CARD3        PIC X(80) VALUE SPACES.
033000     05  STRM-PRTRPT-CARD.
033100         10  STRM-PRTRPT-FLAG     PIC X(1).
033200         10  STRM-PRTRPT-FILE     PIC X(17).
033300         10  STRM-PRTRPT-SPOOLTYP  PIC X(1).
033400         10  STRM-PRTRPT-PRINTER   PIC X(3).
009600
009700 01  MAIN-SCREEN          PIC X(13)  VALUE "QUOTE_REPRINT".
009900 01  SCREEN-BUFFER.
010000     05  SCREEN-QUOTE         PIC X(6)   VALUE SPACES.
           05  SCREEN-PRINTER       PIC X      VALUE "1".
           05  DE-COMMAND-LINE      PIC X(79).
           05  DE-MESSAGE-LINE      PIC X(79).
010100 01  STATUS-AREA.
010200     05  COND-WORD            PIC S9(4)  VALUE ZERO COMP-4.
010300         88  GOOD-CALL                   VALUE 0.
010400         88  END-OF-FILE                 VALUE 11.
010500         88  START-OF-CHAIN              VALUE 14.
010600         88  END-OF-CHAIN                VALUE 15.
010700         88  NO-ENTRY                    VALUE 17.
010800     05  DATA-LENGTH          PIC S9(4)  COMP-4.
010900     05  RCD-NO               PIC S9(9)  COMP-4.
011000     05  CHAIN-LENGTH         PIC S9(9)  COMP-4.
011100     05  BKWD-ADDR            PIC S9(9)  COMP-4.
011200     05  FWRD-ADDR            PIC S9(9)  COMP-4.

       01  QUOTE-PRINTER             PIC 9(2)   COMP-4.
011300
011400 01  QUOTE-ARG.
011500     05  QUOTE-ARG-NUM        PIC X(6)   VALUE SPACES.
011600     05  FILLER               PIC X(4)   VALUE SPACES.
013500
013600 COPY DVENDITM   OF COPYLIB.
013700**************************************************************
013800*           L I N K A G E   S E C T I O N                    *
013900**************************************************************
014000 LINKAGE SECTION.
014100 01  BASE                     PIC X(10).
014200 COPY VCOMLINK OF COPYLIB.
014300 01  FORMFILE                 PIC X(26).
014400 COPY LANGSUB  OF COPYLIB.
014500 01  PASS-SPOOL               PIC S9(2)  COMP-4.
014600 01  PASS-QUOTE-PRT.
014600   05  PASS-QUOTE-PRT-01      PIC 9(2)   COMP-4.
014600   05  PASS-QUOTE-PRT-02      PIC 9(2)   COMP-4.
014600   05  PASS-QUOTE-PRT-LP      PIC 9(2)   COMP-4.
014700 01  PASS-PLANT-CODE.
014800     05  KELLY-PLANT-CHECK    PIC X.
014900     05  FILLER               PIC X(2).
015000
015100*******************************************************************
015200*                     PROCEDURE DIVISION                          *
015300*******************************************************************
015400 PROCEDURE DIVISION USING    BASE,
015500                             VIEW-COMAREA,
015600                             FORMFILE,
015700                             LANGUAGE-PARMS,
015800                             PASS-SPOOL,
015900                             PASS-QUOTE-PRT,
016000                             PASS-PLANT-CODE.
016100
016200 6-MAIN.
           OPEN INPUT DVENDITM3-I.
           OPEN I-O DISPLAY-FILE.
           PERFORM 6-LOOP THRU 6-EXIT.
           CLOSE DVENDITM3-I DISPLAY-FILE.
           GOBACK.
       6-LOOP.
016300*******************************************************************
016400*   PROCESS SCREEN THAT REQUESTS QUOTE NUMBER TO REPRINT          *
016500*******************************************************************
016600     MOVE SPACES                     TO  SCREEN-BUFFER.
           MOVE "000000"                   TO  SCREEN-QUOTE.
           MOVE "1"                        TO  SCREEN-PRINTER.
016700     MOVE MAIN-SCREEN TO VIEW-NFNAME.
018200 6-SHOW-FORM.
           MOVE SCREEN-BUFFER TO DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
              INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO SRF-INDICATORS.
           MOVE DISPLAY-REC TO SCREEN-BUFFER.

      *------ A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *------ IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.
035800
035900     IF VIEW-LASTKEY EQUAL 3 OR 7
036000        GO TO 6-EXIT.
036100
036200     IF VIEW-LASTKEY EQUAL 1 OR
036300        VIEW-LASTKEY EQUAL 2 OR
036400        VIEW-LASTKEY EQUAL 8 OR
036500        VIEW-LASTKEY EQUAL 4 OR
036700        VIEW-LASTKEY EQUAL 6
036800        PERFORM 940-VSETERROR THRU 940-EXIT
036900        GO TO 6-SHOW-FORM.
019300
019900
020000     MOVE SCREEN-QUOTE                    TO QUOTE-ARG.
020100
020200*----------  VALIDATE QUOTE NUMBER
           MOVE 0 TO COND-WORD.
           MOVE QUOTE-ARG TO QUOTENUM OF DVENDITM3-REC-I.
           START DVENDITM3-I KEY = QUOTENUM OF DVENDITM3-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
020500     IF NO-ENTRY
020600*** QUOTE CODE DOES NOT EXIST
020700        MOVE 08                           TO LANG-MSGNUM
020800        MOVE 17                           TO LANG-SETNUM
020900        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
021000        PERFORM 940-VSETERROR THRU 940-EXIT
021100        GO TO 6-SHOW-FORM.
021200     IF NOT GOOD-CALL
021300        MOVE "DBFIND DVENDITM 6-SH SQTREPRT" TO BU-DISPLAY-MSG
021400        PERFORM 990-BLOWUP THRU 990-EXIT.
021500
           MOVE 0 TO COND-WORD.
           READ DVENDITM3-I NEXT INTO BUF-DVENDITM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF QUOTENUM OF DVENDITM3-REC-I NOT = QUOTE-ARG
               MOVE 15 TO COND-WORD.
022000     IF END-OF-CHAIN
022100*** QUOTE CODE DOES NOT EXIST
022200        MOVE 08                           TO LANG-MSGNUM
022300        MOVE 17                           TO LANG-SETNUM
022400        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
022500        PERFORM 940-VSETERROR THRU 940-EXIT
022600        GO TO 6-SHOW-FORM.
022700     IF NOT GOOD-CALL
022800        MOVE "DBGET DVENDITM 6-SH SQTREPRT" TO BU-DISPLAY-MSG
022900        PERFORM 990-BLOWUP THRU 990-EXIT.

       63-VALIDATE-PRINTER.
           IF SCREEN-PRINTER = SPACES
      *--------- YOU MUST SELECT A PRINTER OPTION
            MOVE 25                 TO  LANG-SETNUM
            MOVE 31                 TO  LANG-MSGNUM
            PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
            MOVE 2                     TO  FIELD-NUMBER
            PERFORM 940-VSETERROR THRU 940-EXIT
            GO TO 6-SHOW-FORM
           ELSE
           IF (SCREEN-PRINTER = "1")
             IF (PASS-QUOTE-PRT-01 NOT > 00)
      *--------- PRINTER #1 HAS NOT BEEN DEFINED
               MOVE 16                 TO  LANG-SETNUM
               MOVE 168                TO  LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 2                     TO  FIELD-NUMBER
               PERFORM 940-VSETERROR THRU 940-EXIT
               GO TO 6-SHOW-FORM
             ELSE
               MOVE PASS-QUOTE-PRT-01 TO QUOTE-PRINTER
           ELSE
           IF (SCREEN-PRINTER = "2")
             IF (PASS-QUOTE-PRT-02 NOT > 00)
      *--------- PRINTER #2 HAS NOT BEEN DEFINED
               MOVE 16                 TO  LANG-SETNUM
               MOVE 169                TO  LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 2                     TO  FIELD-NUMBER
               PERFORM 940-VSETERROR THRU 940-EXIT
               GO TO 6-SHOW-FORM
             ELSE
               MOVE PASS-QUOTE-PRT-02 TO QUOTE-PRINTER
           ELSE
           IF (SCREEN-PRINTER = "3")
             IF (PASS-QUOTE-PRT-LP NOT > 00)
      *--------- NO LINE PRINTER HAS BEEN DEFINED
               MOVE 14                 TO  LANG-SETNUM
               MOVE 124                TO  LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 2                     TO  FIELD-NUMBER
               PERFORM 940-VSETERROR THRU 940-EXIT
               GO TO 6-SHOW-FORM
             ELSE
               MOVE PASS-QUOTE-PRT-LP TO QUOTE-PRINTER
           ELSE
      *--------- INVALID SELECTION, ENTER 1, 2, OR 3
               MOVE 09                 TO  LANG-SETNUM
               MOVE 110                TO  LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 2                     TO  FIELD-NUMBER
               PERFORM 940-VSETERROR THRU 940-EXIT
               GO TO 6-SHOW-FORM.

023000
023100*----------  STREAM BATCH PRINT FOR QUOTES WITH > 50 ITEMS
023200*    IF NUM-OF-ITEMS > 50
023300        PERFORM 60-STREAM-REPRINT THRU 60-EXIT
023400*    ELSE
023500*    CALL "CQTPRT" USING QUOTE-ARG, PASS-QUOTE-PRT,
023600*                     LANGUAGE-PARMS, BASE, PASS-PLANT-CODE.
023700
023800        GO TO 6-LOOP.
023900 6-EXIT.     EXIT.
024000
024100*****************************************************
024200*  STREAM PRINT OF QUOTE IF IT HAS > 50 ITEMS       *
024300*****************************************************
024400 60-STREAM-REPRINT.
087000*----------  CREATE REST OF STREAM FILE
           MOVE SPACES TO AREA1, PARM2.
088700     MOVE "TQTBTPRT"                      TO STRM-RUN-CARD.
027500     MOVE QUOTE-ARG TO ST-QUOTE.
027510     MOVE PASS-PLANT-CODE TO ST-PLT.
027600     MOVE QUOTE-PRINTER TO ST-PRT.
088900
           CALL "TSTRMJOB" USING STRMRPT-COMAREA.
           IF STRM-RET-CODE NOT = "00"
              MOVE STRM-RET-CODE TO BU-DISPLAY-FLD9 (1)
              MOVE "STREAM COMMAND FAILED SQTCREAT" TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 990-EXIT.
031500 60-EXIT.  EXIT.
031600*******************************************************************
031700**           P E R F O R M E D     R O U T I N E S               **
031800*******************************************************************
033200 940-VSETERROR.
           MOVE B"1" TO IND (99).
           MOVE B"1" TO IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE.
034500 940-EXIT.  EXIT.

035700 990-BLOWUP.
035800     MOVE VIEW-NFNAME                      TO BU-DISPLAY-FLD (1).
035900     MOVE QUOTE-ARG                        TO BU-DISPLAY-FLD (2).
036000     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
036100                   VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG     ,
036200                   BU-DISPLAY-FLDS.
036300 990-EXIT.     EXIT.
036400
036500 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
038100 999-CATREAD-EXIT.
038200      EXIT.
