       IDENTIFICATION DIVISION.
       PROGRAM-ID.    SQTSYSGN.
       AUTHOR.        BARBARA WINTER.
       DATE-WRITTEN.  SEPTEMBER l987.
      *INSTALLATION.  GOODYEAR TIRE AND RUBBER CO.

      *REMARKS.
      *D CREATE A SYSTEM GENERATED QUOTE
      ******************************************************************
      ******************************************************************
      *                      S Q T S Y S G N                           *
      *   THIS SCREEN PROGRAM WILL VALIDATE ENTERED DATA AND THEN      *
      * CREATE A QUOTE FROM A PURCHASE ORDER, ANOTHER QUOTE, OR A      *
      * REQUISITION BY KICKING OFF A JOBSTREAM TO DO THE ACTUAL        *
      * CREATION.  UP TO 5 VENDORS MAY BE ENTERED.                     *
      * A NEW QUOTE MAY BE CREATED IN THE OLD DOCUMENT ORDER AND IN    *
      * SORTED CODE ORDER. (REQUISITIONS OF COURSE HAVE ONLY ONE CODE) *
      ******************************************************************
      *C     6/04/94  MARVIN MITCHELL REQUEST #94-017
      *C     ADDED TWO MORE PRINTER OPTIONS FOR PRINTING QUOTES,
      *C     AND LOGIC THAT CHECKS FOR A VALID SELECTION.
      *C
      *C     8/08/94  MARVIN MITCHELL
      *C     CHANGED ALL REFERENCES OF COPYMMIS AND COPYCSIS TO COPYLIB.
      *C
      *C     5/03/95  WILL MCINTYRE   REQUEST #95-007
      *C     ADDED CALL TO TALTVENK TO ALLOW USER TO ENTER AN
      *C     ALTERNATE KEY, AND HAVE THE LINKED VENDOR CODE
      *C     SUBSTITUTED IN THE ALTERNATE KEY'S PLACE.
      *C
      *C     8/13/96  WILL MCINTYRE   REQUEST #96-009
      *C     ADDED LOGIC TO ALLOW USER TO REQUEST A SYSTEM-GENERATED
      *C     QUOTE BY COMBINATION OF MANUFACTURER AND KEYWORD MODIFIER.
      *C
      *C     8/14/96  WILL MCINTYRE
      *C     MADE REVISIONS FOR END OF CENTURY COMPATABILITY.
      *C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.    HP-3000.
       OBJECT-COMPUTER.    HP-3000.
       SPECIAL-NAMES.  I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZUDCQUOT-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS DYNAMIC
                  RELATIVE KEY IS RELATIVE-RECNO
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.
            SELECT DVENDOR-I
              ASSIGN TO DATABASE-MCFLCS0701
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT DVENDITM3-I
              ASSIGN TO DATABASE-MCFLCS0803
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT DVENDITM5-I
              ASSIGN TO DATABASE-MCFLCS0805
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT MSTORERM-I
              ASSIGN TO DATABASE-MCFLCS0201
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
              FILE STATUS IS FILE-STATUS.
            SELECT DQUOTEXT-I
              ASSIGN TO DATABASE-MCFLCS3801
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT DQUOTEXT-O
              ASSIGN TO DATABASE-MCFLCS3801
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT MBUYER-I
              ASSIGN TO DATABASE-MCFLCS0601
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT DREQITM-I
              ASSIGN TO DATABASE-MCFLCS2201
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT MPORCV-I
              ASSIGN TO DATABASE-MCFLCS0101
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
              FILE STATUS IS FILE-STATUS.
            SELECT MPLTINFO-O
              ASSIGN TO DATABASE-MCFLCS0501
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
              FILE STATUS IS FILE-STATUS.
            SELECT DMANPART-I
              ASSIGN TO DATABASE-MCFLCS3601
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT DCODE-I
              ASSIGN TO DATABASE-MCFLCS3401
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT MMANUFACT-I
              ASSIGN TO DATABASE-MCFLCS3501
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
              FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                   PIC X(2000).
       FD  DVENDOR-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-REC-I.
           COPY DDS-MCRPCS0700  OF MCFLCS0701.
       FD  DVENDITM3-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM3-REC-I.
           COPY DDS-MCRPCS0800  OF MCFLCS0803.
       FD  DVENDITM5-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM5-REC-I.
           COPY DDS-MCRPCS0800  OF MCFLCS0805.
       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.
       FD  DQUOTEXT-I
           LABEL RECORDS ARE STANDARD.
       01  DQUOTEXT-REC-I.
           COPY DDS-MCRPCS3800  OF MCFLCS3801.
       FD  DQUOTEXT-O
           LABEL RECORDS ARE STANDARD.
       01  DQUOTEXT-REC-O.
           COPY DDS-MCRPCS3800  OF MCFLCS3801.
       FD  MBUYER-I
           LABEL RECORDS ARE STANDARD.
       01  MBUYER-REC-I.
           COPY DDS-MCRPCS0600  OF MCFLCS0601.
       FD  DREQITM-I
           LABEL RECORDS ARE STANDARD.
       01  DREQITM-REC-I.
           COPY DDS-MCRPCS2200  OF MCFLCS2201.
       FD  MPORCV-I
           LABEL RECORDS ARE STANDARD.
       01  MPORCV-REC-I.
           COPY DDS-MCRPCS0100  OF MCFLCS0101.
       FD  MPLTINFO-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-O.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.
       FD  DMANPART-I.
       01  DMANPART-REC-I.
           COPY DDS-MCRPCS3600  OF MCFLCS3601.
       FD  DCODE-I.
       01  DCODE-REC-I.
           COPY DDS-MCRPCS3400  OF MCFLCS3401.
       FD  MMANUFACT-I
           LABEL RECORDS ARE STANDARD.
       01  MMANUFACT-REC-I.
           COPY DDS-MCRPCS3500  OF MCFLCS3501.
       WORKING-STORAGE SECTION.
       77  RET-CODE-TALTVENK             PIC X(02)  VALUE "00".
       77  BASE-TALTVENK                 PIC X(20).
       77  ALT-KEY-ARG                   PIC X(10).
       77  ALT-VEND-CODE                 PIC X(10).

       01  RELATIVE-RECNO                PIC 9(9).
       01  SEL-COUNT                     PIC 9.

      *------ WS CONTROL AREA
       01  MAJOR-MINOR                   PIC XXXX.
       01  WS-CONTROL.
           02  FUNCTION-NUM              PIC XX.
                   88  EXIT-KEY-F8-USED                     VALUE "08". LVW000LS
                   88  REFRESH-KEY-F4-USED                  VALUE "04". LVW000LS
                   88  ENTER-KEY-USED                       VALUE "00". LVW000LS
                   88  F1-KEY-USED                          VALUE "01". LVW000LS
                   88  F2-KEY-USED                          VALUE "02". LVW000LS
                   88  F3-KEY-USED                          VALUE "03". LVW000LS
                   88  F4-KEY-USED                          VALUE "04". LVW000LS
                   88  F5-KEY-USED                          VALUE "05". LVW000LS
                   88  F6-KEY-USED                          VALUE "06". LVW000LS
                   88  F7-KEY-USED                          VALUE "07". LVW000LS
                   88  F8-KEY-USED                          VALUE "08". LVW000LS
           02 FUN-KEY REDEFINES FUNCTION-NUM PIC XX.
           02 TERMINAL-ID                PIC X(10).
           02 FORMAT-NAME                PIC X(10).

       01  DISPLAY-STATUS                PIC X(2).

       01  SRF-INDICATORS.
           05  IND OCCURS 99 TIMES       PIC 1 INDICATOR 01.

       COPY IOFEEDBACK IN COPYLIB.
       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X.
           05  FILE-STATUS-2             PIC X.
       01  MULTIPLE-VENDORS              PIC X     VALUE "N".
       01  X                             PIC 9(2)  VALUE ZEROES.
       01  N                             PIC 9(2)  VALUE ZEROES.
       01  HELP-FORMNAME                 PIC X(6)  VALUE SPACES.

       01  ACCEPT-DATA1.
           05  ACCEPT-BUYER              PIC X(4).
           05  ACCEPT-RETURN-DATE        PIC X(8)  VALUE SPACES.
           05  ACCEPT-PRINTER            PIC 9(2).
      *--  "S"=STANDARD PARAGRAPH, " "=UNIQUE PARAGRAPH
           05  PARAGRAPH-TYPE            PIC X     VALUE SPACES.
      *--  PO NUMBER, QUOTE NUMBER, OR REQUISITION NUMBER
           05  ACCEPT-DOCUMENT           PIC X(12) VALUE SPACES.
      *--  "P"=PO, "Q"=QUOTE, "R"=REQUISITION
      *--  "K"=KEYWORD, "S"=KEYWORD ONLY, "M"=MANUFACTURER,
      *--  "X"=CROSS-REFERENCE (KEYWORD(MODIFIER) AND MANUFACTURER)
           05  ACCEPT-DOC-TYPE           PIC X     VALUE SPACE.
           05  ACCEPT-SORT               PIC X     VALUE SPACE.
           05  ACCEPT-QUOTE-REF          PIC 9(4)  VALUE ZEROES.
           05  FILLER                    PIC X(47) VALUE SPACES.
       01  ACCEPT-DATA2.
           05  INFO-LINE-ACCEPT OCCURS 5 TIMES.
               10  VENDOR                PIC X(10).
               10  ACCEPT-QUOTE          PIC X(6).
       01  ACCEPT-DATA3.
           05  ACCEPT-KEYWORD            PIC X(50).
           05  FILLER                    PIC X(30).
       01  ACCEPT-DATA4.
           05  ACCEPT-MANUFACTURER       PIC X(26).
           05  FILLER                    PIC X(54).

       01  CY-TODAY-DATE.
           05  TODAY-CENT                PIC X(2)  VALUE SPACES.
           05  TODAY-DATE.
               10  TODAY-YEAR            PIC X(2)  VALUE SPACES.
               10  FILLER                PIC X(4)  VALUE SPACES.

       01  CY-RETURN-DATE.
           05  RETURN-CENT               PIC X(2)  VALUE SPACES.
           05  RETURN-DATE.
               10  RETURN-YEAR           PIC X(2)  VALUE SPACES.
               10  FILLER                PIC X(4)  VALUE SPACES.

       01  TERMFILENAME                  PIC X(11) VALUE "TERM;".

      *---------- VSETERROR AND VPUTWINDOW
       01  MESSAGE-BUFFER                PIC X(76)  VALUE SPACES.
       01  MESSAGE-BUFFER-RD REDEFINES MESSAGE-BUFFER.
           05  MSG-BUFFER                PIC X(68).
           05  MSG-VALUE                 PIC X(8).
       01  MESSAGE-BUFLEN                PIC S9(4)  VALUE 76  COMP-4.
       01  MESSAGE-ACTLEN                PIC S9(4)  VALUE 0   COMP-4.
       01  FIELD-NUMBER                  PIC S9(4)  VALUE 1   COMP-4.
       01  RETURN-STATUS                 PIC X      VALUE SPACE.

       COPY CSTRMJB2 IN COPYLIB.
       COPY CATREAD  IN COPYLIB.
       COPY TDATECHK IN COPYLIB.
       COPY CRFMTKWM IN COPYLIB.
       COPY CRFMTMFR IN COPYLIB.

       01  RET-CODE                      PIC X(2)   VALUE "00".
      *---------- TBLOWUP (PRINTS ERRORS TO AN ERROR FILE "BLOWUP.PUB" +)
      *---------- (ABORTS PROGRAM.  RUN XBLPRT.OBJECT TO READ ERRORS.)
       01  BU-DISPLAY-MSG                PIC X(60)  VALUE SPACES.
       01  BU-PGM-NAME                   PIC X(8)   VALUE "SQTSYSGN".
       01  BU-DISPLAY-AREA               PIC X(110) VALUE ALL "0".
       01  BU-DISPLAY-FLDS REDEFINES BU-DISPLAY-AREA.
           05  BU-DISPLAY-LINE OCCURS 5 TIMES.
               10  BU-DISPLAY-FLD        PIC X(14).
               10  BU-DISPLAY-FLD9       PIC S9(8).
       01  KSAM-STATUS-AREA              PIC X(2)   VALUE "00".

       01      MAIN-SCREEN               PIC X(12)  VALUE "QWORKSHEET".
       01      QUOTE-TEXT                PIC X(10)  VALUE "QUOTE_TEXT".

       01  SCREEN-BUFFER.
           05  V-PO.
               07  V-PO1                 PIC X(7)   VALUE SPACES.
               07  V-PO2                 PIC X(3)   VALUE SPACES.
           05  V-QUOTE                   PIC X(6)   VALUE SPACES.
           05  V-REQ                     PIC X(12)  VALUE SPACES.
           05  V-KEYWORD                 PIC X(20)  VALUE SPACES.
           05  V-MODIFIER                PIC X(30)  VALUE SPACES.
           05  V-MANUFACTURER            PIC X(26)  VALUE SPACES.
           05  V-SORT                    PIC X      VALUE SPACE.
           05  V-PARAGRAPH               PIC X      VALUE SPACE.
           05  V-BUYER                   PIC X(4)   VALUE SPACES.
           05  V-RETURN-DATE             PIC X(6)   VALUE SPACES.
           05  V-VENDOR-AREA.
               07  V-VENDOR OCCURS  5 TIMES    PIC X(10).
           05  V-QUOTE-REF               PIC X(4)   VALUE SPACES.
           05  V-PRINTER                 PIC X      VALUE "1".
           05  DE-COMMAND-LINE1          PIC X(79)    VALUE SPACES.
           05  DE-MESSAGE-LINE1          PIC X(79).

      *----------  TEXT MESSAGE BUFFER
       01  SCREEN-TEXT.
           05  STANDARD-MSG-AREA.
               10  STANDARD-AREA OCCURS 5 TIMES PIC X(72).
           05  NEW-MSG-AREA.
               10  NEW-MSG OCCURS 5 TIMES  PIC X(72).
           05  DE-COMMAND-LINE2            PIC X(79).
           05  DE-MESSAGE-LINE2            PIC X(79).

       01  QUOTE-PRINTER                   PIC 9(2)   COMP-4.

       01  STATUS-AREA.
           05  COND-WORD                 PIC S9(4)  VALUE ZERO COMP-4.
               88  GOOD-CALL                   VALUE 0.
               88  END-OF-FILE                 VALUE 11.
               88  START-OF-CHAIN              VALUE 14.
               88  END-OF-CHAIN                VALUE 15.
               88  NO-ENTRY                    VALUE 17.
           05  DATA-LENGTH               PIC S9(4)             COMP-4.
           05  RCD-NO                    PIC S9(9)             COMP-4.
           05  CHAIN-LENGTH              PIC S9(9)             COMP-4.
           05  BKWD-ADDR                 PIC S9(9)             COMP-4.
           05  FWRD-ADDR                 PIC S9(9)             COMP-4.

       01  DSET-NAME                     PIC X(16)  VALUE SPACES.
       01  VENDOR-ARG                    PIC X(10)  VALUE SPACES.
       01  MPLTINFO-ARG                  PIC X(4)   VALUE SPACES.
       01  CODE-ARG                      PIC X(8)   VALUE SPACES.
       01  REQ-ARG                       PIC X(12)  VALUE SPACES.
       01  QT-STD-ARG                    PIC X(10)  VALUE "STAND     ".
       01  BUYER-ARG                     PIC X(4)   VALUE SPACES.
       01  KEYWORD-ARG                   PIC X(50)  VALUE SPACES.
       01  MANUFACT-ARG                  PIC X(26)  VALUE SPACES.
       01  PO-ARG.
           05  FILLER                    PIC X      VALUE "P".
           05  PO-ARG-NUM                PIC X(10)  VALUE SPACES.
           05  FILLER                    PIC X(3)   VALUE "000".
       01  QUOTE-ARG.
           05  QUOTE-ARG-NUM             PIC X(6)   VALUE SPACES.
           05  FILLER                    PIC X(4)   VALUE SPACES.
       01  REF-ARG                       PIC X(4)   VALUE SPACES.
       01  MODE-AREA.
           05  MODE1                     PIC S9(4)  VALUE 1   COMP-4.
           05  MODE3                     PIC S9(4)  VALUE 3   COMP-4.
           05  MODE4                     PIC S9(4)  VALUE 4   COMP-4.
           05  MODE5                     PIC S9(4)  VALUE 5   COMP-4.
           05  MODE6                     PIC S9(4)  VALUE 6   COMP-4.
           05  MODE7                     PIC S9(4)  VALUE 7   COMP-4.

       COPY DVENDOR   IN COPYLIB.
       COPY DVENDITM  IN COPYLIB.
       COPY MPORCV    IN COPYLIB.
       COPY MSTORERM  IN COPYLIB.
       COPY MBUYER    IN COPYLIB.
       COPY DQUOTEXT  IN COPYLIB.
       COPY MPLT0     IN COPYLIB.
       COPY MPLTPQNO  IN COPYLIB.
       COPY DREQITM   IN COPYLIB.
       COPY DMANPART  IN COPYLIB.
       COPY DCODE     IN COPYLIB.
       COPY MMANUFAC  IN COPYLIB.
      **************************************************************
      *           L I N K A G E   S E C T I O N                    *
      **************************************************************
       LINKAGE SECTION.
       01  BASE                          PIC X(10).
       COPY VCOMLINK IN COPYLIB.
       01  FORMFILE                      PIC X(26).
       COPY LANGSUB  IN COPYLIB.
       01  PASS-SPOOL                    PIC S9(2) COMP-4.
       01  PASS-QUOTE-PRT.
         05  PASS-QUOTE-PRT-01             PIC 9(2)   COMP-4.
         05  PASS-QUOTE-PRT-02             PIC 9(2)   COMP-4.
         05  PASS-QUOTE-PRT-LP             PIC 9(2)   COMP-4.

      *******************************************************************
      *                     PROCEDURE DIVISION                          *
      *******************************************************************
       PROCEDURE DIVISION USING    BASE,
                                   VIEW-COMAREA,
                                   FORMFILE,
                                   LANGUAGE-PARMS,
                                   PASS-SPOOL,
                                   PASS-QUOTE-PRT.

       6-MAIN.
           MOVE SPACES                   TO  SCREEN-BUFFER.
           MOVE "000"                    TO  V-PO2.
           MOVE "000000"                 TO  V-QUOTE.
           MOVE "0000"                   TO  V-QUOTE-REF.
           MOVE "1"                      TO V-PRINTER.
           OPEN I-O DISPLAY-FILE MPLTINFO-O.
           OPEN INPUT DVENDOR-I DVENDITM3-I MSTORERM-I
                      MBUYER-I MPORCV-I DQUOTEXT-I
                      DREQITM-I DMANPART-I MMANUFACT-I
                      DCODE-I DVENDITM5-I.

       6-LOOP.
      *******************************************************************
      *   PROCESS FIRST SCREEN WITH BUYER, DOCUMENT NUMBER, VENDORS     *
      *******************************************************************
           PERFORM 60-VALIDATE-FIRST-SCREEN THRU 60-EXIT.
           IF VIEW-LASTKEY = 3
              GO TO 6-EXIT.
           IF VIEW-LASTKEY = 7
              GO TO 6-LOOP.

      ********************************************************************
      *     DISPLAY QUOTE PARAGRAPH AND ALLOW CHANGES                    *
      ********************************************************************
           IF V-PARAGRAPH = "X"
              PERFORM 61-DISPLAY-TEXT THRU 61-EXIT
              IF VIEW-LASTKEY = 3
                 GO TO 6-LOOP
              ELSE
                 NEXT SENTENCE
           ELSE
              PERFORM 63-USE-OLD-PARAGRAPH THRU 63-EXIT.

      *********************************************************************
      *  CREATE JOB STREAM AND KICK OFF THE JOB TO STORE THE NEW QUOTE    *
      *********************************************************************
           PERFORM 62-STREAM-ADD-PROGRAM THRU 62-EXIT.

           GO TO 6-LOOP.

       6-EXIT.
           CLOSE DISPLAY-FILE.
           CLOSE      DVENDOR-I DVENDITM3-I MSTORERM-I
                      MBUYER-I MPORCV-I DQUOTEXT-I
                      DREQITM-I  MPLTINFO-O DMANPART-I
                      DCODE-I DVENDITM5-I MMANUFACT-I.
           GOBACK.

      ****************************************************************
      *     VALIDATE BUYER, VENDOR, RETURN DATE, CORPORATE CODES     *
      ****************************************************************
       60-VALIDATE-FIRST-SCREEN.
           MOVE SPACES                   TO  CODE-ARG, V-PO, V-QUOTE
                                     V-REQ, V-VENDOR-AREA,
                                     ACCEPT-DATA1, ACCEPT-DATA2,
                                     ACCEPT-DATA3, ACCEPT-DATA4,
                                     V-QUOTE-REF,
                                     CSTRMJB2-PARMS, V-KEYWORD,
                                     V-MODIFIER, V-MANUFACTURER.
           MOVE "Y"                      TO  CSTRM-JOBCARD-FLAG.
           MOVE "000"                    TO  V-PO2.
           MOVE "000000"                 TO  V-QUOTE.
           MOVE "0000"                   TO  V-QUOTE-REF.

       60-GET-FORM.
           MOVE MAIN-SCREEN              TO  VIEW-NFNAME.
       60-SHOW-FORM.
           MOVE SCREEN-BUFFER            TO  DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
              INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0"                 TO  SRF-INDICATORS.

           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0"                 TO  SRF-INDICATORS.
           MOVE DISPLAY-REC              TO  SCREEN-BUFFER.

      *------ A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *------ IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3                    TO  VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM         TO  VIEW-LASTKEY.

           IF VIEW-LASTKEY EQUAL 3
              GO TO 60-EXIT.

           IF VIEW-LASTKEY EQUAL 2 OR
              VIEW-LASTKEY EQUAL 8 OR
              VIEW-LASTKEY EQUAL 4 OR
              VIEW-LASTKEY EQUAL 7 OR
              VIEW-LASTKEY EQUAL 6
              MOVE 9                     TO  LANG-SETNUM
              MOVE 10                    TO  LANG-MSGNUM
              PERFORM 940-VSETERROR THRU 940-EXIT
              GO TO 60-SHOW-FORM.

      *----------  F1=HELP SCREEN
           IF VIEW-LASTKEY = 1
              MOVE "HQTSGN"              TO  HELP-FORMNAME
              MOVE "ZUDCQUOT"            TO  VIEW-CFNAME
              CALL "SHELPSCR" USING VIEW-COMAREA LANGUAGE-PARMS
                                       HELP-FORMNAME
              GO TO 60-GET-FORM.

      *-----  VALIDATE SELECTION.  USER CAN ONLY SELECT ONE OF PO,
      *-----  QUOTE OR REQUISITION, OR CAN SELECT KEYWORD(MODIFIER)
      *-----  AND/OR MANUFACTURER.  IF MODIFIER IS ENTERED, REQUIRE
      *-----  MODIFIER.

           IF V-MODIFIER NOT EQUAL SPACES
              IF V-KEYWORD EQUAL SPACES
      *-----  KEYWORD MUST BE ENTERED (IF MODIFIER IS ENTERED)
                 MOVE 20                    TO  LANG-MSGNUM
                 MOVE 11                    TO  LANG-SETNUM
                 MOVE B"1"                  TO  IND (16)
                 MOVE 15                    TO  FIELD-NUMBER
                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                 PERFORM 940-VSETERROR THRU 940-EXIT
                 GO TO 60-SHOW-FORM.

           MOVE 0 TO SEL-COUNT.
           IF V-PO1 NOT = SPACES
              ADD 1 TO SEL-COUNT.
           IF V-QUOTE NOT = "000000"
              ADD 1 TO SEL-COUNT.
           IF V-REQ NOT = SPACES
              ADD 1 TO SEL-COUNT.
           IF V-KEYWORD NOT = SPACES
              ADD 1 TO SEL-COUNT.
           IF V-MANUFACTURER NOT = SPACES
              ADD 1 TO SEL-COUNT.

           IF SEL-COUNT = 0
      *** MUST ENTER AT LEAST ONE FIELD
              MOVE 16                    TO  LANG-MSGNUM
              MOVE 41                    TO  LANG-SETNUM
              MOVE B"1"                  TO  IND (2)
              MOVE B"1"                  TO  IND (4)
              MOVE B"1"                  TO  IND (5)
              MOVE B"1"                  TO  IND (15)
              MOVE B"1"                  TO  IND (16)
              MOVE B"1"                  TO  IND (17)
              MOVE 3                     TO  FIELD-NUMBER
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 940-VSETERROR THRU 940-EXIT
              GO TO 60-SHOW-FORM
           ELSE
           IF SEL-COUNT < 2
              NEXT SENTENCE
           ELSE
           IF SEL-COUNT = 2
              IF  (V-KEYWORD NOT EQUAL SPACES AND
                   V-MANUFACTURER NOT EQUAL SPACES)
                  NEXT SENTENCE
              ELSE
      *** AN INVALID COMBINATION ENTRY HAS BEEN ENTERED.  CAN ONLY
      *** ENTER KEYWORD MODIFIER AND MANUFACTURER.  SHOW ERROR MSG.
                 MOVE 29                    TO  LANG-MSGNUM
                 MOVE 15                    TO  LANG-SETNUM
                 MOVE B"1"                  TO  IND (16)
                 MOVE B"1"                  TO  IND (17)
                 MOVE 15                    TO  FIELD-NUMBER
                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                 PERFORM 940-VSETERROR THRU 940-EXIT
                 GO TO 60-SHOW-FORM
           ELSE
      *** INVALID COMBINATION ENTRY (CAN ONLY ENTER KWRD/MOD AND MANF)
              MOVE 29                    TO  LANG-MSGNUM
              MOVE 15                    TO  LANG-SETNUM
              MOVE B"1"                  TO  IND (16)
              MOVE B"1"                  TO  IND (17)
              MOVE 15                    TO  FIELD-NUMBER
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 940-VSETERROR THRU 940-EXIT
              GO TO 60-SHOW-FORM.

           MOVE V-BUYER                  TO  BUYER-ARG.

      *----------  VALIDATE BUYER CODE

           IF V-BUYER = SPACES
      ***  YOU MUST ENTER A BUYER CODE
              MOVE 36                    TO  LANG-MSGNUM
              MOVE 44                    TO  LANG-SETNUM
              MOVE 13                    TO  FIELD-NUMBER
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 940-VSETERROR THRU 940-EXIT
              GO TO 60-SHOW-FORM.

           MOVE 0                        TO  COND-WORD.
           MOVE BUYER-ARG                TO  BUYERCDE OF MBUYER-REC-I.
           READ MBUYER-I INTO BUF-MBUYER
               INVALID KEY MOVE 17       TO  COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17                   TO  COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99                   TO  COND-WORD.
           IF NO-ENTRY
      *** BUYER CODE DOES NOT EXIST
              MOVE 04                    TO  LANG-MSGNUM
              MOVE 02                    TO  LANG-SETNUM
              MOVE 13                    TO  FIELD-NUMBER
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 940-VSETERROR THRU 940-EXIT
              GO TO 60-SHOW-FORM.

           MOVE 1                        TO  DATE-MODE.
           CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
           MOVE DATE-YMD-OUT             TO  TODAY-DATE.

      *----------  VALIDATE DATE FOR VENDOR TO RETURN

           IF V-RETURN-DATE = SPACES
      ***    DATE REQUIRED
              MOVE 20                    TO  LANG-MSGNUM
              MOVE 30                    TO  LANG-SETNUM
              MOVE 14                    TO  FIELD-NUMBER
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 940-VSETERROR THRU 940-EXIT
              GO TO 60-SHOW-FORM.

           MOVE V-RETURN-DATE            TO  DATE-VALIDATE-IN.
           MOVE 3                        TO  DATE-MODE.
           CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
           IF DATE-RET-CODE NOT = ZERO
      ***    DATE IS NOT VALID
              MOVE DATE-MSG              TO  MESSAGE-BUFFER
              MOVE 14                    TO  FIELD-NUMBER
              PERFORM 940-VSETERROR THRU 940-EXIT
              GO TO 60-SHOW-FORM.

      *-----  FORMAT BOTH DATES WITH CENTURY TO HANDLE YEAR 2000

           MOVE DATE-YMD-OUT             TO  RETURN-DATE.
           IF RETURN-DATE NUMERIC
              IF RETURN-YEAR > "70"
                 MOVE "19" TO RETURN-CENT
              ELSE
                 MOVE "20" TO RETURN-CENT
              END-IF
           END-IF.
           IF TODAY-YEAR > "70"
              MOVE "19" TO TODAY-CENT
           ELSE
              MOVE "20" TO TODAY-CENT.

           IF CY-TODAY-DATE  > CY-RETURN-DATE
      *-------DATE MUST BE A FUTURE DATE
              MOVE 15                    TO  LANG-MSGNUM
              MOVE 04                    TO  LANG-SETNUM
              MOVE 14                    TO  FIELD-NUMBER
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 940-VSETERROR THRU 940-EXIT
              GO TO 60-SHOW-FORM.

           MOVE CY-RETURN-DATE           TO  ACCEPT-RETURN-DATE.

      *----------  VALIDATE VENDORS
           MOVE 1                        TO  X.
       60-VALIDATE-VENDORS.

      *-----  AT LEAST ONE VENDOR MUST BE ENTERED

           IF V-VENDOR-AREA = SPACES
      ***       AT LEAST ONE VENDOR CODE MUST BE ENTERED
              MOVE  1                    TO LANG-MSGNUM
              MOVE  1                    TO LANG-SETNUM
              MOVE  7                    TO FIELD-NUMBER
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 940-VSETERROR THRU 940-EXIT
              GO TO 60-SHOW-FORM.

           IF V-VENDOR (X)  = SPACES OR "*"
              NEXT SENTENCE
           ELSE
              MOVE V-VENDOR (X)          TO  VENDOR-ARG
      *-----  CALL ALT KEY SUB-PGM TO GET ALT KEY IF ONE EXISTS
              MOVE VENDOR-ARG TO ALT-KEY-ARG
              CALL "TALTVENK" USING RET-CODE-TALTVENK,
                                    BASE-TALTVENK,
                                    STATUS-AREA,
                                    ALT-KEY-ARG,
                                    ALT-VEND-CODE
              IF RET-CODE-TALTVENK NOT EQUAL "00"
                 MOVE "TALTVENK ERROR 60-VV" TO BU-DISPLAY-MSG
                 PERFORM 990-BLOWUP THRU 999-EXIT
              END-IF
              MOVE ALT-VEND-CODE   TO VENDOR-ARG V-VENDOR (X)
              PERFORM 606-VALIDATE-VENDOR THRU 606-EXIT
              IF NO-ENTRY
                 COMPUTE FIELD-NUMBER = 6 + X
      *--------- THIS VENDOR CODE DOES NOT EXIST
                 MOVE 22                 TO  LANG-SETNUM
                 MOVE 03                 TO  LANG-MSGNUM
                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                 PERFORM 940-VSETERROR THRU 940-EXIT
                 GO TO 60-SHOW-FORM.

           IF X < 5
              ADD 1                      TO  X
              GO TO 60-VALIDATE-VENDORS.

       60-VALIDATE-PRINTER.
           IF V-PRINTER = SPACES
      *--------- YOU MUST SELECT A PRINTER OPTION
            MOVE 25                 TO  LANG-SETNUM
            MOVE 31                 TO  LANG-MSGNUM
            PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
            MOVE 28                    TO  FIELD-NUMBER
            PERFORM 940-VSETERROR THRU 940-EXIT
            GO TO 60-SHOW-FORM
           ELSE
           IF (V-PRINTER = "1")
             IF (PASS-QUOTE-PRT-01 NOT > 00)
      *--------- PRINTER #1 HAS NOT BEEN DEFINED
               MOVE 16                 TO  LANG-SETNUM
               MOVE 168                TO  LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 28                    TO  FIELD-NUMBER
               PERFORM 940-VSETERROR THRU 940-EXIT
               GO TO 60-SHOW-FORM
             ELSE
               MOVE PASS-QUOTE-PRT-01 TO QUOTE-PRINTER
           ELSE
           IF (V-PRINTER = "2")
             IF (PASS-QUOTE-PRT-02 NOT > 00)
      *--------- PRINTER #2 HAS NOT BEEN DEFINED
               MOVE 16                 TO  LANG-SETNUM
               MOVE 169                TO  LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 28                    TO  FIELD-NUMBER
               PERFORM 940-VSETERROR THRU 940-EXIT
               GO TO 60-SHOW-FORM
             ELSE
               MOVE PASS-QUOTE-PRT-02 TO QUOTE-PRINTER
           ELSE
           IF (V-PRINTER = "3")
             IF (PASS-QUOTE-PRT-LP NOT > 00)
      *--------- NO LINE PRINTER HAS BEEN DEFINED
               MOVE 14                 TO  LANG-SETNUM
               MOVE 124                TO  LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 28                    TO  FIELD-NUMBER
               PERFORM 940-VSETERROR THRU 940-EXIT
               GO TO 60-SHOW-FORM
             ELSE
               MOVE PASS-QUOTE-PRT-LP TO QUOTE-PRINTER
           ELSE
      *--------- INVALID SELECTION, ENTER 1, 2, OR 3
               MOVE 09                 TO  LANG-SETNUM
               MOVE 110                TO  LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 28                    TO  FIELD-NUMBER
               PERFORM 940-VSETERROR THRU 940-EXIT
               GO TO 60-SHOW-FORM.

           MOVE SPACES                   TO  MESSAGE-BUFFER.

           IF V-PO1 NOT = SPACES
              PERFORM 600-VALIDATE-PO THRU 600-EXIT
           ELSE
              IF V-QUOTE NOT = "000000"
                 PERFORM 601-VALIDATE-QUOTE THRU 601-EXIT
              ELSE
                 IF V-REQ NOT = SPACES
                    PERFORM 602-VALIDATE-REQ THRU 602-EXIT
                 ELSE
                    IF (V-KEYWORD NOT = SPACES AND
                        V-MANUFACTURER NOT = SPACES)
                        PERFORM 603-VALIDATE-COMBO THRU 603-EXIT
                    ELSE
                        IF V-KEYWORD NOT = SPACES
                           PERFORM 604-VALIDATE-KEYWORD THRU 604-EXIT
                        ELSE
                           PERFORM 605-VALIDATE-MANUF THRU 605-EXIT.
           IF MESSAGE-BUFFER NOT = SPACES
              GO TO 60-SHOW-FORM.


           PERFORM 65-VALIDATE-REF THRU 65-EXIT.
           IF MESSAGE-BUFFER NOT = SPACES
              GO TO 60-SHOW-FORM.

      *----------  IF ONLY ONE VENDOR IS ENTERED, DON'T ATTACH REF#
           MOVE "N"                      TO  MULTIPLE-VENDORS.
           MOVE 1                        TO  X, N.

       60-COUNT-VENDORS.
           IF V-VENDOR (X) NOT = SPACES
              ADD 1                      TO  N.
           ADD 1                         TO  X.
           IF X < 6
              GO TO 60-COUNT-VENDORS.
           IF N > 2
              MOVE "Y"                   TO  MULTIPLE-VENDORS.

           MOVE 1                        TO  X, N.
           IF MULTIPLE-VENDORS = "Y"
              MOVE V-QUOTE-REF           TO  ACCEPT-QUOTE-REF.

       60-GET-NEW-QUOTES.
           IF V-VENDOR (X) NOT = SPACES
              PERFORM 64-GET-NEXT-QUOTE-NUMBER THRU 64-EXIT
              MOVE V-VENDOR (X)          TO  VENDOR (N)
              ADD 1                      TO  N.

           ADD 1                         TO  X.
           IF X < 6
              GO TO 60-GET-NEW-QUOTES.

       60-EXIT.     EXIT.

      ************************************************************
      *  DISPLAY STANDARD QUOTE PARAGRAPH AND ALLOW CHANGES      *
      ************************************************************
       61-DISPLAY-TEXT.
           MOVE QUOTE-TEXT               TO  VIEW-NFNAME.
           MOVE SPACES            TO STANDARD-MSG-AREA, NEW-MSG-AREA
           MOVE 1                        TO  X.
           MOVE "STAND"                  TO  QT-STD-ARG.
           MOVE 0                        TO  COND-WORD.
           MOVE QT-STD-ARG TO QUOTENUM   OF DQUOTEXT-REC-I.
           START DQUOTEXT-I KEY = QUOTENUM OF DQUOTEXT-REC-I
               INVALID KEY MOVE 17       TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17               TO  COND-WORD
               ELSE
                   MOVE 99               TO  COND-WORD.
           IF NOT GOOD-CALL
              MOVE "NO STANDARD QUOTE PARAGRAPH EXISTS|"
                                         TO  STANDARD-AREA (X)
              GO TO 61-SHOW-TEXT.
       61-GET-TEXT.
           MOVE 0                        TO  COND-WORD.
           READ DQUOTEXT-I NEXT INTO BUF-DQUOTEXT
               AT END MOVE 15            TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15               TO  COND-WORD
               ELSE
                   MOVE 99               TO  COND-WORD.
           IF QUOTENUM OF DQUOTEXT-REC-I NOT = QT-STD-ARG
               MOVE 15                   TO  COND-WORD.
           IF END-OF-CHAIN
              GO TO 61-SHOW-TEXT.
           IF NOT GOOD-CALL
              MOVE "DBGET DQUOTEXT 444 SQTCREAT" TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.
           IF DQUOTEXT-ITM-NO = "0000"
              MOVE DQUOTEXT-DATA         TO  STANDARD-AREA (X)
              ADD 1                      TO  X.
           GO TO 61-GET-TEXT.
       61-SHOW-TEXT.
           MOVE SCREEN-TEXT              TO  DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
              INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0"                 TO  SRF-INDICATORS.

           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0"                 TO  SRF-INDICATORS.
           MOVE DISPLAY-REC              TO  SCREEN-TEXT.

      *------ A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *------ IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3                    TO  VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM         TO  VIEW-LASTKEY.
           IF VIEW-LASTKEY EQUAL 5 OR
              VIEW-LASTKEY EQUAL 1 OR
              VIEW-LASTKEY EQUAL 4 OR
              VIEW-LASTKEY EQUAL 2 OR
              VIEW-LASTKEY EQUAL 6 OR
              VIEW-LASTKEY EQUAL 8
              PERFORM 940-VSETERROR THRU 940-EXIT
              GO TO 61-SHOW-TEXT.
           IF VIEW-LASTKEY = 3
               GO TO  61-EXIT.

           IF NEW-MSG-AREA = SPACES
              MOVE "S"                   TO  PARAGRAPH-TYPE
              GO TO 61-EXIT.


      *----------  X IS PTR TO LINE NUMBER OF PARAGRAPH
      *            N IS PTR TO QUOTE/VENDOR PAIR
           MOVE 1                        TO  X, N.
           MOVE SPACES                   TO  BUF-DQUOTEXT.

           IF ACCEPT-QUOTE (N) = SPACES
              GO TO 61-EXIT.

           OPEN I-O DQUOTEXT-O.

       61-ADD-PARAGRAPH.
           IF NEW-MSG (X) = SPACES
              GO TO 61-CHECK-SPACE.
           MOVE ACCEPT-QUOTE (N)         TO  DQUOTEXT-QUOTE-NO.
           MOVE ZEROES                   TO  DQUOTEXT-ITM-NO.
           MOVE X                        TO  DQUOTEXT-LINE-NO.
           MOVE NEW-MSG (X)              TO  DQUOTEXT-DATA.

           MOVE 0                        TO  COND-WORD.
           WRITE DQUOTEXT-REC-O FROM BUF-DQUOTEXT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99                   TO  COND-WORD.
           IF NOT GOOD-CALL
              MOVE "DBPUT 455 TQTGEN  "  TO  BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.

       61-CHECK-SPACE.
           ADD 1                         TO  X.
           IF X < 6
              GO TO 61-ADD-PARAGRAPH.

           ADD 1                         TO  N.
           IF N = 6
              GO TO 61-CLOSE.
           IF ACCEPT-QUOTE (N) NOT = SPACES
              MOVE 1                     TO  X
              GO TO 61-ADD-PARAGRAPH.

       61-CLOSE.
           CLOSE DQUOTEXT-O.
       61-EXIT.  EXIT.

       62-STREAM-ADD-PROGRAM.
      *************************************************************
      *      STREAM THE JOB THAT WILL PRINT THE QUOTE.  THIS      *
      *      ALLOWS THE PROGRAM TO RETURN IMMEDIATELY TO THE      *
      *      USER WHO IS WAITING TO DO SOMETHING ELSE WITH THE    *
      *      VIEW SCREEN.                                         *
      *************************************************************
      *    MOVE  14                             TO LANG-SETNUM
      *    MOVE   2                             TO LANG-MSGNUM
      *    PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
      *    PERFORM 940-VSETERROR THRU 940-EXIT.
      *
      *----------  CREATE REST OF STREAM FILE
           MOVE "TQTGEN  "               TO  CSTRM-JOBNAME.

      *--------  PASS THE OPTIONS
           MOVE V-BUYER                  TO  ACCEPT-BUYER.
           IF NEW-MSG-AREA = SPACES
              MOVE "S"                   TO  PARAGRAPH-TYPE
           ELSE
              MOVE " "                   TO  PARAGRAPH-TYPE.
           MOVE QUOTE-PRINTER            TO  ACCEPT-PRINTER.
           MOVE V-SORT                   TO  ACCEPT-SORT.
           MOVE "CALL TQTGEN"            TO  CSTRM-RUN-CARD (1).
           MOVE ACCEPT-DATA1             TO  CSTRM-RUN-CARD (2).
           MOVE ACCEPT-DATA2             TO  CSTRM-RUN-CARD (3).

      *
      * FORCE CSTRMJB2 TO CREATE DATA LINE FPR 3RD ACCEPT
      *
           IF ACCEPT-DATA3 EQUAL SPACES
             MOVE "X" TO CSTRM-RUN-CARD (4)
           ELSE
             MOVE ACCEPT-DATA3 TO CSTRM-RUN-CARD (4)
           END-IF.

      *
      * FORCE CSTRMJB2 TO CREATE DATA LINE FOR 4TH ACCEPT
      *
           IF ACCEPT-DATA4 EQUAL SPACES
             MOVE "X" TO CSTRM-RUN-CARD (5)
           ELSE
             MOVE ACCEPT-DATA4 TO CSTRM-RUN-CARD (5)
           END-IF.

           CALL "CSTRMJB2" USING CSTRMJB2-PARMS, VIEW-COMAREA.
           IF CSTRM-RET-CODE NOT = "00"
              MOVE CSTRM-RET-CODE        TO  BU-DISPLAY-FLD9 (1)
              MOVE "STREAM COMMAND FAILED SQTSYSGN" TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.

      *    CALL "TQTGEN" USING ACCEPT-DATA1 ACCEPT-DATA2.
       62-EXIT.  EXIT.

       63-USE-OLD-PARAGRAPH.
           MOVE SPACES            TO STANDARD-MSG-AREA, NEW-MSG-AREA
           MOVE 1                        TO  X.
           MOVE "STAND"                  TO  QT-STD-ARG.
           MOVE 0                        TO  COND-WORD.
           MOVE QT-STD-ARG TO QUOTENUM OF DQUOTEXT-REC-I.
           START DQUOTEXT-I KEY = QUOTENUM OF DQUOTEXT-REC-I
               INVALID KEY MOVE 17       TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17               TO  COND-WORD
               ELSE
                   MOVE 99               TO  COND-WORD.
           IF NOT GOOD-CALL
              MOVE "NO STANDARD QUOTE PARAGRAPH EXISTS|"
                                         TO  STANDARD-AREA (X)
              GO TO 63-EXIT.
       63-GET-TEXT.
           MOVE 0                        TO  COND-WORD.
           READ DQUOTEXT-I NEXT INTO BUF-DQUOTEXT
               AT END MOVE 15            TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15               TO  COND-WORD
               ELSE
                   MOVE 99               TO  COND-WORD.
           IF QUOTENUM OF DQUOTEXT-REC-I NOT = QT-STD-ARG
               MOVE 15                   TO  COND-WORD.
           IF END-OF-CHAIN
              GO TO 63-EXIT.
           IF NOT GOOD-CALL
              MOVE "DBGET DQUOTEXT 644 SQTCREAT" TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.
           IF DQUOTEXT-ITM-NO = "0000"
              MOVE DQUOTEXT-DATA         TO  STANDARD-AREA (X)
              ADD 1                      TO  X.
           GO TO 63-GET-TEXT.
       63-EXIT.  EXIT.

       64-GET-NEXT-QUOTE-NUMBER.
           MOVE "PQNO"                   TO  MPLTINFO-ARG.
           MOVE 0                        TO  COND-WORD.
           MOVE MPLTINFO-ARG TO PLTINFOKEY  OF MPLTINFO-REC-O.
           READ MPLTINFO-O INTO BUF-MPLTINFO
               INVALID KEY MOVE 17       TO  COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17                   TO  COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99                   TO  COND-WORD.
           IF NOT GOOD-CALL
              MOVE "PQNO KEY NOT IN MPLTINFO!!!!! " TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.

           ADD 1                         TO  MPLTINFO-FILE-NO.
           MOVE MPLTINFO-FILE-NO         TO  ACCEPT-QUOTE (N).
      *-----  ALSO GET REFERENCE # IF THE FIRST TIME
           IF N = 1
              IF V-QUOTE-REF = "0000"
                IF MULTIPLE-VENDORS = "Y"
                 ADD 1                   TO  MPLTINFO-QUOTE-REF
                 MOVE MPLTINFO-QUOTE-REF TO  ACCEPT-QUOTE-REF.

           MOVE 0                        TO  COND-WORD.
           REWRITE MPLTINFO-REC-O FROM BUF-MPLTINFO
               INVALID KEY MOVE 99       TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99                   TO  COND-WORD.
           IF NOT GOOD-CALL
              MOVE "DBUPDATE MPLTINFO SQTCREAT 050" TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.
      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO PLTINFOKEY OF MPLTINFO-REC-O.
           START MPLTINFO-O KEY > PLTINFOKEY OF MPLTINFO-REC-O
               INVALID KEY MOVE "00"     TO  FILE-STATUS.
       64-EXIT.  EXIT.

       600-VALIDATE-PO.
           MOVE V-PO                     TO  PO-ARG-NUM.
           MOVE PO-ARG                   TO  PORCVNO OF MPORCV-REC-I.
           START MPORCV-I KEY = PORCVNO OF MPORCV-REC-I
                 INVALID KEY MOVE 17     TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
              MOVE 17                    TO  COND-WORD.
           IF NOT GOOD-CALL
               IF NO-ENTRY
                   MOVE  16              TO  LANG-SETNUM
                   MOVE  45              TO  LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER   TO  MSG-BUFFER
                   MOVE PO-ARG           TO  MSG-VALUE
                   MOVE 3                TO  FIELD-NUMBER
                   PERFORM 940-VSETERROR THRU 940-EXIT
               ELSE
                 MOVE "DBGET MPORCV 810 SQTSYSGEN" TO BU-DISPLAY-MSG
                 MOVE PO-ARG             TO  BU-DISPLAY-FLD (1)
                 PERFORM 990-BLOWUP THRU 999-EXIT
           ELSE
              MOVE "P"                   TO  ACCEPT-DOC-TYPE
              MOVE PO-ARG-NUM            TO  ACCEPT-DOCUMENT.
       600-EXIT.  EXIT.

       601-VALIDATE-QUOTE.
           MOVE V-QUOTE                  TO  QUOTE-ARG-NUM.
      *----------  VALIDATE QUOTE NUMBER
           IF V-QUOTE  = "000000"
              GO TO 601-EXIT.
           MOVE 0                        TO  COND-WORD.
           MOVE V-QUOTE TO QUOTENUM OF DVENDITM3-REC-I.
           START DVENDITM3-I KEY = QUOTENUM OF DVENDITM3-REC-I
               INVALID KEY MOVE 17       TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17               TO  COND-WORD
               ELSE
                   MOVE 99               TO  COND-WORD.
           IF NOT GOOD-CALL
      *** QUOTE DOES NOT EXIST
              MOVE 08                    TO  LANG-MSGNUM
              MOVE 17                    TO  LANG-SETNUM
              MOVE 2                     TO  FIELD-NUMBER
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 940-VSETERROR THRU 940-EXIT
              GO TO 601-EXIT.
           MOVE "Q"                      TO  ACCEPT-DOC-TYPE
           MOVE QUOTE-ARG                TO  ACCEPT-DOCUMENT.
       601-EXIT.  EXIT.
       602-VALIDATE-REQ.
           MOVE V-REQ                    TO  REQ-ARG.
           MOVE 0                        TO  COND-WORD.
           MOVE REQ-ARG                  TO  REQNO OF DREQITM-REC-I.
           START DREQITM-I KEY = REQNO    OF DREQITM-REC-I
               INVALID KEY MOVE 17       TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17               TO  COND-WORD
               ELSE
                   MOVE 99               TO  COND-WORD.
           IF NO-ENTRY
              MOVE 5                     TO  FIELD-NUMBER
      *----------  REQUISITION NUMBER DOES NOT EXIST
              MOVE 18                    TO  LANG-SETNUM
              MOVE 05                    TO  LANG-MSGNUM
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 940-VSETERROR THRU 940-EXIT
              GO TO 602-EXIT
           ELSE
              IF NOT GOOD-CALL
                 MOVE "DBFIND DREQITM SQTSYSGN" TO BU-DISPLAY-MSG
                 MOVE REQ-ARG            TO  BU-DISPLAY-FLD (1)
                 PERFORM 990-BLOWUP THRU 999-EXIT
              ELSE
                 MOVE "R"                TO  ACCEPT-DOC-TYPE
                 MOVE REQ-ARG            TO  ACCEPT-DOCUMENT.
       602-EXIT.  EXIT.
       603-VALIDATE-COMBO.
           MOVE "DCODE;"                 TO  DSET-NAME.
           MOVE V-KEYWORD                TO  SEND-KW.
           MOVE V-MODIFIER               TO  SEND-MOD.
           CALL "CRFMTKWM" USING REFORMAT-KWM-AREA, BASE,
                VIEW-COMAREA.
           MOVE RETURN-KWM               TO  KEYWORD-ARG.
      ******************************************************************
      *   IF MODIFIER IS BLANK, ASSUME QUOTE IS DESIRED BASED ON KEYWORD
      *   ALONE AND THEREFORE NO DATABASE VALIDATION IS NECESSARY.
      *   IF MODIFIER IS ENTERED, COMPLETE ENTRY MUST BE VALIDATED.
      ******************************************************************
           IF V-MODIFIER NOT = SPACES
              PERFORM 6030-FIND-KWMD-OR-MANF THRU 6030-EXIT
              IF COND-WORD NOT = 0
      ***      KEYWORD/MODIFIER DOES NOT EXIST        ***
                 MOVE  11          TO  LANG-SETNUM
                 MOVE   4          TO  LANG-MSGNUM
                 MOVE B"1"         TO  IND (16)
                 MOVE  15          TO  FIELD-NUMBER
                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                 PERFORM 940-VSETERROR THRU 940-EXIT
                 GO TO 603-EXIT.

           MOVE SPACES                   TO  DSET-NAME.
           MOVE V-MANUFACTURER           TO  SEND-MFR.
           CALL "CRFMTMFR" USING REFORMAT-MFR-AREA, BASE,
                VIEW-COMAREA.
           MOVE RETURN-MFR               TO  MANUFACT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE MANUFACT-ARG TO MANUFACT OF MMANUFACT-REC-I.
           READ MMANUFACT-I INTO BUF-MMANUFACT
             INVALID KEY MOVE  17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17                   TO  COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99                   TO  COND-WORD.
           IF NO-ENTRY
      ***          MANUFACTURER DOES NOT EXIST     ***
              MOVE  13          TO  LANG-SETNUM
              MOVE  10          TO  LANG-MSGNUM
              MOVE 17           TO  FIELD-NUMBER
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 940-VSETERROR THRU 940-EXIT
              GO TO 603-EXIT
           ELSE
              IF NOT GOOD-CALL
                 MOVE "READ MMANUFACT 603 SQTSYSGN" TO BU-DISPLAY-MSG
                 MOVE MANUFACT-ARG TO BU-DISPLAY-FLD (1)
                 PERFORM 990-BLOWUP THRU 999-EXIT.
           PERFORM 6030-FIND-KWMD-OR-MANF THRU 6030-EXIT.
           IF NO-ENTRY
      ***       MANUFACTURER EXISTS, BUT IS NOT LINKED TO ANY CODES
              MOVE  13          TO  LANG-SETNUM
              MOVE  19          TO  LANG-MSGNUM
              MOVE  17          TO  FIELD-NUMBER
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 940-VSETERROR THRU 940-EXIT
              GO TO 603-EXIT
           ELSE
              IF NOT GOOD-CALL
                 MOVE "DBFIND DMANPART 603 SQTSYSGN" TO BU-DISPLAY-MSG
                 MOVE MANUFACT-ARG TO BU-DISPLAY-FLD (1)
                 PERFORM 990-BLOWUP THRU 999-EXIT.

           MOVE "X"                      TO  ACCEPT-DOC-TYPE.
           MOVE KEYWORD-ARG              TO  ACCEPT-KEYWORD.
           MOVE MANUFACT-ARG             TO  ACCEPT-MANUFACTURER.
       603-EXIT.  EXIT.

       6030-FIND-KWMD-OR-MANF.
            IF DSET-NAME = "DCODE;"
               MOVE 0                    TO  COND-WORD
               MOVE KEYWORD-ARG          TO  KEYWORDADJ OF DCODE-REC-I
               START DCODE-I   KEY = KEYWORDADJ OF DCODE-REC-I
                   INVALID KEY MOVE 17   TO  COND-WORD
               END-START
               IF FILE-STATUS-1 = "2"
                   MOVE 17               TO  COND-WORD
               ELSE
               IF FILE-STATUS NOT = "00"
                   MOVE 99               TO  COND-WORD
               ELSE
                   NEXT SENTENCE
           ELSE
               MOVE 0                    TO  COND-WORD
               MOVE MANUFACT-ARG         TO  MANUFACT OF DMANPART-REC-I
               START DMANPART-I   KEY = MANUFACT OF DMANPART-REC-I
                   INVALID KEY MOVE 17   TO  COND-WORD
               END-START
               IF FILE-STATUS-1 = "2"
                   MOVE 17               TO  COND-WORD
               ELSE
               IF FILE-STATUS NOT = "00"
                   MOVE 99               TO  COND-WORD.

       6030-EXIT.
           EXIT.

       604-VALIDATE-KEYWORD.
           MOVE "DCODE;"                 TO  DSET-NAME.
           MOVE V-KEYWORD                TO  SEND-KW.
           MOVE V-MODIFIER               TO  SEND-MOD.
           CALL "CRFMTKWM" USING REFORMAT-KWM-AREA, BASE,
                VIEW-COMAREA.
           MOVE RETURN-KWM               TO  KEYWORD-ARG.
      ******************************************************************
      *   IF MODIFIER IS BLANK, ASSUME QUOTE IS DESIRED BASED ON KEYWORD
      *   ALONE.  IN THAT CASE, THE KEYWORD IS NOT VALIDATED.
      ******************************************************************
           IF V-MODIFIER = SPACES
               MOVE "S" TO ACCEPT-DOC-TYPE
               MOVE KEYWORD-ARG TO ACCEPT-KEYWORD
               GO TO 604-EXIT.
           PERFORM 6030-FIND-KWMD-OR-MANF.
           IF COND-WORD NOT = 0
      ***      KEYWORD/MODIFIER DOES NOT EXIST        ***
              MOVE  11          TO  LANG-SETNUM
              MOVE   4          TO  LANG-MSGNUM
              MOVE B"1"         TO  IND (16)
              MOVE  15          TO  FIELD-NUMBER
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 940-VSETERROR THRU 940-EXIT
              GO TO 604-EXIT.

           MOVE "K"                      TO  ACCEPT-DOC-TYPE.
           MOVE KEYWORD-ARG              TO  ACCEPT-KEYWORD.
       604-EXIT.  EXIT.

       605-VALIDATE-MANUF.
           MOVE SPACES                   TO  DSET-NAME.
           MOVE V-MANUFACTURER           TO  SEND-MFR.
           CALL "CRFMTMFR" USING REFORMAT-MFR-AREA, BASE,
                VIEW-COMAREA.
           MOVE RETURN-MFR               TO  MANUFACT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE MANUFACT-ARG TO MANUFACT OF MMANUFACT-REC-I.
           READ MMANUFACT-I INTO BUF-MMANUFACT
             INVALID KEY MOVE  17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17                   TO  COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99                   TO  COND-WORD.
           IF NO-ENTRY
      ***          MANUFACTURER DOES NOT EXIST     ***
              MOVE  13          TO  LANG-SETNUM
              MOVE  10          TO  LANG-MSGNUM
              MOVE  17          TO  FIELD-NUMBER
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 940-VSETERROR THRU 940-EXIT
              GO TO 605-EXIT
           ELSE
              IF NOT GOOD-CALL
                 MOVE "READ MMANUFACT 605 SQTSYSGN" TO BU-DISPLAY-MSG
                 MOVE MANUFACT-ARG TO BU-DISPLAY-FLD (1)
                 PERFORM 990-BLOWUP THRU 999-EXIT.
           PERFORM 6030-FIND-KWMD-OR-MANF THRU 6030-EXIT.
           IF NO-ENTRY
      ***       MANUFACTURER EXISTS, BUT IS NOT LINKED TO ANY CODES
              MOVE  13          TO  LANG-SETNUM
              MOVE  19          TO  LANG-MSGNUM
              MOVE  17          TO  FIELD-NUMBER
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 940-VSETERROR THRU 940-EXIT
              GO TO 605-EXIT
           ELSE
              IF NOT GOOD-CALL
                 MOVE "DBFIND DMANPART 850 SQTSYSGN" TO BU-DISPLAY-MSG
                 PERFORM 990-BLOWUP THRU 999-EXIT.

           MOVE "M"                      TO  ACCEPT-DOC-TYPE.
           MOVE MANUFACT-ARG             TO  ACCEPT-MANUFACTURER.
       605-EXIT.  EXIT.

      *----------  VALIDATE REFERENCE NUMBER THAT TIES A GROUP OF
      *            IDENTICAL QUOTES TOGETHER.  IF THE USER ENTERED
      *            A NUMBER, IT MUST BE AN OLD NUMBER.
       65-VALIDATE-REF.
           IF V-QUOTE-REF = "0000"
              GO TO 65-EXIT.
           MOVE V-QUOTE-REF              TO  REF-ARG.
           MOVE 0                        TO  COND-WORD.
           MOVE REF-ARG TO VENREFER OF DVENDITM5-REC-I.
           START DVENDITM5-I KEY = VENREFER OF DVENDITM5-REC-I
                 INVALID KEY MOVE 17     TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 = "2"
                 MOVE 17                 TO  COND-WORD
              ELSE
                 MOVE 99                 TO  COND-WORD.
           IF NO-ENTRY
      *------  REF # DOES NOT EXIST; SPACE OUT OR ENTER A VALID NUMBER
              MOVE  18                   TO  LANG-SETNUM
              MOVE  88                   TO  LANG-MSGNUM
              MOVE 19                    TO  FIELD-NUMBER
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 940-VSETERROR THRU 940-EXIT.
       65-EXIT.  EXIT.

       606-VALIDATE-VENDOR.
           MOVE 0                        TO  COND-WORD
           MOVE VENDOR-ARG               TO  VENCDE OF DVENDOR-REC-I.
           START DVENDOR-I KEY = VENCDE OF DVENDOR-REC-I
               INVALID KEY MOVE 17       TO  COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17               TO  COND-WORD
               ELSE
                   MOVE 99               TO  COND-WORD.
       606-EXIT.  EXIT.

      *******************************************************************
      **           P E R F O R M E D     R O U T I N E S               **
      *******************************************************************
       940-VSETERROR.
           MOVE B"1"                     TO  IND (99).
           MOVE B"1"                     TO  IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER           TO  DE-MESSAGE-LINE1
                                  DE-MESSAGE-LINE2.

       940-EXIT.  EXIT.

      ******************************************************************
      *                       B L O W U P                              *
      *      CHECK FOR IMAGE, VIEW, OR SPOOL ERROR.  CLOSE             *
      *      FILES, GET OUT OF BLOCK MODE, AND DISPLAY                 *
      *      APPROPRIATE ERROR MESSAGE ON SCREEN.                      *
      *                                                                *
      *      ALSO APPENDS THE ERROR MESSAGE TO A FILE CALLED           *
      *      BLOWUP.PUB.  TO READ THIS FILE, RUN "XBLPRT.OBJECT".      *
      *                                                                *
      *         |||   PROGRAM IS ABORTED IN TBLOWUP   |||              *
      ******************************************************************
       990-BLOWUP.
           MOVE VIEW-NFNAME              TO  BU-DISPLAY-FLD (1).
           MOVE CODE-ARG                 TO  BU-DISPLAY-FLD (2).
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
                         VIEW-COMAREA, KSAM-STATUS-AREA, BU-DISPLAY-MSG,
                         BU-DISPLAY-FLDS.
       999-EXIT.  EXIT.

       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM          TO  CATREAD-MSG-SET
               MOVE LANG-MSGNUM          TO  CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT         TO  MESSAGE-BUFFER.
       999-CATREAD-EXIT.  EXIT.
