001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.    SQUOTUPD.
001300 AUTHOR.        BARBARA WINTER.
001400 DATE-WRITTEN.  JULY  l987.
001500*INSTALLATION.  GOODYEAR TIRE AND RUBBER CO.
001700*REMARKS.
001800*D QUOTE UPDATE PROGRAM-UPDATES BY QUOTE, VENDOR, OR CODE
      *C     5/03/95  WILL MCINTYRE   REQUEST #95-007
      *C     ADDED CALL TO TALTVENK TO ALLOW USER TO ENTER AN
      *C     ALTERNATE KEY, AND HAVE THE LINKED VENDOR CODE
      *C     SUBSTITUTED IN THE ALTERNATE KEY'S PLACE.
      *C
      *C     5/03/95  WILL MCINTYRE
      *C     CHANGED REFERENCES FOR COPYCSIS/COPYMMIS TO COPYLIB.
      *C
      *C     9/09/96  WL   MCINTYRE
      *C     MAKE REVISIONS FOR YEAR 2000 CAPATABILITY
      *C
      *C     9/24/96  WILL MCINTYRE
      *C     MADE REVISIONS TO CORRECT END-OF-FILE SCROLLING.
      *C
      *C    17JUL1997  DAVE PLUM
      *C    REVISED TO PROVIDE FOR THE POSSIBILITY THAT
      *C    FIELD VEN-DISCOUNT-PERCENT (VEN-DSCT, VEN-DSCT1,
      *C    VEN-DSCT2) MAY CONTAIN NON-NUMERIC DATA.
      *C
      *C  11/25/97    JEFF BUNGO   REQ #97-017
      *C     ADD USAGE FIELDS FOR DIRECT DELIVERY.  DD USAGE
      *C     TO BE STORED IN ADDITIONAL FIELD AND TOTAL USAGE.
      *C     STORE ISSUE USAGE CALCULATED BY TOTAL USAGE - DD USAGE.
      *C
001900 ENVIRONMENT DIVISION.
002000 CONFIGURATION SECTION.
002100 SOURCE-COMPUTER.    HP-3000.
002200 OBJECT-COMPUTER.    HP-3000.
       SPECIAL-NAMES.  I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
002300 INPUT-OUTPUT SECTION.
016600 FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZUDCQUOT-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS DYNAMIC
                  RELATIVE KEY IS RELATIVE-RECNO
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.
            SELECT MBUYER
              ASSIGN TO DATABASE-MCFLCS0601
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
              FILE STATUS IS FILE-STATUS.
            SELECT DVENDOR
              ASSIGN TO DATABASE-MCFLCS0701
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT DVENDITM
              ASSIGN TO DATABASE-MCFLCS0801
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT DVENDITM2
              ASSIGN TO DATABASE-MCFLCS0802
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT DVENDITM3
              ASSIGN TO DATABASE-MCFLCS0803
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT DVENDITM4
              ASSIGN TO DATABASE-MCFLCS0804
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT DVENDITM-O
              ASSIGN TO DATABASE-MCFPCS0800
              ORGANIZATION IS RELATIVE
                 ACCESS MODE IS DYNAMIC
              RELATIVE KEY IS RELATIVE-KEY
              FILE STATUS IS FILE-STATUS.
            SELECT DVENDITM2-O
              ASSIGN TO DATABASE-MCFPCS0800
              ORGANIZATION IS SEQUENTIAL
                 ACCESS MODE IS SEQUENTIAL
              FILE STATUS IS FILE-STATUS.
            SELECT MVALIDUM
               ASSIGN TO DATABASE-MCFLCS0401
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT DQUOTEXT
               ASSIGN TO DATABASE-MCFLCS3801
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT DQUOTEXT-O
               ASSIGN TO DATABASE-MCFLCS3801
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT MSTORERM
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT DREQITM
               ASSIGN TO DATABASE-MCFLCS2201
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT DREQDESC
               ASSIGN TO DATABASE-MCFLCS2301
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT MPLTINFO
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT USAGEFIL
               ASSIGN TO DATABASE-MCFLCSUSAG
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
016800 DATA DIVISION.
016900 FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC          PIC X(2000).
017000
       FD  MBUYER
           LABEL RECORDS ARE STANDARD.
       01  MBUYER-REC.
           COPY DDS-MCRPCS0600  OF MCFLCS0601.

       FD  DVENDOR
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-REC.
           COPY DDS-MCRPCS0700  OF MCFLCS0701.

       FD  DVENDITM
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM-REC.
           COPY DDS-MCRPCS0800  OF MCFLCS0801.

       FD  DVENDITM2
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM-REC2.
           COPY DDS-MCRPCS0800  OF MCFLCS0802.

       FD  DVENDITM3
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM-REC3.
           COPY DDS-MCRPCS0800  OF MCFLCS0803.

       FD  DVENDITM4
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM-REC4.
           COPY DDS-MCRPCS0800  OF MCFLCS0804.

       FD  DVENDITM-O
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM-REC-O.
           COPY DDS-MCRPCS0800  OF MCFPCS0800.

       FD  DVENDITM2-O
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM-REC2-O.
           COPY DDS-MCRPCS0800  OF MCFPCS0800.

       FD  DQUOTEXT
           LABEL RECORDS ARE STANDARD.
       01  DQUOTEXT-REC.
           COPY DDS-MCRPCS3800  OF MCFLCS3801.

       FD  DQUOTEXT-O
           LABEL RECORDS ARE STANDARD.
       01  DQUOTEXT-REC-O.
           COPY DDS-MCRPCS3800  OF MCFLCS3801.

       FD  MVALIDUM
           LABEL RECORDS ARE STANDARD.
       01  MVALIDUM-REC.
           COPY DDS-MCRPCS0400  OF MCFLCS0401.

       FD  MSTORERM
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  DREQITM
           LABEL RECORDS ARE STANDARD.
       01  DREQITM-REC.
           COPY DDS-MCRPCS2200  OF MCFLCS2201.

       FD  DREQDESC
           LABEL RECORDS ARE STANDARD.
       01  DREQDESC-REC.
           COPY DDS-MCRPCS2300  OF MCFLCS2301.

       FD  MPLTINFO
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  USAGEFIL
           LABEL RECORDS ARE STANDARD.
       01  USAGEFIL-REC.
           COPY DDS-MCRPCSUSAG OF MCFLCSUSAG.
002500 WORKING-STORAGE SECTION.

       77  RET-CODE-TALTVENK      PIC X(02)  VALUE "00".
       77  BASE-TALTVENK          PIC X(20).
       77  ALT-KEY-ARG            PIC X(10).
       77  ALT-VEND-CODE          PIC X(10).
       01  NO-NEXT                PIC 9.
       01  NO-PREV                PIC 9.
       01  FILE-STATUS.
           05  FILE-STATUS-1      PIC X.
           05  FILE-STATUS-2      PIC X.
       01  RELATIVE-RECNO         PIC 9(9).

      *------ WS CONTROL AREA
       01  MAJOR-MINOR                 PIC XXXX.
       01  WS-CONTROL.
           02  FUNCTION-NUM            PIC XX.
                   88  EXIT-KEY-F8-USED                     VALUE "08". LVW000LS
                   88  REFRESH-KEY-F4-USED                  VALUE "04". LVW000LS
                   88  ENTER-KEY-USED                       VALUE "00". LVW000LS
                   88  F1-KEY-USED                          VALUE "01". LVW000LS
                   88  F2-KEY-USED                          VALUE "02". LVW000LS
                   88  F3-KEY-USED                          VALUE "03". LVW000LS
                   88  F4-KEY-USED                          VALUE "04". LVW000LS
                   88  F5-KEY-USED                          VALUE "05". LVW000LS
                   88  F6-KEY-USED                          VALUE "06". LVW000LS
                   88  F7-KEY-USED                          VALUE "07". LVW000LS
                   88  F8-KEY-USED                          VALUE "08". LVW000LS
           02 FUN-KEY REDEFINES FUNCTION-NUM PIC XX.
           02 TERMINAL-ID PIC X(10).
           02 FORMAT-NAME PIC X(10).

       01  DISPLAY-STATUS              PIC X(2).

       01  SRF-INDICATORS.
           05  IND OCCURS 99 TIMES   PIC 1 INDICATOR 01.

       COPY IOFEEDBACK OF COPYLIB.

       01  RELATIVE-KEY             PIC 9(9).
       01  LASTREC-READ             PIC 9(4).
002600 01  HELP-FORMNAME            PIC X(6)  VALUE SPACES.
002700 01  WORK-BIDQTY              PIC 9(12) VALUE ZEROES.
002800 01  YTD-TOTAL                PIC S9(8) VALUE ZEROES.
002900 01  SUB                      PIC 9(2)  VALUE ZEROES.
003000 01  SAVE-NONCODED-ITEM       PIC 9(4) VALUE ZEROES.
003010 01  CTR                      PIC 9(2)  VALUE ZEROES COMP-4.
003020 01  LOOP-X                   PIC 9(2)  VALUE ZEROES COMP-4.
003100 01  SAVE-TEXT-FLAG           PIC X  VALUE SPACES.
003110 01  LAST-LINE-NO             PIC 9(2)  VALUE ZEROES.
003200 01  SAVE-VIEW-LASTKEY        PIC S9(4) COMP-4.
003300*-------- DELETE ITEM FLAG
003400 01  MAKE-SURE                PIC 9  VALUE ZERO.
003500     88  SECOND-TIME                 VALUE 1.
003600
003650
003700 01  LOOK-FOR                 PIC 9  VALUE ZERO.
003800     88  QUOTE-ONLY                  VALUE 1.
003900     88  QUOTE-AND-CODE              VALUE 2.
004000     88  VENDOR-ONLY                 VALUE 3.
004100     88  VENDOR-AND-CODE             VALUE 4.
004200     88  CODE-ONLY                   VALUE 5.
004300     88  UPDATE-DEFAULTS             VALUE 6.
004400     88  REQ-ONLY                    VALUE 7.
004500     88  QUOTE-AND-REQ               VALUE 8.
004600     88  VENDOR-AND-REQ              VALUE 9.
004700
004800 01  WHICH-TIME               PIC 9  VALUE ZERO.
004900     88 FIRST-TIME-CODE              VALUE 1.
005000     88 FIRST-TIME-REQ               VALUE 2.
005100
005200 01  X                        PIC 9     VALUE ZEROES.
005300
005400*----------  QUOTE STATUSES READ IN FROM MESSAGE FILE
005500 01  WS-OUT-FOR-BID           PIC X(12) VALUE SPACES.
005600 01  WS-NOT-RETURNED          PIC X(12) VALUE SPACES.
005700 01  WS-WORKSHEET             PIC X(12) VALUE SPACES.
005800 01  WS-CURRENT               PIC X(12) VALUE SPACES.
005900 01  WS-EXPIRED               PIC X(12) VALUE SPACES.
006000
006100 01  WORK-PRICE               PIC 9(11)V9(4)  VALUE ZEROES.
006200 01  WORK-PRICE-R REDEFINES WORK-PRICE.
006300     05  WORK-PRICE-W         PIC 9(11).
006400     05  WORK-PRICE-D         PIC 9(4).
006500
       01  CY-TODAY-DATE.
           05  TODAY-CENT           PIC X(2)  VALUE SPACES.
           05  TODAY-DATE.
               10  TODAY-YEAR       PIC X(2)  VALUE SPACES.
               10  FILLER           PIC X(4)  VALUE SPACES.
       01  SV-DATE1                 PIC X(8)  VALUE SPACES.
       01  SV-DATE2                 PIC X(8)  VALUE SPACES.
       01  SV-DATE4                 PIC X(8)  VALUE SPACES.

       01  CY-FORMAT-DATE.
           05  FORMAT-CENT          PIC X(2)  VALUE SPACES.
           05  FORMAT-DATE.
               10 FORMAT-YEAR       PIC X(2)  VALUE SPACES.
               10 FILLER            PIC X(4)  VALUE SPACES.

       01  SAVE-DATE-CN-PARMS.
           05  SAVE-DATE1-CN        PIC X(8)  VALUE SPACES.
           05  SAVE-DATE2-CN        PIC X(8)  VALUE SPACES.
           05  SAVE-DATE3-CN        PIC X(8)  VALUE SPACES.
           05  SAVE-DATE4-CN        PIC X(8)  VALUE SPACES.
007900
008000*---------- VSETERROR AND VPUTWINDOW
008100 01  MESSAGE-BUFFER           PIC X(76)    VALUE SPACES.
008200 01  MESSAGE-BUFFER-RD REDEFINES MESSAGE-BUFFER.
008300     05  MSG-BUFFER           PIC X(68).
008400     05  MSG-VALUE            PIC X(8).
008500 01  MESSAGE-BUFLEN           PIC S9(4) VALUE 76  COMP-4.
008600 01  MESSAGE-ACTLEN           PIC S9(4) VALUE 0   COMP-4.
008700 01  FIELD-NUMBER             PIC S9(4) VALUE 1   COMP-4.
008800
008900*---------- VPRINTFORM
009000 01  SCREEN-PRINT-PARMS.
009100     05  PRINT-CTL            PIC S9(4)    VALUE 1 COMP-4.
009200     05  PAGE-CTL             PIC S9(4)    VALUE 49    COMP-4.
009300     05  SPOOL-FIL-OPEN-SW    PIC X        VALUE "Y".
009400 01  RETURN-STATUS            PIC X        VALUE SPACE.
009500
030200 01  STRMRPT-COMAREA.
030300     05  STRM-RET-CODE            PIC X(2)  VALUE "00".
030400     05  STRM-MODE                PIC S9(4) VALUE ZEROS COMP-4.
030500     05  STRM-CO-CODE.
030600         10  CO-CODE-PREFIX       PIC X(2)  VALUE SPACES.
030700         10  CO-CODE-LAST-DIGIT   PIC X     VALUE SPACES.
030800     05  STRM-PRE-RUN-CARDS.
030900         10  STRM-PRE-RUN-CARD1   PIC X(80) VALUE SPACES.
031000         10  STRM-PRE-RUN-CARD2   PIC X(80) VALUE SPACES.
031100         10  STRM-PRE-RUN-CARD3   PIC X(80) VALUE SPACES.
031200         10  STRM-PRE-RUN-CARD4   PIC X(80) VALUE SPACES.
031300     05  STRM-RUN-CARD            PIC X(80) VALUE SPACES.
031400     05  STRM-JOB-NAME            PIC X(8)  VALUE "SQUOTUPD".
006400     05  PASS-TO-STRMJOB.
006500         07  PASS-STRM            PIC X(60).
006900         07  FILLER               PIC X(20).
           05  SQTUPD2-PARMS.
               07  UPDATE-MODE          PIC 9.
               07  SAVE-DATE1           PIC X(6).
               07  SAVE-DATE2           PIC X(6).
               07  SAVE-DATE3           PIC X(6).
               07  SAVE-DATE4           PIC X(6).
               07  FILLER               PIC X(695).
032800     05  STRM-OPTION-CARD2-CTR    PIC X(1)  VALUE SPACES.
032900     05  STRM-OPTION-CARD3        PIC X(80) VALUE SPACES.
033000     05  STRM-PRTRPT-CARD.
033100         10  STRM-PRTRPT-FLAG     PIC X(1).
033200         10  STRM-PRTRPT-FILE     PIC X(17).
033300         10  STRM-PRTRPT-SPOOLTYP  PIC X(1).
033400         10  STRM-PRTRPT-PRINTER   PIC X(3).
007000 COPY CSTRMJB2 OF COPYLIB.
009700 COPY TDATECHK OF COPYLIB.
009800 COPY CATREAD  OF COPYLIB.
009900 COPY CDESC    OF COPYLIB.
010000 01  RET-CODE                 PIC X(2)     VALUE "00".
010100*---------- TBLOWUP (PRINTS ERRORS TO AN ERROR FILE "BLOWUP.PUB" +)
010200*---------- (ABORTS PROGRAM.  RUN XBLPRT.OBJECT TO READ ERRORS.)
010300 01  BU-DISPLAY-MSG           PIC X(60)    VALUE SPACES.
010400 01  BU-PGM-NAME              PIC X(8)     VALUE "SQUOTUPD".
010500 01  BU-DISPLAY-AREA          PIC X(110)   VALUE ALL "0".
010600 01  BU-DISPLAY-FLDS REDEFINES BU-DISPLAY-AREA.
010700     05  BU-DISPLAY-LINE OCCURS 5 TIMES.
010800         10  BU-DISPLAY-FLD   PIC X(14).
010900         10  BU-DISPLAY-FLD9  PIC S9(8).
011000 01  KSAM-STATUS-AREA         PIC X(2)     VALUE "00".
012900 01  USAGE-REC.
013000     05  FILLER                 PIC XX.
013100     05  K-CORP-CODE            PIC X(8).
013200     05  K-MONTHS                              OCCURS 14 TIMES.
013300         10  K-MTH-USAGE        PIC S9(9) COMP-4.
013200     05  K-MONTHS-DD                           OCCURS 14 TIMES.
013300         10  K-MTH-USAGE-DD     PIC S9(9) COMP-4.
014100
014200 01  KSAM-STATUS.
014300     05  K-STAT-1               PIC X.
014400     05  FILLER                 PIC X.
014500 01  FORM-NAMES.
014600     05  MAIN-SCREEN          PIC X(10) VALUE "QMODIFY_OP".
014700     05  ITEM-SCREEN          PIC X(10) VALUE "QUOTEI_UPD".
014800     05  ITEM-ADD-SCREEN      PIC X(10) VALUE "QUOTEI_ADD".
014900     05  DEFAULT-SCREEN       PIC X(9)  VALUE "QT_DEFI".
015000     05  MODIFY-DESC-NC       PIC X(10) VALUE "QUOTUPD_NO".
015100
015200 01  SCREEN-BUFFER.
015300     05  VIEW-QUOTE           PIC X(6)     VALUE SPACES.
015400     05  VIEW-CORPCODE        PIC X(7)     VALUE SPACES.
015500     05  VIEW-ITEM            PIC X(4)     VALUE SPACES.
015600     05  VIEW-REQ             PIC X(12)    VALUE SPACES.
015700     05  VIEW-VENDOR          PIC X(10)    VALUE SPACES.
015800     05  VIEW-X               PIC X        VALUE SPACES.
015900     05  VIEW-NC-DESC       PIC X        VALUE SPACE.
           05  DE-COMMAND-LINE1     PIC X(79)    VALUE SPACES.
           05  DE-MESSAGE-LINE1     PIC X(79).
016100
016200 01  SCREEN2-BUFFER.
016300   02  V2-TITLE             PIC X(45)    VALUE SPACES.
016400   02  SCREEN2-BUFFER2.
016500     05  V2-QUOTE             PIC X(6)     VALUE SPACES.
016510     05  V2-REF               PIC X(4)     VALUE SPACES.
016600     05  V2-ITEM-NO           PIC ZZZ9     VALUE ZEROES.
016700     05  WORK-NO-ITEMS REDEFINES V2-ITEM-NO      PIC 9(4).
016800     05  V2-STATUS            PIC X(12)    VALUE SPACE.
016900     05  V2-VENCODE           PIC X(10)    VALUE SPACES.
017000     05  V2-VENDOR-NAME       PIC X(44)    VALUE SPACES.
017100     05  V2-REQ               PIC X(12)    VALUE SPACES.
017200     05  V2-CORPCODE          PIC X(7)     VALUE SPACES.
017300     05  V2-CODE-UM           PIC X(2)     VALUE SPACES.
017400     05  V2-DESC-AREA.
017500         07  V2-DESC1         PIC X(74)    VALUE SPACES.
017600         07  V2-DESC2         PIC X(74)    VALUE SPACES.
017700         07  V2-DESC3         PIC X(74)    VALUE SPACES.
017800     05  V2-DESC-R REDEFINES V2-DESC-AREA.
017900         07  V2-DESC OCCURS 3 TIMES        PIC X(74).
018000     05  V2-BUYERCODE         PIC X(4)     VALUE SPACES.
018100     05  V2-BIDQTY            PIC ZZZZZZZZZZZ9 VALUE ZEROES.
018200     05  V2-BIDQTY-R REDEFINES V2-BIDQTY
018300                              PIC 9(12).
018400     05  V2-BUYER-NAME        PIC X(26)    VALUE SPACES.
018500     05  V2-PRICEW            PIC ZZZZZZZ9 VALUE ZEROES.
018600     05  V2-PRICEW-R REDEFINES V2-PRICEW
018700                              PIC 9(8).
018800     05  V2-PRICED            PIC 9999     VALUE ZEROES.
018900     05  V2-UM                PIC X(2)     VALUE SPACES.
019000     05  V2-EXP-DATE          PIC X(8)     VALUE SPACES.
019100     05  V2-FB                PIC X(2)     VALUE SPACES.
019200     05  V2-BILLING-TERMS     PIC X(2)     VALUE SPACES.
019300     05  V2-TERMS REDEFINES V2-BILLING-TERMS.
019400         07  V2-TM1           PIC X.
019500         07  V2-TM2           PIC X.
019600     05  V2-EFF-DATE          PIC X(8)     VALUE SPACES.
019700     05  V2-SURCHARGW         PIC ZZZZZZZ9 VALUE ZEROES.
019800     05  V2-SURCHARGW-R REDEFINES V2-SURCHARGW
019900                              PIC 9(8).
020000     05  V2-SURCHARGD         PIC 9999     VALUE ZEROES.
020100     05  V2-DATE-TO-RETURN    PIC X(8)     VALUE SPACES.
020200     05  V2-DISCOUNT-PCNT1    PIC 99       VALUE ZEROES.
020400     05  V2-DISCOUNT-PCNT2    PIC 9(4)     VALUE ZEROES.
020500     05  V2-DATE-RETURNED     PIC X(8)     VALUE SPACES.
020600     05  V2-LEAD              PIC ZZZ9     VALUE ZEROES.
020700     05  V2-LEAD-R REDEFINES V2-LEAD       PIC 9(4).
020800     05  V2-CC                PIC X(2)     VALUE SPACES.
020900     05  V2-CURR              PIC X(12)    VALUE SPACES.
021000     05  V2-SHIPLOC           PIC X(10)    VALUE SPACES.
021100     05  V2-PRICE-BREAKS OCCURS 3 TIMES.
021300         07  V2-LOW-QTY9      PIC ZZZZZZZZZZZ9.
021400         07  V2-LOW-QTY9-R REDEFINES V2-LOW-QTY9 PIC 9(12).
021600         07  V2-HIGH-QTY9     PIC ZZZZZZZZZZZ9.
021700         07  V2-HIGH-QTY9-R REDEFINES V2-HIGH-QTY9 PIC 9(12).
021800         07  V2-BPRICE-UM     PIC X(2).
022000         07  V2-BPRICEW       PIC ZZZZZZZ9.
022100         07  V2-BPRICEW9-R REDEFINES V2-BPRICEW  PIC 9(8).
022300         07  V2-BPRICED       PIC 9999.
022400         07  V2-BPRICED9-R REDEFINES V2-BPRICED  PIC 9(4).
022500     05  V2-DISCOUNT           PIC X(50).
           05  DE-COMMAND-LINE2      PIC X(79).
           05  DE-MESSAGE-LINE2      PIC X(79).
022600
022700 01  SCREEN3-BUFFER.
         03  SCREEN3-AREA1.
022800     05  V3-QUOTE              PIC X(6).
022900     05  V3-BTERMS             PIC X(2).
023000     05  V3-BTERMS-R REDEFINES V3-BTERMS.
023100         07  V3-TM1           PIC X.
023200         07  V3-TM2           PIC X.
023300     05  V3-BUYC               PIC X(4).
023400     05  V3-FB                 PIC X(2).
023500     05  V3-EXPDATE            PIC X(8).
023600     05  V3-LEAD               PIC ZZZ9.
023700     05  V3-LEAD-9 REDEFINES V3-LEAD  PIC 9(4).
           05  V3-LEAD-X REDEFINES V3-LEAD  PIC X(4).
023800     05  V3-EFFDATE            PIC X(8).
023900     05  V3-TO-RETURN          PIC X(8).
024000     05  V3-RETURNED           PIC X(8).
024100     05  V3-SPLC               PIC X(10).
         03  SCREEN3-AREA2.
           05  DE-COMMAND-LINE3      PIC X(79).
           05  DE-MESSAGE-LINE3      PIC X(79).
024200
024300 01  SCREEN4-BUFFER.
024400     05  V4-QUOTE             PIC X(6)     VALUE SPACES.
024500     05  V4-ITEM              PIC X(4)     VALUE SPACES.
024600     05  V4-DESC-AREA.
024700         07  V4-DESC OCCURS 15 TIMES  PIC X(77).
           05  DE-COMMAND-LINE4     PIC X(79).
           05  DE-MESSAGE-LINE4     PIC X(79).
024800
024900 01  STATUS-AREA.
025000     05  COND-WORD            PIC S9(4)    VALUE ZERO COMP-4.
025100         88  GOOD-CALL                            VALUE 0.
025200         88  END-OF-FILE                          VALUE 11.
025300         88  START-OF-CHAIN                       VALUE 14.
025400         88  END-OF-CHAIN                         VALUE 15.
025500         88  NO-ENTRY                             VALUE 17.
025600     05  DATA-LENGTH          PIC S9(4)              COMP-4.
025700     05  RCD-NO               PIC S9(9)              COMP-4.
025800     05  CHAIN-LENGTH         PIC S9(9)              COMP-4.
025900     05  BKWD-ADDR            PIC S9(9)              COMP-4.
026000     05  FWRD-ADDR            PIC S9(9)              COMP-4.
026100
026200 01  VENDOR-ARG               PIC X(10)    VALUE SPACES.
026300 01  CODE-ARG                 PIC X(8)     VALUE SPACES.
026400 01  BUYER-ARG                PIC X(4)     VALUE SPACES.
026500 01  QUOTE-ARG.
026600     05  QUOTE-ARG-NUM        PIC X(6)     VALUE SPACES.
026700     05  FILLER               PIC X(4)     VALUE SPACES.
026800 01  REQ-ARG                  PIC X(12)    VALUE SPACES.
026900 01  UM-ARG                   PIC X(2)     VALUE SPACES.
027000 01  MISC-ARG.
027100     05  MISC-ARG1            PIC X(2)     VALUE SPACES.
027200     05  MISC-ARG2            PIC X(2)     VALUE SPACES.
027300
027400 01  MISC-ARG-B REDEFINES MISC-ARG.
027500     05  MISC-ARG1B           PIC X(3).
027600     05  MISC-ARG2B           PIC X.
027700
027800 01  REQ-SEARCH               PIC X(12)    VALUE "REQ-NUMBER;".
027900 01  VENDOR-SEARCH            PIC X(10)    VALUE "VEN-CODE;".
028000 01  CORPCODE-SEARCH          PIC X(10)    VALUE "CORP-CODE;".
028100 01  QUOTE-SEARCH             PIC X(10)    VALUE "QUOTE-NUM;".
028200
030700 COPY DVENDITM  OF COPYLIB.
030800 COPY DREQITM   OF COPYLIB.
030900 COPY DVENDOR   OF COPYLIB.
031000 COPY MSTORERM  OF COPYLIB.
031100 COPY MBUYER    OF COPYLIB.
031200 COPY DQUOTEXT  OF COPYLIB.
031300 COPY DREQDESC  OF COPYLIB.
031400 01  BUF-AQUOTENUM              PIC X(10)  VALUE SPACES.
031500 01  BUF-AVENDCODE              PIC X(10)  VALUE SPACES.
031600 COPY MVALIDUM  OF COPYLIB.
031700 COPY MPLTINFO  OF COPYLIB.
031800 LINKAGE SECTION.
031900 01  BASE                     PIC X(10).
032000 01  PASS-SPOOL               PIC S9(2) COMP-4.
032100 COPY VCOMLINK  OF COPYLIB.
032200 01  FORMFILE                   PIC X(26).
032300 COPY LANGSUB  OF COPYLIB.
032400
032500*******************************************************************
032600*                     PROCEDURE DIVISION
032700*******************************************************************
032800 PROCEDURE DIVISION USING   BASE,
032900                            PASS-SPOOL,
033000                            VIEW-COMAREA,
033100                            FORMFILE,
033200                            LANGUAGE-PARMS.
033300
033400 00-MAIN.
           OPEN I-O DISPLAY-FILE.
           OPEN INPUT DVENDITM DVENDOR MSTORERM MVALIDUM
                      DVENDITM2 DVENDITM3 DVENDITM4 USAGEFIL
                      MPLTINFO
                      MBUYER DREQITM DREQDESC DQUOTEXT.
           OPEN I-O DVENDITM-O DQUOTEXT-O.
           OPEN EXTEND DVENDITM2-O.
033500     MOVE 1 TO DATE-MODE.
033600     CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
033700     MOVE DATE-YMD-OUT TO TODAY-DATE.
033800
      *-----  FORMAT DATE WITH CENTURY

           IF TODAY-YEAR > "70"
              MOVE "19" TO TODAY-CENT
           ELSE
              MOVE "20" TO TODAY-CENT.

033900     MOVE 60                    TO LANG-SETNUM.
034000     MOVE 38                    TO LANG-MSGNUM.
034100     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
034200     MOVE MESSAGE-BUFFER        TO WS-OUT-FOR-BID.
034300     MOVE 39                    TO LANG-MSGNUM.
034400     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
034500     MOVE MESSAGE-BUFFER        TO WS-NOT-RETURNED.
034600     MOVE 40                    TO LANG-MSGNUM.
034700     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
034800     MOVE MESSAGE-BUFFER        TO WS-WORKSHEET.
034900     MOVE 41                    TO LANG-MSGNUM.
035000     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
035100     MOVE MESSAGE-BUFFER        TO WS-CURRENT.
035200     MOVE 42                    TO LANG-MSGNUM.
035300     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
035400     MOVE MESSAGE-BUFFER        TO WS-EXPIRED.
035500
035600     MOVE SPACES TO MESSAGE-BUFFER.
035700     PERFORM 100-GET-ENTRY   THRU 199-EXIT.
035800
           CLOSE DISPLAY-FILE.
           CLOSE      DVENDITM DVENDOR MSTORERM MVALIDUM
                      DVENDITM2 DVENDITM3 DVENDITM4 USAGEFIL
                      DVENDITM-O DVENDITM2-O MPLTINFO DQUOTEXT-O
                      MBUYER DREQITM DREQDESC DQUOTEXT.
033200
035900 09-EXIT.
            GOBACK.
036000
036100*************************************************************
036200*       READ AND VALIDATE INPUT                             *
036300*************************************************************
036400 100-GET-ENTRY.
036500     MOVE SPACES  TO CODE-ARG, SCREEN-BUFFER, SCREEN2-BUFFER2,
036600                  SV-DATE1, SV-DATE2, SV-DATE4, SQTUPD2-PARMS.
           MOVE 0 TO NO-NEXT, NO-PREV.
           MOVE "000000" TO VIEW-QUOTE.
           MOVE "0000"   TO VIEW-ITEM.
036700     MOVE MAIN-SCREEN TO VIEW-NFNAME.
       150-SHOW-FORM.
           MOVE SCREEN-BUFFER TO DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
              INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO SRF-INDICATORS.
           MOVE DISPLAY-REC TO SCREEN-BUFFER.

      *------ A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *------ IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.
035800
035900     IF VIEW-LASTKEY EQUAL 3
036000        GO TO 199-EXIT.
036100
036200     IF VIEW-LASTKEY EQUAL 1 OR
036300        VIEW-LASTKEY EQUAL 2 OR
036400        VIEW-LASTKEY EQUAL 8 OR
036500        VIEW-LASTKEY EQUAL 4 OR
036600        VIEW-LASTKEY EQUAL 7 OR
036700        VIEW-LASTKEY EQUAL 6
              MOVE 9 TO LANG-SETNUM
              MOVE 10 TO LANG-MSGNUM
036800        PERFORM 940-VSETERROR THRU 949-EXIT
036900        GO TO 150-SHOW-FORM.
039200
      *-----  IF QUOTE NUMBER NOT ENTERED, THE SCREEN WILL RETURN
      *-----  SPACES FOR THE QUOTE NUMBER DUE TO NUMERIC EDIT.  IN
      *-----  THIS CASE, MOVE ZEROS TO SCREEN FIELD TO SIGNIFY NO ENTRY

           IF VIEW-QUOTE = SPACES
              MOVE "000000" TO VIEW-QUOTE.

      *-----  CHECK TO SEE THAT AT LEAST ONE OPTION HAS BEEN SELECTED

           IF  (VIEW-QUOTE = "000000")
           AND (VIEW-CORPCODE = SPACES)
           AND (VIEW-VENDOR   = SPACES)
           AND (VIEW-REQ      = SPACES)
           AND (VIEW-X        = SPACES)
           AND (VIEW-NC-DESC  = SPACES)
      *** YOU MUST ENTER ONE OF THE SELECTION CRITERIA
              MOVE 157 TO LANG-MSGNUM
              MOVE 66  TO LANG-SETNUM
              MOVE B"1" TO IND (02)
              MOVE B"1" TO IND (05)
              MOVE B"1" TO IND (03)
              MOVE B"1" TO IND (04)
              MOVE B"1" TO IND (07)
              MOVE 1    TO FIELD-NUMBER
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 940-VSETERROR THRU 949-EXIT
              GO TO 150-SHOW-FORM.

      *-----  IF CHANGE QUOTE DEFAULTS OR NON-CODED DESCRIPTION
      *-----  SELECTED, QUOTE NUMBER MUST BE ENTERED

           IF (VIEW-NC-DESC > SPACES OR VIEW-X > SPACES)
               IF VIEW-QUOTE = "000000"
      *** QUOTE NUMBER MUST BE ENTERED
                  MOVE 24 TO LANG-MSGNUM
                  MOVE 17 TO LANG-SETNUM
                  MOVE B"1" TO IND(04)
                  MOVE B"1" TO IND(07)
                  MOVE 1  TO FIELD-NUMBER
                  PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                  PERFORM 940-VSETERROR THRU 949-EXIT
                  GO TO 150-SHOW-FORM.

039900     MOVE VIEW-QUOTE       TO QUOTE-ARG-NUM.
040000     MOVE VIEW-CORPCODE    TO CODE-ARG.
040100     MOVE VIEW-VENDOR      TO VENDOR-ARG.
040200     MOVE VIEW-REQ         TO REQ-ARG.

      ***********************************************************
      *  MOVE ZERO TO COND-WORD TO AVOID  A BLOW-UP IN THE CASE *
      *  WHERE FILE-STATUS IS '00' AND SO COND-WORD IS NOT SET. *
      *  THIS CAUSES A BLOW-UP IF COND-WORD WAS PREVIOUSLY SET  *
      *  TO A NON-ZERO VALUE SUCH AS END-OF-CHAIN.              *
      ***********************************************************
           MOVE ZERO TO COND-WORD.
040300
040400*----------  VALIDATE QUOTE NUMBER
040500     IF VIEW-QUOTE  = "000000"
              GO TO 152-VENDOR.
           MOVE 0 TO COND-WORD.
           MOVE VIEW-QUOTE TO QUOTENUM OF DVENDITM-REC3.
           START DVENDITM3 KEY = QUOTENUM OF DVENDITM-REC3
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
038200     IF NOT GOOD-CALL
040900*** QUOTE DOES NOT EXIST
041000        MOVE 08 TO LANG-MSGNUM
041100        MOVE 17 TO LANG-SETNUM
041200        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
041300        PERFORM 940-VSETERROR THRU 949-EXIT
041400        GO TO 150-SHOW-FORM.
041500
       152-VENDOR.
041600*----------  VALIDATE VENDOR CODE
039100     IF VIEW-VENDOR = SPACES
              GO TO 153-CORPCODE.
      *-----  CALL ALT KEY SUB-PGM TO GET ALT KEY IF ONE EXISTS
           MOVE VIEW-VENDOR TO ALT-KEY-ARG.
           CALL "TALTVENK" USING RET-CODE-TALTVENK,
                                 BASE-TALTVENK,
                                 STATUS-AREA,
                                 ALT-KEY-ARG,
                                 ALT-VEND-CODE.
           IF RET-CODE-TALTVENK NOT EQUAL "00"
              MOVE "TALTVENK ERROR 152-V" TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.
           MOVE ZEROS TO COND-WORD.
           MOVE ALT-VEND-CODE   TO VIEW-VENDOR VENDOR-ARG.
039200     MOVE VIEW-VENDOR TO VENCDE OF DVENDOR-REC.
039300     START DVENDOR KEY = VENCDE OF DVENDOR-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 = "2"
                 MOVE 17 TO COND-WORD
              ELSE
                 MOVE 99 TO COND-WORD.
042000     IF NO-ENTRY
042100*** VENDOR CODE DOES NOT EXIST
042200        MOVE 03 TO LANG-MSGNUM
042300        MOVE 22 TO LANG-SETNUM
042400        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
042500        PERFORM 940-VSETERROR THRU 949-EXIT
042600        GO TO 150-SHOW-FORM.
042700
       153-CORPCODE.
040200     IF VIEW-CORPCODE = SPACES
              GO TO 154-QUOTE.
040300     MOVE VIEW-CORPCODE                  TO CODE-ARG.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC
           START MSTORERM KEY = CORPCDE OF MSTORERM-REC
              INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 = "2"
                 MOVE 17 TO COND-WORD
              ELSE
                 MOVE 99 TO COND-WORD.
040400*----------  VALIDATE CORPORATE CODE IF ENTERED
040700     IF NO-ENTRY
040800*** CODE DOES NOT EXIST
040900           MOVE 23 TO LANG-MSGNUM
041000           MOVE  3 TO LANG-SETNUM
041100           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
041200           PERFORM 940-VSETERROR THRU 949-EXIT
041300           GO TO 150-SHOW-FORM
041400      ELSE
041500           IF NOT GOOD-CALL
041600              MOVE "DBGET MSTORERM SQUOTUPD 153" TO BU-DISPLAY-MSG
041700              PERFORM 990-BLOWUP THRU 999-EXIT.
041800
044700 154-QUOTE.
044500     IF VIEW-ITEM NOT = "0000"
044600        MOVE "NON-STR" TO VIEW-CORPCODE.

044410     IF VIEW-NC-DESC = "X"
             IF VIEW-CORPCODE = "NON-STR"
044420        PERFORM 700-NONCODED-DESC THRU 799-EXIT
044421        IF LASTREC-READ = ZEROES
044422*** DESCRIPTION DOES NOT EXIST OR IS ON A REQUISITION
044423           MOVE 18 TO LANG-MSGNUM
044424           MOVE  4 TO LANG-SETNUM
044425           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
044426           PERFORM 940-VSETERROR THRU 949-EXIT
044427           GO TO 150-SHOW-FORM
044428         ELSE
044430           GO TO 100-GET-ENTRY.

044800     IF VIEW-QUOTE NOT = "000000"
044900       IF VIEW-CORPCODE NOT = SPACES
045000          MOVE 2 TO LOOK-FOR
045100       ELSE
045200          IF VIEW-REQ NOT = SPACES
045300             MOVE 8 TO LOOK-FOR
045400          ELSE
045500             MOVE 1 TO LOOK-FOR
045600     ELSE
045700       IF VIEW-VENDOR NOT = SPACES
045800          IF VIEW-CORPCODE NOT = SPACES
045900             MOVE 4 TO LOOK-FOR
046000          ELSE
046100             IF VIEW-REQ NOT = SPACES
046200                MOVE 9 TO LOOK-FOR
046300             ELSE
046400                MOVE 3 TO LOOK-FOR
046500       ELSE
046600           IF VIEW-REQ NOT = SPACES
046700              MOVE 7 TO LOOK-FOR
046800           ELSE
046900             MOVE 5 TO LOOK-FOR.
047000
047100     IF VIEW-X = "X"
047200        MOVE 6 TO LOOK-FOR.
047300     MOVE SPACES TO MESSAGE-BUFFER.
047400     MOVE 0 TO WHICH-TIME.
047500     IF QUOTE-ONLY
047600        PERFORM 200-GET-QUOTE THRU 299-EXIT
047700        GO TO 170-AFTER-DATA.
047800     IF QUOTE-AND-CODE
047900        MOVE 1 TO WHICH-TIME
048000        PERFORM 200-GET-QUOTE THRU 299-EXIT
048100        GO TO 170-AFTER-DATA.
048200
048300     IF QUOTE-AND-REQ
048400        MOVE 2 TO WHICH-TIME
048500        PERFORM 200-GET-QUOTE THRU 299-EXIT
048600        GO TO 170-AFTER-DATA.
048700
048800     IF VENDOR-ONLY
048900        PERFORM 300-GET-VENDOR THRU 399-EXIT
049000        GO TO 170-AFTER-DATA.
049100
049200     IF VENDOR-AND-CODE
049300        MOVE 1 TO WHICH-TIME
049400        PERFORM 300-GET-VENDOR THRU 399-EXIT
049500        GO TO 170-AFTER-DATA.
049600
049700     IF VENDOR-AND-REQ
049800        MOVE 2 TO WHICH-TIME
049900        PERFORM 300-GET-VENDOR THRU 399-EXIT
050000        GO TO 170-AFTER-DATA.
050100
050200     IF CODE-ONLY OR REQ-ONLY
050300        PERFORM 400-GET-CODE THRU 499-EXIT
050400        GO TO 170-AFTER-DATA.
050500
050600     IF UPDATE-DEFAULTS
050700        PERFORM 200-GET-QUOTE THRU 299-EXIT
050800        PERFORM 660-UPDATE-DEFAULTS THRU 669-EXIT
050900        IF SAVE-VIEW-LASTKEY = 8 OR 1
051000           MOVE 1 TO LOOK-FOR
      *----------  DON'T SKIP FIRST RECORD THAT WAS ALREADY READ
                 PERFORM 850-BACK-QUOTE
051100           PERFORM 200-GET-QUOTE THRU 299-EXIT
051200           GO TO 170-AFTER-DATA
051300        ELSE
051400           IF SAVE-VIEW-LASTKEY = 2 OR 7
051500              GO TO 100-GET-ENTRY
051600           ELSE
051700              GO TO 199-EXIT.
051800        GO TO 100-GET-ENTRY.
051900
052000 170-AFTER-DATA.
052100     IF MESSAGE-BUFFER NOT = SPACES
052200        GO TO 150-SHOW-FORM.
052300     MOVE 60                    TO LANG-SETNUM.
052400     MOVE 43                    TO LANG-MSGNUM.
052500     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
052600     MOVE MESSAGE-BUFFER        TO V2-TITLE.
052700     MOVE SPACES TO MESSAGE-BUFFER.
052800     PERFORM 500-GET-ITEM-DATA THRU 599-EXIT.
052900     IF VIEW-LASTKEY = 7
053000        GO TO 100-GET-ENTRY.
053100     IF VIEW-LASTKEY = 3
053200        GO TO 199-EXIT.
053300
053400     IF MESSAGE-BUFFER NOT = SPACES
053500        GO TO 150-SHOW-FORM.
053600
053700     GO TO 100-GET-ENTRY.
053800 199-EXIT.  EXIT.
053900
051100 200-GET-QUOTE.
053100     MOVE SPACES                     TO MESSAGE-BUFFER.
053200     MOVE ZEROES                     TO V2-ITEM-NO.
053300 210-GET-ITEMS.
           MOVE 0 TO COND-WORD.
           READ DVENDITM3 NEXT INTO BUF-DVENDITM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF QUOTENUM OF DVENDITM-REC3  NOT = QUOTE-ARG
               MOVE 15 TO COND-WORD.
053600     IF END-OF-CHAIN
053700        IF FIRST-TIME-CODE OR FIRST-TIME-REQ
053800******** CODE DOES NOT EXIST ON THIS QUOTE
053900         MOVE 17 TO LANG-SETNUM
054000         MOVE 15 TO LANG-MSGNUM
054100         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
054200         PERFORM 940-VSETERROR THRU 949-EXIT
054300         GO TO 299-EXIT
054400        ELSE
054500******* QUOTE HAS NO ITEMS
054600          MOVE 17 TO LANG-SETNUM
054700          MOVE 09 TO LANG-MSGNUM
054800          PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
054900          PERFORM 940-VSETERROR THRU 949-EXIT
055000          GO TO 299-EXIT.
055100     IF NOT GOOD-CALL
055200        MOVE "DBGET DVENDITM 210 SQUOTUPD" TO BU-DISPLAY-MSG
055300        PERFORM 990-BLOWUP THRU 999-EXIT.
055400
055500     IF FIRST-TIME-CODE
055600        IF VEN-ITM-CORPCODE = VIEW-CORPCODE
               IF VEN-NONCODED-ITEM = VIEW-ITEM
055700          IF VEN-QUOTE-FLAG = "Q"
055800           NEXT SENTENCE
055900          ELSE
                 GO TO 210-GET-ITEMS
               ELSE
056000           GO TO 210-GET-ITEMS
056100        ELSE
056200           GO TO 210-GET-ITEMS.
056300
056400     IF FIRST-TIME-REQ
056500        IF VEN-REQ = VIEW-REQ
056600          IF VEN-QUOTE-FLAG = "Q"
056700           NEXT SENTENCE
056800          ELSE
056900           GO TO 210-GET-ITEMS
057000        ELSE
057100           GO TO 210-GET-ITEMS.
057200
            ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
            MOVE IO-REL-NO TO RELATIVE-KEY.
057300 299-EXIT.  EXIT.
057400
057500 300-GET-VENDOR.
           MOVE 0 TO COND-WORD.
           MOVE VENDOR-ARG TO VENCDE OF DVENDITM-REC.
           START DVENDITM KEY = VENCDE OF DVENDITM-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
057800     IF NO-ENTRY
057900******* VENDOR IS NOT LINKED TO ANY CODES
058000          MOVE 22 TO LANG-SETNUM
058100          MOVE 04 TO LANG-MSGNUM
058200          PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
058300          PERFORM 940-VSETERROR THRU 949-EXIT
058400          GO TO 399-EXIT.
058500     IF NOT GOOD-CALL
058600        MOVE "DBFIND DVENDITM 330 SQUOTUPD" TO BU-DISPLAY-MSG
058700        PERFORM 990-BLOWUP THRU 999-EXIT.
058800
059600     MOVE ZEROES TO V2-ITEM-NO.
059700 310-GET-ITEMS.
           MOVE 0 TO COND-WORD.
           READ DVENDITM NEXT INTO BUF-DVENDITM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF VENCDE OF DVENDOR-REC NOT = VENDOR-ARG
               MOVE 15 TO COND-WORD.
060000     IF END-OF-CHAIN
060100        IF FIRST-TIME-CODE OR FIRST-TIME-REQ
060200******** CODE DOES NOT EXIST WITH VENDOR ON QUOTE
060300         MOVE  3 TO LANG-SETNUM
060400         MOVE 157 TO LANG-MSGNUM
060500         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
060600         PERFORM 940-VSETERROR THRU 949-EXIT
060700         GO TO 399-EXIT
060800        ELSE
060900******* VENDOR IS NOT LINKED TO ANY CODES
061000          MOVE 22 TO LANG-SETNUM
061100          MOVE 04 TO LANG-MSGNUM
061200          PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
061300          PERFORM 940-VSETERROR THRU 949-EXIT
061400          GO TO 399-EXIT.
061500     IF NOT GOOD-CALL
061600        MOVE "DBGET DVENDITM 310 SQUOTUPD" TO BU-DISPLAY-MSG
061700        PERFORM 990-BLOWUP THRU 999-EXIT.
061800
061900     IF FIRST-TIME-CODE
062000        IF VEN-ITM-CORPCODE = VIEW-CORPCODE
062100          IF VEN-QUOTE-FLAG = "Q"
062200           NEXT SENTENCE
062300          ELSE
062400            GO TO 310-GET-ITEMS
062500        ELSE
062600           GO TO 310-GET-ITEMS.
062700
062800     IF FIRST-TIME-REQ
062900        IF VEN-REQ = VIEW-REQ
063000          IF VEN-QUOTE-FLAG = "Q"
063100           NEXT SENTENCE
063200          ELSE
063300            GO TO 310-GET-ITEMS
063400        ELSE
063500           GO TO 310-GET-ITEMS.
063600      MOVE VEN-QUOTE-NUM TO QUOTE-ARG.
            ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
            MOVE IO-REL-NO TO RELATIVE-KEY.
063700 399-EXIT.  EXIT.
063800
063900 400-GET-CODE.
064000     IF REQ-ONLY
064100       PERFORM 470-FIND-REQ
064300     ELSE
064400       PERFORM 480-FIND-CODE.
064600     IF NO-ENTRY
064700******* CODE IS NOT ON ANY QUOTE
064800          MOVE 03 TO LANG-SETNUM
064900          MOVE 158 TO LANG-MSGNUM
065000          PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
065100          PERFORM 940-VSETERROR THRU 949-EXIT
065200          GO TO 499-EXIT.
065300     IF NOT GOOD-CALL
065400        MOVE "DBFIND DVENDITM 400 SQUOTUPD" TO BU-DISPLAY-MSG
065500        PERFORM 990-BLOWUP THRU 999-EXIT.
066400     MOVE ZEROES TO V2-ITEM-NO.
066500
066600 410-GET-ITEMS.
066700     IF REQ-ONLY
066800        PERFORM 857-FORWARD-REQ
067000     ELSE
067100        PERFORM 856-FORWARD-CORPCODE.
067300     IF END-OF-CHAIN
067400******** CODE DOES NOT EXIST ON ANY QUOTE
067500         MOVE 03 TO LANG-SETNUM
067600         MOVE 158 TO LANG-MSGNUM
067700         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
067800         PERFORM 940-VSETERROR THRU 949-EXIT
067900          GO TO 499-EXIT.
068000     IF NOT GOOD-CALL
068100        MOVE "DBGET DVENDITM 410 SQUOTUPD" TO BU-DISPLAY-MSG
068200        PERFORM 990-BLOWUP THRU 999-EXIT.
068300
068400     IF VEN-QUOTE-FLAG NOT = "Q"
068500        GO TO 410-GET-ITEMS.
068600
068700     GO TO 499-EXIT.

       470-FIND-REQ.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DVENDITM-REC4.
           START DVENDITM4  KEY = REQNO OF DVENDITM-REC4
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.

       480-FIND-CODE.
           MOVE CODE-ARG TO CORPCDE OF DVENDITM-REC2.
           MOVE 0 TO COND-WORD.
           START DVENDITM2  KEY = CORPCDE OF DVENDITM-REC2
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.

068800 499-EXIT.  EXIT.
068900 500-GET-ITEM-DATA.
069000     MOVE VEN-ITM-VENCODE TO VENDOR-ARG, V2-VENCODE.
           MOVE "00" TO VENITMNO OF DVENDOR.
069100     MOVE VENDOR-ARG TO VENCDE OF DVENDOR.
           MOVE 0 TO COND-WORD.
           READ DVENDOR  INTO BUF-DVENDOR
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
069200*----------  FIND VENDOR NAME
069500     IF NOT GOOD-CALL
069600        MOVE "NO VENDOR NAME AVAILABLE" TO V2-VENDOR-NAME
069700        GO TO 525-HEADER-INFO.
070100     MOVE VEN-ITM-DATA               TO V2-VENDOR-NAME.
070200
070300     MOVE SPACES TO V2-CC, V2-CURR.
07040
           MOVE "10" TO VENITMNO OF DVENDOR.
069100     MOVE VENDOR-ARG TO VENCDE OF DVENDOR.
           MOVE 0 TO COND-WORD.
           READ DVENDOR  INTO BUF-DVENDOR
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
069200*----------  FIND CURRENCY
069500     IF NOT GOOD-CALL
069600        MOVE "??" TO V2-CC
069700        GO TO 525-HEADER-INFO.
070100     MOVE VEN-CC   TO V2-CC.
           PERFORM 830-GET-CC-DESC THRU 839-EXIT.
072000
072100 525-HEADER-INFO.
072300     MOVE 4 TO DATE-MODE.
072400     IF VEN-RETURN-DATE-CN > CY-TODAY-DATE
072500        IF VEN-ACTUAL-DATE-RETURNED = SPACES
072600           MOVE WS-OUT-FOR-BID TO V2-STATUS
072700        ELSE
072800           IF CY-TODAY-DATE > VEN-CREATE-DATE-CN
072900              MOVE WS-WORKSHEET TO V2-STATUS
073000           ELSE
073100              MOVE WS-CURRENT   TO V2-STATUS
073200     ELSE
073300        IF VEN-ACTUAL-DATE-RETURNED = SPACES
073400           MOVE WS-NOT-RETURNED TO V2-STATUS
073500        ELSE
073600           MOVE WS-CURRENT      TO V2-STATUS.
073700
073800     IF VEN-ITM-PRICE-DATE > SPACES
073900        IF VEN-ITM-PRICE-DATE-CN < CY-TODAY-DATE
074000           MOVE WS-EXPIRED         TO V2-STATUS.
074100
077100     MOVE VEN-BUYER-CODE TO BUYER-ARG.
           MOVE 0 TO COND-WORD.
           MOVE BUYER-ARG TO BUYERCDE   OF MBUYER-REC.
           READ MBUYER INTO BUF-MBUYER
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
077400     IF NOT GOOD-CALL
077500        MOVE "BUYER NAME NOT AVAILABLE" TO V2-BUYER-NAME
077600     ELSE
077700        MOVE BUYER-NAME TO V2-BUYER-NAME.
077800
077900
078000 530-MOVE-ITEM-FIELDS.
078100     MOVE VEN-ITM-VENCODE TO V2-VENCODE.
078200     MOVE VEN-REAL-QUOTE TO V2-QUOTE.
078210     MOVE VEN-REF        TO V2-REF.
078300     MOVE VEN-ITM-CORPCODE TO V2-CORPCODE, CODE-ARG.
078400     MOVE SPACES TO V2-DESC-AREA.
078500     IF VEN-NONCODED-ITEM > 0
078510        MOVE VEN-NONCODED-UM TO V2-CODE-UM
078600        IF VEN-REQ = SPACES
078700           PERFORM 800-GET-NONCODED-DESC THRU 809-EXIT
078800        ELSE
078900           PERFORM 810-GET-NONCODED-REQ  THRU 819-EXIT
079000     ELSE
079100        MOVE SPACES TO CDESC-AREA
079200        CALL "CDESC" USING RET-CODE, BASE, STATUS-AREA,
079300                  BU-DISPLAY-MSG, VEN-ITM-CORPCODE, CDESC-DATA
079400        MOVE CDESC (1) TO V2-DESC1
079500        MOVE CDESC (2) TO V2-DESC2
079600        MOVE CDESC (3) TO V2-DESC3
              PERFORM 840-GET-MSTORERM THRU 849-EXIT
079900        MOVE STR-UM TO V2-CODE-UM.
080000     MOVE VEN-BID-QTY TO V2-BIDQTY.
080100     MOVE VEN-BUYER-CODE TO V2-BUYERCODE.
080200     MOVE VEN-ITM-PRICE TO WORK-PRICE.
080300     MOVE WORK-PRICE-W TO V2-PRICEW.
080400     MOVE WORK-PRICE-D  TO V2-PRICED.
080500     MOVE VEN-ITM-PRICE-UM TO V2-UM.
080600     MOVE VEN-TERMS TO V2-BILLING-TERMS.
080700     MOVE VEN-EST-LT TO V2-LEAD.
080800     MOVE VEN-FOB TO V2-FB.
080900     MOVE VEN-SPLC TO V2-SHIPLOC.
081000     MOVE VEN-DISCOUNT  TO V2-DISCOUNT.
081100     MOVE VEN-REQ TO V2-REQ.
      *****IF VEN-DSCT1  NOT = SPACES           *REPLACED 17JUL1997*
           IF VEN-DSCT1 IS NUMERIC
081200        MOVE VEN-DSCT1 TO V2-DISCOUNT-PCNT1
           ELSE
              MOVE ZEROES TO V2-DISCOUNT-PCNT1.
      *****IF VEN-DSCT2 NOT = SPACES            *REPLACED 17JUL1997*
           IF VEN-DSCT2 IS NUMERIC
081210        MOVE VEN-DSCT2 TO V2-DISCOUNT-PCNT2
           ELSE
              MOVE ZEROES TO V2-DISCOUNT-PCNT2.
081300     MOVE VEN-SURCHARGE TO WORK-PRICE.
081400     MOVE WORK-PRICE-W TO V2-SURCHARGW.
081500     MOVE WORK-PRICE-D TO V2-SURCHARGD.
           IF VEN-NONCODED-ITEM = SPACES
              MOVE "0000" TO V2-ITEM-NO
           ELSE
              MOVE VEN-NONCODED-ITEM TO V2-ITEM-NO.
081600
081610     MOVE 4 TO DATE-MODE.
081700     IF VEN-ITM-PRICE-DATE = SPACES
081800        MOVE SV-DATE1 TO V2-EXP-DATE
081900     ELSE
082000        MOVE VEN-ITM-PRICE-DATE TO DATE-VALIDATE-IN
082100        CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
082200        MOVE DATE-SLASH-OUT TO V2-EXP-DATE.
082210     IF VEN-CREATE-DATE = SPACES
082211        MOVE SV-DATE2 TO V2-EFF-DATE
082212     ELSE
082213     MOVE VEN-CREATE-DATE TO DATE-VALIDATE-IN
082214     CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
082215     MOVE DATE-SLASH-OUT TO V2-EFF-DATE.
082216
082217     IF VEN-RETURN-DATE  = SPACES
082218        MOVE SPACES TO V2-DATE-TO-RETURN
082219     ELSE
082220     MOVE VEN-RETURN-DATE TO DATE-VALIDATE-IN
082221     CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
082222     MOVE DATE-SLASH-OUT TO V2-DATE-TO-RETURN.
082223
082224     IF VEN-ACTUAL-DATE-RETURNED  = SPACES
082225        MOVE SV-DATE4 TO V2-DATE-RETURNED
082226     ELSE
082227     MOVE VEN-ACTUAL-DATE-RETURNED TO DATE-VALIDATE-IN
082228     CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
082229     MOVE DATE-SLASH-OUT TO V2-DATE-RETURNED.
082300     MOVE VEN-TERMS TO V2-BILLING-TERMS.
082400     MOVE VEN-DISCOUNT TO V2-DISCOUNT.
082500
082600     MOVE 1 TO X.
082700     PERFORM 535-MOVE-PRICE-BREAKS 3 TIMES.
082800     GO TO 540-DISPLAY-ITEM.
082900
083000 535-MOVE-PRICE-BREAKS.
083100*    IF VEN-LOW-QTY (X) = 0
083200*       MOVE SPACES TO V2-LOW-QTY (X)
083300*    ELSE
083400        MOVE VEN-LOW-QTY (X) TO V2-LOW-QTY9 (X).
083500*    IF VEN-HIGH-QTY (X) = 0
083600*       MOVE SPACES TO V2-HIGH-QTY (X)
083700*    ELSE
083800        MOVE VEN-HIGH-QTY (X) TO V2-HIGH-QTY9 (X).
083900     MOVE VEN-QTY-UM (X) TO V2-BPRICE-UM (X).
084000*    IF VEN-WORK-PRICE (X) = 0
084100*       MOVE SPACES TO V2-BPRICEW (X), V2-BPRICED (X)
084200*    ELSE
084300        MOVE VEN-WORK-PRICE (X) TO WORK-PRICE
084400        MOVE WORK-PRICE-W TO V2-BPRICEW (X)
084500        MOVE WORK-PRICE-D TO V2-BPRICED (X).
084600
084700     ADD 1 TO X.
084800 540-DISPLAY-ITEM.
           MOVE ITEM-SCREEN TO VIEW-NFNAME.
       542-SHOW-FORM.
           MOVE SCREEN2-BUFFER TO DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
              INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO SRF-INDICATORS.
           MOVE DISPLAY-REC TO SCREEN2-BUFFER.

      *------ A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *------ IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.
035800
035900     IF VIEW-LASTKEY EQUAL 3
036000        GO TO 599-EXIT.
036100
036200     IF VIEW-LASTKEY EQUAL 5
              MOVE 9 TO LANG-SETNUM
              MOVE 10 TO LANG-MSGNUM
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
036800        PERFORM 940-VSETERROR THRU 949-EXIT
036900        GO TO 540-DISPLAY-ITEM.
037200
087300*----------  F1=HELP SCREEN
087400     IF VIEW-LASTKEY = 1
087500        MOVE "HQTITM" TO HELP-FORMNAME
              MOVE "ZUDCQUOT" TO VIEW-CFNAME
087600        CALL "SHELPSCR" USING VIEW-COMAREA LANGUAGE-PARMS
087700                              HELP-FORMNAME
087800        GO TO 540-DISPLAY-ITEM.
091000
091100*------ MAKE USER PRESS F2 DELETE TWICE BEFORE REALLY DELETING
091200     IF VIEW-LASTKEY = 2
091300        IF SECOND-TIME
091400           MOVE 0 TO MAKE-SURE
091500           PERFORM 610-DELETE-ITEM THRU 619-EXIT
091600           GO TO 550-DISPLAY-FORWARD
091700        ELSE
091800           MOVE 1 TO MAKE-SURE
091900*------ 'IF SURE OF DELETE, PRESS F2 AGAIN'
092000           MOVE 9 TO LANG-SETNUM
092100           MOVE 44 TO LANG-MSGNUM
092200           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
092300           PERFORM 940-VSETERROR THRU 949-EXIT
092400           GO TO 540-DISPLAY-ITEM.
092500     MOVE 0 TO MAKE-SURE.
092600
092700     IF VIEW-LASTKEY = 3 OR 7
092800        GO TO 599-EXIT.
092900
090400
090500*----------  SHOW NEXT ITM
090600     IF VIEW-LASTKEY = 4
              IF NO-NEXT = 1
096200*** NO MORE RECORDS TO REVIEW-CHOOSE ANOTHER FUNCTION
096300           MOVE 14 TO LANG-SETNUM
096400           MOVE 96 TO LANG-MSGNUM
096500           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
096600           PERFORM 940-VSETERROR THRU 949-EXIT
096700           GO TO 540-DISPLAY-ITEM
              ELSE
090700           GO TO 550-DISPLAY-FORWARD.
090800
090900*----------  PREVIOUS ITEM
091000     IF VIEW-LASTKEY = 8
              IF NO-PREV = 1
092900**** NO PREVIOUS RECORDS TO REVIEW-CHOOSE ANOTHER FUNCTION
093000           MOVE 14 TO LANG-SETNUM
093100           MOVE 98 TO LANG-MSGNUM
093200           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
093300           PERFORM 940-VSETERROR THRU 949-EXIT
093400           GO TO 540-DISPLAY-ITEM
               ELSE
091100           GO TO 545-DISPLAY-PREVIOUS.
093800*-----------  ADD ITEM
093900     IF VIEW-LASTKEY = 6
094700        PERFORM 630-ADD-ITEM THRU 639-EXIT
094900        GO TO 599-EXIT.
095000
095100*----------  IF 'ENTER' WAS PRESSED, TREAT AS 'UPDATE' KEY
095800     MOVE SPACES TO MESSAGE-BUFFER.
095900     PERFORM 620-VALIDATE-ALL THRU 629-EXIT.
096000     IF MESSAGE-BUFFER NOT = SPACES
096100        GO TO 542-SHOW-FORM.
096200
096300     PERFORM 600-UPDATE-ITEM THRU 609-EXIT.
           IF NO-NEXT = 1
096200*** NO MORE RECORDS TO REVIEW-CHOOSE ANOTHER FUNCTION
096300        MOVE 14 TO LANG-SETNUM
096400        MOVE 96 TO LANG-MSGNUM
096500        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
096600        PERFORM 940-VSETERROR THRU 949-EXIT
096700        GO TO 540-DISPLAY-ITEM
           ELSE
090700        GO TO 550-DISPLAY-FORWARD.
096500
091300 545-DISPLAY-PREVIOUS.
091400     IF QUOTE-ONLY OR QUOTE-AND-CODE OR QUOTE-AND-REQ
091500        PERFORM 850-BACK-QUOTE
091700     ELSE
091800        IF VENDOR-ONLY OR VENDOR-AND-CODE OR VENDOR-AND-REQ
091900           PERFORM 851-BACK-VENDOR
092100        ELSE
092200         IF CODE-ONLY
092300           PERFORM 852-BACK-CORPCODE
092500         ELSE
092600           PERFORM 853-BACK-REQ.
092800     IF START-OF-CHAIN
              MOVE 1 TO NO-PREV
092900**** NO PREVIOUS RECORDS TO REVIEW-CHOOSE ANOTHER FUNCTION
093000        MOVE 14 TO LANG-SETNUM
093100        MOVE 98 TO LANG-MSGNUM
093200        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
093300        PERFORM 940-VSETERROR THRU 949-EXIT
093400        GO TO 540-DISPLAY-ITEM.
093500     IF NOT GOOD-CALL
093600        MOVE "DBGET6 DVENDITM 545 SQUOTUPD" TO BU-DISPLAY-MSG
093700        PERFORM 990-BLOWUP THRU 999-EXIT.
093800
093900     IF VEN-QUOTE-FLAG NOT = "Q"
094000        GO TO 545-DISPLAY-PREVIOUS.
094010
094020     IF VENDOR-ONLY OR VENDOR-AND-CODE OR VENDOR-AND-REQ
094030        GO TO 525-HEADER-INFO.
094040     IF CODE-ONLY OR REQ-ONLY
094050        GO TO 500-GET-ITEM-DATA.
094100     GO TO 530-MOVE-ITEM-FIELDS.
094200
094300 550-DISPLAY-FORWARD.
094400     IF QUOTE-ONLY OR QUOTE-AND-CODE OR QUOTE-AND-REQ
094500        PERFORM 854-FORWARD-QUOTE
094700     ELSE
094800        IF VENDOR-ONLY OR VENDOR-AND-CODE OR VENDOR-AND-REQ
094900           PERFORM 855-FORWARD-VENDOR
095100           MOVE ZEROES TO V2-ITEM-NO
095200        ELSE
095300         IF CODE-ONLY
095400           PERFORM 856-FORWARD-CORPCODE
095600           MOVE ZEROES TO V2-ITEM-NO
095700         ELSE
095800           PERFORM 857-FORWARD-REQ
096000           MOVE ZEROES TO V2-ITEM-NO.
096100     IF END-OF-CHAIN
             MOVE 1 TO NO-NEXT
096200*** NO MORE RECORDS TO REVIEW-CHOOSE ANOTHER FUNCTION
096300       MOVE 14 TO LANG-SETNUM
096400       MOVE 96 TO LANG-MSGNUM
096500       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
096600       PERFORM 940-VSETERROR THRU 949-EXIT
096700       GO TO 540-DISPLAY-ITEM.
096800
096900     IF VEN-QUOTE-FLAG NOT = "Q"
097000        GO TO 550-DISPLAY-FORWARD.
097100
097200     IF VENDOR-ONLY OR VENDOR-AND-CODE OR VENDOR-AND-REQ
097300        GO TO 525-HEADER-INFO.
097400     IF CODE-ONLY OR REQ-ONLY
097500        GO TO 500-GET-ITEM-DATA.
097600     GO TO 530-MOVE-ITEM-FIELDS.
103500 599-EXIT.     EXIT.
103600
103700 600-UPDATE-ITEM.
103800*---------  UPDATE ITEM.  FIRST FIND THE CORRECT RECORD TO
      *           UPDATE.
           MOVE 0 TO COND-WORD.
           READ DVENDITM-O INTO BUF-DVENDITM
                INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF NOT GOOD-CALL
            MOVE "NO UPDATE REC FOUND-600 SQUOTUPD" TO BU-DISPLAY-MSG
            PERFORM 990-BLOWUP THRU 999-EXIT.

104400     MOVE V2-BIDQTY-R      TO VEN-BID-QTY.
104500     MOVE V2-PRICEW-R      TO WORK-PRICE-W.
104600     MOVE V2-PRICED        TO WORK-PRICE-D.
104700     MOVE WORK-PRICE       TO VEN-ITM-PRICE.
104800     MOVE V2-UM            TO VEN-ITM-PRICE-UM.

      *-----  FORMAT SAVE-DATE FIELDS WITH CENTURY

           PERFORM 6000-FORMAT-SAVE-DATE THRU 6000-EXIT.
104900     MOVE SAVE-DATE1-CN    TO VEN-ITM-PRICE-DATE-CN.
105000     MOVE SAVE-DATE2-CN    TO VEN-CREATE-DATE-CN.
105100     MOVE SAVE-DATE3-CN    TO VEN-RETURN-DATE-CN.
105200     MOVE SAVE-DATE4-CN    TO VEN-ACTUAL-DATE-RETURNED-CN.
105300     MOVE V2-FB            TO VEN-FOB.
105400     MOVE V2-BILLING-TERMS  TO VEN-TERMS.
105500     MOVE V2-SHIPLOC       TO VEN-SPLC.
105600     MOVE V2-LEAD-R        TO VEN-EST-LT.
105700
105800     MOVE V2-LOW-QTY9-R (1)   TO VEN-LOW-QTY (1).
105900     MOVE V2-HIGH-QTY9-R (1)  TO VEN-HIGH-QTY (1).
106000     MOVE V2-BPRICE-UM (1) TO VEN-QTY-UM (1).
106100     MOVE V2-BPRICEW9-R  (1)  TO WORK-PRICE-W.
106200     MOVE V2-BPRICED9-R  (1)  TO WORK-PRICE-D.
106300     MOVE WORK-PRICE       TO VEN-WORK-PRICE (1).
106400
106500     MOVE V2-LOW-QTY9-R (2)   TO VEN-LOW-QTY (2).
106600     MOVE V2-HIGH-QTY9-R (2)  TO VEN-HIGH-QTY (2).
106700     MOVE V2-BPRICE-UM (2) TO VEN-QTY-UM (2).
106800     MOVE V2-BPRICEW9-R  (2)  TO WORK-PRICE-W.
106900     MOVE V2-BPRICED9-R  (2)  TO WORK-PRICE-D.
107000     MOVE WORK-PRICE       TO VEN-WORK-PRICE (2).
107100     MOVE V2-LOW-QTY9-R (3)   TO VEN-LOW-QTY (3).
107200     MOVE V2-HIGH-QTY9-R (3)  TO VEN-HIGH-QTY (3).
107300     MOVE V2-BPRICE-UM (3) TO VEN-QTY-UM (3).
107400     MOVE V2-BPRICEW9-R  (3)  TO WORK-PRICE-W.
107500     MOVE V2-BPRICED9-R  (3)  TO WORK-PRICE-D.
107600     MOVE WORK-PRICE       TO VEN-WORK-PRICE (3).
107700     MOVE V2-DISCOUNT      TO VEN-DISCOUNT.
107800     MOVE V2-SURCHARGW-R      TO WORK-PRICE-W.
107900     MOVE V2-SURCHARGD        TO WORK-PRICE-D.
108000     MOVE WORK-PRICE       TO VEN-SURCHARGE.
108100     MOVE V2-DISCOUNT-PCNT1 TO VEN-DSCT1.
108200     MOVE V2-DISCOUNT-PCNT2 TO VEN-DSCT2.
108300
           MOVE 0 TO COND-WORD.
           REWRITE DVENDITM-REC-O FROM BUF-DVENDITM
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
108600     IF NOT GOOD-CALL
108700        MOVE "REWRITE 600 SQUOTUPD" TO BU-DISPLAY-MSG
108800        PERFORM 990-BLOWUP THRU 999-EXIT.
           GO TO 609-EXIT.
109400
109500 609-EXIT.  EXIT.

       6000-FORMAT-SAVE-DATE.
           MOVE SPACES TO SAVE-DATE-CN-PARMS.
           MOVE SPACES TO CY-FORMAT-DATE.
           MOVE SAVE-DATE1 TO FORMAT-DATE.
           PERFORM 60000-GET-CENTURY THRU 60000-EXIT.
           MOVE CY-FORMAT-DATE TO SAVE-DATE1-CN.
           MOVE SPACES TO CY-FORMAT-DATE.
           MOVE SAVE-DATE2 TO FORMAT-DATE.
           PERFORM 60000-GET-CENTURY THRU 60000-EXIT.
           MOVE CY-FORMAT-DATE TO SAVE-DATE2-CN.
           MOVE SPACES TO CY-FORMAT-DATE.
           MOVE SAVE-DATE3 TO FORMAT-DATE.
           PERFORM 60000-GET-CENTURY THRU 60000-EXIT.
           MOVE CY-FORMAT-DATE TO SAVE-DATE3-CN.
           MOVE SPACES TO CY-FORMAT-DATE.
           MOVE SAVE-DATE4 TO FORMAT-DATE.
           PERFORM 60000-GET-CENTURY THRU 60000-EXIT.
           MOVE CY-FORMAT-DATE TO SAVE-DATE4-CN.

       6000-EXIT.
           EXIT.

       60000-GET-CENTURY.
           IF FORMAT-DATE NOT NUMERIC
              GO TO 60000-EXIT.
           IF FORMAT-YEAR > "70"
              MOVE "19" TO FORMAT-CENT
           ELSE
              MOVE "20" TO FORMAT-CENT.

       60000-EXIT.
           EXIT.

109600*---------  DELETE ITEM
109700 610-DELETE-ITEM.
           MOVE 0 TO COND-WORD.
           DELETE DVENDITM-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
110400
110500*--------  IGNORE IF DBDELETE DOES NOT WORK, THE USER COULD HAVE
110600*          DELETED THE ITEM, THE ITEM STILL SHOWS ON THE SCREEN,
110700*          AND THEN TRIES TO DELETE IT AGAIN.  COULD HAPPEN IF IT
110800*          WAS THE LAST ITEM ON A QUOTE FOR EXAMPLE.
112100 619-EXIT.  EXIT.
112200
112300 620-VALIDATE-ALL.
112400     MOVE SPACES TO SAVE-DATE1, SAVE-DATE2,
112500                    SAVE-DATE3, SAVE-DATE4.
112600
112700     IF V2-EXP-DATE NOT = SPACES
112800        MOVE V2-EXP-DATE TO DATE-VALIDATE-IN
112900        MOVE 3 TO DATE-MODE
113000        CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
113100        IF DATE-RET-CODE NOT = 0
113200           MOVE DATE-MSG TO MESSAGE-BUFFER
113300           MOVE 41 TO FIELD-NUMBER
113400           PERFORM 940-VSETERROR THRU 949-EXIT
113500           GO TO 629-EXIT
113600        ELSE
                 MOVE V2-EXP-DATE  TO SV-DATE1
113700           MOVE DATE-YMD-OUT TO SAVE-DATE1.
113800
113900     IF V2-EFF-DATE NOT = SPACES
114000        MOVE V2-EFF-DATE TO DATE-VALIDATE-IN
114100        MOVE 3 TO DATE-MODE
114200        CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
114300        IF DATE-RET-CODE NOT = 0
114400           MOVE DATE-MSG TO MESSAGE-BUFFER
114500           MOVE 42 TO FIELD-NUMBER
114600           PERFORM 940-VSETERROR THRU 949-EXIT
114700           GO TO 629-EXIT
114800        ELSE
                 MOVE V2-EFF-DATE  TO SV-DATE2
114900           MOVE DATE-YMD-OUT TO SAVE-DATE2.
115000
115100     IF V2-DATE-TO-RETURN NOT = SPACES
115200        MOVE V2-DATE-TO-RETURN TO DATE-VALIDATE-IN
115300        MOVE 3 TO DATE-MODE
115400        CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
115500        IF DATE-RET-CODE NOT = 0
115600           MOVE DATE-MSG TO MESSAGE-BUFFER
115700           MOVE 48 TO FIELD-NUMBER
115800           PERFORM 940-VSETERROR THRU 949-EXIT
115900           GO TO 629-EXIT
116000        ELSE
116100           MOVE DATE-YMD-OUT TO SAVE-DATE3.
116200
116300     IF V2-DATE-RETURNED NOT = SPACES
116400        MOVE V2-DATE-RETURNED TO DATE-VALIDATE-IN
116500        MOVE 3 TO DATE-MODE
116600        CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
116700        IF DATE-RET-CODE NOT = 0
116800           MOVE DATE-MSG TO MESSAGE-BUFFER
116900           MOVE 49 TO FIELD-NUMBER
117000           PERFORM 940-VSETERROR THRU 949-EXIT
117100           GO TO 629-EXIT
117200        ELSE
                 MOVE V2-DATE-RETURNED TO SV-DATE4
117300           MOVE DATE-YMD-OUT TO SAVE-DATE4.
117400
117500     IF V2-UM NOT = SPACES
117600        IF V2-CORPCODE = "NON-STR"
117700           IF V2-UM NOT = V2-CODE-UM
117800*            "QUANTITY AND PRICE UM MUST EQUAL FOR A NON-CODED PO
117900             MOVE  17 TO LANG-SETNUM
118000             MOVE  14 TO LANG-MSGNUM
118100             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
118200             MOVE 13 TO  FIELD-NUMBER
118300             PERFORM 940-VSETERROR THRU 949-EXIT
118400             GO TO 629-EXIT.
118500
118600     IF V2-CORPCODE = "NON-STR"
118700        GO TO 625-ACCT-EDIT.
118800
118900     IF V2-UM = SPACES
119000        GO TO 625-ACCT-EDIT.
119100
119200************************************************
119300**   IF THIS IS A CODED ITEM CHECK TO MAKE
119400**   SURE THE QTY AND PRICE UMs ARE VALID
119500**   UNIT OF MEASURES FOR THE CODE
119600************************************************
119700
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC.
           READ MSTORERM INTO BUF-MSTORERM
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
120000     IF COND-WORD NOT = 0
120100         MOVE "GET MSTORERM 620 SQUOTUPD" TO BU-DISPLAY-MSG
120200         PERFORM 990-BLOWUP THRU 999-EXIT.
120400
120500     IF V2-UM = STR-UM OR STR-UM1 OR STR-UM2
120600         NEXT SENTENCE
120700     ELSE
120800*       *** PRICE UM IS NOT A STOREROOM UM ***
120900         MOVE  16 TO LANG-SETNUM
121000         MOVE  14 TO LANG-MSGNUM
121100         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
121200         MOVE 13  TO  FIELD-NUMBER
121300         PERFORM 940-VSETERROR THRU 949-EXIT
121400         GO TO 629-EXIT.
121500 625-ACCT-EDIT.
121600*----------  EDIT FOB
121700     IF V2-FB NOT = SPACES
121800     MOVE "FB"             TO MISC-ARG1
121900     MOVE V2-FB            TO MISC-ARG2
           MOVE 0 TO COND-WORD.
           MOVE MISC-ARG TO PLTINFOKEY  OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
122200     IF COND-WORD NOT = 0
122300*----   FOB IS NOT VALID
122400        MOVE 6 TO LANG-SETNUM
122500        MOVE 21 TO LANG-MSGNUM
122600        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
122700        MOVE 14 TO FIELD-NUMBER
122800        PERFORM 940-VSETERROR THRU 949-EXIT
122900        GO TO 629-EXIT.
123000
123100*----------  EDIT TERMS
123200     IF V2-BILLING-TERMS NOT = SPACES
123300     MOVE "TMP"            TO MISC-ARG1B
123400     MOVE V2-TM1           TO MISC-ARG2B
           MOVE 0 TO COND-WORD.
           MOVE MISC-ARG TO PLTINFOKEY  OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
123700     IF COND-WORD NOT = 0
123800*----------  TERMS ARE NOT VALID
123900        MOVE 9 TO LANG-SETNUM
124000        MOVE 6 TO LANG-MSGNUM
124100        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
124200        MOVE 16 TO FIELD-NUMBER
124300        PERFORM 940-VSETERROR THRU 949-EXIT
124400        GO TO 629-EXIT.
124500
124600     IF V2-BILLING-TERMS NOT = SPACES
124700     MOVE "TMD"            TO MISC-ARG1B
124800     MOVE V2-TM2           TO MISC-ARG2B
           MOVE 0 TO COND-WORD.
           MOVE MISC-ARG TO PLTINFOKEY  OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
125100     IF COND-WORD NOT = 0
125200*----------  TERMS ARE NOT VALID
125300        MOVE 9 TO LANG-SETNUM
125400        MOVE 6 TO LANG-MSGNUM
125500        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
125600        MOVE 16 TO FIELD-NUMBER
125700        PERFORM 940-VSETERROR THRU 949-EXIT
125800        GO TO 629-EXIT.
125900
126000 629-EXIT.  EXIT.
126100 630-ADD-ITEM.
126200     MOVE SPACES TO V2-CORPCODE, V2-DESC-AREA, V2-REQ,
126300                    V2-SHIPLOC, V2-PRICE-BREAKS (1),
126400                    V2-PRICE-BREAKS (2), V2-PRICE-BREAKS (3),
126500                    V2-DISCOUNT.
126600     MOVE ZEROES TO V2-BIDQTY, V2-PRICEW, V2-PRICED,
126700                    V2-DISCOUNT-PCNT1, V2-DISCOUNT-PCNT2,
126800                    V2-SURCHARGW, V2-SURCHARGD.
           MOVE "0000" TO V2-ITEM-NO.
           MOVE ZEROES TO V2-LOW-QTY9 (1), V2-LOW-QTY9 (2)
                          V2-LOW-QTY9 (3)  V2-HIGH-QTY9 (1)
                          V2-HIGH-QTY9 (2) V2-HIGH-QTY9 (3)
                          V2-BPRICEW (1)   V2-BPRICEW (2)
                          V2-BPRICEW (3)   V2-BPRICED (1)
                          V2-BPRICED (2)   V2-BPRICED (3)
                          V2-LEAD.
126900     MOVE 60                    TO LANG-SETNUM.
127000     MOVE 44                    TO LANG-MSGNUM.
127100     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
127200     MOVE MESSAGE-BUFFER        TO V2-TITLE.
127300     MOVE ITEM-ADD-SCREEN TO VIEW-NFNAME.
127400*-------  'ENTER CODE OR REQ AND PRESS ENTER'
127500     MOVE 05     TO LANG-SETNUM.
127600     MOVE 47     TO LANG-MSGNUM.
           MOVE 61     TO FIELD-NUMBER.
127700     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
127800     PERFORM 940-VSETERROR THRU 949-EXIT.
129900
       632-SHOW-FORM.
           MOVE SCREEN2-BUFFER TO DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
              INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO SRF-INDICATORS.
           MOVE DISPLAY-REC TO SCREEN2-BUFFER.

      *------ A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *------ IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.
035800
035900     IF VIEW-LASTKEY EQUAL 3 OR 7
036000        GO TO 639-EXIT.
036100
036200     IF VIEW-LASTKEY EQUAL 1 OR
036300        VIEW-LASTKEY EQUAL 2 OR
036400        VIEW-LASTKEY EQUAL 8 OR
036500        VIEW-LASTKEY EQUAL 4 OR
036700        VIEW-LASTKEY EQUAL 6
              MOVE 9 TO LANG-SETNUM
              MOVE 10 TO LANG-MSGNUM
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
036800        PERFORM 940-VSETERROR THRU 949-EXIT
036900        GO TO 632-SHOW-FORM.
130900     MOVE SPACES TO MESSAGE-BUFFER.
131000     IF V2-REQ NOT = SPACES
131100        PERFORM 640-GET-REQ THRU 649-EXIT
131200     ELSE
131300        PERFORM 650-GET-CODE THRU 659-EXIT.
131400     IF MESSAGE-BUFFER NOT = SPACES
131500        GO TO 632-SHOW-FORM.
131600
131700     MOVE ITEM-SCREEN TO VIEW-NFNAME.
131800*-------  'MODIFY DATA AND PRESS ENTER'
131900     MOVE 13     TO LANG-SETNUM.
132000     MOVE 58     TO LANG-MSGNUM.
132100     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
132200     PERFORM 940-VSETERROR THRU 949-EXIT.
133300
133400 634-SHOW-FORM.
           MOVE SCREEN2-BUFFER TO DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
              INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO SRF-INDICATORS.
           MOVE DISPLAY-REC TO SCREEN2-BUFFER.

      *------ A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *------ IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.
134400     IF VIEW-LASTKEY = 8 OR 7
134500        GO TO 639-EXIT.
134600
135300     MOVE SPACES TO MESSAGE-BUFFER.
135400     PERFORM 620-VALIDATE-ALL THRU 629-EXIT.
135500     IF MESSAGE-BUFFER NOT = SPACES
135600        GO TO 634-SHOW-FORM.
135700
135800*----------  ADD ITEM TO DVENDITM
           MOVE ZEROES           TO VEN-ITM-YTD-BUS.
136400     MOVE V2-VENCODE       TO VEN-ITM-VENCODE.
136500     MOVE V2-CORPCODE      TO VEN-ITM-CORPCODE.
136600     MOVE "Q"              TO VEN-QUOTE-FLAG.
136700     MOVE QUOTE-ARG        TO VEN-QUOTE-NUM.
136800     MOVE V2-BUYERCODE     TO VEN-BUYER-CODE.
136900     MOVE SAVE-TEXT-FLAG   TO VEN-TEXT-FLAG.
137000     MOVE V2-UM            TO VEN-NONCODED-UM.
137100     MOVE ZEROES           TO VEN-NONCODED-ITEM.
137200     MOVE V2-REQ           TO VEN-REQ.
137300     MOVE V2-BIDQTY-R      TO VEN-BID-QTY.
137400     MOVE V2-PRICEW-R      TO WORK-PRICE-W.
137500     MOVE V2-PRICED        TO WORK-PRICE-D.
137600     MOVE WORK-PRICE       TO VEN-ITM-PRICE.
137700     MOVE V2-UM            TO VEN-ITM-PRICE-UM.

      *-----  FORMAT SAVE-DATE FIELDS WITH CENTURY

           PERFORM 6000-FORMAT-SAVE-DATE THRU 6000-EXIT.
137800     MOVE SAVE-DATE1-CN    TO VEN-ITM-PRICE-DATE-CN.
137900     MOVE SAVE-DATE2-CN    TO VEN-CREATE-DATE-CN.
138000     MOVE SAVE-DATE3-CN    TO VEN-RETURN-DATE-CN.
138100     MOVE SAVE-DATE4-CN    TO VEN-ACTUAL-DATE-RETURNED-CN.
138200     MOVE V2-FB            TO VEN-FOB.
138300     MOVE V2-BILLING-TERMS  TO VEN-TERMS.
138400     MOVE V2-SHIPLOC       TO VEN-SPLC.
138500
138600     MOVE V2-LOW-QTY9-R (1)   TO VEN-LOW-QTY (1).
138700     MOVE V2-HIGH-QTY9-R (1)  TO VEN-HIGH-QTY (1).
138800     MOVE V2-BPRICE-UM (1) TO VEN-QTY-UM (1).
138900     MOVE V2-BPRICEW9-R  (1)  TO WORK-PRICE-W.
139000     MOVE V2-BPRICED9-R  (1)  TO WORK-PRICE-D.
139100     MOVE WORK-PRICE       TO VEN-WORK-PRICE (1).
139200
139300     MOVE V2-LOW-QTY9-R (2)   TO VEN-LOW-QTY (2).
139400     MOVE V2-HIGH-QTY9-R (2)  TO VEN-HIGH-QTY (2).
139500     MOVE V2-BPRICE-UM (2) TO VEN-QTY-UM (2).
139600     MOVE V2-BPRICEW9-R  (2)  TO WORK-PRICE-W.
139700     MOVE V2-BPRICED9-R  (2)  TO WORK-PRICE-D.
139800     MOVE WORK-PRICE       TO VEN-WORK-PRICE (2).
139900     MOVE V2-LOW-QTY9-R (3)   TO VEN-LOW-QTY (3).
140000     MOVE V2-HIGH-QTY9-R (3)  TO VEN-HIGH-QTY (3).
140100     MOVE V2-BPRICE-UM (3) TO VEN-QTY-UM (3).
140200     MOVE V2-BPRICEW9-R  (3)  TO WORK-PRICE-W.
140300     MOVE V2-BPRICED9-R  (3)  TO WORK-PRICE-D.
140400     MOVE WORK-PRICE       TO VEN-WORK-PRICE (3).
140500     MOVE V2-DISCOUNT-PCNT1 TO VEN-DSCT1.
140600     MOVE V2-DISCOUNT-PCNT2 TO VEN-DSCT2.
140700     MOVE V2-SURCHARGW-R TO WORK-PRICE-W.
140800     MOVE V2-SURCHARGD   TO WORK-PRICE-D.
140900     MOVE WORK-PRICE     TO VEN-SURCHARGE.
           MOVE V2-LEAD-R      TO VEN-EST-LT.
           MOVE V2-DISCOUNT    TO VEN-DISCOUNT.
           MOVE 0 TO COND-WORD.
           WRITE DVENDITM-REC2-O FROM BUF-DVENDITM.
142000
142100     ADD 1 TO WORK-NO-ITEMS.
142200     GO TO 630-ADD-ITEM.
142300 639-EXIT.  EXIT.

097900*---------  RETREIVE REQ DESCRIPTION AND QTY
098000 640-GET-REQ.
098100     MOVE V2-REQ TO REQ-ARG.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DREQITM-REC.
           START DREQITM KEY = REQNO OF DREQITM-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
098400     IF NO-ENTRY
098500        MOVE 18 TO LANG-SETNUM
098600        MOVE 05 TO LANG-MSGNUM
098700        MOVE 53 TO FIELD-NUMBER
098800        PERFORM 940-VSETERROR THRU 949-EXIT
098900        GO TO 649-EXIT.
099000
099100*---------  SEE IF ITEM ALREADY EXISTS ON THIS QUOTE
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DVENDITM-REC4.
           START DVENDITM4  KEY = REQNO  OF DVENDITM-REC4
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
099400     IF NOT GOOD-CALL
099500        GO TO 645-GET-DESC.

099600 642-EXISTS-LOOP.
           MOVE 0 TO COND-WORD.
           READ DVENDITM4  NEXT INTO BUF-DVENDITM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF QUOTENUM OF DVENDITM-REC4  NOT = REQ-ARG
               MOVE 15 TO COND-WORD.
099900     IF END-OF-CHAIN
100000        GO TO 645-GET-DESC
100100     ELSE
100200        IF NOT GOOD-CALL
100300           MOVE "DBGET DVENDITM 642 SQUOTUPD" TO BU-DISPLAY-MSG
100400           PERFORM 990-BLOWUP THRU 999-EXIT.
100500     IF VEN-QUOTE-NUM = QUOTE-ARG
100600*----- CODE ALREADY EXISTS ON THIS QUOTE
100700       MOVE 03 TO LANG-SETNUM
100800       MOVE 160 TO LANG-MSGNUM
100900       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
101000       MOVE 53 TO FIELD-NUMBER
101100       PERFORM 940-VSETERROR THRU 949-EXIT
101200       GO TO 649-EXIT.
101300
101400     GO TO 642-EXISTS-LOOP.
101500
101600 645-GET-DESC.
           MOVE 0 TO COND-WORD.
           READ DREQITM NEXT INTO BUF-DREQITM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF REQNO OF DREQITM-REC NOT = REQ-ARG
               MOVE 15 TO COND-WORD.
102000     IF NOT GOOD-CALL
102100        MOVE "DBGET DREQITM 645 SQUOTUPD" TO BU-DISPLAY-MSG
102200        PERFORM 990-BLOWUP THRU 999-EXIT.
102300     IF REQITM-CORP-CODE NOT = SPACES
102400        IF REQITM-CORP-CODE NOT = "NON-STR"
102500           MOVE REQITM-CORP-CODE TO V2-CORPCODE
102600           PERFORM 650-GET-CODE THRU 659-EXIT
102700           MOVE REQITM-QTY-TO-ORD TO V2-BIDQTY
102800           GO TO 649-EXIT.
102900
103000     MOVE SPACES TO V2-DESC-AREA.
103100     MOVE REQITM-UM TO V2-UM.
103200     MOVE REQ-ARG TO VEN-REQ.
103300     MOVE "NON-STR" TO V2-CORPCODE.
103400     PERFORM 810-GET-NONCODED-REQ THRU 819-EXIT.
103500     MOVE REQITM-QTY-TO-ORD TO V2-BIDQTY.
148200 649-EXIT.  EXIT.
148300
103800*----------  GET CODE DESCRIPTION FOR ADDING ITEMS
103900 650-GET-CODE.
104000     MOVE V2-CORPCODE TO CODE-ARG.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC.
           READ MSTORERM   INTO BUF-MSTORERM
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
104300     IF NOT GOOD-CALL
104400        MOVE 3 TO LANG-SETNUM
104500        MOVE 23 TO LANG-MSGNUM
104600        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
104700        MOVE 4 TO FIELD-NUMBER
104800        PERFORM 940-VSETERROR THRU 949-EXIT
104900        GO TO 659-EXIT.
105000
105100*---------  SEE IF ITEM ALREADY EXISTS ON THIS QUOTE
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DVENDITM-REC2.
           START DVENDITM2  KEY = CORPCDE OF DVENDITM-REC2
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
105400     IF NOT GOOD-CALL
105500        GO TO 655-GET-DESC.

105600 652-EXISTS-LOOP.
           MOVE 0 TO COND-WORD.
           READ DVENDITM2  NEXT INTO BUF-DVENDITM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF CORPCDE OF DVENDITM-REC2  NOT = CODE-ARG
               MOVE 15 TO COND-WORD.
105900     IF END-OF-CHAIN
106000        GO TO 655-GET-DESC
106100     ELSE
106200        IF NOT GOOD-CALL
106300           MOVE "DBGET DVENDITM 652 SQUOTUPD" TO BU-DISPLAY-MSG
106400           PERFORM 990-BLOWUP THRU 999-EXIT.
106500     IF VEN-QUOTE-NUM = QUOTE-ARG
106600*----- CODE ALREADY EXISTS ON THIS QUOTE
106700       MOVE 03 TO LANG-SETNUM
106800       MOVE 160 TO LANG-MSGNUM
106900       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
107000       MOVE 4 TO FIELD-NUMBER
107100       PERFORM 940-VSETERROR THRU 949-EXIT
107200       GO TO 659-EXIT.
107300
107400     GO TO 652-EXISTS-LOOP.
107500
107600 655-GET-DESC.
107700     MOVE SPACES TO CDESC-AREA
107800        CALL "CDESC" USING RET-CODE, BASE, STATUS-AREA,
107900                  BU-DISPLAY-MSG, CODE-ARG, CDESC-DATA
108000     MOVE CDESC (1) TO V2-DESC1
108100     MOVE CDESC (2) TO V2-DESC2
108200     MOVE CDESC (3) TO V2-DESC3.
108300     MOVE STR-UM TO V2-UM.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF USAGEFIL-REC.
           READ USAGEFIL
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
283600     IF COND-WORD NOT =  0
283700        MOVE "USAGEFILE ERR 655 SQUOTUPD" TO BU-DISPLAY-MSG
283800        MOVE CODE-ARG         TO BU-DISPLAY-FLD (5)
283900        PERFORM 990-BLOWUP THRU 999-EXIT.
109000
109100     MOVE 0                               TO YTD-TOTAL.
109200     MOVE 0                               TO SUB.

109300 656-CALCULATE-YTD-USAGE.
109400     ADD 1                                TO SUB.
109500     IF SUB NOT > 12
109600        ADD K-MTH-USAGE (SUB)             TO YTD-TOTAL
109700        GO TO 656-CALCULATE-YTD-USAGE.
109800
109900 659-EXIT.  EXIT.
110000
154800 660-UPDATE-DEFAULTS.
110200     MOVE SPACES                 TO SCREEN3-BUFFER.
110300     MOVE DEFAULT-SCREEN TO VIEW-NFNAME.
110800
110900     MOVE VEN-REAL-QUOTE     TO V3-QUOTE.
111000     MOVE VEN-TERMS          TO V3-BTERMS.
111100     MOVE VEN-FOB            TO V3-FB.
111200     MOVE VEN-EST-LT         TO V3-LEAD.
           IF V3-LEAD-X NOT NUMERIC
              MOVE "0000"          TO V3-LEAD.
111300     MOVE VEN-BUYER-CODE     TO V3-BUYC.
111310     MOVE VEN-SPLC           TO V3-SPLC.
111400     MOVE 4 TO DATE-MODE.
111500     IF VEN-ITM-PRICE-DATE = SPACES
111600        MOVE SPACES TO V3-EXPDATE
111700     ELSE
111800     MOVE VEN-ITM-PRICE-DATE TO DATE-VALIDATE-IN
111900     CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
112000     MOVE DATE-SLASH-OUT TO V3-EXPDATE.
112100
112200     IF VEN-CREATE-DATE = SPACES
112300        MOVE SPACES TO V3-EFFDATE
112400     ELSE
112500     MOVE VEN-CREATE-DATE TO DATE-VALIDATE-IN
112600     CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
112700     MOVE DATE-SLASH-OUT TO V3-EFFDATE.
112800
112900     IF VEN-RETURN-DATE  = SPACES
113000        MOVE SPACES TO V3-TO-RETURN
113100     ELSE
113200     MOVE VEN-RETURN-DATE TO DATE-VALIDATE-IN
113300     CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
113400     MOVE DATE-SLASH-OUT TO V3-TO-RETURN.
113500
113600     IF VEN-ACTUAL-DATE-RETURNED  = SPACES
113700        MOVE SPACES TO V3-RETURNED
113800     ELSE
113900     MOVE VEN-ACTUAL-DATE-RETURNED TO DATE-VALIDATE-IN
114000     CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
114100     MOVE DATE-SLASH-OUT TO V3-RETURNED.
114200
       665-SHOW-FORM.
           MOVE SCREEN3-BUFFER TO DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
              INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO SRF-INDICATORS.
           MOVE DISPLAY-REC TO SCREEN3-BUFFER.

      *------ A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *------ IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.
035800
035900     IF VIEW-LASTKEY EQUAL 3
036000        GO TO 669-EXIT.
036100
036200     IF VIEW-LASTKEY EQUAL 5 OR
              VIEW-LASTKEY EQUAL 4 OR
036700        VIEW-LASTKEY EQUAL 6
              MOVE 9 TO LANG-SETNUM
              MOVE 10 TO LANG-MSGNUM
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
036800        PERFORM 940-VSETERROR THRU 949-EXIT
036900        GO TO 665-SHOW-FORM.
116200
116300     MOVE VIEW-LASTKEY TO SAVE-VIEW-LASTKEY.
161400* F1=PROCESS/GO TO ITEMS; F2=PROCESS/GO TO OPTIONS;
161500* F8=GO TO ITEMS; F7=GO TO OPTIONS; F3=EXIT PROGRAM
161600      IF VIEW-LASTKEY = 3 OR 7 OR 8
161700        GO TO 669-EXIT.
162500
162600*----------  VALIDATE BUYER
162700     MOVE V3-BUYC     TO BUYER-ARG.
           MOVE 0 TO COND-WORD.
           MOVE BUYER-ARG TO BUYERCDE OF MBUYER-REC.
           START MBUYER KEY = BUYERCDE OF MBUYER-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
163000     IF NO-ENTRY
163100*       BUYER CODE DOES NOT EXIST
163200        MOVE 3 TO FIELD-NUMBER
163300        MOVE 04 TO LANG-MSGNUM
163400        MOVE 02 TO LANG-SETNUM
163500        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
163600        PERFORM 940-VSETERROR THRU 949-EXIT
163700        GO TO 665-SHOW-FORM.
163800     IF NOT GOOD-CALL
163900        MOVE "DBGET MBUYER 662 SQUOTUPD" TO BU-DISPLAY-MSG
164000        PERFORM 990-BLOWUP THRU 999-EXIT.
164200
164300     MOVE SPACES TO SAVE-DATE1, SAVE-DATE2,
164400                    SAVE-DATE3, SAVE-DATE4.
164500
164600     MOVE 3 TO DATE-MODE.
164700
164800     IF V3-EXPDATE NOT = SPACES
164900        MOVE V3-EXPDATE TO DATE-VALIDATE-IN
165000        CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
165100        IF DATE-RET-CODE NOT = 0
165200           MOVE DATE-MSG TO MESSAGE-BUFFER
165300           MOVE 12 TO FIELD-NUMBER
165400           PERFORM 940-VSETERROR THRU 949-EXIT
165500           GO TO 665-SHOW-FORM
165600        ELSE
165700           MOVE DATE-YMD-OUT TO SAVE-DATE1.
165800
165900     IF V3-EFFDATE NOT = SPACES
166000        MOVE V3-EFFDATE TO DATE-VALIDATE-IN
166100        CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
166200        IF DATE-RET-CODE NOT = 0
166300           MOVE DATE-MSG TO MESSAGE-BUFFER
166400           MOVE 13 TO FIELD-NUMBER
166500           PERFORM 940-VSETERROR THRU 949-EXIT
166600           GO TO 665-SHOW-FORM
166700        ELSE
166800           MOVE DATE-YMD-OUT TO SAVE-DATE2.
166900
167000     IF V3-TO-RETURN NOT = SPACES
167100        MOVE V3-TO-RETURN TO DATE-VALIDATE-IN
167200        CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
167300        IF DATE-RET-CODE NOT = 0
167400           MOVE DATE-MSG TO MESSAGE-BUFFER
167500           MOVE 14 TO FIELD-NUMBER
167600           PERFORM 940-VSETERROR THRU 949-EXIT
167700           GO TO 665-SHOW-FORM
167800        ELSE
167900           MOVE DATE-YMD-OUT TO SAVE-DATE3.
168000
168100     IF V3-RETURNED NOT = SPACES
168200        MOVE V3-RETURNED      TO DATE-VALIDATE-IN
168300        CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
168400        IF DATE-RET-CODE NOT = 0
168500           MOVE DATE-MSG TO MESSAGE-BUFFER
168600           MOVE 15 TO FIELD-NUMBER
168700           PERFORM 940-VSETERROR THRU 949-EXIT
168800           GO TO 665-SHOW-FORM
168900        ELSE
169000           MOVE DATE-YMD-OUT TO SAVE-DATE4.
169100*----------  EDIT FOB
169200     IF V3-FB NOT = SPACES
169300     MOVE "FB"             TO MISC-ARG1
169400     MOVE V3-FB            TO MISC-ARG2
           MOVE 0 TO COND-WORD.
           MOVE MISC-ARG TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
169700     IF COND-WORD NOT = 0
169800*----   FOB IS NOT VALID
169900        MOVE 6 TO LANG-SETNUM
170000        MOVE 21 TO LANG-MSGNUM
170100        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
170200        MOVE  4 TO FIELD-NUMBER
170300        PERFORM 940-VSETERROR THRU 949-EXIT
170400        GO TO 665-SHOW-FORM.
170500
170600*----------  EDIT TERMS
170700     IF V3-BTERMS NOT = SPACES
170800     MOVE "TMP"            TO MISC-ARG1B
170900     MOVE V3-TM1           TO MISC-ARG2B
           MOVE 0 TO COND-WORD.
           MOVE MISC-ARG TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
171200     IF COND-WORD NOT = 0
171300*----------  TERMS ARE NOT VALID
171400        MOVE 9 TO LANG-SETNUM
171500        MOVE 6 TO LANG-MSGNUM
171600        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
171700        MOVE  2 TO FIELD-NUMBER
171800        PERFORM 940-VSETERROR THRU 949-EXIT
171900        GO TO 665-SHOW-FORM.
172000
172100     IF V3-BTERMS NOT = SPACES
172200     MOVE "TMD"            TO MISC-ARG1B
172300     MOVE V3-TM2           TO MISC-ARG2B
           MOVE 0 TO COND-WORD.
           MOVE MISC-ARG TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
172600     IF COND-WORD NOT = 0
172700*----------  TERMS ARE NOT VALID
172800        MOVE 9 TO LANG-SETNUM
172900        MOVE 6 TO LANG-MSGNUM
173000        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
173100        MOVE  2 TO FIELD-NUMBER
173200        PERFORM 940-VSETERROR THRU 949-EXIT
173300        GO TO 665-SHOW-FORM.
173400
173500     IF VEN-TERMS = V3-BTERMS
173600      IF VEN-FOB = V3-FB
173700       IF VEN-EST-LT = V3-LEAD-9
173800        IF VEN-BUYER-CODE = V3-BUYC
173900         IF VEN-ITM-PRICE-DATE = SAVE-DATE1
174000          IF VEN-CREATE-DATE = SAVE-DATE2
174100           IF VEN-ACTUAL-DATE-RETURNED = SAVE-DATE4
174200            IF VEN-RETURN-DATE = SAVE-DATE3
174300                IF VEN-SPLC = V3-SPLC
174400                   GO TO 669-EXIT.
174500
174600*----------  YES A CHANGE WAS MADE.  IF BUYER CODE IS CHANGED,
174700*            THE UPDATE PROGRAM WILL HAVE TO DELETE AND ADD THE
174800*            ENTRY; OTHERWISE JUST UPDATE ENTRY
174900     IF VEN-BUYER-CODE = V3-BUYC
175000        MOVE 0 TO UPDATE-MODE
175100     ELSE
175200        MOVE 1 TO UPDATE-MODE.
175300
175400     MOVE  14                             TO LANG-SETNUM
175500     MOVE   2                             TO LANG-MSGNUM
175600     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
175700     PERFORM 940-VSETERROR THRU 949-EXIT.
176400
176500*----------  PREPARE JOB STREAM THAT WILL UPDATE QUOTE DEFAULTS
           MOVE SPACES TO CSTRMJB2-PARMS.
           MOVE "CALL TQTUPD2"                  TO CSTRM-RUN-CARD(1).
           MOVE SQTUPD2-PARMS                   TO CSTRM-RUN-CARD(2).
176900     MOVE SCREEN3-AREA1                   TO CSTRM-RUN-CARD(3).
           MOVE "Y"   TO CSTRM-JOBCARD-FLAG.
           MOVE "BQTUPD2" TO CSTRM-JOBNAME.
           CALL "CSTRMJB2" USING CSTRMJB2-PARMS, VIEW-COMAREA.
           IF CSTRM-RET-CODE NOT = "00"
              MOVE CSTRM-RET-CODE TO BU-DISPLAY-FLD9 (1)
              MOVE "STREAM COMMAND FAILED SQUOTUPD" TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.
178400 669-EXIT.  EXIT.

178500*************************************************************
178600*  UPDATE NONCODED DESCRIPTION BY DELETING OLD AND ADDING   *
178700*************************************************************
178800 700-NONCODED-DESC.
178900     MOVE 1 TO CTR.
           MOVE 0 TO LASTREC-READ.
179000     MOVE SPACES TO V4-DESC-AREA.
179100     MOVE QUOTE-ARG-NUM TO V4-QUOTE.
179200     MOVE VIEW-ITEM TO V4-ITEM.
179310     MOVE 1 TO LOOP-X.
179330
      *-----  START BOTH THE INPUT AND OUTPUT FILES
           MOVE 0 TO COND-WORD.
           MOVE QUOTE-ARG TO QUOTENUM OF DQUOTEXT-REC.
           START DQUOTEXT KEY = QUOTENUM OF DQUOTEXT-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
179360     IF NOT GOOD-CALL
179400        MOVE "DBFIND DQUOTEXT 700 SQUOTUPD" TO BU-DISPLAY-MSG
179500        PERFORM 990-BLOWUP THRU 999-EXIT.
      *-----  OUTPUT FILE
           MOVE 0 TO COND-WORD.
           MOVE QUOTE-ARG TO QUOTENUM OF DQUOTEXT-REC-O.
           START DQUOTEXT-O KEY = QUOTENUM OF DQUOTEXT-REC-O
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
179360     IF NOT GOOD-CALL
179400        MOVE "DBFIND DQUOTEXT2 700 SQUOTUPD" TO BU-DISPLAY-MSG
179500        PERFORM 990-BLOWUP THRU 999-EXIT.
179600
179700 705-READ-LOOP.
      *-----  READ INPUT FILE
           MOVE 0 TO COND-WORD.
           READ DQUOTEXT NEXT INTO BUF-DQUOTEXT
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF QUOTENUM OF DQUOTEXT-REC NOT = QUOTE-ARG
               MOVE 15 TO COND-WORD.
180000     IF END-OF-CHAIN
180100        IF CTR = 1
180200           GO TO 799-EXIT
180300        ELSE
180400           GO TO 710-DISPLAY.
180500     IF NOT GOOD-CALL
180600        MOVE "DBGET DQUOTEXT SQUOTUPD 705" TO BU-DISPLAY-MSG
180700        PERFORM 990-BLOWUP THRU 999-EXIT.
180800     IF DQUOTEXT-ITM-NO NOT = VIEW-ITEM
180900        GO TO 705-READ-LOOP.
181000     MOVE DQUOTEXT-DATA TO V4-DESC (CTR).
           MOVE 1 TO LASTREC-READ.
181200     ADD 1 TO CTR.
181300     IF CTR = 16
181500        GO TO 710-DISPLAY.
181600     GO TO 705-READ-LOOP.
181700
181800 710-DISPLAY.
181900     MOVE MODIFY-DESC-NC TO VIEW-NFNAME.
           MOVE SCREEN4-BUFFER TO DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
              INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO SRF-INDICATORS.
           MOVE DISPLAY-REC TO SCREEN4-BUFFER.

      *------ A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *------ IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.
035800
035900     IF VIEW-LASTKEY EQUAL 3
036000        GO TO 799-EXIT.
036100
036200     IF VIEW-LASTKEY EQUAL 1 OR
036300        VIEW-LASTKEY EQUAL 2 OR
036400        VIEW-LASTKEY EQUAL 8 OR
036500        VIEW-LASTKEY EQUAL 4 OR
036600        VIEW-LASTKEY EQUAL 7 OR
036700        VIEW-LASTKEY EQUAL 6
              MOVE 9 TO LANG-SETNUM
              MOVE 10 TO LANG-MSGNUM
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
036800        PERFORM 940-VSETERROR THRU 949-EXIT
036900        GO TO 710-DISPLAY.
184170
184200     MOVE 1 TO LOOP-X.
           MOVE 0 TO COND-WORD.
184300     PERFORM 750-UPDATE-REC THRU 759-EXIT 15 TIMES.
184400     MOVE 1 TO LOOP-X.
184600     MOVE SPACES TO V4-DESC-AREA.
184700     MOVE 1 TO CTR.
184800     GO TO 705-READ-LOOP.
184900
185000*----------  UPDATE OLD DESCRIPTION LINES
       750-UPDATE-REC.
           IF END-OF-CHAIN
              GO TO 751-ADD.
           MOVE ZEROES TO COND-WORD.
           READ DQUOTEXT-O NEXT INTO BUF-DQUOTEXT
                AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS = "10" OR "14" OR "46"
                 MOVE 15 TO COND-WORD
              ELSE
                 MOVE 99 TO COND-WORD.
           IF QUOTENUM OF DQUOTEXT-REC-O NOT = QUOTE-ARG
              REWRITE DQUOTEXT-REC-O FROM BUF-DQUOTEXT
              MOVE 15 TO COND-WORD.
           IF END-OF-CHAIN
              GO TO 751-ADD.

           IF V4-DESC (LOOP-X) = DQUOTEXT-DATA
              GO TO 754-UPDATE
           ELSE
              IF V4-DESC (LOOP-X) = SPACES
                 GO TO 752-DELETE
              ELSE
                 GO TO 754-UPDATE.
       751-ADD.
185700*------  CHECK IF A NEW LINE SHOULD BE ADDED AT THE END
           IF V4-DESC (LOOP-X) = SPACES
              ADD 1 TO LOOP-X
              GO TO 759-EXIT.
           MOVE V4-ITEM          TO DQUOTEXT-ITM-NO.
           MOVE QUOTE-ARG        TO DQUOTEXT-QUOTE-NO.
185900     MOVE V4-DESC (LOOP-X) TO DQUOTEXT-DATA.
186000     ADD 1 TO LAST-LINE-NO.
186020     MOVE LAST-LINE-NO TO DQUOTEXT-LINE-NO.
           MOVE 0 TO COND-WORD.
186100     WRITE DQUOTEXT-REC-O FROM BUF-DQUOTEXT.
186200     IF FILE-STATUS NOT = "00"
186300        MOVE 99 TO COND-WORD.
186400     IF NOT GOOD-CALL
186500        MOVE "DBPUT DQUOTEXT 750 SQUOTUPD" TO BU-DISPLAY-MSG
186600        PERFORM 990-BLOWUP THRU 999-EXIT.

           MOVE 15 TO COND-WORD.
           ADD 1 TO LOOP-X.
           GO TO 759-EXIT.
187100
187200*-----  DELETE RECORD THAT WAS SPACED OUT.
       752-DELETE.
           MOVE ZEROES TO COND-WORD.
           DELETE DQUOTEXT-O.
           IF FILE-STATUS NOT = "00"
              MOVE 99 TO COND-WORD.
187700     IF NOT GOOD-CALL
187800        MOVE "DELETE1 DQUOTEXT 752 SQUOTUPD" TO BU-DISPLAY-MSG
187900        PERFORM 990-BLOWUP THRU 999-EXIT.
188800     ADD 1 TO LOOP-X
188900     GO TO 759-EXIT.

189100*----- JUST PLAIN UPDATE RECORD
189000 754-UPDATE.
           MOVE 0 TO COND-WORD.
           MOVE V4-DESC (LOOP-X) TO DQUOTEXT-DATA.
           REWRITE DQUOTEXT-REC-O FROM BUF-DQUOTEXT.
           IF FILE-STATUS NOT = "00"
              MOVE 99 TO COND-WORD.
189400     IF NOT GOOD-CALL
189500        MOVE "REWRITE DQUOTEXT 754 SQUOTUPD" TO BU-DISPLAY-MSG
189600        PERFORM 990-BLOWUP THRU 999-EXIT.

190610     MOVE DQUOTEXT-LINE-NO TO LAST-LINE-NO.
190700     ADD 1 TO LOOP-X.
190800
190900 759-EXIT.  EXIT.
192760 799-EXIT.  EXIT.
192800*******************************************************************
192900**           P E R F O R M E D     R O U T I N E S               **
193000*******************************************************************
193100 800-GET-NONCODED-DESC.
193200     MOVE 1 TO X.
           MOVE 0 TO COND-WORD.
           MOVE QUOTE-ARG TO QUOTENUM OF DQUOTEXT-REC.
           START DQUOTEXT KEY = QUOTENUM OF DQUOTEXT-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
117700     IF NOT GOOD-CALL
117800        GO TO 809-EXIT.
118000
118100 805-NC-DESC.
           MOVE 0 TO COND-WORD.
           READ DQUOTEXT NEXT INTO BUF-DQUOTEXT
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF QUOTENUM OF DQUOTEXT-REC NOT = QUOTE-ARG
               MOVE 15 TO COND-WORD.
118400     IF END-OF-CHAIN
118500        GO TO 809-EXIT.
118600     IF NOT GOOD-CALL
118700        GO TO 809-EXIT.
118900
119000     IF DQUOTEXT-ITM-NO NOT = VEN-NONCODED-ITEM
119100        GO TO 805-NC-DESC.
119200     MOVE DQUOTEXT-DATA TO V2-DESC (X).
119300     ADD 1 TO X.
119400     IF X < 4
119500        GO TO 805-NC-DESC.
195400 809-EXIT.  EXIT.
195500
195600*************************************************************
195700*      RETRIEVE NONCODED REQUISTION ITEM DESCRIPTION        *
195800*************************************************************
195900 810-GET-NONCODED-REQ.
196000     MOVE 1 TO X.
196100     MOVE VEN-REQ TO REQ-ARG.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DREQDESC-REC.
           START DREQDESC KEY = REQNO OF DREQDESC-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
120700     IF NOT GOOD-CALL
120800        GO TO 819-EXIT.
121000
121100 815-NC-REQ.
           MOVE 0 TO COND-WORD.
           READ DREQDESC NEXT INTO BUF-DREQDESC
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF REQNO OF DREQDESC-REC NOT = REQ-ARG
               MOVE 15 TO COND-WORD.
121400     IF END-OF-CHAIN
121500        GO TO 819-EXIT.
121600     IF NOT GOOD-CALL
121700        GO TO 819-EXIT.
121900
122000     IF REQDESC-LINE-NO = "95" OR "96"
122100        GO TO 815-NC-REQ.
122200
122300     MOVE REQDESC-DATA TO V2-DESC (X).
122400     ADD 1 TO X.
122500     IF X < 4
122600        GO TO 815-NC-REQ.
198400 819-EXIT.  EXIT.
198600
198700 830-GET-CC-DESC.
198800     MOVE VEN-CC TO UM-ARG.
           MOVE 0 TO COND-WORD.
           MOVE UM-ARG TO VALIDUM OF MVALIDUM-REC.
           READ MVALIDUM   INTO BUF-MVALIDUM
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
126200     IF COND-WORD NOT = 0
126300        MOVE SPACES TO V2-CURR
126400     ELSE
126500        MOVE VALID-CURRENCY-DESC TO V2-CURR.
199500 839-EXIT.  EXIT.

       840-GET-MSTORERM.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC.
           READ MSTORERM   INTO BUF-MSTORERM
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF NOT GOOD-CALL
              MOVE SPACES TO STR-UM.
       849-EXIT.  EXIT.

       850-BACK-QUOTE.
           MOVE 0 TO COND-WORD, NO-NEXT.
           READ DVENDITM3 PRIOR RECORD INTO BUF-DVENDITM
               AT END MOVE 14 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "1"
                   MOVE 14 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF QUOTENUM OF DVENDITM-REC3 NOT = QUOTE-ARG
               MOVE 14 TO COND-WORD
           ELSE
               ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA
               MOVE IO-REL-NO TO RELATIVE-KEY.

      *-----  IF READ TOOK POINTER BEYOND BEGINNING OF FILE
      *-----  DO READ FIRST TO BRING POINTER BACK.

           IF FILE-STATUS-1 = "1"
              READ DVENDITM3 FIRST RECORD INTO BUF-DVENDITM
                AT END MOVE FILE-STATUS TO FILE-STATUS
              END-READ
              IF FILE-STATUS NOT = "00" AND "10"
                 MOVE 99 TO COND-WORD
              END-IF
           ELSE

      *-----  POINTER IS TOO FAR, BRING IT BACK

              IF COND-WORD = 14
                 READ DVENDITM3 NEXT RECORD INTO BUF-DVENDITM
                   AT END MOVE FILE-STATUS TO FILE-STATUS.

       851-BACK-VENDOR.
           MOVE 0 TO COND-WORD, NO-NEXT.
           READ DVENDITM PRIOR RECORD INTO BUF-DVENDITM
               AT END MOVE 14 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "1"
                   MOVE 14 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF VENCDE OF DVENDITM-REC NOT = VENDOR-ARG
               MOVE 14 TO COND-WORD
           ELSE
               ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA
               MOVE IO-REL-NO TO RELATIVE-KEY.

      *-----  IF READ TOOK POINTER BEYOND BEGINNING OF FILE
      *-----  DO READ FIRST TO BRING POINTER BACK.

           IF FILE-STATUS-1 = "1"
              READ DVENDITM FIRST RECORD INTO BUF-DVENDITM
                AT END MOVE FILE-STATUS TO FILE-STATUS
              END-READ
              IF FILE-STATUS NOT = "00" AND "10"
                 MOVE 99 TO COND-WORD
              END-IF
           ELSE

      *-----  POINTER IS TOO FAR, BRING IT BACK

              IF COND-WORD = 14
                 READ DVENDITM NEXT RECORD INTO BUF-DVENDITM
                   AT END MOVE FILE-STATUS TO FILE-STATUS.

       852-BACK-CORPCODE.
           MOVE 0 TO COND-WORD, NO-NEXT.
           READ DVENDITM2 PRIOR RECORD INTO BUF-DVENDITM
               AT END MOVE 14 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "1"
                   MOVE 14 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF CORPCDE OF DVENDITM-REC2 NOT = CODE-ARG
               MOVE 14 TO COND-WORD
           ELSE
               ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA
               MOVE IO-REL-NO TO RELATIVE-KEY.

      *-----  IF READ TOOK POINTER BEYOND BEGINNING OF FILE
      *-----  DO READ FIRST TO BRING POINTER BACK.

           IF FILE-STATUS-1 = "1"
              READ DVENDITM2 FIRST RECORD INTO BUF-DVENDITM
                AT END MOVE FILE-STATUS TO FILE-STATUS
              END-READ
              IF FILE-STATUS NOT = "00" AND "10"
                 MOVE 99 TO COND-WORD
              END-IF
           ELSE

      *-----  POINTER IS TOO FAR, BRING IT BACK

              IF COND-WORD = 14
                 READ DVENDITM2 NEXT RECORD INTO BUF-DVENDITM
                   AT END MOVE FILE-STATUS TO FILE-STATUS.

       853-BACK-REQ.
           MOVE 0 TO COND-WORD, NO-NEXT.
           READ DVENDITM4 PRIOR RECORD INTO BUF-DVENDITM
               AT END MOVE 14 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "1"
                   MOVE 14 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF REQNO OF DVENDITM-REC4 NOT = REQ-ARG
               MOVE 14 TO COND-WORD
           ELSE
               ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA
               MOVE IO-REL-NO TO RELATIVE-KEY.

      *-----  IF READ TOOK POINTER BEYOND BEGINNING OF FILE
      *-----  DO READ FIRST TO BRING POINTER BACK.

           IF FILE-STATUS-1 = "1"
              READ DVENDITM4 FIRST RECORD INTO BUF-DVENDITM
                AT END MOVE FILE-STATUS TO FILE-STATUS
              END-READ
              IF FILE-STATUS NOT = "00" AND "10"
                 MOVE 99 TO COND-WORD
              END-IF
           ELSE

      *-----  POINTER IS TOO FAR, BRING IT BACK

              IF COND-WORD = 14
                 READ DVENDITM4 NEXT RECORD INTO BUF-DVENDITM
                   AT END MOVE FILE-STATUS TO FILE-STATUS.

       854-FORWARD-QUOTE.
           MOVE 0 TO COND-WORD, NO-PREV.
           READ DVENDITM3 NEXT INTO BUF-DVENDITM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF QUOTENUM OF DVENDITM-REC3  NOT = QUOTE-ARG
               MOVE 15 TO COND-WORD
           ELSE
               ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA
               MOVE IO-REL-NO TO RELATIVE-KEY.

      *-----  IF READ TOOK POINTER BEYOND END OF FILE
      *-----  DO READ LAST TO BRING POINTER BACK.

           IF FILE-STATUS = "10" OR "14" OR "46"
              READ DVENDITM3 LAST RECORD INTO BUF-DVENDITM
                AT END MOVE FILE-STATUS TO FILE-STATUS
              END-READ
              IF FILE-STATUS NOT = "00" AND "10"
                 MOVE 99 TO COND-WORD
              END-IF
           ELSE

      *-----  POINTER IS TOO FAR, BRING IT BACK

              IF COND-WORD = 15
                 READ DVENDITM3 PRIOR RECORD INTO BUF-DVENDITM
                   AT END MOVE FILE-STATUS TO FILE-STATUS.

       855-FORWARD-VENDOR.
           MOVE 0 TO COND-WORD, NO-PREV.
           READ DVENDITM NEXT INTO BUF-DVENDITM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF VENCDE OF DVENDITM-REC  NOT = VENDOR-ARG
               MOVE 15 TO COND-WORD
           ELSE
               ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA
               MOVE IO-REL-NO TO RELATIVE-KEY.

      *-----  IF READ TOOK POINTER BEYOND END OF FILE
      *-----  DO READ LAST TO BRING POINTER BACK.

           IF FILE-STATUS = "10" OR "14" OR "46"
              READ DVENDITM LAST RECORD INTO BUF-DVENDITM
                AT END MOVE FILE-STATUS TO FILE-STATUS
              END-READ
              IF FILE-STATUS NOT = "00" AND "10"
                 MOVE 99 TO COND-WORD
              END-IF
           ELSE

      *-----  POINTER IS TOO FAR, BRING IT BACK

              IF COND-WORD = 15
                 READ DVENDITM  PRIOR RECORD INTO BUF-DVENDITM
                   AT END MOVE FILE-STATUS TO FILE-STATUS.

       856-FORWARD-CORPCODE.
           MOVE 0 TO COND-WORD, NO-PREV.
           READ DVENDITM2 NEXT INTO BUF-DVENDITM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF CORPCDE OF DVENDITM-REC2  NOT = CODE-ARG
               MOVE 15 TO COND-WORD
           ELSE
               ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA
               MOVE IO-REL-NO TO RELATIVE-KEY.

      *-----  IF READ TOOK POINTER BEYOND END OF FILE
      *-----  DO READ LAST TO BRING POINTER BACK.

           IF FILE-STATUS = "10" OR "14" OR "46"
              READ DVENDITM2 LAST RECORD INTO BUF-DVENDITM
                AT END MOVE FILE-STATUS TO FILE-STATUS
              END-READ
              IF FILE-STATUS NOT = "00" AND "10"
                 MOVE 99 TO COND-WORD
              END-IF
           ELSE

      *-----  POINTER IS TOO FAR, BRING IT BACK

              IF COND-WORD = 15
                 READ DVENDITM2 PRIOR RECORD INTO BUF-DVENDITM
                   AT END MOVE FILE-STATUS TO FILE-STATUS.

       857-FORWARD-REQ.
           MOVE 0 TO COND-WORD, NO-PREV.
           READ DVENDITM4 NEXT INTO BUF-DVENDITM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF REQNO OF DVENDITM-REC4  NOT = REQ-ARG
               MOVE 15 TO COND-WORD
           ELSE
               ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA
               MOVE IO-REL-NO TO RELATIVE-KEY.

      *-----  IF READ TOOK POINTER BEYOND END OF FILE
      *-----  DO READ LAST TO BRING POINTER BACK.

           IF FILE-STATUS = "10" OR "14" OR "46"
              READ DVENDITM4 LAST RECORD INTO BUF-DVENDITM
                AT END MOVE FILE-STATUS TO FILE-STATUS
              END-READ
              IF FILE-STATUS NOT = "00" AND "10"
                 MOVE 99 TO COND-WORD
              END-IF
           ELSE

      *-----  POINTER IS TOO FAR, BRING IT BACK

              IF COND-WORD = 15
                 READ DVENDITM4 PRIOR RECORD INTO BUF-DVENDITM
                   AT END MOVE FILE-STATUS TO FILE-STATUS.

128700 940-VSETERROR.
           MOVE B"1" TO IND (99).
           MOVE B"1" TO IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE1
                                  DE-MESSAGE-LINE2
                                  DE-MESSAGE-LINE3.
051300
048600 949-EXIT.  EXIT.
204300 990-BLOWUP.
204400     MOVE QUOTE-ARG       TO BU-DISPLAY-FLD (1).
204500     MOVE CODE-ARG        TO BU-DISPLAY-FLD (2).
204600     MOVE VIEW-NFNAME     TO BU-DISPLAY-FLD (3).
204700     MOVE V2-CORPCODE     TO BU-DISPLAY-FLD (4).
204800     MOVE V2-VENCODE      TO BU-DISPLAY-FLD (5).
204900     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
205000                   VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
205100                   BU-DISPLAY-FLDS.
205200 999-EXIT.     EXIT.
205300
205400 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
207000 999-CATREAD-EXIT.
207100     EXIT.
