       IDENTIFICATION DIVISION.
       PROGRAM-ID.      SRCVDESC.
       AUTHOR.          CA YODER.
       DATE-WRITTEN.    APRIL 2002.
       DATE-COMPILED.
      *************************************************************
      *                                                           *
      *    THIS SUBROUTINE DISPLAYS THE FULL DESCRIPTION FOR A    *
      *    RECEIVING SLIP ITEM.                                   *
      *************************************************************
      *C  CHANGES:
      *C

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.    IBM-AS400.
       OBJECT-COMPUTER.    IBM-AS400.
       SPECIAL-NAMES.  I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN        TO WORKSTATION-ZINQRS-SI
               ORGANIZATION  IS TRANSACTION
               ACCESS        IS DYNAMIC
               RELATIVE KEY  IS REC-COUNT
               FILE STATUS   IS DISPLAY-STATUS
               CONTROL-AREA  IS WS-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC          PIC X(2000).

      *************************************************************
      *                    WORKING STORAGE                        *
      *************************************************************
       WORKING-STORAGE SECTION.
       77  SUB                    PIC 9   VALUE 0.
       77  PRINT-DCOMPL-SW        PIC X   VALUE "N".

       01  FILE-STATUS.
           05  FILE-STATUS-1      PIC X.
           05  FILE-STATUS-2      PIC X.
       01  REC-COUNT              PIC 9(9).

      *------ WS CONTROL AREA
       01  MAJOR-MINOR                 PIC XXXX.
       01  WS-CONTROL.
           02  FUNCTION-NUM            PIC XX.
                   88  EXIT-KEY-F8-USED                     VALUE "08". LVW000LS
                   88  REFRESH-KEY-F4-USED                  VALUE "04". LVW000LS
                   88  ENTER-KEY-USED                       VALUE "00". LVW000LS
                   88  F1-KEY-USED                          VALUE "01". LVW000LS
                   88  F2-KEY-USED                          VALUE "02". LVW000LS
                   88  F3-KEY-USED                          VALUE "03". LVW000LS
                   88  F4-KEY-USED                          VALUE "04". LVW000LS
                   88  F5-KEY-USED                          VALUE "05". LVW000LS
                   88  F6-KEY-USED                          VALUE "06". LVW000LS
                   88  F7-KEY-USED                          VALUE "07". LVW000LS
                   88  F8-KEY-USED                          VALUE "08". LVW000LS
           02 FUN-KEY REDEFINES FUNCTION-NUM PIC XX.
           02 TERMINAL-ID PIC X(10).
           02 FORMAT-NAME PIC X(10).

       01  DISPLAY-STATUS              PIC X(2).

       01  SRF-INDICATORS.
           05  IND OCCURS 99 TIMES   PIC 1 INDICATOR 01.

       01  OFF-SWITCH               PIC 1  VALUE B"0".
       01  ON-SWITCH                PIC 1  VALUE B"1".

       COPY IOFEEDBACK OF COPYLIB.
006300
006400*----------  SUBSCRIPT FOR DESCRIPTION SUBROUTINE TABLE
006500 01  X                   PIC 9(2)        VALUE ZEROES.
006600
006700 01  PREV-RECORDS        PIC 9            VALUE 0.
006800     88  NO-PREV                          VALUE 1.
006900
007000 01  MORE-RECORDS        PIC 9            VALUE 0.
007100     88  NO-MORE                          VALUE 1.


      *************************************************************
      *                 CALLED ROUTINES                           *
      *************************************************************

       COPY TBLOWUP OF COPYLIB.
       COPY CDESC  OF COPYLIB.
       COPY CNDESC OF COPYLIB.

       01  CCRQDESC-PARMS.
           05  CCRQDESC-CODE          PIC X(7).
           05  CCRQDESC-LINES.
               10  CCRQDESC-LINE  OCCURS 10 TIMES
                                      PIC X(80).

       COPY CCHKOBJ OF COPYLIB.

      *************************************************************
      **               V I E W   W O R K   A R E A               **
      *************************************************************

       01  SCREEN-BUFFER.
           05  SC-PO                     PIC X(7)  VALUE SPACES.
           05  SC-RLSE                   PIC X(3)  VALUE SPACES.
           05  SC-ITEM                   PIC X(4)  VALUE ZEROES.
           05  SC-CODE                   PIC X(7).

       01  SCREEN-BUFFER-2.
           05  DE-COMMAND-LINE           PIC X(79).
           05  DE-MESSAGE-LINE           PIC X(79).

       01  SC-LINE-BUF                   PIC X(79).

      *************************************************************
      **  D A T A B A S E   C O M M U N I C A T I O N   A R E A  **
      *************************************************************
       COPY DBSTAT  OF COPYLIB.
       COPY DBMODES OF COPYLIB.
       01  ARGUMENT-VALUES.
           05  CODE-ARG        PIC X(8).
           05  PO-ARG.
               10  PO-P        PIC X.
               10  PO-PO       PIC X(7).
               10  PO-RLSE     PIC X(3).
               10  PO-RS       PIC X(3).

       01  BASE                      PIC X(10).

       LINKAGE SECTION.
       01  PASSED-PARMS.
           05  PASS-PO                PIC X(14).
           05  PASS-ITEM              PIC X(4).
           05  PASS-CORP-CODE         PIC X(7).

       COPY VCOMLINK OF COPYLIB.

       PROCEDURE DIVISION USING  PASSED-PARMS
                                 VIEW-COMAREA.

       6-MAIN.
           PERFORM 1-HSK.
           PERFORM 60-DISPLAY-DESCRIPTION.
           PERFORM 2-EOJ.
           GOBACK.

       1-HSK.
           OPEN I-O DISPLAY-FILE.
           MOVE "MCFPCS7000"   TO  CHKOBJ-FILE-NAME.
           CALL "CCHKOBJ" USING    CHKOBJ-FILE-NAME,
                                   CHKOBJ-RETURN-STATUS.
           IF CHKOBJ-RETURN-STATUS  = "00"
               MOVE "Y"        TO  PRINT-DCOMPL-SW
           ELSE
               MOVE "N"        TO  PRINT-DCOMPL-SW.
           MOVE PASS-CORP-CODE TO  CODE-ARG.
           MOVE PASS-PO        TO  PO-ARG.

       2-EOJ.
           CLOSE DISPLAY-FILE.

       60-DISPLAY-DESCRIPTION.
           MOVE PO-PO            TO  SC-PO.
           MOVE PO-RLSE          TO  SC-RLSE.
           MOVE PASS-ITEM        TO  SC-ITEM.
           MOVE PASS-CORP-CODE   TO  SC-CODE.

      *---- SHOW SFLCTL (71) AND CLEAR SFL (72), BUT DON'T SHOW IT (70).

           MOVE ON-SWITCH    TO IND (71)  IND (72).
           MOVE OFF-SWITCH   TO IND (70).

           WRITE SUBFILE DISPLAY-REC FROM SCREEN-BUFFER
               FORMAT IS "RSDSFLC"
               INDICATORS ARE SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "PROBLEM ON INIT SFL WRITE" TO BU-DISPLAY-MSG
               PERFORM 990-BLOWUP.
      *-------- TURN CLEAR SFL OFF.
           MOVE OFF-SWITCH TO IND (72).

           INITIALIZE REC-COUNT.
           MOVE 1                        TO  X.
           IF  PASS-CORP-CODE = "NON-STR"
               MOVE 0                    TO  CNDESC-LINES-GOT
               MOVE SPACES               TO  CNDESC-LINE
               CALL "CNDESC" USING BASE, PASS-PO, PASS-ITEM,
                 CNDESC-DATA
               PERFORM 62-MOVE-NONCODED-DESC CNDESC-LINES-GOT TIMES
           ELSE
               MOVE SPACES               TO  CDESC-DATA
               MOVE "P"                  TO  CDESC-LANGUAGE-OPTION
               MOVE "F"                  TO  CDESC-DESC-OPTION
               MOVE "S"                  TO  CDESC-MANUFACT-OPTION
               MOVE "R"                  TO  CDESC-LOCAL-DESC-OPTION
               CALL "CDESC" USING CDESC-RET-CODE, BASE, STATUS-AREA,
                           BU-DISPLAY-MSG, CODE-ARG, CDESC-DATA
               PERFORM 61-MOVE-CODED-DESC CDESC-LINES-GOT TIMES
      *--------------- GET PO DESCRIPTION.
               MOVE 1                    TO  X
               MOVE 0                    TO  CNDESC-LINES-GOT
               MOVE SPACES               TO  CNDESC-LINE
               CALL "CNDESC" USING BASE, PASS-PO, PASS-ITEM,
                                     CNDESC-DATA
               PERFORM 62-MOVE-NONCODED-DESC CNDESC-LINES-GOT TIMES
               IF PRINT-DCOMPL-SW = "Y"
                   PERFORM 64-WRITE-DCOMPL.

      *--- SHOW FUNCTION KEYS.
           WRITE DISPLAY-REC
               FORMAT IS "RSDREC"
               INDICATORS ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

           MOVE ON-SWITCH TO IND (70)  IND (71)  IND (73).

      *--- WRITE THE SUBFILE TO SCREEN.
           WRITE SUBFILE DISPLAY-REC FROM SCREEN-BUFFER
               FORMAT IS "RSDSFLC"
               INDICATORS ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "PROBLEM ON SHOW SFL WRITE" TO BU-DISPLAY-MSG
               MOVE REC-COUNT TO BU-DISPLAY-FLD (1)
               MOVE DISPLAY-STATUS TO BU-DISPLAY-FLD (2)
               PERFORM 990-BLOWUP.

           READ  DISPLAY-FILE FORMAT IS "RSDSFLC"
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO SRF-INDICATORS.

       61-MOVE-CODED-DESC.
           MOVE CDESC (X)                TO SC-LINE-BUF.
           PERFORM 63-WRITE-SUBFILE.
           ADD 1 TO X.

       62-MOVE-NONCODED-DESC.
           MOVE CNDESC (X)               TO SC-LINE-BUF.
           PERFORM 63-WRITE-SUBFILE.
           ADD 1 TO X.

       63-WRITE-SUBFILE.
           MOVE SC-LINE-BUF           TO DISPLAY-REC.
           ADD 1                      TO REC-COUNT.
           IF REC-COUNT > 9999
               MOVE "SUBFILE TOO SMALL-INCREASE ZINQRS"
                   TO BU-DISPLAY-MSG
               MOVE REC-COUNT TO BU-DISPLAY-FLD (1)
               PERFORM 990-BLOWUP.
           WRITE SUBFILE DISPLAY-REC
               FORMAT IS "RSDSFL"
               INDICATORS ARE SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "SUBFILE WRITE ERROR" TO BU-DISPLAY-MSG
               MOVE REC-COUNT        TO BU-DISPLAY-FLD (1)
               MOVE DISPLAY-STATUS   TO BU-DISPLAY-FLD (2)
               PERFORM 990-BLOWUP.

       64-WRITE-DCOMPL.
           IF PRINT-DCOMPL-SW = "Y"
               MOVE PASS-CORP-CODE TO  CCRQDESC-CODE
               MOVE SPACES         TO  CCRQDESC-LINES
               CALL "CCRQDESC" USING CCRQDESC-PARMS
               IF CCRQDESC-LINES > SPACES
                   PERFORM VARYING SUB FROM 1 BY 1
                           UNTIL CCRQDESC-LINE (SUB) = SPACES OR
                                                 SUB > 6
                       MOVE CCRQDESC-LINE (SUB)  TO  SC-LINE-BUF
                       PERFORM 63-WRITE-SUBFILE
                   END-PERFORM.

       990-BLOWUP.
           MOVE "SRCVDESC"      TO BU-PGM-NAME.
           MOVE "RSDSFLC"       TO BU-DISPLAY-FLD (1).
           MOVE PASS-PO         TO BU-DISPLAY-FLD (2).
           MOVE PASS-CORP-CODE  TO BU-DISPLAY-FLD (3)
           CALL "TBLOWUP" USING BASE BU-PGM-NAME
                 STATUS-AREA VIEW-COMAREA
                 FILE-STATUS BU-DISPLAY-MSG BU-DISPLAY-FLDS.

