       IDENTIFICATION DIVISION.
       PROGRAM-ID.             SRCVTRKR.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER COMPANY.

      *C
      *C  10/24/97   CA YODER
      *C    THE PROGRAM WAS NOT ACCEPTING THE ROUTE PARAMETERS, AND
      *C    SO THE JOB WAS TRYING TO EXECUTE THEM AS A COMMAND.
      *C    ADDED AN "ACCEPT" STATEMENT AND CHANGED THE PROGRAM TO
      *C    USE THE ROUTE DATA TO OVERRIDE TO THE CORRECT PRINTER FILE.
      *C
      *C  11/06/97   CA YODER
      *C    PROGRAM WAS NOT HANDLING THE BINARY EXPECT DATE FIELD IN
      *C    THE HISTORY DATABASE CORRECTLY.  FIXED THE PROBLEM.
      *C
      *C  06/22/98   CA YODER
      *C    WHEN SET-REPORTED-FLAG WAS BEING PERFORMED, IT WAS SETTING
      *C    RCVTRAK-ALREADY-REPORTED FLAG TO "X" IN ALL RECORDS THAT
      *C    DID NOT ALREADY HAVE AN "X" IN IT.  CHANGED THE LOGIC TO
      *C    ONLY SET THE FLAG IF IT'S THE AUTO REPORT AND IF THE
      *C    RCVTRAK-DLVR-DATE > SPACES.
      *C
      *C  10/26/00    CA YODER
      *C    ADDED PLACE FOR ISO DOCUMENT NUMBER IN HEADING ON REPORT.
      *C    THE DOCUMENT NUMBER IS LOCATED IN MPLTINFO, KEY=ISO.
      *C

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       SPECIAL-NAMES.          C01              IS NEW-PAGE
                               I-O-FEEDBACK     IS I-O-FEEDBACK-AREA
                               REQUESTOR        IS WORK-STATION
                               SYSTEM-CONSOLE   IS CONSOLE
                               LOCAL-DATA       IS LOCAL-DATA-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT RCVTRK-FILE
                  ASSIGN       TO DATABASE-MCFPCSRCVT
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE  IS RANDOM
                  RELATIVE KEY IS ARG-NO
                  FILE STATUS  IS FILE-STAT.

           SELECT RCV-TRACKING
                  ASSIGN       TO DATABASE-MCFLCS6402
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT RCV-TRACKING-HIST
                  ASSIGN       TO DATABASE-MCFLST6402
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT DVENDOR
                  ASSIGN       TO DATABASE-MCFLCS0701
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT DVENDORH
                  ASSIGN       TO DATABASE-MCFLST0201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT VENDOR-NAME
                  ASSIGN       TO DATABASE-MCFLCSVEND
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT VENDOR-ALTNAME
                  ASSIGN       TO DATABASE-MCFLCS5801
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT MPLTINFO-I
                  ASSIGN       TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT PRINT-FILE
                  ASSIGN       TO PRINTER-MCPRT.

           SELECT OUT-FILE
                  ASSIGN       TO DISK-TRCVTRK
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE  IS DYNAMIC
                  RELATIVE KEY IS ACT-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT SORT-FILE
                  ASSIGN       TO DISK-SORTFILE.

       DATA DIVISION.
       FILE SECTION.
       FD  RCVTRK-FILE
           RECORD CONTAINS     152 CHARACTERS
           LABEL RECORDS       ARE OMITTED
           DATA RECORD         IS RCVTRK-REC.
       01  RCVTRK-REC.
           COPY DDS-ALL-FORMATS OF MCFPCSRCVT.

       FD  RCV-TRACKING
           LABEL RECORDS       ARE STANDARD.
       01  RTRK-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS6402.

       FD  RCV-TRACKING-HIST
           LABEL RECORDS       ARE STANDARD.
       01  RTRK-HIST-REC.
           COPY DDS-ALL-FORMATS OF MCFLST6402.

       FD  DVENDOR
           LABEL RECORDS       ARE STANDARD.
       01  DVENDOR-REC.
           COPY DDS-MCRPCS0700 OF MCFLCS0701.

       FD  DVENDORH
           LABEL RECORDS       ARE STANDARD.
       01  DVENDORH-REC.
           COPY DDS-MCRPST0200 OF MCFLST0201.

       FD  VENDOR-NAME
           LABEL RECORDS       ARE STANDARD.
       01  VENDNAME-REC.
           COPY DDS-ALL-FORMATS OF MCFLCSVEND.

       FD  VENDOR-ALTNAME
           LABEL RECORDS       ARE STANDARD.
       01  VENDALT-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS5801.

       FD  MPLTINFO-I
           LABEL               RECORDS ARE STANDARD.
       01  MPLTINFO-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS0501.

       FD  PRINT-FILE RECORD   CONTAINS 80 CHARACTERS
           LABEL RECORDS       ARE OMITTED
           DATA RECORD         IS PRINT-REC.
       01  PRINT-REC           PIC X(80).

       FD  OUT-FILE RECORD     CONTAINS 174 CHARACTERS
           LABEL RECORDS       ARE OMITTED
           DATA RECORD         IS OUT-REC.
       01  OUT-REC.
           05  OUT-PO.
               10  OUT-PO-1    PIC X(01).
               10  OUT-PO-10   PIC X(10).
               10  OUT-PO-3    PIC X(03).
           05  OUT-PO-ITM      PIC X(06).
           05  OUT-VEN-NAME    PIC X(44).
           05  OUT-CORPCODE    PIC X(08).
           05  OUT-KEYWORD     PIC X(20).
           05  OUT-MODIFIER    PIC X(20).
           05  OUT-QTY-EXP     PIC 9(8)V9(4).
           05  OUT-EXP-DATE.
               10  OUT-EXP-CC  PIC XX.
               10  OUT-EXP-YY  PIC XX.
               10  OUT-EXP-MM  PIC XX.
               10  OUT-EXP-DD  PIC XX.
           05  OUT-DAYS-EARLY  PIC 9(04).
           05  OUT-DAYS-LATE   PIC 9(04).
           05  OUT-CARR-CODE   PIC X(04).
           05  OUT-DEL-DATE.
               10  OUT-DEL-CC  PIC XX.
               10  OUT-DEL-YY  PIC XX.
               10  OUT-DEL-MM  PIC XX.
               10  OUT-DEL-DD  PIC XX.
           05  OUT-QTY-DEL     PIC 9(8)V9(4).
           05  OUT-RCVR-NO     PIC X(03).
           05  OUT-CORR-ACT    PIC X(01).
           05  OUT-E-L-CNT     PIC 9(04).
           05  OUT-E-L         PIC X(01).
           05  OUT-EXPD-CARR   PIC X(01).

       SD  SORT-FILE RECORD    CONTAINS 174 CHARACTERS
           DATA RECORD         IS SORT-REC.
       01  SORT-REC.
           05  SORT-PO.
               10  SORT-PO-1   PIC X(01).
               10  SORT-PO-10  PIC X(10).
               10  SORT-PO-3   PIC X(03).
           05  SORT-PO-ITM     PIC X(06).
           05  SORT-VEN-NAME   PIC X(44).
           05  SORT-CORPCODE   PIC X(08).
           05  SORT-KEY-MOD.
               10  SORT-KEY    PIC X(20).
               10  SORT-MOD    PIC X(20).
           05  SORT-QTY-EXP    PIC 9(8)V9(4).
           05  SORT-EXP-DATE   PIC X(08).
           05  SORT-DAYS-EARLY PIC 9(04).
           05  SORT-DAYS-LATE  PIC 9(04).
           05  SORT-CARR-CODE  PIC X(04).
           05  SORT-DEL-DATE   PIC X(08).
           05  SORT-QTY-DEL    PIC 9(8)V9(4).
           05  SORT-RCVR-NO    PIC X(03).
           05  SORT-CORR-ACT   PIC X(01).
           05  SORT-E-L-CNT    PIC 9(04).
           05  SORT-E-L        PIC X(01).
           05  SORT-EXPD-CARR  PIC X(01).

       WORKING-STORAGE SECTION.
       77  ARG-NO              PIC 9999  VALUE 1.
       77  LINE-CTR            PIC S99.
       77  PAGE-CTR            PIC S99.
       77  ADV-CTR             PIC 9.
       77  ACT-KEY             PIC 9999  VALUE 0.
       77  SUB                 PIC 9(08).
       77  RET-CODE            PIC X(02).
       77  BASE                PIC X(10).
       77  TRAK-CORP-CODE      PIC X(08).
       77  TRAK-VEN-CODE       PIC X(10).
       77  PAGE-SKIP           PIC X.
       77  D-PARM              PIC X.
       77  L-PARM              PIC X.
       77  FORMAT-DATE         PIC 9(8)  VALUE ZEROS.
       77  PLT-ARG             PIC X(4).

       01  FILE-STAT.
           05  FILE-STAT-1     PIC X     VALUE "0".
           05  FILE-STAT-2     PIC X     VALUE "0".

       01  SELECTION-SWITCHES.
           05  CODE-SW         PIC 9     VALUE 0.
               88  SELCODE               VALUE 1.
               88  SELCODE-R             VALUE 2.
               88  SELALL                VALUE 3.
           05  NAME-SW         PIC 9     VALUE 0.
               88  SELNAME               VALUE 1.
               88  SELNAME-R             VALUE 2.
           05  ALT-SW          PIC 9     VALUE 0.
               88  SELALT                VALUE 1.
               88  SELALT-R              VALUE 2.
           05  DATE-SW         PIC 9     VALUE 0.
               88  SELDATE               VALUE 1.
               88  SELDATE-R             VALUE 2.
           05  PO-SW           PIC 9     VALUE 0.
               88  SELPO                 VALUE 1.
               88  SELPO-R               VALUE 2.

       01  TRAK-VEN-NAME.
           05  TRAK-VEN-ALT    PIC X(10).
           05  TRAK-VEN-FILL   PIC X(34).

       01  TRAK-VEN-NAME2.
           05  TRAK-VEN-ALT2   PIC X(10).
           05  TRAK-VEN-FILL2  PIC X(34).

       01  TRAK-PO.
           05  TRAK-PO-1       PIC X(01).
           05  TRAK-PO-NO      PIC X(13).

       01  TRAK-PO-H.
           05  TRAK-PO-NO-H    PIC X(13).
           05  TRAK-PO-1-H     PIC X(01).

       01  VENDOR-CODE-TABLE.
           05  CODE-TABLE      OCCURS 500 TIMES.
               10  VCODE       PIC X(10).

       01  DATE-HOLD.
           05  DH-MM           PIC XX.
           05  SLASH1          PIC X.
           05  DH-DD           PIC XX.
           05  SLASH2          PIC X.
           05  DH-YY           PIC XX.

       01  TIME-BUFFER.
           05  CUR-TIME.
               10  CUR-HRS     PIC XX.
               10  CUR-MINS    PIC XX.
           05  CUR-SECS        PIC XXXX.

       01  CURDATE-BUFF-CN.
           05  CC-BUFFER         PIC XX.
           05  CURDATE-BUFFER.
               10  YY-BUFFER     PIC XX.
               10  MM-BUFFER     PIC XX.
               10  DD-BUFFER     PIC XX.

       01  GREG-DATE.
           05  G-YEAR          PIC XXXX.
           05  G-MONTH         PIC XX.
           05  G-DAY           PIC XX.

       01  JUL-EXP             PIC  9(07).
       01  FILLER              REDEFINES JUL-EXP.
           05  JE-YEAR         PIC 9999.
           05  JE-DAY          PIC 999.

       01  JUL-DEL             PIC  9(07).
       01  FILLER              REDEFINES JUL-DEL.
           05  JD-YEAR         PIC 9999.
           05  JD-DAY          PIC 999.

       01  JUL-E-L             PIC  9(07).
       01  JUL-SIGN            PIC S9(07).
       01  JUL-DATE            PIC  X(07).
       01  JULIAN-DATE         REDEFINES JUL-DATE
                               PIC  9(07).
       01  FILLER              REDEFINES JUL-DATE.
           05  J-YEAR          PIC 9999.
           05  J-DAY           PIC 999.

       01  DETAIL-REC-A.
           05  FILLER          PIC X(04)  VALUE "PO: ".
           05  PUR-ORD         PIC X(10).
           05  PUR-RCVR        PIC X(03).
           05  FILLER          PIC X(02)  VALUE "  ".
           05  PUR-ITM         PIC X(04).
           05  FILLER          PIC X(12)  VALUE "    VENDOR: ".
           05  VEND-NAME       PIC X(44).
           05  FILLER          PIC X(01)  VALUE " ".

       01  DETAIL-REC-B.
           05  FILLER          PIC X(11)  VALUE "CORP CODE: ".
           05  CORPCODE        PIC X(08).
           05  FILLER          PIC X(05)  VALUE "  -  ".
           05  KEY-MOD.
               10  KEY-MOD-KEY PIC X(20).
               10  KEY-MOD-MOD PIC X(20).
           05  FILLER          PIC X(16)  VALUE SPACES.

       01  DETAIL-REC-C.
           05  QTY-EXP         PIC Z(7)9.9(4).
           05  FILLER          PIC X.
           05  EXP-DATE        PIC X(08).
           05  FILLER          PIC XX.
           05  DAYS-EARLY      PIC ZZZ9.
           05  FILLER          PIC XX.
           05  DAYS-LATE       PIC ZZZ9.
           05  FILLER          PIC XX.
           05  CARRIER-CODE    PIC X(04).
           05  FILLER          PIC XX.
           05  DEL-DATE        PIC X(08).
           05  FILLER          PIC XX.
           05  QTY-DEL         PIC Z(7)9.9(4).
           05  QTY-DEL-X       REDEFINES QTY-DEL
                               PIC X(13).
           05  FILLER          PIC XX.
           05  RCVR-NO         PIC X(03).
           05  FILLER          PIC XXX.
           05  CORR-ACTION     PIC X(01).
           05  FILLER          PIC XX.
           05  E-L-CNT         PIC ZZ9.
           05  E-L             PIC X.

       01  EXPD-CARR-REC.
           05  FILLER      PIC X(36) VALUE SPACES.
           05  FILLER      PIC X(17) VALUE "EXPEDITED CARRIER".
           05  FILLER      PIC X(27) VALUE SPACES.

       01  HEADING-DT-TM.
           05  FILLER  PIC X(12) VALUE "SRCVTRKR    ".
           05  FILLER  PIC X(13) VALUE "PRINT DATE:  ".
           05  P-DATE  PIC X(08).
           05  FILLER  PIC X(11) VALUE "    TIME:  ".
           05  P-TIME  PIC X(04).
           05  FILLER  PIC X(03) VALUE SPACES.
           05  P-DOC   PIC X(15).
           05  FILLER  PIC X(03) VALUE SPACES.
           05  PAGE-T  PIC X(06).
           05  PAGENO  PIC ZZ9.
           05  FILLER  PIC X(02) VALUE SPACES.

       01  HEAD-TITLE-1.
           05  FILLER      PIC X(20) VALUE "        O N - T I M ".
           05  FILLER      PIC X(20) VALUE "E   D E L I V E R Y ".
           05  FILLER      PIC X(20) VALUE "  T R A C K I N G   ".
           05  FILLER      PIC X(20) VALUE "S Y S T E M         ".

       01  HEAD-TITLE-2.
           05  FILLER      PIC X(20) VALUE "               D E L".
           05  FILLER      PIC X(20) VALUE " I V E R Y   E X C E".
           05  FILLER      PIC X(20) VALUE " P T I O N S   R E P".
           05  FILLER      PIC X(20) VALUE " O R T              ".

       01  HEADING-A.
           05  FILLER      PIC X(20) VALUE "    EXPECTED  EXPECT".
           05  FILLER      PIC X(20) VALUE "ED  EARLY LATE      ".
           05  FILLER      PIC X(20) VALUE "  DELIVERED    DELIV".
           05  FILLER      PIC X(20) VALUE "ERED      ACTION DYS".

       01  HEADING-B.
           05  FILLER      PIC X(20) VALUE "    QUANTITY  DATE  ".
           05  FILLER      PIC X(20) VALUE "    DAYS  DAYS CARRI".
           05  FILLER      PIC X(20) VALUE "ER  DATE       QUANT".
           05  FILLER      PIC X(20) VALUE "ITY   RCVR  Y/N  E/L".

       01  SEL-A.
           05  FILLER      PIC X(20) VALUE "  SELECTION CRITERIA".
           05  FILLER      PIC X(20) VALUE ":                   ".
           05  FILLER      PIC X(20) VALUE "                    ".
           05  FILLER      PIC X(20) VALUE "                    ".

       01  SEL-B.
           05  FILLER      PIC X(20) VALUE "      VENDOR CODE:  ".
           05  V-CODE-F    PIC X(10).
           05  FILLER      PIC X(06) VALUE "  TO  ".
           05  V-CODE-T    PIC X(10).
           05  FILLER      PIC X(16) VALUE SPACES.

       01  SEL-C.
           05  FILLER      PIC X(20) VALUE "      VENDOR NAME:  ".
           05  V-NAME-F    PIC X(44).
           05  FILLER      PIC X(16) VALUE SPACES.

       01  SEL-D.
           05  FILLER      PIC X(20) VALUE "               TO:  ".
           05  V-NAME-T    PIC X(44).
           05  FILLER      PIC X(16) VALUE SPACES.

       01  SEL-E.
           05  FILLER      PIC X(20) VALUE "    DELIVERY DATE:  ".
           05  D-DATE-F.
               10  DF-MM   PIC X(02).
               10  FILLER  PIC X     VALUE "/".
               10  DF-DD   PIC X(02).
               10  FILLER  PIC X     VALUE "/".
               10  DF-CC   PIC X(02).
               10  DF-YY   PIC X(02).
           05  FILLER      PIC X(06) VALUE "  TO  ".
           05  D-CODE-T.
               10  DT-MM   PIC X(02).
               10  FILLER  PIC X     VALUE "/".
               10  DT-DD   PIC X(02).
               10  FILLER  PIC X     VALUE "/".
               10  DT-CC   PIC X(02).
               10  DT-YY   PIC X(02).
           05  FILLER      PIC X(34) VALUE "                    ".

       01  SEL-F.
           05  FILLER      PIC X(20) VALUE "   PURCHASE ORDER:  ".
           05  PO-F        PIC X(13).
           05  FILLER      PIC X(06) VALUE "  TO  ".
           05  PO-T        PIC X(13).
           05  FILLER      PIC X(28) VALUE SPACES.

       01  SEL-HN.
           05  FILLER      PIC X(20) VALUE "    HISTORY RECORDS ".
           05  FILLER      PIC X(23) VALUE "ARE  >>NOT<<  INCLUDED.".
           05  FILLER      PIC X(37) VALUE SPACES.

       01  SEL-HA.
           05  FILLER      PIC X(20) VALUE "        HISTORY RECO".
           05  FILLER      PIC X(23) VALUE "RDS  >>ARE<<  INCLUDED.".
           05  FILLER      PIC X(37) VALUE SPACES.

       01  SEL-HU.
           05  FILLER      PIC X(25) VALUE SPACES.
           05  FILLER      PIC X(07) VALUE "*******".
           05  FILLER      PIC X(48) VALUE SPACES.

       01  SEL-NO-REC-A.
           05  FILLER      PIC X(20) VALUE "            THERE AR".
           05  FILLER      PIC X(20) VALUE "E NO UNREPORTED DELI".
           05  FILLER      PIC X(20) VALUE "VERY EXCEPTIONS AT T".
           05  FILLER      PIC X(20) VALUE "HIS TIME.           ".

       01  SEL-NO-REC-M.
           05  FILLER      PIC X(20) VALUE "            THERE AR".
           05  FILLER      PIC X(20) VALUE "E NO RECORDS WHICH M".
           05  FILLER      PIC X(20) VALUE "EET YOUR SELECTION C".
           05  FILLER      PIC X(20) VALUE "RITERIA.            ".

       01  COMPARE-DATES.
           05  CS-DATE.
               10  CSCC        PIC XX.
               10  CSYY        PIC XX.
               10  CSMM        PIC XX.
               10  CSDD        PIC XX.
           05  CE-DATE.
               10  CECC        PIC XX.
               10  CEYY        PIC XX.
               10  CEMM        PIC XX.
               10  CEDD        PIC XX.

       01  COMPARE-ARGUMENTS.
           05  PO-ITM-SAVE.
               10  PO-SAVE     PIC X(14).
               10  POI-SAVE    PIC X(04).
           05  PO-ITM-COMP.
               10  PO-COMP     PIC X(14).
               10  POI-COMP    PIC X(04).

       COPY THDPRTB IN COPYLIB.

       01  PASSED-SELECTION-DATA.
           05  VEND-CODES.
               10  VC-FRST     PIC X(10).
               10  VC-LAST     PIC X(10).
           05  VEND-NAMES.
               10  VN-FRST     PIC X(44).
               10  VN-LAST     PIC X(44).
           05  DATES.
               10  S-DATE.
                   15  S-CC    PIC X(02).
                   15  S-YY    PIC X(02).
                   15  S-MM    PIC X(02).
                   15  S-DD    PIC X(02).
               10  E-DATE.
                   15  E-CC    PIC X(02).
                   15  E-YY    PIC X(02).
                   15  E-MM    PIC X(02).
                   15  E-DD    PIC X(02).
           05  PO-NUMS.
               10  PO-FRST     PIC X(13).
               10  PO-LAST     PIC X(13).
           05  HISTORY-SW      PIC X(01).
           05  AUTO-MANUAL     PIC X(01).
               88  AUTORPT                VALUE "A".
               88  MANUAL                 VALUE "M".

           COPY OVRPFDATA      IN COPYLIB.

           COPY CCHKOBJ        IN COPYLIB.

           COPY DBSTAT         IN COPYLIB.

           COPY CDESC          IN COPYLIB.

           COPY DVENDOR        IN COPYLIB.

           COPY DVENDORH       IN COPYLIB.

           COPY KVENDOR        IN COPYLIB.

           COPY MALTVEN        IN COPYLIB.

           COPY TBLOWUP        IN COPYLIB.

           COPY DRCVTRAK       IN COPYLIB.

           COPY DRCVTRAKH      IN COPYLIB.

           COPY MPLTINFO       IN COPYLIB.

       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  MESSAGE-DATA.
           COPY ERRORLIN       IN COPYLIB.

       PROCEDURE DIVISION.
       INITIALIZATION-SECTION  SECTION 01.
       INITIALIZATION.
           MOVE SPACES         TO PO-ITM-SAVE
                                  PO-ITM-COMP
                                  VENDOR-CODE-TABLE.
           ACCEPT CURDATE-BUFFER FROM DATE.
           ACCEPT TIME-BUFFER  FROM TIME.
           MOVE 20             TO CC-BUFFER.
           IF YY-BUFFER > 70
               MOVE 19         TO CC-BUFFER.
           MOVE MM-BUFFER      TO DH-MM.
           MOVE DD-BUFFER      TO DH-DD.
           MOVE YY-BUFFER      TO DH-YY.
           MOVE "/"            TO SLASH1 SLASH2.
           MOVE CUR-TIME       TO P-TIME.
           MOVE DATE-HOLD      TO P-DATE.

           OPEN I-O            RCV-TRACKING.
           IF FILE-STAT NOT = "00"
               MOVE SPACES     TO MESSAGE-BUFFER
               MOVE "OPEN ERROR, RCV-TRACKING/INIT.        FILE-STAT ="
                               TO MSG-TEXT
               MOVE FILE-STAT  TO MSG-FLD
               DISPLAY MESSAGE-BUFFER
               GO TO END-OF-JOB.

           OPEN INPUT          RCV-TRACKING-HIST.
           IF FILE-STAT NOT = "00"
               MOVE SPACES     TO MESSAGE-BUFFER
               MOVE "OPEN ERROR, RCV-TRACKING-HIST/INIT.   FILE-STAT ="
                               TO MSG-TEXT
               MOVE FILE-STAT  TO MSG-FLD
               DISPLAY MESSAGE-BUFFER
               GO TO END-OF-JOB.

           OPEN INPUT          RCVTRK-FILE.
           IF FILE-STAT NOT = "00"
               MOVE SPACES     TO MESSAGE-BUFFER
               MOVE "OPEN ERROR, RCVTRK-FILE/INIT.         FILE-STAT ="
                               TO MSG-TEXT
               MOVE FILE-STAT  TO MSG-FLD
               DISPLAY MESSAGE-BUFFER
               GO TO END-OF-JOB.

           OPEN INPUT          DVENDOR
           IF FILE-STAT NOT = "00"
               MOVE SPACES     TO MESSAGE-BUFFER
               MOVE "OPEN ERROR, DVENDOR/INIT.             FILE-STAT ="
                               TO MSG-TEXT
               MOVE FILE-STAT  TO MSG-FLD
               DISPLAY MESSAGE-BUFFER
               GO TO END-OF-JOB.

           OPEN INPUT          DVENDORH.
           IF FILE-STAT NOT = "00"
               MOVE SPACES     TO MESSAGE-BUFFER
               MOVE "OPEN ERROR, DVENDORH/INIT.            FILE-STAT ="
                               TO MSG-TEXT
               MOVE FILE-STAT  TO MSG-FLD
               DISPLAY MESSAGE-BUFFER
               GO TO END-OF-JOB.

           OPEN INPUT          VENDOR-NAME.
           IF FILE-STAT NOT = "00"
               MOVE SPACES     TO MESSAGE-BUFFER
               MOVE "OPEN ERROR, VENDOR-NAME/INIT.         FILE-STAT ="
                               TO MSG-TEXT
               MOVE FILE-STAT  TO MSG-FLD
               DISPLAY MESSAGE-BUFFER
               GO TO END-OF-JOB.

           OPEN INPUT          VENDOR-ALTNAME.
           IF FILE-STAT NOT = "00"
               MOVE SPACES     TO MESSAGE-BUFFER
               MOVE "OPEN ERROR, VENDOR-ALTNAME/INIT.      FILE-STAT ="
                               TO MSG-TEXT
               MOVE FILE-STAT  TO MSG-FLD
               DISPLAY MESSAGE-BUFFER
               GO TO END-OF-JOB.

      *------ MOVE ISO DOCUMENT # TO HEADING.
           OPEN INPUT MPLTINFO-I.
           MOVE SPACES TO P-DOC.
           MOVE "ISO " TO PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-I-REC.
           READ MPLTINFO-I INTO BUF-MPLTINFO
              INVALID KEY MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               MOVE ISO-DOC-NUM TO P-DOC.

           MOVE 1              TO ARG-NO.
           MOVE SPACES         TO PASSED-SELECTION-DATA.
           READ RCVTRK-FILE    INTO PASSED-SELECTION-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "23"
               PERFORM PRINT-HEADINGS
               MOVE ALL "*"    TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 4
               MOVE SPACES     TO PRINT-REC
               STRING "RCVTRK-FILE (MCFPCSRCVT) NOT FOUND  FILE-STAT = "
                   FILE-STAT   DELIMITED BY SPACES
                               INTO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1
               MOVE ALL "*"    TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1
               GO TO END-OF-JOB
           ELSE
           IF FILE-STAT NOT = "00"
               PERFORM PRINT-HEADINGS
               MOVE ALL "*"    TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 4
               MOVE SPACES     TO PRINT-REC
               STRING "READ FAILED ON RCVTRK-FILE  FILE-STAT = "
                   FILE-STAT   DELIMITED BY SPACES
                               INTO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1
               MOVE ALL "*"    TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1
               GO TO END-OF-JOB.

           IF AUTORPT
               OPEN OUTPUT     PRINT-FILE
               GO TO MAIN-FUNCTIONS.

           ACCEPT HD-ROUTE-DATA.
           MOVE HD-SPOOLER-NUMBER   TO OVRPRTF-TOFILE-NUM.
      **** MOVE 0              TO OVRPRTF-TOFILE-NUM.
           COPY OVRPFCALL      IN COPYLIB.
           OPEN OUTPUT         PRINT-FILE.

       MAIN-FUNCTIONS.
           CALL "CLRCVTRKR".
           MOVE ZEROS          TO SELECTION-SWITCHES.
           MOVE  0             TO PAGE-CTR ACT-KEY.
           MOVE "Y"            TO PAGE-SKIP.
           MOVE 60             TO LINE-CTR.
           MOVE  1             TO ADV-CTR.

           IF AUTORPT
               MOVE SPACES     TO PASSED-SELECTION-DATA
               MOVE  3         TO CODE-SW
               MOVE "N"        TO PAGE-SKIP
               MOVE "A"        TO AUTO-MANUAL
               GO TO SORT-FUNCTIONS.

       EDIT-FUNCTIONS.
           IF VC-FRST NOT = SPACES
               MOVE  1         TO CODE-SW.

           IF VC-LAST NOT = SPACES
               MOVE  2         TO CODE-SW.

           IF VC-FRST = "*ALL"
               MOVE  3         TO CODE-SW.

           IF CODE-SW > 0
               MOVE SPACES     TO VEND-NAMES.

           IF VN-LAST NOT = SPACES
               MOVE  2         TO NAME-SW
               PERFORM VENDOR-LOOKUP THRU VL-EXIT.

           IF VN-FRST NOT = SPACES
               MOVE  1         TO NAME-SW
               PERFORM VENDOR-LOOKUP THRU VL-EXIT.

           IF S-DATE NOT = SPACES
               MOVE  1         TO DATE-SW.

           IF E-DATE NOT = SPACES
               MOVE  2         TO DATE-SW.

           IF PO-FRST NOT = SPACES
               MOVE  1         TO PO-SW.

           IF PO-LAST NOT = SPACES
               MOVE  2         TO PO-SW.

       SORT-FUNCTIONS.
           SORT SORT-FILE      ASCENDING KEY
                               SORT-VEN-NAME
                               SORT-KEY
                               SORT-MOD
                               SORT-CORPCODE
               INPUT PROCEDURE SORT-RCV-RECORDS
              OUTPUT PROCEDURE SORT-TRK-RECORDS.

           OPEN INPUT          OUT-FILE.

           IF MANUAL
               PERFORM PRINT-SELECTIONS.

           IF ACT-KEY = 0
               PERFORM PRINT-HEADINGS.

           MOVE  0             TO ACT-KEY.

       READ-LOOP.
           ADD 1               TO ACT-KEY.
           READ OUT-FILE       INVALID KEY
               GO TO END-OF-JOB.

           IF LINE-CTR > 54
               PERFORM PRINT-HEADINGS.

           MOVE  SPACES          TO  DETAIL-REC-C.
           MOVE  OUT-PO          TO                PO-COMP.
           MOVE  OUT-PO-10       TO  PUR-ORD.
           MOVE  OUT-PO-3        TO  PUR-RCVR.
           MOVE  OUT-PO-ITM      TO  PUR-ITM       POI-COMP.
           MOVE  OUT-VEN-NAME    TO  VEND-NAME.
           MOVE  OUT-CORPCODE    TO  CORPCODE.

           MOVE  SPACES          TO  KEY-MOD.
           STRING                OUT-KEYWORD
                                 DELIMITED BY SPACES
                                 ", "
                                 DELIMITED BY SIZE
                                 OUT-MODIFIER
                                 DELIMITED BY SPACES
                                 INTO KEY-MOD.

           MOVE  OUT-QTY-EXP     TO  QTY-EXP.
           MOVE  OUT-EXP-YY      TO  DH-YY.
           MOVE  OUT-EXP-MM      TO  DH-MM.
           MOVE  OUT-EXP-DD      TO  DH-DD.
           MOVE  DATE-HOLD       TO  EXP-DATE.
           MOVE  OUT-DAYS-EARLY  TO  DAYS-EARLY.
           MOVE  OUT-DAYS-LATE   TO  DAYS-LATE.
           MOVE  OUT-CARR-CODE   TO  CARRIER-CODE.
           MOVE  OUT-DEL-YY      TO  DH-YY.
           MOVE  OUT-DEL-MM      TO  DH-MM.
           MOVE  OUT-DEL-DD      TO  DH-DD.
           MOVE  DATE-HOLD       TO  DEL-DATE.
           MOVE  OUT-QTY-DEL     TO  QTY-DEL.
           IF OUT-QTY-DEL = 0.0
               MOVE  SPACES      TO  QTY-DEL-X.
           MOVE  OUT-RCVR-NO     TO  RCVR-NO.
           MOVE  OUT-CORR-ACT    TO  CORR-ACTION.
           IF OUT-E-L-CNT > 0
               MOVE  OUT-E-L-CNT TO  E-L-CNT.
           MOVE  OUT-E-L         TO  E-L.

           IF PO-ITM-COMP NOT = PO-ITM-SAVE
               MOVE  OUT-PO      TO PO-SAVE
               MOVE  OUT-PO-ITM  TO POI-SAVE
               IF LINE-CTR > 54
                   PERFORM PRINT-HEADINGS
               END-IF
               MOVE ALL "-"      TO PRINT-REC
               WRITE PRINT-REC   AFTER ADVANCING ADV-CTR
               MOVE DETAIL-REC-A TO PRINT-REC
               WRITE PRINT-REC   AFTER ADVANCING ADV-CTR
               MOVE DETAIL-REC-B TO PRINT-REC
               WRITE PRINT-REC   AFTER ADVANCING ADV-CTR
               ADD 3             TO LINE-CTR.

           MOVE DETAIL-REC-C     TO PRINT-REC.
           WRITE PRINT-REC       AFTER ADVANCING ADV-CTR.
           ADD 1                 TO LINE-CTR.

           IF OUT-EXPD-CARR NOT = SPACE
               MOVE EXPD-CARR-REC TO PRINT-REC
               WRITE PRINT-REC   AFTER ADVANCING ADV-CTR
               ADD 1             TO LINE-CTR.

           GO TO READ-LOOP.

       PRINT-HEADINGS.
           MOVE "PAGE: "       TO PAGE-T.
           ADD  1              TO PAGE-CTR.
           MOVE PAGE-CTR       TO PAGENO.
           MOVE HEADING-DT-TM  TO PRINT-REC.
           IF PAGE-SKIP = "Y"
               WRITE PRINT-REC AFTER ADVANCING NEW-PAGE
               MOVE ALL "="    TO PRINT-REC
           ELSE
               MOVE "Y"        TO PAGE-SKIP
               WRITE PRINT-REC AFTER ADVANCING 0
               MOVE ALL "="    TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING ADV-CTR.
           MOVE HEAD-TITLE-1   TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING ADV-CTR.
           MOVE HEAD-TITLE-2   TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING ADV-CTR.
           MOVE ALL "="        TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING ADV-CTR.
           MOVE HEADING-A      TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING ADV-CTR.
           MOVE HEADING-B      TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING ADV-CTR.
           MOVE  7             TO LINE-CTR.

           IF ACT-KEY = 0
               IF AUTORPT
                   MOVE ALL "-"      TO PRINT-REC
                   WRITE PRINT-REC   AFTER ADVANCING 1
                   MOVE ALL "*"      TO PRINT-REC
                   WRITE PRINT-REC   AFTER ADVANCING 4
                   MOVE SEL-NO-REC-A TO PRINT-REC
                   WRITE PRINT-REC   AFTER ADVANCING 1
                   MOVE ALL "*"      TO PRINT-REC
                   WRITE PRINT-REC   AFTER ADVANCING 1
                   GO TO END-OF-JOB.

      *SRCVTRKR                PRINT DATE:  00/00/00        TIME:  0000
      **************************************************************************
      *       D E L I V E R Y   T R A C K I N G   S Y S T E M   R E P O R T
      **************************************************************************
      *EXPECTED    EXPECTED  EARLY LATE         DELIVERED  DELIVERED     ACTION
      *QUANTITY      DATE    DAYS  DAYS CARRIER   DATE     QUANTITY  RCVR (Y/N)
      **************************************************************************

       PRINT-SELECTIONS.
           MOVE VC-FRST        TO V-CODE-F.
           MOVE VC-LAST        TO V-CODE-T.
           MOVE VN-FRST        TO V-NAME-F.
           MOVE VN-LAST        TO V-NAME-T.

           MOVE S-CC           TO DF-CC.
           MOVE S-YY           TO DF-YY.
           MOVE S-MM           TO DF-MM.
           MOVE S-DD           TO DF-DD.
           MOVE E-CC           TO DT-CC.
           MOVE E-YY           TO DT-YY.
           MOVE E-MM           TO DT-MM.
           MOVE E-DD           TO DT-DD.

           MOVE PO-FRST        TO PO-F.
           MOVE PO-LAST        TO PO-T.

           IF VC-FRST = SPACES MOVE ALL "_" TO V-CODE-F.
           IF VC-LAST = SPACES MOVE ALL "_" TO V-CODE-T.
           IF VN-FRST = SPACES MOVE ALL "_" TO V-NAME-F.
           IF VN-LAST = SPACES MOVE ALL "_" TO V-NAME-T.
           IF S-CC    = SPACES MOVE ALL "_" TO DF-CC.
           IF S-YY    = SPACES MOVE ALL "_" TO DF-YY.
           IF S-MM    = SPACES MOVE ALL "_" TO DF-MM.
           IF S-DD    = SPACES MOVE ALL "_" TO DF-DD.
           IF E-CC    = SPACES MOVE ALL "_" TO DT-CC.
           IF E-YY    = SPACES MOVE ALL "_" TO DT-YY.
           IF E-MM    = SPACES MOVE ALL "_" TO DT-MM.
           IF E-DD    = SPACES MOVE ALL "_" TO DT-DD.
           IF PO-FRST = SPACES MOVE ALL "_" TO PO-F.
           IF PO-LAST = SPACES MOVE ALL "_" TO PO-T.

           MOVE SPACES         TO PAGE-T.
           MOVE HEADING-DT-TM  TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING ADV-CTR.
           MOVE ALL "="        TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING ADV-CTR.
           MOVE HEAD-TITLE-1   TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING ADV-CTR.
           MOVE HEAD-TITLE-2   TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING ADV-CTR.
           MOVE ALL "="        TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING ADV-CTR.

           MOVE SEL-A          TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 4.
           MOVE ALL "-"        TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 1.
           MOVE SEL-B          TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 2.
           MOVE SEL-C          TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 2.
           MOVE SEL-D          TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 2.
           MOVE SEL-E          TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 2.
           MOVE SEL-F          TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 2.
           IF HISTORY-SW = " "
               MOVE SEL-HN         TO PRINT-REC
               WRITE PRINT-REC     AFTER ADVANCING 3
               MOVE SEL-HU         TO PRINT-REC
               WRITE PRINT-REC     AFTER ADVANCING 1
           ELSE
               MOVE SEL-HA         TO PRINT-REC
               WRITE PRINT-REC     AFTER ADVANCING 3
               MOVE SEL-HU         TO PRINT-REC
               WRITE PRINT-REC     AFTER ADVANCING 1.

           IF ACT-KEY = 0
               IF MANUAL
                   MOVE ALL "*"      TO PRINT-REC
                   WRITE PRINT-REC   AFTER ADVANCING 4
                   MOVE SEL-NO-REC-M TO PRINT-REC
                   WRITE PRINT-REC   AFTER ADVANCING 1
                   MOVE ALL "*"      TO PRINT-REC
                   WRITE PRINT-REC   AFTER ADVANCING 1
                   GO TO END-OF-JOB.

       END-OF-JOB.
           IF AUTORPT
               PERFORM SET-REPORTED-FLAG THRU SET-FLAG-EXIT.

           CLOSE               OUT-FILE.
           CLOSE               PRINT-FILE.
           CLOSE               RCV-TRACKING.
           CLOSE               RCV-TRACKING-HIST.
           CLOSE               RCVTRK-FILE.
           CLOSE               DVENDOR.
           CLOSE               DVENDORH.
           CLOSE               VENDOR-NAME.
           CLOSE               VENDOR-ALTNAME.
           CLOSE               MPLTINFO-I.
           GOBACK.

       SET-REPORTED-FLAG.
           MOVE LOW-VALUES     TO PORCVNO OF RCV-TRACKING
                                  ITEMNO  OF RCV-TRACKING.
           MOVE ZEROES         TO SEQNO   OF RCV-TRACKING.
           START RCV-TRACKING  KEY NOT LESS THAN PORCVNO OF RCV-TRACKING
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "23"
               GO TO SET-FLAG-EXIT
           ELSE
           IF FILE-STAT NOT = "00"
               MOVE SPACES     TO MESSAGE-BUFFER
               MOVE "START ERROR, RCV-TRACKING/SET-FLAG    FILE-STAT ="
                               TO MSG-TEXT
               MOVE FILE-STAT  TO MSG-FLD
               DISPLAY MESSAGE-BUFFER
               GO TO END-OF-JOB.

       SET-FLAG-LOOP.
           READ RCV-TRACKING   NEXT INTO BUF-DRCVTRAK
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT = "10" OR "14" OR "46"
                   GO TO SET-FLAG-EXIT
               ELSE
                   MOVE SPACES TO MESSAGE-BUFFER
                   MOVE
                   "READ ERROR, RCV-TRACKING/SET-FLAG    FILE-STAT ="
                               TO MSG-TEXT
                   MOVE FILE-STAT TO MSG-FLD
                   DISPLAY MESSAGE-BUFFER
                   GO TO END-OF-JOB.

           IF RCVTRAK-ALREADY-REPORTED NOT = SPACE
               GO TO SET-FLAG-LOOP.

      *------------- DON'T SET THE FLAG IF THE RECEIPT HASN'T BEEN
      *------------- ENTERED YET.
           IF RCVTRAK-DLVR-DATE = SPACE
               GO TO SET-FLAG-LOOP.

           MOVE "X"            TO RCVTRAK-ALREADY-REPORTED.

           REWRITE RTRK-REC    FROM BUF-DRCVTRAK
               INVALID KEY
               DISPLAY "  SRCVTRKR, REWRITE FAILED ON RCV-TRACKING"
               DISPLAY "    FILE-STATUS = " FILE-STAT
               GO TO SET-FLAG-EXIT.

           GO TO SET-FLAG-LOOP.

       SET-FLAG-EXIT.          EXIT.

       VENDOR-LOOKUP.
           IF SELALL           GO TO VL-EXIT.

           MOVE 1              TO SUB.
           MOVE VN-FRST        TO TRAK-VEN-NAME
                                  KVENNAME OF VENDOR-NAME.
           MOVE VN-LAST        TO TRAK-VEN-NAME2.
           MOVE TRAK-VEN-ALT   TO VENCALTKEY OF VENDOR-ALTNAME.
           START VENDOR-NAME   KEY NOT LESS THAN KVENNAME OF VENDOR-NAME
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "23"
               START VENDOR-ALTNAME KEY NOT LESS THAN
                               VENCALTKEY OF VENDOR-ALTNAME
                   INVALID KEY MOVE FILE-STAT TO FILE-STAT
               END-START
               IF FILE-STAT = "23"
                   GO TO VL-EXIT
               ELSE
               IF FILE-STAT NOT = "00"
                   MOVE SPACES TO MESSAGE-BUFFER
                   MOVE
               "START ERROR, VENDOR-ALTNAME/VENDOR-LOOKUP   FILE-STAT ="
                               TO MSG-TEXT
                   MOVE FILE-STAT TO MSG-FLD
                   DISPLAY MESSAGE-BUFFER
                   GO TO VL-EXIT
               ELSE
                   MOVE NAME-SW TO ALT-SW
                   MOVE 0      TO NAME-SW
                   GO TO VLOOKUP-ALT-LOOP
           ELSE
           IF FILE-STAT NOT = "00"
               MOVE SPACES     TO MESSAGE-BUFFER
               MOVE
               "START ERROR, VENDOR-NAME/VENDOR-LOOKUP      FILE-STAT ="
                               TO MSG-TEXT
               MOVE FILE-STAT  TO MSG-FLD
               DISPLAY MESSAGE-BUFFER
               GO TO VL-EXIT.

       VLOOKUP-NAME-LOOP.
           READ VENDOR-NAME    NEXT INTO BUF-KVENDOR
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "10" OR "14" OR "46"
               GO TO VL-EXIT
           ELSE
           IF FILE-STAT NOT = "00"
               MOVE SPACES     TO MESSAGE-BUFFER
               MOVE
               "READ ERROR, VENDOR-NAME/VLOOKUP-NAME-LOOP   FILE-STAT ="
                               TO MSG-TEXT
               MOVE FILE-STAT  TO MSG-FLD
               DISPLAY MESSAGE-BUFFER
               GO TO VL-EXIT.

           IF SELNAME
               IF KVENNAME NOT = TRAK-VEN-NAME
                   GO TO VL-EXIT.

           IF SELNAME-R
               IF KVENNAME = TRAK-VEN-NAME
                   NEXT SENTENCE
               ELSE
               IF KVENNAME > TRAK-VEN-NAME AND
                  KVENNAME < TRAK-VEN-NAME2
                   NEXT SENTENCE
               ELSE
               IF KVENNAME = TRAK-VEN-NAME2
                   NEXT SENTENCE
               ELSE
                   GO TO VLOOKUP-NAME-LOOP.

           IF SELNAME
               MOVE KVENCDE    TO TRAK-VEN-CODE
           ELSE
               MOVE KVENCDE    TO VCODE(SUB)
               ADD 1           TO SUB
               IF SUB > 500
                   GO TO VL-EXIT.

           GO TO VLOOKUP-NAME-LOOP.

       VLOOKUP-ALT-LOOP.
           READ VENDOR-ALTNAME NEXT INTO BUF-MALTVEN
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "10" OR "14" OR "46"
               GO TO VL-EXIT
           ELSE
           IF FILE-STAT NOT = "00"
               MOVE SPACES     TO MESSAGE-BUFFER
               MOVE
               "READ ERROR, VENDOR-ALTNAME/VLOOKUP-ALT-LOOP FILE-STAT ="
                               TO MSG-TEXT
               MOVE FILE-STAT  TO MSG-FLD
               DISPLAY MESSAGE-BUFFER
               GO TO VL-EXIT.

           IF SELALT
               IF VENCALTKEY NOT = TRAK-VEN-ALT
                   GO TO VL-EXIT.

           IF SELALT-R
               IF VENCALTKEY = TRAK-VEN-ALT
                   NEXT SENTENCE
               ELSE
               IF VENCALTKEY > TRAK-VEN-ALT AND
                  VENCALTKEY < TRAK-VEN-ALT2
                   NEXT SENTENCE
               ELSE
               IF VENCALTKEY = TRAK-VEN-ALT2
                   NEXT SENTENCE
               ELSE
                   GO TO VLOOKUP-ALT-LOOP.

           IF SELALT
               MOVE KVENCDE    TO TRAK-VEN-CODE
           ELSE
               MOVE KVENCDE    TO VCODE(SUB)
               ADD 1           TO SUB
               IF SUB > 500
                   GO TO VL-EXIT.

           GO TO VLOOKUP-ALT-LOOP.

       VL-EXIT.                EXIT.

       SORT-RCV-RECORDS-SECT   SECTION 02.
       SORT-RCV-RECORDS.
           PERFORM SORT-MAIN   THRU SORT-M-EXIT.

       SORT-MAIN.
           MOVE LOW-VALUES     TO PORCVNO OF RCV-TRACKING
                                  ITEMNO  OF RCV-TRACKING.
           MOVE ZEROES         TO SEQNO   OF RCV-TRACKING.
           START RCV-TRACKING  KEY NOT LESS THAN PORCVNO OF RCV-TRACKING
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "23"
               GO TO SORT-MAIN-CONT
           ELSE
           IF FILE-STAT NOT = "00"
               MOVE SPACES     TO MESSAGE-BUFFER
               MOVE "START ERROR, RCV-TRACKING/SORT-MAIN   FILE-STAT ="
                               TO MSG-TEXT
               MOVE FILE-STAT  TO MSG-FLD
               DISPLAY MESSAGE-BUFFER
               GO TO END-OF-JOB.

           PERFORM SORT-DBGET  THRU SORT-DBGET-EXIT.

       SORT-MAIN-CONT.
           IF HISTORY-SW = SPACE
               GO TO SORT-M-EXIT.

           MOVE LOW-VALUES     TO PORCVNO OF RCV-TRACKING-HIST
                                  ITMNO   OF RCV-TRACKING-HIST.
           MOVE ZEROES         TO SEQNO   OF RCV-TRACKING-HIST.
           START RCV-TRACKING-HIST
               KEY NOT LESS THAN PORCVNO OF RCV-TRACKING-HIST
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "23"
               GO TO SORT-M-EXIT
           ELSE
           IF FILE-STAT NOT = "00"
               MOVE SPACES     TO MESSAGE-BUFFER
               MOVE "START ERROR, RCV-TRACKING-HIST         FILE-STAT ="
                               TO MSG-TEXT
               MOVE FILE-STAT  TO MSG-FLD
               DISPLAY MESSAGE-BUFFER
               GO TO END-OF-JOB.

           PERFORM SORT-DBGET-H THRU SORT-DBGET-H-EXIT.

       SORT-M-EXIT.            EXIT.

       SORT-DBGET.
           MOVE SPACES         TO SORT-REC.
           READ RCV-TRACKING   NEXT INTO BUF-DRCVTRAK
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT = "10" OR "14" OR "46"
                   GO TO SORT-DBGET-EXIT
               ELSE
                   MOVE SPACES TO MESSAGE-BUFFER
                   MOVE
                   "READ ERROR, RCV-TRACKING/SORT-MAIN   FILE-STAT ="
                               TO MSG-TEXT
                   MOVE FILE-STAT TO MSG-FLD
                   DISPLAY MESSAGE-BUFFER
                   GO TO END-OF-JOB.

           IF AUTORPT
               IF RCVTRAK-ALREADY-REPORTED NOT = SPACE
                   GO TO SORT-DBGET.

           IF RCVTRAK-DLVR-DATE = SPACES
               GO TO SORT-DBGET.

           IF SELCODE
               IF VC-FRST NOT = RCVTRAK-VEN-CODE
                   GO TO SORT-DBGET.

           IF SELCODE-R
               IF RCVTRAK-VEN-CODE < VC-FRST OR
                  RCVTRAK-VEN-CODE > VC-LAST
                   GO TO SORT-DBGET.

           IF SELNAME OR SELALT
               IF TRAK-VEN-CODE NOT = RCVTRAK-VEN-CODE
                   GO TO SORT-DBGET.

           IF SELNAME-R OR SELALT-R
               MOVE SPACES     TO TRAK-VEN-CODE
               PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 500
                   IF VCODE(SUB) = RCVTRAK-VEN-CODE
                       MOVE VCODE(SUB) TO TRAK-VEN-CODE
                       MOVE 600        TO SUB
                   END-IF
                   IF VCODE(SUB) = SPACES
                       MOVE 600        TO SUB
                   END-IF
               END-PERFORM
               IF TRAK-VEN-CODE = SPACES
                   GO TO SORT-DBGET.

           IF SELPO
               MOVE RCVTRAK-PO-RCV-NO TO TRAK-PO
               IF TRAK-PO-NO NOT = PO-FRST
                   GO TO SORT-DBGET.

           IF SELPO-R
               MOVE RCVTRAK-PO-RCV-NO TO TRAK-PO
               IF TRAK-PO-NO < VC-FRST OR
                  TRAK-PO-NO > VC-LAST
                   GO TO SORT-DBGET.

           IF SELDATE
               IF S-DATE NOT = RCVTRAK-DLVR-DATE
                   GO TO SORT-DBGET.

           IF SELDATE-R
               IF RCVTRAK-DLVR-DATE < S-DATE OR
                  RCVTRAK-DLVR-DATE > E-DATE
                   GO TO SORT-DBGET.

           MOVE RCVTRAK-EXPECT-DATE    TO SORT-EXP-DATE  CS-DATE.
           MOVE RCVTRAK-DLVR-DATE      TO SORT-DEL-DATE  CE-DATE.
           PERFORM CHECK-E-L-COUNT     THRU CHECK-EXIT.

           IF RCVTRAK-EARLY-DAYS < SORT-E-L-CNT AND
              SORT-E-L = "E"
               GO TO SORT-CONT1.

           IF RCVTRAK-LATE-DAYS < SORT-E-L-CNT AND
              SORT-E-L = "L"
               GO TO SORT-CONT1.

           IF RCVTRAK-EXPD-CARR NOT = SPACE
               GO TO SORT-CONT1.

           GO TO SORT-DBGET.

       SORT-CONT1.
           MOVE RCVTRAK-PO-RCV-NO      TO SORT-PO.
           MOVE RCVTRAK-ITEM-NUMBER    TO SORT-PO-ITM.
           MOVE RCVTRAK-VEN-CODE       TO TRAK-VEN-CODE.

           MOVE TRAK-VEN-CODE  TO VENCDE   OF DVENDOR-REC.
           MOVE "00"           TO VENITMNO OF DVENDOR-REC.
           READ DVENDOR        INTO BUF-DVENDOR
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE TRAK-VEN-CODE TO SORT-VEN-NAME
               GO TO SORT-GET-HIST-VENDOR
           ELSE
               MOVE VEN-NAME   TO SORT-VEN-NAME.

           GO TO SORT-CONT2.

       SORT-GET-HIST-VENDOR.
           MOVE TRAK-VEN-CODE  TO VENCDE   OF DVENDORH-REC.
           MOVE "00"           TO VENITMNO OF DVENDORH-REC.
           READ DVENDORH       INTO BUF-DVENDOR-H
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO SORT-CONT2
           ELSE
               MOVE VENH-NAME  TO SORT-VEN-NAME.

       SORT-CONT2.
           MOVE RCVTRAK-CORP-CODE TO SORT-CORPCODE TRAK-CORP-CODE.
           MOVE "K"            TO CDESC-DESC-OPTION.
           CALL "CDESC" USING  RET-CODE
                               BASE
                               STATUS-AREA
                               BU-DISPLAY-MSG
                               TRAK-CORP-CODE
                               CDESC-DATA.
           IF RET-CODE = "00"
               MOVE CDESC-KWM(1)      TO SORT-KEY-MOD
           ELSE
               MOVE SPACES            TO SORT-KEY-MOD.

           MOVE RCVTRAK-EXPECT-QTY     TO SORT-QTY-EXP.
           MOVE RCVTRAK-EARLY-DAYS     TO SORT-DAYS-EARLY.
           MOVE RCVTRAK-LATE-DAYS      TO SORT-DAYS-LATE.
           MOVE RCVTRAK-CARRIER        TO SORT-CARR-CODE.
           MOVE RCVTRAK-DLVR-QTY       TO SORT-QTY-DEL.
           MOVE RCVTRAK-RCV-RCVR       TO SORT-RCVR-NO.
           MOVE RCVTRAK-ACTION-NEEDED  TO SORT-CORR-ACT.
           MOVE RCVTRAK-EXPD-CARR      TO SORT-EXPD-CARR.
           RELEASE SORT-REC.
           GO TO SORT-DBGET.

       SORT-DBGET-EXIT.        EXIT.

       SORT-DBGET-H.
           MOVE SPACES         TO SORT-REC.
           READ RCV-TRACKING-HIST NEXT INTO BUF-DRCVTRAKH
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT = "10" OR "14" OR "46"
                   GO TO SORT-DBGET-H-EXIT
               ELSE
                   MOVE SPACES TO MESSAGE-BUFFER
                   MOVE
                   "READ ERROR, RCV-TRACKING-HIST/SORT-MAIN FILE-STAT ="
                               TO MSG-TEXT
                   MOVE FILE-STAT TO MSG-FLD
                   DISPLAY MESSAGE-BUFFER
                   GO TO END-OF-JOB.

           IF RCVTRAKH-DLVR-DATE = SPACES
               GO TO SORT-DBGET-H.

           IF SELCODE
               IF VC-FRST NOT = RCVTRAKH-VEN-CODE
                   GO TO SORT-DBGET-H.

           IF SELCODE-R
               IF RCVTRAKH-VEN-CODE < VC-FRST OR
                  RCVTRAKH-VEN-CODE > VC-LAST
                   GO TO SORT-DBGET-H.

           IF SELNAME OR SELALT
               IF TRAK-VEN-CODE NOT = RCVTRAKH-VEN-CODE
                   GO TO SORT-DBGET-H.

           IF SELNAME-R OR SELALT-R
               MOVE SPACES     TO TRAK-VEN-CODE
               PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 500
                   IF VCODE(SUB) = RCVTRAKH-VEN-CODE
                       MOVE VCODE(SUB) TO TRAK-VEN-CODE
                       MOVE 600        TO SUB
                   END-IF
                   IF VCODE(SUB) = SPACES
                       MOVE 600        TO SUB
                   END-IF
               END-PERFORM
               IF TRAK-VEN-CODE = SPACES
                   GO TO SORT-DBGET-H.

           IF SELPO
               MOVE RCVTRAKH-PO-RCV-NO TO TRAK-PO-H
               IF TRAK-PO-NO-H NOT = PO-FRST
                   GO TO SORT-DBGET-H.

           IF SELPO-R
               MOVE RCVTRAKH-PO-RCV-NO TO TRAK-PO-H
               IF TRAK-PO-NO-H < VC-FRST OR
                  TRAK-PO-NO-H > VC-LAST
                   GO TO SORT-DBGET-H.

           IF SELDATE
               IF S-DATE NOT = RCVTRAKH-DLVR-DATE
                   GO TO SORT-DBGET-H.

           IF SELDATE-R
               IF RCVTRAKH-DLVR-DATE < S-DATE OR
                  RCVTRAKH-DLVR-DATE > E-DATE
                   GO TO SORT-DBGET-H.

      ******** FIXED PROBLEM OF BINARY DATE IN HISTORY FIELD.
      **** MOVE RCVTRAKH-EXPECT-DATE    TO SORT-EXP-DATE  CS-DATE.
           MOVE RCVTRAKH-EXPECT-DATE    TO FORMAT-DATE.
           MOVE FORMAT-DATE             TO SORT-EXP-DATE  CS-DATE.
           MOVE RCVTRAKH-DLVR-DATE      TO SORT-DEL-DATE  CE-DATE.
           PERFORM CHECK-E-L-COUNT     THRU CHECK-EXIT.

           IF RCVTRAKH-EARLY-DAYS < SORT-E-L-CNT AND
              SORT-E-L = "E"
               GO TO SORT-CONT1-H.

           IF RCVTRAKH-LATE-DAYS < SORT-E-L-CNT AND
              SORT-E-L = "L"
               GO TO SORT-CONT1-H.

           IF RCVTRAKH-EXPD-CARR NOT = SPACE
               GO TO SORT-CONT1-H.

           GO TO SORT-DBGET-H.

       SORT-CONT1-H.
           MOVE RCVTRAKH-PO-RCV-NO      TO SORT-PO.
           MOVE RCVTRAKH-ITEM-NUMBER    TO SORT-PO-ITM.
           MOVE RCVTRAKH-VEN-CODE       TO TRAK-VEN-CODE.

           MOVE TRAK-VEN-CODE  TO VENCDE   OF DVENDOR-REC.
           MOVE "00"           TO VENITMNO OF DVENDOR-REC.
           READ DVENDOR        INTO BUF-DVENDOR
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE TRAK-VEN-CODE TO SORT-VEN-NAME
               GO TO SORT-GET-HIST-VENDOR-H
           ELSE
               MOVE VEN-NAME   TO SORT-VEN-NAME.

           GO TO SORT-CONT2-H.

       SORT-GET-HIST-VENDOR-H.
           MOVE TRAK-VEN-CODE  TO VENCDE   OF DVENDORH-REC.
           MOVE "00"           TO VENITMNO OF DVENDORH-REC.
           READ DVENDORH       INTO BUF-DVENDOR-H
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO SORT-CONT2-H
           ELSE
               MOVE VENH-NAME  TO SORT-VEN-NAME.

       SORT-CONT2-H.
           MOVE RCVTRAKH-CORP-CODE TO SORT-CORPCODE TRAK-CORP-CODE.
           MOVE "K"            TO CDESC-DESC-OPTION.
           CALL "CDESC" USING  RET-CODE
                               BASE
                               STATUS-AREA
                               BU-DISPLAY-MSG
                               TRAK-CORP-CODE
                               CDESC-DATA.
           IF RET-CODE = "00"
               MOVE CDESC-KWM(1)      TO SORT-KEY-MOD
           ELSE
               MOVE SPACES            TO SORT-KEY-MOD.

           MOVE RCVTRAKH-EXPECT-QTY     TO SORT-QTY-EXP.
           MOVE RCVTRAKH-EARLY-DAYS     TO SORT-DAYS-EARLY.
           MOVE RCVTRAKH-LATE-DAYS      TO SORT-DAYS-LATE.
           MOVE RCVTRAKH-CARRIER        TO SORT-CARR-CODE.
           MOVE RCVTRAKH-DLVR-QTY       TO SORT-QTY-DEL.
           MOVE RCVTRAKH-RCV-RCVR       TO SORT-RCVR-NO.
           MOVE RCVTRAKH-ACTION-NEEDED  TO SORT-CORR-ACT.
           MOVE RCVTRAKH-EXPD-CARR      TO SORT-EXPD-CARR.
           RELEASE SORT-REC.
           GO TO SORT-DBGET-H.

       SORT-DBGET-H-EXIT.        EXIT.

       CHECK-E-L-COUNT.
           MOVE CS-DATE        TO GREG-DATE.
           MOVE SPACES         TO JUL-DATE D-PARM L-PARM.
           CALL "JULGREG"      USING
                               GREG-DATE
                               JUL-DATE
                               D-PARM
                               L-PARM.
           MOVE JULIAN-DATE    TO JUL-EXP.

           MOVE CE-DATE        TO GREG-DATE.
           MOVE SPACES         TO JUL-DATE D-PARM L-PARM.
           CALL "JULGREG"      USING
                               GREG-DATE
                               JUL-DATE
                               D-PARM
                               L-PARM.
           MOVE JULIAN-DATE    TO JUL-DEL.

           IF JE-YEAR = JD-YEAR
               GO TO CHECK-CONT.

           IF JE-YEAR > JD-YEAR
               MOVE JE-DAY     TO JUL-SIGN
               PERFORM UNTIL   JE-YEAR = JD-YEAR
                   ADD 365     TO JUL-SIGN
                   SUBTRACT 1  FROM JE-YEAR
               END-PERFORM
               MOVE JUL-SIGN   TO JE-DAY
               GO TO CHECK-CONT.

           IF JD-YEAR > JE-YEAR
               MOVE JD-DAY     TO JUL-SIGN
               PERFORM UNTIL   JE-YEAR = JD-YEAR
                   ADD 365     TO JUL-SIGN
                   SUBTRACT 1  FROM JD-YEAR
               END-PERFORM
               MOVE JUL-SIGN   TO JD-DAY.

       CHECK-CONT.
           IF JUL-EXP > JUL-DEL
               COMPUTE JUL-E-L = JUL-EXP - JUL-DEL
               MOVE JUL-E-L    TO SORT-E-L-CNT
               MOVE "E"        TO SORT-E-L
               GO TO CHECK-EXIT.

           IF JUL-DEL > JUL-EXP
               COMPUTE JUL-E-L = JUL-DEL - JUL-EXP
               MOVE JUL-E-L    TO SORT-E-L-CNT
               MOVE "L"        TO SORT-E-L
               GO TO CHECK-EXIT.

           MOVE 0              TO SORT-E-L-CNT.
           MOVE " "            TO SORT-E-L.

       CHECK-EXIT.             EXIT.

       SORT-TRK-RECORDS-SECT   SECTION 03.
       SORT-TRK-RECORDS.
           OPEN OUTPUT         OUT-FILE.
           PERFORM SORT-READ-LOOP THRU SORT-RL-EXIT.
           CLOSE               OUT-FILE.

       SORT-READ-LOOP.
           RETURN SORT-FILE    AT END
               GO TO SORT-RL-EXIT.
           ADD 1               TO ACT-KEY.
           MOVE SORT-REC       TO OUT-REC.
           WRITE OUT-REC       INVALID KEY
               DISPLAY "WRITE OUT-FILE ERR"
               GO TO SORT-RL-EXIT.
           GO TO SORT-READ-LOOP.

       SORT-RL-EXIT.           EXIT.

