       IDENTIFICATION DIVISION.
       PROGRAM-ID.     SRCVOPT.
       AUTHOR.         CA YODER.
       INSTALLATION.   THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
       DATE-WRITTEN.   SEPTEMBER 1995.
       DATE-COMPILED.
      *REMARKS.
      **************************************************************
      *                                                            *
      *D   SRCVOPT         RECEIVING MENU PROGRAM                  *
      *                                                            *
      *D    THIS PROGRAM IS USED TO LOAD MISCELLANEOUS             *
      *D    PURCHASING INFORMATION.                                *
      *D                                                           *
      *D    SUBPROGRAMS CALLED :                                   *
      *D                                                           *
      *D           1.  SPCSDKIN  ---  DOCK INFORMATION             *
      *D           2.  SPCSRCVO  ---  RECEIVING USER OPTIONS       *
      *D           3.  TUSERPRT  ---  DOCK PRINTERS                *
      *D                                                           *
      **************************************************************
      *C

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT DISPLAY-FILE
                   ASSIGN TO WORKSTATION-ZSTARTUP-SI
                   ORGANIZATION IS TRANSACTION
                   ACCESS IS SEQUENTIAL
                   FILE STATUS IS DISPLAY-STATUS
                   CONTROL-AREA IS WS-CONTROL.
            SELECT MPLTINFO-O
                   ASSIGN TO DATABASE-MCFLCS0501
                   ORGANIZATION IS INDEXED
                   ACCESS IS DYNAMIC
                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   FILE STATUS IS FILE-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC             PIC X(2000).
       FD  MPLTINFO-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-O-REC.
           COPY DDS-MCRPCS0500 OF MCFLCS0501.

       WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1        PIC X VALUE SPACE.
           05  FILE-STATUS-2        PIC X VALUE SPACE.

       01  INVOICE-IND                   PIC X(1)  VALUE "N" .
           88  INVOICE-IND-ON                      VALUE "Y".
      *************************************************************
      *************************************************************
      **                                                         **
      **              D A T A    B A S E    A R E A              **
      **                                                         **
      *************************************************************
      *************************************************************

       COPY MPLTINFO   IN COPYLIB.
       01  MPLTINFO-ARG                    PIC X(4) VALUE SPACES.
       COPY DBSTAT     IN COPYLIB.
       01  MESSAGE-BUFFER.
           05  MSG-TEXT                    PIC X(64)  VALUE SPACES.
           05  MSG-FLD                     PIC X(12)  VALUE SPACES.
           05  MSG-FLD-9 REDEFINES MSG-FLD
                                           PIC Z(11)9.
      *************************************************************
      *************************************************************
      **                                                         **
      **                 TERMINAL I/O DATA AREA                  **
      **                                                         **
      *************************************************************
      *************************************************************

       01  MAIN-MENU-SCREEN.
           05  DOCK-INFO                 PIC X(1).
           05  DOCK-PRINTER              PIC X(1).
           05  USER-OPTS                 PIC X(1).
           05  MM-CMDLINE                PIC X(79).
           05  MM-MSGLINE                PIC X(79).


       COPY TBLOWUP    IN COPYLIB.
       COPY DISPDATA   IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.
       COPY CATREAD    IN COPYLIB.

      *************************************************************
      *************************************************************
      **                                                         **
      **               LINKAGE   SECTION                         **
      **                                                         **
      *************************************************************
      *************************************************************

       LINKAGE SECTION.
       01  BASE                          PIC X(10).
       COPY VCOMLINK   IN COPYLIB.
       COPY LANGSUB    IN COPYLIB.

      *************************************************************
      **#########################################################**
      *************************************************************
      **                                                         **
      **          P R O C E D U R E    D I V I S I O N           **
      **                                                         **
      *************************************************************
      **#########################################################**
      *************************************************************

       PROCEDURE DIVISION USING BASE,
                                VIEW-COMAREA,
                                LANGUAGE-PARMS.


       MAIN-PGM SECTION 01.

       BEGIN-HERE.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-X.
           PERFORM 2-EOJ.

       1-HSK.
           OPEN I-O DISPLAY-FILE, MPLTINFO-O.
           MOVE "SRCVOPT" TO BU-PGM-NAME.

       2-EOJ.
            CLOSE DISPLAY-FILE, MPLTINFO-O.
            GOBACK.

      ******************************************************
      **                 BLOWUP ROUTINE                   **
      ******************************************************

       2-BLOWUP.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
               BU-DISPLAY-AREA.


      **************************************************
      *                                                *
      *                  6 - M A I N                   *
      *                                                *
      **************************************************

       6-MAIN.
           MOVE "RECV1" TO VIEW-NFNAME.
           MOVE SPACES TO MAIN-MENU-SCREEN.

       6-MAIN-SHOW-FORM.
           MOVE MAIN-MENU-SCREEN TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC      TO MAIN-MENU-SCREEN.
           IF VIEW-LASTKEY = 3
               GO TO 6-MAIN-X.
           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO MM-MSGLINE
               MOVE B"1" TO IND(99)
               GO TO 6-MAIN-SHOW-FORM.

           IF DOCK-INFO = "X"
               CALL "SPCSDKIN" USING BASE, VIEW-COMAREA,
                                 LANGUAGE-PARMS
           ELSE
           IF DOCK-PRINTER = "X"
               CALL "TUSERPRT"
      *        GO TO 6-MAIN-X
           ELSE
           IF USER-OPTS = "X"
               CALL "SPCSRCVO" USING BASE, VIEW-COMAREA,
                                 LANGUAGE-PARMS.

           GO TO 6-MAIN.

       6-MAIN-X.
           EXIT.

       COPY DISPCALL IN COPYLIB.
      *********************************************************
       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.
           EXIT.
