       IDENTIFICATION DIVISION.
       PROGRAM-ID. SRCVTRAK.
         AUTHOR. JEFF BUNGO.
         INSTALLATION. GOODYEAR.
         DATE-WRITTEN. NOVEMBER 20, 1996.
         DATE-COMPILED.
       ENVIRONMENT DIVISION.

      *  ROUTINE TO DISPLAY/ADD/MODIFY THE PO QS9000 TRACKING
      *  SCREEN TO TRACK ON TIME DELIVERIES.
      *

       CONFIGURATION SECTION.
         SOURCE-COMPUTER. AS400.
         OBJECT-COMPUTER. AS400.
         SPECIAL-NAMES.   LOCAL-DATA IS LDA.

       INPUT-OUTPUT SECTION.

       FILE-CONTROL.

           SELECT DRCVTRAK
                  ASSIGN TO DATABASE-MCFLCS6402
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DRCVTRAKH
                  ASSIGN TO DATABASE-MCFLST6402
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DVENDOR
                  ASSIGN TO DATABASE-MCFLCS0701
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DVENDORH
                  ASSIGN TO DATABASE-MCFLST0201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT MSTORERM
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT DPORECD
                  ASSIGN TO DATABASE-MCFLCS0901
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT DPORECDH
                  ASSIGN TO DATABASE-MCFLST0301
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZPURORD-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS DYNAMIC
                  RELATIVE KEY IS SFL-PTR
                  CONTROL-AREA IS TRANSACTION-CONTROL-AREA
                  FILE STATUS IS DISPLAY-STATUS.

       DATA DIVISION.

       FILE SECTION.

       FD  DRCVTRAK
           LABEL RECORDS ARE STANDARD.
       01  DRCVTRAK-REC.
           COPY DDS-MCRPCS6400 OF MCFLCS6402.
       FD  DRCVTRAKH
           LABEL RECORDS ARE STANDARD.
       01  DRCVTRAKH-REC.
           COPY DDS-MCRPST6400 OF MCFLST6402.
       FD  DVENDOR
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-REC.
           COPY DDS-MCRPCS0700 OF MCFLCS0701.
       FD  DVENDORH
           LABEL RECORDS ARE STANDARD.
       01  DVENDORH-REC.
           COPY DDS-MCRPST0200 OF MCFLST0201.
       FD  MSTORERM
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC.
           COPY DDS-MCRPCS0200 OF MCFLCS0201.
       FD  DPORECD
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-REC.
           COPY DDS-MCRPCS0900 OF MCFLCS0901.
       FD  DPORECDH
           LABEL RECORDS ARE STANDARD.
       01  DPORECDH-REC.
           COPY DDS-MCRPST0300 OF MCFLST0301.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                      PIC X(2000).

       WORKING-STORAGE SECTION.
       01  TOTAL-CHECK-QTY                  PIC 9(8)V9(4).

       01  FORMAT-DATE                      PIC 9(8).

       01  BUF-SCREEN.
           05  BUF-PO                       PIC X(13).
           05  BUF-ITEM                     PIC X(4).
           05  BUF-VENDOR-NAME              PIC X(44).
           05  BUF-CORP-CODE                PIC X(8).
           05  BUF-KWRD-MOD                 PIC X(50).
           05  BUF-DATE-FMT                 PIC X(3).
           05  BUF-SFL.
               10  BUF-EXPECT-QTY           PIC 9(8)V9(4).
               10  BUF-EXPECT-DATE          PIC X(8).
               10  BUF-EARLY-DAYS           PIC 9(4).
               10  BUF-LATE-DAYS            PIC 9(4).
               10  BUF-CARRIER              PIC X(4).
               10  BUF-DLVR-DATE            PIC X(8).
               10  BUF-DLVR-QTY             PIC 9(8)V9(4).
               10  BUF-RCVR                 PIC X(3).
               10  BUF-ACTION               PIC X(1).
               10  BUF-SEQNO                PIC 9(4).

       01  BUF-LINES.
           05  BUF-LINE1                    PIC X(78).
           05  BUF-LINE2                    PIC X(79).

       01  EDIT-QTY-MSG.
           05  FILLER                       PIC X(21)
                                          VALUE "ENTERED QUANTITIES OF".
           05  EDIT-CHECK-QTY               PIC Z(7)9.9999.
           05  FILLER                       PIC X(30)
                                 VALUE " GREATER THAN ITEM QUANTITY OF".
           05  EDIT-ITEM-QTY                PIC Z(7)9.9999.
           05  FILLER                       PIC X(2) VALUE SPACES.

       01  LAST-SEQNO                       PIC 9(4).
       01  RET-CODE                         PIC X(2).
       01  BASE                             PIC X(10).

       01  EDIT-CHECK                       PIC 1 VALUE B"0".
           88  EDIT-ERR                           VALUE B"1".
           88  NO-EDIT-ERR                        VALUE B"0".

      ********************************************************
      *                                                      *
      *       TRANSACTION FILE CONTROL AREA                  *
      *                                                      *
      ********************************************************

       01  TRANSACTION-CONTROL-AREA.
           05  COMMAND-KEY         PIC XX.
               88  ROLL-UP         VALUE "90".
               88  ROLL-DOWN       VALUE "91".
               88  PRINT           VALUE "92".
               88  HELP            VALUE "93".
           05  TERMINAL-ID         PIC X(10).
           05  ACTIVE-RECORD       PIC X(10).
      ********************************************************
      *                                                      *
      *           FILE STATUS                                *
      *                                                      *
      ********************************************************

       01  FILE-STATUS-WORDS.
           05  FILE-STATUS              PIC XX  VALUE "00".
               88  NO-FILE-ERR              VALUE "00".
               88  EOF                      VALUE "10".
               88  DUPLICATE-KEY            VALUE "22".
               88  NO-RECORD-FOUND          VALUE "23".
           05  DISPLAY-STATUS           PIC XX  VALUE "00".
               88  NO-MODIFIED-RECORD       VALUE "12".
               88  NO-SFLREC-FOUND          VALUE "23".
               88  LAST-SFLREC-WRITTEN      VALUE "9M".

       01  SFL-PTR                  PIC 9999 VALUE 0.

       01  SRF-INDICATORS.
           05  IND                  PIC 1 OCCURS 99 TIMES
                                          INDICATOR 1.
               88  IND-OFF                VALUE B"0".
               88  IND-ON                 VALUE B"1".

       COPY MSTORERM OF COPYLIB.
       COPY DRCVTRAK OF COPYLIB.
       COPY DRCVTRAKH OF COPYLIB.
       COPY DVENDOR OF COPYLIB.
       COPY DVENDORH OF COPYLIB.
       COPY DPORECD OF COPYLIB.
       COPY DPORECDH OF COPYLIB.
       COPY CDESC OF COPYLIB.
       COPY TDATECHK OF COPYLIB.
       COPY DBSTAT OF COPYLIB.
       COPY TBLOWUP OF COPYLIB.
       COPY LANGSUB OF COPYLIB.
       COPY VCOMLINK OF COPYLIB.

       LINKAGE SECTION.
       01  TRAK-PO.
           05  FILLER            PIC X(1).
           05  TRAK-PONUM        PIC X(13).
       01  TRAK-PO-HISTORY REDEFINES TRAK-PO.
           05  TRAK-PONUM-HISTORY PIC X(13).
           05  FILLER            PIC X(1).
       01  TRAK-ITEM             PIC X(4).
       01  TRAK-VEN-CODE         PIC X(10).
       01  TRAK-CORP-CODE        PIC X(8).
       01  TRAK-FUNCTION         PIC X(1).
       01  TOTAL-ITEM-QTY        PIC 9(8)V9(4).

       PROCEDURE DIVISION USING TRAK-PO TRAK-ITEM
                 TRAK-VEN-CODE TRAK-CORP-CODE
                 TRAK-FUNCTION TOTAL-ITEM-QTY.

       MAIN-PROGRAM SECTION.

           PERFORM 010-HOUSEKEEPING THRU 010-EXIT.
           PERFORM 100-MAIN THRU 100-MAIN-X
              UNTIL COMMAND-KEY = "03"
           PERFORM 020-END-OF-JOB THRU 020-EXIT.
           GOBACK.

       010-HOUSEKEEPING.
           OPEN I-O DISPLAY-FILE.
           IF TRAK-FUNCTION NOT = "H"
               OPEN I-O DRCVTRAK
           ELSE
               OPEN I-O DRCVTRAKH.
           MOVE ZEROS TO LAST-SEQNO.
           INITIALIZE BUF-SCREEN.
           INITIALIZE BUF-LINES.
           MOVE ALL B"0" TO SRF-INDICATORS.
           IF TRAK-FUNCTION = "D" OR "H"
               SET IND-ON(1) TO TRUE
           ELSE
               SET IND-OFF(1) TO TRUE.

           IF TRAK-CORP-CODE = SPACES
               MOVE "NON-STR" TO TRAK-CORP-CODE.

           IF TRAK-FUNCTION NOT = "H"
               MOVE TRAK-PONUM TO BUF-PO
           ELSE
               MOVE TRAK-PONUM-HISTORY TO BUF-PO.
           MOVE TRAK-ITEM  TO BUF-ITEM.
           MOVE TRAK-CORP-CODE TO BUF-CORP-CODE.

      *-----SET DATE FORMAT LITERAL
           MOVE 1                  TO  DATE-MODE.
           CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
           IF DATE-CODE = 1
              MOVE "MDY" TO BUF-DATE-FMT
           ELSE
              MOVE "DMY" TO BUF-DATE-FMT.
           IF TRAK-FUNCTION = "D" OR "H"
              MOVE "F3-EXIT   PAGE UP   PAGE DOWN" TO BUF-LINE1
           ELSE
           MOVE "F3-EXIT  F9-ADD RECORD  ENTER-SAVE  PAGE UP  PAGE DOWN"
                 TO BUF-LINE1.

      *------GET VENDOR NAME
      *------GET VENDOR CODE IF DISPLAY SINCE IT CANNOT BE PASSED.
           IF TRAK-FUNCTION NOT = "H"
               IF TRAK-FUNCTION = "D"
                   OPEN INPUT DPORECD
                   MOVE TRAK-PO TO PORCVNO OF DPORECD-REC
                   READ DPORECD INTO BUF-DPORECD
                   MOVE PO-VEN-CODE TO TRAK-VEN-CODE
                   CLOSE DPORECD
               END-IF
               OPEN INPUT DVENDOR
               MOVE TRAK-VEN-CODE TO VENCDE OF DVENDOR-REC
               MOVE "00" TO VENITMNO OF DVENDOR-REC
               READ DVENDOR INTO BUF-DVENDOR
               IF FILE-STATUS NOT = "00"
                   MOVE TRAK-VEN-CODE TO BUF-VENDOR-NAME
               ELSE
                   MOVE VEN-NAME      TO BUF-VENDOR-NAME
               END-IF
               CLOSE DVENDOR
           ELSE
               OPEN INPUT DPORECDH
               MOVE TRAK-PO TO PORCVNO OF DPORECDH-REC
               READ DPORECDH INTO BUF-DPORECD-H
               MOVE POH-VEN-CODE TO TRAK-VEN-CODE
               CLOSE DPORECDH
               OPEN INPUT DVENDORH
               MOVE TRAK-VEN-CODE TO VENCDE OF DVENDORH-REC
               MOVE "00" TO VENITMNO OF DVENDORH-REC
               READ DVENDORH INTO BUF-DVENDOR-H
               IF FILE-STATUS NOT = "00"
                   MOVE TRAK-VEN-CODE TO BUF-VENDOR-NAME
               ELSE
                   MOVE VENH-NAME     TO BUF-VENDOR-NAME
               END-IF
               CLOSE DVENDORH
           END-IF.

      *-----GET KEYWORD MODIFIER
           MOVE "K" TO CDESC-DESC-OPTION.
           CALL "CDESC" USING RET-CODE BASE STATUS-AREA
                              BU-DISPLAY-MSG TRAK-CORP-CODE
                              CDESC-DATA.
           IF RET-CODE = "00"
               MOVE CDESC-KWM(1)      TO BUF-KWRD-MOD
           ELSE
               MOVE SPACES            TO BUF-KWRD-MOD.

      *-----GET DEFAULT EARLY/LATE DAYS FROM MSTORERM
           IF TRAK-FUNCTION NOT = "D" OR NOT = "H"
               IF TRAK-CORP-CODE NOT = "NON-STR"
                   OPEN INPUT MSTORERM
                   MOVE TRAK-CORP-CODE TO CORPCDE OF MSTORERM-REC
                   READ MSTORERM INTO BUF-MSTORERM
                   IF FILE-STATUS NOT = "00"
                       MOVE "READ MSTORERM ERROR" TO BU-DISPLAY-MSG
                       PERFORM 999-BLOWUP THRU 999-EXIT
                   END-IF
                   CLOSE MSTORERM.

           MOVE ZEROS TO FILE-STATUS
                         DISPLAY-STATUS
                         COMMAND-KEY.
       010-EXIT.
           EXIT.

       020-END-OF-JOB.
           CLOSE DISPLAY-FILE
           IF TRAK-FUNCTION NOT = "H"
               CLOSE DRCVTRAK
           ELSE
               CLOSE DRCVTRAKH.
       020-EXIT.
           EXIT.

       100-MAIN.
           PERFORM 900-CLEAR-SUB-FILE THRU 900-EXIT.
           PERFORM 200-START-DRCVTRAK THRU 200-EXIT.
           IF FILE-STATUS NOT = "00"
               IF TRAK-FUNCTION NOT = "D" AND TRAK-FUNCTION NOT = "H"
                   INITIALIZE BUF-SFL
                   IF TRAK-CORP-CODE NOT = "NON-STR"
                       IF STR-QS9000-EARLY-DAYS NUMERIC
                          MOVE STR-QS9000-EARLY-DAYS TO BUF-EARLY-DAYS
                       END-IF
                       IF STR-QS9000-LATE-DAYS NUMERIC
                          MOVE STR-QS9000-LATE-DAYS TO BUF-LATE-DAYS
                       END-IF
                   END-IF
                   PERFORM 910-WRITE-SFL-REC THRU 910-EXIT
                     15 TIMES
               ELSE
                  MOVE "NO TRACKING RECORDS EXIST FOR THIS ITEM"
                     TO BUF-LINE2
                  SET IND-ON(99) TO TRUE
                  INITIALIZE BUF-SFL
                  PERFORM 910-WRITE-SFL-REC THRU 910-EXIT
              END-IF
           ELSE
               MOVE ZEROS TO SFL-PTR
               PERFORM 105-GET-TRAK-RECORDS THRU 105-GTR-X
                   UNTIL EOF
               IF EOF AND SFL-PTR = 0
                   INITIALIZE BUF-SFL
                   IF TRAK-CORP-CODE NOT = "NON-STR"
                       IF STR-QS9000-EARLY-DAYS NUMERIC
                          MOVE STR-QS9000-EARLY-DAYS TO BUF-EARLY-DAYS
                       END-IF
                       IF STR-QS9000-LATE-DAYS NUMERIC
                          MOVE STR-QS9000-LATE-DAYS TO BUF-LATE-DAYS
                       END-IF
                   END-IF
                   PERFORM 910-WRITE-SFL-REC THRU 910-EXIT
                     15 TIMES
               END-IF
           END-IF.
       SHOW-SCREEN.
           PERFORM 110-SHOW-SCREEN THRU 110-SS-X.
           IF TRAK-FUNCTION = "D" OR "H"
               OR DISPLAY-STATUS NOT = "00"
               MOVE "03" TO COMMAND-KEY
               GO TO 100-MAIN-X.
           IF COMMAND-KEY = "03"
               MOVE ZERO TO TOTAL-CHECK-QTY
               PERFORM 140-EDIT-TOTALS THRU 140-EXIT
               IF TOTAL-CHECK-QTY > TOTAL-ITEM-QTY
                   MOVE TOTAL-ITEM-QTY TO EDIT-ITEM-QTY
                   MOVE TOTAL-CHECK-QTY TO EDIT-CHECK-QTY
                   MOVE EDIT-QTY-MSG TO BUF-LINE2
                   SET IND-ON(99) TO TRUE
                   SET EDIT-ERR TO TRUE
                   GO TO SHOW-SCREEN
               ELSE
                   GO TO 100-MAIN-X.
           IF COMMAND-KEY = "09"
               INITIALIZE BUF-SFL
               IF TRAK-CORP-CODE NOT = "NON-STR"
                   IF STR-QS9000-EARLY-DAYS NUMERIC
                      MOVE STR-QS9000-EARLY-DAYS TO BUF-EARLY-DAYS
                   END-IF
                   IF STR-QS9000-LATE-DAYS NUMERIC
                      MOVE STR-QS9000-LATE-DAYS TO BUF-LATE-DAYS
                   END-IF
               END-IF
               PERFORM 910-WRITE-SFL-REC THRU 910-EXIT
               GO TO SHOW-SCREEN.
           SET NO-EDIT-ERR TO TRUE.
           PERFORM 120-PROCESS-SFL THRU 120-PS-X
             UNTIL NO-MODIFIED-RECORD.
           IF EDIT-ERR
               GO TO SHOW-SCREEN
           END-IF.
       100-MAIN-X.
           EXIT.

       105-GET-TRAK-RECORDS.
           PERFORM 205-READ-NEXT-DRCVTRAK THRU 205-EXIT.
           IF EOF
              IF (TRAK-FUNCTION = "D" OR "H") AND SFL-PTR = 0
                  MOVE "NO TRACKING RECORDS EXIST FOR THIS ITEM"
                     TO BUF-LINE2
                  SET IND-ON(99) TO TRUE
                  INITIALIZE BUF-SFL
                  PERFORM 910-WRITE-SFL-REC THRU 910-EXIT
              END-IF
              GO TO 105-GTR-X.
           IF NO-FILE-ERR
               NEXT SENTENCE
           ELSE
               PERFORM 999-BLOWUP THRU 999-EXIT.
           INITIALIZE BUF-SFL.
           MOVE RCVTRAK-EXPECT-QTY TO BUF-EXPECT-QTY.
           MOVE RCVTRAK-EXPECT-YMD TO DATE-VALIDATE-IN.
           MOVE 4                  TO  DATE-MODE.
           CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
           MOVE DATE-SLASH-OUT     TO BUF-EXPECT-DATE.
           MOVE RCVTRAK-EARLY-DAYS TO BUF-EARLY-DAYS.
           MOVE RCVTRAK-LATE-DAYS  TO BUF-LATE-DAYS.
           MOVE RCVTRAK-RCV-RCVR   TO BUF-RCVR.
           MOVE RCVTRAK-CARRIER    TO BUF-CARRIER.
           MOVE RCVTRAK-DLVR-QTY   TO BUF-DLVR-QTY.
           MOVE RCVTRAK-DLVR-YMD   TO DATE-VALIDATE-IN.
           MOVE 4                  TO  DATE-MODE.
           CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
           MOVE DATE-SLASH-OUT     TO BUF-DLVR-DATE.
           MOVE RCVTRAK-ACTION-NEEDED TO BUF-ACTION.
           MOVE RCVTRAK-SEQNO      TO BUF-SEQNO LAST-SEQNO.
           PERFORM 910-WRITE-SFL-REC THRU 910-EXIT.
       105-GTR-X.
           EXIT.

       110-SHOW-SCREEN.
           WRITE DISPLAY-REC FROM BUF-LINES
              FORMAT IS "TRACKFUNC"
              INDICATORS ARE SRF-INDICATORS.
           MOVE SPACES TO BUF-LINE2.
           SET IND-ON(70) TO TRUE.
           SET IND-ON(71) TO TRUE.
           SET IND-OFF(72) TO TRUE.
           SET IND-ON(73) TO TRUE.
           WRITE SUBFILE DISPLAY-REC FROM BUF-SCREEN
             FORMAT IS "TRACKSFLC"
             INDICATORS ARE SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "ERROR ON SHOW SFL WRITE " TO BU-DISPLAY-MSG
               MOVE DISPLAY-STATUS TO FILE-STATUS
               PERFORM 999-BLOWUP THRU 999-EXIT.
           MOVE ALL B"0" TO SRF-INDICATORS.
           SET IND-ON(70) TO TRUE.
           SET IND-ON(71) TO TRUE.
           SET IND-OFF(72) TO TRUE.
           SET IND-ON(73) TO TRUE.
           READ DISPLAY-FILE
              FORMAT IS "TRACKSFLC"
              INDICATORS ARE SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "ERROR ON SHOW SFL READ " TO BU-DISPLAY-MSG
               MOVE DISPLAY-STATUS TO FILE-STATUS
               PERFORM 999-BLOWUP THRU 999-EXIT.
       110-SS-X.
           EXIT.

       120-PROCESS-SFL.
           READ SUBFILE DISPLAY-FILE
             NEXT MODIFIED RECORD
                INTO BUF-SFL
                FORMAT IS "TRACKSFL"
                INDICATORS ARE SRF-INDICATORS.
           IF NO-MODIFIED-RECORD
              NEXT SENTENCE
           ELSE
              IF DISPLAY-STATUS NOT = "00"
                 SET NO-MODIFIED-RECORD TO TRUE
              ELSE
                  PERFORM 130-PROCESS-SFL-REC THRU 130-PSR-X.
       120-PS-X.
           EXIT.

       130-PROCESS-SFL-REC.
           MOVE TRAK-PO TO PORCVNO OF DRCVTRAK.
           MOVE TRAK-ITEM TO ITEMNO OF DRCVTRAK.
           MOVE BUF-SEQNO TO SEQNO OF DRCVTRAK.
           READ DRCVTRAK INTO BUF-DRCVTRAK.
           IF FILE-STATUS NOT = "00"
            IF BUF-EXPECT-DATE > SPACES
               INITIALIZE BUF-DRCVTRAK
               MOVE TRAK-PO        TO RCVTRAK-PO-RCV-NO
               MOVE TRAK-ITEM      TO RCVTRAK-ITEM-NUMBER
               ADD 1 TO LAST-SEQNO
               MOVE LAST-SEQNO     TO RCVTRAK-SEQNO
               MOVE TRAK-VEN-CODE  TO RCVTRAK-VEN-CODE
               MOVE TRAK-CORP-CODE TO RCVTRAK-CORP-CODE
               IF BUF-EXPECT-QTY NOT NUMERIC
                   MOVE ZEROS          TO RCVTRAK-EXPECT-QTY
               ELSE
                   MOVE BUF-EXPECT-QTY TO RCVTRAK-EXPECT-QTY
               END-IF
               MOVE BUF-EXPECT-DATE TO DATE-VALIDATE-IN
               MOVE 3              TO  DATE-MODE
               CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
               IF DATE-RET-CODE NOT = 0
                  MOVE "DATE FORMAT IS INVALID" TO BUF-LINE2
                  SET IND-ON(99) TO TRUE
                  SET EDIT-ERR TO TRUE
                  GO TO 130-PSR-X
               END-IF
               MOVE DATE-YMD-OUT   TO RCVTRAK-EXPECT-YMD
               IF RCVTRAK-EXPECT-YY > "70"
                   MOVE "19" TO RCVTRAK-EXPECT-CN
               ELSE
                   MOVE "20" TO RCVTRAK-EXPECT-CN
               END-IF
               IF BUF-EARLY-DAYS NOT NUMERIC
                   MOVE ZEROS          TO RCVTRAK-EARLY-DAYS
               ELSE
                   MOVE BUF-EARLY-DAYS TO RCVTRAK-EARLY-DAYS
               END-IF
               IF BUF-LATE-DAYS NOT NUMERIC
                   MOVE ZEROS          TO RCVTRAK-LATE-DAYS
               ELSE
                   MOVE BUF-LATE-DAYS  TO RCVTRAK-LATE-DAYS
               END-IF
               MOVE BUF-ACTION     TO RCVTRAK-ACTION-NEEDED
               WRITE DRCVTRAK-REC FROM BUF-DRCVTRAK
               IF FILE-STATUS NOT = "00"
                  MOVE "ERROR ON WRITE TO DRCVTRAK" TO BU-DISPLAY-MSG
                  PERFORM 999-BLOWUP THRU 999-EXIT
               END-IF
             END-IF
           ELSE
            IF BUF-EXPECT-DATE > SPACES
               IF BUF-EXPECT-QTY NOT NUMERIC
                   MOVE ZEROS          TO RCVTRAK-EXPECT-QTY
               ELSE
                   MOVE BUF-EXPECT-QTY TO RCVTRAK-EXPECT-QTY
               END-IF
               MOVE BUF-EXPECT-DATE TO DATE-VALIDATE-IN
               MOVE 3              TO  DATE-MODE
               CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
               IF DATE-RET-CODE NOT = 0
                  MOVE "DATE FORMAT IS INVALID" TO BUF-LINE2
                  SET IND-ON(99) TO TRUE
                  SET EDIT-ERR TO TRUE
                  GO TO 130-PSR-X
               END-IF
               MOVE DATE-YMD-OUT   TO RCVTRAK-EXPECT-YMD
               IF RCVTRAK-EXPECT-YY > "70"
                   MOVE "19" TO RCVTRAK-EXPECT-CN
               ELSE
                   MOVE "20" TO RCVTRAK-EXPECT-CN
               END-IF
               IF BUF-EARLY-DAYS NOT NUMERIC
                   MOVE ZEROS          TO RCVTRAK-EARLY-DAYS
               ELSE
                   MOVE BUF-EARLY-DAYS TO RCVTRAK-EARLY-DAYS
               END-IF
               IF BUF-EARLY-DAYS NOT NUMERIC
                   MOVE ZEROS          TO RCVTRAK-EARLY-DAYS
               ELSE
                   MOVE BUF-LATE-DAYS  TO RCVTRAK-LATE-DAYS
               END-IF
               MOVE BUF-ACTION     TO RCVTRAK-ACTION-NEEDED
               REWRITE DRCVTRAK-REC FROM BUF-DRCVTRAK
               IF FILE-STATUS NOT = "00"
                  MOVE "ERROR ON REWRITE TO DRCVTRAK" TO BU-DISPLAY-MSG
                  PERFORM 999-BLOWUP THRU 999-EXIT
               END-IF
            ELSE
               DELETE DRCVTRAK
               IF FILE-STATUS NOT = "00"
                  MOVE "ERROR ON DELETE OF DRCVTRAK" TO BU-DISPLAY-MSG
                  PERFORM 999-BLOWUP THRU 999-EXIT
               END-IF
            END-IF
           END-IF.
       130-PSR-X.
           EXIT.

       140-EDIT-TOTALS.
           PERFORM 200-START-DRCVTRAK THRU 200-EXIT.
           IF FILE-STATUS = "00"
               PERFORM 141-CALC-CHECK-QTY THRU 141-EXIT
                  UNTIL EOF.
       140-EXIT.
           EXIT.

       141-CALC-CHECK-QTY.
           PERFORM 205-READ-NEXT-DRCVTRAK THRU 205-EXIT.
           IF NOT EOF
               ADD RCVTRAK-EXPECT-QTY TO TOTAL-CHECK-QTY.
       141-EXIT.
           EXIT.

       200-START-DRCVTRAK.
           IF TRAK-FUNCTION NOT = "H"
               MOVE TRAK-PO TO PORCVNO OF DRCVTRAK-REC
               MOVE TRAK-ITEM TO ITEMNO OF DRCVTRAK-REC
               MOVE ZEROS TO SEQNO OF DRCVTRAK-REC
               START DRCVTRAK KEY NOT < EXTERNALLY-DESCRIBED-KEY
                  INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-START
           ELSE
               MOVE TRAK-PO TO PORCVNO OF DRCVTRAKH-REC
               MOVE TRAK-ITEM TO ITMNO OF DRCVTRAKH-REC
               MOVE ZEROS TO SEQNO OF DRCVTRAKH-REC
               START DRCVTRAKH KEY NOT < EXTERNALLY-DESCRIBED-KEY
                  INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-START
           END-IF.
       200-EXIT.
           EXIT.

       205-READ-NEXT-DRCVTRAK.
           IF TRAK-FUNCTION NOT = "H"
               READ DRCVTRAK NEXT INTO BUF-DRCVTRAK
               END-READ
               IF NO-FILE-ERR
                  IF RCVTRAK-PO-RCV-NO = TRAK-PO AND
                     RCVTRAK-ITEM-NUMBER = TRAK-ITEM
                      NEXT SENTENCE
                  ELSE
                     SET EOF TO TRUE
                  END-IF
               ELSE
                  MOVE "ERROR READ NEXT DRCVTRAK" TO BU-DISPLAY-MSG
               END-IF
           ELSE
               READ DRCVTRAKH NEXT INTO BUF-DRCVTRAKH
               END-READ
               IF NO-FILE-ERR
                  IF RCVTRAKH-PO-RCV-NO = TRAK-PO AND
                     RCVTRAKH-ITEM-NUMBER = TRAK-ITEM
                      PERFORM 300-MOVE-HISTORY THRU 300-EXIT
                  ELSE
                     SET EOF TO TRUE
                  END-IF
               ELSE
                  MOVE "ERROR READ NEXT HIST DRCVTRAK" TO BU-DISPLAY-MSG
               END-IF
           END-IF.
       205-EXIT.
           EXIT.

       300-MOVE-HISTORY.
           MOVE TRAK-PO                TO  RCVTRAK-PO-RCV-NO.
           MOVE RCVTRAKH-ITEM-NUMBER   TO  RCVTRAK-ITEM-NUMBER.
           MOVE RCVTRAKH-SEQNO         TO  RCVTRAK-SEQNO.
           MOVE RCVTRAKH-VEN-CODE      TO  RCVTRAK-VEN-CODE.
           MOVE RCVTRAKH-CORP-CODE     TO  RCVTRAK-CORP-CODE.
           MOVE RCVTRAKH-EXPECT-QTY    TO  RCVTRAK-EXPECT-QTY.
           MOVE RCVTRAKH-EXPECT-DATE   TO  RCVTRAK-EXPECT-DATE.
           MOVE RCVTRAKH-EXPECT-DATE   TO  FORMAT-DATE.
           IF FORMAT-DATE = ZEROES
               MOVE SPACES             TO  RCVTRAK-EXPECT-DATE
           ELSE
               MOVE FORMAT-DATE        TO  RCVTRAK-EXPECT-DATE
           END-IF.
           MOVE RCVTRAKH-EARLY-DAYS    TO  RCVTRAK-EARLY-DAYS
           MOVE RCVTRAKH-LATE-DAYS     TO  RCVTRAK-LATE-DAYS.
           MOVE RCVTRAKH-RCV-SLIP      TO  RCVTRAK-RCV-SLIP.
           MOVE RCVTRAKH-CARRIER       TO  RCVTRAK-CARRIER.
           MOVE RCVTRAKH-DLVR-QTY      TO  RCVTRAK-DLVR-QTY.
           MOVE RCVTRAKH-DLVR-DATE     TO  RCVTRAK-DLVR-DATE.
           MOVE RCVTRAKH-CORRECTIVE-ACTION TO RCVTRAKH-CORRECTIVE-ACTION.
           MOVE RCVTRAKH-ALREADY-REPORTED TO RCVTRAKH-ALREADY-REPORTED.
       300-EXIT.
           EXIT.

       900-CLEAR-SUB-FILE.
           SET IND-ON (71) TO TRUE.
           SET IND-ON (72) TO TRUE.
           SET IND-OFF(73) TO TRUE.
           WRITE SUBFILE DISPLAY-REC FROM BUF-SCREEN
              FORMAT IS "TRACKSFLC"
              INDICATORS ARE SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
              MOVE "PROBLEM ON INIT SFL WRITE " TO BU-DISPLAY-MSG
              MOVE DISPLAY-STATUS TO FILE-STATUS
              PERFORM 999-BLOWUP THRU 999-EXIT.
           SET IND-OFF(72) TO TRUE.
       900-EXIT.
           EXIT.

       910-WRITE-SFL-REC.
           ADD 1 TO SFL-PTR.
           WRITE SUBFILE DISPLAY-REC
                 FROM BUF-SFL
                 FORMAT IS "TRACKSFL"
                 INDICATORS ARE SRF-INDICATORS.
       910-EXIT.
           EXIT.

       999-BLOWUP.
           MOVE "SRCVTRAK"               TO  BU-PGM-NAME.
           MOVE TRAK-PO                  TO  BU-DISPLAY-FLD (1).
           MOVE TRAK-ITEM                TO  BU-DISPLAY-FLD (2).
           MOVE TRAK-CORP-CODE           TO  BU-DISPLAY-FLD (3).
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
                 VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                 BU-DISPLAY-FLDS.
       999-EXIT.
           EXIT.
