000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    SREQMAN.
000400 AUTHOR.        KURT MOVSESIAN/JIM COFFMAN (MAINTAINER).
000600
000700*C    THIS PROGRAM ALLOWS THE USER TO PUT A MANUAL REQUEST
000800*C    FOR A CORP-CODE INTO THE MREQFILE DATA SET SO THE NEXT
000900*C    TIME THE REQ. CREATE PROGRAM IS RAN A REQ WILL BE CUT
001000*C    WITH THE CORP CODE ENTERED.
001100*C    ON FEB 14, 1983 A SECOND OPTION WAS ADDED ALLOW THE USER
001200*C    TO ENTER A CODE AND HAVE A REQUISITION NUMBER ASSIGNED AT
001300*C    THIS TIME BYPASSING THE MREQFILE DATA SET AND 'MA1'.
      *C
      *C    AUG 23, 1994  JE COFFMAN  WRITTEN REQUEST 94-001/SLS REQ 6487
      *C    ADDED THE ABILITY ON CORPORATE CODES FLAGGED WITH THE
      *C    AUTHORIZATION FLAG TO USE THE STOREROOM DEFAULT DEPARTMENT
      *C    INSTEAD OF THE SYSTEM DEPARTMENT TO DEFAULT TO.
      *C
      *C    AUG 28, 1995  CA YODER    REQ #95-022
      *C    CHANGED THE CALCULATION FOR DATE WANTED.  INSTEAD OF USING THE
      *C    SHIP TIME, THE AVERAGE OF THE 3 LEAD TIMES ARE USED TO OBTAIN
      *C    DATE WANTED.  SHIP TIME IS USED TO CALCULATE THE SHIP DATE NOT
      *C    THE DATE WANTED.
      *C
      *C    DEC  7, 1995  JE COFFMAN
      *C    ADDED THE ABILITY TO SET A FLAG IN THE MREQ BUFFER WHENEVER
      *C    LEAD TIMES WERE USED TO CALCULATE THE DATE WANTED FIELD. THE
      *C    MATERIALS CONTROL USERS IN NAPANEE REQUESTED THIS CHANGE SO
      *C    THAT WHEN THEY ARE PROCESSING THE REQ VIA MA2 THE DATE WANTED
      *C    FIELD COULD APPEAR AS A FLASHING FIELD TO SIGNAL THAT THEY
      *C    SHOULD NOT OVERRIDE IT.
      *C
      *C    JUN 18, 1996   CA YODER
      *C    MODIFIED FOR CENTURY DATABASE CHANGES.
      *C
      *C    FEB 1, 1999    JE COFFMAN
      *C    ADDED LOGIC TO INDICATE THAT A REQUISITION MIGHT BE AWAITING
      *C    APPROVALS FOR A CODED ITEM. TED DUNAY IN LAWTON THOUGHT THIS
      *C    MIGHT HELP THE MATERIALS CONTROL PERSON TO KNOW WHAT HE
      *C    SHOULD DO REGARDING REOREDERING.
      *C
008800
008900
009000 ENVIRONMENT DIVISION.
009100 CONFIGURATION SECTION.
009200 SOURCE-COMPUTER.  HP-3000.
009300 OBJECT-COMPUTER.  HP-3000.
009400
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
009500
009600 INPUT-OUTPUT SECTION.
026000 FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZREQUPDT-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

           SELECT MPLTINFO-O
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MREQ-O
                  ASSIGN TO DATABASE-MCFLCS2001
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-O
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MREQFILE-O
                  ASSIGN TO DATABASE-MCFLCS2801
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DREQITM-O
                  ASSIGN TO DATABASE-MCFLCS2202
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
026200
026300 DATA DIVISION.
026400 FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC               PIC X(2000).

       FD  MPLTINFO-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLCS0501.

       FD  MREQ-O
           LABEL RECORDS ARE STANDARD.
       01  MREQ-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLCS2001.

       FD  MSTORERM-O
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLCS0201.

       FD  MREQFILE-O
           LABEL RECORDS ARE STANDARD.
       01  MREQFILE-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLCS2801.

       FD  DREQITM-O
           LABEL RECORDS ARE STANDARD.
       01  DREQITM-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLCS2202.

010200 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
010300 77  SAVE-QTY-TO-ORD         PIC 9(6)   VALUE ZEROS.
010400 77  TODAYS-JULIAN           PIC S9(4)  COMP-4 VALUE ZEROS.
010500 77  DATE-WANTED-JULIAN      PIC S9(4)  COMP-4 VALUE ZEROS.
010600 77  J-CURRENT-YY            PIC S9(4)  COMP-4 VALUE ZEROS.
010700 77  SAVE-CORP-CODE          PIC X(7)   VALUE SPACES.
010800 77  SUB1                    PIC S9(4)  COMP-4 VALUE ZEROS.
010900 77  SUB2                    PIC S9(4)  COMP-4 VALUE ZEROS.
011000 77  COMPANY-SAVE            PIC X(3)        VALUE SPACES.
011100 77  PRIME-SAVE              PIC X(3)        VALUE SPACES.
011200 77  STOREROOM-SAVE          PIC X(4)        VALUE SPACES.
011400 77  LEAD-TIME               PIC S9(4)  COMP-4 VALUE ZEROS.
011500 77  SUB                     PIC S9(4)  COMP-4 VALUE ZEROS.
011600 77  NO-OF-DLV               PIC S9(4)  COMP-4 VALUE ZEROS.
011700 77  TOTAL-DLV-TIME          PIC S9(4)  COMP-4 VALUE ZEROS.
       77  SAVE-AUTH-FLAG          PIC X.
       77  SAVE-PDER-SW            PIC X.
011800
011900
012000*****************************
012100*                           *
012200*   E.O.Q. FIELDS           *
012300*                           *
012400*****************************
012500
012600 01  EOQ-FIELDS.
012700     05  EOQ-CARRY-COST       PIC S9V9(2)     VALUE ZEROS COMP-4.
012800     05  EOQ-ORDER-COST       PIC S9(6)       VALUE ZEROS COMP-4.
012900     05  EOQ-TWICE-ORDER-COST PIC S9(7)       VALUE ZEROS COMP-4.
013000     05  EOQ-ANNUAL-USAGE     PIC S9(10)      VALUE ZEROS COMP-4.
013100     05  EOQ-NUMERATOR        PIC S9(17)      VALUE ZEROS COMP-4.
013200     05  EOQ-DENOMINATOR      PIC S9(11)V9(4) VALUE ZEROS COMP-4.
013300     05  EOQ-UNIT-COST        PIC S9(11)V9(4) VALUE ZEROS COMP-4.
013400     05  EOQ-SQ               PIC S9(14)V9(4) VALUE ZEROS COMP-4.
013500     05  EOQ-SQ-ROOT          PIC S9(8)       VALUE ZEROS COMP-4.
013600
013700**********************
013800*                    *
013900*  S W I T C H E S   *
014000*                    *
014100**********************
014200
014300 01  SWITCH-AREA.
014400     05  FATAL-ERR-SW            PIC X       VALUE "N".
014500     05  ERR-SW                  PIC X       VALUE "N".
014600     05  OPEN-REQ-MSG-SW         PIC X       VALUE "N".
014700         88  MSG-WRITTEN-ONCE                VALUE "Y".
014800     05  OPEN-REQ-SW             PIC X       VALUE "N".
014900         88  OPEN-REQ                        VALUE "Y".
015000     05  CALC-DATE-WANTED-SW     PIC X       VALUE SPACES.
015100         88  DONT-CALC-DATE-WANTED           VALUE "N".
015200
015300
015400 01  DATES-AND-TIMES.
015500     05  CUR-DATE-CN.
               10  CUR-DATE-CC      PIC XX.
               10  CUR-DATE-YMD.
015600             15  CUR-DATE-YY  PIC XX.
015700             15  CUR-DATE-MM  PIC XX.
015800             15  CUR-DATE-DD  PIC XX.
015900         10  CUR-DATE-9  REDEFINES  CUR-DATE-YMD.
016000             15  YY-9         PIC 99.
016100             15  MM-9         PIC 99.
016200             15  DD-9         PIC 99.
016900
           05  HOLD-DATE-CN.
               10  HOLD-DATE-CC       PIC XX.
               10  HOLD-DATE-YMD.
                   15  HOLD-DATE-YY   PIC XX.
                   15  HOLD-DATE-MM   PIC XX.
                   15  HOLD-DATE-DD   PIC XX.
018100
       01  PASSED-PARAMETERS.
           05  LEAD-TIMES          OCCURS 3 TIMES    PIC 9(4).
           05  SHIP-TIME             PIC 9(4).
           05  EXPECT-DATE           PIC X(6).

018200 01  BUILD-REQ-NO.
018300     05  REQ-NO  OCCURS 6 TIMES  PIC X.
018500
018600 01  MESSAGE-BUFFER.
018700     05  MSG-TEXT              PIC X(68)    VALUE SPACE.
018800     05  MSG-FLD               PIC X(8)     VALUE SPACE.
018900     05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC ZZZZZZZ9.
019000     05  EXTEND-TO-79-CHARA    PIC X(4)     VALUE SPACE.
019100
019800 01  FIELD-NUMBER              PIC S9(4)    VALUE 1    COMP-4.
020200
020300 01  SCREEN-1.
020400     05  SCREEN-CORP-CODE        PIC X(7).
020500     05  SCREEN-CREATE-REQ       PIC X.
020600     05  SCREEN-UPDATE-REQFILE   PIC X.
020700     05  MSG-LINE-1              PIC X(80).
020800     05  MSG-LINE-2              PIC X(80).
           05  DE1-COMMAND-LINE        PIC X(79).
           05  DE1-MESSAGE-LINE        PIC X(79).
020900
021000 01  REQ-MSG-LINE1.
021100     05  FILLER  PIC X(16).
021200     05  CORP-CODE-OUT  PIC X(7).
021300     05  FILLER  PIC X(40).
021400     05  REQ-NO-OUT  PIC X(6).
021500     05  FILLER  PIC X(10).
021600
021700 01  OPEN-REQ-MSG1.
021800     05  FILLER  PIC X(11).
021900     05  OPEN-REQ-OUT PIC X(11).
022000     05  FILLER  PIC X(13).
022100     05  AREA-OUT  PIC X(17).
022200     05  FILLER  PIC X(12).
022300     05  STATUS-OUT  PIC X(10).
022400     05  FILLER  PIC X(5).

       COPY DISPDATA IN COPYLIB.

       COPY IOFEEDBACK IN COPYLIB.

       COPY CATREAD IN COPYLIB.

       COPY TDATECHK IN COPYLIB.
022700
022800**************************************************************
022900**************************************************************
023000**                                                          **
023100**                DATABASE I/O BUFFER AREA                  **
023200**                                                          **
023300**************************************************************
023400**************************************************************
023500
023600 COPY MSTORERM IN COPYLIB.
023700
023800 COPY MREQFILE IN COPYLIB.
023900
024000 COPY MREQ IN COPYLIB.
024100
024200 COPY DREQITM IN COPYLIB.
024300
024400 COPY MPLTINFO IN COPYLIB.
024600
024700*********************
024800*                   *
024900*   DATA SET NAMES  *
025000*                   *
025100*********************
025200
025300 01  DSET-NAMES.
025400     05  DSET-MSTORERM          PIC X(16)  VALUE "MSTORERM;".
025500     05  DSET-MREQ              PIC X(16)  VALUE "MREQ;".
025600     05  DSET-DREQITM           PIC X(16)  VALUE "DREQITM;".
025700     05  DSET-MPLTINFO          PIC X(16)  VALUE "MPLTINFO;".
025800     05  DSET-MREQFILE          PIC X(16)  VALUE "MREQFILE;".
025900
026000 COPY DBSTAT IN COPYLIB.
026100
026200 COPY DBMODES IN COPYLIB.
026300
027100 01 ITEMS-LISTING.
027200     05  ALL-ITEMS              PIC XX    VALUE "@;".
027300     05  CODE-SEARCH            PIC X(10) VALUE "CORP-CODE;".
027400
027500 01 ARG-VALUES.
027600     05  REQ-ARG                PIC X(12) VALUE SPACES.
027700     05  CODE-ARG               PIC X(8)  VALUE SPACES.
027800     05  PLT-ARG                PIC X(4)  VALUE SPACES.
028200
028300 COPY TBLOWUP IN COPYLIB.
028600
028700 LINKAGE SECTION.
028800
028900 01  BASE             PIC X(10).
029000
029100 COPY VCOMLINK IN COPYLIB.
029200
029300**************************************
029400*                                    *
029500*  PRINTCNTL IS SET TO 1 THIS CAUSES *
029600*  THE FIELD ON A SCREEN PRINTOUT    *
029700*  TO BE UNDERLINED                  *
029800*                                    *
029900*  PAGECNTL IS SET TO 49 (OCTAL 61)  *
030000*  THIS CAUSE THE LP TO EJECT AFTER  *
030100*  THE SCREEN IS PRINTED             *
030200*                                    *
030300**************************************
030400
030500 01  SCREEN-PRINT-PARMS.
030600     05  PRINTCNTL             PIC S9(4)    COMP-4.
030700     05  PAGECNTL              PIC S9(4)    COMP-4.
030800     05  SPOOLFIL-OPEN-SW      PIC X.
030900
031000 01  PASSED-SPOOL-PRT          PIC S9(2)    COMP-4.
031100
031200 COPY LANGSUB IN COPYLIB.
031400
031500
031600 PROCEDURE DIVISION USING  BASE,
031700                           VIEW-COMAREA,
031800                           SCREEN-PRINT-PARMS,
031900                           PASSED-SPOOL-PRT,
032000                           LANGUAGE-PARMS.
032100
032200
032300 MANUAL-REQ-CREATE SECTION.
       BEGIN.
032400     PERFORM 1-HSK THRU 1-H-X.
032500
032600     PERFORM 6-MAIN THRU 6-M-X.

           CLOSE DISPLAY-FILE, MPLTINFO-O, MSTORERM-O, MREQFILE-O,
                 MREQ-O, DREQITM-O.
032700
032800     GOBACK.
032900
033000
033100 1-HSK.
           OPEN I-O DISPLAY-FILE, MPLTINFO-O, MSTORERM-O, MREQFILE-O,
                    MREQ-O, DREQITM-O.

033200     MOVE   3 TO LANG-SETNUM.
033300     MOVE  18 TO LANG-MSGNUM.
033400     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
033500     MOVE MESSAGE-BUFFER TO REQ-MSG-LINE1.
033600     MOVE  66 TO LANG-SETNUM.
033700     MOVE 221 TO LANG-MSGNUM.
033800     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
033900     MOVE MESSAGE-BUFFER TO OPEN-REQ-MSG1.
034000
034100
034200**********************************************
034300*    RETRIEVE PDER-SW FROM PLANT STARTUP     *
034400*    USER ROUTINES TO DETERMINE IF PROGRAM   *
034500*    IS TO CARRYOVER DEPT AND EXPENSE CLASS  *
034600*    ON REQUISITION CREATES                  *
034700**********************************************
034800
           MOVE "Y"            TO  SAVE-PDER-SW.
034900     MOVE "PDER"         TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-O.
           READ MPLTINFO-O INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
035300         MOVE "MPLTINFO FAILED *SREQMAN*" TO BU-DISPLAY-MSG
035400         GO TO 2-BLOWUP.
035500     MOVE MPLTINFO-PDER-SW  TO  SAVE-PDER-SW.
035700
034200**********************************************
034300*                                            *
034400*    DO DBGET MPLTINFO WITH  "P 01" =        *
034500*    PLTINFO-KEY TO GET PLANT CODE           *
034600*                                            *
034700**********************************************
034800
034900     MOVE "P 01"         TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-O.
           READ MPLTINFO-O INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
035300         MOVE "MPLTINFO FAILED P 01" TO BU-DISPLAY-MSG
035400         GO TO 2-BLOWUP.
035500     MOVE MPLTINFO-COMPANY  TO  COMPANY-SAVE.
035600     MOVE MPLTINFO-PRIME    TO  PRIME-SAVE.
035700
035800**************************************************
035900*                                                *
036000*   GET STOREROOM FROM MPLTINFO USING 'P 03'     *
036100*   AS THE ARGUMENT IT IS USED TO PRINT ON REQ   *
036200*                                                *
036300**************************************************
036400
036500     MOVE "P 03"  TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-O.
           READ MPLTINFO-O INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
037000             MOVE SPACES  TO  STOREROOM-SAVE
037100         ELSE
037200         MOVE "DBGET MPLTINFO 1-HSK"  TO  BU-DISPLAY-MSG
037300         MOVE PLT-ARG               TO BU-DISPLAY-FLD (3)
037400         GO TO 2-BLOWUP
037500     ELSE
037600     MOVE MPLTINFO-STOREROOM  TO  STOREROOM-SAVE.
037700
037800*********************************************
037900*                                           *
038000*  DO DBGET MPLTINFO WITH "P 20" =          *
038100*  PLTINFO-KEY TO GET THE ORDERING COST     *
038200*  AND CARRYING COST FOR EOQ CALCULATIONS   *
038300*                                           *
038400*********************************************
038500
038600     MOVE "P 20"         TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-O.
           READ MPLTINFO-O INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
039000         MOVE "GET MPLTINFO *1-HSK" TO  BU-DISPLAY-MSG
039100         MOVE PLT-ARG               TO  BU-DISPLAY-FLD (2)
039200         GO TO 2-BLOWUP.
039300
039400     MOVE MPLTINFO-CARRY-COST  TO  EOQ-CARRY-COST.
039500     IF EOQ-CARRY-COST = ZEROS
039600         MOVE 0.30             TO  EOQ-CARRY-COST.
039700     IF MPLTINFO-EXP-ORDER-COST NUMERIC
039800         MOVE MPLTINFO-EXP-ORDER-COST  TO  EOQ-ORDER-COST
039900     ELSE
040000         MOVE MPLTINFO-ORDER-COST      TO  EOQ-ORDER-COST
040100         PERFORM 11-MOVE-MPLTINFO-ORDER-COST  THRU  11-MMOC-X.
040200
040300     ACCEPT CUR-DATE-YMD       FROM DATE.
      *---------- ACCOUNT FOR CENTURY.
           IF CUR-DATE-YY > "70"
               MOVE "19"             TO  CUR-DATE-CC
           ELSE
               MOVE "20"             TO  CUR-DATE-CC.

      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO PLTINFOKEY OF MPLTINFO-REC-O.
           START MPLTINFO-O KEY > PLTINFOKEY OF MPLTINFO-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.
042400 1-H-X.
042500     EXIT.
042600
042700****************************************************
042800**  THIS IS A TEMPORARY ROUTINE THAT MOVES
042900**  ORDERING COSTS FROM A 2 BYTE FIELD TO A 6
043000**  BYTE FIELD ON THE SAME RECORD IN MPLTINFO
043100**  THIS WAS NEEDED SINCE ORDERING COSTS IS TOO
043200**  SMALL
043300****************************************************
043400
043500 11-MOVE-MPLTINFO-ORDER-COST.
044600     MOVE MPLTINFO-ORDER-COST     TO  MPLTINFO-EXP-ORDER-COST.
044700     MOVE ZEROS                   TO  MPLTINFO-ORDER-COST.
           REWRITE MPLTINFO-REC-O FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
045100         MOVE "UPDATE MPLTINFO * 11-MMOC" TO BU-DISPLAY-MSG
045200         GO TO 2-BLOWUP.
045300
046000 11-MMOC-X.
046100     EXIT.
046200
046300*********************************************
046400*                                           *
046500*  BLOWUP ROUTINE EXECUTES WHENEVER A       *
046600*  FATAL ERROR OCCURS                       *
046700*                                           *
046800*********************************************
046900
047000 2-BLOWUP.
047100     MOVE "SREQMAN"               TO  BU-PGM-NAME.
047200     MOVE CODE-ARG                TO  BU-DISPLAY-FLD (1).
047300     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
047400         VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
047500                 BU-DISPLAY-FLDS.
047600
047700 2-BLOWUP-X.
047800     EXIT.
047900
050800
050900 4-PGM-ERROR.
           MOVE B"1" TO IND (FIELD-NUMBER), IND (99).
           MOVE MESSAGE-BUFFER TO DE1-MESSAGE-LINE.
051300
051800 4-PGM-ERROR-X.
051900     EXIT.
052000
054200
054300***************************
054400*                         *
054500*  M A I N                *
054600*                         *
054700***************************
054800
054900 6-MAIN.
055000     MOVE "REQMAN1"   TO  VIEW-NFNAME.
           MOVE SPACES      TO SCREEN-1.
057000
057100 6-SHOWFORM-SCREEN-1.
           MOVE SCREEN-1       TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC    TO SCREEN-1.
058900
059000     IF VIEW-LASTKEY = 3
059100         GO TO 6-M-X
059200     ELSE
060600     IF VIEW-LASTKEY = 1 OR
060700        VIEW-LASTKEY = 2 OR
060800        VIEW-LASTKEY = 4 OR
060900        VIEW-LASTKEY = 5 OR
060900        VIEW-LASTKEY = 6 OR
061000        VIEW-LASTKEY = 7 OR
061100        VIEW-LASTKEY = 8
061300*        "INVALID FUNCTION KEY ENTERED"
061400         MOVE   9 TO LANG-SETNUM
061500         MOVE  10 TO LANG-MSGNUM
061600         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
061700         MOVE 1  TO  FIELD-NUMBER
061800         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
061900         GO TO 6-SHOWFORM-SCREEN-1.
064000
      *------ FIELD EDITS

           IF SCREEN-CORP-CODE = SPACES
      *          YOU MUST ENTER A CORPORATE CODE
               MOVE 66170 TO CATREAD-MSG-NUMBER
069800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
069900         MOVE 1  TO FIELD-NUMBER
070000         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
070100         GO TO 6-SHOWFORM-SCREEN-1.

           IF SCREEN-CREATE-REQ = SPACES  AND
              SCREEN-UPDATE-REQFILE = SPACES
      *         YOU MUST CHOOSE AN OPTION
               MOVE 66218 TO CATREAD-MSG-NUMBER
069800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
069900         MOVE 2  TO FIELD-NUMBER
070000         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
070100         GO TO 6-SHOWFORM-SCREEN-1.

           IF SCREEN-CREATE-REQ NOT = SPACES AND
              SCREEN-UPDATE-REQFILE NOT = SPACES
      *         SELECT ONLY ONE OPTION
               MOVE 66140 TO CATREAD-MSG-NUMBER
069800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
069900         MOVE 3  TO FIELD-NUMBER
070000         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
070100         GO TO 6-SHOWFORM-SCREEN-1.

064100*************************************************
064200*                                               *
064300*   EDIT CHECK CORP CODE FOR VALID CORP CODE    *
064400*                                               *
064500*************************************************
064600
           MOVE SPACES            TO  SAVE-AUTH-FLAG.
064700     MOVE SCREEN-CORP-CODE  TO  CODE-ARG.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC-O.
           READ MSTORERM-O INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
065200*            "STORES CODE DOES NOT EXIST"
065300             MOVE  19 TO LANG-SETNUM
065400             MOVE   9 TO LANG-MSGNUM
065500             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
065600             MOVE MESSAGE-BUFFER TO MSG-TEXT
065700             MOVE SCREEN-CORP-CODE  TO  MSG-FLD
065800             MOVE 1  TO  FIELD-NUMBER
065900             PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
066000             GO TO 6-SHOWFORM-SCREEN-1
066100         ELSE
066200             MOVE "GET MSTORERM 62-BR" TO BU-DISPLAY-MSG
066300             GO TO 2-BLOWUP.
066400
           MOVE STR-AUTH-FLAG TO SAVE-AUTH-FLAG.

      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO CORPCDE OF MSTORERM-REC-O.
           START MSTORERM-O KEY > CORPCDE OF MSTORERM-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

066500     IF SAVE-CORP-CODE  NOT =  SCREEN-CORP-CODE
066600         MOVE "N"                   TO  OPEN-REQ-MSG-SW
066700         MOVE SCREEN-CORP-CODE      TO  SAVE-CORP-CODE.
066800
066900     IF MSG-WRITTEN-ONCE
067000         MOVE "N"                   TO  OPEN-REQ-MSG-SW
067100     ELSE
067200         PERFORM 63-CHECK-FOR-OPEN-REQ  THRU  63-CFOR-X
067300         IF OPEN-REQ
067400             GO TO 6-SHOWFORM-SCREEN-1.
067500
067600
264900*    *** NOW PROCESSING ***
265000     MOVE  14 TO LANG-SETNUM.
265100     MOVE   2 TO LANG-MSGNUM.
265200     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO DE1-COMMAND-LINE.
265300     MOVE B"1" TO IND (98).
265400     PERFORM 998-WRITE-SCREEN.
265500     PERFORM 998-AUTO-READ-SCREEN.
070400
070500**************************************************
070600*                                                *
070700*   IF THE CREATE A REQ OPTION WAS CHOSEN        *
070800*   (SCREEN-CREATE-REQ = X) THEN BUILD THE REQ   *
070900*   AND PUT IT OUT IN THE DATA BASE OTHERWISE    *
071000*   UPDATE THE 'MREQFILE' DATA SET WITH THE CODE *
071100*                                                *
071200**************************************************
071300
071400     MOVE "N"                     TO  ERR-SW
071500     IF SCREEN-CREATE-REQ = "X"
071600         PERFORM 62-BUILD-REQ THRU 62-BR-X
071700     ELSE
071800         PERFORM 61-UPDATE-REQFILE  THRU  61-UR-X.
071900
072000
072700**********************************************************
072800**   IF ERR-SW = "Y" THIS MEANS THAT DURING THE BUILD
072900**   OF A REQ (62-BUILD-REQ) A DUPLICATE KEY WAS FOUND
073000**   WHEN TRYING TO CREATE A REQ. WHICH MEANS THAT MA1
073100**   WAS RUNNING AT THE TIME AND SINCE IT DIDNT UPDATE
073200**   LAST REQ NO IN MPLTINFO 'PREQ' YET THIS ONLINE
073300**   PROGRAM GOT A COND = 43 ON A DBPUT OF MREQ. A MESSAGE
073400**   IS PRINTED ON THE SCREEN THAT STATES THE USER
073500**   CANNOT RUN MA3 WHILE MA1 IS RUNNING
073600**********************************************************
073700
073800     IF ERR-SW = "Y"
073900         GO TO 6-SHOWFORM-SCREEN-1.
074000
074100     IF SCREEN-CREATE-REQ = "X"
074200         PERFORM 63-WRITE-REQ-CREATE-MSG  THRU  63-WRCM-X
074300     ELSE
074400         MOVE SPACES  TO  SCREEN-1.
075100
075300*    "ENTER NEXT STORES CODE"
075400     MOVE   5 TO LANG-SETNUM.
075500     MOVE  14 TO LANG-MSGNUM.
075600     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO DE1-COMMAND-LINE.
265300     MOVE B"1" TO IND (98).
265400     PERFORM 998-WRITE-SCREEN.
265500     PERFORM 998-AUTO-READ-SCREEN.
075800     GO TO 6-SHOWFORM-SCREEN-1.
075900
076000 6-M-X.
076100     EXIT.
076200
076300
076400
076500**************************************************
076600*                                                *
076700*   THIS ROUTINE DOES THE UPDATE TO THE          *
076800*   MREQFILE DATA SET.                           *
076900*                                                *
077000**************************************************
077100
077200 61-UPDATE-REQFILE.
078900
079000**************************************************
079100*                                                *
079200*   PUT THE CODE OUT IN 'MREQFILE' WITH THE      *
079300*   RETURN SW SET TO 'M' SO THAT THE STOREROOM   *
079400*   PROGRAMS DO NOT DELETE THIS CODE FROM THE    *
079500*   FILE SINCE THIS IS A INDIVIDUAL REQUEST AND  *
079600*   SHOULD NOT BE DELETED. IF THE CODE IS        *
079700*   ALREADY OUT THERE DO A 'UPDATE' BEING SURE   *
079800*   TO MOVE 'M' IN THE RETURN SW                 *
079900*                                                *
080000**************************************************

080300     MOVE SCREEN-CORP-CODE     TO  CODE-ARG.
           MOVE CODE-ARG TO CORPCDE OF MREQFILE-REC-O.
           READ MREQFILE-O INTO BUF-MREQFILE
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
080600     IF FILE-STATUS = "00"
081000         PERFORM 611-UPDATE-MREQFILE
081100     ELSE
081200     IF FILE-STATUS-1 = "2"
081300         PERFORM 611-PUT-MREQFILE
081400     ELSE
081500         MOVE "GET MREQFILE 61-GM" TO BU-DISPLAY-MSG
081600         GO TO 2-BLOWUP.
081700
082500 61-UR-X.
082600     EXIT.
082700
082800 611-UPDATE-MREQFILE.
082900     MOVE "M"            TO  MREQFILE-REQ-STATUS.
           REWRITE MREQFILE-REC-O FROM BUF-MREQFILE
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
083300         MOVE "UPDATE MREQFILE * 611-UM" TO BU-DISPLAY-MSG
083400         GO TO 2-BLOWUP.
083500
083600 611-PUT-MREQFILE.
083700     MOVE SPACES            TO  BUF-MREQFILE.
083800     MOVE SCREEN-CORP-CODE  TO  MREQFILE-CORP-CODE.
083900     MOVE "M"               TO  MREQFILE-REQ-STATUS.
           WRITE MREQFILE-REC-O FROM BUF-MREQFILE
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
084300         MOVE "PUT MREQFILE * 611-PM"  TO  BU-DISPLAY-MSG
084400         GO TO 2-BLOWUP.
084600
084700
084800************************************************
084900*                                              *
085000*   THIS ROUTINE CREATES A REQUISITION IN      *
085100*   IN THE DATA BASE BY PASSING WRITING THE    *
085200*   CODE TO THE 'MREQFILE' DATA SET FOR        *
085300*   PROCESSING LATER BY MA1                    *
085400*                                              *
085500************************************************
085600
085700 62-BUILD-REQ.
085800     PERFORM 621-GET-LAST-REQ-AND-UPDATE THRU 621-GLRAU-X.
085900
087500**********************************************
087600*                                            *
087700*  PUT AN ENTRY IN MREQ AND UNLOCK MREQ      *
087800*                                            *
087900**********************************************
088000
088100 62-BUILD-MREQ.
088200     MOVE SPACES                  TO  BUF-MREQ.
088300     MOVE BUILD-REQ-NO            TO  MREQ-NUMBER.
088400     MOVE "SS"                    TO  REQ-STATUS.
088500     MOVE CUR-DATE-CN             TO  REQ-DATE-CN.
088600     MOVE ZEROS                   TO  REQ-BUDGET-AMT.
088700     IF COMPANY-SAVE = "111" OR "112" OR "113" OR
088800                       "115" OR "119" OR "114"
088900         IF STR-CLASS = "355" OR "358" OR "359"
089000             MOVE SPACES           TO  REQ-CO,
089100                                       REQ-PRIME,
089200                                       REQ-SUB,
089300                                       REQ-SUBD,
089400                                       REQ-ADDTL-DATA
089500         ELSE
089600         IF STR-DIR-CHRG-DEPT = SPACES
089700             MOVE "111"            TO  REQ-CO
089800             MOVE "901"            TO  REQ-SUB
089900             MOVE STR-CLASS        TO  REQ-SUBD
090000             MOVE "099880"         TO  REQ-ADDTL-DATA
090100             IF STR-CLASS = "222" OR "204" OR "223"
090200                 MOVE "135"        TO  REQ-PRIME
090300             ELSE
090400                 MOVE "136"        TO  REQ-PRIME
090500         ELSE
090600             MOVE "111"            TO  REQ-CO
090700             MOVE "135"            TO  REQ-PRIME
090800             MOVE "948"            TO  REQ-SUB
090900             MOVE STR-DIR-CHRG-DEPT  TO  REQ-SUBD
091000             MOVE STR-EXPENSE-CLASS  TO  REQ-ADDTL-DATA
091100     ELSE
           IF COMPANY-SAVE = "118"
               MOVE "182"                TO  REQ-CO
               MOVE "175"                TO  REQ-PRIME
               MOVE STR-CLASS            TO  REQ-SUB
               MOVE "910 "               TO  REQ-SUBD
               MOVE "000000"             TO  REQ-ADDTL-DATA
           ELSE
           IF SAVE-PDER-SW = "N"
               IF COMPANY-SAVE = "658"
                   MOVE "158"            TO  REQ-CO
                   MOVE "120"            TO  REQ-PRIME
                   MOVE STR-CLASS        TO  REQ-SUB
                   MOVE "0921"           TO  REQ-SUBD
                   MOVE "000000"         TO  REQ-ADDTL-DATA
               ELSE
               IF COMPANY-SAVE = "648"
                   MOVE "148"            TO  REQ-CO
                   MOVE "120"            TO  REQ-PRIME
                   MOVE STR-CLASS        TO  REQ-SUB
                   MOVE "000000"         TO  REQ-ADDTL-DATA
091600             IF STR-DIR-CHRG-DEPT  =  SPACES
091700                 MOVE STOREROOM-SAVE   TO  REQ-SUBD
091800             ELSE
091900             MOVE STR-DIR-CHRG-DEPT  TO  REQ-SUBD
               ELSE
               IF COMPANY-SAVE = "645"
                   MOVE "145"            TO  REQ-CO
                   MOVE "120"            TO  REQ-PRIME
                   MOVE STR-CLASS        TO  REQ-SUB
                   MOVE "000000"         TO  REQ-ADDTL-DATA
091600             IF STR-DIR-CHRG-DEPT  =  SPACES
091700                 MOVE STOREROOM-SAVE   TO  REQ-SUBD
091800             ELSE
091900             MOVE STR-DIR-CHRG-DEPT  TO  REQ-SUBD
               ELSE
               IF COMPANY-SAVE = "622"
                   MOVE "122"            TO  REQ-CO
                   MOVE "120"            TO  REQ-PRIME
                   MOVE STR-CLASS        TO  REQ-SUB
                   MOVE "000000"         TO  REQ-ADDTL-DATA
091600             IF STR-DIR-CHRG-DEPT  =  SPACES
091700                 MOVE STOREROOM-SAVE   TO  REQ-SUBD
091800             ELSE
091900             MOVE STR-DIR-CHRG-DEPT  TO  REQ-SUBD
               ELSE
091200         MOVE COMPANY-SAVE         TO  REQ-CO
091300         MOVE PRIME-SAVE           TO  REQ-PRIME
091400         MOVE STR-CLASS            TO  REQ-SUB
091500         MOVE STR-EXPENSE-CLASS    TO  REQ-ADDTL-DATA
091600         IF STR-DIR-CHRG-DEPT  =  SPACES
091700             MOVE STOREROOM-SAVE   TO  REQ-SUBD
091800         ELSE
091900             MOVE STR-DIR-CHRG-DEPT  TO  REQ-SUBD
           ELSE
           IF SAVE-AUTH-FLAG = "X"
091200         MOVE COMPANY-SAVE         TO  REQ-CO
091300         MOVE PRIME-SAVE           TO  REQ-PRIME
091400         MOVE STR-CLASS            TO  REQ-SUB
091500         MOVE STR-EXPENSE-CLASS    TO  REQ-ADDTL-DATA
               MOVE STR-DFLT-DEPT        TO  REQ-AUTH-APPVL-DEPT
091600         IF STR-DIR-CHRG-DEPT  =  SPACES
091700             MOVE STOREROOM-SAVE   TO  REQ-SUBD
                                             REQ-FOR-DEPT
                   IF COMPANY-SAVE = "129"
                       MOVE STOREROOM-SAVE TO REQ-AUTH-APPVL-DEPT
                   ELSE
                   NEXT SENTENCE
091800         ELSE
091900         MOVE STR-DIR-CHRG-DEPT    TO  REQ-SUBD
                                             REQ-FOR-DEPT
               IF COMPANY-SAVE = "129"
                   MOVE STR-DIR-CHRG-DEPT TO REQ-AUTH-APPVL-DEPT
               ELSE
               NEXT SENTENCE
           ELSE
091200     MOVE COMPANY-SAVE             TO  REQ-CO
091300     MOVE PRIME-SAVE               TO  REQ-PRIME
091400     MOVE STR-CLASS                TO  REQ-SUB
091500     MOVE STR-EXPENSE-CLASS        TO  REQ-ADDTL-DATA
091600     IF STR-DIR-CHRG-DEPT  =  SPACES
091700         MOVE STOREROOM-SAVE       TO  REQ-SUBD
091800     ELSE
091900     MOVE STR-DIR-CHRG-DEPT        TO  REQ-SUBD.
092100
092200**************************************************
092300*                                                *
092400*   COMPUTE DATE WANTED USING STR-EST-LT         *
092500*                                                *
092600**************************************************
092700
092800 62-COMPUTE-DATE-WANTED.
092900*********************************************
093000**   IF THE USER DOESNT WANT DATE WANTED
093100**   CALCULATED THEN SKIP THE CALCULATION
093200*********************************************
           IF DONT-CALC-DATE-WANTED
               GO TO 62-PUT-MREQ.

      *------ MOVE LEAD TIMES FOR SUBPROGRAM.
           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 3
               MOVE STR-LAST-DLVTIMES (SUB) TO LEAD-TIMES (SUB)
           END-PERFORM.
           MOVE STR-EST-LT   TO SHIP-TIME.
           MOVE SPACES       TO EXPECT-DATE.

           CALL "SCALCEDT" USING PASSED-PARAMETERS.
           MOVE 4                 TO  DATE-MODE.
           MOVE EXPECT-DATE       TO  DATE-VALIDATE-IN.
           CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
           MOVE DATE-YMD-OUT      TO  HOLD-DATE-YMD.
      *--------- ACCOUNT FOR CENTURY.
           IF HOLD-DATE-YY > "70"
               MOVE "19"          TO  HOLD-DATE-CC
           ELSE
               MOVE "20"          TO  HOLD-DATE-CC.

           MOVE HOLD-DATE-CN  TO REQ-DATE-WANTED-CN.
           IF STR-EST-LT > 0
               MOVE "X"       TO REQ-DATE-WANT-FLAG.

      *------ DELETED LOGIC TO CALCULATE DATE WANTED; NOW PERFORMED
      *------ IN SCALCEDT.
096100
096200 62-PUT-MREQ.
           WRITE MREQ-REC-O FROM BUF-MREQ
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
096600         IF FILE-STATUS-1 = "2"
096700*             "CANNOT RUN (MA3) WHILE (MA1) IS RUNNING"
096800             MOVE  3              TO  LANG-SETNUM
096900             MOVE  98             TO  LANG-MSGNUM
097000             PERFORM 999-CATREAD  THRU  999-CATREAD-EXIT
097100             MOVE 1               TO  FIELD-NUMBER
097200             PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
097300             MOVE "Y"             TO  ERR-SW
097500             GO TO 62-BR-X
097600         ELSE
097700             MOVE "PUT MREQ * 62-BM" TO BU-DISPLAY-MSG
097800             MOVE MREQ-NUMBER          TO  BU-DISPLAY-FLD (2)
097900             GO TO 2-BLOWUP.
100800
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC-O.
           READ MSTORERM-O INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
101200         MOVE "DBGET MSTORERM 62-BUILD-MREQ" TO BU-DISPLAY-MSG
101300         GO TO 2-BLOWUP.
101400
101500**********************************************
101600*                                            *
101700*  CALCULATE SUGGESTED QTY TO ORDER          *
101800*    1) USE STR-SOQ ( IF THAT IS NOT         *
101900*       AVAILABLE)                          *
102000*    2) USE (STR-MAX  -  STR-EXPEDITE  =     *
102100*       QTY-TO-ORDER                         *
102200*                                            *
102300**********************************************
102400
102500 62-COMPUTE-QTY-ORDERED.
102600     IF STR-SOQ  =  ZEROS
102700         NEXT SENTENCE
102800     ELSE
102900         MOVE STR-SOQ  TO  SAVE-QTY-TO-ORD
103000         GO TO 62-BUILD-DREQITM.
103100     SUBTRACT STR-EXPEDITE  FROM  STR-MAX
103200         GIVING SAVE-QTY-TO-ORD.
103300     IF SAVE-QTY-TO-ORD = ZEROS
103400         MOVE STR-EXPEDITE  TO  SAVE-QTY-TO-ORD.
103500
103600********************************************
103700*                                          *
103800*  BUILD DREQITM                           *
103900*                                          *
104000********************************************
104100
104200 62-BUILD-DREQITM.
104300     MOVE SPACES                  TO  BUF-DREQITM.
           MOVE 0                       TO  REQITM-UNIT-PRICE-CURR.
104400     MOVE SAVE-QTY-TO-ORD         TO  REQITM-QTY-TO-ORD.
104500     MOVE SCREEN-CORP-CODE        TO  REQITM-CORP-CODE.
104600     MOVE STR-UM                  TO  REQITM-UM.
104700     MOVE BUILD-REQ-NO            TO  REQITM-REQ-NUMBER.
           IF SAVE-AUTH-FLAG = "X"
               MOVE STR-MKT-COST        TO  REQITM-UNIT-PRICE
               MULTIPLY REQITM-QTY-TO-ORD BY REQITM-UNIT-PRICE
                   GIVING REQITM-BUDGET-AMT ROUNDED
           ELSE
104800     MOVE ZEROS                   TO  REQITM-UNIT-PRICE,
104900                                      REQITM-BUDGET-AMT.
           WRITE DREQITM-REC-O FROM BUF-DREQITM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
105300         MOVE "PUT DREQITM 62-BUILD-DREQITM" TO BU-DISPLAY-MSG
105400         GO TO 2-BLOWUP.
105500
105600***********************************
105700*                                 *
105800*  COMPUTE EOQ                    *
105900*                                 *
106000***********************************
106100
106200 62-COMPUTE-EOQ.
106300     IF STR-MTH-FCST > 0
106400         NEXT SENTENCE
106500     ELSE
106600         GO TO 62-UPDATE-MSTORERM.
106700
106800     MULTIPLY STR-MTH-FCST          BY
106900              12                    GIVING EOQ-ANNUAL-USAGE.
107000
107100     MULTIPLY EOQ-ORDER-COST        BY
107200              2                     GIVING EOQ-TWICE-ORDER-COST.
107300
107400     MULTIPLY EOQ-TWICE-ORDER-COST  BY
107500              EOQ-ANNUAL-USAGE      GIVING EOQ-NUMERATOR.
107600
107700     IF STR-MKT-COST = ZEROS
107800         MOVE STR-AVG-COST TO EOQ-UNIT-COST
107900     ELSE
108000         MOVE STR-MKT-COST TO EOQ-UNIT-COST.
108100
108200
108300     MULTIPLY EOQ-UNIT-COST         BY
108400              EOQ-CARRY-COST        GIVING EOQ-DENOMINATOR.
108500
108600     DIVIDE   EOQ-NUMERATOR         BY
108700              EOQ-DENOMINATOR       GIVING EOQ-SQ.
108800
108900     COMPUTE  EOQ-SQ-ROOT ROUNDED = EOQ-SQ ** .5.
109000     MOVE EOQ-SQ-ROOT           TO  STR-EOQ.
109200
109300********************************************
109400*                                          *
109500*  UPDATE MSTORERM                         *
109600*   1) LAST-REQ-NO                         *
109700*   2) LAST-REQ-DATE                       *
109800*   3) STR-EOQ                             *
109900*                                          *
110000********************************************
110100
110200 62-UPDATE-MSTORERM.
110300     MOVE BUILD-REQ-NO          TO  STR-LAST-REQ-NO.
110400     MOVE CUR-DATE-CN           TO  STR-LAST-REQ-DATE-CN.
           REWRITE MSTORERM-REC-O FROM BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
110800         MOVE "UPDATE 62-UPDATE-MSTORERM" TO BU-DISPLAY-MSG
110900         GO TO 2-BLOWUP.
111500
111600 62-BR-X.
111700     EXIT.
111800
111900*****************************************
112000*                                       *
112100*  GET LAST REQ NO. AND UPDATE MPLTINFO *
112200*  WITH NEW LAST REQ NUMBER             *
112300*                                       *
112400*****************************************
112500
112600 621-GET-LAST-REQ-AND-UPDATE.
113800*********************************************
113900*                                           *
114000*  DO DBGET MPLTINFO WITH "PREQ" =          *
114100*  PLTINFO-KEY TO GET THE LAST REQ-NO.      *
114200*                                           *
114300*********************************************
114400
114500     MOVE "PREQ"         TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-O.
           READ MPLTINFO-O INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
114900         MOVE "GET MPLTINFO *621-GLRAU" TO BU-DISPLAY-MSG
115000         MOVE PLT-ARG TO  BU-DISPLAY-FLD (3)
115100         GO TO 2-BLOWUP.
115200     ADD 1  TO  MPLTINFO-REQ-NO.
115300     IF MPLTINFO-REQ-NO  =  ZEROS
115400         ADD 1  TO  MPLTINFO-REQ-NO.
115500
           REWRITE MPLTINFO-REC-O FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
115900         MOVE "UPDATE MPLTINFO *621-GLRAU" TO
116000             BU-DISPLAY-MSG
116100         MOVE PLT-ARG  TO  BU-DISPLAY-FLD (3)
116200         GO TO 2-BLOWUP.
117100
117200     MOVE MPLTINFO-DATE-WANT-SW   TO  CALC-DATE-WANTED-SW.
117300     MOVE MPLTINFO-REQ-NO         TO  BUILD-REQ-NO.
117400     INSPECT BUILD-REQ-NO  REPLACING LEADING "0" BY " ".
117500     MOVE 1                       TO  SUB1.
117600     MOVE ZEROS                   TO  SUB2.
117700
117800 621-LEFT-SHIFT-REQ-LOOP.
117900     ADD 1           TO  SUB2.
118000     IF SUB2 > 6
118100         NEXT SENTENCE
118200     ELSE
118300     IF REQ-NO (SUB2) = SPACES
118400         GO TO 621-LEFT-SHIFT-REQ-LOOP
118500     ELSE
118600     IF SUB1 = SUB2
118700         NEXT SENTENCE
118800     ELSE
118900         MOVE REQ-NO (SUB2)     TO  REQ-NO (SUB1)
119000         MOVE SPACES            TO  REQ-NO (SUB2)
119100         ADD 1  TO  SUB1
119200         GO TO 621-LEFT-SHIFT-REQ-LOOP.
119300
119400 621-GLRAU-X.
119500     EXIT.
119600
119700
119800*********************************************************
119900**  THIS ROUTINE CALCULATES AN AVERAGE OF THE LAST
120000**  3 ACTUAL LEAD TIMES.  THIS AVERAGE IS USED WHEN
120100**  CALCULATING DATE WANTED WHEN GDYR EST LEAD TIME
120200**  IS ZERO
120300*********************************************************

      *------ DELETED 08/30/1995 BECAUSE "SCALCEDT" PERFORMS
      *------ THIS LOGIC NOW.

123000
123100 63-WRITE-REQ-CREATE-MSG.
123200     MOVE SCREEN-CORP-CODE  TO  CORP-CODE-OUT.
123300     MOVE BUILD-REQ-NO      TO  REQ-NO-OUT.
123400     MOVE SPACES            TO  SCREEN-1.
123500     MOVE REQ-MSG-LINE1     TO  MSG-LINE-1.
123600     MOVE  20 TO LANG-SETNUM.
123700     MOVE   4 TO LANG-MSGNUM.
123800     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
123900     MOVE MESSAGE-BUFFER TO MSG-LINE-2.
124600
124700 63-WRCM-X.
124800     EXIT.
124900
125000
125100 63-CHECK-FOR-OPEN-REQ.
125200     MOVE "N"   TO  OPEN-REQ-SW.
           MOVE CODE-ARG TO CORPCDE OF DREQITM-REC-O.
           START DREQITM-O KEY = CORPCDE OF DREQITM-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 63-CFOR-X
               ELSE
125600             MOVE "FIND DREQITM * 63-CFOR"  TO  BU-DISPLAY-MSG
125700             GO TO 2-BLOWUP.
125800
125900 63-GET-DREQITM.
           READ DREQITM-O NEXT INTO BUF-DREQITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   GO TO 63-UNLOCK-REQ-SETS
               ELSE
126600             MOVE "GET DREQITM * 63-GD" TO BU-DISPLAY-MSG
126700             GO TO 2-BLOWUP.
           IF CORPCDE OF DREQITM-REC-O NOT = CODE-ARG
               GO TO 63-UNLOCK-REQ-SETS.
126800
126900     MOVE REQITM-REQ-NUMBER  TO  REQ-ARG.
           MOVE REQ-ARG TO REQNO OF MREQ-REC-O.
           READ MREQ-O INTO BUF-MREQ
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
127300         MOVE "GET MREQ * 63-GD"  TO  BU-DISPLAY-MSG
127400         MOVE REQ-ARG      TO BU-DISPLAY-FLD (3)
127500         GO TO 2-BLOWUP.
127600
127700     IF REQ-RELEASE-STAT = "XX"
127800         IF REQ-HOLD-STATUS NOT = "BATCHFILE"
127900             GO TO 63-GET-DREQITM.
128000     IF REQ-RELEASE-STAT = "XX"
128100*        "PENDING RELEASE"
128200         MOVE  16                 TO  LANG-SETNUM
128300         MOVE 124                 TO  LANG-MSGNUM
128400     ELSE
128500     IF REQ-MATCONT-RELEASE = "X"
128600*        "PURCHASING"
128700         MOVE  16                 TO  LANG-SETNUM
128800         MOVE   1                 TO  LANG-MSGNUM
128900     ELSE
           IF REQ-APPROVALS-LEFT = "  " OR "00"
129000*M       "MATERIALS CONTROL"
129100         MOVE  13                 TO  LANG-SETNUM
129200         MOVE  17                 TO  LANG-MSGNUM
           ELSE
      *M       "AWAITING APPROVALS"
               MOVE   1                 TO  LANG-SETNUM
               MOVE  30                 TO  LANG-MSGNUM.
129300     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
129400     MOVE MESSAGE-BUFFER          TO  AREA-OUT.
129500     MOVE MREQ-NUMBER             TO  OPEN-REQ-OUT.
129600     IF REQ-MATCONT-RELEASE = "X"
129700         IF REQ-HOLD-STATUS = SPACES
129800*            "PURCHASING"
129900              MOVE  16            TO  LANG-SETNUM
130000              MOVE   1            TO  LANG-MSGNUM
130100              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
130200              MOVE MESSAGE-BUFFER TO  STATUS-OUT
130300         ELSE
130400         IF REQ-HOLD-STATUS = "BATCHFILE"
130500*            "BATCHFILE"
130600              MOVE   2            TO  LANG-SETNUM
130700              MOVE   7            TO  LANG-MSGNUM
130800              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
130900              MOVE MESSAGE-BUFFER TO STATUS-OUT
131000         ELSE
131100             MOVE REQ-HOLD-STATUS  TO  STATUS-OUT
131200     ELSE
131300         IF REQ-HOLD-STATUS = SPACES
131400*            "MTL. CTL."
131500             MOVE  13             TO  LANG-SETNUM
131600             MOVE   8             TO  LANG-MSGNUM
131700             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
131800             MOVE MESSAGE-BUFFER  TO  STATUS-OUT
131900         ELSE
132000             MOVE REQ-HOLD-STATUS TO  STATUS-OUT.
132100     MOVE "Y"                     TO  OPEN-REQ-SW,
132200                                      OPEN-REQ-MSG-SW.
132300     MOVE OPEN-REQ-MSG1           TO  MSG-LINE-1.
132400     MOVE  16                     TO  LANG-SETNUM.
132500     MOVE   8                     TO  LANG-MSGNUM.
132600     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
132700     MOVE MESSAGE-BUFFER          TO  MSG-LINE-2.

       63-UNLOCK-REQ-SETS.
      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO CORPCDE OF DREQITM-REC-O.
           START DREQITM-O KEY > CORPCDE OF DREQITM-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.
133400
      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO REQNO OF MREQ-REC-O.
           START MREQ-O KEY > REQNO OF MREQ-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

133500 63-CFOR-X.
133600     EXIT.
133700
       COPY DISPCALL IN COPYLIB.
       998-AUTO-READ-SCREEN.
           READ  DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC ARE SRF-INDICATORS
                   NO DATA MOVE DISPLAY-STATUS TO DISPLAY-STATUS.
           MOVE ALL B"0" TO SRF-INDICATORS.

133800 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
135400 999-CATREAD-EXIT.
135500     EXIT.
