000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.     SREQDESC.
000400 AUTHOR.         C.I.HILLES/JIM COFFMAN (MAINTAINER).
000500 DATE-WRITTEN.   MAY, 1989.
000600 DATE-COMPILED.
000700*INSTALLATION.   THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
000800*REMARKS.
000900* REQUISITION FULL DESCRIPTION INQUIRY/MODIFY.
001000* THIS IBM VERSION USES SUBFILES TO ELIMINATE THE MAJOR HEADACHES
001100* OF THE HP VERSION.                                         *
      *C
      *C  3/21/2005   CA YODER   REQ #2005-45728
      *C  FOR SAP PLANTS, SHOW CODE DESCRIPTION FOR CODED REQS IN
      *C  ADDITION TO REQ DESCRIPTION LINES.
      *C
008800
008900 ENVIRONMENT DIVISION.
009000 CONFIGURATION SECTION.
009100 SOURCE-COMPUTER.  HP-3000.
009200 OBJECT-COMPUTER.  HP-3000.
       SPECIAL-NAMES.  I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DREQDESC-O
                  ASSIGN TO DATABASE-MCFLCS2301
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZREQDESC-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS DYNAMIC
                  RELATIVE KEY IS RELATIVE-RECNO
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

009300
009400 DATA DIVISION.
       FILE SECTION.
       FD  DREQDESC-O
           LABEL RECORDS ARE STANDARD.
       01  DREQDESC-REC-O.
           COPY DDS-MCRPCS2300  OF MCFLCS2301.

       FD  MPLTINFO
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC        PIC X(2000).

009500 WORKING-STORAGE SECTION.
       77  SAVE-REQ-SYNR3-SW  PIC X.
       77  SUB                PIC 9     VALUE 0.

       01  CONTROL-FORMAT     PIC X(10).
       01  SUBFILE-FORMAT     PIC X(10).
       01  MAX-LINES          PIC 9(2)  VALUE 76.
       01  LINES-TO-ADD       PIC 9(2)  VALUE 0.
       01  CONV-RECNO         PIC 9(2)  VALUE 0.

013000**************************************************************
013100**************************************************************
013200**                                                          **
013300**                     DATA BASE AREA                       **
013400**                                                          **
013500**************************************************************
013600**************************************************************
013700
013800 COPY DREQDESC   IN COPYLIB.
013900 COPY DDESC      IN COPYLIB.
       COPY MPLT0      IN COPYLIB.
       COPY MPLTPREQ   IN COPYLIB.

015000******************************************************************
015100**                                                              **
015200**               D A T A B A S E   W O R K                      **
015300**                                                              **
015400******************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

       01  HEX-VALUE.
           05  HEX-22                   PIC 99 BINARY VALUE 34.

       01  HEX-WORK.
           05  FILLER                   PIC X.
           05  HEX-BYTE                 PIC X.

       01  RELATIVE-RECNO               PIC 9(9).

021100*************************************************************
021200*************************************************************
021300**                                                         **
021400**                 TERMINAL I/O DATA AREA                  **
021500**                                                         **
021600*************************************************************
021700*************************************************************
021800
       01  DE-SUBFILE.
           05  V-ID-NUM       PIC X(2).
           05  V-DATA.
               10  FILLER     PIC X(76).
               10  V-DATA-77  PIC X(1).
               10  V-DATA-78  PIC X(1).
               10  V-DATA-79  PIC X(1).

003700 01  MESSAGE-BUFFER.
           05  MSG-TEXT.
               10  MESSAGE-BUFFER-1        PIC X(1)  VALUE SPACES.
               10  FILLER                  PIC X(67) VALUE SPACES.
003900     05  MSG-FLD                     PIC X(8)   VALUE SPACES.
004000     05  MSG-FLD-9 REDEFINES MSG-FLD PIC ZZZZZZZ9.
004100
004500 01  FIELD-NUMBER         PIC S9(4) COMP-4 VALUE 1.
004600
026500*************************************************************
026600*************************************************************
026700**                                                         **
026800**                  SUBPROGRAM AREAS                       **
026900**                                                         **
027000*************************************************************
027100*************************************************************
027200
030400 COPY CDESC      IN COPYLIB.
030500 COPY TBLOWUP    IN COPYLIB.
030600 COPY DISPDATA   IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.
       COPY CATREAD    IN COPYLIB.
030800
030900*************************************************************
031000*************************************************************
031100**                                                         **
031200**           L I N K A G E    S E C T I O N                **
031300**                                                         **
031400*************************************************************
031500*************************************************************
031600
031700 LINKAGE SECTION.
031800
031900 01  BASE                          PIC X(10).
032000
       01  PASSED-SWITCHES.
           05  BLOWUP-SW                 PIC X(1).
           05  UPDATE-SW                 PIC X(1).

033100 COPY VCOMLINK   IN COPYLIB.
       01  SCREEN-PRINT-PARMS.
           05  PRINT-CTL                 PIC S9(4) COMP-4.
           05  PAGE-CTL                  PIC S9(4) COMP-4.
           05  SPOOLFIL-OPEN-SW          PIC X(1).

       01  PASS-SPOOL-PRT-NO             PIC S9(2) COMP-4.

       COPY DBSTAT     IN COPYLIB.
       01  ARGUMENT-VALUES.
           05  PLT-ARG                   PIC X(4).
           05  PO-ARG                    PIC X(14).
           05  VEN-ARG                   PIC X(10).
           05  REQ-ARG                   PIC X(12).
           05  CODE-ARG                  PIC X(8).
           05  WO-ARG                    PIC X(10).
           05  BUYER-ARG                 PIC X(4).
           05  MPLTINFO-ARG              PIC X(4).
           05  VALID-ARG.
               10  VALID-ARG-1-2         PIC XX.
               10  VALID-ARG-3-10.
                   15  VALID-ARG-3-8     PIC 9(6).
                   15  FILLER            PIC XX.
           05  UM-ARG                    PIC XX.
           05  REQ-PRINTER-SPOOL-PRT     PIC 9(2).
034300
034400*************************************************************
034500*************************************************************
034600**                                                         **
034700**           P R O C E D U R E   D I V I S I O N           **
034800**                                                         **
034900*************************************************************
035000*************************************************************
035100
035200 PROCEDURE DIVISION USING BASE,
                                PASSED-SWITCHES,
035300                          VIEW-COMAREA,
                                SCREEN-PRINT-PARMS,
                                PASS-SPOOL-PRT-NO,
                                STATUS-AREA,
                                ARGUMENT-VALUES.
035800
035900 1000-BEGIN.
           MOVE LOW-VALUES TO HEX-WORK.
           IF CODE-ARG = SPACES OR "NON-STR"
               NEXT SENTENCE
           ELSE
               MOVE "N" TO UPDATE-SW.

           IF UPDATE-SW = "Y"
               MOVE "RDSF" TO SUBFILE-FORMAT
               MOVE "RDSC" TO CONTROL-FORMAT
           ELSE
               MOVE "RDSF2" TO SUBFILE-FORMAT
               MOVE "RDSC2" TO CONTROL-FORMAT.

           MOVE "SREQDESC" TO BU-PGM-NAME.
           OPEN I-O DISPLAY-FILE, DREQDESC-O.
           OPEN INPUT MPLTINFO.
           MOVE "PREQ"                   TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           MOVE "N" TO SAVE-REQ-SYNR3-SW.
           IF FILE-STATUS = "00"
               IF MPLTINFO-REQ-SYNR3-SW > SPACE
                   MOVE MPLTINFO-REQ-SYNR3-SW TO SAVE-REQ-SYNR3-SW.
           PERFORM 6000-MAIN THRU 6990-MAIN-X.
           CLOSE DISPLAY-FILE, DREQDESC-O, MPLTINFO.
           GOBACK.

011600 2100-BLOWUP.
011700     MOVE "SREQDESC"               TO   BU-PGM-NAME.
           MOVE REQ-ARG TO BU-DISPLAY-FLD (1).
           MOVE CODE-ARG TO BU-DISPLAY-FLD (2).
011800     CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
011900       VIEW-COMAREA FILE-STATUS BU-DISPLAY-MSG
012000       BU-DISPLAY-FLDS.
012100
       6000-MAIN.
           PERFORM 7000-CLEAR-SUBFILE THRU 7090-CS-X.
           PERFORM 7100-LOAD-SUBFILE THRU 7190-LS-X.

       6200-DISPLAY-SUBFILE.
           WRITE DISPLAY-REC FORMAT "RDSB" INDICATORS SRF-INDICATORS.
           MOVE B"1" TO IND (76).
           IF RELATIVE-RECNO > ZERO
               MOVE B"1" TO IND (75)
           ELSE
               MOVE B"0" TO IND (75).
           WRITE DISPLAY-REC FORMAT CONTROL-FORMAT
               INDICATORS SRF-INDICATORS.
           READ DISPLAY-FILE FORMAT CONTROL-FORMAT
               INDICATORS SRF-INDICATORS.

           IF UPDATE-SW = "Y"
               PERFORM 7300-UPDATE-FROM-SUBFILE THRU 7390-UFS-X.

       6990-MAIN-X.
           EXIT.

       7000-CLEAR-SUBFILE.
           MOVE B"0" TO IND (75), IND (76).
           MOVE B"1" TO IND (77).
           WRITE DISPLAY-REC FORMAT CONTROL-FORMAT
               INDICATORS SRF-INDICATORS.
           MOVE B"0" TO IND (77).
       7090-CS-X.
           EXIT.

       7100-LOAD-SUBFILE.
           MOVE 0 TO RELATIVE-RECNO, SUB.
           IF CODE-ARG = SPACES OR "NON-STR"
               PERFORM 7260-LOAD-NC-DESC THRU 7290-LND-X
           ELSE
               IF SAVE-REQ-SYNR3-SW = "Y"
                   PERFORM 7260-LOAD-NC-DESC THRU 7290-LND-X
               END-IF
               PERFORM 7200-LOAD-CODE-DESC THRU 7250-LCD-X.

       7190-LS-X.
           EXIT.

       7200-LOAD-CODE-DESC.
           CALL "CDESC" USING CDESC-RET-CODE, BASE, STATUS-AREA,
             BU-DISPLAY-MSG, CODE-ARG, CDESC-DATA.
           PERFORM 7230-WRITE-SUBFILE CDESC-LINES-GOT TIMES.
           GO TO 7250-LCD-X.

       7230-WRITE-SUBFILE.
           ADD 1 TO RELATIVE-RECNO, SUB.
           MOVE SPACES TO V-ID-NUM.
      *****MOVE CDESC (RELATIVE-RECNO) TO V-DATA.
           MOVE CDESC (SUB) TO V-DATA.
           MOVE DE-SUBFILE TO DISPLAY-REC.
           WRITE SUBFILE DISPLAY-REC FORMAT SUBFILE-FORMAT
             INDICATORS SRF-INDICATORS
             INVALID KEY
                 MOVE "WRITE SUBFILE ERR 7230-WS" TO BU-DISPLAY-MSG
                 PERFORM 2100-BLOWUP.

       7250-LCD-X.
           EXIT.

       7260-LOAD-NC-DESC.
           MOVE REQ-ARG TO REQNO OF DREQDESC-REC-O.
           START DREQDESC-O KEY = REQNO OF DREQDESC-REC-O
               INVALID KEY MOVE 17 TO COND-WORD.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "START ERR DREQDESC-O 7260-LND" TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

       7270-LOAD-NC-DESC-LOOP.
           MOVE 0 TO COND-WORD.
           READ DREQDESC-O NEXT INTO BUF-DREQDESC
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF REQNO OF DREQDESC-REC-O NOT = REQ-ARG
               MOVE 15 TO COND-WORD.
           IF REQDESC-LINE-NO = "95" OR "96"
               MOVE 15 TO COND-WORD.
           IF COND-WORD = 15
               PERFORM 8000-UNLOCK-DREQDESC
               GO TO 7280-CONTINUE.

           ADD 1 TO RELATIVE-RECNO.
           MOVE REQDESC-LINE-NO TO V-ID-NUM.
           MOVE REQDESC-DATA TO V-DATA.
           MOVE DE-SUBFILE TO DISPLAY-REC.
           WRITE SUBFILE DISPLAY-REC FORMAT SUBFILE-FORMAT
             INDICATORS SRF-INDICATORS
             INVALID KEY
                 MOVE "WRITE SUBFILE ERROR" TO BU-DISPLAY-MSG
                 PERFORM 2100-BLOWUP.
           GO TO 7270-LOAD-NC-DESC-LOOP.

       7280-CONTINUE.
      *------ IN ORDER FOR THEM TO BE ABLE TO ADD LINES, WE HAVE
      *------ TO PUT BLANK LINES INTO THE SUBFILE.
           IF UPDATE-SW = "Y" AND RELATIVE-RECNO < MAX-LINES
               MOVE SPACES TO V-DATA
               SUBTRACT RELATIVE-RECNO FROM MAX-LINES
                   GIVING LINES-TO-ADD
               PERFORM 7400-ADD-BLANK-LINES LINES-TO-ADD TIMES.

       7290-LND-X.
           EXIT.

       7300-UPDATE-FROM-SUBFILE.
           MOVE 0 TO CONV-RECNO.
       7304-DELETE-ALL-DREQDESC.
           MOVE REQ-ARG TO REQNO OF DREQDESC-REC-O.
           START DREQDESC-O KEY = REQNO OF DREQDESC-O
               INVALID KEY MOVE 17 TO COND-WORD.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "START ERR DREQDESC 7304-DAD" TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.
       7307-DELETE-DREQDESC-LOOP.
           MOVE 0 TO COND-WORD.
           READ DREQDESC-O NEXT INTO BUF-DREQDESC
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF REQNO OF DREQDESC-REC-O NOT = REQ-ARG
               MOVE 15 TO COND-WORD.
           IF REQDESC-LINE-NO = "95" OR "96"
               MOVE 15 TO COND-WORD.
           IF COND-WORD = 15
               PERFORM 8000-UNLOCK-DREQDESC
               MOVE 0 TO RELATIVE-RECNO
               GO TO 7310-READ-SUBFILE-LOOP.

           DELETE DREQDESC-O
             INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DELETE ERR DREQDESC" TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

           GO TO 7307-DELETE-DREQDESC-LOOP.

       7310-READ-SUBFILE-LOOP.
           ADD 1 TO RELATIVE-RECNO.
           IF RELATIVE-RECNO > MAX-LINES
               GO TO 7390-UFS-X.
      *------ HERE ARE THE POSSIBLE ACTIONS:
      *------   1.  DB ITEM EXISTS AND SCREEN ITEM NOT SPACES: UPDATE
      *------   2.  DB ITEM EXISTS AND SCREEN ITEM SPACES: DELETE
      *------   3.  DB ITEM NOT EXIST AND SCREEN ITEM NOT SPACES: ADD
           READ SUBFILE DISPLAY-FILE
               FORMAT SUBFILE-FORMAT INDICATORS SRF-INDICATORS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ SUBFILE ERR 7310-RSL" TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

           MOVE DISPLAY-REC TO DE-SUBFILE.
           IF V-DATA = SPACES
               GO TO 7310-READ-SUBFILE-LOOP.

           IF V-ID-NUM = "95" OR "96"
               MOVE V-ID-NUM TO REQDESC-LINE-NO
           ELSE
               ADD 1 TO CONV-RECNO
               MOVE CONV-RECNO TO REQDESC-LINE-NO.
           MOVE "0001" TO REQDESC-ITEM-NO.
           MOVE REQDESC-SEQ-NUMBER TO ITEMSEQNO OF DREQDESC-REC-O.
      *************************************************************
      *    JIM COFFMAN ADDED THE FOLLOWING 7 LINES ON 5-23-94     *
      *    TO BYPASS A PROBLEM THAT OCCURS WHEN THE USER TRIES    *
      *    TO EXCEED 20 LINES OF DESCRIPTION FOR A REQUISITION.   *
      *    THE SUBFILE ON THE AS400 LEAVES A HEX 22/HEX 4E AND    *
      *    A SPACE IN POSITIONS 77-79 FOR LINES 20 AND 40 AND     *
      *    JUST THE HEX 22 CHARACTER IN POSITION 77 FOR LINE 60.  *
      *    THE HEX 22 CHARACTER IS A FORM STOP CHARACTER AND IT   *
      *    WAS CAUSING THE PRINTER TO STOP AS SOON AS IT HIT THIS *
      *    CHARACTER. THE FOLLOWING LINES WILL CHANGE THE UNUSUAL *
      *    CHARACTERS TO SPACES.                                  *
      *************************************************************
           IF CONV-RECNO = 20 OR 40 OR 60
               IF V-DATA-79 = " "
                   IF V-DATA-78 = "+" OR " "
                       MOVE " " TO V-DATA-78
                       MOVE V-DATA-77 TO HEX-BYTE
                       IF HEX-WORK = HEX-VALUE
                           MOVE " " TO V-DATA-77.
           MOVE V-DATA TO REQDESC.
           MOVE REQ-ARG TO REQNO OF DREQDESC-REC-O.
           WRITE DREQDESC-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "WRITE ERR DREQDESC 7310-RSL" TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

           GO TO 7310-READ-SUBFILE-LOOP.

       7390-UFS-X.
           EXIT.

       7400-ADD-BLANK-LINES.
           ADD 1 TO RELATIVE-RECNO.
           MOVE RELATIVE-RECNO TO CONV-RECNO.
           MOVE CONV-RECNO TO V-ID-NUM.
           MOVE DE-SUBFILE TO DISPLAY-REC.
           WRITE SUBFILE DISPLAY-REC FORMAT "RDSF"
               INDICATORS SRF-INDICATORS
               INVALID KEY
                   MOVE "WRITE SUBFILE ERROR" TO BU-DISPLAY-MSG
                   PERFORM 2100-BLOWUP.

       8000-UNLOCK-DREQDESC.
      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO REQNO OF DREQDESC-REC-O.
           START DREQDESC-O KEY > REQNO OF DREQDESC-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       COPY DISPCALL IN COPYLIB.
