000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.
000400     SREQLINK.
000500 AUTHOR.
000600     KURT MOVSESIAN.
000800
000900******************************************************
001000*                                                    *
001100*   S R E Q L I N K                                  *
001200*                                                    *
001300*   THIS SUB PROGRAM LINKS A REQUISITION TO A        *
001400*   PURCHASE ORDER ITEM.                             *
001500*                                                    *
001600******************************************************
      *                                                    *
      *C*  06/18/1996  CA YODER                            *
      *C*  RECOMPILED TO PICK UP CENTURY DATABASE CHANGES. *
      *                                                    *
      ******************************************************
001700
002300
002400 ENVIRONMENT DIVISION.
002500 CONFIGURATION SECTION.
002600 SOURCE-COMPUTER.  HP-3000.
002700 OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MREQ-O
                  ASSIGN TO DATABASE-MCFLCS2001
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DREQD-O
                  ASSIGN TO DATABASE-MCFLCS2101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                     WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
002800
003000
003100 DATA DIVISION.
003200 FILE SECTION.
       FD  MREQ-O
           LABEL RECORDS ARE STANDARD.
       01  MREQ-REC-O.
           COPY DDS-ALL-FORMATS OF MCFLCS2001.

       FD  DREQD-O
           LABEL RECORDS ARE STANDARD.
       01  DREQD-REC-O.
           COPY DDS-ALL-FORMATS OF MCFLCS2101.
003300
003400
003500 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
003600
003700**************************************************************
003800**************************************************************
003900**                                                          **
004000**                DATABASE I/O BUFFER AREA                  **
004100**                                                          **
004200**************************************************************
004300**************************************************************
004400
004500 COPY MREQ IN COPYLIB.
004600
004700 COPY DREQD IN COPYLIB.
004800
004900
005000*********************
005100*                   *
005200*   DATA SET NAMES  *
005300*                   *
005400*********************
005500
005600 01  DSET-NAMES.
005700     05  DSET-NAME              PIC X(16)  VALUE SPACES.
005800     05  DSET-MREQ              PIC X(16)  VALUE "MREQ;".
005900     05  DSET-DREQD             PIC X(16)  VALUE "DREQD;".
006200
006300 COPY DBSTAT IN COPYLIB.
006400
       01 WS-PROGRAM-MESSAGES.
           03  WS-REQLINK-ERRMSG1     PIC X(50)       VALUE
               "SREQLINK - REQ LINK ERROR".

006500 01 ITEMS-LISTING.
006600     05  ALL-ITEMS              PIC XX    VALUE "@;".
006700     05  REQ-SEARCH             PIC X(12) VALUE "REQ-NUMBER;".
006800
006900 01 ARG-VALUES.
007000     05  REQ-ARG                PIC X(12) VALUE SPACES.
007100
007400
007500 COPY TBLOWUP IN COPYLIB.
007600
007700 COPY VIEWDUM IN COPYLIB.
007800
007900 LINKAGE SECTION.
008000
008100 01  BASE             PIC X(10).
008200
008300 COPY SREQLINK IN COPYLIB.
008400
008500 PROCEDURE DIVISION USING  BASE,
008600                           REQLINK-PARMS.
008700
008800 REQ-LINK SECTION 25.
       BEGIN-HERE.
           OPEN I-O MREQ-O, DREQD-O

008900     PERFORM 6-MAIN  THRU  6-M-X.

       END-HERE.
           CLOSE MREQ-O, DREQD-O.
           GOBACK.
009200
009300
009400*******************************************************
009500**                                                   **
009600**   BLOWUP  ROUTINE                                 **
009700**                                                   **
009800*******************************************************
009900
010000 2-BLOWUP.

           IF REQLINK-BLOWUP-SW = "N"
              MOVE  WS-REQLINK-ERRMSG1  TO REQLINK-MESSAGE
              GO TO END-HERE
           END-IF.

010100     MOVE "SREQLINK"       TO  BU-PGM-NAME.
010200     MOVE REQLINK-PO-NUM   TO  BU-DISPLAY-FLD (1).
010300     MOVE REQLINK-REQ-NO   TO  BU-DISPLAY-FLD (2).
           IF FILE-STATUS NUMERIC
               MOVE FILE-STATUS  TO COND-WORD.
010400     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
010500         VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
010600             BU-DISPLAY-FLDS.
010700
010800 6-MAIN.
010900     MOVE REQLINK-REQ-NO   TO  REQ-ARG.
011000     PERFORM 61-UPDATE-REQ  THRU  61-UR-X.
011100
011200 6-M-X.
011300     EXIT.
011400
011500 61-UPDATE-REQ.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DREQD-REC-O.
           START DREQD-O KEY = REQNO OF DREQD-REC-O
               INVALID KEY MOVE "2" TO FILE-STATUS-1.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "23"
                   PERFORM 611-PUT-DREQD  THRU 611-PD-X
                   GO TO 61-UPDATE-MREQ
               ELSE
                   MOVE 99 TO COND-WORD.
012800*    CALL "DBFIND" USING BASE, DSET-DREQD, MODE1,
012900*        STATUS-AREA, REQ-SEARCH, REQ-ARG.
013000     IF COND-WORD NOT = 0
013100         MOVE "FIND DREQD * 61-UR" TO BU-DISPLAY-MSG
013200         GO TO 2-BLOWUP.
           MOVE 0 TO COND-WORD.
           READ DREQD-O  NEXT INTO BUF-DREQD
               AT END MOVE "10" TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF REQNO OF DREQD-REC-O NOT = REQ-ARG
               MOVE 15 TO COND-WORD
      *--------- DO A START SO THE RECORD FROM PREVIOUS READ IS NOT
      *--------- LOCKED
               MOVE HIGH-VALUES TO REQNO OF DREQD-REC-O
               START DREQD-O KEY > REQNO OF DREQD-REC-O
                   INVALID KEY MOVE "2" TO FILE-STATUS-1.
013300*    CALL "DBGET" USING BASE, DSET-DREQD, MODE5,
013400*        STATUS-AREA, ALL-ITEMS, BUF-DREQD, REQ-ARG.
013500     IF COND-WORD NOT =  0
013600         IF COND-WORD = 15
013700             PERFORM 611-PUT-DREQD  THRU 611-PD-X
013900             GO TO 61-UPDATE-MREQ
014000         ELSE
014100             MOVE "GET DREQD * 61-UR"  TO  BU-DISPLAY-MSG
014200             GO TO 2-BLOWUP.
014300
014400*************************************************
014500*                                               *
014600*  UPDATE DREQD WITH PO NUMBER AND VENDOR CODE  *
014700*                                               *
014800*************************************************
014900
015000*    CALL "DBDELETE" USING BASE, DSET-DREQD, MODE1,
015100*        STATUS-AREA.
015200*    IF COND-WORD NOT =  0
015300*        MOVE "DELETE DREQD *61-UR" TO BU-DISPLAY-MSG
015400*        GO TO 2-BLOWUP.

015700     MOVE REQLINK-PO-NUM          TO  DREQD-PO-RCV-NO.
015800     MOVE REQLINK-VEN-CODE        TO  DREQD-VEN-CODE.
015900     MOVE REQLINK-PO-ITEM-NO      TO  DREQD-PO-ITM-NO.
           MOVE 0 TO COND-WORD.
           REWRITE DREQD-REC-O FROM BUF-DREQD
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
016000*    CALL "DBPUT" USING BASE, DSET-DREQD, MODE1,
016100*        STATUS-AREA, ALL-ITEMS, BUF-DREQD.
016200     IF COND-WORD NOT = 0
016300         MOVE "REWRITE DREQD * 61-UR"  TO  BU-DISPLAY-MSG
016400         GO TO 2-BLOWUP.
015500
016600*************************************************
016700*                                               *
016800*   SET FLAG IN MREQ TO SHOW PURCHASING         *
016900*   PROCESSED THE REQ BY CUTTING A P.O. FOR IT  *
017000*                                               *
017100*************************************************
017200
017300 61-UPDATE-MREQ.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF MREQ-REC-O.
           READ MREQ-O INTO BUF-MREQ
               INVALID KEY MOVE "2" TO FILE-STATUS-1.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
017400*    CALL "DBGET" USING BASE, DSET-MREQ, MODE7, STATUS-AREA,
017500*        ALL-ITEMS, BUF-MREQ, REQ-ARG.
017600     IF COND-WORD NOT =  0
017700         MOVE "GET MREQ * 61-UM"  TO  BU-DISPLAY-MSG
017800         GO TO 2-BLOWUP.
017900     MOVE "XX"              TO  REQ-RELEASE-STAT.
018000     MOVE SPACES            TO  REQ-HOLD-STATUS-CODE,
018100                                REQ-HOLD-STATUS.
           MOVE 0 TO COND-WORD.
           REWRITE MREQ-REC-O FROM BUF-MREQ
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
018200*    CALL "DBUPDATE" USING BASE, DSET-MREQ, MODE1,
018300*        STATUS-AREA, ALL-ITEMS, BUF-MREQ.
018400     IF COND-WORD NOT = 0
018500         MOVE "UPDATE MREQ * 61-UM"  TO BU-DISPLAY-MSG
018600         GO TO 2-BLOWUP.
019200
019300 61-UR-X.
019400     EXIT.

015600 611-PUT-DREQD.
           MOVE SPACES                  TO  BUF-DREQD.
           MOVE REQ-ARG                 TO  DREQD-REQ-NUMBER.
015700     MOVE REQLINK-PO-NUM          TO  DREQD-PO-RCV-NO.
015800     MOVE REQLINK-VEN-CODE        TO  DREQD-VEN-CODE.
015900     MOVE REQLINK-PO-ITEM-NO      TO  DREQD-PO-ITM-NO.
           MOVE 0 TO COND-WORD.
           WRITE DREQD-REC-O FROM BUF-DREQD
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
016000*    CALL "DBPUT" USING BASE, DSET-DREQD, MODE1,
016100*        STATUS-AREA, ALL-ITEMS, BUF-DREQD.
016200     IF COND-WORD NOT = 0
016300         MOVE "PUT DREQD * 61-UR"  TO  BU-DISPLAY-MSG
016400         GO TO 2-BLOWUP.
016500
       611-PD-X.
           EXIT.
