001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.          SRLSEINQ.
001300 AUTHOR.              BARBARA WINTER.
001400 DATE-WRITTEN.       MAY    1988.
001500 DATE-COMPILED.
001600*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
001700*SECURITY.
001800*REMARKS. THIS IS THE RELEASE NUMBER INQUIRY PROGRAM.
001900*************************************************************
002000*************************************************************
002100**                    S R L S E I N Q                      **
002200**                                                         **
002300**    THIS IS THE SCREEN PROGRAM FOR THE TALLIN INQUIRY.   **
002400**                                                         **
002500**  THE SOFTWARE RELEASE NUMBER FOR CSIS/MMIS IS DISPLAYED **
002600**  ALONG WITH THE INSTALLED DATE.                         **
002700*************************************************************
002800
002900 ENVIRONMENT DIVISION.
003000 CONFIGURATION SECTION.
003100 SOURCE-COMPUTER.    HP-3000.
003200 OBJECT-COMPUTER.    HP-3000.
003300 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT MPLTINFO
              ASSIGN TO DATABASE-MCFLCS0501
              ORGANIZATION IS INDEXED
              ACCESS MODE IS DYNAMIC
            RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
            FILE STATUS IS FILE-STATUS.
003400 DATA DIVISION.
003500 FILE SECTION.
       FD  MPLTINFO
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC.
           COPY DDS-MCRPCS0500 OF MCFLCS0501.
003600 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1         PIC X.
           05  FILE-STATUS-2         PIC X.
004000**************************************************************
004100*                 C A L L E D  R O U T I N E S               *
004200**************************************************************
004300 01  RETURN-CODE               PIC X(2)     VALUE "00".
004400*---------- VSETERROR AND VPUTWINDOW
004500 01  MESSAGE-BUFFER            PIC X(76)    VALUE SPACES.
004600 01  MESSAGE-BUFFER-RD REDEFINES MESSAGE-BUFFER.
004700     05  MSG-BUFFER            PIC X(68).
004800     05  MSG-VALUE             PIC X(8).
004900 01  MESSAGE-BUFLEN            PIC S9(4)    VALUE 76 COMP-4.
005000 01  MESSAGE-ACTLEN            PIC S9(4)    VALUE 0  COMP-4.
005100 01  FIELD-NUMBER              PIC S9(4)    VALUE 1  COMP-4.
005200
       COPY CATREAD  OF COPYLIB.
005300 COPY TDATECHK OF COPYLIB.
005400 COPY TBLOWUP OF COPYLIB.
005500 01  SCREEN-PRINT-PARMS.
005600     05  PRINT-CTL             PIC S9(4)    COMP-4.
005700     05  PAGE-CTL              PIC S9(4)    COMP-4.
005800     05  SPOOLFIL-OPEN-SW      PIC X   VALUE "N".
005900
006000 01  PASS-SPOOL-PRT-NO         PIC S9(2)  COMP-4 VALUE ZEROES.
006100 COPY TSHWRDFM OF COPYLIB.
006200*************************************************************
006300*                        D A T A B A S E                    *
006400*************************************************************
006500 COPY DBSTAT OF COPYLIB.
006600 COPY DBMODES OF COPYLIB.
006900
007200 01  ARGUMENT-VALUES.
007300     05  TAPE-ARG              PIC X(4)     VALUE "TAPE".
007400
007500 01  FORM-NAMES.
007600     05  RLSEINQ               PIC X(7)     VALUE "RLSEINQ".
007700
007710 COPY MPLT0    OF COPYLIB.
007800 COPY MPLTTAPE OF COPYLIB.
007900 COPY MPLTP01 OF COPYLIB.
       01  SCREEN-BUFFER             PIC X(2000).
008000 01  SCREEN-RLSE-INQ.
008100     05  SCR-PLT-CODE          PIC X(3)    VALUE SPACES.
008200     05  SCR-PLT-NAME          PIC X(50)   VALUE SPACES.
008300     05  SCR-RELEASE           PIC X(6)    VALUE SPACES.
008400     05  SCR-INSTALLED         PIC X(8)    VALUE SPACES.
           05  DE-COMMAND-LINE       PIC X(79).
           05  DE-MESSAGE-LINE       PIC X(79).
008500
008600 LINKAGE SECTION.
008700 01  BASE                 PIC X(10).
008800 COPY VCOMLINK OF COPYLIB.
008900 COPY LANGSUB OF COPYLIB.
009000
009100 PROCEDURE DIVISION USING BASE, VIEW-COMAREA, LANGUAGE-PARMS.
009200 00-CONTROL.
009300
           OPEN INPUT MPLTINFO.
           MOVE SPACES TO SCREEN-RLSE-INQ.
009400     PERFORM 100-DISPLAY-MAIN-SCREEN  THRU 199-EXIT.
009500     CLOSE MPLTINFO.
009600     GOBACK.
009700 100-DISPLAY-MAIN-SCREEN.
009800*----------  GET TAPE RELEASE NUMBER AND INSTALLED DATE
           MOVE 0 TO COND-WORD.
           MOVE TAPE-ARG TO PLTINFOKEY  OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
010100     IF COND-WORD NOT = 0
010200           MOVE "DBGET MPLTINFO TAPE SRLSEINQ" TO BU-DISPLAY-MSG
010300           PERFORM 990-BLOWUP THRU 999-EXIT.
010400     MOVE MPLTINFO-TAPE-RLSE TO SCR-RELEASE.
010500     MOVE MPLTINFO-TAPE-INSTALLED TO DATE-VALIDATE-IN.
010600     MOVE 4 TO DATE-MODE.
010700     CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
010800     MOVE DATE-SLASH-OUT TO SCR-INSTALLED.
010900
010910*----------  GET PLANT NUMBER AND NAME
011000     MOVE "P 01" TO TAPE-ARG.
           MOVE 0 TO COND-WORD.
           MOVE TAPE-ARG TO PLTINFOKEY  OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
011300     IF COND-WORD NOT = 0
011400           MOVE "DBGET MPLTINFO P 01 SRLSEINQ" TO BU-DISPLAY-MSG
011500           PERFORM 990-BLOWUP THRU 999-EXIT.
011600     MOVE MPLTINFO-COMPANY TO SCR-PLT-CODE
011700     MOVE MPLTINFO-PLT-NAME TO SCR-PLT-NAME.
011800
011900     MOVE RLSEINQ   TO  VIEW-NFNAME.
014000 105-SHOW-FORM.
           MOVE SPACES TO SCREEN-BUFFER.
           MOVE SCREEN-RLSE-INQ TO SCREEN-BUFFER.
014100     MOVE 7 TO SRF-KEYSET.
014200     CALL "TSHWRDFM" USING SRF-COMAREA, BU-DISPLAY-MSG,
014300           VIEW-COMAREA, BASE, STATUS-AREA, SRF-SPOOLER-REC,
014400           LANGUAGE-PARMS, SCREEN-BUFFER.
014500     IF SRF-RET-CODE NOT = 0
014600        MOVE "TSHWRDF2 ERROR 105 SRLSEINQ" TO BU-DISPLAY-MSG
014700        PERFORM 990-BLOWUP THRU 999-EXIT.
           MOVE SCREEN-BUFFER TO SCREEN-RLSE-INQ.
014800
014900     IF VIEW-LASTKEY EQUAL 8
015000         GO TO 199-EXIT.
015100
015800 199-EXIT.  EXIT.
016900******************************************************************
017000*   DISPLAY ERROR MESSAGE FOR SPECIFIC FIELD ON SCREEN           *
017100******************************************************************
017200 940-VSETERROR.
           MOVE "Y" TO SRF-ERROR-SW.
           MOVE B"1" TO IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE.
051300
018400 949-EXIT.  EXIT.
019400************************************************************
019500*                    B L O W U P                           *
019600*     CHECK FOR IMAGE, VIEW, OR SPOOL ERROR.  CLOSE        *
019700*     FILES, GET OUT OF BLOCK MODE, AND DISPLAY            *
019800*     APPROPRIATE ERROR MESSAGE ON SCREEN.                 *
019900*                                                          *
020000*     ALSO APPENDS THE ERROR MESSAGE TO A FILE CALLED      *
020100*     BLOWUP.PUB.  TO READ THIS FILE, RUN "XBLPRT.OBJECT". *
020200*                                                          *
020300*         |||  PROGRAM IS ABORTED IN TBLOWUP  |||          *
020400************************************************************
020500 990-BLOWUP.
020600     MOVE "SRLSEINQ"   TO BU-PGM-NAME.
020700     MOVE VIEW-NFNAME TO BU-DISPLAY-FLD (1).
021000     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
021100           VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
021200           BU-DISPLAY-FLDS.
021300 999-EXIT.  EXIT.
021400
021500 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
023100 999-CATREAD-EXIT.
023200     EXIT.
