       IDENTIFICATION DIVISION.
       PROGRAM-ID.         SRPTSEL.
       AUTHOR.             CA YODER.
       DATE-WRITTEN.       NOVEMBER 1997.
       DATE-COMPILED.
      *INSTALLATION.       GOODYEAR TIRE & RUBBER CO.

      *D* REMARKS.
      *D*
      *D*   THIS PROGRAM ALLOWS THE USER TO CHOOSE WHICH REPORT
      *D*   TO WORK WITH ON THE REPORT DISTRIBUTION FUNCTION.
      *D*
      *
      *C* CHANGES
      *C*

       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.

       SOURCE-COMPUTER.          IBM-AS400.
       OBJECT-COMPUTER.          IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN         TO WORKSTATION-ZRPTDIST-SI
               ORGANIZATION   IS TRANSACTION
               ACCESS         IS DYNAMIC
               RELATIVE KEY   IS REC-COUNT
               FILE STATUS    IS DISPLAY-STATUS
               CONTROL-AREA   IS WS-CONTROL.

           SELECT DRPTMAST-IO
               ASSIGN         TO DATABASE-MCFLCS6701
               ORGANIZATION   IS INDEXED
               ACCESS MODE    IS DYNAMIC
               RECORD KEY     IS EXTERNALLY-DESCRIBED-KEY
                                 WITH DUPLICATES
               FILE STATUS    IS FILE-STATUS.

       DATA DIVISION.

       FILE SECTION.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC        PIC X(2000).

       FD  DRPTMAST-IO
           LABEL RECORDS ARE STANDARD.
       01  DRPTMAST-IO-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS6701.

       WORKING-STORAGE SECTION.

       77  SUB                      PIC 9(5).
       77  MORE-RECORDS             PIC X     VALUE "Y".

      *-----------------------------------------------------------------
      *                   B U F F E R S
      *-----------------------------------------------------------------

      *------- BUFFER FOR SCREEN.
       01  DE-SCREEN-BUF.
           10  DE-SELECT            PIC X.
           10  DE-RPT-DESC          PIC X(40).
           10  DE-RPT-PROG          PIC X(8).

       COPY DRPTMAST      OF COPYLIB.

      *-----------------------------------------------------------------
      *         S W I T C H E S / C O U N T E R S
      *-----------------------------------------------------------------

       01  DRPTMAST-EOF-SW         PIC X  VALUE "N".

       01  REC-COUNT               PIC 9(5) VALUE 0.

      *-----------------------------------------------------------------
      *          D A T A B A S E   S T A T U S   A R E A
      *-----------------------------------------------------------------

       01  FILE-STATUS.
           05  FILE-STATUS-1        PIC X.
           05  FILE-STATUS-2        PIC X.

       COPY DATAB    OF COPYLIB.

      *-----------------------------------------------------------------
      *               U T I L I T Y   A R E A
      *-----------------------------------------------------------------

       COPY CATREAD OF COPYLIB.

       COPY TBLOWUP OF COPYLIB.

       COPY VCOMAREA OF COPYLIB.

       01  WS-CONTROL.
           05  FUNCTION-KEY         PIC X(2).
               88  ENTER-KEY-USED            VALUE "00".
               88  F1-KEY-USED               VALUE "01".
               88  F2-KEY-USED               VALUE "02".
               88  F3-KEY-USED               VALUE "03".
               88  F4-KEY-USED               VALUE "04".
               88  F5-KEY-USED               VALUE "05".
               88  F6-KEY-USED               VALUE "06".
               88  F7-KEY-USED               VALUE "07".
               88  F8-KEY-USED               VALUE "08".
               88  F9-KEY-USED               VALUE "09".
               88  F10-KEY-USED              VALUE "10".
               88  F11-KEY-USED              VALUE "11".
               88  F12-KEY-USED              VALUE "12".
               88  ROLLUP-KEY-USED           VALUE "RU".
           05  TERMINAL-ID          PIC X(10).
           05  FORMAT-NAME          PIC X(10).

       01  DISPLAY-STATUS           PIC X(2).

       01  SRF-INDICATORS.
           05  IND                  PIC 1
                                    OCCURS 99 TIMES
                                    INDICATOR 1.
               88  IND-OFF          VALUE B"0".
               88  IND-ON           VALUE B"1".

       01  OFF-SWITCH               PIC 1  VALUE B"0".
       01  ON-SWITCH                PIC 1  VALUE B"1".

      *-----------------------------------------------------------------
      *          P R O C E D U R E   D I V I S I O N
      *-----------------------------------------------------------------

       PROCEDURE DIVISION.

       BEGIN SECTION.

       0-BEGIN.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-X.
           PERFORM 2-EOJ.
           GOBACK.

       1-HSK.
           OPEN I-O       DRPTMAST-IO
                          DISPLAY-FILE.

       2-EOJ.
           CLOSE          DRPTMAST-IO
                          DISPLAY-FILE.

       6-MAIN SECTION.

       6-BEGIN.
           INITIALIZE DISPLAY-REC.
           MOVE "00"  TO  FILE-STATUS.

       60-LOAD-SCREEN.

           INITIALIZE REC-COUNT.

      *---- SHOW SFLCTL (71) AND CLEAR SFL (72), BUT DON'T SHOW IT (70).

           MOVE ON-SWITCH    TO IND (71)  IND (72).
           MOVE OFF-SWITCH   TO IND (70).

           WRITE SUBFILE DISPLAY-REC
               FORMAT IS "TYPESFLC"
               INDICATORS ARE SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "PROBLEM ON INIT SFL WRITE" TO BU-DISPLAY-MSG
               GO TO 9999-BLOWUP.

      *-------- TURN CLEAR SFL OFF.

           MOVE OFF-SWITCH TO IND (72).

       601-GET-LIST.

           INITIALIZE DE-SCREEN-BUF.
           MOVE "N"                TO  DRPTMAST-EOF-SW.
           MOVE SPACES TO RPTPROG OF DRPTMAST-IO-REC.
           START DRPTMAST-IO KEY >= EXTERNALLY-DESCRIBED-KEY
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               READ DRPTMAST-IO NEXT INTO BUF-DRPTMAST
                   AT END MOVE "Y" TO DRPTMAST-EOF-SW.
           IF FILE-STATUS = "00"
               PERFORM UNTIL DRPTMAST-EOF-SW = "Y"
                   MOVE MST-RPT-DESC   TO DE-RPT-DESC
                   MOVE MST-RPT-PROG   TO DE-RPT-PROG
                   ADD 1               TO REC-COUNT
                   WRITE SUBFILE DISPLAY-REC FROM DE-SCREEN-BUF
                       FORMAT IS "TYPESFL"
                       INDICATORS ARE SRF-INDICATORS
                       INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                   END-WRITE
                   IF DISPLAY-STATUS NOT = "00"
                       MOVE "SUBFILE WRITE ERROR" TO BU-DISPLAY-MSG
                       MOVE REC-COUNT        TO BU-DISPLAY-FLD (1)
                       MOVE DISPLAY-STATUS   TO BU-DISPLAY-FLD (2)
                       PERFORM 9999-BLOWUP
                   END-IF
                   READ DRPTMAST-IO NEXT INTO BUF-DRPTMAST
                       AT END MOVE "Y" TO DRPTMAST-EOF-SW
                   END-READ
               END-PERFORM.

       602-SHOW-SCREEN.

      *--- SHOW FUNCTION KEYS.
           WRITE DISPLAY-REC FROM DE-SCREEN-BUF
               FORMAT IS "TYPESFLREC"
               INDICATORS ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

           MOVE ON-SWITCH TO IND (70)  IND (71)  IND (73).

      *--- WRITE THE SUBFILE TO SCREEN.
           WRITE SUBFILE DISPLAY-REC
               FORMAT IS "TYPESFLC"
               INDICATORS ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "PROBLEM ON SHOW SFL WRITE" TO BU-DISPLAY-MSG
               MOVE REC-COUNT TO BU-DISPLAY-FLD (1)
               MOVE DISPLAY-STATUS TO BU-DISPLAY-FLD (2)
               GO TO 9999-BLOWUP.

      *--- WAIT FOR USER TO PRESS A KEY.
           READ DISPLAY-FILE INTO DE-SCREEN-BUF
               FORMAT IS "TYPESFLC"
               INDICATORS ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "PROBLEM ON READ SFL" TO BU-DISPLAY-MSG
               GO TO 9999-BLOWUP.

       603-ACTION.

      *--- THE ENTER KEY IS TREATED THE SAME AS PRESSING THE F3 KEY.
           IF F3-KEY-USED
               GO TO 6-MAIN-X.

           MOVE "Y" TO MORE-RECORDS.
           PERFORM UNTIL DE-SELECT = "X" OR MORE-RECORDS = "N"
               READ SUBFILE DISPLAY-FILE NEXT MODIFIED RECORD
                   INTO DE-SCREEN-BUF
                   FORMAT IS "TYPESFL"
                   AT END MOVE "N" TO MORE-RECORDS
               END-READ
           END-PERFORM.

           IF MORE-RECORDS = "N"
               GO TO 602-SHOW-SCREEN.

      *--------- UNLOCK RECORD.
           MOVE HIGH-VALUES TO RPTPROG OF DRPTMAST-IO-REC.
           START DRPTMAST-IO KEY > EXTERNALLY-DESCRIBED-KEY
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

           CALL "SRPTDIST" USING DE-RPT-PROG.

       6-MAIN-X.
           EXIT.

      ******************************************************************
      **             U T I L I T Y   S E C T I O N                    **
      ******************************************************************

       9999-UTILITY SECTION.

       9999-CATREAD.
           CALL "CCATREAD" USING CATREAD-PARMS.

       9999-BLOWUP.
           MOVE "SRPTSEL" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
               BU-DISPLAY-FLDS.
