001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.          SRSCRNS2.
001300 AUTHOR.              C.I.HILLES.
001400 DATE-WRITTEN.        02/27/90.
001500 DATE-COMPILED.
001600*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
001700*
001800*REMARKS.
001900*D   THIS IS THE FRONT END OPTION SUBPROGRAM FOR MOST CSIS
002000*D   REPORTS.
002100*
      *    THIS VERSION OF THE "RSCREEN" PROGRAM USES "CSTRMJB2"
      *    INSTEAD OF "TSTRMJOB".  THE REASON IS THAT, FOR IBM,
      *    "CSTRMJB2" USES THE STRDBRDR COMMAND INSTEAD OF THE
      *    SBMJOB COMMAND USED BY "TSTRMJOB".  THE ADVANTAGES ARE:
      *      1.  THE BATCH PROGRAM CAN USE ACCEPT STATEMENTS
      *          FOR IT'S DATA JUST LIKE ON THE HP, AS OPPOSED TO
      *          USING PARAMETERS TO THE BATCH PROGRAM IN THE SBMJOB
      *          COMMAND WITH TSTRMJOB.
      *      2.  AN UNLIMITED AMOUNT OF LINES CAN BE PASSED TO THE
      *          JOB WITH "CSTRMJB2": WITH "TSTRMJOB" YOU ARE
      *          LIMITED BY THE 256-BYTE PARAMETER MAXIMUM FOR SBMJOB.
      *      3.  THE JOB IS A SOURCE FILE, NOT A COMPILED CL PROGRAM,
      *          AND CAN MORE EASILY BE MAINTAINED BY THE PLANTS.
      *
002200*    THIS PROGRAM READS A SCREEN OF REPORT OPTIONS OF A MAXIMUM
002300*    OF 80 CHARACTERS, AND THEN STREAMS A JOB INTERACTIVELY,
002400*    PASSING ON THE REPORT OPTIONS ENTERED BY THE USER.
002500*    THE REPORT PROGRAM TO BE RUN IN THE JOB IS DETERMINED BY
002600*    A JCW "RPT", WHICH IS SET TO THE REPORT NUMBER BEFORE THE
002700*    RUN OF THIS PROGRAM.  THIS PROGRAM CAN BE USED AS THE OPTION
002800*    PROGRAM FOR ANY REPORT, AS LONG AS THE LENGTH OF THE REPORT
002900*    OPTIONS DOES NOT EXCEED 80 CHARACTERS.  IF THE LENGTH OF THE
003000*    OPTIONS DOES EXCEED 80 BYTES, THEN A SEPERATE FRONT END
003100*    OPTION PROGRAM MUST BE WRITTEN.
003200*
003300*    FILE OUTLINE FOR ADDING A REPORT DEFINITION TO THE
003400*    FILE "DRPTDEF.PUB":
003500*      REPORT-NUMBER         9(4).  THIS A NUMBER THAT THE JCW
003600*                            "RPT" WILL BE SET TO BEFORE RUNNING
003700*                            THIS PROGRAM.  THE JCW "RPT" WILL TELL
003800*                            THIS PROGRAM WHICH ENTRY IN THE REPORT
003900*                            DEFINITION FILE WE ARE USING.
004000*
004100*      REPORT RUN CARD       X(30). THIS IS THE RUN CARD FOR THE
004200*                            REPORT PROGRAM.  FOR EXAMPLE, IF YOUR
004300*                            REPORT WAS "XRPTOVER.OBJECT", THE RUN
004400*                            CARD MIGHT BE...
004500*                              "RUN XRPTOVER.OBJECT;LIB=P"
004600*
004700*      REPORT JOB NAME       X(8).  NAME OF THE JOB STREAM -
004800*
004900*      REPORT FORMNAME       X(15).  NAME OF THE FORM IN THE
005000*                            "FRPTFORM" FILE FROM WHICH THE REPORT
005100*                            OPTIONS ARE TO BE OBTAINED.
005200*
005300*      XPRTRPT FLAG          X(1).  PUT A "Y" HERE IF YOU WANT TO
005400*                            RUN "XPRTRPT.OBJECT" - THE REPORT
005500*                            PRINTING PROGRAM - FROM A FILE.
005600*
005700*      XPRTRPT FILE          X(17). IF USING THE "XPRTRPT" PROGRAM,
005800*                            THE FILE NAME THAT THE REPORT WILL BE
005900*                            PRINTED FROM GOES HERE.
006000*
006100*      PRINTER TYPE          X(1).  SET TO "0" TO FORCE AN MPE
006200*                            SPOOLED PRINTER.  SET TO "1" TO FORCE
006300*                            A "JSPOOLER" SPOOLED PRINTER.  LEAVE
006400*                            BLANK TO LET IT BE DETERMINED BY
006500*                            THE "MPLTINFO" ENTRY WHICH IT IS.
006600*
006700*     NUMBER OF BUFFERS      X(1).  NUMBER OF 80-CHARACTER INPUT
006800*                            BUFFERS IN YOUR FORM.  IF LEFT BLANK
006900*                            THE PROGRAM WILL DEFAULT TO "1".
007000*
      *C
      *C   08/20/96  JEFF BUNGO
      *C     RETRIEVE POPT MPLTINFO PRINTER OPTIONS.   IF PRINTER
      *C     OPTION TO HAVE NO ASCII CONTROL CHARACTERS ON REPORTS
      *C     IS SET TO "Y" THEN DO NOT DISPLAY THE CHOICE OF 132
      *C     OR 80 COLUMN PRINT, DEFAULT TO 132 BY SELECTING X ON
      *C     DE-PAPER-FLAG.
      *C
      *C   08/20/96  JEFF BUNGO
      *C     REDUCE FIELD SIZE OF SPOOLER NUMBER TO 2 DIGITS.
      *C
      *C   02/11/97    CA YODER    REQ #95-015
      *C     ADDED LOGIC TO DISPLAY THE TWO COMMON SCREENS FOR THE
      *C     MATERIALS CONTROL REPORTS BEFORE THE INDIVIDUAL REPORT'S
      *C     SCREEN IS DISPLAYED.
      *C

015600 ENVIRONMENT DIVISION.
015700 CONFIGURATION SECTION.
015800 SOURCE-COMPUTER.  HP-3000.
015900 OBJECT-COMPUTER.  HP-3000.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
016000 INPUT-OUTPUT SECTION.

       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZRSCREEN-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

           SELECT MPLTINFO
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS MPLTINFO-STATUS.
016200     SELECT RPT-DEF-FILE ASSIGN TO DISK-DRPTDEF.
016400
016500 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                   PIC X(2000).
       FD  MPLTINFO
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

016700 FD RPT-DEF-FILE
016800     RECORD CONTAINS 92 CHARACTERS.
016900 01  RPT-DEF-REC.
           05  FILLER                    PIC X(12).
           05  RPT-NUMBER                PIC 9(4).
           05  RPT-RUN-CARD              PIC X(30).
           05  RPT-JOB-NAME              PIC X(8).
           05  RPT-FORMNAME              PIC X(15).
018200     05  RPT-PRTRPT-AREA.
               10  RPT-PRTRPT-FLAG       PIC X(1).
               10  RPT-PRTRPT-FILE       PIC X(17).
           05  RPT-PRINTER-TYPE          PIC X(1).
           05  RPT-INPUT-RECS            PIC X(1).
           05  RPT-INPUT-RECS-9   REDEFINES  RPT-INPUT-RECS
                                         PIC 9(1).
           05  FILLER                    PIC X(3).
017500
017600 WORKING-STORAGE SECTION.
       01  OPTION-AREA                   PIC X(220).
       01  END-FILE                      PIC X(1).
       01  SUB                           PIC S9(4) BINARY.
       01  SUB2                          PIC S9(4) BINARY.
       01  WORK-LINE                     PIC X(80).
       01  NUM-INPUT-RECS                PIC S9(4) BINARY.
       01  HOLD-PRINT-FILE               PIC X(10).
       01  FILE-TYPE                     PIC X(7)  VALUE "*FILE".
       01  CHKOBJ-STATUS                 PIC X(2).
       COPY FUNCTDEF IN COPYLIB.

       77  OPTION-FLAG                   PIC X(1)  VALUE "Y".
       77  INDX                          PIC 9(1)  VALUE 1.
       77  CALL-PGM-NAME                 PIC X(10).
019100
019200*************************************************************
019300**                                                          **
019400**          S U B P R O G R A M   A R E A S                 **
019500**                                                          **
019600**************************************************************
019700
019800 COPY TSHWRDFM   IN COPYLIB.
       COPY DISPDAT2   IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.
       COPY CATREAD    IN COPYLIB.
       COPY TBLOWUP    IN COPYLIB.
       COPY TLSHIFT    IN COPYLIB.
       COPY TRSHIFT    IN COPYLIB.
       01  DUMMY-BASE                    PIC X(16) VALUE SPACES.
       COPY CSTRMJB2   IN COPYLIB.
       COPY THDPRTB    IN COPYLIB.
       01  SPOOLER-NUMBER                PIC 9(3).
028000*---------- PARMS FOR CALL TO WHO INTRINSIC
028100 01  WHO-VARIABLES.
           05  MOD                       PIC S9(4) COMP-4.
           05  CAP                       PIC S9(8) COMP-4.
           05  LATTR                     PIC S9(8) COMP-4.
           05  USERNAME                  PIC X(8).
           05  GRPNAME                   PIC X(8).
           05  ACCTNAME                  PIC X(8).
           05  HOMEGRP                   PIC X(8).
           05  TNUM                      PIC 99 COMP-4.
           05  FILLER                    PIC XX.
029100
      *------ PARMS FOR CALL TO 'QCMDEXC': EXECUTE A COMMAND
       01  COMMAND-WORK                  PIC X(70).
       01  COMMAND-LEN      PIC S9(10)V9(5) COMP-3 VALUE 70.

       COPY MTLSCNTL IN COPYLIB.

       01  MTLS-REPORT-CHECK       PIC 9(2).
           88 MTLS-CNTL-RPT
                  VALUE 10 12 24 29 30 32 33 34 35 36 37 39 43 48 66.

029200**************************************************************
029300**                                                          **
029400**           D A T A B A S E   W O R K                      **
029500**                                                          **
029600**************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X  VALUE "0".
           05  FILE-STATUS-2             PIC X  VALUE "0".
029800 COPY DBSTAT     IN COPYLIB.
       01  PASSWORD                      PIC X(5)  VALUE "JADE;".
030000 01  DB-DATASETS.
           05  DSET-MPLTINFO             PIC X(16)  VALUE "MPLTINFO;".
030200
031000 01  MPLTINFO-ARG.
           05  MPLTINFO-SPOOLTYP-KEY     PIC X(1)  VALUE "*".
           05  MPLTINFO-PRT              PIC X(3).
031300
031400**************************************************************
031500**                                                          **
031600**           D A T A B A S E   B U F F E R S                **
031700**                                                          **
031800**************************************************************
031900
       01  MPLTINFO-STATUS             PIC X(2).
       COPY MPLT0 IN COPYLIB.
       COPY MPLTPOPT IN COPYLIB.
032700
032800**************************************************************
032900**                                                          **
033000**                V I E W   W O R K                         **
033100**                                                          **
033200**************************************************************
033300
035100 01  MESSAGE-BUFFER.
035200     05  MSG-TEXT.
               10  MESSAGE-BUFFER-1      PIC X(1)  VALUE SPACES.
               10  FILLER                PIC X(67) VALUE SPACES.
           05  MSG-FLD                   PIC X(8)   VALUE SPACES.
035400     05  MSG-FLD-9 REDEFINES MSG-FLD PIC ZZZZZZZ9.
035500
035900 01  HELP-FORM.
           05  HELP-NAME                 PIC X(4)  VALUE "HELP".
           05  HELP-RPT-JCW              PIC X(4)  VALUE SPACES.
036200
       01  FIELD-NUMBER                  PIC S9(4) COMP-4 VALUE ZERO.
036400
036500
036600**************************************************************
036700**                                                          **
036800**                 S C R E E N   D A T A                    **
036900**                                                          **
037000**************************************************************
037100
037200 01  DE-FIELDS.
           05  DE-FIELDS-AREA            PIC X(720) VALUE SPACES.
037300     05  DE-FIELDS-RDF REDEFINES DE-FIELDS-AREA.
037400         10  DE-OPTION-LINE OCCURS 9 TIMES PIC X(80).
           05  DE-COMMAND-LINE-1         PIC X(79).
           05  DE-MESSAGE-LINE-1         PIC X(79).
037600
037700 01  DE-ROUTE-FIELDS.
           05  DE-NAME                   PIC X(15).
           05  DE-DEPT                   PIC X(4).
           05  DE-PRINTER                PIC 9(2).
           05  DE-PAPER-FLAG             PIC X(1).
           05  DE-NO-OF-COPIES           PIC X(2).
           05  DE-COMMAND-LINE-2         PIC X(79).
           05  DE-MESSAGE-LINE-2         PIC X(79).
038300
038400 LINKAGE SECTION.
038500 01  BASE.
           05  BASE-1-2                  PIC X(2).
           05  FILLER                    PIC X(10).
038600 COPY VCOMLINK IN COPYLIB.
038700 COPY LANGSUB  IN COPYLIB.
       01  PASSED-RPT-NUMBER             PIC S9(4) COMP-4.
038900
039000 PROCEDURE DIVISION USING BASE,
039100                          VIEW-COMAREA,
                                LANGUAGE-PARMS,
                                PASSED-RPT-NUMBER.

039200 1000-HOUSEKEEP.
           OPEN INPUT MPLTINFO.
           MOVE "POPT" TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO.
           IF MPLTINFO-STATUS NOT = "00"
               MOVE "N" TO MPLTINFO-NOASCII-REPORTS
           END-IF.
           MOVE "Y"                      TO  OPTION-FLAG.
      *------ FIRST FIND THE REPORT IN THE REPORT DEF FILE.
           MOVE "OVRDBF FILE(DRPTDEF) TOFILE(MCHEADERS) MBR(DRPTDEF)"
                                         TO  COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.
           OPEN INPUT RPT-DEF-FILE.
           MOVE "N"                      TO  END-FILE.
           MOVE ZERO                     TO  RPT-NUMBER.
           PERFORM UNTIL END-FILE = "Y"
           OR PASSED-RPT-NUMBER = RPT-NUMBER
               READ RPT-DEF-FILE AT END
                   MOVE "Y"              TO  END-FILE
               END-READ
           END-PERFORM.
           IF END-FILE = "Y"
               MOVE "NO REPORT FOUND FOR JCW SPECIFIED"
                                         TO  BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

           IF RPT-INPUT-RECS NOT NUMERIC
               MOVE "1"                  TO  RPT-INPUT-RECS.

      *---------- IF MATERIALS CONTROL REPORT, SHOW FIRST TWO
      *---------- COMMON SCREENS FIRST.
           MOVE PASSED-RPT-NUMBER        TO  MTLS-REPORT-CHECK.
           IF MTLS-CNTL-RPT
               INITIALIZE            MSCRN-DATA-LINE
               CALL "SMTLSCRN" USING BASE,
                                     VIEW-COMAREA,
                                     LANGUAGE-PARMS,
                                     PASSED-RPT-NUMBER,
                                     MSCRN-DATA-LINE
               IF VIEW-LASTKEY = 3
                   GO TO 1000-END
               END-IF
               MOVE MSCRN-1-REC      TO CSTRM-RUN-CARD (4)
               MOVE MSCRN-1-REC2     TO CSTRM-RUN-CARD (5)
               MOVE MSCRN-2-REC      TO CSTRM-RUN-CARD (6)
               MOVE MSCRN-3-REC      TO CSTRM-RUN-CARD (7).

           OPEN I-O DISPLAY-FILE.
044400     PERFORM 6000-MAIN THRU 6990-MAIN-X.
       1000-END.
           CLOSE DISPLAY-FILE.
           CLOSE MPLTINFO.
044600     GOBACK.
044700
044800 2100-BLOWUP.
           MOVE PASSED-RPT-NUMBER        TO  BU-DISPLAY-FLD9 (1).
           MOVE "SRSCRNS2"               TO  BU-PGM-NAME.
045100     CALL "TBLOWUP" USING DUMMY-BASE BU-PGM-NAME
045200       STATUS-AREA VIEW-COMAREA FILE-STATUS
045300       BU-DISPLAY-MSG BU-DISPLAY-FLDS.
045400
045500**************************************************************
045600**                                                          **
045700**           P E R F O R M E D   R O U T I N E S            **
045800**                                                          **
045900**************************************************************
046000
047400 4030-SETERROR.
           MOVE B"1"                     TO  IND (99).
           MOVE B"1"                     TO  IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE-1, DE-MESSAGE-LINE-2.
051300
048800**************************************************************
048900**                                                          **
049000**               M A I N   P R O G R A M                    **
049100**                                                          **
049200**************************************************************
049300
049400 6000-MAIN.
           MOVE RPT-FORMNAME             TO  VIEW-NFNAME.
           MOVE SPACES                   TO  DE-FIELDS.
050500 6100-SHOWFORM.
           MOVE 7                        TO  SRF-KEYSET.
           MOVE "I" TO SRF-FKEY (6), SRF-FKEY (1).
           IF MTLS-CNTL-RPT
               MOVE 3                    TO  SRF-KEYSET
               MOVE "I" TO SRF-FKEY (6), SRF-FKEY (1).
           MOVE DE-FIELDS                TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           MOVE DISPLAY-REC              TO  DE-FIELDS.
           IF MESSAGE-BUFFER-1 NOT = SPACES
               PERFORM 4030-SETERROR
               GO TO 6100-SHOWFORM.

054100     IF VIEW-LASTKEY = EXIT-PROGRAM
054400         GO TO 6990-MAIN-X.
054500
      *---------- IF MATERIALS CONTROL REPORT, ALLOW USER TO
      *---------- GO BACK TO SMTLSCRN.
           IF MTLS-CNTL-RPT
              IF VIEW-LASTKEY = F4-KEY
                   CALL "SMTLSCRN" USING BASE,
                                         VIEW-COMAREA,
                                         LANGUAGE-PARMS,
                                         PASSED-RPT-NUMBER,
                                         MSCRN-DATA-LINE
                   IF VIEW-LASTKEY = EXIT-PROGRAM
                       GO TO 6990-MAIN-X
                   END-IF
                   MOVE MSCRN-1-REC      TO CSTRM-RUN-CARD (4)
                   MOVE MSCRN-1-REC2     TO CSTRM-RUN-CARD (5)
                   MOVE MSCRN-2-REC      TO CSTRM-RUN-CARD (6)
                   MOVE MSCRN-3-REC      TO CSTRM-RUN-CARD (7)
                   GO TO 6000-MAIN.

055900 6300-GET-ROUTE-SCREEN.
           MOVE "ROUTE"                  TO  VIEW-NFNAME.
           MOVE SPACES                   TO  DE-ROUTE-FIELDS.
           MOVE ZERO                     TO  DE-PRINTER.
           MOVE "01"                     TO  DE-NO-OF-COPIES.
056700
056800 6310-SHOW-FORM.
           IF MPLTINFO-NOASCII-REPORTS = "Y"
               MOVE B"0" TO IND(10)
               MOVE "X" TO DE-PAPER-FLAG
           ELSE
               MOVE B"1" TO IND(10).
           MOVE DE-ROUTE-FIELDS          TO  DISPLAY-REC.
       6315-SHOW.
           MOVE "I"                      TO  SRF-FKEY (6).
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           MOVE DISPLAY-REC              TO  DE-ROUTE-FIELDS.
           IF MESSAGE-BUFFER-1 NOT = SPACES
               PERFORM 4030-SETERROR
               GO TO 6315-SHOW.

057500     IF VIEW-LASTKEY = EXIT-PROGRAM
057800         GO TO 6990-MAIN-X.
057900
           IF DE-NAME = SPACES
      *        "T62: THIS FIELD IS REQUIRED"
               MOVE 20                   TO  LANG-SETNUM
               MOVE 62                   TO  LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 1                    TO  FIELD-NUMBER
               PERFORM 4030-SETERROR
               GO TO 6310-SHOW-FORM.

      *------ VALIDATE THAT THE MCPRT FILE ENTERED BY THE USER EXISTS.
           MOVE DE-PRINTER               TO  LS-SHIFT-FLD.
           CALL "TLSHIFT" USING LS-RET-CODE, LS-SHIFT-FLD.
           MOVE LS-SHIFT-FLD             TO  RS-SHIFT-FLD.
           CALL "TRSHIFT" USING LS-RET-CODE, RS-SHIFT-FLD.
           MOVE SPACES                   TO  HOLD-PRINT-FILE.
           STRING "MCPRT" DELIMITED BY SIZE,
                  RS-SHIFT-FLD-7-8 DELIMITED BY SPACES,
             INTO HOLD-PRINT-FILE.
           CALL "CCHKOBJ3" USING HOLD-PRINT-FILE, FILE-TYPE,
             CHKOBJ-STATUS.
           IF CHKOBJ-STATUS NOT = "00"
      *        "I91: INVALID PRTR: USE ANOTHER OR 'LP' FOR LINE PRTR"
               MOVE 9                    TO  LANG-SETNUM
               MOVE 91                   TO  LANG-MSGNUM
               MOVE 3                    TO  FIELD-NUMBER
               PERFORM 999-CATREAD
               PERFORM 4030-SETERROR
               GO TO 6310-SHOW-FORM.

      *------ DEFAULT THE NUMBER OF COPIES TO ONE.
           IF (DE-NO-OF-COPIES NOT NUMERIC) OR DE-NO-OF-COPIES = "00"
              MOVE "01"                  TO  DE-NO-OF-COPIES.

      *------ NOW PUT TOGETHER THE INPUT DATA FROM THE REPORT DEF
      *------ RECORD AND THE USER INPUT SCREEN, AND PASS IT TO
      *------ THE STREAM-JOB ROUTINE TO HANDLE THE DETAILS!
           MOVE DE-NAME                  TO  HD-NAME.
           MOVE DE-DEPT                  TO  HD-DEPT.
           MOVE DE-PRINTER               TO  SPOOLER-NUMBER.
           MOVE SPOOLER-NUMBER           TO  HD-SPOOLER-NUMBER.
           MOVE DE-PAPER-FLAG            TO  HD-PAPER-FLAG.
           MOVE DE-NO-OF-COPIES          TO  HD-NO-OF-COPIES.
           CALL "WHO" USING MOD, CAP, LATTR, USERNAME,
             GRPNAME, ACCTNAME, HOMEGRP, TNUM.
           MOVE USERNAME                 TO  HD-USER.
           MOVE ACCTNAME                 TO  HD-ACCOUNT.
           MOVE GRPNAME                  TO  HD-GROUP.
           MOVE TNUM                     TO  HD-TERM.

      *------ OVERRIDE IN THE JOB STREAM TO THE DESIRED PRINTER
           MOVE SPACES                   TO  WORK-LINE.
           STRING "OVRPRTF FILE(MCPRT) TOFILE(" DELIMITED BY SIZE,
                  HOLD-PRINT-FILE DELIMITED BY SPACES,
                  ") COPIES(" DELIMITED BY SIZE,
                  DE-NO-OF-COPIES DELIMITED BY SPACES,
                  ") SHARE(*YES)" DELIMITED BY SIZE
             INTO WORK-LINE.
           MOVE WORK-LINE                TO  CSTRM-RUN-CARD (1).

           MOVE "Y"                      TO  CSTRM-JOBCARD-FLAG.
           MOVE RPT-JOB-NAME             TO  CSTRM-JOBNAME.
           MOVE SPACES                   TO  WORK-LINE.
           STRING "CALL PGM(" DELIMITED BY SIZE,
                  RPT-RUN-CARD DELIMITED BY SPACES,
                  ")" DELIMITED BY SIZE
              INTO WORK-LINE.
           MOVE WORK-LINE                TO  CSTRM-RUN-CARD (2).
           MOVE HD-ROUTE-DATA            TO  CSTRM-RUN-CARD (3).
           MOVE ZERO                     TO  SUB.
      *---------- PARAMTERS FOR MATERIALS CONTROL REPORTS.
           IF MTLS-CNTL-RPT
               MOVE 7                    TO  SUB2
           ELSE
               MOVE 3                    TO  SUB2
               MOVE RPT-INPUT-RECS           TO  NUM-INPUT-RECS
               PERFORM UNTIL SUB >= NUM-INPUT-RECS
                   ADD 1                     TO  SUB
                   ADD 1                     TO  SUB2
                   MOVE DE-OPTION-LINE (SUB) TO  CSTRM-RUN-CARD (SUB2)
               END-PERFORM.

           CALL "CSTRMJB2" USING CSTRMJB2-PARMS, VIEW-COMAREA.

067800 6990-MAIN-X.
067900     EXIT.
068000
       COPY DISPCALL IN COPYLIB.
       COPY DISPCAL2 IN COPYLIB.
       COPY HCATREAD IN COPYLIB.
