       IDENTIFICATION DIVISION.
       PROGRAM-ID.          SRSCRNS.
       AUTHOR.              C.I.HILLES.
       DATE-WRITTEN.        12/26/84.
       DATE-COMPILED.
      *INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
      *
      *REMARKS.
      *D   THIS IS THE FRONT END OPTION SUBPROGRAM FOR MOST CSIS
      *D   REPORTS.
      *
      *    THIS PROGRAM READS A SCREEN OF REPORT OPTIONS OF A MAXIMUM
      *    OF 80 CHARACTERS, AND THEN STREAMS A JOB INTERACTIVELY,
      *    PASSING ON THE REPORT OPTIONS ENTERED BY THE USER.
      *    THE REPORT PROGRAM TO BE RUN IN THE JOB IS DETERMINED BY
      *    A JCW "RPT", WHICH IS SET TO THE REPORT NUMBER BEFORE THE
      *    RUN OF THIS PROGRAM.  THIS PROGRAM CAN BE USED AS THE OPTION
      *    PROGRAM FOR ANY REPORT, AS LONG AS THE LENGTH OF THE REPORT
      *    OPTIONS DOES NOT EXCEED 80 CHARACTERS.  IF THE LENGTH OF THE
      *    OPTIONS DOES EXCEED 80 BYTES, THEN A SEPERATE FRONT END
      *    OPTION PROGRAM MUST BE WRITTEN.
      *
      *    FILE OUTLINE FOR ADDING A REPORT DEFINITION TO THE
      *    FILE "DRPTDEF.PUB":
      *      REPORT-NUMBER         9(4).  THIS A NUMBER THAT THE JCW
      *                            "RPT" WILL BE SET TO BEFORE RUNNING
      *                            THIS PROGRAM.  THE JCW "RPT" WILL TELL
      *                            THIS PROGRAM WHICH ENTRY IN THE REPORT
      *                            DEFINITION FILE WE ARE USING.
      *
      *      REPORT RUN CARD       X(30). THIS IS THE RUN CARD FOR THE
      *                            REPORT PROGRAM.  FOR EXAMPLE, IF YOUR
      *                            REPORT WAS "XRPTOVER.OBJECT", THE RUN
      *                            CARD MIGHT BE...
      *                              "RUN XRPTOVER.OBJECT;LIB=P"
      *
      *      REPORT JOB NAME       X(8).  NAME OF THE JOB STREAM -
      *
      *      REPORT FORMNAME       X(15).  NAME OF THE FORM IN THE
      *                            "FRPTFORM" FILE FROM WHICH THE REPORT
      *                            OPTIONS ARE TO BE OBTAINED.
      *
      *      XPRTRPT FLAG          X(1).  PUT A "Y" HERE IF YOU WANT TO
      *                            RUN "XPRTRPT.OBJECT" - THE REPORT
      *                            PRINTING PROGRAM - FROM A FILE.
      *
      *      XPRTRPT FILE          X(17). IF USING THE "XPRTRPT" PROGRAM,
      *                            THE FILE NAME THAT THE REPORT WILL BE
      *                            PRINTED FROM GOES HERE.
      *
      *      PRINTER TYPE          X(1).  SET TO "0" TO FORCE AN MPE
      *                            SPOOLED PRINTER.  SET TO "1" TO FORCE
      *                            A "JSPOOLER" SPOOLED PRINTER.  LEAVE
      *                            BLANK TO LET IT BE DETERMINED BY
      *                            THE "MPLTINFO" ENTRY WHICH IT IS.
      *
      *     NUMBER OF BUFFERS      X(1).  NUMBER OF 80-CHARACTER INPUT
      *                            BUFFERS IN YOUR FORM.  IF LEFT BLANK
      *                            THE PROGRAM WILL DEFAULT TO "1".
      *
      *    ON JAN 23, 1985, CHANGED THIS PROGRAM TO READ THE REPORT
      *    OPTIONS FROM A FILE, RATHER THAN HAVE THEM HARD CODED INTO
      *    THE PROGRAM.  NOW ALL THAT IS NEEDED TO ADD A NEW REPORT
      *    TO THIS PROGRAM IS TO PUT THE REQUIRED ENTRIES INTO THE FILE
      *    "DRPTDEF.PUB".  ALSO CHANGED PARAMETERS TO MATCH CHANGES
      *    IN "TSTRMJOB" - WHICH NOW CAN ADD ALL JCW CARDS AND RUN CARD
      *    FOR RUNNING THE PROGRAM "XPRTRPT" TO THE JOB STREAM.
      *    CIH.
      *
      *    ON MARCH 4, 1985, MADE THE FOLLOWING CHANGES:
      *    1.  ADDED THE CAPABILITY TO RUN TO "JSPOOLER" SPOOLED PRINTERS
      *        AS WELL AS TO MPE SPOOLED PRINTERS.  THIS IS PASSED TO
      *        THIS PROGRAM THROUGH THE PRINTER TYPE PARAMETER IN THE
      *        "DRPTDEF" FILE.  THERE WILL BE A COUPLE DIFFERENCES IN
      *        THE "JSPOOLER" LOGIC:
      *          a.  THE "FILE PRNT1" STATEMENT, DIRECTING THE PRINTOUT
      *              FOR MPE SPOOLED PRINTERS, WILL BE LEFT OUT.
      *          b.  THE PRINTER NUMBER WILL NOT BE VERIFIED FOR
      *               JSPOOLER PRINTERS - NO WAY AT THIS TIME TO VERIFY.
      *          c.  JSPOOLER RPTS WILL PULL UP A DIFFERING ROUTING
      *              SCREEN.  THIS SCREEN WILL DEFAULT TO JSPOOLER
      *              NUMBER "99" RATHER THAN DEVICE "LP".  IT WILL ALSO
      *              SAY "ENTER SPOOLER NUMBER" RATHER THAN "ENTER
      *              PRINTER NUMBER".
      *
      *    2.  CHANGED THE PARAMETER PASSED FROM THE "DRPTDEF" FILE
      **       FROM THE FORMFILE NAME TO THE FORM NAME IN A SINGLE
      *        FILE "FRPTFORM".  FROM NOW ON ALL FORMS USED BY THIS
      *        PROGRAM WILL RESIDE IN THIS SINGLE FORMFILE, TO SAVE
      *        SPACE AND THE NUMBER OF FILE NAMES ON THE SYSTEM.
      *
      *    ON MARCH 26, 1985, MADE THE FOLLOWING CHANGES:
      *    1.  THE PRINTER NUMBER WILL ALWAYS BE ENTERED NOW INSTEAD
      *        OF JSPOOLER NUMBER.  THE NUMBER ENTERED WILL NOW BE
      *        VALIDATED OUT OF "MPLTINFO" DATA SET BY THE KEY
      *        "*XXX", WHERE XXX IS THE LDEV NUMBER.  THIS KEY WILL
      *        TELL WHETHER THE PRINTER IS JSPOOLER SPOOLED OR MPE
      *        SPOOLED, AND IF JSPOOLER SPOOLED IT WILL ALSO CONTAIN
      *        THE JSPOOLER NUMBER.  THIS PROGRAM WILL THEN CHOOSE
      *        MPE SPOOLED IF AVAILABLE, OTHERWISE WILL GO TO THE
      *        JSPOOLER NUMBER.
      *        THE "MPLTINFO" DATASET IS LOADED WITH THIS DATA BY A NEW
      *        PROGRAM "XPRTLOAD", WHICH GETS THE DATA FROM THE JSPOOLER
      *        DATABASE "PQUE".
      *
      *    2.  THE PAPER SIZE WILL BE ENTERED. THIS WILL BE PASSED TO
      *        THE REPORT PROGRAM IN "ROUTING DATA" CARD.  IT WILL ALSO
      *        BE PASSED TO THE PROGRAM "XPRTRPT" THROUGH THE JCW
      *        "PAPER".  IF 80 COLUMN PAPER IS DESIRED, THE REPORT WILL
      *        BE CONDENSED BY "XPRTRPT" IF IT IS USED.
      *    ON OCTOBER 21, 1985
      *        CHANGED THE PROGRAM TO BE COMPATIBLE WITH THE NATIVE
      *        LANGUAGE SUPPORT FACILITY.  CHANGED THE GROUP OF THE
      *        FORMFILE FROM FRPTFORM.PUB  TO FRSCREEN.FLANG001.  ALSO
      *        MADE CALLS TO NLAPPEND, CATOPEN, FINDJCW, CATREAD, AND
      *        CATCLOSE, AND CHANGED ALL CALLS TO TSHWRDFM TO TSHWRDF2.
      *                                                     PD RAGLOW.
      *
      *    ON JANUARY 3, 1985                            BARBARA WINTER
      *        ADDED CAPABILITY FOR REPORT SCREENS TO HAVE A HELP
      *        SCREEN AVAILABLE BY PRESSING f1 FUNCTION KEY.  THE
      **       HELP FORM NAME MUST BE NAMED "HELP" WITH A 4-DIGIT
      *        REPORT JCW NUMBER APPENDED TO IT.  EXAMPLE:  REPORT
      *        42 HELP SCREEN FORM WILL BE NAMED "HELP0042".  ONLY
      *        ONE HELP SCREEN PER REPORT IS ALLOWED.  FUNCTION KEY
      *        TO DISPLAY HELP SCREEN IS ALWAYS f1.
      *
      *    02/19/86
      *      CHANGED THIS PROGRAM TO A SUBPROGRAM SO IT CAN BE CALLED
      *      FROM STORES EXECUTIVE PROGRAM "TUDCSTR".  CIH.
      *
      *
      *    APRIL 29, 1986                        BARBARA WINTER.
      *      UPPED THE SORT SPACE FROM 30000 TO 40000 FOR EUROPEANS.
      *
      *    MAY 9, 1986                           BARBARA WINTER.
      *      ADDED A CALL TO VINITFORM BEFORE SHOWING THE REPORT SCREEN
      *      SO THAT DEFAULTS WOULD DISPLAY.
      *
      *    SEPT 1, 1987                           ANNETTE KRAUSS.
      *      PROGRAM IS NO LONGER LIMITED TO AN 80 BYTE REPORT
      *      OPTION BUFFER.  THE FIELD RPT-INPUT-RECS IN DRPTDEF.PUB
      *      CONTAINS THE NUMBER OF 80 BYTE BUFFERS TO BE ACCEPTED
      *      BY THE USER PROGRAM.
      *C
      *C   08/20/96  JEFF BUNGO
      *C     RETRIEVE POPT MPLTINFO PRINTER OPTIONS.   IF PRINTER
      *C     OPTION TO HAVE NO ASCII CONTROL CHARACTERS ON REPORTS
      *C     IS SET TO "Y" THEN DO NOT DISPLAY THE CHOICE OF 132
      *C     OR 80 COLUMN PRINT, DEFAULT TO 132 BY SELECTING X ON
      *C     DE-PAPER-FLAG.
      *C
      *C   08/20/96  JEFF BUNGO
      *C     REDUCE FIELD SIZE OF SPOOLER NUMBER TO 2 DIGITS.
      *C
      *C   05/02/02  CA YODER
      *C     IF THIS IS AN SAP PLANT, SHOW DIFFERENT SCREEN FOR
      *C     R13 REPORT (RPT #025).
      *
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  HP-3000.
       OBJECT-COMPUTER.  HP-3000.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.

       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZRSCREEN-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.
           SELECT MPLTINFO
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS MPLTINFO-STATUS.

           SELECT RPT-DEF-FILE ASSIGN TO DISK-DRPTDEF.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC        PIC X(1500).
       FD  MPLTINFO
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD RPT-DEF-FILE
           RECORD CONTAINS 92 CHARACTERS.
       01  RPT-DEF-REC          PIC X(92).


       WORKING-STORAGE SECTION.
       01  OPTION-AREA                   PIC X(220).

       01  RPT-DEF-WORK.
           05  FILLER                    PIC X(12).
           05  RPT-NUMBER                PIC 9(4).
           05  RPT-RUN-CARD              PIC X(30).
           05  RPT-JOB-NAME              PIC X(8).
           05  RPT-FORMNAME              PIC X(15).
           05  RPT-PRTRPT-AREA.
               10  RPT-PRTRPT-FLAG       PIC X(1).
               10  RPT-PRTRPT-FILE       PIC X(17).
           05  RPT-PRINTER-TYPE          PIC X(1).
           05  RPT-INPUT-RECS            PIC X(1).
           05  FILLER                    PIC X(3).

       77  OPTION-FLAG              PIC X(1)  VALUE "Y".
       77  INDX                     PIC 9(1)  VALUE 1.
       77  CALL-PGM-NAME            PIC X(10).
       77  SAVE-REQ-SYNR3-SW        PIC X(1).

      *************************************************************
      **                                                          **
      **          C O M M U N I C A T I O N S   A R E A S         **
      **                                                          **
      **************************************************************

       COPY TSHWRDFM   IN COPYLIB.
       COPY DISPDAT2   IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.
       COPY CATREAD    IN COPYLIB.
      *** COMM AREA FOR "TBLOWUP"
       01  BU-PGM-NAME              PIC X(8)  VALUE "TRSCREEN".
       01  DUMMY-KSAM-STAT          PIC X(2)  VALUE SPACES.
       01  BU-DISPLAY-MSG.
           05  BU-DISPLAY-MSG-1     PIC X(1)  VALUE SPACES.
           05  FILLER               PIC X(59) VALUE SPACES.
       01  BU-DISPLAY-AREA          PIC X(110) VALUE "0".
       01  BU-DISPLAY-FLDS REDEFINES BU-DISPLAY-AREA.
           05  BU-DISPLAY-LINE OCCURS 5 TIMES.
               10  BU-DISPLAY-FLD        PIC X(14).
               10  BU-DISPLAY-FLD9       PIC S9(8).
       01  DUMMY-BASE               PIC X(16) VALUE SPACES.
      *---------- PARAMETERS FOR CALL TO "TSTRMJOB" - TO STREAM JOB

       01  STRMJOB-COMAREA.
           05  STRM-RET-CODE             PIC X(2)  VALUE "00".
           05  STRM-MODE                 PIC S9(4) COMP-4 VALUE 0.
           05  STRM-CO-CODE              PIC X(3).
           05  STRM-PRE-RUN-CARDS.
               10  STRM-PRE-RUN-CARD1    PIC X(80) VALUE SPACES.
               10  STRM-PRE-RUN-CARD2    PIC X(80) VALUE SPACES.
               10  STRM-PRE-RUN-CARD3    PIC X(80) VALUE SPACES.
               10  STRM-PRE-RUN-CARD4    PIC X(80) VALUE SPACES.
           05  STRM-RUN-CARD             PIC X(80).
           05  STRM-JOB-NAME             PIC X(8).
           05  STRM-OPTION-CARD1.
               10  STRM-RT-NAME          PIC X(15).
               10  STRM-RT-DEPT          PIC X(4).
               10  STRM-RT-LP            PIC 9(3).
               10  STRM-RT-USER          PIC X(8).
               10  STRM-RT-ACCOUNT       PIC X(8).
               10  STRM-RT-GROUP         PIC X(8).
               10  STRM-RT-TERM          PIC X(4).
               10  STRM-RT-PAPER-FLAG    PIC X(1)  VALUE SPACES.
               10  STRM-RT-PRTRPT-FLAG   PIC X(1)  VALUE SPACES.
               10  STRM-RT-NO-OF-COPIES  PIC 9(2).
               10  FILLER                PIC X(26) VALUE SPACES.
           05  STRM-OPTION-CARD2         PIC X(720) VALUE SPACES.
           05  STRM-OPTION-CARD2-RDF REDEFINES STRM-OPTION-CARD2
                    OCCURS 9 TIMES       PIC X(80).
           05  STRM-OPTION-CARD2-CTR     PIC X(1)  VALUE "0".
           05  STRM-OPTION-CARD3         PIC X(80) VALUE SPACES.
           05  STRM-PRTRPT-AREA.
               10  STRM-PRTRPT-FLAG      PIC X(1).
               10  STRM-PRTRPT-FILE      PIC X(17).
               10  STRM-PRTRPT-SPOOLTYP  PIC X(1).
               10  STRM-PRTRPT-PRINTER   PIC 9(3).

      *---------- PARMS FOR CALL TO WHO INTRINSIC
       01  WHO-VARIABLES.
           05  MOD                      PIC S9(4) COMP-4.
           05  CAP                      PIC S9(8) COMP-4.
           05  LATTR                    PIC S9(8) COMP-4.
           05  USERNAME                 PIC X(8).
           05  GRPNAME                  PIC X(8).
           05  ACCTNAME                 PIC X(8).
           05  HOMEGRP                  PIC X(8).
           05  TNUM                     PIC 99 COMP-4.
           05  FILLER                  PIC XX.

      *------ PARMS FOR CALL TO 'QCMDEXC': EXECUTE A COMMAND
       01  COMMAND-WORK                      PIC X(70).
       01  COMMAND-LEN      PIC S9(10)V9(5) COMP-3 VALUE 70.

      **************************************************************
      **                                                          **
      **           D A T A B A S E   W O R K                      **
      **                                                          **
      **************************************************************
       COPY DBSTAT     IN COPYLIB.
       01  PASSWORD                   PIC X(5)  VALUE "JADE;".
       01  DB-DATASETS.
           05  DSET-MPLTINFO          PIC X(16)  VALUE "MPLTINFO;".

       01  MPLTINFO-ARG.
           05  MPLTINFO-SPOOLTYP-KEY  PIC X(1)  VALUE "*".
           05  MPLTINFO-PRT           PIC X(3).

      **************************************************************
      **                                                          **
      **           D A T A B A S E   B U F F E R S                **
      **                                                          **
      **************************************************************

       01  MPLTINFO-STATUS             PIC X(2).
       COPY MPLT0 IN COPYLIB.
       COPY MPLTPOPT IN COPYLIB.
       COPY MPLTPREQ IN COPYLIB.

      **************************************************************
      **                                                          **
      **                V I E W   W O R K                         **
      **                                                          **
      **************************************************************

       01  MESSAGE-BUFFER.
           05  MSG-TEXT.
               10  MESSAGE-BUFFER-1        PIC X(1)  VALUE SPACES.
               10  FILLER                  PIC X(67) VALUE SPACES.
           05  MSG-FLD                     PIC X(8)   VALUE SPACES.
           05  MSG-FLD-9 REDEFINES MSG-FLD PIC ZZZZZZZ9.

       01  HELP-FORM.
           05  HELP-NAME        PIC X(4)  VALUE "HELP".
           05  HELP-RPT-JCW     PIC X(4)  VALUE SPACES.

       01  FIELD-NUMBER         PIC S9(4) COMP-4 VALUE ZERO.


      **************************************************************
      **                                                          **
      **                 S C R E E N   D A T A                    **
      **                                                          **
      **************************************************************

       01  DE-FIELDS.
           05  DE-FIELDS-AREA               PIC X(720) VALUE SPACES.
           05  DE-FIELDS-RDF REDEFINES DE-FIELDS-AREA.
               10  DE-FIELDS-SUB OCCURS 9 TIMES PIC X(80).
           05  DE-COMMAND-LINE-1            PIC X(79).
           05  DE-MESSAGE-LINE-1            PIC X(79).

       01  DE-ROUTE-FIELDS.
           05  DE-NAME                      PIC X(15).
           05  DE-DEPT                      PIC X(4).
           05  DE-PRINTER                   PIC 9(2).
           05  DE-PAPER-FLAG                PIC X(1).
           05  DE-NO-OF-COPIES              PIC X(2).
           05  DE-COMMAND-LINE-2            PIC X(79).
           05  DE-MESSAGE-LINE-2            PIC X(79).

       LINKAGE SECTION.
       01  BASE.
           05  BASE-1-2                  PIC X(2).
           05  FILLER                    PIC X(10).
       COPY VCOMLINK IN COPYLIB.
       COPY LANGSUB  IN COPYLIB.
       01  PASSED-RPT-NUMBER             PIC S9(4) COMP-4.

       PROCEDURE DIVISION USING BASE,
                                VIEW-COMAREA,
                                LANGUAGE-PARMS,
                                PASSED-RPT-NUMBER.

       1000-HOUSEKEEP.
           OPEN INPUT MPLTINFO.
           MOVE "PREQ" TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO.
           IF MPLTINFO-STATUS NOT = "00"
               MOVE "N"                       TO  SAVE-REQ-SYNR3-SW
           ELSE
               MOVE MPLTINFO-REQ-SYNR3-SW     TO  SAVE-REQ-SYNR3-SW.
           MOVE "POPT" TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO.
           IF MPLTINFO-STATUS NOT = "00"
               MOVE "N" TO MPLTINFO-NOASCII-REPORTS
           END-IF.
           MOVE "Y" TO OPTION-FLAG.
           MOVE 1 TO INDX.
           OPEN I-O DISPLAY-FILE.
      *----------  IF LANG-MSGNUM = 9999, THE RELEASE SYSTEM IS
      *            CALLING THIS, OTHERWISE CSIS SYSTEM IS.
           IF LANG-MSGNUM = 999
               MOVE
               "OVRDBF FILE(DRPTDEF) TOFILE(MCHEADERS) MBR(DRPTDEFSLS)"
                 TO COMMAND-WORK
           ELSE
               MOVE
               "OVRDBF FILE(DRPTDEF) TOFILE(MCHEADERS) MBR(DRPTDEF)"
                 TO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.
           OPEN INPUT RPT-DEF-FILE.
           MOVE 2                     TO  SRF-MODE.

      *---------- READ IN THE FILE OF REPORT DEFINITIONS UNTIL
      *---------- THE CORRECT REPORT TO RUN IS FOUND.
       1110-READ-REPORT-LOOP.
           READ RPT-DEF-FILE INTO RPT-DEF-WORK AT END
               CLOSE RPT-DEF-FILE
               MOVE "NO REPORT FOUND FOR JCW SPECIFIED"
                 TO BU-DISPLAY-MSG
               PERFORM 2000-BLOWUP.

           IF PASSED-RPT-NUMBER = RPT-NUMBER
               MOVE RPT-RUN-CARD         TO  STRM-RUN-CARD
               MOVE RPT-JOB-NAME         TO  STRM-JOB-NAME
               MOVE RPT-PRTRPT-FLAG      TO  STRM-PRTRPT-FLAG
                                             STRM-RT-PRTRPT-FLAG
               MOVE RPT-PRTRPT-FILE      TO  STRM-PRTRPT-FILE
               GO TO 1200-GET-TERMTYPE.

           GO TO 1110-READ-REPORT-LOOP.

       1200-GET-TERMTYPE.
           CLOSE RPT-DEF-FILE.
      *---------- CALL THE "WHO" INTRINSIC TO PROVIDE ORIGINATING USER
      *---------- INFORMATION FOR THE REPORT HEADER.

           CALL "WHO" USING MOD, CAP, LATTR, USERNAME,
             GRPNAME, ACCTNAME, HOMEGRP, TNUM.
           MOVE USERNAME         TO  STRM-RT-USER.
           MOVE ACCTNAME         TO  STRM-RT-ACCOUNT.
           MOVE GRPNAME          TO  STRM-RT-GROUP.
           MOVE TNUM             TO  STRM-RT-TERM.
           IF RPT-INPUT-RECS = SPACES
               MOVE "1"        TO RPT-INPUT-RECS.
           MOVE RPT-INPUT-RECS TO STRM-OPTION-CARD2-CTR.

           PERFORM 6000-MAIN THRU 6990-MAIN-X.
           MOVE ZEROES TO LANG-MSGNUM.
           CLOSE DISPLAY-FILE.
           CLOSE MPLTINFO.
           GOBACK.

       2000-BLOWUP.
           MOVE PASSED-RPT-NUMBER TO  BU-DISPLAY-FLD9 (1).
           CALL "TBLOWUP" USING DUMMY-BASE BU-PGM-NAME
             STATUS-AREA VIEW-COMAREA DISPLAY-STATUS
             BU-DISPLAY-MSG BU-DISPLAY-FLDS.

      **************************************************************
      **                                                          **
      **           P E R F O R M E D   R O U T I N E S            **
      **                                                          **
      **************************************************************

       4030-SETERROR.
           MOVE B"1" TO IND (99).
           MOVE B"1" TO IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE-1, DE-MESSAGE-LINE-2.

      **************************************************************
      **                                                          **
      **               M A I N   P R O G R A M                    **
      **                                                          **
      **************************************************************

       6000-MAIN.
           MOVE RPT-FORMNAME             TO  VIEW-NFNAME.
      *-------- USE R3 SCREEN FOR THIS REPORT IF AN SAP PLANT.
           IF RPT-NUMBER = 25 AND SAVE-REQ-SYNR3-SW = "Y"
               MOVE "FACCRPTR3"          TO  VIEW-NFNAME.
           MOVE SPACES TO DE-FIELDS.
       6100-SHOW-FORM.
           MOVE 7                        TO   SRF-KEYSET.
           MOVE "I" TO SRF-FKEY (6).
           MOVE DE-FIELDS TO DISPLAY-REC.
       6105-SHOW.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           MOVE DISPLAY-REC TO DE-FIELDS.
           IF MESSAGE-BUFFER-1 NOT = SPACES
               PERFORM 4030-SETERROR
               GO TO 6105-SHOW.

           IF VIEW-LASTKEY NOT = 1
              GO TO 6110-CHECK-KEY.

      *---------  F1 IS ALWAYS A HELP SCREEN (IF IT EXISTS)
      *    MOVE RPT-NUMBER    TO HELP-RPT-JCW.
      *    MOVE HELP-FORM     TO VIEW-NFNAME.
      *    CALL "VGETNEXTFORM" USING VIEW-COMAREA.
      *---------  CHECK IF HELP SCREEN EXISTED TO DISPLAY
      *    IF VIEW-STATUS = 100
      *       MOVE 0 TO VIEW-STATUS
      *       "HELP SCREEN IS NOT AVAILABLE FOR THIS REPORT"
      *       MOVE  8 TO LANG-SETNUM
      *       MOVE  4 TO LANG-MSGNUM
      *       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
      *       MOVE 1 TO FIELD-NUMBER
      *       GO TO 4030-SETERROR.
      *    IF VIEW-STATUS NOT = 0
      *        MOVE "VGETNEXTFORM ERR 6000-M" TO BU-DISPLAY-MSG
      *        PERFORM 2000-BLOWUP.

       6105-SHOWFORM.
           MOVE DE-FIELDS TO DISPLAY-REC.
       6107-SHOW.
           MOVE "I" TO SRF-FKEY (6).
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           MOVE DISPLAY-REC TO DE-FIELDS.
           IF MESSAGE-BUFFER-1 NOT = SPACES
               PERFORM 4030-SETERROR
               GO TO 6107-SHOW.

           GO TO 6000-MAIN.

       6110-CHECK-KEY.
           IF VIEW-LASTKEY = 3
               GO TO 6990-MAIN-X.

           PERFORM 6111-MOVE-BUFFER UNTIL INDX > RPT-INPUT-RECS.
           GO TO 6300-GET-ROUTE-SCREEN.

       6111-MOVE-BUFFER.
           MOVE DE-FIELDS-SUB(INDX) TO STRM-OPTION-CARD2-RDF(INDX).
           ADD 1 TO INDX.

       6300-GET-ROUTE-SCREEN.
           MOVE "ROUTE"                  TO  VIEW-NFNAME.
           MOVE SPACES TO DE-ROUTE-FIELDS.
           MOVE ZERO TO DE-PRINTER.
           MOVE "01" TO DE-NO-OF-COPIES.

       6310-SHOW-FORM.
           IF MPLTINFO-NOASCII-REPORTS = "Y"
               MOVE B"0" TO IND(10)
               MOVE "X" TO DE-PAPER-FLAG
           ELSE
               MOVE B"1" TO IND(10).
           MOVE DE-ROUTE-FIELDS TO DISPLAY-REC.
       6315-SHOW.
           MOVE "I" TO SRF-FKEY (6).
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           MOVE DISPLAY-REC TO DE-ROUTE-FIELDS.
           IF MESSAGE-BUFFER-1 NOT = SPACES
               PERFORM 4030-SETERROR
               GO TO 6315-SHOW.

           IF VIEW-LASTKEY = 3
               GO TO 6990-MAIN-X.

           IF LANG-MSGNUM = 9999
              GO TO 6320-SKIP-VALIDATE.

           IF DE-NAME = SPACES
      *        "T62: THIS FIELD IS REQUIRED"
               MOVE 20 TO LANG-SETNUM
               MOVE 62 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 1 TO FIELD-NUMBER
               PERFORM 4030-SETERROR
               GO TO 6310-SHOW-FORM.

      *------ DEFAULT THE NUMBER OF COPIES TO ONE.
           IF (DE-NO-OF-COPIES NOT NUMERIC) OR DE-NO-OF-COPIES = "00"
              MOVE "01" TO DE-NO-OF-COPIES.

       6320-SKIP-VALIDATE.
           MOVE DE-NAME             TO  STRM-RT-NAME.
           MOVE DE-DEPT             TO  STRM-RT-DEPT.
           MOVE DE-PRINTER          TO  STRM-RT-LP.
           MOVE DE-PRINTER          TO  STRM-PRTRPT-PRINTER.
           MOVE DE-PAPER-FLAG       TO  STRM-RT-PAPER-FLAG.
           MOVE DE-NO-OF-COPIES     TO  STRM-RT-NO-OF-COPIES.
           MOVE RPT-PRTRPT-FLAG     TO  STRM-RT-PRTRPT-FLAG.

      *------ FOR IBM YOU CAN RUN THE REPORT ONLINE RATHER THAN IN
      *------ BATCH TO FACILITATE DEBUGGING/BREAKPOINTS.  THIS
      *------ CURRENTLY ONLY HANDLES 1 OPTION LINE.
           IF BASE-1-2 = "OL"
               PERFORM 8000-ONLINE-REPORT THRU 8090-OR-X
           ELSE
               CALL "TSTRMJOB" USING STRMJOB-COMAREA.

       6990-MAIN-X.
           EXIT.

       8000-ONLINE-REPORT.
           MOVE STRM-RUN-CARD TO CALL-PGM-NAME.
           MOVE STRM-OPTION-CARD2 TO OPTION-AREA.
           CALL CALL-PGM-NAME USING STRM-OPTION-CARD1,
                                    OPTION-AREA.
       8090-OR-X.
           EXIT.

       COPY DISPCALL IN COPYLIB.
       COPY DISPCAL2 IN COPYLIB.
       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.
