000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          SRSINQS.
000400 AUTHOR.              LYNN BUNN/ BARBARA WINTER.
000500 DATE-WRITTEN.        05/23/83.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS. THIS IS THE RECEIVING SLIP INQUIRY PROGRAM.
001000*************************************************************
001100*************************************************************
001200**                    S R S I N Q S                        **
001300**                                                         **
001400**    THIS IS THE MAIN RECEIVING SLIP INQUIRY SUBPROGRAM.  **
001500**                                                         **
001600**    THIS PROGRAM HANDLES BOTH RECIEVER AND  FREIGHT      **
001700**    INQUIRY.  THE USER MAY LOOK AT ALL RECEIVERS, OR     **
001800**    MAY CHOOSE TO BEGIN WITH A RECEIVER OTHER THAN THE   **
001900**    FIRST ONE.  AFTER THE BEGINNING RECEIVER NUMBER      **
002000**    IS SELECTED, THEN EITHER THE THE FREIGHT OR THE      **
002100**    RECEIVING ITEM INQUIRY MAY BE SELECTED.  KELLY       **
002200**    PLANTS THAT DO NOT HAVE CSIS RECEIVING SYSTEM MAY    **
002300**    ONLY LOOK AT ALL RECEIVERS AND NOT SPECIFIC ONES     **
002400**    DUE TO THEIR RECEIVING SLIP NUMBERING SYSTEM.        **
002500**                                                         **
002600*************************************************************
002700*************************************************************
002800*                    PROGRAM PARAMETERS                     *
002900*                                                           *
003000*    1.  LAST-RECEIVER             PIC 9(3).                *
003100*          LAST RECEIVER CREATED FOR THE PO.                *
003200*    2.  START-RECEIVER            PIC 9(3).                *
003300*          RECEIVER THAT THE USER WANTS TO START AT.        *
003400*    3.  PO                        PIC X(14).               *
003500*          PURCHASE ORDER CONTAINING RECEIVERS.             *
003600*    4.  SPOOL                     PIC S9(2).               *
003700*          PRINTER NUMBER FOR SCREEN PRINTOUTS.             *
003800*    5.  PLT-NUMBER                PIC X(3).                *
003900*          PLANT NUMBER RUNNING THE PROGRAM - NEEDED        *
004000*          FOR KELLY LOGIC.                                 *
004100*    6.  NO-LEFT-OFF-AT            PIC X(3).                *
004200*          WHEN GOING FROM RECEIVING SLIP INQUIRY TO        *
004300*          FREIGHT INQUIRY, (OR VICE VERSA) THE SECOND      *
004400*          INQUIRY PICKS UP ON THE SAME RECEIVER THAT       *
004500*          THE FIRST INQUIRY LEFT OFF AT.                   *
004600*    7.  INQUIRY                   PIC X.                   *
004700*          "F" IF FREIGHT INQUIRY IS CALLED FIRST;          *
004800*          "R" IF RECEIVING SLIP INQUIRY IS CALLED          *
004900*          FIRST.  THIS DETERMINES WHETHER A CALL TO        *
005000*          THE OTHER INQUIRY NEEDS TO BE PERFORMED          *
005100*          OR A GOBACK NEEDS TO BE DONE SO THAT             *
005200*          RECURSIVE CALLS BETWEEN THE TWO INQUIRIES        *
005300*          ARE NOT DONE.                                    *
005400*    8.  SAVE-LASTKEY              PIC S9(4).               *
005500*          SAVES THE LAST FUNCTION KEY ENTERED FROM THE     *
005600*          SUBROUTINE JUST RETURNED FROM.                   *
005700*************************************************************
005800*************************************************************
005900*               HISTORY OF PROGRAM CHANGES                  *
      *C  11/9/93   JEFF BUNGO  REQ #4502
      *C          ADDED ABILITY FOR USER TO CHOOSE INQUIRY AGAINST
      *C          EITHER THE LIVE OR HISTORY DATABASE.
      *
      *C  02/21/94  JEFF BUNGO REQ #6449
      *C     CHANGED PROGRAM TO USE NEW FIELDS ADDED TO HISTORY
      *C     DATABASE FILES.  THESE NEW FIELDS WERE ADDED TO
      *C     MATCH THE LIVE DATABASE.  THE NEW FIELDS WILL ALSO
      *C     BE DISPLAYED ON THE INQUIRY SCREENS.
      *C
      *C 08/16/95   JEFF BUNGO
      *C     ADDED FIELD TO ALLOW KELLY ONLY PLANTS TO INQUIRE
      *C     BY PRAPS RECEIVING SLIP NUMBER INSTEAD OF CSIS
      *C     RECEIVING SLIP NUMBER.
      *C
      *C 06/07/96   JEFF BUNGO
      *C     EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C     RECOMPILE TO PICK UP NEW FILE FORMATS.
      *C---------------------------------------------------------------
      *C MAR 10, 2005  D.RAUCH       DCR01    REQUEST# 2005-78515
      *C    NEW DISPLAY FILE ZSRSINQS  CREATED - FORMATS COPIED
      *C    FROM ZCSISINQ.
      *C---------------------------------------------------------------
      *C MMM DD, CCYY  XXXNAMEXXX    XXX01    REQUEST# 2005-XXXXX
      *C    XXXXXXXXXXXXXXXXXX DESC XXXXXXXXXXXXXXXXXXXXXXXXXXXXX
      *************************************************************

012500 ENVIRONMENT DIVISION.
012600 CONFIGURATION SECTION.
012700 SOURCE-COMPUTER.    HP-3000.
012800 OBJECT-COMPUTER.    HP-3000.
       SPECIAL-NAMES.  I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
012900 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
DCR01             ASSIGN TO WORKSTATION-ZSRSINQS-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS DYNAMIC
                  RELATIVE KEY IS RELATIVE-RECNO
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.
            SELECT MPORCV
              ASSIGN TO DATABASE-MCFLCS0101
              ORGANIZATION IS INDEXED
                ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
              FILE STATUS IS FILE-STATUS.
            SELECT MPORCV2
              ASSIGN TO DATABASE-MCFLCS0102
              ORGANIZATION IS INDEXED
                ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
              FILE STATUS IS FILE-STATUS.
            SELECT DRCVITEM-ST
              ASSIGN TO DATABASE-MCFLST0601
              ORGANIZATION IS INDEXED
                ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT DPORECD-ST
              ASSIGN TO DATABASE-MCFLST0301
              ORGANIZATION IS INDEXED
                ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
              FILE STATUS IS FILE-STATUS.
            SELECT MPLTINFO
              ASSIGN TO DATABASE-MCFLCS0501
              ORGANIZATION IS INDEXED
                ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
              FILE STATUS IS FILE-STATUS.
013000 DATA DIVISION.
013100 FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC          PIC X(2000).
       FD  MPORCV
           LABEL RECORDS ARE STANDARD.
       01  MPORCV-REC.
       COPY DDS-MCRPCS0100  OF MCFLCS0101.
       FD  MPORCV2
           LABEL RECORDS ARE STANDARD.
       01  MPORCV2-REC.
       COPY DDS-MCRPCS0100  OF MCFLCS0102.
       FD  DPORECD-ST
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-ST-REC.
       COPY DDS-MCRPST0300  OF MCFLST0301.
       FD  DRCVITEM-ST
           LABEL RECORDS ARE STANDARD.
       01  DRCVITEM-ST-REC.
       COPY DDS-MCRPST0600  OF MCFLST0601.
       FD  MPLTINFO
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC.
       COPY DDS-MCRPCS0500  OF MCFLCS0501.
013200 WORKING-STORAGE SECTION.
013300************************************************************
013400*            W O R K I N G   S T O R A G E                 *
013500************************************************************
       77  LIVE-LIT    PIC X(23)  VALUE "++++ LIVE DATABASE ++++".
       77  HISTORY-LIT PIC X(23)  VALUE "++ HISTORY DATABASE ++ ".

       01  RELATIVE-RECNO         PIC 9(9).

      *------ WS CONTROL AREA
       01  MAJOR-MINOR                 PIC XXXX.
       01  WS-CONTROL.
           02  FUNCTION-NUM            PIC XX.
                   88  EXIT-KEY-F8-USED                     VALUE "08". LVW000LS
                   88  REFRESH-KEY-F4-USED                  VALUE "04". LVW000LS
                   88  ENTER-KEY-USED                       VALUE "00". LVW000LS
                   88  F1-KEY-USED                          VALUE "01". LVW000LS
                   88  F2-KEY-USED                          VALUE "02". LVW000LS
                   88  F3-KEY-USED                          VALUE "03". LVW000LS
                   88  F4-KEY-USED                          VALUE "04". LVW000LS
                   88  F5-KEY-USED                          VALUE "05". LVW000LS
                   88  F6-KEY-USED                          VALUE "06". LVW000LS
                   88  F7-KEY-USED                          VALUE "07". LVW000LS
                   88  F8-KEY-USED                          VALUE "08". LVW000LS
           02 FUN-KEY REDEFINES FUNCTION-NUM PIC XX.
           02 TERMINAL-ID PIC X(10).
           02 FORMAT-NAME PIC X(10).

       01  DISPLAY-STATUS              PIC X(2).

       01  SRF-INDICATORS.
           05  IND OCCURS 99 TIMES   PIC 1 INDICATOR 01.

       COPY IOFEEDBACK OF COPYLIB.
       01  FILE-STATUS.
           05  FILE-STATUS-1         PIC X.
           05  FILE-STATUS-2         PIC X.
013600 01  SAVE-KEY                  PIC S9(4) VALUE ZEROES.
013700 COPY DBPOARG1 OF COPYLIB.
013800
013900**************************************************************
014000*                 C A L L E D  R O U T I N E S               *
014100**************************************************************
014200 01  RETURN-CODE               PIC X(2)     VALUE "00".
014300*---------- VSETERROR AND VPUTWINDOW
014400 01  MESSAGE-BUFFER            PIC X(76)    VALUE SPACES.
014500 01  MESSAGE-BUFFER-RD REDEFINES MESSAGE-BUFFER.
014600     05  MSG-BUFFER            PIC X(68).
014700     05  MSG-VALUE             PIC X(8).
014800 01  MESSAGE-BUFLEN            PIC S9(4)    VALUE 76 COMP-4.
014900 01  MESSAGE-ACTLEN            PIC S9(4)    VALUE 0  COMP-4.
015000 01  FIELD-NUMBER              PIC S9(4)    VALUE 1  COMP-4.
015100
015200 COPY TBLOWUP OF COPYLIB.
       COPY CATREAD  OF COPYLIB.
015400*---------  PARAMETERS FOR ALL INQUIRY SUBROUTINES (SINQRSI & SINQFRT)
015500 01  SUBROUTINE-PARMS.
015600     05  PASS-LAST-RECEIVER    PIC 999   VALUE ZEROES.
015700     05  PASS-START-RECEIVER   PIC 999   VALUE ZEROES.
015800     05  PASS-PO               PIC X(14) VALUE SPACES.
015900     05  PASS-SPOOL            PIC S9(2) VALUE ZEROES COMP-4.
016000     05  PASS-PLT-NUMBER       PIC X(3)  VALUE SPACES.
016100     05  PASS-NO-LEFT-OFF-AT   PIC 9(3)  VALUE ZEROES.
016200     05  PASS-INQUIRY          PIC X     VALUE SPACE.
016300     05  PASS-SAVE-LASTKEY     PIC S9(4) VALUE ZEROES COMP-4.
           05  PASS-HISTORY-FLAG     PIC X(1)  VALUE SPACES.
           05  PASS-ITEM             PIC 9(4)  VALUE ZEROS.
016500*************************************************************
016600*                        D A T A B A S E                    *
016700*************************************************************
016800 COPY DBSTAT OF COPYLIB.
016900 COPY DBMODES OF COPYLIB.
017300
017400 01  ITEMS-LISTING.
017600     05  PO-SEARCH             PIC X(10)    VALUE "PO-RCV-NO;".
017700
017800 01  ARGUMENT-VALUES.
018000     05  PO-ARG.
               10  PO-ARG-P          PIC X(01)    VALUE SPACES.
               10  PO-ARG-PO-NUMBER.
                   15  PO-ARG-PO     PIC X(07)    VALUE SPACES.
                   15  PO-ARG-REL    PIC X(03)    VALUE SPACES.
                   15  PO-ARG-RS     PIC X(03)    VALUE SPACES.
           05  PLT-ARG               PIC X(04)    VALUE SPACES.
018100 COPY MPORCV OF COPYLIB.
       COPY DRCVITMH OF COPYLIB.
       COPY DPORECDH OF COPYLIB.
       COPY MPLT0 OF COPYLIB.
       COPY MPLTP01 OF COPYLIB.
018300
018400 01  FORM-NAMES.
018500     05  RSORPO                PIC X(8)     VALUE "RSORPO_1".
018600     05  ALLRECSLIPS           PIC X(8)     VALUE "INQRSA_2".
018700
       01  SCREEN-BUFFER             PIC X(2000)  VALUE SPACES.
018800 01  SCREEN-BUFFER-RSINQ.
018900     05  DE-PO       PIC X(7)  VALUE SPACES.
019000     05  DE-RLSE     PIC X(3)  VALUE SPACES.
019100     05  DE-RS       PIC X(3)  VALUE SPACES.
019200     05  DE-RS-9  REDEFINES DE-RS  PIC 9(3).
           05  DE-PRAPS    PIC X(6)  VALUE SPACES.
           05  DE-LIVE-HISTORY PIC X(23) VALUE SPACES.
           05  DE-COMMAND-LINE1      PIC X(79).
           05  DE-MESSAGE-LINE1      PIC X(79).
019300
019400 01  SCREEN-BUFFER-INQRSA.
019500     05  VIEW-PO     PIC X(7)  VALUE SPACES.
019600     05  VIEW-RLSE   PIC X(3)  VALUE SPACES.
019700     05  VIEW-LAST-RS PIC 9(3) VALUE ZEROES.
019800     05  DE-RS-ALL    PIC 9(3) VALUE ZEROES.
           05  VIEW-LIVE-HISTORY PIC X(23) VALUE SPACES.
           05  DE-COMMAND-LINE2      PIC X(79).
           05  DE-MESSAGE-LINE2      PIC X(79).
019900
020000 LINKAGE SECTION.
020100 01  BASE                 PIC X(10).
020200 COPY VCOMLINK OF COPYLIB.
020300 COPY LANGSUB OF COPYLIB.
020400
020500 PROCEDURE DIVISION USING BASE, VIEW-COMAREA, LANGUAGE-PARMS.
020600 00-CONTROL.
           OPEN INPUT MPORCV
                      MPORCV2
                      DPORECD-ST
                      DRCVITEM-ST
                      MPLTINFO.
           OPEN I-O DISPLAY-FILE.
           MOVE "P 01" TO PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-READ.
           IF FILE-STATUS = "00"
               MOVE MPLTINFO-COMPANY TO PASS-PLT-NUMBER.
           MOVE SPACES TO PASS-HISTORY-FLAG.
021000     PERFORM 100-DISPLAY-MAIN-SCREEN  THRU 199-EXIT.
           CLOSE MPORCV
                 MPORCV2
                 MPLTINFO.
           CLOSE DISPLAY-FILE.
021200     GOBACK.
021300
022300*************************************************************
022400*************************************************************
022500*                    PROCEDURE DIVISION                     *
022600*     DISPLAY THE SCREEN THAT REQUESTS A SPECIFIC RECEIVER  *
022700*  NUMBER TO BEGIN BROWSING THROUGH OR REQUESTS ALL         *
022800*  RECEIVERS TO BE SHOWN.  THEN A SELECTION BASED ON        *
022900*  FUNCTION KEYS IS MADE TO CHOOSE THE RECEIVER OR THE      *
023000*  FREIGHT INQUIRY.  ONCE A RECEIVER NUMBER IS ENTERED,     *
023100*  THE USER MAY GO BACKWARDS AND LOOK AT ALL PREVIOUS       *
023200*  RECEIVERS EVEN THOUGH HE ELECTED TO BEGIN SOMEWHERE      *
023300*  AFTER THE FIRST RECEIVER.                                *
023400*                                                           *
023800*       1.  PO NUMBER IS VALIDATED FOR EXISTENCE.           *
023900*       2.  THE REQUIRED SUBROUTINE IS CALLED.              *
024000*************************************************************
024100*************************************************************
024200 100-DISPLAY-MAIN-SCREEN.
024300     MOVE RSORPO     TO  VIEW-NFNAME.
025700     MOVE SPACES     TO  SCREEN-BUFFER-RSINQ.
           MOVE ZEROES     TO  DE-RS-9.
           MOVE "000"      TO  DE-RLSE.
           MOVE "000000"   TO  DE-PRAPS.
           IF PASS-HISTORY-FLAG = "Y"
               MOVE HISTORY-LIT TO DE-LIVE-HISTORY
           ELSE
               MOVE LIVE-LIT   TO  DE-LIVE-HISTORY.

025800 105-SHOW-FORM.
           MOVE SCREEN-BUFFER-RSINQ TO SCREEN-BUFFER.
           MOVE SCREEN-BUFFER TO DISPLAY-REC.
           IF PASS-PLT-NUMBER = "211" OR "281" OR "285"
               MOVE B"1" TO IND(88)
           ELSE
               MOVE B"0" TO IND(88)
           END-IF.
           WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
              INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO SRF-INDICATORS.
           MOVE DISPLAY-REC TO SCREEN-BUFFER.

      *------ A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *------ IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.
035800
036200     IF VIEW-LASTKEY EQUAL 5 OR
036400        VIEW-LASTKEY EQUAL 8 OR
036600        VIEW-LASTKEY EQUAL 7
              MOVE 9 TO LANG-SETNUM
              MOVE 10 TO LANG-MSGNUM
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
036800        PERFORM 940-VSETERROR THRU 949-EXIT
036900        GO TO 105-SHOW-FORM.
026700
026800     IF VIEW-LASTKEY EQUAL 3
026900         GO TO 199-EXIT.
027000
           MOVE SCREEN-BUFFER TO SCREEN-BUFFER-RSINQ.

      *----------  CHANGE WHICH DATABASE TO INQUIRE
           IF VIEW-LASTKEY = 6
               IF PASS-HISTORY-FLAG = "Y"
                   MOVE SPACES TO PASS-HISTORY-FLAG
                   MOVE LIVE-LIT TO DE-LIVE-HISTORY
               ELSE
                   MOVE "Y" TO PASS-HISTORY-FLAG
                   MOVE HISTORY-LIT TO DE-LIVE-HISTORY
               END-IF
               GO TO 105-SHOW-FORM
           END-IF.

027100     MOVE VIEW-LASTKEY TO PASS-SAVE-LASTKEY, SAVE-KEY.
027200
027800
027900*----------  CHECK FOR "999" IN RLSE FIELD
028000     IF DE-RLSE = "999"
028100        MOVE 20 TO LANG-SETNUM
028200        MOVE 49 TO LANG-MSGNUM
028300*   THERE ARE NO RECEIVERS ON A BLANKET
028400         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
028500         PERFORM  940-VSETERROR THRU 949-EXIT
028600         GO TO  105-SHOW-FORM.
028700
      *----------  CONVERT PRAPS NUMBER TO CSIS
           IF DE-PRAPS NOT = "000000"
               IF PASS-HISTORY-FLAG NOT = "Y"
                   MOVE DE-PRAPS TO PORCVSEQ OF MPORCV2-REC
                   READ MPORCV2 INTO BUF-MPORCV
                       INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                   END-READ
                   IF FILE-STATUS NOT = "00"
      *----------------- RECEIVING SLIP DOES NOT EXIST
                       MOVE  4  TO FIELD-NUMBER
                       MOVE  18 TO LANG-SETNUM
                       MOVE  65 TO LANG-MSGNUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       PERFORM 940-VSETERROR THRU 949-EXIT
                       GO TO  105-SHOW-FORM
                   ELSE
                       MOVE M-PO-RCV-NO-2-8 TO DE-PO
                       MOVE M-PO-RCV-NO-9-11 TO DE-RLSE
                       MOVE M-PO-RCV-NO-12-14 TO DE-RS
                   END-IF
               ELSE
                   MOVE  4  TO FIELD-NUMBER
                   MOVE "PRAPS NUMBER NOT STORED WITH HISTORY"
                     TO MESSAGE-BUFFER
                   PERFORM 940-VSETERROR THRU 949-EXIT
                   GO TO  105-SHOW-FORM
               END-IF
           END-IF.

028800*----------  BUILD PO KEY VALUE
028900     MOVE "P"                   TO WS-PO-INDIC.
029000     MOVE DE-PO                 TO  WS-PO.
029100     MOVE DE-RLSE               TO  WS-RLSE.
029200     MOVE ZEROES                TO  WS-RS.
029300     MOVE WS-RECEIVER         TO  PO-ARG.

029400
029500*----------  VALIDATE THE PO AND GET LAST RECEIVER
           IF PASS-HISTORY-FLAG = "Y"
               PERFORM 300-VALIDATE-HISTORY-PO THRU 300-EXIT
               GO TO 107-VALIDATE-THE-RECEIVER.

           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF MPORCV-REC.
           READ MPORCV INTO BUF-MPORCV
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
030700     IF NO-ENTRY
030800         MOVE  1  TO FIELD-NUMBER
030900         MOVE  16 TO LANG-SETNUM
031000         MOVE  45 TO LANG-MSGNUM
031100         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
031200         PERFORM  940-VSETERROR THRU 949-EXIT
031300         GO TO  105-SHOW-FORM
031400     ELSE
031500       IF NOT GOOD-CALL
031600         MOVE "DBGET MPORCV ERROR 105 RSINQ"  TO  BU-DISPLAY-MSG
031700         PERFORM 990-BLOWUP THRU 999-EXIT.
031800
031900     IF M-PO-RCV-STAT = SPACES
032000         MOVE 1  TO  FIELD-NUMBER
032100         MOVE  20 TO LANG-SETNUM
032200         MOVE  48 TO LANG-MSGNUM
032300         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
032400         PERFORM  940-VSETERROR THRU 949-EXIT
032500         GO TO  105-SHOW-FORM.
032600
032700     IF M-PO-RCV-STAT = "BB  "
032800         MOVE 1  TO  FIELD-NUMBER
032900         MOVE  20 TO LANG-SETNUM
033000         MOVE  49 TO LANG-MSGNUM
033100         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
033200         PERFORM  940-VSETERROR THRU 949-EXIT
033300         GO TO  105-SHOW-FORM.
033400
033500*----------  VALIDATE THE RECEIVER IF ENTERED
033900 107-VALIDATE-THE-RECEIVER.
           MOVE M-PO-LAST-RCVR TO PASS-LAST-RECEIVER.
034400     IF DE-RS = "000"
034500         MOVE 1               TO PASS-START-RECEIVER
                                       PASS-NO-LEFT-OFF-AT
                                       PASS-ITEM
034600         GO TO 110-CALL-SUBROUTINES
034700     ELSE
034800         MOVE DE-RS           TO WS-RS
034900         MOVE DE-RS-9         TO PASS-START-RECEIVER
                                       PASS-NO-LEFT-OFF-AT.
035000
035100     MOVE WS-RECEIVER       TO  PO-ARG.
           MOVE 0 TO COND-WORD.

           IF PASS-HISTORY-FLAG = "Y"
               PERFORM 310-VALIDATE-HISTORY-RECEIVER THRU 310-EXIT
           ELSE
               MOVE PO-ARG TO PORCVNO OF MPORCV-REC
               READ MPORCV INTO BUF-MPORCV
                   INVALID KEY MOVE 17 TO COND-WORD
           END-IF.

           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
035400     IF NOT GOOD-CALL
035500         IF NO-ENTRY
035600             MOVE  1  TO FIELD-NUMBER
035700             MOVE  18 TO LANG-SETNUM
035800             MOVE  65 TO LANG-MSGNUM
035900             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
036000             PERFORM 940-VSETERROR THRU 949-EXIT
036100             GO TO  105-SHOW-FORM
036200         ELSE
                   IF PASS-HISTORY-FLAG NOT = "Y"
036300                 MOVE "DBGET MPORCV ERROR 105 SRSINQS"
036400                            TO BU-DISPLAY-MSG
                   ELSE
036300                 MOVE "DBGET DRCVITEM-ST ERROR 105 SRSINQS"
036400                            TO BU-DISPLAY-MSG
                   END-IF
036500             PERFORM 990-BLOWUP THRU 999-EXIT.
036600
036700     MOVE DE-RS           TO WS-RS.
036800     MOVE WS-RECEIVER   TO PO-ARG.
036900
037000*************************************************************
037100*         CALL EITHER THE ITEM OR "ALL" ROUTINE FOR         *
037200*         FOR RECEIVER INQUIRY; THE FREIGHT OR "ALL"        *
037300*         ROUTINE FOR FREIGHT INQUIRY.  THE "ALL"           *
037400*         PARAGRAPH WILL IN TURN CALL EITHER THE ITEM OR    *
037500*         FREIGHT INQUIRY DEPENDING ON WHICH FUNCTION       *
037600*         KEY IS PASSED FROM ABOVE.(F1 OR F2)               *
037700*************************************************************
037800 110-CALL-SUBROUTINES.
037900     MOVE PO-ARG TO PASS-PO.
038000
038100*----------  f1=RECEIVER INQUIRY
038200     IF PASS-SAVE-LASTKEY = 1 OR 0
038300        MOVE "R" TO PASS-INQUIRY
038400        IF WS-RS > "000"
038600            CALL "SINQRSI" USING BASE, VIEW-COMAREA,
038700                                 SUBROUTINE-PARMS, LANGUAGE-PARMS
038800        ELSE
038900            PERFORM 200-ALL-RECEIVERS THRU 299-EXIT
039000
039100*----------  FREIGHT INQUIRY
039200     ELSE
039300     IF PASS-SAVE-LASTKEY = 2
039400        MOVE "F" TO PASS-INQUIRY
039500        IF WS-RS > "000"
039700            CALL "SINQFRT" USING BASE, VIEW-COMAREA,
039800                                 SUBROUTINE-PARMS, LANGUAGE-PARMS
039900        ELSE
040000            PERFORM 200-ALL-RECEIVERS THRU 299-EXIT

      *----------  ITEM CORRECTION INQUIRY
           ELSE
           IF PASS-SAVE-LASTKEY = 4
               IF WS-RS > "000"
                   CALL "SINQRSIC" USING BASE, VIEW-COMAREA,
038700                                 SUBROUTINE-PARMS, LANGUAGE-PARMS
038800        ELSE
038900            PERFORM 200-ALL-RECEIVERS THRU 299-EXIT.
040100
           IF PASS-SAVE-LASTKEY = 1 OR 2 OR 4
               GO TO 110-CALL-SUBROUTINES
           ELSE
040300         GO TO 100-DISPLAY-MAIN-SCREEN.
040400
040500 199-EXIT.  EXIT.
040600
040700 200-ALL-RECEIVERS.
           MOVE SPACES                TO SCREEN-BUFFER-INQRSA.
040800     MOVE DE-PO                 TO VIEW-PO.
040900     MOVE DE-RLSE               TO VIEW-RLSE.
041000     MOVE PASS-LAST-RECEIVER    TO VIEW-LAST-RS.
           MOVE ZEROES                TO DE-RS-ALL.
           IF PASS-HISTORY-FLAG = "Y"
               MOVE HISTORY-LIT       TO VIEW-LIVE-HISTORY
           ELSE
               MOVE LIVE-LIT          TO VIEW-LIVE-HISTORY.
041100     MOVE ALLRECSLIPS TO  VIEW-NFNAME.
042000
042700 250-SHOW-FORM.
           MOVE SCREEN-BUFFER-INQRSA TO SCREEN-BUFFER.
           MOVE SCREEN-BUFFER TO DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
              INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO SRF-INDICATORS.
           MOVE DISPLAY-REC TO SCREEN-BUFFER.

      *------ A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *------ IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.
035800
036200     IF VIEW-LASTKEY EQUAL 2 OR
036400        VIEW-LASTKEY EQUAL 8 OR
036500        VIEW-LASTKEY EQUAL 4 OR
036700        VIEW-LASTKEY EQUAL 6
              MOVE 9 TO LANG-SETNUM
              MOVE 10 TO LANG-MSGNUM
              PERFORM 999-CATREAD
036800        PERFORM 940-VSETERROR THRU 949-EXIT
036900        GO TO 250-SHOW-FORM.
043500
043600     IF VIEW-LASTKEY EQUAL 3 OR 7
043700        MOVE VIEW-LASTKEY TO PASS-SAVE-LASTKEY
043800        GO TO 299-EXIT.
043900
044000     MOVE SCREEN-BUFFER TO SCREEN-BUFFER-INQRSA.
044500
           IF DE-RS-ALL > VIEW-LAST-RS
              MOVE "THIS NUMBER IS NOT A RECIEVING SLIP NUMBER"
                 TO MESSAGE-BUFFER
              PERFORM 940-VSETERROR
              GO TO 250-SHOW-FORM.

044600     MOVE PASS-PO             TO  WS-RECEIVER.
      *    MOVE VIEW-PO             TO  WS-PO.
      *    MOVE VIEW-RLSE           TO  WS-RLSE.
044700     MOVE DE-RS-ALL           TO  WS-RS-9.
044800     MOVE WS-RECEIVER       TO  PASS-PO.
044900
045000      IF DE-RS-ALL NOT = ZEROES
045100          MOVE DE-RS-ALL     TO  PASS-START-RECEIVER
                                       PASS-NO-LEFT-OFF-AT.
045200
045300*----------  RECEIVER INQUIRY = F1; FREIGHT INQUIRY = F2
045400     IF SAVE-KEY = 1 OR 0
045500        CALL "SINQRSI" USING BASE, VIEW-COMAREA,
045600                             SUBROUTINE-PARMS, LANGUAGE-PARMS
045700     ELSE
           IF SAVE-KEY = 2
045800        CALL "SINQFRT" USING BASE, VIEW-COMAREA,
045900                             SUBROUTINE-PARMS, LANGUAGE-PARMS
045700     ELSE
           IF SAVE-KEY = 4
045800        CALL "SINQRSIC" USING BASE, VIEW-COMAREA,
045900                             SUBROUTINE-PARMS, LANGUAGE-PARMS.
           MOVE PASS-NO-LEFT-OFF-AT TO WS-RS-9.
046000 299-EXIT.  EXIT.

       300-VALIDATE-HISTORY-PO.
      *----- VALIDATE PO IS IN HISTORY DB AND GET LAST RECEIVER
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG-PO-NUMBER TO PORCVNO OF DPORECD-ST-REC.
           READ DPORECD-ST INTO BUF-DPORECD-H
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
030700     IF NO-ENTRY
      *--------- P.O. DOES NOT EXIST IN HISTORY FILE
030800         MOVE  1  TO FIELD-NUMBER
030900         MOVE  16 TO LANG-SETNUM
031000         MOVE  54 TO LANG-MSGNUM
031100         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
031200         PERFORM  940-VSETERROR THRU 949-EXIT
031300         GO TO  105-SHOW-FORM
031400     ELSE
031500       IF NOT GOOD-CALL
031600         MOVE "DBGET DPORECD-ST ERR 300-RSINQ" TO BU-DISPLAY-MSG
               MOVE PO-ARG TO BU-DISPLAY-FLD (2)
031700         PERFORM 990-BLOWUP THRU 999-EXIT.

      *----- LAST RECEIVER FOR PO
           MOVE POH-LAST-RCVR TO M-PO-LAST-RCVR.
       300-EXIT.
           EXIT.

       310-VALIDATE-HISTORY-RECEIVER.
      *----- VALIDATE RECEIVING SLIP IS IN HISTORY DB
           MOVE PO-ARG-PO-NUMBER TO PORCVNO OF DRCVITEM-ST.
           START DRCVITEM-ST KEY NOT < PORCVNO OF DRCVITEM-ST
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               GO TO 310-EXIT.
           READ DRCVITEM-ST NEXT INTO BUF-DRCVITEM-H
               AT END MOVE 17 TO COND-WORD.
           IF PORCVNO OF DRCVITEM-ST-REC NOT = PO-ARG-PO-NUMBER
               MOVE 17 TO COND-WORD.
       310-EXIT.
           EXIT.

047100******************************************************************
047200*   DISPLAY ERROR MESSAGE FOR SPECIFIC FIELD ON SCREEN           *
047300******************************************************************
047400 940-VSETERROR.
           MOVE B"1" TO IND (99).
           MOVE B"1" TO IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE1
                                  DE-MESSAGE-LINE2.
051300

048600 949-EXIT.  EXIT.
048700************************************************************
048800*                    B L O W U P                           *
048900*     CHECK FOR IMAGE, VIEW, OR SPOOL ERROR.  CLOSE        *
049000*     FILES, GET OUT OF BLOCK MODE, AND DISPLAY            *
049100*     APPROPRIATE ERROR MESSAGE ON SCREEN.                 *
049200*                                                          *
049300*     ALSO APPENDS THE ERROR MESSAGE TO A FILE CALLED      *
049400*     BLOWUP.PUB.  TO READ THIS FILE, RUN "XBLPRT.OBJECT". *
049500*                                                          *
049600*         |||  PROGRAM IS ABORTED IN TBLOWUP  |||          *
049700************************************************************
049800 990-BLOWUP.
049900     MOVE "SRSINQS"   TO BU-PGM-NAME.
050000     MOVE VIEW-NFNAME TO BU-DISPLAY-FLD (1).
050100     MOVE PO-ARG      TO BU-DISPLAY-FLD (2).
050300     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
050400           VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
050500           BU-DISPLAY-FLDS.
050600 999-EXIT.  EXIT.
050700
050800 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
052400 999-CATREAD-EXIT.
052500     EXIT.
