       IDENTIFICATION DIVISION.

       PROGRAM-ID.     SRSNCDPF.
       AUTHOR.         EXLTECH, LLC - DAN RAUCH

      ***************************************************************
      **           REASON CODE  SELECTION PROGRAM
      ***************************************************************

      *================================================================
       ENVIRONMENT DIVISION.
      *===============================================================
       CONFIGURATION SECTION.

       SOURCE-COMPUTER.       IBM-AS400.
       OBJECT-COMPUTER.       IBM-AS400.
       SPECIAL-NAMES.         LOCAL-DATA LDA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT DISPLAY-FILE  ASSIGN TO WORKSTATION-ZRSNCDPF-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS DYNAMIC
                  FILE STATUS IS WS-FILE-STATUS
                  RELATIVE KEY IS WS-RRN
                  CONTROL-AREA IS WS-KEYBOARD-RETURN-AREA.

      ** PHYSICAL KEYED BY RSN CODE X(04)
           SELECT RSNCDE-FILE  ASSIGN TO DATABASE-MCFPAB2600
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS IS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

      *================================================================
       DATA DIVISION.
      *================================================================
       FILE SECTION.

       FD  DISPLAY-FILE.
       01  DISPLAY-REC.
       COPY DDS-ALL-FORMATS OF ZRSNCDPF.

       FD  RSNCDE-FILE.
       01  RSNCDE-REC.
       COPY DDS-ALL-FORMATS OF MCFPAB2600.

      *----------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *----------------------------------------------------------------
       01  WS-PGM-VERSION          PIC X(10)       VALUE "SRSNCDE01".

       COPY FILESTATUS IN COPYLIB.
       COPY KEYBDRTN    IN COPYLIB.

      *****************************************************************
      *  ALL PROGRAM INDICATORS
      *****************************************************************
       01  WS-ALL-INDICATORS.
           03  IN83              PIC 1   INDIC 83   VALUE B"0".
               88  SFLEND-OFF                       VALUE B"0".
               88  SFLEND-ON                        VALUE B"1".

           03  IN84              PIC 1   INDIC 84   VALUE B"0".
               88  SFL-CLEAR-OFF                    VALUE B"0".
               88  SFL-CLEAR-ON                     VALUE B"1".

           03  IN85              PIC 1   INDIC 85   VALUE B"0".
               88  SFL-DISPLAY-OFF                  VALUE B"0".
               88  SFL-DISPLAY-ON                   VALUE B"1".

           03  IN86              PIC 1   INDIC 86   VALUE B"0".
               88  SFLNXTCHG-OFF                    VALUE B"0".
               88  SFLNXTCHG-ON                     VALUE B"1".

       01  WS-ALL-SCREEN-FIELDS.

            03  WS-H01-FLDS.
                05  VERSION           PIC X(10)          VALUE SPACE.

            03  WS-B01-FLDS.
                05  MSSG              PIC X(74)          VALUE SPACE.

            03  WS-CTL01-FLDS.
                05  CRRN              PIC S9(04)         VALUE +0.
                05  CREC              PIC X(10)          VALUE SPACE.
                05  CFLD              PIC X(10)          VALUE SPACE.

            03  WS-SFL01-FLDS.
                05  SEL               PIC X(01)          VALUE SPACE.
                05  RCODE             PIC X(04)          VALUE SPACE.
                05  RDESC             PIC X(74)          VALUE SPACE.

      *****************************************************************
      *  PROGRAM MESSAGES
      *****************************************************************
       01  WS-PROGRAM-MESSAGES.
           03  WS-NORECS-MSSG       PIC  X(79)         VALUE
               "Reason Code File is Empty".

      *****************************************************************
      *  MISCELLANEOUS WORK FIELDS
      *****************************************************************
       01  WS-MISCELLANEOUS-FIELDS.

           03  WS-RRN            PIC  9(05)         VALUE ZERO.
           03  WS-RRN1           PIC  9(05)         VALUE ZERO.

           03  WS-RSN-CODE       PIC  X(04)         VALUE SPACE.
           03  WS-RSN-DESC       PIC  X(74)         VALUE SPACE.

           03  WS-SELECTION-SW   PIC  X(01)         VALUE SPACE.
               88  SELECTION-WAS-MADE-NO            VALUE "N".
               88  SELECTION-WAS-MADE-YES           VALUE "Y".

      *================================================================
      *=             L I N K A G E    S E C T I O N
      *================================================================
       LINKAGE SECTION.
       COPY SRSNCDPF  IN COPYLIB.

      *================================================================
      *=             P R O C E D U R E    D I V I S I O N
      *================================================================
       PROCEDURE DIVISION  USING SRSNCDPF-REASON-CODE
                                 SRSNCDPF-REASON-TEXT.
       0000-PROGRAM-ENTRY.


           OPEN  I-O    DISPLAY-FILE
                 INPUT  RSNCDE-FILE.

      *----------------------------------------------------------------
      ** DISPLAY REASON CODES AND DESC FOR SELECTION
      *----------------------------------------------------------------
           PERFORM 0010-INITIALIZE       THRU 0010-EXIT.

           PERFORM 1000-MAIN-LOGIC       THRU 1000-EXIT.

           PERFORM 0099-EOJ-RTN          THRU 0099-EXIT.

           CLOSE        DISPLAY-FILE
                        RSNCDE-FILE.

       0000-PROGRAM-END.
           GOBACK.

      *****************************************************************
      ** 1ST TIME PROCESSING ROUTINE
      *****************************************************************
       0010-INITIALIZE.

           SET  SELECTION-WAS-MADE-NO   TO TRUE.

           MOVE  SPACE        TO SRSNCDPF-REASON-CODE.
           MOVE  SPACE        TO SRSNCDPF-REASON-TEXT.

           PERFORM 1999-LOAD-SFL01       THRU 1999-EXIT.

       0010-EXIT.
            EXIT.

      *****************************************************************
      ** END OF JOB PROCESSING
      *****************************************************************
       0099-EOJ-RTN.

           IF  SELECTION-WAS-MADE-YES
               MOVE  WS-RSN-CODE  TO SRSNCDPF-REASON-CODE
               MOVE  WS-RSN-DESC  TO SRSNCDPF-REASON-TEXT
           ELSE
               MOVE  "EXIT"       TO SRSNCDPF-REASON-CODE
                                     SRSNCDPF-REASON-TEXT
           END-IF.

       0099-EXIT.
            EXIT.

      *****************************************************************
      ***  MAIN PROCESSING LOOP ROUTINE
      *****************************************************************
       1000-MAIN-LOGIC.

           PERFORM 8000-DISPLAY-SCREEN-1  THRU 8000-DSP-EXIT.
           IF  KB-F03-KEY
               GO TO 1000-EXIT
           END-IF.

      ***  CHECK THE SFL FOR USER ENTRY
           IF  WS-RRN1 > ZERO
               PERFORM 1100-CHECK-SFL01       THRU 1100-EXIT
               IF  SELECTION-WAS-MADE-YES
                   GO TO 1000-EXIT
               END-IF
           END-IF.

           GO TO 1000-MAIN-LOGIC.

       1000-EXIT.
            EXIT.

      *****************************************************************
      ***  CHECK SFL01 FOR USER SELECTION
      *****************************************************************
       1100-CHECK-SFL01.

           SET  SELECTION-WAS-MADE-NO   TO TRUE.
           MOVE SPACE            TO WS-RSN-CODE  WS-RSN-DESC.

       1100-READN-SFL01.

           PERFORM 8000-READN-SFL01      THRU 8000-READN-EXIT.
           IF  FS-END-OF-FILE
               GO TO 1100-EXIT
           END-IF.

           IF  SEL  OF WS-SFL01-FLDS  = "X"
               SET  SELECTION-WAS-MADE-YES  TO TRUE
               MOVE RDESC   OF WS-SFL01-FLDS  TO WS-RSN-DESC
               MOVE RCODE   OF WS-SFL01-FLDS  TO WS-RSN-CODE
               GO TO 1100-EXIT
           END-IF.

           SET  SFLNXTCHG-OFF    TO TRUE.
           MOVE SPACE            TO SEL  OF WS-SFL01-FLDS.
           PERFORM 8000-REWRT-SFL01      THRU 8000-REWRT-EXIT.

           GO TO 1100-READN-SFL01.

       1100-EXIT.
           EXIT.

      *****************************************************************
      ***  CLEAR SFL01
      *****************************************************************
       1998-CLEAR-SFL01.

           INITIALIZE  WS-SFL01-FLDS.
           MOVE ZERO             TO WS-RRN  WS-RRN1.
           MOVE 1                TO CRRN  OF WS-CTL01-FLDS.

           SET  SFL-DISPLAY-OFF  TO TRUE.

           SET  SFL-CLEAR-ON     TO TRUE.
           PERFORM 8000-WRITE-CTL01      THRU 8000-WRTCR-EXIT.
           SET  SFL-CLEAR-OFF    TO TRUE.

           SET  SFLEND-ON        TO TRUE.

       1998-EXIT.
            EXIT.

      *****************************************************************
      ***  LOAD  SFL01
      *****************************************************************
       1999-LOAD-SFL01.

           PERFORM 1998-CLEAR-SFL01      THRU 1998-EXIT.
           PERFORM 9000-START-RSNCDE     THRU 9000-START-EXIT.

       1999-LOAD-LOOP.

           PERFORM 9000-READN-RSNCDE     THRU 9000-READN-EXIT.
           IF  FS-END-OF-FILE
               GO TO 1999-EXIT
           END-IF.

           SET  SFLNXTCHG-OFF    TO TRUE.

           MOVE SPACE                    TO SEL   OF WS-SFL01-FLDS.
           MOVE RCODE   OF RSNCDE-REC    TO RCODE OF WS-SFL01-FLDS.
           MOVE RDESC   OF RSNCDE-REC    TO RDESC OF WS-SFL01-FLDS.

           ADD  1                  TO WS-RRN.
           PERFORM 8000-WRITE-SFL01  THRU 8000-WRITE-EXIT.

           GO TO 1999-LOAD-LOOP.

       1999-EXIT.
            EXIT.
      *****************************************************************
      ** DISPLAY SCREEN 1 - LIST RSN'S & ALLOW SELECTION
      *****************************************************************
       8000-DISPLAY-SCREEN-1.

           MOVE WS-PGM-VERSION     TO VERSION OF WS-H01-FLDS.

           MOVE CORR WS-H01-FLDS   TO H01-O.
           WRITE DISPLAY-REC  FORMAT "H01"
           END-WRITE.

           IF  WS-RRN1 = ZERO
               MOVE  WS-NORECS-MSSG  TO  MSSG  OF WS-B01-FLDS
           END-IF.

           MOVE CORR WS-B01-FLDS   TO B01-O.
           WRITE DISPLAY-REC  FORMAT "B01"
           END-WRITE.

           IF  WS-RRN1 > ZERO
               SET  SFL-DISPLAY-ON   TO TRUE
           END-IF.

           MOVE 1           TO CRRN  OF WS-CTL01-FLDS.
           MOVE CORR WS-CTL01-FLDS  TO CTL01-O.
           WRITE DISPLAY-REC  FORMAT "CTL01"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.


           READ  DISPLAY-FILE  FORMAT "CTL01"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-READ.

           MOVE  SPACE           TO  MSSG  OF WS-B01-FLDS.

       8000-DSP-EXIT.
            EXIT.

      *****************************************************************
      *** CTL01 WRITE CONTROL RECORD
      *****************************************************************
       8000-WRITE-CTL01.

           WRITE DISPLAY-REC  FORMAT "CTL01"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.


       8000-WRTCR-EXIT.
            EXIT.
      *****************************************************************
      *** SFL01 READ NEXT MODIFIED RECORD
      *****************************************************************
       8000-READN-SFL01.

           READ SUBFILE DISPLAY-FILE
                NEXT MODIFIED RECORD FORMAT IS "SFL01"
                     INDICATORS ARE WS-ALL-INDICATORS
           END-READ.

           IF FS-GOOD-FILE-IO
               MOVE CORR SFL01-I   TO WS-SFL01-FLDS
           END-IF.

           MOVE WS-RRN              TO WS-RRN1.

       8000-READN-EXIT.
            EXIT.
      *****************************************************************
      *** SFL01 WRITE SUBFILE RECORD
      *****************************************************************
       8000-WRITE-SFL01.

           MOVE CORR WS-SFL01-FLDS  TO SFL01-O.
           WRITE SUBFILE DISPLAY-REC  FORMAT "SFL01"
                         INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

           MOVE WS-RRN              TO WS-RRN1.

       8000-WRITE-EXIT.
            EXIT.

      *****************************************************************
      *** SFL01 REWRITE SUBFILE RECORD
      *****************************************************************
       8000-REWRT-SFL01.

           MOVE CORR WS-SFL01-FLDS  TO SFL01-O.
           REWRITE SUBFILE DISPLAY-REC  FORMAT "SFL01"
                         INDICATORS ARE WS-ALL-INDICATORS
           END-REWRITE.

       8000-REWRT-EXIT.
            EXIT.

      *----------------------------------------------------------------
      *
      *            ALL DATABASE FILE I-O'S BELOW THIS POINT
      *
      *----------------------------------------------------------------

      *****************************************************************
      *** START RSNCDE FILE
      *****************************************************************
       9000-START-RSNCDE.

           INITIALIZE  RSNCDE-REC.

           START RSNCDE-FILE
                 KEY IS >= EXTERNALLY-DESCRIBED-KEY
           END-START.

       9000-START-EXIT.
            EXIT.

      *****************************************************************
      *** READ RSNCDE FILE SEQUENTIALLY
      *****************************************************************
       9000-READN-RSNCDE.

           READ  RSNCDE-FILE  NEXT RECORD
           END-READ.

       9000-READN-EXIT.
            EXIT.

      *****************************************************************
      ***              END  OF  SOURCE  MEMBER
      *****************************************************************
