000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          SRWREMOV.
000400 AUTHOR.              B DISMUKES.
000500 DATE-WRITTEN.        8/14/92.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
      ****************************************************************
      *                     S R W R E M O V                          *
      *                                                              *
      *  THIS PROGRAM IS CALLED FROM THE MP1 SCREEN BY THE 'F4' KEY. *
      *  IT ALLOWS THE USER TO REMOVE WITHDRAWAL RESTRICTIONS        *
      *  ON CORPORATE CODES.                                         *
      *                                                              *
      ****************************************************************

001300 ENVIRONMENT DIVISION.
001400 CONFIGURATION SECTION.
001500 SOURCE-COMPUTER.  AS-400.
001600 OBJECT-COMPUTER.  AS-400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DRESTRIC-I-O
                  ASSIGN TO DATABASE-MCFLCS5001
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZPLTMAST-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

001700
001800 DATA DIVISION.
       FILE SECTION.
       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-I-REC.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  DRESTRIC-I-O
           LABEL RECORDS ARE STANDARD.
       01  DRESTRIC-REC-I-O.
           COPY DDS-MCRPCS5000  OF MCFLCS5001.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                   PIC X(1500).

001900 WORKING-STORAGE SECTION.
002000
002100 77  MPLT-COMP-4                   PIC X(4).
002400 77  OPEN-REQ-SW                   PIC X(1).
002500
003200**************************************************************
003300**                                                          **
003400**                S U B P R O G R A M   A R E A S           **
003500**                                                          **
003600**************************************************************
003700
003800 COPY DBSTAT     IN COPYLIB.
003900 COPY TSHWRDFM   IN COPYLIB.
       COPY DISPDAT2   IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.
004100 COPY TBLOWUP    IN COPYLIB.
       COPY CATREAD    IN COPYLIB.
007400
008100 01  SCREEN-PRINT-PARMS.
008200     05  PRINT-CTL             PIC S9(4)  VALUE ZERO    COMP-4.
008300     05  PAGE-CTL              PIC S9(4)  VALUE 49      COMP-4.
008400     05  SPOOLFIL-OPEN-SW      PIC X(1)   VALUE "N".
008500
008600 01  ARGUMENT-VALUES.
008700     05  PLT-ARG               PIC X(4).
009100     05  CODE-ARG              PIC X(8).
009400
008600 01  FIELD-NUMBER              PIC S9(4)  VALUE 1       COMP-4.

       01  MESSAGE-BUFFER.
           05  MSG-TEXT              PIC X(68)  VALUE SPACES.
           05  MSG-FLD               PIC X(10)  VALUE SPACES.
           05  MSG-FLD-9   REDEFINES MSG-FLD   PIC ZZZZZZZZZ9.

009400
009500******************************************************************
009600**                                                              **
009700**             D A T A B A S E   W O R K                        **
009800**                                                              **
009900******************************************************************
010000 01  MPLTINFO-ARG                  PIC X(4).

       01  DATASET-NAMES.
010200     05  DSET-MPLTINFO          PIC X(16) VALUE "MPLTINFO;".
010200     05  DSET-DRESTRIC          PIC X(16) VALUE "DRESTRIC;".

       01  MODE-VALUES.
010700     05  MODE1                   PIC S9(4) COMP-4 VALUE 1.
010800     05  MODE5                   PIC S9(4) COMP-4 VALUE 5.
010900     05  MODE7                   PIC S9(4) COMP-4 VALUE 7.
011300
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

011400******************************************************************
011500**                                                              **
011600**       D A T A B A S E   B U F F E R S                        **
011700**                                                              **
011800******************************************************************
016800
016900 COPY  DRESTRIC   IN COPYLIB.
012600
016300**************************************************************
016400**                                                          **
016500**                  S C R E E N   D A T A                   **
016600**                                                          **
016700**************************************************************
016800
016900 01  SCREEN-DATA.
017000     05  DE-CORP-CODE                PIC X(7).
           05    FILLER                    PIC X.
017100     05  DE-CONFIRM-DEL              PIC X.
           05  DE-COMMAND-LINE             PIC X(79).
           05  DE-MESSAGE-LINE             PIC X(79).
021200
021300**************************************************************
021400**                                                          **
021500**            L I N K A G E   S E C T I O N                 **
021600**                                                          **
021700**************************************************************
021800
021900 LINKAGE SECTION.
       01 BASE               PIC X(10).
011900 COPY MSTORERM   IN COPYLIB.
       COPY VCOMLINK   IN COPYLIB.
       COPY LANGSUB    IN COPYLIB.
023100
023200 PROCEDURE DIVISION USING          BASE,
                                         BUF-MSTORERM,
024000                                   VIEW-COMAREA,
024100                                   LANGUAGE-PARMS.
024300
024400 1-HSK.
           OPEN I-O DISPLAY-FILE, DRESTRIC-I-O.
037600     MOVE "REMOVERW"     TO   VIEW-NFNAME.
024600     MOVE SPACES                   TO   BUF-DRESTRIC,
                                              SCREEN-DATA.
037900     MOVE CORP-CODE      TO   CORPCDE OF DRESTRIC-REC-I-O,
                                    RES-CORP-CODE,
                                    DE-CORP-CODE.
028900     PERFORM 6-MAIN THRU 6-M-X.
           CLOSE DISPLAY-FILE, DRESTRIC-I-O.

       2-EOJ.
029000     GOBACK.
029100
029200 2-BLOWUP.
029300     MOVE "SRWREMOV"               TO   BU-PGM-NAME.
029400     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
029500       VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
029600       BU-DISPLAY-FLDS.
054500
054600 4-PGM-ERROR.
           MOVE B"1" TO IND (FIELD-NUMBER), IND (99).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE.
055400
055500 4-PGM-ERROR-X.
055600     EXIT.

036300******************************************************************
036400**                                                              **
036500**                      M A I N   M E N U                       **
036600**                                                              **
036700******************************************************************
036800 6-MAIN.

037100     IF STR-RESTRICTED-FLG = "X"
037200         PERFORM 60-REMOVE-RESTRICTIONS THRU 60-RR-X
037300     ELSE
               GO TO 2-EOJ.

       6-M-X.
           EXIT.
058300
058400******************************************************************
058500**                                                              **
058600**    R E M O V E   R E S T R I C T I O N S                     **
058700**                                                              **
058800******************************************************************

037400 60-REMOVE-RESTRICTIONS.

       60-SHOWFORM-SCREEN.
           MOVE SPACES          TO DE-CONFIRM-DEL.
           MOVE SCREEN-DATA     TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC     TO SCREEN-DATA.

070900     IF VIEW-LASTKEY = 3
071100         GO TO 60-RR-X
071200     ELSE
072500     IF VIEW-LASTKEY = 1 OR
072600                     = 2 OR
072600                     = 4 OR
072800                     = 5 OR
072900                     = 6 OR
073000                     = 7 OR
                           = 8
073200*M-----  INVALID FUNCTION KEY
073300         MOVE   9 TO LANG-SETNUM
073400         MOVE  10 TO LANG-MSGNUM
073500         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
073700         MOVE   2 TO  FIELD-NUMBER
073800         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
073900         GO TO 60-SHOWFORM-SCREEN.

       60-CONFIRM-DELETE.
           IF DE-CONFIRM-DEL = "Y"
               NEXT SENTENCE
           ELSE
      *M----LAST DELETE REQUEST CANCELED
075700         MOVE  12              TO LANG-SETNUM
075800         MOVE  12              TO LANG-MSGNUM
075900         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
076000         MOVE MESSAGE-BUFFER   TO MSG-TEXT
076200         MOVE 2                TO  FIELD-NUMBER
076300         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
076400         GO TO 60-SHOWFORM-SCREEN.

       60-DELETE-RESTRICTIONS.
           DELETE DRESTRIC-I-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00" OR "23"
               MOVE SPACES                        TO STR-RESTRICTED-FLG
           ELSE
248800         MOVE "DELETE  60-DELETE-RESTRICT"  TO BU-DISPLAY-MSG
248800         MOVE "CORP-CODE ="                 TO BU-DISPLAY-FLD (1)
248800         MOVE DE-CORP-CODE                  TO BU-DISPLAY-FLD (2)
248900         GO TO 2-BLOWUP.
043700
       60-RR-X.
           EXIT.
110700
       COPY DISPCALL IN COPYLIB.

110800 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
112400 999-CATREAD-EXIT.
112500     EXIT.
