000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          SRWREPRT.
000400 AUTHOR.              LYNN M BUNN.
000500 DATE-WRITTEN.        FEBRUARY 2, 1982.
000600*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000700*REMARKS.
000800*
000900*D     TITLE: (R)ETURN OR (W)ITHDRAWAL REPRINT
001000*D     THIS SUBPROGRAM CREATES A REPRINT OF A RETURN OR
001100*D     WITHDRAWAL WORKSHEET.
001200*
001300*      ON MAY 3, 1982 THE PRINTER-NUMBERS WERE ADDED FOR
001400*      AKRON.  IF THE USERNAME IS MANAGER, THE PRINT-OUT
001500*      WILL GO TO PRINTER NUMBER 19.  LMB.
001600*
001700*      ON MAY 10, 1982, INSTRUCTIONS WERE ADDED; THE TITLE WAS
001800*      CHANGED; AND THE "NOW PROCESSING" MESSAGE IS PUT UP.  LMB.
001900*      COBOLII.
002000*
002100*      ON MAY 21, 1982, THE FLIP FLOP OPTION WAS ADDED FOR 2626A
002200*      TERMINALS.  ALSO, THE PROCESSING OUTLINE WAS ADDED TO THE
002300*      REMARK SECTION.  LMB.
002400*
002500*      ON JULY 9, 1982, THE DATABASE BUFFERS WERE UPDATED; THE
002600*      CWHO WAS REPLACED BY THE WHO INTRINSIC; AND THE MMIS LOGIC
002700*      WAS DELETED.  LMB.
002800*
002900*      ON JUNE 17, 1983, THE KSAM FILE WAS ADDED FOR THE
003000*      SPOOLER NUMBER.  LMB.
003100*
003200*      ON JANUARY 10, 1984, THIS PROGRAM WAS PUT INTO VIEW.  LMB.
003300*
003400*    ON MAY 16, 1985, CHANGED THIS SUBPROGRAM FOR THE
003500*    EUROPEAN DATE CONVERSION.  IT WILL NOW CALL "TDATECK2"
003600*    FOR ALL DATE MANIPULATION, WHICH WILL RESULT IN A
003700*    EUROPEAN STLYE DATE ON THE OUTPUT DOCUMENT IF THE
003800*    EUROPEAN DATE FLAG IS SET.
003900*    ALSO TOOK OUT KSAM LOGIC TO GET SPOOLER NUMBER AND
004000*    REPLACED WITH A CALL TO "TSPLPRT".  CIH.
004100*
004200*      09/26/85  ADDED CALLS TO FINDJCW, NLAPPEND, CATOPEN, AND
004300*                CATCLOSE IN ORDER TO ACCOMODATE THE NATIVE
004400*                LANGUAGE SUPPORT FACILITY.  ADDED LINKAGES AND
004500*                ALSO MADE THE CHANGE TO THE FORMFILE NAMES.
004600*      09/26/85  CHANGED ALL REFERENCES OF TSCRPRNT TO TSCRPRT2,
004700*                TDATECHK TO TDATECK2.
004800*                THIS WAS TO INCORPORATE THE NATIVE LANGUAGE
004900*                SUPPORT VERSIONS OF THESE SUBROUTINES.
005000*                                   -TW COTTON.
005100*
005200*
005300*    02/18/86
005400*      CHANGE THIS PROGRAM TO A SUBPROGRAM SO IT CAN BE CALLED
005500*      FROM STORES EXECUTIVE PROGRAM "TUDCSTR".  CIH.
005600*
005700 ENVIRONMENT DIVISION.
005800 CONFIGURATION SECTION.
005900 SOURCE-COMPUTER.  HP-3000.
006000 OBJECT-COMPUTER.  HP-3000.
       SPECIAL-NAMES.  I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZUDCSTR-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS DYNAMIC
                  RELATIVE KEY IS RELATIVE-RECNO
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

           SELECT DWLITEM
                  ASSIGN TO DATABASE-MCFLCS1501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

006300 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC          PIC X(2000).
003700
       FD  DWLITEM
           LABEL RECORDS ARE STANDARD.
       01  DWLITEM-REC.
           COPY DDS-MCRPCS1500  OF MCFLCS1501.

006400 WORKING-STORAGE SECTION.
006500
       01  RELATIVE-RECNO         PIC 9(9).

      *------ WS CONTROL AREA
       01  MAJOR-MINOR                 PIC XXXX.
       01  WS-CONTROL.
           02  FUNCTION-NUM            PIC XX.
                   88  EXIT-KEY-F8-USED                     VALUE "08". LVW000LS
                   88  REFRESH-KEY-F4-USED                  VALUE "04". LVW000LS
                   88  ENTER-KEY-USED                       VALUE "00". LVW000LS
                   88  F1-KEY-USED                          VALUE "01". LVW000LS
                   88  F2-KEY-USED                          VALUE "02". LVW000LS
                   88  F3-KEY-USED                          VALUE "03". LVW000LS
                   88  F4-KEY-USED                          VALUE "04". LVW000LS
                   88  F5-KEY-USED                          VALUE "05". LVW000LS
                   88  F6-KEY-USED                          VALUE "06". LVW000LS
                   88  F7-KEY-USED                          VALUE "07". LVW000LS
                   88  F8-KEY-USED                          VALUE "08". LVW000LS
           02 FUN-KEY REDEFINES FUNCTION-NUM PIC XX.
           02 TERMINAL-ID PIC X(10).
           02 FORMAT-NAME PIC X(10).

       01  DISPLAY-STATUS              PIC X(2).

       COPY IOFEEDBACK OF COPYLIB.
006600 77  PASSWORD                   PIC X(5)   VALUE "JADE;".
006700 77  SUB                        PIC S9(4)  COMP-4 VALUE 0.
006800 77  RET-CODE                   PIC X(2)   VALUE SPACES.
006900
007000*****ARGUMENT VALUES*****
007100 77  CODE-ARG                   PIC X(8)   VALUE SPACES.
007200 77  WL-ARG                     PIC X(6)   VALUE SPACES.
007300
007400 01  WORK-LIST-TABLE.
007500     05  WLT-RCD OCCURS 14 TIMES.
007600         10  WLT-CODE                 PIC X(8).
007700         10  WLT-CHARGE-DEPT          PIC X(6).
007800         10  WLT-WO                   PIC X(10).
007900         10  WLT-WORK-CENTER          PIC X(2).
008000         10  WLT-EMPL                 PIC X(4).
008100         10  WLT-UM                   PIC XX.
008200         10  WLT-BIN-AREA.
008300             15  WLT-BINDATA OCCURS 6 TIMES.
008400                 20  WLT-BIN          PIC X(12).
008500                 20  WLT-QTY-X        PIC X(8).
008600                 20  WLT-QTY REDEFINES WLT-QTY-X PIC 9(8).
008700         10  WLT-REQ-DEPT             PIC X(4).
008800         10  WLT-DISB-INSTR            PIC X(30).
008900         10  WLT-EXP-CLASS            PIC X(6).
009000
009100
009200***************************************************************
009300**                                                           **
009400**       S U B P R O G R A M   W O R K                       **
009500**                                                           **
009600***************************************************************
009700 COPY TDATECHK   IN COPYLIB.
009800 COPY TBLOWUP    IN COPYLIB.
       COPY CATREAD    IN COPYLIB.
       01  RS-RET-CODE                      PIC X(2).
       01  RS-SHIFT-FLD.
           05  FILLER                       PIC X(4).
           05  RS-SHIFT-FLD-5-8             PIC X(4).
009900
010000 01  WS-PARMS.
010100     05  HALF-SHEET-FLAG              PIC X(1)  VALUE SPACES.
010200     05  BELL-FLAG                    PIC X(1)  VALUE SPACES.
010300     05  PLANNER-DATA                 PIC X(59) VALUE SPACES.
010400     05  RETURN-FLAG                  PIC X(1)  VALUE SPACES.
010500     05  AKRON-FLAG                   PIC X(1)  VALUE "N".
010600     05  REPRINT-FLAG                 PIC X(1)  VALUE "Y".
010700     05  FILLER                       PIC X(3).
010800
010900*****MISCELLANEOUS******
011000
011100 77  SUB2                       PIC S99    VALUE ZEROS.
011200 77  SUB3                       PIC S99    VALUE ZEROS.
011300 01  ITEM-LISTINGS.
011400     05  ALL-ITEM-LIST          PIC XX     VALUE "@;".
011500     05  CODE-SEARCH            PIC X(10)  VALUE "CORP-CODE;".
011600     05  WL-SEARCH              PIC X(7)   VALUE "WL-KEY;".
011700
011800*********************
011900*                   *
012000*   DATA SET NAMES  *
012100*                   *
012200*********************
012300
012400 01  DSET-NAMES.
012500     05  DSET-NAME              PIC X(16)  VALUE SPACES.
012600     05  DSET-DESC              PIC X(16)  VALUE "DDESC;".
012700     05  DSET-MWRKLIST          PIC X(16)  VALUE "MWRKLIST;".
012800     05  DSET-DWLITEM           PIC X(16)  VALUE "DWLITEM;".
012900     05  DSET-MSTORERM          PIC X(16)  VALUE "MSTORERM;".
013000
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

013100********************
013200*                  *
013300*   MODE  VALUES   *
013400*                  *
013500********************
013600
013700 01  MODE-AREA.
013800     05  MODE1                  PIC S9(4)   COMP-4     VALUE 1.
013900     05  MODE2                  PIC S9(4)   COMP-4     VALUE 2.
014000     05  MODE3                  PIC S9(4)   COMP-4     VALUE 3.
014100     05  MODE5                  PIC S9(4)   COMP-4     VALUE 5.
014200     05  MODE7                  PIC S9(4)   COMP-4     VALUE 7.
014300
014400*************************************************************
014500**                                                         **
014600**      V I E W   C O M M U N I C A T I O N   A R E A      **
014700**                                                         **
014800*************************************************************
014900
       01  SCREEN-BUFFER             PIC X(2000).

015000 01  FORM-NAMES.
015100     05  RWREPRT               PIC X(9)     VALUE "RWREPRINT".
015200
015300 01  MESSAGE-BUFFER.
015400     05 MSG-TEXT              PIC X(68)    VALUE SPACE.
015500     05  MSG-FLD               PIC X(8)     VALUE SPACE.
015600     05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC ZZZZZZZ9.
015700
015800 01  MESSAGE-BUFLEN            PIC S9(4)    VALUE 76    COMP-4.
015900
016000 01  MESSAGE-ACTLEN            PIC S9(4)    VALUE 76    COMP-4.
016100
016200 01  FIELD-NUMBER              PIC S9(4)    VALUE 1     COMP-4.
016300
016400*********************************
016500*                               *
016600*  BELOW ARE THE BUFFER AREAS   *
016700*    SET UP FOR EACH DATASET IN *
016800*    THE DATABASE - STORES      *
016900*                               *
017000*********************************
017100 COPY DWLITEM    IN COPYLIB.
017200
017300*********************************
017400*                               *
017500*     WORK AREAS                *
017600*                               *
017700*********************************
017800
017900
018000 01  WS-WORKSHEET-KEY.
018100     05  WS-WORKSHEET-LIT       PIC XX     VALUE SPACES.
018200     05  WS-WORKSHEET-NO        PIC 9(4)   VALUE ZEROS.
018300
018400 01  WS-WORKORDER.
018500     05  WS-NONWO-LIT           PIC XX     VALUE SPACES.
018600     05  WS-NONWO-EXP-CLASS     PIC X(10)  VALUE ZEROS.
018700
018800 01  WL-TOT-QTY                 PIC 9(9)   VALUE ZEROS.
018900
019000*****************
019100*               *
019200*  SCREEN BUF   *
019300*               *
019400*****************
019500
019600 01  DE-FIELDS.
019700     05  DE-WORKSHEET-NO.
019800         10  DE-END           PIC X(3).
019900         10  FILLER           PIC X.
020000     05  DE-RETURN-FLAG       PIC X(1).
020100     05  DE-WITHDRAWAL-FLAG   PIC X(1).
           05  DE-COMMAND-LINE      PIC X(79).
           05  DE-MESSAGE-LINE      PIC X(79).
020200
020300**************************************************************
020400**                                                          **
020500**         L I N K A G E   S E C T I O N                    **
020600**                                                          **
020700**************************************************************
020800 LINKAGE SECTION.
020900
021000 01  BASE                      PIC X(10).
021100 01  MMIS-BASE                 PIC X(13).
021200
021300 COPY DBSTAT     IN COPYLIB.
021400 COPY VCOMLINK   IN COPYLIB.
021500 COPY STCOM      IN COPYLIB.
021600 COPY TSHWSUB    IN COPYLIB.
021700 COPY LANGSUB    IN COPYLIB.
021800 COPY MULTSTR    IN COPYLIB.
021900 COPY ESCNAME   IN COPYLIB.
022000
022100 PROCEDURE DIVISION USING BASE MMIS-BASE STATUS-AREA
022200                          VIEW-COMAREA STORES-COMAREA
022300                          SRF-COMAREA, SRF-SPOOLER-REC,
022400                          LANGUAGE-PARMS, MULTIPLE-STR-DATA,
022500                          ESC-NAME.
022600
022700 1-HOUSEKEEPING.
022800
           OPEN I-O DISPLAY-FILE.
           OPEN INPUT DWLITEM.
022900     PERFORM 6000-MAIN THRU 6990-MAIN-X.
           CLOSE DWLITEM.
           CLOSE DISPLAY-FILE.
023000     GOBACK.
023100
023200 2100-BLOWUP.
023300     MOVE "SRWREPRT" TO BU-PGM-NAME.
023400     MOVE WS-WORKSHEET-KEY         TO   BU-DISPLAY-FLD (4).
023500     MOVE CODE-ARG                 TO   BU-DISPLAY-FLD (3).
023600     CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
023700       VIEW-COMAREA DUMMY-KSAM-STAT BU-DISPLAY-MSG
023800       BU-DISPLAY-FLDS.
023900
024000**********************
024100*                    *
024200*       M A I N      *
024300*                    *
024400**********************
024500
024600 6000-MAIN.
024700
024800 61-GET-FORM.
024900     MOVE 0                        TO   SUB.
025000     MOVE SPACES                   TO   WORK-LIST-TABLE.
025100
025200     MOVE RWREPRT    TO  VIEW-NFNAME.
025300*    CALL "VGETNEXTFORM" USING  VIEW-COMAREA.
025400*    IF VIEW-STATUS NOT = ZERO
025500*        MOVE "VGETNEXTFORM ERROR RSREPRT"  TO  BU-DISPLAY-MSG
025600*        PERFORM 2100-BLOWUP.
025700*
025800 611-INIT-FORM.
025900*    CALL "VINITFORM" USING  VIEW-COMAREA.
026000*    IF VIEW-STATUS NOT = ZERO
026100*        MOVE "VINITFORM ERROR RSREPRT"  TO  BU-DISPLAY-MSG
026200*        PERFORM 2100-BLOWUP.
026300*
026400 612-PUT-WINDOW.
026500     MOVE SPACE      TO  MESSAGE-BUFFER.
026600*    CALL "VPUTWINDOW" USING  VIEW-COMAREA, MESSAGE-BUFFER,
026700*                             MESSAGE-ACTLEN.
026800*    IF VIEW-STATUS NOT = ZERO
026900*        MOVE "VPUTWINDOW ERROR RSREPRT"  TO  BU-DISPLAY-MSG
027000*        PERFORM 2100-BLOWUP.
027100*
027200 62-SHOW-FORM.
027300*----- f1 f2 f3 f6 INVALID, f4 REFRESH, f5 PRT, f7 CLR, f8 EXIT
           MOVE "0000" TO DE-WORKSHEET-NO.
027400*    MOVE 7                        TO   SRF-KEYSET.
           MOVE DE-FIELDS TO SCREEN-BUFFER.
027500*    CALL "TSHWRDFM" USING SRF-COMAREA, BU-DISPLAY-MSG,
027600*      VIEW-COMAREA, BASE, STATUS-AREA, SRF-SPOOLER-REC,
027700*      LANGUAGE-PARMS, SCREEN-BUFFER.
           MOVE SCREEN-BUFFER TO DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
              INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO SRF-INDICATORS.
           MOVE DISPLAY-REC TO SCREEN-BUFFER.

      *------ A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *------ IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.
035800
           MOVE SCREEN-BUFFER TO DE-FIELDS.
027800     IF BU-DISPLAY-MSG-1 NOT = SPACES
027900         PERFORM 2100-BLOWUP.
028000
028100     IF VIEW-LASTKEY = 3
028200         GO TO 6990-MAIN-X.
028300
028400 623-GET-BUFFER.
028500*    CALL "VGETBUFFER" USING  VIEW-COMAREA, DE-FIELDS,
028600*                             VIEW-DBUFLEN.
028700*    IF VIEW-STATUS NOT = ZERO
028800*        MOVE "VGETBUFFER ERROR RSREPRT"  TO  BU-DISPLAY-MSG
028900*        MOVE VIEW-NFNAME                 TO  BU-DISPLAY-AREA
029000*        PERFORM 2100-BLOWUP.
029100*
           MOVE DE-WORKSHEET-NO TO RS-SHIFT-FLD.
           CALL "TRSHIFT" USING RS-RET-CODE, RS-SHIFT-FLD.
           MOVE RS-SHIFT-FLD-5-8 TO DE-WORKSHEET-NO.

029200     IF DE-RETURN-FLAG = "X"
029300         MOVE "ST"  TO  WS-WORKSHEET-LIT
029400     ELSE
029600         MOVE "SW"  TO  WS-WORKSHEET-LIT.
029700
029800*******************************************************
029900*                                                     *
030000*                  FIND  DWLITEM                      *
030100*                                                     *
030200*******************************************************
030300
030400     MOVE DE-WORKSHEET-NO  TO  WS-WORKSHEET-NO.
030500     MOVE WS-WORKSHEET-KEY TO  WL-ARG.
030600
030700*    CALL "DBFIND" USING BASE, DSET-DWLITEM, MODE1, STATUS-AREA,
030800*            WL-SEARCH, WL-ARG.
           MOVE 0 TO COND-WORD.
           MOVE WL-ARG TO WLKEY OF DWLITEM-REC.
           START DWLITEM KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
030900     IF COND-WORD NOT = 0
031000*        "W16: WORKSHEET NUMBER DOES NOT EXIST"
031100         MOVE  23 TO LANG-SETNUM
031200         MOVE  16 TO LANG-MSGNUM
031300         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
031400         MOVE MESSAGE-BUFFER TO MSG-TEXT
031500         MOVE WL-ARG                    TO MSG-FLD
031600         PERFORM  9-USER-ERROR  THRU  9-USER-ERROR-X
031700         GO TO  62-SHOW-FORM.
031800
031900***********************************************************
032000*
032100*     DISPLAY A 'NOW PROCESSING' MESSAGE ON THE SCREEN
032200*
032300***********************************************************
032400
032500 8-PUT-IN-PROCESS-MSG-UP.
032600         MOVE  14 TO LANG-SETNUM
032700         MOVE   2 TO LANG-MSGNUM
032800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
032900         PERFORM 9-VIEW-PUTWINDOW THRU 9-SHOW-FORM-X.
033000
033100     MOVE 0                        TO   SUB.
033200 61-GET-DWLITEM-LOOP.
033300*    CALL "DBGET" USING BASE, DSET-DWLITEM, MODE5, STATUS-AREA,
033400*            ALL-ITEM-LIST, BUF-DWLITEM, WL-ARG.
           MOVE 0 TO COND-WORD.
           READ DWLITEM NEXT INTO BUF-DWLITEM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF WLKEY OF DWLITEM-REC NOT = WL-ARG
               MOVE 15 TO COND-WORD.
033500     IF COND-WORD NOT = 0
033600         IF COND-WORD = 15
033700             GO TO 62-CALL-PRINT-SUBPROGRAM
033800         ELSE
033900           MOVE "DBGET DWLITEM  RWREPRT   " TO BU-DISPLAY-MSG
034000           PERFORM 2100-BLOWUP.
034100
034200     ADD 1                         TO   SUB.
034300     MOVE WL-CODE                  TO   WLT-CODE (SUB).
034400     MOVE WL-CHARGE-DEPT           TO   WLT-CHARGE-DEPT (SUB).
034500     MOVE WL-WO                    TO   WLT-WO (SUB).
034600     MOVE WL-WORK-CENTER           TO   WLT-WORK-CENTER (SUB).
           MOVE WL-EMPL                  TO   WLT-EMPL (SUB).
           MOVE WL-UM                    TO   WLT-UM (SUB).
034700     MOVE WL-BINDATA               TO   WLT-BIN-AREA (SUB).
034800     MOVE WL-REQ-DEPT              TO   WLT-REQ-DEPT (SUB).
034900     MOVE WL-EXP-CLASS             TO   WLT-EXP-CLASS (SUB).
035000
035100     GO TO 61-GET-DWLITEM-LOOP.
035200
035300 62-CALL-PRINT-SUBPROGRAM.
035400     IF SRF-SPOOL-NO (5) = "99"
035500         MOVE "H"                  TO   HALF-SHEET-FLAG.
035600     IF WS-WORKSHEET-LIT = "ST"
035700         MOVE "R"                  TO   RETURN-FLAG.
035800     IF AKRON-PLANT
035900         MOVE "Y"                  TO   AKRON-FLAG.
036000     CALL "TWSPRT" USING RET-CODE, BASE, MMIS-BASE, STATUS-AREA,
036100       SRF-SPOOL-PRT-NO, WS-WORKSHEET-KEY, WORK-LIST-TABLE,
036200       WS-PARMS, LANGUAGE-PARMS, ESC-NAME, BU-DISPLAY-MSG,
             MULTIPLE-STR-DATA.
036300     IF BU-DISPLAY-MSG-1 NOT = SPACES
036400         PERFORM 2100-BLOWUP.
036500
036600*---------- LOOP UP FOR NEXT WORKSHEET NUMBER ENTRY.
           MOVE SPACES TO DE-FIELDS.
036700     GO TO 61-GET-FORM.
036800
036900 6990-MAIN-X.
037000     EXIT.
037100
037200
037300 9-VIEW-PUTWINDOW.
037400*    CALL "VPUTWINDOW" USING  VIEW-COMAREA, MESSAGE-BUFFER,
037500*                             MESSAGE-ACTLEN.
037600*    IF VIEW-STATUS NOT = ZERO
037700*        MOVE "VPUTWINDOW ERROR *RSREPRT"  TO  BU-DISPLAY-MSG
037800*        PERFORM 2100-BLOWUP.
037900*
038000 9-VIEW-PUTWINDOW-X.
038100
038200 9-SHOW-FORM.
038300*    CALL "VSHOWFORM" USING  VIEW-COMAREA.
038400*    IF VIEW-STATUS NOT = 0
038500*        MOVE "VSHOWFORM ERROR *RSREPRT"  TO  BU-DISPLAY-MSG
038600*        PERFORM 2100-BLOWUP.
038700*
038800 9-SHOW-FORM-X.
038900
039000 9-USER-ERROR.
039100*    CALL "VSETERROR" USING VIEW-COMAREA, FIELD-NUMBER,
039200*        MESSAGE-BUFFER, MESSAGE-BUFLEN.
039300*    IF VIEW-STATUS NOT = 0
039400*        MOVE "VSETERROR ERR 9-UE" TO BU-DISPLAY-MSG
039500*        PERFORM 2100-BLOWUP.
           MOVE "Y" TO SRF-ERROR-SW.
           MOVE B"1" TO IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE.
051300
039600 9-USER-ERROR-X.
039700
039800 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
040600 999-CATREAD-EXIT.
040700     EXIT.
