000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.
000400     SSIUPDT.
000500 AUTHOR.
000600     KURT MOVSESIAN.
000800
000900******************************************************
001000*                                                    *
001100*     S S I U P D T                                  *
001200*    SUBROUTINE FOR SAVING STANDARD INSTRUCTIONS AND *
001300*    CONFIRMING ORDER INFORMATION WITH A PURCHASE    *
001400*    ORDER.  THIS INFORMATION IS STORED IN THE DATA  *
001500*    SET 'DPODATAITM' UNDER THE PURCHASE ORDER       *
001600*    NUMBER AND THE ITEM NUMBER USED IN DPODATAITM   *
001700*    IS ITEM NUMBER ZERO.                            *
001800*    THE STANDARD INSTRUCTION LIST 'SSIUPDT-PARMS'   *
001900*    AND PO NUMBER 'BUILD-PO-SEARCH' MUST BE PASSED  *
002000*    TO THIS SUBROUTINE.                             *
002100*                                                    *
002200******************************************************
      *C
      *C 10/31/96  JEFF BUNGO
      *C   WRITE RECEIVING INSTRUCTIONS TO 000002 RECORD
      *C
002300
002400
002500 ENVIRONMENT DIVISION.
002600 CONFIGURATION SECTION.
002700 SOURCE-COMPUTER.  HP-3000.
002800 OBJECT-COMPUTER.  HP-3000.
002900
003000 SPECIAL-NAMES.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DPODATAITM-O
                  ASSIGN TO DATABASE-MCFLCS1101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

003100
003200 DATA DIVISION.
       FILE SECTION.
       FD  DPODATAITM-O
           LABEL RECORDS ARE STANDARD.
       01  DPODATAITM-REC-O.
           COPY DDS-ALL-FORMATS OF MCFLCS1101.

003300
003400 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
003500
003600**************************************************************
003700**************************************************************
003800**                                                          **
003900**                DATABASE I/O BUFFER AREA                  **
004000**                                                          **
004100**************************************************************
004200**************************************************************
004300
004400 COPY DPODATA IN COPYLIB.
004500
004800*********************
004900*                   *
005000*   DATA SET NAMES  *
005100*                   *
005200*********************
005300
005400 01  DSET-NAMES.
005500     05  DSET-DPODATAITM          PIC X(16)  VALUE "DPODATAITM;".
005600
006300 LINKAGE SECTION.
006400
006500 01  BASE                         PIC X(10).
006600
006700 01  BUILD-PO-SEARCH.
006800     05  PO-PREFIX                PIC X.
006900     05  PO-NO-REL.
007000         10  PO-NO                PIC X(7).
007100         10  PO-REL               PIC X(3).
007200     05  PO-RCV                   PIC X(3).
007300
007400***********************************
007500**  PARAMETERS FOR 'SSIUPDT'
007600***********************************
007700
007800 COPY SSIUPDT IN COPYLIB.
007900
008000 COPY DBSTAT IN COPYLIB.
008100
008200 01  BU-DISPLAY-MSG.
008300     05  BU-DISPLAY-MSG-1         PIC X(1).
008400     05  FILLER                   PIC X(59).
008500
008600 01  BU-DISPLAY-FLDS.
008700     05  BU-DISPLAY-LINE  OCCURS 5 TIMES.
008800         10  BU-DISPLAY-FLD       PIC X(14).
008900         10  BU-DISPLAY-FLD9      PIC S9(8).
009000
009100
009200 PROCEDURE DIVISION USING BASE,
009300                          BUILD-PO-SEARCH,
009400                          SSIUPDT-PARMS,
009500                          STATUS-AREA,
009600                          BU-DISPLAY-MSG,
009700                          BU-DISPLAY-FLDS.
009800
009900 PROC-DIV SECTION 04.
010000
010100 BEGIN-HERE.
           OPEN I-O DPODATAITM-O.
010200     PERFORM 60-UPDATE-STD-INST  THRU 60-USI-X.
           PERFORM 61-UPDATE-RCV-INST  THRU 61-URI-X.
010300     CLOSE DPODATAITM-O.
010400     GOBACK.
010500
010600
010700******************************************************
010800**                                                  **
010900**   BLOWUP ROUTINE                                 **
011000**                                                  **
011100******************************************************
011200
011300 2-BLOWUP.
011400     MOVE "SSIUPDT"               TO BU-DISPLAY-FLD (5).
011500     MOVE BUILD-PO-SEARCH         TO BU-DISPLAY-FLD (4).
011600     GOBACK.
011700
011800
011900 60-UPDATE-STD-INST.
012000     IF SSIUPDT-PARMS = SPACES  OR
012100        BUILD-PO-SEARCH = SPACES
012200         GO TO 60-USI-X.
012300
013400     MOVE BUILD-PO-SEARCH         TO DATAITM-PO-RCV-NO.
013500     MOVE "000001"                TO DATAITM-LINE.
013600     MOVE SSIUPDT-PARMS(1:71)     TO DATAITM-INFO.
           MOVE 0 TO COND-WORD.
           WRITE DPODATAITM-REC-O FROM BUF-DPODATAITM
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
013700*    CALL "DBPUT" USING BASE, DSET-DPODATAITM, MODE1,
013800*        STATUS-AREA, ALL-ITEMS, BUF-DPODATAITM.
013900     IF COND-WORD = ZERO
014000         NEXT SENTENCE
014100     ELSE
014200         MOVE "PUT DPODATAITM * 60-USI" TO BU-DISPLAY-MSG
014300         GO TO 2-BLOWUP.
014400
015100 60-USI-X.
015200     EXIT.

       61-UPDATE-RCV-INST.
           IF SSIUPDT-RCV-INST = SPACES  OR
              BUILD-PO-SEARCH = SPACES
               GO TO 61-URI-X.

           MOVE BUILD-PO-SEARCH         TO DATAITM-PO-RCV-NO.
           MOVE "000002"                TO DATAITM-LINE.
           MOVE SSIUPDT-RCV-INST        TO DATAITM-INFO.
           MOVE 0 TO COND-WORD.
           WRITE DPODATAITM-REC-O FROM BUF-DPODATAITM
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF COND-WORD = ZERO
               NEXT SENTENCE
           ELSE
               MOVE "WRITE DPODATAITM * 61-URI" TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

       61-URI-X.
           EXIT.
