000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    STC320.
000500 AUTHOR.        KURT MOVSESIAN/JIM COFFMAN (MAINTAINER).
000800
000900***************************************************************
001000*                                                             *
001100*D  S T C 3 2 0                                               *
001200*                                                             *
001300*D  THIS SUB PROGRAM CUTS TCs 320, 420, 321, 421, 322, & 422  *
001400*D  FOR PURCHASE ORDER ITEMS                                  *
001500*                                                             *
001600***************************************************************
      *                                                             *
      *C*   06/18/1996   CA YODER                                   *
      *C*     RECOMPILED TO PICK UP CENTURY DATABASE CHANGES.       *
      *C*                                                           *
      *C*   10/16/1997   CA YODER                                   *
      *C*     PROGRAM BLEW UP WHEN NON-NUMERIC DATA IN STC320-PRICE *
      *C*     IN DECATUR.  MOVED ZEROS TO THE FIELD IF IT IS NON-   *
      *C*     NUMERIC.                                              *
      *C*                                                           *
      *C    05/28/98     CA YODER
      *C    ADDED CALL TO "SCALCBGT" TO CALCULATE THE CORRECT
      *C    BUDGET AMOUNT FOR THE PO.  DECATUR FOUND THAT THE
      *C    TAX WAS NOT BEING INCLUDED IN THE CALCULATION.
      *C
      ***************************************************************
001700
001800
001900
002000 ENVIRONMENT DIVISION.
002100 CONFIGURATION SECTION.
002200 SOURCE-COMPUTER.  HP-3000.
002300 OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DDAILYTC
                  ASSIGN TO DATABASE-MCFLCS1601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

002400
002500 DATA DIVISION.
       FILE SECTION.
       FD  DDAILYTC
           LABEL RECORDS ARE STANDARD.
       01  DDAILYTC-REC.
           COPY DDS-ALL-FORMATS  OF MCFLCS1601.

002600
002700 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

002800 01  SAVE-AREAS.
002900     05  BUDGET-AMT-SAVED      PIC S9(11) VALUE ZEROS COMP-4.
003000
003100*************************************
003200**  PARM AREA FOR CALLING 'SCURCONV'
003300*************************************
003400
003500 COPY SCURCONV IN COPYLIB.
003600
       COPY SCALCBGT IN COPYLIB.
003700
003800 01  DATES-AND-TIMES.
003900     05  HP-CUR-DATE.
004000         10  MM                PIC XX.
004100         10  FILLER            PIC X.
004200         10  DD                PIC XX.
004300         10  FILLER            PIC X.
004400         10  YY                PIC XX.
004500     05  CUR-DATE.
004600         10  YY.
004700             15 FILLER         PIC X.
004800             15 YR-YR          PIC X.
004900         10  MM                PIC XX.
005000         10  DD                PIC XX.
005100
005200
005300**************************************************************
005400**************************************************************
005500**                                                          **
005600**                DATABASE I/O BUFFER AREA                  **
005700**                                                          **
005800**************************************************************
005900**************************************************************
006000
006100 COPY DDAILYTC IN COPYLIB.
006200
006300 COPY TC320 IN COPYLIB.
006400
006500 COPY TC420 IN COPYLIB.
006600
006700*********************
006800*                   *
006900*   DATA SET NAMES  *
007000*                   *
007100*********************
007200
007300 01  DSET-NAMES.
007400     05  DSET-NAME              PIC X(16)  VALUE SPACES.
007500     05  DSET-DDAILYTC          PIC X(16)  VALUE "DDAILYTC;".
007600
007700 01 ITEMS-LISTING.
007800     05  ALL-ITEMS              PIC XX    VALUE "@;".
008200
008300 LINKAGE SECTION.
008400
008500 01  BASE             PIC X(10).
008600
008700 COPY STC320 IN COPYLIB.
008800
008900 COPY DBSTAT IN COPYLIB.
009000
009100 01  BU-DISPLAY-MSG.
009200     05  BU-DISPLAY-MSG-1         PIC X(1).
009300     05  FILLER                   PIC X(59).
009400
009500 01  BU-DISPLAY-FLDS.
009600     05  BU-DISPLAY-LINE  OCCURS 5 TIMES.
009700         10  BU-DISPLAY-FLD       PIC X(14).
009800         10  BU-DISPLAY-FLD9      PIC S9(8).
009900
010000
010100
010200 PROCEDURE DIVISION USING  BASE,
010300                           STC320-PARMS,
010400                           STATUS-AREA,
010500                           BU-DISPLAY-MSG,
010600                           BU-DISPLAY-FLDS.
010700
010800
010900 STC320 SECTION 02.
011000
011100 BEGIN-HERE.
           OPEN I-O DDAILYTC.

011200     PERFORM 6-MAIN THRU 6-M-X.

           CLOSE DDAILYTC.
011300
011400     GOBACK.
011500
011600
011700******************************************************
011800**                                                  **
011900**   BLOWUP ROUTINE                                 **
012000**                                                  **
012100******************************************************
012200
012300 2-BLOWUP.
012400     MOVE "STC320"             TO  BU-DISPLAY-FLD (5).
012500     MOVE STC320-CODE          TO  BU-DISPLAY-FLD (4).
012600     GOBACK.
012700
012800
012900 6-MAIN.
013000*************************************
013100**   CONVERT PRICE AND BUDGET AMOUNT
013200**   TO HOME CURRENCY IF THE PLANT
013300**   CHOOSE THE OPTION
013400*************************************
013500     PERFORM 60-CURRENCY-CONVERSION  THRU  60-CC-X.
013600
013700**********************
013800*                    *
013900*   BUILD TC "320"   *
014000*                    *
014100**********************
014200
014800     MOVE SPACES               TO  BUF-DDAILYTC.
014900*    MOVE CURRENT-DATE         TO  HP-CUR-DATE.
015000*    MOVE CORR HP-CUR-DATE     TO  CUR-DATE.
           ACCEPT CUR-DATE FROM DATE.
015100     MOVE CUR-DATE             TO  DDAILYTC-DATE.
015200*    MOVE TIME-OF-DAY          TO  DDAILYTC-TIME.
           ACCEPT DDAILYTC-TIME FROM TIME.
015300     MOVE STC320-COMPANY-SAVE  TO  DDAILYTC-PLT.
           IF STC320-PRICE NOT NUMERIC
               MOVE ZEROS            TO  STC320-PRICE.
015400     IF STC320-PRICE > 99999999.9999
015500         PERFORM 61-CUT-TC420  THRU  61-CT420-X
015600     ELSE
015700         PERFORM 61-CUT-TC320  THRU  61-CT320-X.
           MOVE 0 TO COND-WORD.
           WRITE DDAILYTC-REC FROM BUF-DDAILYTC
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
015800*    CALL "DBPUT" USING BASE, DSET-DDAILYTC, MODE1,
015900*        STATUS-AREA, ALL-ITEMS, BUF-DDAILYTC.
016000     IF COND-WORD NOT = ZERO
016100         MOVE "PUT1 DDAILYTC * 6-DA"  TO  BU-DISPLAY-MSG
016200         GO TO 2-BLOWUP.
016300
016400********************************
016500*                              *
016600*        BUILD TC "322"        *
016700*                              *
016800********************************
016900
017000******* CALCULATE BUDGET AMOUNT FOR THE ITEM
017100
017200**** MULTIPLY STC320-PRICE  BY  STC320-QTY  GIVING
017300****     BUDGET-AMT-SAVED ROUNDED.
017400
           MOVE STC320-QTY       TO  SCALCBGT-QTY.
           MOVE STC320-PRICE     TO  SCALCBGT-PRICE.
           MOVE STC320-TAX-CODE  TO  SCALCBGT-TAX-CODE.
           MOVE 0                TO  SCALCBGT-BUDGET.
           CALL "SCALCBGT"  USING  SCALCBGT-PARMS.
           MOVE SCALCBGT-BUDGET  TO  BUDGET-AMT-SAVED.

017500     SUBTRACT STC320-OLD-BUDGET-AMT  FROM  BUDGET-AMT-SAVED.
017600     MOVE BUDGET-AMT-SAVED        TO STC320-BUDGET-AMT-NET-CHG.
017700
017800     IF BUDGET-AMT-SAVED > 99999999  OR
017900        BUDGET-AMT-SAVED < -99999999
018000         PERFORM 61-CUT-TC422  THRU  61-CT422-X
018100     ELSE
018200         PERFORM 61-CUT-TC322  THRU  61-CT322-X.
018300
           MOVE 0 TO COND-WORD.
           WRITE DDAILYTC-REC FROM BUF-DDAILYTC
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
018400*    CALL "DBPUT" USING BASE, DSET-DDAILYTC, MODE1,
018500*        STATUS-AREA, ALL-ITEMS, BUF-DDAILYTC.
018600     IF COND-WORD NOT = ZERO
018700         MOVE "PUT2 DDAILYTC * 6-DA" TO BU-DISPLAY-MSG
018800         GO TO 2-BLOWUP.
018900
019600 6-M-X.
019700     EXIT.
019800
019900**************************************************
020000**   THIS PROCEDURE CONVERTS UNIT PRICE AND
020100**   OLD BUDGET AMT TO HOME CURRENCY UNITS IF
020200**   THE PLANT DENOTED THEY DESIRE THIS OPTION
020300**   IN PLANT STARTUP
020400**************************************************
020500
020600 60-CURRENCY-CONVERSION.
020700********************************************
020800**  IF THE CURRENCY CODE IS BLANK AND
020900**  AND PRICE AND OLD BUDGET AMT ARE ZEROS
021000**  THEN THERES NO NEED TO CALL 'SCURCONV'
021100********************************************
021200     IF STC320-CUR-CODE = SPACES
021300         GO TO 60-CC-X.
           IF STC320-PRICE-X = SPACES
               MOVE ZEROES TO STC320-PRICE.
021400     IF STC320-PRICE = ZEROS  AND
021500        STC320-OLD-BUDGET-AMT = ZEROS
021600         GO TO 60-CC-X.
021700*******************************************
021800**  CALL 'SCURCONV' WHICH WILL DO THE ACTUAL
021900**  CONVERSION TO LOCAL CURRENCY
022000*******************************************
022100
022200     MOVE STC320-CUR-CODE         TO  SCURCONV-CUR-CODE.
022300     MOVE STC320-PRICE            TO  SCURCONV-PRICE-DEC.
022400     MOVE STC320-OLD-BUDGET-AMT   TO  SCURCONV-PRICE-WHL.
022500     CALL "SCURCONV" USING BASE,
022600                           SCURCONV-PARMS,
022700                           STATUS-AREA,
022800                           BU-DISPLAY-MSG,
022900                           BU-DISPLAY-FLDS.
023000     IF BU-DISPLAY-MSG-1 NOT = SPACES
023100         MOVE "SCURCONV"          TO  BU-DISPLAY-FLD (3)
023200         GO TO 2-BLOWUP.
023300     MOVE SCURCONV-PRICE-DEC      TO  STC320-PRICE.
023400     MOVE SCURCONV-PRICE-WHL      TO  STC320-OLD-BUDGET-AMT.
023500
023600 60-CC-X.
023700     EXIT.
023800
023900
024000
024100 61-CUT-TC320.
024200     IF STC320-ITEM-ADD
024300         MOVE "320"               TO  DDAILYTC-TC
024400     ELSE
024500     IF STC320-ITEM-MODIFY
024600         MOVE "321"               TO  DDAILYTC-TC
024700     ELSE
024800         MOVE "* INVALID TC ID NOT 20 OR 21" TO BU-DISPLAY-MSG
024900         MOVE STC320-ITEM-TC-ID   TO  BU-DISPLAY-FLD (3)
025000         GO TO 2-BLOWUP.
025100     IF STC320-CODE = "NC"
025200         MOVE "NON-STR"        TO  TC320-CORP-CODE
025300     ELSE
025400         MOVE STC320-CODE      TO  TC320-CORP-CODE.
025500     MOVE STC320-PO-NUM        TO  TC320-PO-RLS.
025600     MOVE STC320-ITEM          TO  TC320-ITEM-NO.
025700     MOVE STC320-QTY           TO  TC320-QTY.
025800     MOVE STC320-PRICE         TO  TC320-PRICE.
025900     MOVE STC320-QTY-UM        TO  TC320-QTY-UM.
026000     MOVE STC320-PRICE-UM      TO  TC320-PRICE-UM.
026100     MOVE STC320-REQ-NO        TO  TC320-REQ-NO.
026200     MOVE STC320-TAX-CODE      TO  TC320-TAX-CODE.
026300
026400 61-CT320-X.
026500     EXIT.
026600
026700 61-CUT-TC420.
026800     IF STC320-ITEM-ADD
026900         MOVE "420"               TO  DDAILYTC-TC
027000     ELSE
027100     IF STC320-ITEM-MODIFY
027200         MOVE "421"               TO  DDAILYTC-TC
027300     ELSE
027400         MOVE "* INVALID TC ID NOT 20 OR 21" TO BU-DISPLAY-MSG
027500         MOVE STC320-ITEM-TC-ID   TO  BU-DISPLAY-FLD (3)
027600         GO TO 2-BLOWUP.
027700     IF STC320-CODE  =  "NC"
027800         MOVE "NON-STR"        TO  TC420-CORP-CODE
027900     ELSE
028000         MOVE STC320-CODE      TO  TC420-CORP-CODE.
028100     MOVE STC320-PO-REL        TO  TC420-PO-RLS.
028200     MOVE STC320-ITEM          TO  TC420-ITEM-NO.
028300     MOVE STC320-QTY           TO  TC420-QTY.
028400     MOVE STC320-PRICE         TO  TC420-PRICE.
028500     MOVE STC320-QTY-UM        TO  TC420-QTY-UM.
028600     MOVE STC320-PRICE-UM      TO  TC420-PRICE-UM.
028700     MOVE STC320-REQ-NO        TO  TC420-REQ-NO.
028800     MOVE STC320-TAX-CODE      TO  TC420-TAX-CODE.
028900
029000 61-CT420-X.
029100     EXIT.
029200
029300 61-CUT-TC322.
029400     MOVE "322"                TO  DDAILYTC-TC.
029500     IF STC320-CODE = "NC"
029600         MOVE "NON-STR"        TO  TC320-CORP-CODE
029700     ELSE
029800         MOVE STC320-CODE      TO  TC320-CORP-CODE.
029900     MOVE STC320-PO-NUM        TO  TC320-PO-RLS.
030000     MOVE STC320-ITEM          TO  TC320-ITEM-NO.
030100     MOVE SPACES               TO  TC322-ITEM-ACCTG.
030200     MOVE STC320-SUB           TO  TC322-SUB.
030300     MOVE STC320-SUBD          TO  TC322-SUBD.
030400     MOVE STC320-ADDTL-DATA    TO  TC322-ADDL-DATA.
030500     MOVE BUDGET-AMT-SAVED     TO  TC322-BUDGET-AMT.
030600     MOVE STC320-BUDGET-NO     TO  TC322-BUDGET-NO.
           MOVE STC320-COMPANY       TO  TC322-COMPANY.
           MOVE STC320-PRIME         TO  TC322-PRIME.
030700
030800 61-CT322-X.
030900     EXIT.
031000
031100 61-CUT-TC422.
031200     MOVE "422"                TO  DDAILYTC-TC.
031300     IF STC320-CODE = "NC"
031400         MOVE "NON-STR"        TO  TC420-CORP-CODE
031500     ELSE
031600         MOVE STC320-CODE      TO  TC420-CORP-CODE.
031700     MOVE STC320-PO-REL        TO  TC420-PO-RLS.
031800     MOVE STC320-ITEM          TO  TC420-ITEM-NO.
031900     MOVE SPACES               TO  TC422-ITEM-ACCTG.
032000     MOVE STC320-SUB           TO  TC422-SUB.
032100     MOVE STC320-SUBD          TO  TC422-SUBD.
032200     MOVE STC320-ADDTL-DATA    TO  TC422-ADDL-DATA.
032300     MOVE BUDGET-AMT-SAVED     TO  TC422-BUDGET-AMT.
032400     MOVE STC320-BUDGET-NO     TO  TC422-BUDGET-NO.
           MOVE STC320-COMPANY       TO  TC422-COMPANY.
           MOVE STC320-PRIME         TO  TC422-PRIME.
032500
032600 61-CT422-X.
032700     EXIT.
