       IDENTIFICATION DIVISION.
       PROGRAM-ID.     STERMRPT.
       AUTHOR.         ANNETTE M. KRAUSS.
       INSTALLATION.   GOODYEAR TIRE & RUBBER CO.
       DATE-WRITTEN.   JULY 9, 1986.
      *REMARKS.
      *          REPORT OF VALID PAYMENT TERMS.
      *
      *D* * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *D                                                          *
      *D    STERMRPT:  REPORT OF VALID PAYMENT TERMS.             *
      *D                                                          *
      *D    THIS PROGRAM WILL PRINT A REPORT OF VALID             *
      *D    PAYMENT TERMS(MPLTINFO KEYS TMDn AND TMPn)            *
      *D                                                          *
      *D* * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *C*   CHANGES
      *C*   OCT 1992    CR KALMAN        REQ: 6268
      *C*   CHANGE THE FORMAT OF MPLTINFO-DISC-AMNT AND ALL
      *C*   RELATED FIELDS FROM 9V9(4) TO V9(5).

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.    HP-3000.
       OBJECT-COMPUTER.    HP-3000.
       SPECIAL-NAMES.
           C01 IS NEW-PAGE.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT SORT-FILE      ASSIGN TO DISK-SORT.
           SELECT PRINT-FILE     ASSIGN TO PRINTER-MCPRT.
           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  PRINT-FILE
           RECORD CONTAINS 132 CHARACTERS.
       01  PRINT-REC                              PIC X(132).

       SD  SORT-FILE
           RECORD CONTAINS 30 CHARACTERS.
       01  SORT-RECORD.
           05  SORT-KEY                           PIC X(4).
           05  SORT-KEY-REDEFINED REDEFINES SORT-KEY.
               10  SORT-KEY-1-3                   PIC X(3).
               10  SORT-KEY-4                     PIC X(1).
           05  SORT-RECORD-1.
               10  SORT-DISC-AMNT-DESC            PIC X(5).
9210CK         10  SORT-DISC-AMNT                 PIC V9(5).
               10  FILLER                         PIC X(16).
           05  SORT-RECORD-2 REDEFINES SORT-RECORD-1.
               10  SORT-TMD-DESC                  PIC X(18).
               10  SORT-D-OR-P                    PIC 9(3).
               10  SORT-TIME-FLAG                 PIC X(1).
               10  SORT-D-OR-P-2                  PIC 9(3).
               10  SORT-D-OR-P-FLAG               PIC X(1).

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       WORKING-STORAGE SECTION.
       77  SAVE-SORT-KEY-1-3          PIC X(3)   VALUE SPACES.
       01  WS-SORT-KEY                           VALUE SPACES.
           05  WS-SORT-KEY-1-3        PIC X(3).
           05  WS-SORT-KEY-4          PIC X(1).
       01  PAGE-NUM                   PIC 9(3)   VALUE 0.
       01  LINE-CTR                   PIC 9(3)   VALUE 0.
       01  END-OF-SORT-FILE           PIC X(1)   VALUE "N".
           88  ALL-SORTED-RECORDS-PROCESSED      VALUE "Y".
       01  END-OF-INPUT-FILE          PIC X(1)   VALUE "N".
           88  ALL-INPUT-RECORDS-PROCESSED       VALUE "Y".
       01  NO-SORTED-RECORDS          PIC X(132) VALUE
           "   ****   NO SORTED RECORDS FOUND   ****".
       01  FILE-STATUS.
           05  FILE-STATUS-1          PIC X      VALUE SPACES.
           05  FILE-STATUS-2          PIC X      VALUE SPACES.
       COPY TBLOWUP IN COPYCSIS.
       01  VIEW-COMAREA.
           05  FILLER                  PIC X(118)  VALUE ALL "0".
           05  FILLER                  PIC S9(4)   COMP-4 VALUE 9999.
       01  KSAM-STATUS                 PIC X(2)    VALUE SPACES.

       COPY TDATECHK IN COPYCSIS.

      *------------- PRINT AREAS
       01  PRINT-LINE                 PIC X(132)  VALUE SPACES.

       01  HEAD1 REDEFINES PRINT-LINE.
           05  FILLER                 PIC X(29).
           05  HEAD1-TITLE1           PIC X(39).
           05  HEAD1-TITLE2           PIC X(37).
           05  FILLER                 PIC X(15).
           05  HEAD1-PLANT            PIC X(6).
           05  HEAD1-PLANT-OUT        PIC X(3).
           05  FILLER                 PIC X(3).

       01  HEAD2 REDEFINES PRINT-LINE.
           05  FILLER                 PIC X(1).
           05  HEAD2-DATE             PIC X(8).
           05  FILLER                 PIC X(5).
           05  HEAD2-TIME             PIC X(8).
           05  FILLER                 PIC X(10).
           05  HEAD2-TITLE1           PIC X(30).
           05  HEAD2-TITLE2           PIC X(42).
           05  FILLER                 PIC X(14).
           05  HEAD2-PAGE             PIC X(6).
           05  HEAD2-PAGE-NO          PIC Z,ZZ9.
           05  FILLER                 PIC X(3).

       01  HEAD4 REDEFINES PRINT-LINE.
           05  FILLER                  PIC X(20).
           05  HEAD4-CODE              PIC X(26).
           05  FILLER                  PIC X(40).
           05  HEAD4-NAME              PIC X(26).
           05  FILLER                  PIC X(20).

       01  LINE1 REDEFINES PRINT-LINE.
           05  FILLER                  PIC X(10).
           05  LINE1-SORT-KEY          PIC X(4).
           05  FILLER                  PIC X(10).
           05  LINE1-DISC-AMNT-DESC    PIC X(5).
           05  FILLER                  PIC X(15).
9210CK     05  LINE1-DISC-AMNT         PIC .9(5).
           05  FILLER                  PIC X(82).

       01  LINE2 REDEFINES PRINT-LINE.
           05  FILLER                  PIC X(10).
           05  LINE2-SORT-KEY          PIC X(4).
           05  FILLER                  PIC X(10).
           05  LINE2-TMD-DESC          PIC X(18).
           05  FILLER                  PIC X(10).
           05  LINE2-D-OR-P            PIC ZZ9.
           05  FILLER                  PIC X(10).
           05  LINE2-TIME-FLAG         PIC X(1).
           05  FILLER                  PIC X(15).
           05  LINE2-D-OR-P-2          PIC ZZ9.
           05  FILLER                  PIC X(18).
           05  LINE2-D-OR-P-FLAG       PIC X(1).
           05  FILLER                  PIC X(29).

       01  PRINT-LINE2.
           05  FILLER                  PIC X(10) VALUE SPACES.
           05  FILLER                  PIC X(4)  VALUE "CODE".
           05  FILLER                  PIC X(10) VALUE SPACES.
           05  FILLER                  PIC X(11) VALUE "DESCRIPTION".
           05  FILLER                  PIC X(10) VALUE SPACES.
           05  FILLER                  PIC X(5)  VALUE "VALUE".
           05  FILLER                  PIC X(82) VALUE SPACES.

       01  PRINT-LINE3.
           05  FILLER                  PIC X(10) VALUE SPACES.
           05  FILLER                  PIC X(4)  VALUE "CODE".
           05  FILLER                  PIC X(10) VALUE SPACES.
           05  FILLER                  PIC X(11) VALUE "DESCRIPTION".
           05  FILLER                  PIC X(14) VALUE SPACES.
           05  FILLER                  PIC X(8)  VALUE "DAY/PROX".
           05  FILLER                  PIC X(6) VALUE SPACES.
           05  FILLER                  PIC X(4)  VALUE "FLAG".
           05  FILLER                  PIC X(10) VALUE SPACES.
           05  FILLER                  PIC X(13) VALUE "MULT DAY/PROX".
           05  FILLER                  PIC X(10) VALUE SPACES.
           05  FILLER                  PIC X(4)  VALUE "FLAG".
           05  FILLER                  PIC X(28) VALUE
               "   (P=PROX, N=N/A, D=DAYS)".


       01  DOT-LINE.
           05  FILLER                  PIC X(132)  VALUE ALL "-".

      *------------- DATABASE AREA
       COPY DBMODES IN COPYCSIS.

       COPY DBSTAT  IN COPYCSIS.


       01  DSET-NAME-AREA.
           05  DSET-NAME               PIC X(16)  VALUE SPACES.
           05  DSET-MPLTINFO             PIC X(16)  VALUE "MPLTINFO;".

       01  DATABASE-ARGS.
           05  DUMMY-ARG               PIC X(4)   VALUE SPACES.

       01  SEARCH-ITEMS.
           05  ALL-ITEM-LIST           PIC X(2)   VALUE "@;".

      *------------- DATABASE BUFFERS
       COPY MPLTINFO IN COPYCSIS.

      *------------------------------------------------------------
       LINKAGE SECTION.

       01  BASE                       PIC X(10).
       01  PLANT-NUMBER               PIC X(3).
       01  ESC-INFO.
           05  COMPRESS-PRINT         PIC X(8).
           05  NORMAL-PRINT           PIC X(8).
           05  EXPAND-PRINT           PIC X(8).
       01  HD-PAPER-FLAG              PIC X(1).
           88  PAPER-IS-132-COL                VALUE "X".

      *************************************************************
      *************************************************************
      *           P R O C E D U R E     D I V I S I O N           *
      *************************************************************
      *************************************************************
       PROCEDURE DIVISION USING BASE, PLANT-NUMBER, ESC-INFO,
                                HD-PAPER-FLAG.
       0-BEGIN-SORT SECTION.

       10-OPEN-FILES.
           MOVE "STERMRPT"  TO BU-PGM-NAME.
           OPEN INPUT  MPLTINFO-I.
           OPEN OUTPUT PRINT-FILE.


       60-MAIN.
           SORT SORT-FILE
               ON ASCENDING KEY SORT-KEY
               INPUT  PROCEDURE IS 8-INPUT-RECORDS
               OUTPUT PROCEDURE IS 9-WRITE-RECORDS.

           WRITE PRINT-REC FROM NORMAL-PRINT AFTER ADVANCING 0.

           CLOSE MPLTINFO-I.
           GOBACK.

       8-INPUT-RECORDS SECTION.
           READ MPLTINFO-I FIRST RECORD INTO BUF-MPLTINFO
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               GO TO 89-EXIT.
           PERFORM 81-PROCESS-INPUT-RECORDS THRU 81-PIR-EXIT.
           GO TO 89-EXIT.

       81-PROCESS-INPUT-RECORDS.
           MOVE MPLTINFO-KEY TO WS-SORT-KEY.
           IF WS-SORT-KEY-1-3 = "TMD" OR "TMP"
               GO TO 81-WRITE-MNF
           ELSE
               GO TO 81-READ-NEXT-MPLTINFO.

       81-WRITE-MNF.
           MOVE MPLTINFO-KEY                TO SORT-KEY.

           IF WS-SORT-KEY-1-3 = "TMP"
               MOVE MPLTINFO-DISC-AMNT-DESC TO SORT-DISC-AMNT-DESC
               MOVE MPLTINFO-DISC-AMNT      TO SORT-DISC-AMNT.

           IF WS-SORT-KEY-1-3 = "TMD"
               MOVE MPLTINFO-TMD-DESC       TO SORT-TMD-DESC
               MOVE MPLTINFO-D-OR-P         TO SORT-D-OR-P
               MOVE MPLTINFO-TIME-FLAG      TO SORT-TIME-FLAG
               MOVE MPLTINFO-D-OR-P-2       TO SORT-D-OR-P-2
               MOVE MPLTINFO-D-OR-P-FLAG    TO SORT-D-OR-P-FLAG.

           RELEASE SORT-RECORD.

       81-READ-NEXT-MPLTINFO.
           READ MPLTINFO-I NEXT INTO BUF-MPLTINFO
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO 81-PIR-EXIT
               ELSE
                   MOVE "DBGET MPLTINFO AT 81-P-I-R"
                       TO BU-DISPLAY-MSG
                   PERFORM 82-BLOWUP.
           GO TO 81-PROCESS-INPUT-RECORDS.

       81-PIR-EXIT.
           EXIT.


      *************************************************************
      *                    BLOWUP   ROUTINE                       *
      *************************************************************
       82-BLOWUP.
           WRITE PRINT-REC FROM NORMAL-PRINT AFTER ADVANCING 0.

           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
                 VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                 BU-DISPLAY-AREA.


       89-EXIT.
           EXIT.

       9-WRITE-RECORDS SECTION.
           IF PAPER-IS-132-COL
               NEXT SENTENCE
           ELSE
              WRITE PRINT-REC FROM COMPRESS-PRINT AFTER ADVANCING 0.

           RETURN SORT-FILE AT END
               PERFORM 94-NEW-PAGE
               MOVE "Y"               TO END-OF-SORT-FILE
               WRITE PRINT-REC FROM NO-SORTED-RECORDS
                   AFTER ADVANCING 1 LINES
               GO TO 99-EXIT.
           PERFORM 91-PROCESS-SORTED-RECORDS THRU 91-PSR-EXIT
               UNTIL ALL-SORTED-RECORDS-PROCESSED.
           GO TO 99-EXIT.

       91-PROCESS-SORTED-RECORDS.
           IF SORT-KEY-1-3 NOT = SAVE-SORT-KEY-1-3
               IF SORT-KEY-1-3 = "TMP"
                   PERFORM 94-NEW-PAGE
                   WRITE PRINT-REC FROM PRINT-LINE2
                        AFTER ADVANCING 2 LINES
                   MOVE SPACES TO PRINT-LINE
                   WRITE PRINT-REC FROM PRINT-LINE
                        AFTER ADVANCING 1 LINES
                   MOVE 7      TO LINE-CTR
               ELSE
               IF SORT-KEY-1-3 = "TMD"
                   PERFORM 94-NEW-PAGE
                   WRITE PRINT-REC FROM PRINT-LINE3
                        AFTER ADVANCING 2 LINES
                   MOVE SPACES TO PRINT-LINE
                   WRITE PRINT-REC FROM PRINT-LINE
                        AFTER ADVANCING 1 LINES
                   MOVE 7      TO LINE-CTR.

           IF SORT-KEY-1-3 = "TMP"
               MOVE SORT-KEY-4          TO LINE1-SORT-KEY
               MOVE SORT-DISC-AMNT-DESC TO LINE1-DISC-AMNT-DESC
               MOVE SORT-DISC-AMNT      TO LINE1-DISC-AMNT
               WRITE PRINT-REC FROM LINE1 AFTER ADVANCING 1 LINES.

           IF SORT-KEY-1-3 = "TMD"
               MOVE SORT-KEY-4          TO LINE2-SORT-KEY
               MOVE SORT-TMD-DESC       TO LINE2-TMD-DESC
               MOVE SORT-D-OR-P         TO LINE2-D-OR-P
               MOVE SORT-TIME-FLAG      TO LINE2-TIME-FLAG
               MOVE SORT-D-OR-P-2       TO LINE2-D-OR-P-2
               MOVE SORT-D-OR-P-FLAG    TO LINE2-D-OR-P-FLAG
               WRITE PRINT-REC FROM LINE2 AFTER ADVANCING 1 LINES.

           ADD   1           TO LINE-CTR.
           MOVE SORT-KEY-1-3 TO SAVE-SORT-KEY-1-3.
           RETURN SORT-FILE AT END
               MOVE "Y"               TO END-OF-SORT-FILE.
           IF LINE-CTR > 50 AND NOT ALL-SORTED-RECORDS-PROCESSED
               PERFORM 94-NEW-PAGE
               IF SORT-KEY-1-3 = "TMP"
                   PERFORM 94-NEW-PAGE
                   WRITE PRINT-REC FROM PRINT-LINE2
                        AFTER ADVANCING 1 LINES
                   MOVE SPACES TO PRINT-LINE
                   WRITE PRINT-REC FROM PRINT-LINE
                        AFTER ADVANCING 2 LINES
                   MOVE 7      TO LINE-CTR
               ELSE
               IF SORT-KEY-1-3 = "TMD"
                   PERFORM 94-NEW-PAGE
                   WRITE PRINT-REC FROM PRINT-LINE3
                        AFTER ADVANCING 1 LINES
                   MOVE SPACES TO PRINT-LINE
                   WRITE PRINT-REC FROM PRINT-LINE
                        AFTER ADVANCING 2 LINES
                   MOVE 7      TO LINE-CTR.

       91-PSR-EXIT.
           EXIT.


       94-NEW-PAGE.
           MOVE SPACES                TO PRINT-LINE.
           ADD 1                      TO PAGE-NUM.
           MOVE "G O O D Y E A R   C O R P O R A T E   "
                                      TO HEAD1-TITLE1.
           MOVE " I N F O R M A T I O N   S Y S T E M"
                                      TO HEAD1-TITLE2.
           MOVE "PLANT "              TO HEAD1-PLANT.
           MOVE PLANT-NUMBER          TO HEAD1-PLANT-OUT.
           WRITE PRINT-REC FROM PRINT-LINE AFTER ADVANCING NEW-PAGE.
           MOVE SPACES                TO PRINT-LINE.
           MOVE 1                     TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-FORMATTED-TIME-OUT TO HEAD2-TIME.
           MOVE DATE-SLASH-OUT        TO HEAD2-DATE.
           MOVE "PAGE: "              TO HEAD2-PAGE.
           MOVE PAGE-NUM              TO HEAD2-PAGE-NO.
           IF SORT-KEY-1-3 = "TMP"
           MOVE "                V A L I D   D "  TO HEAD2-TITLE1
           MOVE "I S C O U N T   A M O U N T S            "
                                                 TO HEAD2-TITLE2
           ELSE
           IF SORT-KEY-1-3 = "TMD"
           MOVE "  V A L I D   T I M E   F R A "  TO HEAD2-TITLE1
           MOVE "M E S   F O R   D I S C O U N T S        "
                                                 TO HEAD2-TITLE2
           ELSE
           MOVE SPACES TO HEAD2-TITLE1, HEAD2-TITLE2.
           WRITE PRINT-REC FROM PRINT-LINE AFTER ADVANCING 2 LINES.
           WRITE PRINT-REC FROM DOT-LINE AFTER ADVANCING 1 LINES.

       99-EXIT.
           EXIT.
