       IDENTIFICATION DIVISION.
       PROGRAM-ID.     SUNMEAS.
       AUTHOR.         ANNETTE M. KRAUSS.
       INSTALLATION.   THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
       DATE-WRITTEN.   MAY 27, 1986.
       DATE-COMPILED.
      *REMARKS.
      **************************************************************
      *                                                            *
      *D   SUNMEAS                UNIT OF MEASURES SUBPROGRAM      *
      *                                                            *
      *D    THIS PROGRAM IS USED TO LOAD UNIT OF MEASURE CODES     *
      *D    INTO THE STORES DATA BASE FOR STARTUP ON CSIS.         *
      *D                                                           *
      *D    THIS PROGRAM IS CALLED BY:                             *
      *D                      1.  TPLTSTUP                         *
      *D                                                           *
      *C***********************************************************
      *C   05/03/94                                               *
      *C      REMOVED ALL REFERENCES TO PORTABILITY COPYLIB       *
      *C      MEMBERS.                              W.L.M.        *
      *C***********************************************************
      **************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT DISPLAY-FILE
                   ASSIGN TO WORKSTATION-ZPLTSTUP-SI
                   ORGANIZATION IS TRANSACTION
                   ACCESS IS SEQUENTIAL
                   FILE STATUS IS DISPLAY-STATUS
                   CONTROL-AREA IS WS-CONTROL.
            SELECT MVALIDUM-O
                   ASSIGN TO DATABASE-MCFLCS0401
                   ORGANIZATION IS INDEXED
                   ACCESS IS DYNAMIC
                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   FILE STATUS IS FILE-STATUS.
            SELECT MPLTINFO-PK-O
                ASSIGN TO DATABASE-MCFLCS0501
                ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                FILE STATUS IS FILE-STATUS.
002500
       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC             PIC X(2000).
       FD  MVALIDUM-O
           LABEL RECORDS ARE STANDARD.
       01  MVALIDUM-O-REC.
           COPY DDS-MCRPCS0400 OF MCFLCS0401.
       FD  MPLTINFO-PK-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-PK-REC-O.
           COPY DDS-MCRPCS0500 OF MCFLCS0501.
002800

       WORKING-STORAGE SECTION.
       01  HANDLE-BLOWUP-FLAG       PIC X VALUE "Y".
       01  WS-EDI-INSTAL            PIC X VALUE SPACE.
008100 01  DE-FIELDS-1.
008200     05  ADD-UM-INFO OCCURS 4.
008300         10  UM-A                  PIC XX.
008400         10  UM-DESC-A             PIC X(12).
008500     05  MODIFY-UM-INFO.
008600         10  UM-M                  PIC XX.
008700         10  UM-DESC-M             PIC X(12).
009100     05  UM-MSGLINE1               PIC X(79).
           05  DE-COMMAND-LINE-1         PIC X(79).
009200
       01  DISPLAY-STATUS           PIC XX.
       01  FILE-STATUS.
           05  FILE-STATUS-1        PIC X VALUE SPACE.
           05  FILE-STATUS-2        PIC X VALUE SPACE.

      *************************************************************
      *************************************************************
      **                                                         **
      **              D A T A    B A S E    A R E A              **
      **                                                         **
      *************************************************************
      *************************************************************

       COPY MPLTINFO  IN COPYLIB.

       COPY MVALIDUM  IN COPYLIB.

       01  DSET-NAMES.
           05  DSET-NAME                 PIC X(16)  VALUE SPACES.
           05  DSET-MVALIDUM             PIC X(16)  VALUE "MVALIDUM;".

       01  ARG-VALUES.
           05  MVALIDUM-ARG              PIC X(2).
           05  PLT-ARG                   PIC X(4).

       01  MESSAGE-BUFFER.
           05  MSG-TEXT                  PIC X(64)  VALUE SPACES.
           05  MSG-FLD                   PIC X(12)  VALUE SPACES.

       01  MESSAGE-BUFFER-1.
           05  MSG-TEXT-1                PIC X(64)  VALUE SPACES.
           05  MSG-FLD-1                 PIC X(12)  VALUE SPACES.

       COPY DBSTAT   IN COPYLIB.

       COPY FUNCTDEF IN COPYLIB.
      *************************************************************
      *************************************************************
      **                                                         **
      **                 TERMINAL I/O DATA AREA                  **
      **                                                         **
      *************************************************************
      *************************************************************

       01  UM-SCREEN.
           05  UM-SELECTION OCCURS 5 TIMES.
               10  UM                    PIC X(2).
               10  UM-DESC               PIC X(12).
           05  UM-MSGLINE                PIC X(79).
           05  UM-CMDLINE                PIC X(79).
           05  UM-ERRLINE                PIC X(79).

       01  E-UM-SCREEN.
           05  E-UM-SELECTION OCCURS 5 TIMES.
               10  E-UM                  PIC X(2).
               10  E-EDI-UM              PIC X(3).
               10  E-UM-DESC             PIC X(12).
           05  E-UM-MSGLINE              PIC X(79).
           05  E-UM-CMDLINE              PIC X(79).
           05  E-UM-ERRLINE              PIC X(79).

       01  INDX                          PIC 9 VALUE 0.

       COPY CATREAD     IN COPYLIB.
       COPY TBLOWUP     IN COPYLIB.
       COPY IOFEEDBACK  IN COPYLIB.
       COPY TSHWRDFM    IN COPYLIB.
       COPY WSCONTROL   IN COPYLIB.

      *************************************************************
      *************************************************************
      **                                                         **
      **               LINKAGE   SECTION                         **
      **                                                         **
      *************************************************************
      *************************************************************

       LINKAGE SECTION.

       01  BASE                          PIC X(10).
       COPY VCOMLINK   IN COPYLIB.
       COPY LANGSUB    IN COPYLIB.


      *************************************************************
      **#########################################################**
      *************************************************************
      **                                                         **
      **          P R O C E D U R E    D I V I S I O N           **
      **                                                         **
      *************************************************************
      **#########################################################**
      *************************************************************

       PROCEDURE DIVISION USING BASE,
                                VIEW-COMAREA,
                                LANGUAGE-PARMS.

       0-SUNMEAS-SEC SECTION 1.

       0-BEGIN-HERE.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-X.
           PERFORM 2-EOJ.

       1-HSK.
           MOVE "SUNMEAS" TO BU-PGM-NAME.
           OPEN I-O DISPLAY-FILE, MVALIDUM-O.
           OPEN I-O MPLTINFO-PK-O.
           MOVE "N"       TO WS-EDI-INSTAL.
           MOVE "EDI "    TO PLT-ARG.
017700     PERFORM 9999-GETKEY-MPLTINFO-PK-O.
017800     IF  FILE-STATUS = "00"
017900         IF  EDI-INSTAL = "Y"
018000             MOVE  "Y"  TO  WS-EDI-INSTAL.

       2-EOJ.
           CLOSE DISPLAY-FILE, MVALIDUM-O, MPLTINFO-PK-O.
           GOBACK.

      ******************************************************
      **                 BLOWUP ROUTINE                   **
      ******************************************************

       2100-BLOWUP.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
                 VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                 BU-DISPLAY-AREA.



      **************************************************
      *                                                *
      *                  6 - M A I N                   *
      *                                                *
      **************************************************
       6-MAIN.
           IF WS-EDI-INSTAL = "Y"
               MOVE "EUNITMEAS" TO VIEW-NFNAME
           ELSE
           MOVE "UNITMEAS" TO VIEW-NFNAME.

       6-PUT-BUFFER.
           MOVE SPACES TO UM-SCREEN E-UM-SCREEN.

      ***  INPUT DATA ABOVE AND PRESS 'ENTER'  ***
           MOVE   9 TO LANG-SETNUM.
           MOVE  20 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO UM-MSGLINE, E-UM-MSGLINE.

       6-SHOW-FORM.
           IF WS-EDI-INSTAL = "Y"
               MOVE E-UM-SCREEN TO DISPLAY-REC
               PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN
               MOVE DISPLAY-REC TO E-UM-SCREEN
               IF VIEW-LASTKEY = 1
                   MOVE "HELPUM1" TO VIEW-NFNAME
                   PERFORM 69-HELP-SCREEN THRU 69-HELP-SCREEN-X
                   GO TO 6-MAIN
               ELSE
               NEXT SENTENCE
           ELSE
           MOVE UM-SCREEN    TO DISPLAY-REC
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN
           MOVE DISPLAY-REC  TO UM-SCREEN.
           IF VIEW-LASTKEY = 3 GO TO 6-MAIN-X.
           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO UM-ERRLINE, E-UM-ERRLINE
               MOVE B"1" TO IND(99)
               GO TO 6-SHOW-FORM.

       6-EDIT-CHECKS.
           IF WS-EDI-INSTAL = "Y"
               IF (E-EDI-UM (1) NOT = SPACES OR
                   E-EDI-UM (2) NOT = SPACES OR
                   E-EDI-UM (3) NOT = SPACES OR
                   E-EDI-UM (4) NOT = SPACES ) AND
                   E-EDI-UM (5) NOT = SPACES
                   MOVE   3 TO LANG-SETNUM
                   MOVE  62 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO E-UM-ERRLINE
                   MOVE B"1" TO IND(99), IND(4)
                   GO TO 6-SHOW-FORM
               ELSE
               NEXT SENTENCE
           ELSE
           IF (UM (1) NOT = SPACES OR
               UM (2) NOT = SPACES OR
               UM (3) NOT = SPACES OR
               UM (4) NOT = SPACES ) AND
               UM (5) NOT = SPACES
               MOVE   3 TO LANG-SETNUM
               MOVE  62 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO UM-ERRLINE
               MOVE B"1" TO IND(99), IND(4)
               GO TO 6-SHOW-FORM.

           MOVE 1 TO INDX.

        6-CONT-EDIT.
           IF WS-EDI-INSTAL = "Y"
               IF E-UM (INDX) NOT = SPACES
                  IF INDX = 1 OR 2 OR 3 OR 4
                      MOVE E-UM (INDX) TO VALIDUM OF MVALIDUM-O-REC
                      START MVALIDUM-O KEY = VALIDUM OF MVALIDUM-O-REC
                          INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                      END-START
                      IF FILE-STATUS = "00"
                         MOVE HIGH-VALUES TO VALIDUM OF MVALIDUM-O-REC
                       START MVALIDUM-O KEY > VALIDUM OF MVALIDUM-O-REC
                             INVALID KEY MOVE 0 TO FILE-STATUS
                         END-START
      ****         UM ALREADY EXITS --- CANNOT ADD   ****
                          MOVE  21 TO LANG-SETNUM
                          MOVE  15 TO LANG-MSGNUM
                          PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                          MOVE MESSAGE-BUFFER TO E-UM-ERRLINE
                          MOVE B"1" TO IND(99), IND(INDX)
                          GO TO 6-SHOW-FORM
                      ELSE
                      IF FILE-STATUS-1 = "2"
                          PERFORM 61-ADD-MVALIDUM
                      ELSE
                      MOVE "GET MVALIDUM ERROR IN 6-EDIT-CHECK"
                          TO BU-DISPLAY-MSG
                      MOVE E-UM (INDX) TO BU-DISPLAY-FLD (1)
                      PERFORM 2100-BLOWUP
                  ELSE
                  MOVE E-UM (INDX) TO MVALIDUM-ARG
                  MOVE MVALIDUM-ARG TO VALIDUM OF MVALIDUM-O-REC
                  READ MVALIDUM-O INTO BUF-MVALIDUM
                     INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                  END-READ
                  IF FILE-STATUS-1 = "2"
      ****     UM DOES NOT EXIST --- CANNOT MODIFY   ****
                      MOVE  21 TO LANG-SETNUM
                      MOVE  16 TO LANG-MSGNUM
                      PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                      MOVE MESSAGE-BUFFER TO E-UM-ERRLINE
                      MOVE B"1" TO IND(99), IND(INDX)
                      GO TO 6-SHOW-FORM
                  ELSE
                  IF FILE-STATUS = "00"
                      PERFORM 62-MODIFY-MVALIDUM
                              THRU 62-MODIFY-MVALIDUM-X
                  ELSE
                  MOVE "GET MVALIDUM ERROR IN 6-EDIT-CHECK"
                      TO BU-DISPLAY-MSG
                  MOVE UM (INDX) TO BU-DISPLAY-FLD (1)
                  PERFORM 2100-BLOWUP
               ELSE
               NEXT SENTENCE
           ELSE
           IF UM (INDX) NOT = SPACES
              IF INDX = 1 OR 2 OR 3 OR 4
                  MOVE UM (INDX) TO VALIDUM OF MVALIDUM-O-REC
                  START MVALIDUM-O KEY = VALIDUM OF MVALIDUM-O-REC
                      INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                  END-START
                  IF FILE-STATUS = "00"
                     MOVE HIGH-VALUES TO VALIDUM OF MVALIDUM-O-REC
                     START MVALIDUM-O KEY > VALIDUM OF MVALIDUM-O-REC
                         INVALID KEY MOVE 0 TO FILE-STATUS
                     END-START
      ****     UM ALREADY EXITS --- CANNOT ADD   ****
                      MOVE  21 TO LANG-SETNUM
                      MOVE  15 TO LANG-MSGNUM
                      PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                      MOVE MESSAGE-BUFFER TO UM-ERRLINE
                      MOVE B"1" TO IND(99), IND(INDX)
                      GO TO 6-SHOW-FORM
                  ELSE
                  IF FILE-STATUS-1 = "2"
                      PERFORM 61-ADD-MVALIDUM
                  ELSE
                      MOVE "GET MVALIDUM ERROR IN 6-EDIT-CHECK"
                          TO BU-DISPLAY-MSG
                      MOVE UM (INDX) TO BU-DISPLAY-FLD (1)
                       PERFORM 2100-BLOWUP
              ELSE
                  MOVE UM (INDX) TO MVALIDUM-ARG
                  MOVE MVALIDUM-ARG TO VALIDUM OF MVALIDUM-O-REC
                  READ MVALIDUM-O INTO BUF-MVALIDUM
                     INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                  END-READ
                  IF FILE-STATUS-1 = "2"
      ****     UM DOES NOT EXIST --- CANNOT MODIFY   ****
                      MOVE  21 TO LANG-SETNUM
                      MOVE  16 TO LANG-MSGNUM
                      PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                      MOVE MESSAGE-BUFFER TO UM-ERRLINE
                      MOVE B"1" TO IND(99), IND(INDX)
                      GO TO 6-SHOW-FORM
                  ELSE
                  IF FILE-STATUS = "00"
                      PERFORM 62-MODIFY-MVALIDUM
                              THRU 62-MODIFY-MVALIDUM-X
                  ELSE
                      MOVE "GET MVALIDUM ERROR IN 6-EDIT-CHECK"
                          TO BU-DISPLAY-MSG
                      MOVE UM (INDX) TO BU-DISPLAY-FLD (1)
                      PERFORM 2100-BLOWUP.

           ADD 1 TO INDX.
           IF INDX < 6
               GO TO 6-CONT-EDIT.
           GO TO 6-MAIN.
       6-MAIN-X.
           EXIT.

       61-ADD-MVALIDUM.
           MOVE SPACES          TO BUF-MVALIDUM.
           IF WS-EDI-INSTAL = "Y"
               MOVE E-UM (INDX)      TO VALID-UM
               MOVE E-EDI-UM (INDX)  TO VALID-EDI-UM
               MOVE E-UM-DESC (INDX) TO VALID-UM-DESC
           ELSE
           MOVE UM (INDX)       TO VALID-UM.
           MOVE UM-DESC (INDX)  TO VALID-UM-DESC.
           WRITE MVALIDUM-O-REC FROM BUF-MVALIDUM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "WRT MVALIDUM ERROR IN 61-ADD-MVALIDUM"
                    TO BU-DISPLAY-MSG
               MOVE UM (INDX) TO BU-DISPLAY-FLD (1)
               PERFORM 2100-BLOWUP.

       62-MODIFY-MVALIDUM.
           IF WS-EDI-INSTAL = "Y"
               MOVE "EUNITMEASM" TO VIEW-NFNAME
           ELSE
           MOVE "UNITMEASM" TO VIEW-NFNAME.

       62-PUT-BUFFER.
           IF WS-EDI-INSTAL = "Y"
               MOVE VALID-UM-DESC TO E-UM-DESC (5)
               MOVE VALID-EDI-UM  TO E-EDI-UM (5)
           ELSE
           MOVE VALID-UM-DESC TO UM-DESC (5).
      ***  INPUT DATA ABOVE AND PRESS 'ENTER'  ***
           MOVE   9 TO LANG-SETNUM.
           MOVE  20 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO UM-MSGLINE, E-UM-MSGLINE.

       62-SHOW-FORM.
           IF WS-EDI-INSTAL = "Y"
               MOVE E-UM-SCREEN     TO DISPLAY-REC
               PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN
               MOVE DISPLAY-REC     TO E-UM-SCREEN
           ELSE
           MOVE UM-SCREEN     TO DISPLAY-REC
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN
           MOVE DISPLAY-REC   TO UM-SCREEN.
           IF VIEW-LASTKEY = 3
               GO TO 62-MODIFY-MVALIDUM-X.
           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO UM-ERRLINE
               MOVE B"1" TO IND(99)
               GO TO 62-SHOW-FORM.

       62-REPLACE-MVALIDUM.
           IF WS-EDI-INSTAL = "Y"
               MOVE E-EDI-UM (INDX) TO VALID-EDI-UM
               MOVE E-UM-DESC (INDX) TO VALID-UM-DESC
           ELSE
           MOVE UM-DESC (INDX) TO VALID-UM-DESC.
           REWRITE MVALIDUM-O-REC FROM BUF-MVALIDUM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              MOVE "REWRITE MVALIDUM ERROR IN 62-REPLACE-MVALIDUM"
                   TO BU-DISPLAY-MSG
              MOVE UM (5) TO BU-DISPLAY-FLD (1)
              PERFORM 2100-BLOWUP.

       62-MODIFY-MVALIDUM-X.
            EXIT.

       69-HELP-SCREEN.
           PERFORM 9999-GETNEXTFORM.
      *    MOVE SPACES TO DE-FIELDS-1.
      *    MOVE SPACES TO MESSAGE-BUFFER.
           PERFORM 9999-PUTWINDOW.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           IF VIEW-NFNAME = "HELPUM1"
               IF VIEW-LASTKEY = 1
                   MOVE "HELPUM2" TO VIEW-NFNAME
                   GO TO 69-HELP-SCREEN.
       69-HELP-SCREEN-X.    EXIT.

       COPY DISPCALL IN COPYLIB.

       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.

      *COPY GKMPLPKO IN COPY DBCS.
       9999-GETKEY-MPLTINFO-PK-O.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-O.
           READ MPLTINFO-PK-O INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MPLTINFO-PK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-RESET-MPLTINFO-PK-O.
           MOVE HIGH-VALUES TO PLTINFOKEY OF MPLTINFO-PK-REC-O.
           START MPLTINFO-PK-O KEY > PLTINFOKEY OF MPLTINFO-PK-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       COPY SCRNCALL IN COPYLIB.
       COPY SCRNCL1  IN COPYLIB.
