       IDENTIFICATION DIVISION.
       PROGRAM-ID.    SUPDPOFL.
       AUTHOR.        CA YODER.

      **************************************************************
      *                                                            *
      *   S U P D P O F L      THIS PROGRAM ALLOWS THE USER TO     *
      *     MODIFY MCFPPOFILE WHICH CONTAINS POS IN ERROR          *
      *     DOWNLOADED FROM THE CORPORATE PURCHASING SYSTEM.  THE  *
      *     FILE CAN THEN BE RETRANSMITTED TO CSIS.                *
      *                                                            *
      **************************************************************
      *C

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.

       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZUPDPOFL-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MVALIDUM-I
                  ASSIGN TO DATABASE-MCFLCS0401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT POFILE-O
                  ASSIGN TO DISK-MCFPPOFILE
                  ORGANIZATION IS RELATIVE
                    ACCESS MODE IS DYNAMIC
                  RELATIVE KEY IS POFILE-IX
                  FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-O
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC             PIC X(2000).
      *    COPY DDS-ALL-FORMATS OF ZUPDPOFL.

       FD  MVALIDUM-I
           LABEL RECORDS ARE STANDARD.
       01  MVALIDUM-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0401.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0501.

       FD  POFILE-O
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 202 CHARACTERS
           DATA RECORD IS POFILE-REC-O.
       01  POFILE-REC-O          PIC X(202).

       FD  MSTORERM-O
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLCS0201.

       WORKING-STORAGE SECTION.
       77  COMP-SCREEN-INDIC       PIC X(3)  VALUE SPACES.
       77  ACT-KEY                 PIC 9(9)  VALUE ZEROS.
       77  SUB                     PIC S9(4) VALUE ZEROS COMP-4.
       77  EDIT-ERR-SW             PIC X     VALUE "N".

       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

      **********************
      *                    *
      *  S W I T C H E S   *
      *                    *
      **********************

       COPY VCOMAREA IN COPYLIB.

       01  MESSAGE-BUFFER.
           05  MSG-TEXT              PIC X(64)    VALUE SPACE.
           05  MSG-FLD               PIC X(12)    VALUE SPACE.
           05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC Z(11)9.

       01  FIELD-NUMBER              PIC S9(4)    VALUE 1       COMP-4.

       01  SCREEN-PRINT-PARMS.
           05  PRINTCNTL             PIC S9(4)    VALUE ZERO    COMP-4.
           05  PAGECNTL              PIC S9(4)    VALUE 49      COMP-4.
           05  SPOOLFIL-OPEN-SW      PIC X        VALUE "N".

       COPY CATREAD IN COPYLIB.

       COPY DISPDATA IN COPYLIB.

       COPY IOFEEDBACK IN COPYLIB.

       COPY PLANTS IN COPYLIB.

      **************************************************************
      **                                                          **
      **             TERMINAL I/O DATA AREA                       **
      **                                                          **
      **************************************************************

       01  SCREEN-1.
           05  DE1-PO-NUM              PIC X(7)  VALUE SPACES.
           05  DE1-PO-RLSE             PIC X(3).
           05  DE1-PO-ITEM             PIC X(4).
           05  DE1-REQ-NUM             PIC X(10).
           05  DE1-CORP-CODE           PIC X(7).
           05  DE1-QTY                 PIC Z(7)9.9(4)-.
           05  DE1-QTY-UM              PIC X(2).
           05  DE1-NEW-QTY-UM          PIC X(2).
           05  DE1-PRICE               PIC Z(7)9.9(4)-.
           05  DE1-PRICE-UM            PIC X(2).
           05  DE1-NEW-PRICE-UM        PIC X(2).
           05  DE1-F5-KEY              PIC X(13).
           05  DE1-MESSAGE-LINE        PIC X(79) VALUE SPACES.

       01  SCREEN-2.
           05  DE2-CORP-CODE           PIC X(7).
           05  DE2-UM                  PIC X(2).
           05  DE2-UM1                 PIC X(2).
           05  DE2-UM1-CF              PIC 9(6)V9(4).
           05  DE2-UM2                 PIC X(2).
           05  DE2-UM2-CF              PIC 9(6)V9(4).
           05  DE2-MESSAGE-LINE        PIC X(79) VALUE SPACES.

      **************************************************************
      **                                                          **
      **                DATABASE I/O BUFFER AREA                  **
      **                                                          **
      **************************************************************

       COPY MPLTINFO IN COPYLIB.

       COPY POFILE IN COPYLIB.

       COPY MSTORERM IN COPYLIB.

       COPY MVALIDUM IN COPYLIB.

      *********************
      *                   *
      *   DATA SET NAMES  *
      *                   *
      *********************

       01  DSET-NAMES.
           05  DSET-NAME              PIC X(16)  VALUE SPACES.
           05  DSET-MPLTINFO          PIC X(16)  VALUE "MPLTINFO;".

       COPY DATAB IN COPYLIB.

       01 ITEMS-LISTING.
           05  ALL-ITEMS              PIC XX    VALUE "@;".
           05  CODE-SEARCH            PIC X(10) VALUE "CORP-CODE;".
           05  PO-SEARCH              PIC X(10) VALUE "PO-RCV-NO;".
           05  REQ-SEARCH             PIC X(12) VALUE "REQ-NUMBER;".

       01 ARG-VALUES.
           05  REQ-ARG                PIC X(12) VALUE SPACES.
           05  PLT-ARG                PIC X(4)  VALUE SPACES.
           05  CODE-ARG               PIC X(8)  VALUE SPACES.
           05  PO-ARG                 PIC X(13) VALUE SPACES.
           05  UM-ARG                 PIC X(2)  VALUE SPACES.

       COPY CCHKOBJ IN COPYLIB.

       COPY CCHKOBJM IN COPYLIB.

       01  DATES-AND-TIMES.
           05  HP-CUR-DATE.
               10  MM               PIC XX.
               10  FILLER           PIC X.
               10  DD               PIC XX.
               10  FILLER           PIC X.
               10  YY               PIC XX.
       01  CUR-DATE-CN.
           05  CUR-CC               PIC XX.
           05  CUR-DATE.
               10  CUR-YY           PIC XX.
               10  CUR-MM           PIC XX.
               10  CUR-DD           PIC XX.

       COPY TDATECHK IN COPYLIB.

       COPY LANGUAGE IN COPYLIB.

       COPY SEDIVNCK IN COPYLIB.

      *-----------------------------------------------------------------
      *  L I N K A G E   S E C T I O N
      *-----------------------------------------------------------------

       LINKAGE SECTION.

       01  POFILE-OPT             PIC X.

       01  POFILE-IX              PIC 9(4) COMP-4.

       01  RTN-CODE               PIC 9.

       01  UM-CODE                PIC X.

       01  BU-DISPLAY-MSG         PIC X(60).

       01  BU-DISPLAY-FLDS.
           05  BU-DISPLAY-LINE OCCURS 5 TIMES.
               10  BU-DISPLAY-FLD        PIC X(14).
               10  BU-DISPLAY-FLD9       PIC S9(8).

       PROCEDURE DIVISION  USING POFILE-OPT, POFILE-IX, RTN-CODE,
                           UM-CODE, BU-DISPLAY-MSG, BU-DISPLAY-FLDS.

       PROC-DIV SECTION 01.

       BEGIN-HERE.
           PERFORM 1-HSK THRU 1-H-X.

           PERFORM 6-MAIN THRU 6-M-X.

           PERFORM 2-EOJ  THRU 2-EOJ-X.

           GOBACK.

       1-HSK.
           OPEN I-O    DISPLAY-FILE, POFILE-O, MVALIDUM-I, MPLTINFO-I,
                       MSTORERM-O.

           MOVE "P 01"  TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ MPLTINFO (P 01) FAILED"   TO BU-DISPLAY-MSG
               MOVE "IN SUPDPOFL"    TO BU-DISPLAY-FLD (1)
               MOVE POFILE-IX        TO BU-DISPLAY-FLD (2)
               MOVE PLT-ARG          TO BU-DISPLAY-FLD (3)
               MOVE 1                TO RTN-CODE
               GOBACK.
           MOVE MPLTINFO-COMPANY            TO  WHICH-PLANT.

           ACCEPT CUR-DATE FROM DATE.
           IF CUR-YY > "70"
               MOVE "19"                    TO  CUR-CC
           ELSE
               MOVE "20"                    TO  CUR-CC.

       1-H-X.
           EXIT.

       2-EOJ.
           CLOSE   DISPLAY-FILE, POFILE-O, MVALIDUM-I, MPLTINFO-I,
                   MSTORERM-O.

       2-EOJ-X.
            EXIT.

       4-PGM-ERROR.
           MOVE B"1" TO IND(FIELD-NUMBER), IND(99).
           IF VIEW-NFNAME = "UMSCRN"
               MOVE MESSAGE-BUFFER  TO DE2-MESSAGE-LINE
           ELSE
               MOVE MESSAGE-BUFFER  TO DE1-MESSAGE-LINE.

       4-PGM-ERROR-X.
           EXIT.

      **************************************************
      *                                                *
      *     6 - M A I N                                *
      *                                                *
      **************************************************

       6-MAIN.
           READ POFILE-O INTO BUF-POFILE
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

           IF FILE-STATUS NOT = "00"
              MOVE "POFILE REC NOT FOUND 6-MAIN" TO BU-DISPLAY-MSG
              MOVE "IN SUPDPOFL"    TO BU-DISPLAY-FLD (1)
              MOVE POFILE-IX        TO BU-DISPLAY-FLD (2)
              MOVE 1                TO RTN-CODE
              GOBACK.

           INITIALIZE DISPLAY-REC.

      *------- OPTIONS AVAILABLE:
      *-------    C = CANCEL RE-TRANSMISSION INDICATOR
      *-------    R = MARK FOR RE-TRANSMISSION TO CSIS
      *-------    X = UPDATE UM ON ERROR RECORD

           IF POFILE-OPT = "C"
               MOVE " "             TO POFL-FLAG
               PERFORM 61-REWRITE-POFILE.

           IF POFILE-OPT = "R"
               MOVE "X"             TO POFL-FLAG
               PERFORM 61-REWRITE-POFILE.

           IF POFILE-OPT = "X"
               PERFORM 60-UPDATE-UM THRU 60-UU-X.

       6-M-X.
           EXIT.

      **************************************************
      *                                                *
      *     6 0 - U P D A T E - U M                    *
      *                                                *
      **************************************************

       60-UPDATE-UM.
           MOVE ALL B"0" TO SRF-INDICATORS.
           MOVE SPACES             TO  SEDIVNCK-PARMS.
           MOVE "CHGSCRN"          TO  VIEW-NFNAME.
           MOVE SPACES             TO  SCREEN-1.

      *-------- CHECK FOR CODED ITEM NUMBER.
           IF PO-TRANS = "3"
               MOVE "F5=ADD ALT UM"           TO  DE1-F5-KEY
               IF KELLY-PLANT
                   MOVE K-ITM-NUM             TO  DE1-PO-ITEM
                   MOVE K-ITM-REQ-NO          TO  DE1-REQ-NUM
                   MOVE K-CORP-CODE           TO  DE1-CORP-CODE
                   MOVE K-ITM-QTY-ORD-9       TO  DE1-QTY
                   MOVE K-ITM-QTY-UM          TO  DE1-QTY-UM
                   MOVE K-ITM-UNIT-PRICE-9    TO  DE1-PRICE
                   MOVE K-ITM-PRICE-UM        TO  DE1-PRICE-UM
               ELSE
                   MOVE IN-ITM-NUM            TO  DE1-PO-ITEM
                   MOVE IN-ITM-REQ-NO         TO  DE1-REQ-NUM
                   MOVE IN-CORP-CODE          TO  DE1-CORP-CODE
                   MOVE IN-ITM-QTY-ORD-9      TO  DE1-QTY
                   MOVE IN-ITM-QTY-UM         TO  DE1-QTY-UM
                   MOVE IN-ITM-UNIT-PRICE-9   TO  DE1-PRICE
                   MOVE IN-ITM-PRICE-UM       TO  DE1-PRICE-UM.
      *-------- CHECK FOR NON-CODED ITEM NUMBER.
           IF PO-TRANS = "4"
               MOVE "F5=ADD NEW UM"           TO  DE1-F5-KEY
               IF KELLY-PLANT
                   MOVE K-NSTR-ITM-NUM        TO  DE1-PO-ITEM
                   MOVE K-NSTR-REQ-NO         TO  DE1-REQ-NUM
                   MOVE "N/C    "             TO  DE1-CORP-CODE
                   MOVE K-NSTR-QTY-ORD-9      TO  DE1-QTY
                   MOVE K-NSTR-QTY-UM         TO  DE1-QTY-UM
                   MOVE K-NSTR-UNIT-PRICE-9   TO  DE1-PRICE
                   MOVE K-NSTR-PRICE-UM       TO  DE1-PRICE-UM
               ELSE
                   MOVE IN-NSTR-ITM-NUM       TO  DE1-PO-ITEM
                   MOVE IN-NSTR-REQ-NO        TO  DE1-REQ-NUM
                   MOVE "N/C    "             TO  DE1-CORP-CODE
                   MOVE IN-NSTR-QTY-ORD-9     TO  DE1-QTY
                   MOVE IN-NSTR-QTY-UM        TO  DE1-QTY-UM
                   MOVE IN-NSTR-UNIT-PRICE-9  TO  DE1-PRICE
                   MOVE IN-NSTR-PRICE-UM      TO  DE1-PRICE-UM.

           MOVE PO-NUM-1-7         TO  DE1-PO-NUM.
           MOVE PO-RLSE-8-10       TO  DE1-PO-RLSE.

           MOVE B"1" TO IND(11).

       60-SHOWFORM.
           MOVE SCREEN-1           TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC        TO SCREEN-1.

           IF ENTER-KEY-USED
               GO TO 60-VALIDATE-UM
           ELSE
           IF (VIEW-LASTKEY = 3) OR (VIEW-LASTKEY = 2)
               GO TO 6-M-X
           ELSE
      *-------- ADD A NEW UNIT OF MEASURE.
           IF VIEW-LASTKEY = 5
               IF PO-TRANS = "4"
                   CALL "SPCSUOM"  USING BASE, VIEW-COMAREA,
                                               LANGUAGE-PARMS
                   MOVE "X"         TO  POFL-FLAG
                   PERFORM 61-REWRITE-POFILE
                   MOVE "X"         TO  UM-CODE
                   GO TO 60-UPDATE-UM
               ELSE
               IF PO-TRANS = "3"
                   MOVE DE1-CORP-CODE TO CORPCDE OF MSTORERM-REC-O
                   READ MSTORERM-O INTO BUF-MSTORERM
                       INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                   END-READ
                   IF FILE-STATUS NOT = "00"
      *                STORES CODE DOES NOT EXIST
                       MOVE  19             TO LANG-SETNUM
                       MOVE   9             TO LANG-MSGNUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE DE1-CORP-CODE   TO  MSG-FLD
                       MOVE 3               TO  FIELD-NUMBER
                       PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                       GO TO 60-SHOWFORM
                   ELSE
                       PERFORM 62-ADD-UM THRU 62-AU-X
                       GO TO 60-UPDATE-UM
                   END-IF
               ELSE
      *        "* INVALID FUNCTION KEY ENTERED *"
                   MOVE   9 TO LANG-SETNUM
                   MOVE  10 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 3  TO  FIELD-NUMBER
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   GO TO 60-SHOWFORM
               END-IF
           ELSE
           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *        "* INVALID FUNCTION KEY ENTERED *"
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 3  TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 60-SHOWFORM.

       60-VALIDATE-UM.
           IF DE1-NEW-QTY-UM > SPACES
               MOVE DE1-NEW-QTY-UM  TO  UM-ARG
               MOVE UM-ARG TO VALIDUM OF MVALIDUM-REC-I
               START MVALIDUM-I KEY = VALIDUM OF MVALIDUM-REC-I
                   INVALID KEY MOVE "2" TO FILE-STATUS
               END-START
               IF FILE-STATUS NOT = "00"
                   IF FILE-STATUS-1 = "2"
      *                "UNIT PRICE UM IS INVALID"
                       MOVE  17 TO LANG-SETNUM
                       MOVE  13 TO LANG-MSGNUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE  23 TO FIELD-NUMBER
                       PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                       MOVE B"1" TO IND(11)
                       GO TO 60-SHOWFORM.

           IF DE1-NEW-PRICE-UM > SPACES
               MOVE DE1-NEW-PRICE-UM  TO  UM-ARG
               MOVE UM-ARG TO VALIDUM OF MVALIDUM-REC-I
               START MVALIDUM-I KEY = VALIDUM OF MVALIDUM-REC-I
                   INVALID KEY MOVE "2" TO FILE-STATUS
               END-START
               IF FILE-STATUS NOT = "00"
                   IF FILE-STATUS-1 = "2"
      *                "UNIT PRICE UM IS INVALID"
                       MOVE  21 TO LANG-SETNUM
                       MOVE   8 TO LANG-MSGNUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE  24 TO FIELD-NUMBER
                       PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                       GO TO 60-SHOWFORM.

           IF DE1-NEW-QTY-UM = SPACES AND DE1-NEW-PRICE-UM = SPACES
               GO TO 60-SHOWFORM.
      *-------- IF NEW VALUES SAME AS PREVIOUS VALUES, GO TO EXIT.
           IF  DE1-NEW-QTY-UM = DE1-QTY-UM     AND
               DE1-NEW-PRICE-UM = DE1-PRICE-UM
               GO TO 60-SHOWFORM.

      *-------- REPLACE QUANTITY UM.
           IF DE1-NEW-QTY-UM > SPACES
               IF PO-TRANS = "3"
                   IF KELLY-PLANT
                       MOVE DE1-NEW-QTY-UM    TO  K-ITM-QTY-UM
                   ELSE
                       MOVE DE1-NEW-QTY-UM    TO  IN-ITM-QTY-UM
                   END-IF
               ELSE
                   IF KELLY-PLANT
                       MOVE DE1-NEW-QTY-UM    TO  K-NSTR-QTY-UM
                   ELSE
                       MOVE DE1-NEW-QTY-UM    TO  IN-NSTR-QTY-UM
                   END-IF
               END-IF
               MOVE DE1-NEW-QTY-UM            TO  DE1-QTY-UM
               MOVE SPACES                    TO  DE1-NEW-QTY-UM.

      *-------- REPLACE PRICE UM.
           IF DE1-NEW-PRICE-UM > SPACES
               IF PO-TRANS = "3"
                   IF KELLY-PLANT
                       MOVE DE1-NEW-PRICE-UM  TO  K-ITM-PRICE-UM
                                                  DE1-PRICE-UM
                   ELSE
                       MOVE DE1-NEW-PRICE-UM  TO  IN-ITM-PRICE-UM
                                                  DE1-PRICE-UM
                   END-IF
               ELSE
                   IF KELLY-PLANT
                       MOVE DE1-NEW-PRICE-UM  TO  K-NSTR-PRICE-UM
                   ELSE
                       MOVE DE1-NEW-PRICE-UM  TO  IN-NSTR-PRICE-UM
                   END-IF
               END-IF
               MOVE DE1-NEW-PRICE-UM          TO  DE1-PRICE-UM
               MOVE SPACES                    TO  DE1-NEW-PRICE-UM.


           PERFORM 61-REWRITE-POFILE.

           GO TO 60-SHOWFORM.

       60-UU-X.
           EXIT.

       61-REWRITE-POFILE.
           REWRITE POFILE-REC-O FROM BUF-POFILE
               INVALID KEY MOVE FILE-STATUS  TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "ERROR IN REWRITE POFILE *73-RA" TO BU-DISPLAY-MSG
               MOVE "IN SUPDPOFL"    TO BU-DISPLAY-FLD (1)
               MOVE POFILE-IX        TO BU-DISPLAY-FLD (2)
               MOVE 1                TO RTN-CODE
           ELSE
               MOVE 0 TO RTN-CODE.

      **************************************************
      *                                                *
      *     6 2 - A D D - U M                          *
      *                                                *
      **************************************************

       62-ADD-UM.
           MOVE ALL B"0"           TO  SRF-INDICATORS.
           MOVE SPACES             TO  SEDIVNCK-PARMS.
           MOVE "UMSCRN"           TO  VIEW-NFNAME.
           MOVE SPACES             TO  SCREEN-2.

           MOVE DE1-CORP-CODE      TO  DE2-CORP-CODE.
           MOVE STR-UM             TO  DE2-UM.
           MOVE STR-UM1            TO  DE2-UM1.
           MOVE STR-UM1-CF         TO  DE2-UM1-CF.
           MOVE STR-UM2            TO  DE2-UM2.
           MOVE STR-UM2-CF         TO  DE2-UM2-CF.

           IF STR-UM1 > SPACES AND STR-UM2 > SPACES
                               AND UM-CODE NOT = "X"
      *        CANNOT ADD ANY MORE ALTERNATE UNITS OF MEASURE
               MOVE  03 TO LANG-SETNUM
               MOVE 629 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 1              TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 62-SHOWFORM.

       62-SHOWFORM.
           IF STR-UM1 > SPACES
               MOVE B"1"           TO  IND(20).
           IF STR-UM2 > SPACES
               MOVE B"1"           TO  IND(21).

           MOVE SCREEN-2           TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC        TO  SCREEN-2.

           IF VIEW-LASTKEY = 3
               GO TO 62-AU-X
           ELSE
           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *        "* INVALID FUNCTION KEY ENTERED *"
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 3  TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 62-SHOWFORM.

       62-VALIDATE-UM.
           IF DE2-UM1 = "AS" OR "LT"
      *        INVALID UNIT OF MEASURE FOR A CODED ITEM
               MOVE  66 TO LANG-SETNUM
               MOVE 172 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 10 TO FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 62-SHOWFORM.

           IF DE2-UM2 = "AS" OR "LT"
      *        INVALID UNIT OF MEASURE FOR A CODED ITEM
               MOVE  66 TO LANG-SETNUM
               MOVE 172 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 12 TO FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 62-SHOWFORM.

           IF DE2-UM1 > SPACES
               MOVE DE2-UM1      TO  UM-ARG
               MOVE 10           TO  FIELD-NUMBER
               PERFORM 63-DBGET-MVALIDUM
               IF EDIT-ERR-SW = "Y"
                   GO TO 62-SHOWFORM.

           IF DE2-UM2 > SPACES
               MOVE DE2-UM2      TO  UM-ARG
               MOVE 12           TO  FIELD-NUMBER
               PERFORM 63-DBGET-MVALIDUM
               IF EDIT-ERR-SW = "Y"
                   GO TO 62-SHOWFORM.

           IF DE2-UM1 = SPACES
               IF DE2-UM1-CF = ZEROS
                   GO TO 62-EDIT-UM2
               ELSE
      ***          CONV FACTOR MUST BE ZERO - CORRECT AND REENTER
                   MOVE   3 TO LANG-SETNUM
                   MOVE  85 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 11 TO FIELD-NUMBER
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   GO TO 62-SHOWFORM.

           IF DE2-UM1-CF = ZEROS
      ***      CONV FACTOR CANNOT BE ZEROES - CORRECT AND REENTER
               MOVE   3 TO LANG-SETNUM
               MOVE  86 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 11 TO FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 62-SHOWFORM.

       62-EDIT-UM2.
           IF DE2-UM2 = SPACES
             IF DE2-UM2-CF = ZEROS
                   GO TO 62-CHECK-FOR-DUP-UM
               ELSE
      ***          CONV FACTOR MUST BE ZERO - CORRECT AND REENTER
                   MOVE   3 TO LANG-SETNUM
                   MOVE  85 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 13 TO FIELD-NUMBER
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   GO TO 62-SHOWFORM.

           IF DE2-UM2-CF = ZEROS
      ***      CONV FACTOR CANNOT BE ZEROES - CORRECT AND REENTER
               MOVE   3 TO LANG-SETNUM
               MOVE  86 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 13 TO FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 62-SHOWFORM.

       62-CHECK-FOR-DUP-UM.
           IF DE2-UM1 = SPACES
               IF DE2-UM2 = SPACES
                   GO TO 62-UPDATE-MSTORERM.
           IF DE2-UM = DE2-UM1
      ***      DUPLICATE UNITS OF MEASURE - CORRECT#
               MOVE   4 TO LANG-SETNUM
               MOVE  24 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 10  TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 62-SHOWFORM.

           IF DE2-UM = DE2-UM2
      ***      DUPLICATE UNITS OF MEASURE - CORRECT#
               MOVE   4 TO LANG-SETNUM
               MOVE  24 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 12  TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 62-SHOWFORM.

           IF DE2-UM1 = DE2-UM2
      ***      DUPLICATE UNITS OF MEASURE - CORRECT#
               MOVE   4 TO LANG-SETNUM
               MOVE  24 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 12  TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 62-SHOWFORM.

       62-UPDATE-MSTORERM.
           IF STR-UM1 > SPACES AND STR-UM2 > SPACES
                               AND UM-CODE NOT = "X"
      *        CANNOT ADD ANY MORE ALTERNATE UNITS OF MEASURE
               MOVE  03 TO LANG-SETNUM
               MOVE 629 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 1                TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 62-SHOWFORM.

           IF DE2-UM1 > SPACES
               MOVE DE2-UM1          TO  STR-UM1
               MOVE DE2-UM1-CF       TO  STR-UM1-CF.
           IF DE2-UM2 > SPACES
               MOVE DE2-UM2          TO  STR-UM2
               MOVE DE2-UM2-CF       TO  STR-UM2-CF.
           REWRITE MSTORERM-REC-O FROM BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "UPDATE 62-UPDATE-MSTORERM" TO BU-DISPLAY-MSG
               MOVE "IN SUPDPOFL"    TO  BU-DISPLAY-FLD (1)
               MOVE DE2-CORP-CODE    TO  BU-DISPLAY-FLD (2)
               MOVE 1                TO  RTN-CODE
               GOBACK.
           MOVE "X"                  TO  POFL-FLAG.
           PERFORM 61-REWRITE-POFILE.
           MOVE "X"                  TO  UM-CODE.
           GO TO 62-ADD-UM.

       62-AU-X.
           EXIT.

       63-DBGET-MVALIDUM.
           MOVE "N"                   TO EDIT-ERR-SW.
           MOVE UM-ARG TO VALIDUM OF MVALIDUM-REC-I.
           START MVALIDUM-I KEY = VALIDUM OF MVALIDUM-REC-I
               INVALID KEY MOVE "2"   TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
      ***          INVALID UNIT OF MEASURE
               MOVE   9 TO LANG-SETNUM
               MOVE  12 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               MOVE "Y"               TO  EDIT-ERR-SW.

       CAT-READ SECTION.

       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.

       COPY DISPCALL IN COPYLIB.

