000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.
000400          SUPDMATL.
000500 AUTHOR.
000600     KURT MOVSESIAN.
000700*REMARKS.
000900***************************************************************
001000*                                                             *
001100*   S U P D M A T L                                           *
001200*                                                             *
001300*   THIS SUB PROGRAM UPDATES MMATL-ACCUM WITH THE BUFFER      *
001400*   PASSED.  IT ALSO SETS THE AVERAGE COST UPDATE SWITCH      *
001500*   SO A NEW AVERAGE COST WILL BE CALCULATE SINCE THERES      *
001600*   BEEN ACTIVITY                                             *
001700***************************************************************
      *C   09SEP1996   DAVE PLUM
      *C     RECOMPILED FOR CENTURY DATABASE CHANGES.
      *C
001900 ENVIRONMENT DIVISION.
002000 CONFIGURATION SECTION.
002100 SOURCE-COMPUTER.  HP-3000.
002200 OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT MMATL-ACCUM
              ASSIGN TO DATABASE-MCFLCA0601
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
              FILE STATUS IS FILE-STATUS.
002300
002400 DATA DIVISION.
002500 FILE SECTION.
       FD  MMATL-ACCUM
           LABEL RECORDS ARE STANDARD.
       01  MMATL-ACCUM-REC.
           COPY DDS-MCRPCA0600  OF MCFLCA0601.
008800
002600 WORKING-STORAGE SECTION.
002700
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X.
           05  FILE-STATUS-2            PIC X.

004000 COPY DBMODES    IN COPYLIB.
004100
004300 LINKAGE SECTION.
004400
004500 01  ACCTG-BASE                   PIC X(10).
004600
004700 COPY MATLACUM IN COPYLIB.
004800
004900 COPY DBSTAT   IN COPYLIB.
005000
005100 01  BU-DISPLAY-MSG.
005200     05  BU-DISPLAY-MSG-1         PIC X(1).
005300     05  FILLER                   PIC X(59).
005400
005500 01  BU-DISPLAY-FLDS.
005600     05  BU-DISPLAY-LINE  OCCURS 5 TIMES.
005700         10  BU-DISPLAY-FLD       PIC X(14).
005800         10  BU-DISPLAY-FLD9      PIC S9(8).
005900
006100
006200 PROCEDURE DIVISION USING  ACCTG-BASE,
006300                           BUF-MATLACUM,
006400                           STATUS-AREA,
006500                           BU-DISPLAY-MSG,
006600                           BU-DISPLAY-FLDS.
006700
006800 SUPDMATL SECTION 05.
006900
007000 BEGIN-HERE.
           OPEN I-O  MMATL-ACCUM.
007100     PERFORM 200-MAIN THRU 200-M-X.
007200     CLOSE MMATL-ACCUM.
007300     GOBACK.
007500
007600******************************************************
007700**                                                  **
007800**   BLOWUP ROUTINE                                 **
007900**                                                  **
008000******************************************************
008100
008200 2-BLOWUP.
008300     MOVE "SUPDMATL"             TO  BU-DISPLAY-FLD (5).
008400     MOVE MATL-STORES-CODE       TO  BU-DISPLAY-FLD (4).
008500     GOBACK.
008600
008800 200-MAIN.
           MOVE 0 TO COND-WORD.
           MOVE MATL-STORES-CODE TO MATLCODE OF MMATL-ACCUM-REC.
           READ MMATL-ACCUM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
067200     IF GOOD-CALL
067300         NEXT SENTENCE
067400     ELSE
067500         MOVE "DBGET MATLACUM * 260-UPDATE" TO BU-DISPLAY-MSG
067700         GO TO 2-BLOWUP.
009900     MOVE "X"                     TO MATL-AVG-COST-UPD.
067800     MOVE BUF-MATLACUM TO MMATL-ACCUM-REC.
009800
           MOVE 0 TO COND-WORD.
           REWRITE MMATL-ACCUM-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
010600     IF GOOD-CALL
010700         NEXT SENTENCE
010800     ELSE
010900         MOVE "DBUPDATE MMATL * 200-MAIN" TO BU-DISPLAY-MSG
011000         GO TO 2-BLOWUP.
011100
      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO MATLCODE OF MMATL-ACCUM-REC.
           START MMATL-ACCUM KEY > MATLCODE OF MMATL-ACCUM-REC
               INVALID KEY MOVE "00" TO FILE-STATUS.
011600     IF GOOD-CALL
011700         NEXT SENTENCE
011800     ELSE
011900         MOVE "DBUNLOCK MMATL * 200-MAIN" TO BU-DISPLAY-MSG
012000         GO TO 2-BLOWUP.
012100
012200 200-M-X.
012300     EXIT.
