000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.
000400          SVARDEPT.
000500 AUTHOR.
000600     KURT MOVSESIAN.
000700*REMARKS.
000800
000900***************************************************************
001000*                                                             *
001100*D  S V A R D E P T                                           *
001200*                                                             *
001300*D  THIS SUB PROGRAM FINDS THE VARIANCE DEPT FOR EACH TYPE    *
001400*D  OF RAW MATERIAL (RUBBER, FABRIC, OTHER).  ALSO IF A CLASS *
001500*D  IS PASSED IT WILL FIND THE DESIRED VARIANCE DEPT.         *
001600***************************************************************
001700
001800 ENVIRONMENT DIVISION.
001900 CONFIGURATION SECTION.
002000 SOURCE-COMPUTER.  HP-3000.
002100 OBJECT-COMPUTER.  HP-3000.
002200
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MCHT-ACCTS-DP-I
               ASSIGN TO DATABASE-MCFLCA0301
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

002300 DATA DIVISION.
       FILE SECTION.
      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       FD  MCHT-ACCTS-DP-I
           LABEL RECORDS ARE STANDARD.
       01  MCHT-ACCTS-DP-REC-I.
           COPY DDS-MCRPCA0300  OF MCFLCA0301.


      *------ FD STATEMENT AREA FOR IBM ONLY ------*
002400
002500 WORKING-STORAGE SECTION.
002600 77  ALL-VAR-DEPTS-RETRIEVED-SW   PIC X(1)  VALUE SPACES.
002700
002800
002900**************************************************************
003000**************************************************************
003100**                                                          **
003200**                DATABASE I/O BUFFER AREA                  **
003300**                                                          **
003400**************************************************************
003500**************************************************************
003600
003700 COPY MCHTACCT   IN COPYLIB.
003800
003900*********************
004000*                   *
004100*   DATA SET NAMES  *
004200*                   *
004300*********************
004400
004500 01  DSET-NAMES.
004600     05  DSET-MCHT-ACCTS        PIC X(16)  VALUE "MCHT-ACCTS;".
004700
       01  FILE-STATUS.
           05  FILE-STATUS-1          PIC X(1) VALUE "0".
           05  FILE-STATUS-2          PIC X(1) VALUE "0".

004800 01 ITEMS-LISTING.
004900     05  ALL-ITEMS              PIC XX    VALUE "@;".
005000
005100 01  IMAGE-ARGS.
005200     05  DEPT-KEY               PIC X(6)  VALUE SPACES.
005300
005400 COPY DBMODES    IN COPYLIB.
005500
005600
005700 LINKAGE SECTION.
005800
005900 01  ACCTG-BASE                   PIC X(10).
006000
006100 COPY SVARDEPT IN COPYLIB.
006200
006300 COPY DBSTAT     IN COPYLIB.
006400
006500 01  BU-DISPLAY-MSG.
006600     05  BU-DISPLAY-MSG-1         PIC X(1).
006700     05  FILLER                   PIC X(59).
006800
006900 01  BU-DISPLAY-FLDS.
007000     05  BU-DISPLAY-LINE  OCCURS 5 TIMES.
007100         10  BU-DISPLAY-FLD       PIC X(14).
007200         10  BU-DISPLAY-FLD9      PIC S9(8).
007300
007400
007500
007600 PROCEDURE DIVISION USING  ACCTG-BASE,
007700                           SVARDEPT-PARMS,
007800                           STATUS-AREA,
007900                           BU-DISPLAY-MSG,
008000                           BU-DISPLAY-FLDS.
008100
008200
008300 SVARDEPT SECTION 02.
008400
008500 BEGIN-HERE.
           MOVE SPACES TO ALL-VAR-DEPTS-RETRIEVED-SW
                          BUF-MCHTACCTS.
           MOVE "00"   TO FILE-STATUS.
008600     PERFORM 200-MAIN THRU 200-M-X.
008700
008800     GOBACK.
008900
009000
009100******************************************************
009200**                                                  **
009300**   BLOWUP ROUTINE                                 **
009400**                                                  **
009500******************************************************
009600
009700 2-BLOWUP.
009800     MOVE "SVARDEPT"             TO  BU-DISPLAY-FLD (5).
009900     MOVE SVARDEPT-MATL-CLASS    TO  BU-DISPLAY-FLD (4).
010000     GOBACK.
010100
010200
010300 200-MAIN.
010400     IF SVARDEPT-GET-VAR-SW = SPACES
010500         PERFORM 400-GET-VAR-DEPT.
010600
010700     IF SVARDEPT-MATL-CLASS = SPACES
010800         MOVE SPACES              TO SVARDEPT-DEPT-CLASS-VAR
010900     ELSE
011000         IF (SVARDEPT-MATL-CLASS > 099  AND
011100             SVARDEPT-MATL-CLASS < 200)  OR
011200            (SVARDEPT-MATL-CLASS > 399  AND
011300             SVARDEPT-MATL-CLASS < 500)
011400             IF SVARDEPT-MATL-CLASS = "101" OR "102" OR
011500                                      "104" OR "106"
011600                 MOVE SVARDEPT-DEPT-102-VAR
011700                                  TO SVARDEPT-DEPT-CLASS-VAR
011800             ELSE
011900             IF SVARDEPT-MATL-CLASS > "399" AND
012000                SVARDEPT-MATL-CLASS < "500"
012100                 MOVE SVARDEPT-DEPT-400-VAR
012200                                  TO SVARDEPT-DEPT-CLASS-VAR
012300             ELSE
012400                 MOVE SVARDEPT-DEPT-OTHER-VAR
012500                                  TO SVARDEPT-DEPT-CLASS-VAR
012600         ELSE
012700             MOVE SPACES          TO SVARDEPT-DEPT-CLASS-VAR.
012800
012900 200-M-X.
013000     EXIT.
013100
013200**************************************************
013300**   GET THE VARIANCE DEPARTMENTS FROM MCHT-DEPT
013400**   DATA SET.  THERE ARE 3 VARIANCE DEPARTMENTS
013500**   RUBBER, FABRIC, AND OTHER
013600**************************************************
013700
013800 400-GET-VAR-DEPT.
           PERFORM 9999-OPEN-STUFF.

      *** INIT MCHT-ACCTS PERFORMS THE SAME FUNCTION AS A DBCLOSE
      *** MODE3 ON MCHT-ACCTS.  IT INSURES THAT THE SEQUENTIAL READ
      *** WILL BEGIN WITH THE FIRST RECORD IN THE FILE.

           PERFORM 9999-INIT-MCHT-ACCTS-DP-I.
014600
014700     MOVE SPACES                  TO SVARDEPT-DEPT-102-VAR,
014800                                     SVARDEPT-DEPT-400-VAR,
014900                                     SVARDEPT-DEPT-OTHER-VAR,
015000                                     ALL-VAR-DEPTS-RETRIEVED-SW.
015100     PERFORM 600-LOAD-VAR-DEPTS
015200         UNTIL END-OF-FILE  OR
015300             ALL-VAR-DEPTS-RETRIEVED-SW = "Y".
015400
015500     MOVE "Y"                     TO SVARDEPT-GET-VAR-SW.
           PERFORM 9999-CLOSE-STUFF.
015600
015700
015800 600-LOAD-VAR-DEPTS.
           PERFORM 9999-DBGET2-MCHT-ACCTS-DP-I.
016600     IF GOOD-CALL
016700         IF MCHT-DEPT-TYPE = "VR"
016800             MOVE MCHT-DEPT       TO SVARDEPT-DEPT-102-VAR
016900         ELSE
017000         IF MCHT-DEPT-TYPE = "VF"
017100             MOVE MCHT-DEPT       TO SVARDEPT-DEPT-400-VAR
017200         ELSE
017300         IF MCHT-DEPT-TYPE = "VO"
017400             MOVE MCHT-DEPT       TO SVARDEPT-DEPT-OTHER-VAR
017500         ELSE
017600             NEXT SENTENCE
017700     ELSE
017800         IF END-OF-FILE
017900             NEXT SENTENCE
018000         ELSE
018100             MOVE "GET MCHT-DEPT * 600-LVD" TO BU-DISPLAY-MSG
018200             GO TO 2-BLOWUP.
018300
018400     IF SVARDEPT-DEPT-102-VAR  NOT = SPACES AND
018500        SVARDEPT-DEPT-400-VAR  NOT = SPACES AND
018600        SVARDEPT-DEPT-OTHER-VAR  NOT = SPACES
018700         MOVE "Y"                 TO ALL-VAR-DEPTS-RETRIEVED-SW.

       9999-DBGET2-MCHT-ACCTS-DP-I.
           MOVE 0 TO COND-WORD.
           READ MCHT-ACCTS-DP-I NEXT INTO BUF-MCHTACCTS
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1" OR FILE-STATUS = "46"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-INIT-MCHT-ACCTS-DP-I.
           MOVE SPACES TO DEPT OF MCHT-ACCTS-DP-REC-I.
           START MCHT-ACCTS-DP-I KEY >= DEPT OF MCHT-ACCTS-DP-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-OPEN-STUFF.
           OPEN INPUT MCHT-ACCTS-DP-I      .

       9999-CLOSE-STUFF.
           CLOSE      MCHT-ACCTS-DP-I      .

