000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    SVENINQS.
000400 AUTHOR.        BARBARA WINTER.
000500 DATE-WRITTEN.  MARCH 8, l986.
000600*INSTALLATION.  GOODYEAR TIRE AND RUBBER CO.
000700
000800*REMARKS.
000900*D VENDOR INQUIRY SCREEN PROGRAM - REQUESTS VENDOR/CORPORATE CODE.
      *C   5/03/95.   WILL MCINTYRE    REQUEST 95-007
      *C     ADDED CALL TO TALTVENK TO ALLOW USER TO ENTER AN
      *C     ALTERNATE KEY, AND HAVE THE LINKED VENDOR CODE
      *C     SUBSTITUTED IN THE ALTERNATE KEY'S PLACE.
      *C
      *C   5/03/95
      *C     CHANGED REFERENCES FOR COPYCSIS/COPYMMIS TO COPYLIB.
      *C
      *C   17JUL1997   DAVE PLUM
      *C     REVISED TO PROVIDE FOR THE POSSIBILITY THAT FIELD
      *C     VEN-DISCOUNT-PERCENT MAY CONTAIN NON-NUMERIC DATA.
      *C     A DATA DECIMAL ERROR OCCURRED IN TYLER ON 16JUL1997 WHEN
      *C     THIS FIELD CONTAINED SPACES.
      *C
      *C   13JAN1999   J E COFFMAN
      *C     REVISED CODE TO HANDLE THE POSSIBILITY THAT THE
      *C     VEN-SURCHARGE FIELD MIGHT CONTAIN SPACES AS IT DID
      *C     AT THE PHILIPPINES.
      *C
      *C   20APR2000  DAVE PLUM
      *C     MADE FURTHER CHANGES TO HANDLE THE SITUATION WHERE
      *C     THE VEN-SURCHARGE FIELD CONTAINS SPACES AS IT DID IN
      *C     FAYETTEVILLE ON 18APR2000.
      *C
002200 ENVIRONMENT DIVISION.
002300 CONFIGURATION SECTION.
002400 SOURCE-COMPUTER.    HP-3000.
002500 OBJECT-COMPUTER.    HP-3000.
       SPECIAL-NAMES.  I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
002600 INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZVENINQ-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS DYNAMIC
                  RELATIVE KEY IS RELATIVE-RECNO
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

            SELECT DVENDOR
              ASSIGN TO DATABASE-MCFLCS0701
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.

            SELECT DVENDITM
              ASSIGN TO DATABASE-MCFLCS0801
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.

            SELECT DVENDITM2
              ASSIGN TO DATABASE-MCFLCS0802
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.

            SELECT MSTORERM
              ASSIGN TO DATABASE-MCFLCS0201
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
              FILE STATUS IS FILE-STATUS.

            SELECT DDESC
              ASSIGN TO DATABASE-MCFLCS1401
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
003600 FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC          PIC X(2000).
003700
       FD  DVENDOR
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-REC.
           COPY DDS-MCRPCS0700  OF MCFLCS0701.
003700
       FD  DVENDITM
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM-REC.
           COPY DDS-MCRPCS0800  OF MCFLCS0801.
003700
       FD  DVENDITM2
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM-REC2.
           COPY DDS-MCRPCS0800  OF MCFLCS0802.
003700
       FD  MSTORERM
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.
003700
       FD  DDESC
           LABEL RECORDS ARE STANDARD.
       01  DDESC-REC.
           COPY DDS-MCRPCS1400  OF MCFLCS1401.

003300 WORKING-STORAGE SECTION.
003400************************************************************
003500*            W O R K I N G   S T O R A G E                 *
003600************************************************************
       77  RET-CODE-TALTVENK      PIC X(02)  VALUE "00".
       77  BASE-TALTVENK          PIC X(20).
       77  ALT-KEY-ARG            PIC X(10).
       77  ALT-VEND-CODE          PIC X(10).
       01  FILE-STATUS.
           05  FILE-STATUS-1      PIC X.
           05  FILE-STATUS-2      PIC X.
       01  RELATIVE-RECNO         PIC 9(9).

      *------ WS CONTROL AREA
       01  MAJOR-MINOR                 PIC XXXX.
       01  WS-CONTROL.
           02  FUNCTION-NUM            PIC XX.
                   88  EXIT-KEY-F8-USED                     VALUE "08". LVW000LS
                   88  REFRESH-KEY-F4-USED                  VALUE "04". LVW000LS
                   88  ENTER-KEY-USED                       VALUE "00". LVW000LS
                   88  F1-KEY-USED                          VALUE "01". LVW000LS
                   88  F2-KEY-USED                          VALUE "02". LVW000LS
                   88  F3-KEY-USED                          VALUE "03". LVW000LS
                   88  F4-KEY-USED                          VALUE "04". LVW000LS
                   88  F5-KEY-USED                          VALUE "05". LVW000LS
                   88  F6-KEY-USED                          VALUE "06". LVW000LS
                   88  F7-KEY-USED                          VALUE "07". LVW000LS
                   88  F8-KEY-USED                          VALUE "08". LVW000LS
           02 FUN-KEY REDEFINES FUNCTION-NUM PIC XX.
           02 TERMINAL-ID PIC X(10).
           02 FORMAT-NAME PIC X(10).

       01  DISPLAY-STATUS              PIC X(2).

       01  SRF-INDICATORS.
           05  IND OCCURS 99 TIMES   PIC 1 INDICATOR 01.

       COPY IOFEEDBACK OF COPYLIB.
010600
011500 01  TABLE-CONSTRAINTS.
011600     05  NUM-CODES-PER-SCREEN      PIC 9(2) VALUE 10.
011700     05  LINES-DESC-PER-CODE       PIC 9(1) VALUE 1.

       01  END-FLAG                 PIC X        VALUE SPACE.
       01  FIRST-TIME-FLAG          PIC X.
003000 01  DELETE-FLAG              PIC X        VALUE "N".
003100 01  ITEM-COUNT               PIC 99       COMP VALUE ZERO.
003200 01  SAVE-KEY                 PIC S9(4)    COMP VALUE ZERO.
003300 01  WORK-PRICE.
003400     05  WORK-PRICE-WHOLE     PIC 9(11)    VALUE ZEROES.
003500     05  WORK-PRICE-DEC       PIC 9(4)     VALUE ZEROES.
003600
003700 01  SAVE-LAST-VENDOR         PIC X(10)    VALUE SPACES.
003800
003900*---------- VSETERROR AND VPUTWINDOW
004000 01  MESSAGE-BUFFER           PIC X(76)    VALUE SPACES.
004100 01  MESSAGE-BUFFER-RD REDEFINES MESSAGE-BUFFER.
004200     05  MSG-BUFFER           PIC X(68).
004300     05  MSG-VALUE            PIC X(8).
004400 01  MESSAGE-BUFLEN           PIC S9(4) VALUE 76  COMP-4.
004500 01  MESSAGE-ACTLEN           PIC S9(4) VALUE 0   COMP-4.
004600 01  FIELD-NUMBER             PIC S9(4) VALUE 1   COMP-4.
004700
004800*---------- VPRINTFORM
004900 01  SCREEN-PRINT-PARMS.
005000     05  PRINT-CTL            PIC S9(4)    VALUE 1 COMP.
005100     05  PAGE-CTL             PIC S9(4)    VALUE 49    COMP.
005200     05  SPOOL-FIL-OPEN-SW    PIC X        VALUE "Y".
005300 01  RETURN-STATUS            PIC X        VALUE SPACE.
005500
005600 COPY TDATECHK OF COPYLIB.
005700 COPY STRMJOB  OF COPYLIB.
       COPY CATREAD  OF COPYLIB.
006500*---------- TBLOWUP (PRINTS ERRORS TO AN ERROR FILE "BLOWUP.PUB" +)
006600*---------- (ABORTS PROGRAM.  RUN XBLPRT.OBJECT TO READ ERRORS.)
006700 01  BU-DISPLAY-MSG           PIC X(60)    VALUE SPACES.
006800 01  BU-PGM-NAME              PIC X(8)     VALUE "SVENINQS".
006900 01  BU-DISPLAY-AREA          PIC X(110)   VALUE ALL "0".
007000 01  BU-DISPLAY-FLDS REDEFINES BU-DISPLAY-AREA.
007100     05  BU-DISPLAY-LINE OCCURS 5 TIMES.
007200         10  BU-DISPLAY-FLD   PIC X(14).
007300         10  BU-DISPLAY-FLD9  PIC S9(8).
007400 01  KSAM-STATUS-AREA         PIC X(2)     VALUE "00".
007500
007600 01  TERMFILENAME             PIC X(11)    VALUE "TERM;".
007700
007800 01  FORM-NAMES.
007900     05  VENBYSC              PIC X(7)     VALUE "VENBYSC".
008000     05  VENBYSC2             PIC X(8)     VALUE "VENBYSC2".
008100     05  VENBYSC3             PIC X(8)     VALUE "VENBYSC3".
008200     05  VENBYSC4             PIC X(8)     VALUE "VENBYSC4".
008300     05  VENBYSC5             PIC X(8)     VALUE "VENBYSC5".
008400     05  VENBYSC6             PIC X(8)     VALUE "VENBYSC6".
008500
008600 01  SCREEN-BUFFER.
008700     05  VIEW-CORPCODE        PIC X(7)     VALUE SPACES.
008800     05  VIEW-VENDOR          PIC X(10)    VALUE SPACES.
           05  DE-COMMAND-LINE      PIC X(79).
           05  DE-MESSAGE-LINE      PIC X(79).
008900
009000 01  SCREEN2-CONTROL.
           05  SUBFILE-CONTROL-RECNO  PIC 9(4).
009100     05  V2-CORPCODE          PIC X(8)     VALUE SPACES.
009200     05  V2-DESC1             PIC X(50)    VALUE SPACES.
009300     05  V2-DESC2             PIC X(79)    VALUE SPACES.
009400
009500 01  SCREEN3-SUBFILE.
009600     05  V3-L                 PIC X        VALUE SPACE.
009700     05  V3-P                 PIC X        VALUE SPACE.
009800     05  V3-VENCODE           PIC X(10)    VALUE SPACES.
009900     05  V3-PRICE             PIC ZZZZZZZZZZZ.9999  VALUE ZEROES.
010000     05  V3-UM                PIC X(2)     VALUE SPACES.
010100     05  V3-EXP-DATE          PIC X(8)     VALUE SPACES.
010200     05  V3-LT1               PIC ZZZ9     VALUE ZEROES.
010300     05  V3-LT2               PIC ZZZ9     VALUE ZEROES.
010400     05  V3-LT3               PIC ZZZ9     VALUE ZEROES.
010500     05  V3-LT4               PIC ZZZ9     VALUE ZEROES.
010600     05  V3-TERMS             PIC X(2)     VALUE SPACES.
010700     05  V3-MINORD            PIC ZZZZ9    VALUE ZEROES.
010800     05  V3-VENNAME           PIC X(44)    VALUE SPACES.
010900     05  V3-SURCHARGE-LIT     PIC X(10)    VALUE SPACES.
011000     05  V3-SURCHARGE         PIC Z(11).9(4) VALUE ZERO.
011100     05  V3-ADDR1             PIC X(44)    VALUE SPACES.
011200     05  V3-ADDR2             PIC X(44)    VALUE SPACES.
011300     05  V3-DISCOUNT-LIT      PIC X(11)    VALUE SPACES.
011400     05  V3-DISCOUNT          PIC Z(2).9(4)  VALUE ZERO.
011500     05  V3-ADDR3             PIC X(44)    VALUE SPACES.
011600     05  V3-CONTACT-LIT       PIC X(8)     VALUE SPACES.
011700     05  V3-CONTACT           PIC X(34)    VALUE SPACES.
011800     05  V3-PHONE-LIT         PIC X(8)     VALUE SPACES.
011900     05  SCR-PHONE.
012000             10  SCR-PH-AREA    PIC X(3)     VALUE SPACES.
012100             10  SCR-PH-DASH1   PIC X        VALUE SPACES.
012200             10  SCR-PH-FIRST3  PIC X(3)     VALUE SPACES.
012300             10  SCR-PH-DASH2   PIC X        VALUE SPACES.
012400             10  SCR-PH-LAST4   PIC X(4)     VALUE SPACES.
012500     05  SCR-PHONE2 REDEFINES SCR-PHONE.
012600             10  SCR-PH2-FIRST3     PIC X(3).
012700             10  SCR-PH2-DASH1  PIC X(1).
012800             10  SCR-PH2-LAST4  PIC X(4).
012900             10  FILLER         PIC X(4).
013000     05  V3-NOTE-LIT          PIC X(8)     VALUE SPACES.
013100     05  V3-NOTE1             PIC X(38)    VALUE SPACES.
013200     05  V3-NOTE2             PIC X(38)    VALUE SPACES.
013300     05  V3-PRICE-BREAKS-LIT  PIC X(13)    VALUE SPACES.
013400     05  V3-LOW-QTY-1         PIC Z(12)    VALUE ZEROS.
013500     05  V3-HIGH-QTY-1        PIC Z(12)    VALUE ZEROS.
013600     05  V3-PB-UM-1           PIC X(2)     VALUE SPACES.
013700     05  V3-WORK-PRICE-1      PIC Z(11).Z(4) VALUE ZEROS.
013800     05  V3-LOW-LIT           PIC X(3)     VALUE SPACES.
013900     05  V3-LOW-QTY-2         PIC Z(12)    VALUE ZEROS.
014000     05  V3-HIGH-LIT          PIC X(4)     VALUE ZEROS.
014100     05  V3-HIGH-QTY-2        PIC Z(12)    VALUE ZEROS.
014200     05  V3-PB-UM-2           PIC X(2)     VALUE SPACES.
014300     05  V3-PRICE-LIT         PIC X(5)     VALUE ZEROS.
014400     05  V3-WORK-PRICE-2      PIC Z(11).Z(4) VALUE ZEROS.
014500     05  V3-LOW-QTY-3         PIC Z(12)    VALUE ZEROS.
014600     05  V3-HIGH-QTY-3        PIC Z(12)    VALUE ZEROS.
014700     05  V3-PB-UM-3           PIC X(2)     VALUE SPACES.
014800     05  V3-WORK-PRICE-3      PIC Z(11).Z(4) VALUE ZEROS.
014900
015000 01  SAVE-BUFFER.
015100     05  SV-L                 PIC X        VALUE SPACE.
015200     05  SV-P                 PIC X        VALUE SPACE.
015300     05  SV-VENCODE           PIC X(10)    VALUE SPACES.
015400     05  SV-PRICE             PIC ZZZZZZZZZZZ.9999 VALUE ZEROES.
015500     05  SV-UM                PIC X(2)     VALUE SPACES.
015600     05  SV-EXP-DATE          PIC X(8)     VALUE SPACES.
015700     05  SV-LT1               PIC ZZZ9     VALUE ZEROES.
015800     05  SV-LT2               PIC ZZZ9     VALUE ZEROES.
015900     05  SV-LT3               PIC ZZZ9     VALUE ZEROES.
016000     05  SV-LT4               PIC ZZZ9     VALUE ZEROES.
016100     05  SV-TERMS             PIC X(2)     VALUE SPACES.
016200     05  SV-MINORD            PIC ZZZZ9    VALUE ZEROES.
016300     05  SV-VENNAME           PIC X(44)    VALUE SPACES.
016400     05  SV-SURCHARGE-LIT     PIC X(10)    VALUE SPACES.
016500     05  SV-SURCHARGE         PIC Z(11).9(4) VALUE ZERO.
016600     05  SV-ADDR1             PIC X(44)    VALUE SPACES.
016700     05  SV-ADDR2             PIC X(44)    VALUE SPACES.
016800     05  SV-DISCOUNT-LIT      PIC X(11)    VALUE SPACES.
016900     05  SV-DISCOUNT          PIC Z(2).9(4)  VALUE ZERO.
017000     05  SV-ADDR3             PIC X(44)    VALUE SPACES.
017100     05  SV-CONTACT-LIT       PIC X(8)     VALUE SPACES.
017200     05  SV-CONTACT           PIC X(34)    VALUE SPACES.
017300     05  SV-PHONE-LIT         PIC X(8)     VALUE SPACES.
017400     05  SAV-PHONE.
017500             10  SAV-PH-AREA    PIC X(3)     VALUE SPACES.
017600             10  SAV-PH-DASH1   PIC X        VALUE SPACES.
017700             10  SAV-PH-FIRST3  PIC X(3)     VALUE SPACES.
017800             10  SAV-PH-DASH2   PIC X        VALUE SPACES.
017900             10  SAV-PH-LAST4   PIC X(4)     VALUE SPACES.
018000     05  SAV-PHONE2 REDEFINES SAV-PHONE.
018100             10  SAV-PH2-FIRST3     PIC X(3).
018200             10  SAV-PH2-DASH1  PIC X(1).
018300             10  SAV-PH2-LAST4  PIC X(4).
018400             10  FILLER         PIC X(4).
018500     05  SV-NOTE-LIT          PIC X(8)     VALUE SPACES.
018600     05  SV-NOTE1             PIC X(38)    VALUE SPACES.
018700     05  SV-NOTE2             PIC X(38)    VALUE SPACES.
018800     05  SV-PRICE-BREAKS-LIT  PIC X(13)    VALUE SPACES.
018900     05  SV-LOW-QTY-1         PIC Z(12)    VALUE ZEROS.
019000     05  SV-HIGH-QTY-1        PIC Z(12)    VALUE ZEROS.
019100     05  SV-PB-UM-1           PIC X(2)     VALUE SPACES.
019200     05  SV-WORK-PRICE-1      PIC Z(11).Z(4) VALUE ZEROS.
019300     05  SV-LOW-LIT           PIC X(3)     VALUE SPACES.
019400     05  SV-LOW-QTY-2         PIC Z(12)    VALUE ZEROS.
019500     05  SV-HIGH-LIT          PIC X(4)     VALUE SPACES.
019600     05  SV-HIGH-QTY-2        PIC Z(12)    VALUE ZEROS.
019700     05  SV-PB-UM-2           PIC X(2)     VALUE SPACES.
019800     05  SV-PRICE-LIT         PIC X(5)     VALUE SPACES.
019900     05  SV-WORK-PRICE-2      PIC Z(11).Z(4) VALUE ZEROS.
020000     05  SV-LOW-QTY-3         PIC Z(12)    VALUE ZEROS.
020100     05  SV-HIGH-QTY-3        PIC Z(12)    VALUE ZEROS.
020200     05  SV-PB-UM-3           PIC X(2)     VALUE SPACES.
020300     05  SV-WORK-PRICE-3      PIC Z(11).Z(4) VALUE ZEROS.
020400
020500 01  SCREEN4-CONTROL.
           05  V4-CONTROL-RECNO     PIC 9(4).
020600     05  V4-VENDORCODE        PIC X(10)    VALUE SPACES.
020700     05  V4-VENNAME           PIC X(44)    VALUE SPACES.
020800     05  V4-CONTACT-LIT       PIC X(8)     VALUE SPACES.
020900     05  V4-CONTACT           PIC X(34)    VALUE SPACES.
021000     05  V4-MINORD            PIC $$$$$9   VALUE ZEROES.
021100     05  V4-PHONE-LIT         PIC X(8)     VALUE SPACES.
021200     05  SC4-PHONE.
021300             10  SC4-PH-AREA    PIC X(3)     VALUE SPACES.
021400             10  SC4-PH-DASH1   PIC X        VALUE SPACES.
021500             10  SC4-PH-FIRST3  PIC X(3)     VALUE SPACES.
021600             10  SC4-PH-DASH2   PIC X        VALUE SPACES.
021700             10  SC4-PH-LAST4   PIC X(4)     VALUE SPACES.
021800     05  SC4-PHONE2 REDEFINES SC4-PHONE.
021900             10  SC4-PH2-FIRST3 PIC X(3).
022000             10  SC4-PH2-DASH1  PIC X(1).
022100             10  SC4-PH2-LAST4  PIC X(4).
022200             10  FILLER         PIC X(4).
022300
022400 01  SCREEN5-SUBFILE.
022500     05  V5-CORPCODE          PIC X(8)     VALUE SPACES.
022600     05  V5-PRICE             PIC ZZZZZZZZZZ9.9999 VALUE ZEROES.
022700     05  V5-UM                PIC X(2)     VALUE SPACES.
022800     05  V5-EXP-DATE          PIC X(8)     VALUE SPACES.
022900     05  V5-LT1               PIC ZZZ9     VALUE ZEROES.
023000     05  V5-LT2               PIC ZZZ9     VALUE ZEROES.
023100     05  V5-LT3               PIC ZZZ9     VALUE ZEROES.
023200     05  V5-LT4               PIC ZZZ9     VALUE ZEROES.
023300     05  V5-TERMS             PIC X(2)     VALUE SPACES.
023400     05  V5-FOB               PIC X(2)     VALUE SPACES.
023500     05  V5-DESC1             PIC X(79)    VALUE SPACES.
023600     05  V5-DESC2             PIC X(79)    VALUE SPACES.
023700     05  V5-BLANK-LINE        PIC X        VALUE SPACE.

023800***********************************************************************
023900**     D A T A B A S E     C O M M U N I C A T I O N     A R E A     **
024000***********************************************************************
024100
024200 01  STATUS-AREA.
024300     05  COND-WORD            PIC S9(4)    VALUE ZERO COMP-4.
024400         88  GOOD-CALL                            VALUE 0.
024500         88  END-OF-FILE                          VALUE 11.
024600         88  START-OF-CHAIN                       VALUE 14.
024700         88  END-OF-CHAIN                         VALUE 15.
024800         88  NO-ENTRY                             VALUE 17.
024900     05  DATA-LENGTH          PIC S9(4)  COMP-4.
025000     05  RCD-NO               PIC S9(9)  COMP-4.
025100     05  CHAIN-LENGTH         PIC S9(9)  COMP-4.
025200     05  BKWD-ADDR            PIC S9(9)  COMP-4.
025300     05  FWRD-ADDR            PIC S9(9)  COMP-4.
025400
025500 01  VENDOR-ARG               PIC X(10)    VALUE SPACES.
025600 01  CODE-ARG                 PIC X(8)     VALUE SPACES.

027600 COPY DVENDITM OF COPYLIB.
027700 COPY DVENDOR  OF COPYLIB.
027800 COPY MSTORERM OF COPYLIB.
027900 COPY DDESC    OF COPYLIB.

028000 LINKAGE SECTION.
028100 01  BASE                     PIC X(10).
028200 01  PASS-SPOOL               PIC S9(2) COMP.
028300 01  FORMFILE                 PIC X(26).

028400 COPY VCOMLINK OF COPYLIB.
028600 COPY LANGSUB  OF COPYLIB.
028700
028800**************************************************************************
028900**************************************************************************
029000*                            PROCEDURE DIVISION
029100*           CHECK IF CORPORATE OR VENDOR CODE WAS ENTERED.  VALIDATE
029200*           ENTRY FOR EXISTENCE.  IF CORPORATE CODE WAS ENTERED,
029300*           CHECK IF ANY VENDORS ARE TIED TO CODE AND IF SO, DISPLAY
029400*           VENDORS ONE AT A TIME.  IF VENDOR WAS ENTERED, CHECK IF
029500*           ANY CORPORATE CODES ARE TIED TO VENDOR AND IF SO, DISPLAY
029600*           CODES 10 AT A TIME.
029700**************************************************************************
029800**************************************************************************
029900 PROCEDURE DIVISION USING   BASE,
030000                            PASS-SPOOL,
030100                            FORMFILE,
030200                            VIEW-COMAREA,
030300                            LANGUAGE-PARMS.
030400
030500 00-MAIN.
           OPEN I-O DISPLAY-FILE.
           OPEN INPUT DVENDOR, DVENDITM, MSTORERM, DDESC.
           OPEN INPUT DVENDITM2.
       02-LOOP.
           MOVE 0 TO END-FLAG.
030600     PERFORM 100-GET-VENDOR-OR-CORPCODE THRU 199-EXIT.
030700     IF VIEW-LASTKEY = 3
030800        GO TO 09-EXIT.
030900
031000     IF VIEW-CORPCODE = SPACES
              PERFORM 830-CLEAR-SUBFILE1 THRU 839-EXIT
031100        PERFORM 300-BY-VENDOR THRU 399-EXIT
031200     ELSE
              PERFORM 820-CLEAR-SUBFILE2 THRU 829-EXIT
031300        PERFORM 200-BY-CORPCODE THRU 299-EXIT.
031400
031600     GO TO 02-LOOP.
031700
031800 09-EXIT.
           CLOSE DISPLAY-FILE, DVENDOR, DVENDITM, MSTORERM, DDESC.
           CLOSE DVENDITM2.
           GOBACK.
031900
032000**************************************************************************
032100*           VALIDATE VENDOR OR CORPORATE CODE AND GET DATA FOR           *
032200*           TOP SCREEN THAT FREEZES WHILE INDIVIDUAL ITEMS SCROLL        *
032300*           UNDERNEATH.                                                  *
032400**************************************************************************
032500 100-GET-VENDOR-OR-CORPCODE.
032600     MOVE VENBYSC TO VIEW-NFNAME.
           MOVE SPACES TO SCREEN-BUFFER.

034000 150-SHOW-FORM.
           MOVE SCREEN-BUFFER TO DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
              INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO SRF-INDICATORS.
           MOVE DISPLAY-REC TO SCREEN-BUFFER.

      *------ A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *------ IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.
035800
035900     IF VIEW-LASTKEY EQUAL 3
036000        GO TO 199-EXIT.
036100
036200     IF VIEW-LASTKEY EQUAL 1 OR
036300        VIEW-LASTKEY EQUAL 2 OR
036400        VIEW-LASTKEY EQUAL 8 OR
036500        VIEW-LASTKEY EQUAL 4 OR
036600        VIEW-LASTKEY EQUAL 7 OR
036700        VIEW-LASTKEY EQUAL 6
036800        PERFORM 940-VSETERROR THRU 949-EXIT
036900        GO TO 150-SHOW-FORM.
037000
           MOVE "Y" TO FIRST-TIME-FLAG.
039300*----------  DETERMINE IF VENDOR OR CORPORATE CODE
039400     IF VIEW-CORPCODE = SPACES
039500        GO TO 170-VALIDATE-VENDOR.
039600
039700*----------  VALIDATE CORPORATE CODE
           MOVE 0 TO COND-WORD.
           MOVE VIEW-CORPCODE TO CORPCDE OF MSTORERM-REC.
           READ  MSTORERM INTO BUF-MSTORERM
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
040000     IF NO-ENTRY
040100*** CODE DOES NOT EXIST
040200        MOVE 23 TO LANG-MSGNUM
040300        MOVE  3 TO LANG-SETNUM
040400        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 940-VSETERROR THRU 949-EXIT
040600        GO TO 150-SHOW-FORM.
040700     IF NOT GOOD-CALL
040800        MOVE "DBGET MSTORERM SVENINQS 160" TO BU-DISPLAY-MSG
040900        PERFORM 990-BLOWUP THRU 999-EXIT.
041000
041100     MOVE CORP-CODE                  TO V2-CORPCODE, CODE-ARG.
041200     MOVE STR-LAST-VENDOR            TO SAVE-LAST-VENDOR.
041300     IF STR-LAST-VENDOR = SPACES
041400        GO TO 165-GET-DESC.
041500
041600*----------  FIND AND SAVE LAST VENDOR DATA
           MOVE 0 TO COND-WORD.
           MOVE SPACES TO SAVE-BUFFER.
           MOVE SAVE-LAST-VENDOR TO VENCDE OF DVENDOR-REC.
           START DVENDOR KEY = VENCDE OF DVENDOR-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
041900     IF NO-ENTRY
042000        MOVE SPACES TO SAVE-LAST-VENDOR
042100        GO TO 165-GET-DESC.
042200     IF NOT GOOD-CALL
042300        MOVE "DBFIND DVENDOR 160 SVENINQS" TO BU-DISPLAY-MSG
042400        PERFORM 990-BLOWUP THRU 999-EXIT.
042500
042600 162-DVENDOR-LOOP.
           MOVE 0 TO COND-WORD.
           READ DVENDOR    NEXT INTO BUF-DVENDOR
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF VENCDE OF DVENDOR-REC NOT = SAVE-LAST-VENDOR
               MOVE 15 TO COND-WORD.
042900     IF END-OF-CHAIN
043000        GO TO 163-GET-ITEM.
043100     IF NOT GOOD-CALL
043500        MOVE "DBGET DVENDOR 162 SVENINQS" TO BU-DISPLAY-MSG
043600        PERFORM 990-BLOWUP THRU 999-EXIT.
043700
043800     IF VEN-ITM-NO = "00"
043900        MOVE VEN-ITM-DATA                      TO SV-VENNAME
044000     ELSE
044100        IF VEN-ITM-NO = "01"
044200            MOVE VEN-ITM-DATA                  TO SV-ADDR1
044300        ELSE
044400        IF VEN-ITM-NO = "02"
044500            MOVE VEN-ITM-DATA                  TO SV-ADDR2
044600        ELSE
044700        IF VEN-ITM-NO = "07"
044800            MOVE VEN-ITM-DATA                  TO SV-ADDR3
044900        ELSE
045000        IF VEN-ITM-NO = "09"
045100            MOVE VEN-CONTACT                   TO SV-CONTACT
045200            MOVE "CONTACT:"                    TO SV-CONTACT-LIT
045300            MOVE "PHONE:"                      TO SV-PHONE-LIT
045400                IF VEN-CONTACT-PHONE IS NUMERIC
045500                    MOVE VEN-PH-AREA           TO SAV-PH-AREA
045600                    MOVE VEN-PH-FIRST3         TO SAV-PH-FIRST3
045700                    MOVE VEN-PH-LAST4          TO SAV-PH-LAST4
045800                    MOVE "-"                   TO SAV-PH-DASH1
045900                                                      SAV-PH-DASH2
046000                ELSE
046600                IF VEN-PH2-TEST = SPACES
046700                AND VEN-CONTACT-PHONE NOT = SPACES
046800                    MOVE SPACES                TO SAV-PHONE2
046900                    MOVE VEN-PH2-FIRST3        TO SAV-PH2-FIRST3
047000                    MOVE VEN-PH2-LAST4         TO SAV-PH2-LAST4
047100                    MOVE "-"                   TO SAV-PH2-DASH1
047200                ELSE
047300                    MOVE SPACES                TO SAV-PHONE
047400                    MOVE VEN-CONTACT-PHONE     TO SAV-PHONE
047500        ELSE
047600        IF VEN-ITM-NO = "10"
047700            MOVE VEN-MIN-ORDER                 TO SV-MINORD
047800        ELSE
047900        IF VEN-ITM-NO = "12"
048000            MOVE VEN-FREE-NOTE-1               TO SV-NOTE1
048100            MOVE "NOTE:"                       TO SV-NOTE-LIT
048200        ELSE
048300            IF VEN-ITM-NO = "13"
048400                MOVE VEN-FREE-NOTE-2           TO SV-NOTE2.
048500
048600     GO TO 162-DVENDOR-LOOP.

048700 163-GET-ITEM.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DVENDITM-REC2.
           START DVENDITM2 KEY = CORPCDE OF DVENDITM-REC2
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
049000     IF NO-ENTRY
049100        GO TO 165-GET-DESC.
049200     IF NOT GOOD-CALL
049300        MOVE "DBFIND DVENDITM 163 SVENINQS" TO BU-DISPLAY-MSG
049400        PERFORM 990-BLOWUP THRU 999-EXIT.
049500
049600 164-FIND-RIGHT-VENDOR.
           MOVE 0 TO COND-WORD.
           READ DVENDITM2 NEXT INTO BUF-DVENDITM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF CORPCDE OF DVENDITM-REC2 NOT = CODE-ARG
               MOVE 15 TO COND-WORD.
049900     IF END-OF-CHAIN
050000        GO TO 165-GET-DESC.
050100     IF NOT GOOD-CALL
050400        MOVE "DBGET DVENDITM 164 SVENINQS" TO BU-DISPLAY-MSG
050500        PERFORM 990-BLOWUP THRU 999-EXIT.
050600
050700     IF VEN-ITM-VENCODE NOT = SAVE-LAST-VENDOR
050800        GO TO 164-FIND-RIGHT-VENDOR.
050900     MOVE VEN-ITM-VENCODE                  TO SV-VENCODE.
051000     IF VEN-OF-RCD = "S"
051100        MOVE "P"                          TO SV-P.
051200     IF VEN-ITM-VENCODE = SAVE-LAST-VENDOR
051300        MOVE "L"                          TO SV-L.
051400     MOVE VEN-ITM-PRICE                    TO SV-PRICE.
051500     MOVE VEN-ITM-PRICE-UM                 TO SV-UM.
051600     MOVE 4                                TO DATE-MODE.
051700     MOVE VEN-ITM-PRICE-DATE               TO DATE-VALIDATE-IN.
051800     CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
051900     MOVE DATE-SLASH-OUT                   TO SV-EXP-DATE.
052000
052100     MOVE VEN-ITM-LT1                      TO SV-LT1.
052200     MOVE VEN-ITM-LT2                      TO SV-LT2.
052300     MOVE VEN-ITM-LT3                      TO SV-LT3.
052400     MOVE VEN-EST-LT                       TO SV-LT4.
052500     MOVE VEN-TERMS                        TO SV-TERMS.
052600     MOVE "SURCHARGE:"                     TO SV-SURCHARGE-LIT.

052700*****MOVE VEN-SURCHARGE                    TO SV-SURCHARGE.
           IF VEN-SURCHARGE-X IS NUMERIC
               MOVE VEN-SURCHARGE                TO SV-SURCHARGE
           ELSE
               MOVE ZEROES                       TO VEN-SURCHARGE
               MOVE ZEROES                       TO SV-SURCHARGE.

052800     MOVE "DISCOUNT %:"                    TO SV-DISCOUNT-LIT.

052900*****MOVE VEN-DISCOUNT-PERCENT             TO SV-DISCOUNT.
           IF VEN-DSCT IS NUMERIC
               MOVE VEN-DISCOUNT-PERCENT         TO SV-DISCOUNT
           ELSE
               MOVE ZEROS                        TO SV-DISCOUNT.

053000     MOVE "PRICE BREAKS:"                TO SV-PRICE-BREAKS-LIT.
053100     IF VEN-LOW-QTY (1) > ZERO
053200         MOVE "LOW"                       TO SV-LOW-LIT
053300         MOVE "HIGH"                      TO SV-HIGH-LIT
053400         MOVE "PRICE"                     TO SV-PRICE-LIT.
053500     MOVE VEN-LOW-QTY (1)                  TO SV-LOW-QTY-1.
053600     MOVE VEN-LOW-QTY (2)                  TO SV-LOW-QTY-2.
053700     MOVE VEN-LOW-QTY (3)                  TO SV-LOW-QTY-3.
053800     MOVE VEN-HIGH-QTY (1)                 TO SV-HIGH-QTY-1.
053900     MOVE VEN-HIGH-QTY (2)                 TO SV-HIGH-QTY-2.
054000     MOVE VEN-HIGH-QTY (3)                 TO SV-HIGH-QTY-3.
054100     MOVE VEN-QTY-UM (1)                   TO SV-PB-UM-1.
054200     MOVE VEN-QTY-UM (2)                   TO SV-PB-UM-2.
054300     MOVE VEN-QTY-UM (3)                   TO SV-PB-UM-3.
054400     MOVE VEN-WORK-PRICE (1)               TO SV-WORK-PRICE-1.
054500     MOVE VEN-WORK-PRICE (2)               TO SV-WORK-PRICE-2.
054600     MOVE VEN-WORK-PRICE (3)               TO SV-WORK-PRICE-3.
054700
054800 165-GET-DESC.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DDESC-REC.
           START DDESC KEY = CORPCDE OF DDESC-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
055100     IF NO-ENTRY OR CHAIN-LENGTH = 0
055200        MOVE 14 TO LANG-SETNUM
055300        MOVE  3 TO LANG-MSGNUM
055400        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
055500        MOVE MESSAGE-BUFFER TO V2-DESC1
055600        GO TO 167-SHOW-CODE.
055700     IF NOT GOOD-CALL
055800        MOVE "DBFIND DDESC 160 SVENINQS" TO BU-DISPLAY-MSG
055900        PERFORM 990-BLOWUP THRU 999-EXIT.
           MOVE 0 TO COND-WORD.
           READ DDESC NEXT INTO BUF-DDESC
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF CORPCDE OF DDESC-REC NOT = CODE-ARG
               MOVE 15 TO COND-WORD.
056200     IF NOT GOOD-CALL
056300        MOVE "DBGET1 DDESC 160 SVENINQS" TO BU-DISPLAY-MSG
056400        PERFORM 990-BLOWUP THRU 999-EXIT.
056500     MOVE DESC-DATA TO V2-DESC1
           READ DDESC NEXT INTO BUF-DDESC
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF CORPCDE OF DDESC-REC NOT = CODE-ARG
               MOVE 15 TO COND-WORD.
056800     IF END-OF-CHAIN
056900        GO TO 167-SHOW-CODE.
057000     IF NOT GOOD-CALL
057100        MOVE "DBGET2 DDESC 160 SVENINQS" TO BU-DISPLAY-MSG
057200        PERFORM 990-BLOWUP THRU 999-EXIT.
057300     MOVE DESC-DATA TO V2-DESC2.
057400
057500 167-SHOW-CODE.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DVENDITM-REC2.
           START DVENDITM2 KEY = CORPCDE OF DVENDITM-REC2
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
057800     IF NOT GOOD-CALL
057900        IF NO-ENTRY
058000****  CODE NOT LINKED TO A VENDOR
058100            MOVE 65 TO LANG-MSGNUM
058200            MOVE  3 TO LANG-SETNUM
058300            PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
058400            PERFORM 940-VSETERROR THRU 949-EXIT
058500            GO TO 150-SHOW-FORM
058600        ELSE
058700            MOVE "DBFIND SVENINQS 167" TO BU-DISPLAY-MSG
058800            PERFORM 990-BLOWUP THRU 999-EXIT.
058900
060500     GO TO 199-EXIT.
060600
060700 170-VALIDATE-VENDOR.
060800     MOVE VIEW-VENDOR TO VENDOR-ARG.
      *-----  CALL ALT KEY SUB-PGM TO GET ALT KEY IF ONE EXISTS
           MOVE VENDOR-ARG TO ALT-KEY-ARG.
           CALL "TALTVENK" USING RET-CODE-TALTVENK,
                                 BASE-TALTVENK,
                                 STATUS-AREA,
                                 ALT-KEY-ARG,
                                 ALT-VEND-CODE.
           IF RET-CODE-TALTVENK NOT EQUAL "00"
              MOVE "TALTVENK ERROR 170-VV" TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.
           MOVE ALT-VEND-CODE   TO VENDOR-ARG VIEW-VENDOR.
           MOVE 0 TO COND-WORD.
           MOVE VENDOR-ARG TO VENCDE OF DVENDOR-REC.
           START DVENDOR KEY = VENCDE OF DVENDOR-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
061100     IF NO-ENTRY
061200*** VENDOR NOT ON FILE
061300        MOVE 14 TO LANG-MSGNUM
061400        MOVE 22 TO LANG-SETNUM
061500        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
061600        PERFORM 940-VSETERROR THRU 949-EXIT
061700        GO TO 150-SHOW-FORM.
061800     IF NOT GOOD-CALL
061900        MOVE "DBFIND DVENDOR SVENINQS 170" TO BU-DISPLAY-MSG
062000        PERFORM 990-BLOWUP THRU 999-EXIT.
062100
           MOVE VENDOR-ARG TO VENCDE OF DVENDITM-REC.
           START DVENDITM KEY = VENCDE OF DVENDITM-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
062400     IF NOT GOOD-CALL
062500****  VENDOR NOT LINKED TO ANY CODES
062600        MOVE 22 TO LANG-SETNUM
062700        MOVE  4 TO LANG-MSGNUM
062800        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
062900        PERFORM 940-VSETERROR THRU 949-EXIT
063000        GO TO 150-SHOW-FORM.
063100
063200     MOVE VENDOR-ARG TO V4-VENDORCODE.
063300
       175-VENDOR-LOOP.
063400*----------  MOVE VENDOR DATA TO SCREEN
           MOVE 0 TO COND-WORD.
           READ DVENDOR  NEXT INTO BUF-DVENDOR
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF VENCDE OF DVENDOR-REC NOT = VENDOR-ARG
               MOVE 15 TO COND-WORD.
063800     IF END-OF-CHAIN
063900        GO TO 199-EXIT.
064000     IF NOT GOOD-CALL
064100        MOVE "DBGET DVENDOR 175 SVENINQS" TO BU-DISPLAY-MSG
064200        PERFORM 990-BLOWUP THRU 999-EXIT.
064300
064400     IF VEN-ITM-NO = "00"
064500        MOVE VEN-ITM-DATA                          TO V4-VENNAME
064600     ELSE
064700        IF VEN-ITM-NO = "09"
064800            MOVE VEN-CONTACT               TO V4-CONTACT
064900            MOVE "CONTACT:"                TO V4-CONTACT-LIT
065000            MOVE "PHONE:"                  TO V4-PHONE-LIT
065100                IF VEN-CONTACT-PHONE IS NUMERIC
065200                    MOVE VEN-PH-AREA       TO SC4-PH-AREA
065300                    MOVE VEN-PH-FIRST3     TO SC4-PH-FIRST3
065400                    MOVE VEN-PH-LAST4      TO SC4-PH-LAST4
065500                    MOVE "-"               TO SC4-PH-DASH1
065600                                                      SC4-PH-DASH2
065700                ELSE
065800                IF VEN-PH2-TEST = SPACES
065900                AND VEN-CONTACT-PHONE NOT = SPACES
066000                    MOVE SPACES            TO SC4-PHONE2
066100                    MOVE VEN-PH2-FIRST3    TO SC4-PH2-FIRST3
066200                    MOVE VEN-PH2-LAST4     TO SC4-PH2-LAST4
066300                    MOVE "-"               TO SC4-PH2-DASH1
066400                ELSE
066500                    MOVE SPACES            TO SC4-PHONE
066600                    MOVE VEN-CONTACT-PHONE TO SC4-PHONE
066700        ELSE
066800        IF VEN-ITM-NO = "10"
066900            MOVE VEN-MIN-ORDER             TO V4-MINORD.
067000
067100     GO TO 175-VENDOR-LOOP.
067200
069000 199-EXIT.     EXIT.
069100
069200**********************************************************************
069300*        DISPLAY VENDOR INQUIRY BY CORPORATE CODE.  GET INDIVIDUAL   *
069400*        VENDORS TIED TO A CORPORATE CODE AND DISPLAY ONE AT A TIME. *
069500**********************************************************************
069600 200-BY-CORPCODE.
      *----------  DISPLAY THE 'LAST BUSINESS VENDOR' FIRST
           IF FIRST-TIME-FLAG = "Y"
              MOVE "N" TO FIRST-TIME-FLAG
              IF SAVE-LAST-VENDOR NOT = SPACES
                 MOVE 1 TO RELATIVE-RECNO
                 MOVE SAVE-BUFFER TO SCREEN3-SUBFILE
                 GO TO 246-NO-MORE.

070600*----------  GET EACH VENDOR TIED TO THE ENTERED CORPORATE CODE
           IF END-FLAG = 1
              MOVE B"1" TO IND(73)
              GO TO 253-CONTROL-SCREEN
           ELSE
              MOVE B"0" TO IND(73).
           MOVE 0 TO COND-WORD.
           READ DVENDITM2 NEXT INTO BUF-DVENDITM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF CORPCDE OF DVENDITM-REC2 NOT = CODE-ARG
               MOVE 15 TO COND-WORD.
071000     IF NOT GOOD-CALL
               MOVE 1 TO END-FLAG
               GO TO 246-NO-MORE.
072400
072500 225-MOVE-DATA.
           MOVE SPACES                       TO SCREEN3-SUBFILE.
           ADD  1                            TO RELATIVE-RECNO.
072700     MOVE VEN-ITM-VENCODE              TO V3-VENCODE.
072800     IF VEN-OF-RCD = "S"
072900        MOVE "P"                      TO V3-P.
073000     IF VEN-ITM-VENCODE = SAVE-LAST-VENDOR
073100        MOVE "L"                      TO V3-L.
073200     MOVE VEN-ITM-PRICE                TO V3-PRICE.
073300     MOVE VEN-ITM-PRICE-UM             TO V3-UM.
073400     MOVE 4                            TO DATE-MODE.
073500     MOVE VEN-ITM-PRICE-DATE           TO DATE-VALIDATE-IN.
073600     CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
073700     MOVE DATE-SLASH-OUT               TO V3-EXP-DATE.
073800
073900     MOVE VEN-ITM-LT1                  TO V3-LT1.
074000     MOVE VEN-ITM-LT2                  TO V3-LT2.
074100     MOVE VEN-ITM-LT3                  TO V3-LT3.
074200     MOVE VEN-EST-LT                   TO V3-LT4.
074300     MOVE VEN-TERMS                    TO V3-TERMS.
074400     MOVE "SURCHARGE:"                 TO V3-SURCHARGE-LIT.
           IF VEN-SURCHARGE-X = "        "
               MOVE ZEROES                   TO VEN-SURCHARGE.
074500     MOVE VEN-SURCHARGE                TO V3-SURCHARGE.
074600     MOVE "DISCOUNT %:"                TO V3-DISCOUNT-LIT.

074700*****MOVE VEN-DISCOUNT-PERCENT         TO V3-DISCOUNT. *REPLACED*
           IF VEN-DSCT IS NUMERIC
               MOVE VEN-DISCOUNT-PERCENT     TO V3-DISCOUNT
           ELSE
               MOVE ZEROS                    TO V3-DISCOUNT.

074800     MOVE "PRICE BREAKS:"              TO V3-PRICE-BREAKS-LIT.
074900     IF VEN-LOW-QTY (1) > ZERO
075000         MOVE "LOW"                   TO V3-LOW-LIT
075100         MOVE "HIGH"                  TO V3-HIGH-LIT
075200         MOVE "PRICE"                 TO V3-PRICE-LIT.
075300     MOVE VEN-LOW-QTY (1)              TO V3-LOW-QTY-1.
075400     MOVE VEN-LOW-QTY (2)              TO V3-LOW-QTY-2.
075500     MOVE VEN-LOW-QTY (3)              TO V3-LOW-QTY-3.
075600     MOVE VEN-HIGH-QTY (1)             TO V3-HIGH-QTY-1.
075700     MOVE VEN-HIGH-QTY (2)             TO V3-HIGH-QTY-2.
075800     MOVE VEN-HIGH-QTY (3)             TO V3-HIGH-QTY-3.
075900     MOVE VEN-QTY-UM (1)               TO V3-PB-UM-1.
076000     MOVE VEN-QTY-UM (2)               TO V3-PB-UM-2.
076100     MOVE VEN-QTY-UM (3)               TO V3-PB-UM-3.
076200     MOVE VEN-WORK-PRICE (1)           TO V3-WORK-PRICE-1.
076300     MOVE VEN-WORK-PRICE (2)           TO V3-WORK-PRICE-2.
076400     MOVE VEN-WORK-PRICE (3)           TO V3-WORK-PRICE-3.
076500
076600 240-GET-VENDOR.
           MOVE 0 TO COND-WORD.
           MOVE VEN-ITM-VENCODE TO VENCDE OF DVENDOR-REC.
           START DVENDOR KEY = VENCDE OF DVENDOR-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
076900     IF NO-ENTRY
077000*****  VENDOR NOT ON FILE
077100     MOVE 14 TO LANG-MSGNUM
077200     MOVE 22 TO LANG-SETNUM
077300        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
077400        PERFORM 940-VSETERROR THRU 949-EXIT
077500        GO TO 246-NO-MORE.
077600     IF NOT GOOD-CALL
077700        MOVE "DBFINDDVENDOR 240 SVENINQS" TO BU-DISPLAY-MSG
077800        PERFORM 990-BLOWUP THRU 999-EXIT.
077900
078000 245-VENDOR-LOOP.
           MOVE 0 TO COND-WORD.
           READ DVENDOR NEXT INTO BUF-DVENDOR
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF VENCDE OF DVENDOR-REC NOT = VEN-ITM-VENCODE
               MOVE 15 TO COND-WORD.
078300     IF END-OF-CHAIN
078400        GO TO 246-NO-MORE.
078500     IF NOT GOOD-CALL
078600        MOVE "DBGET DVENDOR 245 SVENINQ" TO BU-DISPLAY-MSG
078700        PERFORM 990-BLOWUP THRU 999-EXIT.
078800
078900     IF VEN-ITM-NO = "00"
079000        MOVE VEN-ITM-DATA TO V3-VENNAME
079100     ELSE
079200        IF VEN-ITM-NO = "01"
079300            MOVE VEN-ITM-DATA TO V3-ADDR1
079400        ELSE
079500        IF VEN-ITM-NO = "02"
079600            MOVE VEN-ITM-DATA TO V3-ADDR2
079700        ELSE
079800        IF VEN-ITM-NO = "07"
079900            MOVE VEN-ITM-DATA TO V3-ADDR3
080000        ELSE
080100        IF VEN-ITM-NO = "09"
080200            MOVE VEN-CONTACT TO V3-CONTACT
080300            MOVE "CONTACT:" TO V3-CONTACT-LIT
080400            MOVE "PHONE:" TO V3-PHONE-LIT
080500                IF VEN-CONTACT-PHONE IS NUMERIC
080600                    MOVE VEN-PH-AREA   TO SCR-PH-AREA
080700                    MOVE VEN-PH-FIRST3 TO SCR-PH-FIRST3
080800                    MOVE VEN-PH-LAST4  TO SCR-PH-LAST4
080900                    MOVE "-"           TO SCR-PH-DASH1
081000                                          SCR-PH-DASH2
081100                ELSE
081200                IF VEN-PH2-TEST = SPACES
081300                AND VEN-CONTACT-PHONE NOT = SPACES
081400                    MOVE SPACES TO SCR-PHONE2
081500                    MOVE VEN-PH2-FIRST3 TO SCR-PH2-FIRST3
081600                    MOVE VEN-PH2-LAST4  TO SCR-PH2-LAST4
081700                    MOVE "-"            TO SCR-PH2-DASH1
081800                ELSE
081900                    MOVE SPACES TO SCR-PHONE
082000                    MOVE VEN-CONTACT-PHONE TO SCR-PHONE
082100        ELSE
082200        IF VEN-ITM-NO = "10"
082300            MOVE VEN-MIN-ORDER TO V3-MINORD
082400        ELSE
082500        IF VEN-ITM-NO = "12"
082600            MOVE VEN-FREE-NOTE-1 TO V3-NOTE1
082700            MOVE "NOTE:"         TO V3-NOTE-LIT
082800        ELSE
082900            IF VEN-ITM-NO = "13"
083000                MOVE VEN-FREE-NOTE-2 TO V3-NOTE2.
083100
083200     GO TO 245-VENDOR-LOOP.
083300******************************************************************
083400*                    DISPLAY SCREEN WITH ITEM DATA               *
083500******************************************************************
       246-NO-MORE.
           IF END-FLAG = 1
              MOVE B"0" TO IND(74)
           ELSE
              MOVE B"1" TO IND(74).

       247-PUTBUFFER.
           MOVE SCREEN3-SUBFILE TO DISPLAY-REC.
           WRITE SUBFILE DISPLAY-REC FORMAT "RDSF1"
                 INDICATORS ARE SRF-INDICATORS.

       252-NEXT-SCREEN.
            MOVE RELATIVE-RECNO TO SUBFILE-CONTROL-RECNO.
            WRITE DISPLAY-REC FORMAT "RDSB1" INDICATORS SRF-INDICATORS.
            MOVE B"1" TO IND (76).
            IF RELATIVE-RECNO > ZERO
               MOVE B"1" TO IND(75)
            ELSE
               MOVE B"0" TO IND(75).

       253-CONTROL-SCREEN.
            MOVE SCREEN2-CONTROL TO DISPLAY-REC.
            WRITE DISPLAY-REC FORMAT "RDSC1" INDICATORS SRF-INDICATORS.
            READ DISPLAY-FILE FORMAT "RDSC1"
                 INDICATORS SRF-INDICATORS.
      *----------  CLEAR 'LAST VENDOR' MESSAGE
            MOVE B"0" TO IND(72).
      *----------  ROLLUP OR F3 EXIT OR F2 LAST VENDOR
            IF (IND(78) = B"1")
               GO TO 200-BY-CORPCODE
            ELSE
            IF (IND(02) = B"1")
               GO TO 270-LAST-BUSINESS-VENDOR
            ELSE
            IF (IND(03) = B"1")
               GO TO 299-EXIT.

092400 270-LAST-BUSINESS-VENDOR.
092500     IF SAVE-LAST-VENDOR = SPACES
092600****  NO LAST VENDOR ON RECORD FOR THIS CORPORATE CODE
               MOVE B"1" TO IND(72)
               GO TO 253-CONTROL-SCREEN.

      *----------  LAST VENDOR THAT WE HAVE DONE BUSINESS WITH
      *            IS IN RECORD 1
           MOVE 1 TO RELATIVE-RECNO.
           GO TO 252-NEXT-SCREEN.
093400
093500 299-EXIT.     EXIT.

093600 300-BY-VENDOR.
093700     MOVE 1 TO ITEM-COUNT.
093800
       302-BY-VENDOR.
070600*----------  GET EACH CORPORATE CODE TIED TO THE VENDOR
           IF END-FLAG = 1
              MOVE B"1" TO IND(73)
              GO TO 353-CONTROL-SCREEN
           ELSE
              MOVE B"0" TO IND(73).
           MOVE 0 TO COND-WORD.
           READ DVENDITM NEXT INTO BUF-DVENDITM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF VENCDE OF DVENDITM-REC NOT = VENDOR-ARG
               MOVE 15 TO COND-WORD.
071000     IF NOT GOOD-CALL
               MOVE 1 TO END-FLAG
               GO TO 346-NO-MORE.
072400
072500 340-MOVE-DATA.
           MOVE SPACES                       TO SCREEN5-SUBFILE.
           ADD  1                            TO RELATIVE-RECNO.
108500     MOVE VEN-ITM-PRICE                TO V5-PRICE.
108600     MOVE 4                            TO DATE-MODE.
108700     MOVE VEN-ITM-PRICE-DATE           TO DATE-VALIDATE-IN.
108800     CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
108900     MOVE DATE-SLASH-OUT               TO V5-EXP-DATE.
109000
109100     MOVE VEN-ITM-LT1                  TO V5-LT1.
109200     MOVE VEN-ITM-LT2                  TO V5-LT2.
109300     MOVE VEN-ITM-LT3                  TO V5-LT3.
109400     MOVE VEN-EST-LT                   TO V5-LT4.
109500     MOVE VEN-TERMS                    TO V5-TERMS.
109600     MOVE VEN-FOB                      TO V5-FOB.
109700     MOVE VEN-ITM-CORPCODE             TO V5-CORPCODE, CODE-ARG.
109900
054800*165-GET-DESC.   *REPLACED 17JUL1997*
       345-GET-DESC.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DDESC-REC.
           START DDESC KEY = CORPCDE OF DDESC-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
055100     IF NO-ENTRY OR CHAIN-LENGTH = 0
055200        MOVE 14 TO LANG-SETNUM
055300        MOVE  3 TO LANG-MSGNUM
055400        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
055500        MOVE MESSAGE-BUFFER TO V5-DESC1
055600        GO TO 346-NO-MORE.
055700     IF NOT GOOD-CALL
055800        MOVE "DBFIND DDESC 345 SVENINQS" TO BU-DISPLAY-MSG
055900        PERFORM 990-BLOWUP THRU 999-EXIT.
           MOVE 0 TO COND-WORD.
           READ DDESC NEXT INTO BUF-DDESC
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF CORPCDE OF DDESC-REC NOT = CODE-ARG
               MOVE 15 TO COND-WORD.
056200     IF NOT GOOD-CALL
056300        MOVE "DBGET1 DDESC 345 SVENINQS" TO BU-DISPLAY-MSG
056400        PERFORM 990-BLOWUP THRU 999-EXIT.
056500     MOVE DESC-DATA TO V5-DESC1
           READ DDESC NEXT INTO BUF-DDESC
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF CORPCDE OF DDESC-REC NOT = CODE-ARG
               MOVE 15 TO COND-WORD.
056800     IF END-OF-CHAIN
056900        GO TO 346-NO-MORE.
057000     IF NOT GOOD-CALL
057100        MOVE "DBGET2 DDESC 345 SVENINQS" TO BU-DISPLAY-MSG
057200        PERFORM 990-BLOWUP THRU 999-EXIT.
057300     MOVE DESC-DATA TO V5-DESC2.
057400
083300******************************************************************
083400*                    DISPLAY SCREEN WITH ITEM DATA               *
083500******************************************************************
       346-NO-MORE.
           IF END-FLAG = 1
              MOVE B"0" TO IND(74)
           ELSE
              MOVE B"1" TO IND(74).

       347-PUTBUFFER.
           MOVE SCREEN5-SUBFILE TO DISPLAY-REC.
           WRITE SUBFILE DISPLAY-REC FORMAT "RDSF2"
                 INDICATORS ARE SRF-INDICATORS.

           ADD 1 TO ITEM-COUNT.
           IF ITEM-COUNT < 4
              GO TO 302-BY-VENDOR.

       352-NEXT-SCREEN.
            MOVE RELATIVE-RECNO TO V4-CONTROL-RECNO.
            WRITE DISPLAY-REC FORMAT "RDSB2" INDICATORS SRF-INDICATORS.
            MOVE B"1" TO IND (76).
            IF RELATIVE-RECNO > ZERO
               MOVE B"1" TO IND(75)
            ELSE
               MOVE B"0" TO IND(75).

       353-CONTROL-SCREEN.
            MOVE SCREEN4-CONTROL TO DISPLAY-REC.
            WRITE DISPLAY-REC FORMAT "RDSC2" INDICATORS SRF-INDICATORS.
            READ DISPLAY-FILE FORMAT "RDSC2"
                 INDICATORS SRF-INDICATORS.
      *----------  CLEAR 'LAST VENDOR' MESSAGE
            MOVE B"0" TO IND(72).
      *----------  ROLLUP OR F3 EXIT
            IF (IND(78) = B"1")
               GO TO 300-BY-VENDOR
            ELSE
            IF (IND(03) = B"1")
               GO TO 399-EXIT.

118100 399-EXIT.     EXIT.

       820-CLEAR-SUBFILE2.
           MOVE B"0" TO IND (73), IND (75), IND (76).
           MOVE B"1" TO IND (77).
           MOVE SCREEN2-CONTROL TO DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT "RDSC1" INDICATORS SRF-INDICATORS.
           MOVE B"0" TO IND (77).
           MOVE 0 TO RELATIVE-RECNO.

       829-EXIT.  EXIT.

       830-CLEAR-SUBFILE1.
           MOVE B"0" TO IND (73), IND (75), IND (76).
           MOVE B"1" TO IND (77).
           MOVE SCREEN4-CONTROL TO DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT "RDSC2" INDICATORS SRF-INDICATORS.
           MOVE B"0" TO IND (77).
           MOVE 0 TO RELATIVE-RECNO.

       839-EXIT.  EXIT.

124200 940-VSETERROR.
           MOVE B"1" TO IND (99).
           MOVE B"1" TO IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE.

125600 949-EXIT.     EXIT.

127200**********************************************************************
127300*                           B L O W U P                              *
127400*          CHECK FOR IMAGE, VIEW, OR SPOOL ERROR.  CLOSE             *
127500*          FILES, GET OUT OF BLOCK MODE, AND DISPLAY                 *
127600*          APPROPRIATE ERROR MESSAGE ON SCREEN.                      *
127700*                                                                    *
127800*          ALSO APPENDS THE ERROR MESSAGE TO A FILE CALLED           *
127900*          BLOWUP.PUB.  TO READ THIS FILE, RUN "XBLPRT.OBJECT".      *
128000*                                                                    *
128100*             |||   PROGRAM IS ABORTED IN TBLOWUP   |||              *
128200**********************************************************************
128400 990-BLOWUP.
128500     MOVE VIEW-NFNAME     TO BU-DISPLAY-FLD (1).
128600     MOVE CODE-ARG        TO BU-DISPLAY-FLD (2).
128700     MOVE VEN-ITM-VENCODE TO BU-DISPLAY-FLD (3).
129100     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
129200                   VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG     ,
129300                   BU-DISPLAY-FLDS.

129400 999-EXIT.     EXIT.
129500
129600 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

131200 999-CATREAD-EXIT.
131300     EXIT.
