000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    SVENPRC.
000500 AUTHOR.        KURT MOVSESIAN/JIM COFFMAN (MAINTAINER).
000800
000900***************************************************************
001000*                                                             *
001100*D  S V E N P R C                                             *
001200*                                                             *
001300*D  THIS SUB PROGRAM UPDATE THE VENDORS LAST PO PRICE FOR THE *
001400*D  CODE IN THE VENDOR FILE 'DVENDITM' DATA SET               *
001500*                                                             *
001600***************************************************************
      *                                                             *
      *C  06/18/1996  CA YODER                                      *
      *C    MODIFIED FOR CENTURY DATABASE CHANGES.                  *
      *C                                                            *
      ***************************************************************
001700
001800
001900
002000 ENVIRONMENT DIVISION.
002100 CONFIGURATION SECTION.
002200 SOURCE-COMPUTER.  HP-3000.
002300 OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DVENDITM-O
                  ASSIGN TO DATABASE-MCFLCS0802
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

002400
002500 DATA DIVISION.
       FILE SECTION.
       FD  DVENDITM-O
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM-REC-O.
           COPY DDS-ALL-FORMATS OF MCFLCS0802.

002600
002700 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
002800
002900 77  SUB                          PIC S9(4) VALUE ZEROS COMP-4.
003000
003100
003200**************************************************************
003300**************************************************************
003400**                                                          **
003500**                DATABASE I/O BUFFER AREA                  **
003600**                                                          **
003700**************************************************************
003800**************************************************************
003900
004000 COPY DVENDITM IN COPYLIB.
004100
004200*********************
004300*                   *
004400*   DATA SET NAMES  *
004500*                   *
004600*********************
004700
004800 01  DSET-NAMES.
004900     05  DSET-NAME                PIC X(16) VALUE SPACES.
005000     05  DSET-DVENDITM            PIC X(16) VALUE "DVENDITM;".
005100
005200 01  ITEMS-LISTING.
005300     05  ALL-ITEMS                PIC XX    VALUE "@;".
005400     05  CODE-SEARCH              PIC X(10) VALUE "CORP-CODE;".
005500
005600 01  ARG-VALUES.
005700     05  CODE-ARG                 PIC X(8)  VALUE SPACES.
005800     05  VEN-ARG                  PIC X(10) VALUE SPACES.
005900
006400 LINKAGE SECTION.
006500
006600 01  BASE             PIC X(10).
006700
006800 COPY SVENPRC IN COPYLIB.
006900
007000 COPY DBSTAT IN COPYLIB.
007100
007200 01  BU-DISPLAY-MSG.
007300     05  BU-DISPLAY-MSG-1         PIC X(1).
007400     05  FILLER                   PIC X(59).
007500
007600 01  BU-DISPLAY-FLDS.
007700     05  BU-DISPLAY-LINE  OCCURS 5 TIMES.
007800         10  BU-DISPLAY-FLD       PIC X(14).
007900         10  BU-DISPLAY-FLD9      PIC S9(8).
008000
008100
008200
008300 PROCEDURE DIVISION USING  BASE,
008400                           SVENPRC-PARMS,
008500                           STATUS-AREA,
008600                           BU-DISPLAY-MSG,
008700                           BU-DISPLAY-FLDS.
008800
008900
009000 SVENPRC SECTION 02.
009100
009200 BEGIN-HERE.
           OPEN I-O DVENDITM-O.

009300     PERFORM 6-MAIN THRU 6-M-X.

           CLOSE DVENDITM-O.
009400
009500     GOBACK.
009600
009700
009800******************************************************
009900**                                                  **
010000**   BLOWUP ROUTINE                                 **
010100**                                                  **
010200******************************************************
010300
010400 2-BLOWUP.
010500     MOVE "SVENPRC"             TO  BU-DISPLAY-FLD (5).
010600     MOVE SVENPRC-VEN-CODE      TO  BU-DISPLAY-FLD (4).
010700     MOVE SVENPRC-CODE          TO  BU-DISPLAY-FLD (3).
           MOVE FILE-STATUS           TO  BU-DISPLAY-FLD (2).
010800     GOBACK.
010900
011000
011100 6-MAIN.
011200     PERFORM 62-FIND-DVENDITM  THRU  62-FD-X.
011300
011400 6-M-X.
011500     EXIT.
011600
011700 62-FIND-DVENDITM.
011800     MOVE SVENPRC-CODE            TO  CODE-ARG.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DVENDITM-REC-O.
           START DVENDITM-O KEY = CORPCDE OF DVENDITM-REC-O
               INVALID KEY MOVE 0 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "23"
                   MOVE 0 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
012000*    CALL "DBFIND" USING BASE, DSET-DVENDITM, MODE1,
012100*        STATUS-AREA, CODE-SEARCH, CODE-ARG.
012200     IF COND-WORD NOT = ZERO
012300         MOVE "FIND DVENDITM * 62-FD"  TO  BU-DISPLAY-MSG
012400         GO TO 2-BLOWUP.
012500
012600 62-DVEND-CHECK.
           MOVE 0 TO COND-WORD.
           READ DVENDITM-O NEXT INTO BUF-DVENDITM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF CORPCDE OF DVENDITM-REC-O NOT = CODE-ARG
               MOVE 15 TO COND-WORD.
012700*    CALL "DBGET" USING BASE, DSET-DVENDITM, MODE5,
012800*        STATUS-AREA, ALL-ITEMS, BUF-DVENDITM, CODE-ARG.
012900     IF COND-WORD = ZERO
013000         IF VEN-ITM-VENCODE = SVENPRC-VEN-CODE
013100             IF SVENPRC-DELETE
013200                 PERFORM 621-DELETE-DVENDITM  THRU  621-DD-X
013300             ELSE
013400             IF SVENPRC-UPDATE
013500                 PERFORM 621-UPDATE-DVENDITM  THRU  621-UD-X
013600             ELSE
013700                 MOVE "INVALID UPDATE STATUS * 62-UC"
013800                     TO BU-DISPLAY-MSG
013900                 MOVE SVENPRC-FLAG  TO  BU-DISPLAY-FLD (2)
014000                 GO TO 2-BLOWUP
014100         ELSE
014200             GO TO 62-DVEND-CHECK
014300     ELSE
014400         IF COND-WORD = 15
      *------------- DO A START TO FREE UP ANY RECORD LOCKS
                   MOVE HIGH-VALUES TO CORPCDE OF DVENDITM-REC-O
                   START DVENDITM-O KEY > CORPCDE OF DVENDITM-REC-O
014500             IF SVENPRC-DELETE
                       NEXT SENTENCE
014700             ELSE
014800             IF SVENPRC-UPDATE
014900                 PERFORM 621-PUT-DVENDITM  THRU  621-PD-X
015000             ELSE
015100                 MOVE "INVALID UPDATE STATUS * 62-UC"
015200                     TO  BU-DISPLAY-MSG
015300                 MOVE SVENPRC-FLAG  TO  BU-DISPLAY-FLD (2)
015400                 GO TO 2-BLOWUP
015500         ELSE
015600             MOVE "GET DVENDITM * 62-DC" TO BU-DISPLAY-MSG
015700             GO TO 2-BLOWUP.
015800
015900 62-FD-X.
016000     EXIT.
016100
016200
016300
016400**********************
016500*                    *
016600*   BUILD DVENDITM   *
016700*                    *
016800**********************
016900
017000 621-PUT-DVENDITM.
017100     MOVE SPACES            TO  BUF-DVENDITM.
001000     MOVE ZEROES            TO VEN-ITM-PRICE,
001100                               VEN-EST-LT
001200                               VEN-ITM-LT1
001300                               VEN-ITM-LT2
001400                               VEN-ITM-LT3
001500                               VEN-LOW-QTY (1)
001600                               VEN-LOW-QTY (2)
001700                               VEN-LOW-QTY (3)
001800                               VEN-HIGH-QTY (1)
001900                               VEN-HIGH-QTY (2)
002000                               VEN-HIGH-QTY (3)
002100                               VEN-WORK-PRICE (1)
002200                               VEN-WORK-PRICE (2)
002300                               VEN-WORK-PRICE (3)
002400                               VEN-BID-QTY
002500                               VEN-SURCHARGE
002600                               VEN-DISCOUNT-PERCENT
002700                               VEN-NONCODED-ITEM
                                     VEN-ITM-YTD-BUS.
017200     MOVE SVENPRC-VEN-CODE  TO  VEN-ITM-VENCODE.
017300     MOVE SVENPRC-CODE      TO  VEN-ITM-CORPCODE.
017400     MOVE ZEROS             TO  VEN-ITM-LT1,
017500                                VEN-ITM-LT2,
017600                                VEN-ITM-LT3,
017700                                VEN-ITM-YTD-BUS,
017800                                VEN-EST-LT.
017900     PERFORM 6211-ZERO-OUT-QTY
018000         VARYING SUB FROM 1 BY 1
018100             UNTIL SUB > 3.
018200     MOVE SVENPRC-PRICE-UM  TO  VEN-ITM-PRICE-UM.
018300     MOVE SVENPRC-PRICE     TO  VEN-ITM-PRICE.
018400     MOVE SVENPRC-PO-DATE   TO  VEN-ITM-PRICE-DATE.
      *---------- ACCOUNT FOR CENTURY.
           IF SVENPRC-YY > "70"
               MOVE "19"          TO  VEN-ITM-PRICE-DATE-CC
           ELSE
               MOVE "20"          TO  VEN-ITM-PRICE-DATE-CC.
           MOVE 0 TO COND-WORD.
           WRITE DVENDITM-REC-O FROM BUF-DVENDITM
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
019400*    CALL "DBPUT" USING BASE, DSET-DVENDITM, MODE1,
019500*         STATUS-AREA, ALL-ITEMS, BUF-DVENDITM.
019600     IF COND-WORD NOT = ZERO
019700         MOVE "PUT DVENDITM * 621-PD" TO BU-DISPLAY-MSG
019800         GO TO 2-BLOWUP.
020400
020500 621-PD-X.
020600     EXIT.
020700
020800 621-UPDATE-DVENDITM.
021800     IF SVENPRC-PRICE NOT = ZEROS
021900         IF VEN-QUOTE-FLAG = "Q"
022000             NEXT SENTENCE
022100         ELSE
022200             MOVE SVENPRC-PRICE     TO  VEN-ITM-PRICE
022300             MOVE SVENPRC-PRICE-UM  TO  VEN-ITM-PRICE-UM
022400             MOVE SVENPRC-PO-DATE   TO  VEN-ITM-PRICE-DATE
      *------------------- ACCOUNT FOR CENTURY.
                   IF SVENPRC-YY > "70"
                       MOVE "19"          TO  VEN-ITM-PRICE-DATE-CC
                   ELSE
                       MOVE "20"          TO  VEN-ITM-PRICE-DATE-CC
                   END-IF.
           MOVE 0 TO COND-WORD.
           REWRITE DVENDITM-REC-O FROM BUF-DVENDITM
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
022500*    CALL "DBUPDATE" USING BASE, DSET-DVENDITM, MODE1,
022600*        STATUS-AREA, ALL-ITEMS, BUF-DVENDITM.
022700     IF COND-WORD NOT = 0
022800         MOVE "UPDATE DVENDITM * 621-UD" TO BU-DISPLAY-MSG
022900         GO TO 2-BLOWUP.
023500
023600 621-UD-X.
023700     EXIT.
023800
023900
024000 621-DELETE-DVENDITM.
024100     IF VEN-ITM-LT1 = 0  AND
024200        VEN-ITM-LT2 = 0  AND
024300        VEN-ITM-LT3 = 0  AND
024400        VEN-QUOTE-FLAG  NOT = "Q"
024500         DELETE DVENDITM-O INVALID KEY
                   MOVE "DELETE DVENDITM*621-DD" TO BU-DISPLAY-MSG
024600     ELSE
               REWRITE DVENDITM-REC-O FROM BUF-DVENDITM INVALID KEY
                   MOVE "REWRITE DVENDITM*621-DD" TO BU-DISPLAY-MSG.
           IF FILE-STATUS NOT = "99"
               GO TO 2-BLOWUP.
026700
026800 621-DD-X.
026900     EXIT.
027000
027100 6211-ZERO-OUT-QTY.
027200     MOVE ZEROS                   TO  VEN-LOW-QTY (SUB),
027300                                      VEN-HIGH-QTY (SUB),
027400                                      VEN-WORK-PRICE (SUB).
