       IDENTIFICATION DIVISION.
       PROGRAM-ID.    SVENEXES.
       AUTHOR.        FRED HAYNES.
       INSTALLATION.  GOODYEAR.
       DATE-WRITTEN.  APRIL 19, 1980.
       DATE-COMPILED.
      *REMARKS
      *C
      *C  02/18/93  BK DISMUKES  REQUEST 6373
      *C     MODIFIED INITIAL FUNCTION KEY READ TO ACCEPT 'F6' TO PRINT
      *C     VENDOR ADDRESS LABELS BY CALLING TVENLABL.
      *C
      *C  03/24/93  BK DISMUKES  REQUEST 6389
      *C     1. ADDED F.O.B. AND DISCOUNT TERMS TO VENDOR FILE.  FOB
      *C        AND TERMS WILL BE KEPT IN DVENDOR RECORD 16.  TERMS
      *C        ARE VALIDATED, FOB IS NOT.
      *C
      *C   4/11/94.   MARVIN MITCHELL  REQUEST #6490
      *C     COMMENTED EACH OF THE 'COPY' CODE STATEMENTS AT
      *C     THE END OF THIS PROGRAM, AND COPIED THE ACTUAL
      *C     COPYLIB MEMBERS' SOURCE CODE.
      *C
      *C   8/08/94.   MARVIN MITCHELL
      *C     CHANGED ALL REFERENCES OF COPYCSIS/COPYMMIS TO COPYLIB.
      *C
      *C  05/08/95. WL MCINTYRE  REQUEST #95-007
      *C     ADDED CODE TO DELETE ANY ASSOCIATED ALTERNATE KEYS FOR
      *C     VENDOR CODES THAT ARE DELETED.
      *C  06/01/95.
      *C     MODIFIED INITIAL FUNCTION KEY READ TO ACCEPT 'F7' TO ACCESS
      *C     THE VENDOR ALTERNATE KEY MAINTENANCE SCREEN.
      *C  07/25/95.
      *C     ADDED ALTERNATE KEY LOGIC TO CHANGE VENDOR CODE LOGIC.
      *C
      *C  08/13/1996   CA YODER   REQ #96-028 (HP-#6616)
      *C    ADDED HELP SCREENS TO DISPLAY VALID FOB/DELIVERY CODES AND
      *C      PAYMENT TERMS.
      *C    ALSO CHANGED HOW ERROR MESSAGES ARE DISPLAYED ON SCREEN.
      *C      PREVIOUSLY, THEY WERE OVERWRITING THE COMMAND KEY LINE,
      *C      BUT THIS WAS CHANGED SO THAT THEY WOULD APPEAR ON THE
      *C      MESSAGE LINE BELOW THE COMMAND KEY LINE.
      *C
      *C  10/31/1996   WL MCINTYRE
      *C     REVISED LOGIC THAT VALIDATES VENDOR ADDRESS ENTRY TO
      *C     CLASSIFY PLANTS GREATER THAN "299" AS FOREIGN PLANTS
      *C     AND EXECUTE DIFFERENT EDITING THAN FOR U.S. PLANTS.
      *C
      *C  01/29/98     CA YODER    REQ #97-018
      *C     ADDED LOGIC TO ADD STANDARD INSTRUCTION NUMBERS TO A
      *C     VENDOR CODE.  THE USER CAN SPECIFY IF THEY SHOULD PRINT
      *C     BEFORE OR AFTER THE ITEMS ON A PO.
      *C
      *C  06/02/98     CA YODER
      *C     ADDED SCREEN FOR EDI VENDORS TO CHOOSE WHICH EDI
      *C     TRANSACTIONS SHOULD BE SENT.
      *C

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       COPY SPECIALN IN COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MPLTINFO-PK-I
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MVALIDUM-UM-I
               ASSIGN TO DATABASE-MCFLCS0401
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DVENDOR-VN-O
               ASSIGN TO DATABASE-MCFLCS0701
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DVENDITM-VN-O
               ASSIGN TO DATABASE-MCFLCS0801
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DPORECD-VN-O
               ASSIGN TO DATABASE-MCFLCS0902
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT KVENDOR-VN-O
               ASSIGN TO DATABASE-MCFLCSVEN2
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MVALID-I
               ASSIGN TO DATABASE-MCFLCS5101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MCOMMENT-I
                  ASSIGN TO DATABASE-MCFLCS1801
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZVENEXEC-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.
       DATA DIVISION.
       FILE SECTION.

      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       FD  MPLTINFO-PK-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-PK-REC-I.
           COPY DDS-MCRPCS0500 OF MCFLCS0501.

       FD  MVALIDUM-UM-I
           LABEL RECORDS ARE STANDARD.
       01  MVALIDUM-UM-REC-I.
           COPY DDS-MCRPCS0400  OF MCFLCS0401.

       FD  DVENDOR-VN-O
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-VN-REC-O.
           COPY DDS-MCRPCS0700  OF MCFLCS0701.

       FD  DVENDITM-VN-O
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM-VN-REC-O.
           COPY DDS-MCRPCS0800  OF MCFLCS0801.

       FD  DPORECD-VN-O
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-VN-REC-O.
           COPY DDS-MCRPCS0900  OF MCFLCS0902.

       FD  KVENDOR-VN-O
           LABEL RECORDS ARE STANDARD.
       01  KVENDOR-VN-REC-O.
           COPY DDS-MCRPCSVEND  OF MCFLCSVEN2.

       FD  MVALID-I
           LABEL RECORDS ARE STANDARD.
       01  MVALID-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS5101.

       FD  MCOMMENT-I
           LABEL RECORDS ARE STANDARD.
       01  MCOMMENT-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCS1801.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                   PIC X(1500).
      *------ FD STATEMENT AREA FOR IBM ONLY ------*

      *------ FOR HP ONLY ------*
      *FD  KVENDOR-VN-O.
      *01  KVENDOR-VN-REC-O.
      *    05  KVENCDE                     PIC X(10).
      *    05  KVENNAME                    PIC X(44).
      *------ FOR HP ONLY ------*

       WORKING-STORAGE SECTION.

       77  HANDLE-BLOWUP-FLAG            PIC X          VALUE "Y".
       77  SUB                           PIC S9(5)      BINARY.
       77  SAVE-ADD-TITLE                PIC X(35)      VALUE SPACES.
       77  SAVE-ENTER-VALUES-INST        PIC X(75)      VALUE SPACES.
       77  SAVE-CHG-TITLE                PIC X(35)      VALUE SPACES.
       77  SAVE-CHG-INST                 PIC X(75)      VALUE SPACES.
       77  SALTVDEL-VEN-CODE             PIC X(10)      VALUE SPACES.
       77  RET-CODE-TALTVENK      PIC X(02)  VALUE "00".
       77  BASE-TALTVENK          PIC X(20).
       77  ALT-KEY-ARG            PIC X(10).
       77  ALT-VEND-CODE          PIC X(10).
       77  INSTR-EXIST-SW                PIC X          VALUE "Y".
       77  BEFORE-AFTER-SW               PIC X          VALUE "Y".

       01  CALLING-ROUTINE               PIC X.
           88  ADD-VENDOR-CALL            VALUE "1".
           88  CHANGE-VENDOR-CALL         VALUE "2".

       01  VALIDATE-TERMS-PCT.
           05    FILLER                  PIC X(3)  VALUE "TMP".
           05  VALID-TERMS-PCT           PIC X.

       01  VALIDATE-TERMS-DD.
           05    FILLER                  PIC X(3)  VALUE "TMD".
           05  VALID-TERMS-DUE-DATE      PIC X.

       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X.
           05  FILE-STATUS-2             PIC X.

       01  WS-PAYTO-VENDOR.
           05  WS-VENDOR                 PIC X(7)  VALUE SPACES.
           05  WS-PAYTO                  PIC X(3)  VALUE SPACES.

       01  MPLTINFO-ARG.
           05  MPLTINFO-ARG-1-2          PIC X(2).
           05  MPLTINFO-ARG-3-4          PIC X(2).

       01  TYPE-CODE-ARG                 PIC X(6).

       01  COMMENT-ARG                   PIC X(4)  VALUE SPACES.

       01  BUILD-COMMENT-NO.
           05  BUILD-COM-PREFIX          PIC X     VALUE "C".
           05  BUILD-COM-NO              PIC X(3)  VALUE SPACES.

       01  FOB-HELP-SW                   PIC X.
       01  PAY-HELP-SW                   PIC X.

       COPY FUNCTDEF IN COPYLIB.

      *
      * DATABASE AREA
      *
       COPY DBMODES  IN COPYLIB.
       COPY DBSTAT   IN COPYLIB.
       COPY DVENDOR  IN COPYLIB.
       COPY KVENDOR  IN COPYLIB.
       COPY DVENDITM IN COPYLIB.
       COPY DPORECD  IN COPYLIB.
       COPY MVALIDUM IN COPYLIB.
       COPY MPLTINFO IN COPYLIB.
       COPY MVLDTYPE IN COPYLIB.
       COPY MCOMMENT IN COPYLIB.

       01  MULTI-LOCK.
           05  NUMBER-OF-LOCK-DESCRIPTORS  PIC S9(4) COMP VALUE 3.
           05  LOCK-WL-1.
               10  LOCK-LENGTH-1         PIC S9(4) VALUE 23 BINARY.
               10  LOCK-DSET-1           PIC X(16) VALUE "DVENDOR;".
               10  LOCK-ITEM-LIST-1      PIC X(16) VALUE "VEN-CODE;".
               10  LOCK-REL-OP-1         PIC X(2)  VALUE "=".
               10  LOCK-VALUE-1          PIC X(10).
           05  LOCK-WL-2.
               10  LOCK-LENGTH-2         PIC S9(4) VALUE 23 BINARY.
               10  LOCK-DSET-2           PIC X(16) VALUE "DVENDITM;".
               10  LOCK-ITEM-LIST-2      PIC X(16) VALUE "VEN-CODE;".
               10  LOCK-REL-OP-2         PIC X(2)  VALUE "=".
               10  LOCK-VALUE-2          PIC X(10).
           05  LOCK-WL-3.
               10  LOCK-LENGTH-3         PIC S9(4) VALUE 23 BINARY.
               10  LOCK-DSET-3           PIC X(16) VALUE "DPORECD;".
               10  LOCK-ITEM-LIST-3      PIC X(16) VALUE "VEN-CODE;".
               10  LOCK-REL-OP-3         PIC X(2)  VALUE "=".
               10  LOCK-VALUE-3          PIC X(10).

       01  CODE-ARG                      PIC X(8).

       01  ITEM-LISTS.
           05 ALL-ITEMS                  PIC X(02) VALUE "@;".
           05 VEN-SEARCH                 PIC X(10) VALUE "VEN-CODE;".
       01  ARG-VALUES.
           05 VEN-ARG                    PIC X(10) VALUE SPACES.
           05 UM-ARG                     PIC X(02) VALUE SPACES.
       01  DSET-NAMES.
           05 DSET-NAME                  PIC X(16) VALUE SPACES.
           05 DSET-DVENDOR               PIC X(16) VALUE "DVENDOR;".
           05 DSET-DVENDITM              PIC X(16) VALUE "DVENDITM;".
           05 DSET-DPORECD               PIC X(16) VALUE "DPORECD;".
           05 DSET-MVALIDUM              PIC X(16) VALUE "MVALIDUM;".
           05 DSET-MPLTINFO              PIC X(16) VALUE "MPLTINFO;".

      *
      * SUBPROGRAM AREA
      *
       COPY CATREAD    IN COPYLIB.
       COPY CGENHELP   IN COPYLIB.
       COPY CSWITCHF   IN COPYLIB.
       COPY TBLOWUP    IN COPYLIB.

      *
      * SCREEN AREA
      *
       COPY IOFEEDBACK IN COPYLIB.
       COPY DISPDAT2   IN COPYLIB.
       COPY HMSGBUF    IN COPYLIB.

       01  DE-FIELDS-1.
           05 DE-COMMAND-LINE-1          PIC X(79).
           05 DE-ERROR-LINE-1            PIC X(79).

       01  DE-FIELDS-2.
           05 VDE-TITLE                  PIC X(35).
           05 VDE-INSTRUCTION            PIC X(75).
           05 VDE-VENDOR.
              10 VDE-VENDOR-1-7          PIC X(07).
              10 VDE-VENDOR-8-10         PIC X(03).
           05 VDE-NAME                   PIC X(44).
           05 VDE-ADDRESS-LINES     OCCURS 6 TIMES.
              10 VDE-ADDRESS             PIC X(44).
           05 VDE-CITY                   PIC X(24).
           05 VDE-STATE                  PIC X(2).
           05 VDE-POSTAL-CODE.
              10 VDE-ZIP                 PIC X(5).
              10 VDE-ZIP-9 REDEFINES VDE-ZIP PIC 9(5).
              10 FILLER                  PIC X(4).
           05 VDE-ZIP-PLACEMENT          PIC X.
           05 VDE-PROVINCE               PIC X(4).
           05 VDE-COUNTRY                PIC X(18).
           05 VDE-CC                     PIC X(2).
           05 VDE-CC-DESC                PIC X(12).
           05 VDE-CONTACT                PIC X(34).
           05 VDE-FAX                    PIC X(24).
           05 VDE-NOTE1                  PIC X(44).
           05 VDE-TELEX                  PIC X(10).
           05 VDE-NOTE2                  PIC X(44).
           05 VDE-PHONE                  PIC X(10).
           05 VDE-FOB                    PIC X(20).
           05 VDE-TERMS.
              10  VDE-TERMS-PCT          PIC X.
              10  VDE-TERMS-DUE-DATE     PIC X.
           05 VDE-MIN-ORDER              PIC X(4).
           05 VDE-INVLESS-IND            PIC X.
           05 VDE-EDI-VENDOR             PIC X(1).
           05 VDE-DOLLAR-MAX             PIC X(7).
           05 VDE-EDIFACT-ID             PIC X(1).
           05 VDE-GOODYEAR-CODE          PIC X(17).
           05 VDE-TRADING-ID             PIC X(16).
           05 VDE-STATUS-IND             PIC X.
           05 VDE-EXCODE-IND             PIC X.
           05 VDE-INSTRUCTIONS.
              10 VDE-STD-INST   OCCURS  4 TIMES.
                 15  VDE-STD-INSTR       PIC X(3).
                 15  VDE-BEFORE-AFTER    PIC X.
           05 DE-COMMAND-LINE-2          PIC X(79).
           05 DE-ERROR-LINE-2            PIC X(79).

       01  DE-FIELDS-3.
           05 VDE-VENDOR-3               PIC X(10).
           05 DE-COMMAND-LINE-3          PIC X(79).
           05 DE-ERROR-LINE-3            PIC X(79).

       01  DE-FIELDS-EDI.
           05 VDE-EDI-VENDOR-CODE        PIC X(10).
           05 VDE-EDI-VENDOR-NAME        PIC X(44).
           05 VDE-EDI-FLAGS.
              10  VDE-NEW                PIC X.
              10  VDE-CHANGE             PIC X.
              10  VDE-REPAIR             PIC X.
              10  VDE-CONFIRM            PIC X.
              10  VDE-FOLLOWUP           PIC X.
           05 DE-ERROR-LINE-EDI          PIC X(79).

       01  CUSTOM-FKEY-DEFINITIONS.
      *
      *              F1   F2   F3   F4   F5   F6   F7   F8
      *
      *------ FOR HP ONLY ------*
      *    05 FILLER                     PIC X(40)
      *       VALUE "I         I    RA   P                   ".
      *    05 FILLER                     PIC X(40)
      *       VALUE "                    P         RA        ".
      *------ FOR HP ONLY ------*
      *------ FOR IBM ONLY ------*
           05 FILLER                     PIC X(40)
              VALUE "I                                  I    ".
           05 FILLER                     PIC X(40)
              VALUE "                                        ".
      *------ FOR IBM ONLY ------*

       01  CUSTOM-FKEYS-TABLE REDEFINES CUSTOM-FKEY-DEFINITIONS.
           05 CUSTOM-FKEYS OCCURS 2 TIMES PIC X(40).

       COPY TSHWRDFM IN COPYLIB.

       LINKAGE SECTION.
       01  BASE                          PIC X(10).
       COPY VCOMLINK IN COPYLIB.
       01  SPOOLER-NUMBER                PIC S9(2) BINARY.
       01  PLANT-CODE                    PIC X(3).
       COPY LANGSUB  IN COPYLIB.
       01  FORMFILE                      PIC X(26).

       PROCEDURE DIVISION USING BASE, VIEW-COMAREA, SPOOLER-NUMBER,
                                PLANT-CODE, LANGUAGE-PARMS,
                                FORMFILE.
       MAIN-LINE-LOGIC.
           PERFORM 1-INIT.

           PERFORM 11-INIT-MAIN-MENU.
           PERFORM 9999-DO-SCREEN-1.

           PERFORM UNTIL VIEW-LASTKEY EQUAL EXIT-PROGRAM

             EVALUATE VIEW-LASTKEY
               WHEN F1-KEY

                 MOVE "N" TO CSF-MODE
                 MOVE "FCSISINQ" TO CSF-NEW-FORMFILE-NAME
                 PERFORM 9999-CSWITCHF
                 IF CSF-OPENFORM-ERR-SW = "N"
                   CALL "TINQVEND" USING BASE, VIEW-COMAREA,
                                         SPOOLER-NUMBER,
                                         LANGUAGE-PARMS
                 END-IF
                 MOVE "O" TO CSF-MODE
                 PERFORM 9999-CSWITCHF

               WHEN F2-KEY

                 PERFORM 80-ADD-VENDOR

               WHEN F4-KEY

                 PERFORM 82-DELETE-VENDOR

               WHEN F6-KEY

                 CALL "TVENLABL"

               WHEN F7-KEY

                 CALL "TALTVEN"

               WHEN F5-KEY

                 CALL "SPAYHELP"

               WHEN OTHER

                 PERFORM 81-CHANGE-VENDOR

             END-EVALUATE

             PERFORM 11-INIT-MAIN-MENU
             PERFORM 9999-DO-SCREEN-1

           END-PERFORM.

           PERFORM 9999-CLOSES.
           GOBACK.

      ****************************************************************
      * PARAGRAPH : 1-INIT                                           *
      * PURPOSE   : INITAILIZATION ROUTINE                           *
      ****************************************************************
       1-INIT.

           MOVE 2 TO SRF-MODE.
           PERFORM 9999-OPENS.

      *
      * MOVE SPOOLER NUMBER FOR DO-SCREEN CALLS AND
      * TURN OFF THE "BEHIND THE BACK PROCESSING"
      *
           MOVE SPOOLER-NUMBER TO SRF-SPOOL-PRT-NO.
           MOVE "NNNN" TO SRF-RET-FLAGS.

      **
      ** GET INSTRUCTIONS AND TITLES
      **

      *
      * GET COMMON MESSAGE
      *
           MOVE 5 TO LANG-SETNUM.
           MOVE 5 TO LANG-MSGNUM.
           PERFORM 999-CATREAD.
           MOVE MESSAGE-BUFFER TO SAVE-ENTER-VALUES-INST.

      *
      * GET ADD MSGS
      *
           MOVE 1 TO LANG-SETNUM.
           MOVE 6 TO LANG-MSGNUM.
           PERFORM 999-CATREAD.
           MOVE MESSAGE-BUFFER TO SAVE-ADD-TITLE.

      *
      * GET CHANGE MSGS
      *
           MOVE 21 TO LANG-SETNUM.
           MOVE 2 TO LANG-MSGNUM.
           PERFORM 999-CATREAD.
           MOVE MESSAGE-BUFFER TO SAVE-CHG-INST.

           MOVE 3 TO LANG-SETNUM.
           MOVE 27 TO LANG-MSGNUM.
           PERFORM 999-CATREAD.
           MOVE MESSAGE-BUFFER TO SAVE-CHG-TITLE.

      *------ ON NEXT TWO CHECKS, THE MVALIDTYPE DATASET IS USED
      *------ BECAUSE "CGENHELP" BLOWS UP IF MVALIDTYPE ENTRY IS
      *------ MISSING.
           MOVE "FOBCOD"     TO  TYPE-CODE-ARG.
           MOVE TYPE-CODE-ARG TO VLDCODETYP OF MVALID-I-REC.
           READ MVALID-I INTO BUF-MVALIDTYPE
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               MOVE "Y"      TO  FOB-HELP-SW
           ELSE
               MOVE "N"      TO  FOB-HELP-SW.

      *------ SEE IF PAYMENT TERMS HELP IS AVAILABLE.
           MOVE "PAYCOD"     TO  TYPE-CODE-ARG.
           MOVE TYPE-CODE-ARG TO VLDCODETYP OF MVALID-I-REC.
           READ MVALID-I INTO BUF-MVALIDTYPE
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               MOVE "Y"      TO  PAY-HELP-SW
           ELSE
               MOVE "N"      TO  PAY-HELP-SW.

           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 4
               INITIALIZE VDE-STD-INST (SUB)
           END-PERFORM.

      ****************************************************************
      * PARAGRAPH : 11-INIT-MAIN-MENU                                *
      * PURPOSE   : TO INTIALIZE THE MAIN FORM FUNCTION KEYS AND     *
      *             FIELDS.                                          *
      ****************************************************************
       11-INIT-MAIN-MENU.
           MOVE 0 TO SRF-KEYSET.
           MOVE CUSTOM-FKEYS(2) TO SRF-FKEY-AREA.
           MOVE "I" TO SRF-ENTER-FLAG.
           MOVE "VENEXEC_1" TO VIEW-NFNAME.
           PERFORM 9999-GETNEXTFORM.
           MOVE SPACES TO MESSAGE-BUFFER.

      ****************************************************************
      * PARAGRAPH : 12-CLEAR-ADD-SCREEN                              *
      * PURPOSE   : TO INITIALIZE THE ADD VENDOR SCREEN              *
      ****************************************************************
       12-CLEAR-ADD-SCREEN.
           MOVE SPACES TO DE-FIELDS-2.
           MOVE SAVE-ADD-TITLE TO VDE-TITLE.
           MOVE SAVE-ENTER-VALUES-INST TO VDE-INSTRUCTION.
           MOVE "N" TO VDE-EDI-VENDOR VDE-INVLESS-IND VDE-EXCODE-IND.
           MOVE SPACES TO MESSAGE-BUFFER.
           PERFORM 9999-RESET-SCREEN.

      ****************************************************************
      * PARAGRAPH : 13-CLEAR-CHANGE-SCREEN-1                         *
      * PURPOSE   : TO INITIALIZE THE FIRST CHANGE SCREEN            *
      ****************************************************************
       13-CLEAR-CHANGE-SCREEN-1.
           MOVE SPACES TO DE-FIELDS-2.
           MOVE SAVE-CHG-TITLE TO VDE-TITLE.
           MOVE SAVE-ENTER-VALUES-INST TO VDE-INSTRUCTION.
           MOVE SPACES TO MESSAGE-BUFFER.
           PERFORM 9999-RESET-SCREEN.

      ****************************************************************
      * PARAGRAPH : 14-CLEAR-CHANGE-SCREEN-2                         *
      * PURPOSE   : TO INITIALIZE THE SECOND CHANGE SCREEN           *
      ****************************************************************
       14-CLEAR-CHANGE-SCREEN-2.
           MOVE SPACES TO DE-FIELDS-2.
           MOVE VEN-ARG TO VDE-VENDOR.
           MOVE SAVE-CHG-TITLE TO VDE-TITLE.
           MOVE SAVE-CHG-INST TO VDE-INSTRUCTION.
           MOVE SPACES TO MESSAGE-BUFFER.
           PERFORM 9999-RESET-SCREEN.

      ****************************************************************
      * PARAGRAPH : 15-CLEAR-DELETE-SCREEN                           *
      * PURPOSE   : TO INITIALIZE THE DELETE SCREEN                  *
      ****************************************************************
       15-CLEAR-DELETE-SCREEN.
           MOVE SPACES TO DE-FIELDS-3.
           MOVE SPACES TO MESSAGE-BUFFER.
           PERFORM 9999-RESET-SCREEN.

      ****************************************************************
      * PARAGRAPH : 2100-BLOWUP                                      *
      * PURPOSE   : TO LOG ERROR MESSAGE AND ABORT PROGRAM           *
      ****************************************************************
       2100-BLOWUP.
           MOVE "SVENEXES" TO BU-PGM-NAME.
           MOVE VIEW-NFNAME TO BU-DISPLAY-FLD (1).
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
                 VIEW-COMAREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
                 BU-DISPLAY-FLDS.

      ****************************************************************
      * PARAGRAPH : 80-ADD-VENDOR                                    *
      * PURPOSE   : TO GET NEW VENDOR INFO, VALIDATE AND UPDATE      *
      ****************************************************************
       80-ADD-VENDOR.

           PERFORM 9999-OPEN-KVENDOR.
           MOVE 0 TO SRF-KEYSET.
           SET ADD-VENDOR-CALL TO TRUE.

      *
      * GET SCREEN
      *
           PERFORM 12-CLEAR-ADD-SCREEN.
           MOVE "ADDVEND" TO VIEW-NFNAME.
           PERFORM 9999-GETNEXTFORM.

           MOVE SPACES TO VEN-ARG.
           MOVE CUSTOM-FKEYS(1) TO SRF-FKEY-AREA.
           PERFORM 9999-DO-SCREEN-2.

           PERFORM UNTIL VIEW-LASTKEY EQUAL EXIT-PROGRAM

             EVALUATE VIEW-LASTKEY
               WHEN F2-KEY

                 PERFORM 91-DISPLAY-CURRENCY-HELP
                 PERFORM 9999-RESET-SCREEN

               WHEN F4-KEY

      *--------------- IS FOB HELP AVAILABLE?
                 IF FOB-HELP-SW = "N"
                     MOVE 14   TO LANG-SETNUM
                     MOVE 130  TO LANG-MSGNUM
                     MOVE 35   TO SRF-ERROR-FLD
                     PERFORM 999-CATREAD
                 ELSE
                     PERFORM 99-DISPLAY-FOB-HELP
                     PERFORM 9999-RESET-SCREEN
                 END-IF

               WHEN F5-KEY

      *--------------- IS PAY TERM HELP AVAILABLE?
                 IF PAY-HELP-SW = "N"
                     MOVE 14   TO LANG-SETNUM
                     MOVE 131  TO LANG-MSGNUM
                     MOVE 36   TO SRF-ERROR-FLD
                     PERFORM 999-CATREAD
                 ELSE
                     PERFORM 100-DISPLAY-PAY-HELP
                     PERFORM 9999-RESET-SCREEN
                 END-IF

               WHEN F7-KEY

                 PERFORM 12-CLEAR-ADD-SCREEN

               WHEN OTHER

                 PERFORM 92-VALIDATE-VENDOR-INFO THRU 92-EXIT
                 IF SRF-ERROR-FLD EQUAL ZERO

      *--------------- SHOW EDI VENDOR SCREEN.
                   MOVE SPACES      TO VDE-EDI-FLAGS
                   IF VDE-EDI-VENDOR EQUAL "Y"
                     MOVE "X"       TO VDE-NEW
                     PERFORM 103-DISPLAY-EDI-SCREEN
                     MOVE "ADDVEND" TO VIEW-NFNAME
                     PERFORM 9999-GETNEXTFORM
                   END-IF

      *
      * ADD THE VENDOR
      *
                   MOVE DSET-DVENDOR TO DSET-NAME
                   PERFORM 9999-DSET-LOCK
                   PERFORM 90-WRITE-VENDOR-RECORDS
                   PERFORM 9999-UNLOCK
                   PERFORM 12-CLEAR-ADD-SCREEN

                 END-IF

             END-EVALUATE

             MOVE CUSTOM-FKEYS(1) TO SRF-FKEY-AREA
             PERFORM 9999-DO-SCREEN-2

           END-PERFORM.

           PERFORM 9999-CLOSE-KVENDOR.

      ****************************************************************
      * PARAGRAPH : 81-CHANGE-VENDOR                                 *
      * PURPOSE   : TO CHANGE A VENDORS INFORMATION.                 *
      ****************************************************************
       81-CHANGE-VENDOR.

           PERFORM 9999-OPEN-KVENDOR.
           MOVE 8 TO SRF-KEYSET.
           SET CHANGE-VENDOR-CALL TO TRUE.

      *
      * GET FIRST CHANGE SCREEN
      *
           PERFORM 13-CLEAR-CHANGE-SCREEN-1.
           MOVE "CHGVEND" TO VIEW-NFNAME.
           PERFORM 9999-GETNEXTFORM.

           PERFORM 9999-DO-SCREEN-2.

           PERFORM UNTIL VIEW-LASTKEY EQUAL EXIT-PROGRAM

             EVALUATE VIEW-LASTKEY
               WHEN F7-KEY

                 PERFORM 13-CLEAR-CHANGE-SCREEN-1

               WHEN OTHER

                 IF VDE-VENDOR EQUAL SPACES

      *
      * T62: THIS FIELD IS REQUIRED
      *
                   MOVE 20 TO LANG-SETNUM
                   MOVE 62 TO LANG-MSGNUM
                   PERFORM 999-CATREAD
                   MOVE 1 TO SRF-ERROR-FLD

                 ELSE

                   MOVE VDE-VENDOR TO VEN-ARG

      *-----  CALL ALT KEY SUB-PGM TO GET ALT KEY IF ONE EXISTS
                   MOVE VEN-ARG TO ALT-KEY-ARG
                   CALL "TALTVENK" USING RET-CODE-TALTVENK,
                                        BASE-TALTVENK,
                                        STATUS-AREA,
                                        ALT-KEY-ARG,
                                        ALT-VEND-CODE
                   IF RET-CODE-TALTVENK NOT EQUAL "00"
                      MOVE "TALTVENK ERROR 81-CV" TO BU-DISPLAY-MSG
                      PERFORM 2100-BLOWUP
                   END-IF
                   MOVE ALT-VEND-CODE   TO VDE-VENDOR VEN-ARG
                   MOVE ZERO TO COND-WORD

                   PERFORM 9999-CHAINHD-DVENDOR-VN-O
                   PERFORM 9999-GETNEXT-DVENDOR-VN-O
                   IF END-OF-CHAIN

      *
      * V3: VENDOR CODE DOES NOT EXIST
      *
                     MOVE 22 TO LANG-SETNUM
                     MOVE 3 TO LANG-MSGNUM
                     PERFORM 999-CATREAD
                     MOVE 1 TO SRF-ERROR-FLD

                   ELSE

      *
      * VENDOR CODE EXISTS GET THE CHANGES AND DO THE UPDATE
      *
                     PERFORM 83-GET-AND-DO-CHANGES

                   END-IF

                 END-IF

             END-EVALUATE

             IF VIEW-LASTKEY NOT EQUAL EXIT-PROGRAM

               PERFORM 9999-DO-SCREEN-2

             END-IF

           END-PERFORM.
           PERFORM 9999-CLOSE-KVENDOR.

      ****************************************************************
      * PARAGRAPH : 82-DELETE-VENDOR                                 *
      * PURPOSE   : TO DELETE A VENDORS INFORMATION.                 *
      ****************************************************************
       82-DELETE-VENDOR.

           PERFORM 9999-OPEN-KVENDOR.
           MOVE 8 TO SRF-KEYSET.

      *
      * GET AND CLEAR THE FORM
      *
           PERFORM 15-CLEAR-DELETE-SCREEN.
           MOVE "DELVEND" TO VIEW-NFNAME.
           PERFORM 9999-GETNEXTFORM.

           PERFORM 9999-DO-SCREEN-3.

           PERFORM UNTIL VIEW-LASTKEY EQUAL EXIT-PROGRAM

             EVALUATE VIEW-LASTKEY
               WHEN F7-KEY

                 PERFORM 15-CLEAR-DELETE-SCREEN

               WHEN OTHER

                 IF VDE-VENDOR-3 EQUAL SPACES
      *
      * T62: THIS FIELD IS REQUIRED
      *
                   MOVE 20 TO LANG-SETNUM
                   MOVE 62 TO LANG-MSGNUM
                   PERFORM 999-CATREAD
                   MOVE 1 TO SRF-ERROR-FLD

                 ELSE

                   MOVE VDE-VENDOR-3 TO VEN-ARG, LOCK-VALUE-1
                                        LOCK-VALUE-2, LOCK-VALUE-3
                   PERFORM 9999-MULTI-LOCK
                   PERFORM 9999-CHAINHD-DVENDOR-VN-O
                   PERFORM 9999-GETNEXT-DVENDOR-VN-O
                   IF END-OF-CHAIN

      *
      * V3: VENDOR CODE DOES NOT EXIST
      *
                     MOVE 22 TO LANG-SETNUM
                     MOVE 3 TO LANG-MSGNUM
                     PERFORM 999-CATREAD
                     MOVE 1 TO SRF-ERROR-FLD

                   ELSE

      *
      * MAKE SURE THAT THE VENDOR IS NOT ON A PO
      *
                     PERFORM 9999-CHAINHD-DPORECD-VN-O
                     PERFORM 9999-GETNEXT-DPORECD-VN-O
                     IF GOOD-CALL

      *
      * P33: PURCHASE ORDER EXISTS WITH THIS VENDOR
      *
                       PERFORM 9999-RESET-DVENDOR-VN-O
                       PERFORM 9999-RESET-DPORECD-VN-O
                       MOVE 16 TO LANG-SETNUM
                       MOVE 33 TO LANG-MSGNUM
                       PERFORM 999-CATREAD
                       MOVE 1 TO SRF-ERROR-FLD

                     ELSE

                       PERFORM 94-DELETE-VENDOR-RECORDS
                       PERFORM 95-DELETE-DPORECD-RECORDS
                       PERFORM 96-DELETE-DVENDITM-RECORDS
                       PERFORM 97-DELETE-MALTVEN-RECORDS
                       PERFORM 15-CLEAR-DELETE-SCREEN

                     END-IF

                   END-IF
                   PERFORM 9999-UNLOCK

                 END-IF

             END-EVALUATE

             PERFORM 9999-DO-SCREEN-3

           END-PERFORM.
           PERFORM 9999-CLOSE-KVENDOR.

      ****************************************************************
      * PARAGRAPH : 83-GET-AND-DO-CHANGES                            *
      * PURPOSE   : TO HANDLE SECOND CHANGE SCREEN.                  *
      ****************************************************************
       83-GET-AND-DO-CHANGES.
           MOVE 6 TO SRF-KEYSET.
           PERFORM 14-CLEAR-CHANGE-SCREEN-2.
           MOVE "CHGVEND_2" TO VIEW-NFNAME.
           PERFORM 9999-GETNEXTFORM.

           PERFORM 93-GET-VENDOR-INFO.
           PERFORM 9999-DO-SCREEN-2.

           PERFORM UNTIL VIEW-LASTKEY EQUAL EXIT-PROGRAM OR
                         VIEW-LASTKEY EQUAL F1-KEY

             EVALUATE VIEW-LASTKEY
               WHEN F2-KEY

                 PERFORM 91-DISPLAY-CURRENCY-HELP
                 PERFORM 9999-RESET-SCREEN

               WHEN F4-KEY

      *--------------- IS FOB HELP AVAILABLE?
                 IF FOB-HELP-SW = "N"
                     MOVE 14  TO LANG-SETNUM
                     MOVE 130 TO LANG-MSGNUM
                     MOVE 35  TO SRF-ERROR-FLD
                     PERFORM 999-CATREAD
                 ELSE
                     PERFORM 99-DISPLAY-FOB-HELP
                     PERFORM 9999-RESET-SCREEN
                 END-IF

               WHEN F5-KEY

      *--------------- IS PAY TERM HELP AVAILABLE?
                 IF PAY-HELP-SW = "N"
                     MOVE 14  TO LANG-SETNUM
                     MOVE 131 TO LANG-MSGNUM
                     MOVE 36  TO SRF-ERROR-FLD
                     PERFORM 999-CATREAD
                 ELSE
                     PERFORM 100-DISPLAY-PAY-HELP
                     PERFORM 9999-RESET-SCREEN
                 END-IF

               WHEN F7-KEY

                 PERFORM 14-CLEAR-CHANGE-SCREEN-2

               WHEN OTHER

                 PERFORM 92-VALIDATE-VENDOR-INFO THRU 92-EXIT
                 IF SRF-ERROR-FLD EQUAL ZERO

      *--------------- SHOW EDI VENDOR SCREEN.
                   IF VDE-EDI-VENDOR EQUAL "Y"
                     MOVE "X"         TO VDE-NEW
                     PERFORM 103-DISPLAY-EDI-SCREEN
                     MOVE "CHGVEND_2" TO VIEW-NFNAME
                     PERFORM 9999-GETNEXTFORM
                   END-IF

      *
      * LOCK THE DATASET, DELETE OLD THEN ADD NEW
      *
                    MOVE DSET-DVENDOR TO DSET-NAME
                    PERFORM 9999-DSET-LOCK
                    PERFORM 94-DELETE-VENDOR-RECORDS
                    PERFORM 90-WRITE-VENDOR-RECORDS
                    PERFORM 9999-UNLOCK
                    MOVE F1-KEY TO VIEW-LASTKEY

                 END-IF

             END-EVALUATE

             IF VIEW-LASTKEY NOT EQUAL F1-KEY

               PERFORM 9999-DO-SCREEN-2

             END-IF

           END-PERFORM.

      *
      * (F1-KEY OR ENTER-KEY)
      * IF ANY FUNCTION KEY WAS PRESSED OTHER THAN EXIT-PROGRAM
      * REDISPLAY THE CHANGE FORM AND ALLOW CHANGES TO OTHER
      * VENDORS.
      *
           IF VIEW-LASTKEY NOT EQUAL EXIT-PROGRAM

             MOVE 8 TO SRF-KEYSET
             PERFORM 13-CLEAR-CHANGE-SCREEN-1
             MOVE "CHGVEND" TO VIEW-NFNAME
             PERFORM 9999-GETNEXTFORM

           END-IF.

      ****************************************************************
      * PARAGRAPH : 90-WRITE-VENDOR-RECORDS                          *
      * PURPOSE   : TO WRITE THE VENDOR RECORDS TO DVENDOR & KSAM    *
      ****************************************************************
       90-WRITE-VENDOR-RECORDS.

           MOVE VDE-VENDOR TO VEN-VEN-CODE.
      *
      * WRITE 0 RECORD
      *
           MOVE SPACES TO VEN-ITM-DATA.
           MOVE VDE-NAME TO VEN-ITM-DATA.
           MOVE 0 TO VEN-ITM-NO.
           PERFORM 9999-PUT-DVENDOR-VN-O.

      *
      * WRITE 1 - 7
      *
           PERFORM VARYING SUB FROM 1 BY 1
                   UNTIL SUB GREATER THAN 6

             IF VDE-ADDRESS-LINES(SUB) NOT EQUAL SPACES

               MOVE SUB TO VEN-ITM-NO
               MOVE VDE-ADDRESS-LINES(SUB) TO VEN-ITM-DATA
               PERFORM 9999-PUT-DVENDOR-VN-O

             END-IF

           END-PERFORM.

      *
      * WRITE 7 RECORD
      *
           MOVE SPACES TO VEN-ITM-DATA.
           MOVE VDE-CITY TO VEN-CITY.
           MOVE VDE-STATE TO VEN-STATE-CODE.
           MOVE VDE-PROVINCE TO VEN-PROV-CODE.
           MOVE VDE-POSTAL-CODE TO VEN-ZIP.
           MOVE VDE-ZIP-PLACEMENT TO VEN-ZIP-BEFORE-CITY.
           MOVE 7 TO VEN-ITM-NO.
           PERFORM 9999-PUT-DVENDOR-VN-O.

      *
      * WRITE 8 RECORD
      *
      *-------- DON'T WANT TO OVERWRITE ACTIVITY DATE IF ONE EXISTS.
      **** MOVE SPACES TO VEN-ITM-DATA.
           IF VEN-ACTIVITY-DTE > SPACES
              NEXT SENTENCE
           ELSE
              MOVE SPACES   TO VEN-ACTIVITY-DTE.
           MOVE VDE-COUNTRY TO VEN-COUNTRY.
           IF VDE-EDI-VENDOR EQUAL "Y"
               MOVE VDE-EDI-FLAGS  TO VEN-EDI-FLAGS
           ELSE
              MOVE SPACES          TO VEN-EDI-FLAGS.
           MOVE 8 TO VEN-ITM-NO.
           PERFORM 9999-PUT-DVENDOR-VN-O.

      *
      * WRITE 9 RECORD
      *
           IF (VDE-CONTACT NOT EQUAL SPACES) OR
              (VDE-PHONE NOT EQUAL SPACES )
             MOVE SPACES TO VEN-ITM-DATA
             MOVE 9 TO VEN-ITM-NO
             MOVE VDE-CONTACT TO VEN-CONTACT
             MOVE VDE-PHONE TO VEN-CONTACT-PHONE
             PERFORM 9999-PUT-DVENDOR-VN-O.

      *
      * WRITE 10 RECORD
      *
           MOVE SPACES TO VEN-ITM-DATA.
           MOVE 10 TO VEN-ITM-NO.
           MOVE VDE-FAX TO VEN-FAX.
           IF VDE-MIN-ORDER NOT NUMERIC
             MOVE 0 TO VEN-MIN-ORDER
           ELSE
             MOVE VDE-MIN-ORDER TO VEN-MIN-ORDER
           END-IF.
           MOVE VDE-TELEX TO VEN-TELEX.
           MOVE VDE-CC TO VEN-CC.
           MOVE VDE-INVLESS-IND TO VEN-INVLESS-IND.
           PERFORM 9999-PUT-DVENDOR-VN-O.

      *
      * WRITE 12 RECORD
      *
           IF VDE-NOTE1 NOT EQUAL SPACES
             MOVE SPACES TO VEN-ITM-DATA
             MOVE 12 TO VEN-ITM-NO
             MOVE VDE-NOTE1 TO VEN-FREE-NOTE-1
             PERFORM 9999-PUT-DVENDOR-VN-O.

      *
      * WRITE 13 RECORD
      *
           IF VDE-NOTE2 NOT EQUAL SPACES
             MOVE SPACES TO VEN-ITM-DATA
             MOVE 13 TO VEN-ITM-NO
             MOVE VDE-NOTE2 TO VEN-FREE-NOTE-2
             PERFORM 9999-PUT-DVENDOR-VN-O.

      *
      * WRITE 14 RECORD - EDI RECORD
      *
           IF VDE-EDI-VENDOR EQUAL "Y"
             MOVE SPACES TO VEN-ITM-DATA
             MOVE 14 TO VEN-ITM-NO
             MOVE VDE-DOLLAR-MAX TO VEN-DOLLAR-MAX
             MOVE VDE-EDIFACT-ID TO VEN-EDIFACT-ID
             MOVE VDE-GOODYEAR-CODE TO VEN-GOODYEAR-CODE
             MOVE VDE-TRADING-ID TO VEN-TRADING-ID
             MOVE VDE-STATUS-IND TO VEN-STATUS-IND
             MOVE VDE-EXCODE-IND TO VEN-EXCODE-IND
             PERFORM 9999-PUT-DVENDOR-VN-O.

      *
      * WRITE 16 RECORD - F.O.B. & DISCOUNT TERMS
      *
           IF VDE-FOB NOT = SPACES AND
              VDE-TERMS NOT = SPACES
             MOVE SPACES     TO  VEN-ITM-DATA
             MOVE 16         TO VEN-ITM-NO
             MOVE VDE-FOB    TO  VEN-PO-FOB
             MOVE VDE-TERMS  TO  VEN-PO-TERMS
             PERFORM 9999-PUT-DVENDOR-VN-O.

      *
      * WRITE 17 RECORD - STANDARD INSTRUCTIONS
      *
           IF VDE-INSTRUCTIONS NOT = SPACES
             MOVE SPACES             TO  VEN-ITM-DATA
             MOVE 17                 TO  VEN-ITM-NO
             MOVE VDE-INSTRUCTIONS   TO  VEN-17-RCD
             PERFORM 9999-PUT-DVENDOR-VN-O.

      *
      * WRITE TO KSAM 'DVENDORS' FILE
      *
           MOVE VDE-NAME TO KVENDOR-NAME.
           MOVE VDE-VENDOR TO KVENDOR-CODE.
           PERFORM 9999-PUT-KVENDOR-VN-O.

      ****************************************************************
      * PARAGRAPH : 91-DISPLAY-CURRENCY-HELP                         *
      * PURPOSE   : TO CHANGE TO CURRENCY HELP FORM FILE AND CALL    *
      *             PROGRAM TO HANDLE CURRENCY HELP.                 *
      ****************************************************************
       91-DISPLAY-CURRENCY-HELP.
           MOVE SPACES TO CGENHELP-PARMS, BU-DISPLAY-MSG.
           MOVE "CURRCO" TO CGENHELP-TYPE.
           CALL "CGENHELP" USING BU-DISPLAY-AREA,
                                 BU-DISPLAY-MSG,
                                 CGENHELP-PARMS,
                                 VIEW-COMAREA.
           IF BU-DISPLAY-MSG NOT = SPACES
               PERFORM 2100-BLOWUP
           END-IF
           IF CGENHELP-CODE NOT = SPACES
               MOVE CGENHELP-CODE TO VDE-CC
           END-IF.
      *      MOVE "N" TO CSF-MODE.
      *      MOVE "FPLTSTUP" TO CSF-NEW-FORMFILE-NAME.
      *      PERFORM 9999-CSWITCHF.
      *      IF CSF-OPENFORM-ERR-SW = "N"
      *        CALL "SCURHELP" USING BASE, VIEW-COMAREA,
      *                              LANGUAGE-PARMS
      *        MOVE "FVENEXEC" TO CSF-NEW-FORMFILE-NAME
      *        PERFORM 9999-CSWITCHF
      *        IF BU-DISPLAY-MSG NOT = SPACES
      *           PERFORM 2100-BLOWUP
      *        ELSE
      *          IF CSF-OPENFORM-ERR-SW = "Y"
      *             PERFORM 2100-BLOWUP
      *          ELSE
                   IF ADD-VENDOR-CALL
                     MOVE "ADDVEND" TO VIEW-NFNAME
                   ELSE
                     MOVE "CHGVEND_2" TO VIEW-NFNAME
                   END-IF
                   PERFORM 9999-GETNEXTFORM
                   MOVE "Y" TO SRF-MSG-AND-GO
                   MOVE SPACES TO MESSAGE-BUFFER
                   PERFORM 9999-SETERROR-2.
      *          END-IF
      *        END-IF
      *      END-IF.


      ****************************************************************
      * PARAGRAPH : 92-VALIDATE-VENDOR-INFO                          *
      * PURPOSE   : TO VALIDATE THE VENDOR INFORMATION IN THE BUFFER *
      ****************************************************************
       92-VALIDATE-VENDOR-INFO.

      *
      * ONLY VALIDATE THE VENDOR CODE IF ADDING A VENDOR
      *
           IF ADD-VENDOR-CALL
             IF VDE-VENDOR EQUAL SPACES
      *M----- T62: THIS FIELD IS REQUIRED
               MOVE 20 TO LANG-SETNUM
               MOVE 62 TO LANG-MSGNUM
               PERFORM 999-CATREAD
               MOVE 1 TO SRF-ERROR-FLD
               GO TO 92-EXIT
             END-IF
             IF VDE-VENDOR-8-10 NOT EQUAL "000"
               MOVE VDE-VENDOR-1-7 TO WS-VENDOR
               MOVE "000" TO WS-PAYTO
               MOVE WS-PAYTO-VENDOR TO VEN-ARG
               PERFORM 9999-CHAINHD-DVENDOR-VN-O
               PERFORM 9999-GETNEXT-DVENDOR-VN-O
               IF END-OF-CHAIN
      *M---- P15: PAY TO VENDOR MUST BE ADDED FIRST
                 MOVE 16 TO LANG-SETNUM
                 MOVE 15 TO LANG-MSGNUM
                 PERFORM 999-CATREAD
                 MOVE 1 TO SRF-ERROR-FLD
                 GO TO 92-EXIT
               ELSE
                 PERFORM 9999-RESET-DVENDOR-VN-O
               END-IF
             END-IF
      *
      * IF AUTOMATIC ENTRY IS FOUND WITHOUT ANY ENTRIES
      * THEN INVOICING PROCESSING ADDED THE
      * AUTOMATIC MASTER AND THE DETAIL STILL NEEDS TO BE
      * ADDED.
      *
             MOVE VDE-VENDOR TO VEN-ARG
             PERFORM 9999-CHAINHD-DVENDOR-VN-O
             PERFORM 9999-GETNEXT-DVENDOR-VN-O
             IF GOOD-CALL
      *M---- V7: VENDOR ALREADY EXISTS
               PERFORM 9999-RESET-DVENDOR-VN-O
               MOVE 22 TO LANG-SETNUM
               MOVE 7 TO LANG-MSGNUM
               PERFORM 999-CATREAD
               MOVE 1 TO SRF-ERROR-FLD
               GO TO 92-EXIT
             END-IF
           END-IF.

           IF VDE-NAME EQUAL SPACES
      *M---- T62: THIS FIELD IS REQUIRED
               MOVE 20 TO LANG-SETNUM
               MOVE 62 TO LANG-MSGNUM
               PERFORM 999-CATREAD
               MOVE 2 TO SRF-ERROR-FLD
               GO TO 92-EXIT
           END-IF.

           IF VDE-ADDRESS(1) EQUAL SPACES
      *M---- T62: THIS FIELD IS REQUIRED
               MOVE 20 TO LANG-SETNUM
               MOVE 62 TO LANG-MSGNUM
               PERFORM 999-CATREAD
               MOVE 3 TO SRF-ERROR-FLD
               GO TO 92-EXIT
           END-IF.

           IF VDE-CITY EQUAL SPACES
      *M---- T62: THIS FIELD IS REQUIRED
               MOVE 20 TO LANG-SETNUM
               MOVE 62 TO LANG-MSGNUM
               PERFORM 999-CATREAD
               MOVE 9 TO SRF-ERROR-FLD
               GO TO 92-EXIT
           END-IF.

           IF VDE-STATE NOT EQUAL SPACES AND
              VDE-ZIP EQUAL SPACES
      *M---- T62: THIS FIELD IS REQUIRED
               MOVE 20 TO LANG-SETNUM
               MOVE 62 TO LANG-MSGNUM
               PERFORM 999-CATREAD
               MOVE 11 TO SRF-ERROR-FLD
               GO TO 92-EXIT
           END-IF.

           IF VDE-ZIP-PLACEMENT NOT EQUAL SPACE AND
              VDE-ZIP-PLACEMENT NOT EQUAL "X"
      *M---- * ENTER AN 'X' OR SPACE *
               MOVE 44 TO LANG-SETNUM
               MOVE 12 TO LANG-MSGNUM
               PERFORM 999-CATREAD
               MOVE 21 TO SRF-ERROR-FLD
               GO TO 92-EXIT
           END-IF.

      ********************************
      *    VALIDATE VENDOR ADDRESS   *
      ********************************
      *    IF PLANT-CODE = "629" OR "630" OR "752" OR "755"

      *-----  REVISE LOGIC TO CLASSIFY ANY PLANT-CODE GREATER
      *-----  THAN 299 AS A FOREIGN PLANT

           IF PLANT-CODE >= "300"
             IF VDE-STATE NOT = SPACES AND VDE-COUNTRY = SPACES
      *M---- C33: COUNTRY REQUIRED -- U.S. VENDOR
               MOVE 3 TO LANG-SETNUM
               MOVE 33 TO LANG-MSGNUM
               PERFORM 999-CATREAD
               MOVE 13 TO SRF-ERROR-FLD
               GO TO 92-EXIT
             ELSE
               IF VDE-PROVINCE = SPACES AND VDE-COUNTRY = SPACES
      *M---- C34: COUNTRY REQUIRED - FORIEGN VENDOR
                 MOVE 3 TO LANG-SETNUM
                 MOVE 34 TO LANG-MSGNUM
                 PERFORM 999-CATREAD
                 MOVE 13 TO SRF-ERROR-FLD
                 GO TO 92-EXIT
               END-IF
             END-IF
           ELSE
             IF VDE-PROVINCE NOT EQUAL SPACES
               IF VDE-COUNTRY EQUAL SPACES
      *M---- C34: COUNTRY REQUIRED - FORIEGN VENDOR
                 MOVE 3 TO LANG-SETNUM
                 MOVE 34 TO LANG-MSGNUM
                 PERFORM 999-CATREAD
                 MOVE 13 TO SRF-ERROR-FLD
                 GO TO 92-EXIT
               END-IF
             ELSE
               IF VDE-STATE EQUAL SPACES AND
                  VDE-COUNTRY EQUAL SPACES
      *M---- C34: COUNTRY REQUIRED - FORIEGN VENDOR
                 MOVE 3 TO LANG-SETNUM
                 MOVE 34 TO LANG-MSGNUM
                 PERFORM 999-CATREAD
                 MOVE 13 TO SRF-ERROR-FLD
                 GO TO 92-EXIT
               END-IF
             END-IF
           END-IF.

      ********************************
      *  VALIDATE CURRENCY CODE      *
      ********************************
           IF VDE-CC NOT EQUAL SPACES
             MOVE VDE-CC TO UM-ARG
             PERFORM 9999-GETKEY-MVALIDUM-UM-I
             IF NOT GOOD-CALL
      *M---- C70: CURRENCY CODE DOES NOT EXIST
               MOVE 3 TO LANG-SETNUM
               MOVE 70 TO LANG-MSGNUM
               PERFORM 999-CATREAD
               MOVE 23 TO SRF-ERROR-FLD
             END-IF
           END-IF.

           IF VDE-EDI-VENDOR EQUAL "Y"
             IF VDE-EDIFACT-ID NOT EQUAL "1" AND
                VDE-EDIFACT-ID NOT EQUAL "2"
      *M---- E55: EDI STANDARD REQUIRED, 1 OR 2 ONLY
               MOVE 5 TO LANG-SETNUM
               MOVE 55 TO LANG-MSGNUM
               PERFORM 999-CATREAD
               MOVE 29 TO SRF-ERROR-FLD
               GO TO 92-EXIT
             END-IF
             IF VDE-GOODYEAR-CODE EQUAL SPACES
      *M---- G1: GOODYEAR CODE REQUIRED FOR EDI VENDORS
               MOVE 7 TO LANG-SETNUM
               MOVE 1 TO LANG-MSGNUM
               PERFORM 999-CATREAD
               MOVE 28 TO SRF-ERROR-FLD
               GO TO 92-EXIT
             END-IF
             IF VDE-TRADING-ID  EQUAL SPACES
      *M---- T65: TRADING PARTNER REQUIRED FOR EDI VENDORS
               MOVE 20 TO LANG-SETNUM
               MOVE 65 TO LANG-MSGNUM
               PERFORM 999-CATREAD
               MOVE 32 TO SRF-ERROR-FLD
               GO TO 92-EXIT
             END-IF
             IF VDE-STATUS-IND  EQUAL SPACES
      *M---- P143: SEND STATUS INDICATOR REQUIRED FOR EDI VENDORS
               MOVE  16 TO LANG-SETNUM
               MOVE 143 TO LANG-MSGNUM
               PERFORM 999-CATREAD
               MOVE 33 TO SRF-ERROR-FLD
               GO TO 92-EXIT
             END-IF
           ELSE
             IF VDE-EDI-VENDOR NOT EQUAL "N"
      *M---- R89: REQUIRED, ENTER 'Y' OR 'N' ONLY
               MOVE 18 TO LANG-SETNUM
               MOVE 89 TO LANG-MSGNUM
               PERFORM 999-CATREAD
               MOVE 27 TO SRF-ERROR-FLD
               GO TO 92-EXIT
             END-IF
           END-IF.

      *----------- VALIDATE STANDARD INSTRUCTIONS.
           PERFORM 101-VALIDATE-INSTR.
           IF INSTR-EXIST-SW = "N"
               GO TO 92-EXIT.

      *----------- MAKE SURE BEFORE OR AFTER IS SPECIFIED.
           PERFORM 102-CHECK-BEF-AFT.
           IF BEFORE-AFTER-SW = "N"
               GO TO 92-EXIT.

      *
      *  VALIDATE DISCOUNT TERMS.  IF TERMS ARE ENTERED, FOB MUST
      *  BE ALSO AND VICE VERSA.
      *
           IF VDE-TERMS =  SPACES AND
              VDE-FOB = SPACES
               GO TO 92-EXIT
           END-IF.

           IF VDE-FOB =  SPACES AND
              VDE-TERMS NOT = SPACES
      *M---- T62: THIS FIELD IS REQUIRED
               MOVE 20 TO LANG-SETNUM
               MOVE 62 TO LANG-MSGNUM
               PERFORM 999-CATREAD
               MOVE 35 TO SRF-ERROR-FLD
               GO TO 92-EXIT
           END-IF.

           IF VDE-TERMS =  SPACES AND
              VDE-FOB NOT = SPACES
      *M---- T62: THIS FIELD IS REQUIRED
               MOVE 20 TO LANG-SETNUM
               MOVE 62 TO LANG-MSGNUM
               PERFORM 999-CATREAD
               MOVE 36 TO SRF-ERROR-FLD
               GO TO 92-EXIT
           END-IF.

           MOVE 0 TO COND-WORD.
           MOVE VDE-TERMS-PCT    TO  VALID-TERMS-PCT.
           MOVE VALIDATE-TERMS-PCT TO PLTINFOKEY OF MPLTINFO-PK-REC-I.
           START MPLTINFO-PK-I KEY = PLTINFOKEY OF MPLTINFO-PK-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
      *M---- C23: CODE DOES NOT EXIST - ENTER ANOTHER CODE OR SPACES.
               MOVE  3 TO LANG-SETNUM
               MOVE 23 TO LANG-MSGNUM
               PERFORM 999-CATREAD
               MOVE 36 TO SRF-ERROR-FLD
               GO TO 92-EXIT
           END-IF.

           MOVE 0 TO COND-WORD.
           MOVE VDE-TERMS-DUE-DATE    TO  VALID-TERMS-DUE-DATE.
           MOVE VALIDATE-TERMS-DD TO PLTINFOKEY OF MPLTINFO-PK-REC-I.
           START MPLTINFO-PK-I KEY = PLTINFOKEY OF MPLTINFO-PK-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
      *M---- C23: CODE DOES NOT EXIST - ENTER ANOTHER CODE OR SPACES.
               MOVE  3 TO LANG-SETNUM
               MOVE 23 TO LANG-MSGNUM
               PERFORM 999-CATREAD
               MOVE 36 TO SRF-ERROR-FLD
               GO TO 92-EXIT
           END-IF.

       92-EXIT.
           EXIT.

      ****************************************************************
      * PARAGRAPH : 93-GET-VENDOR-INFO                               *
      * PURPOSE   : TO GET VENDOR RECORDS FOR VENDOR = VEN-ARG       *
      *             THE FIRST RECORD IN THE CHAIN IS ASSUMED FOUND   *
      *             AND READ.                                        *
      ****************************************************************
       93-GET-VENDOR-INFO.

           MOVE 0 TO SUB.
           MOVE "N" TO VDE-EDI-VENDOR.
           PERFORM UNTIL END-OF-CHAIN

             EVALUATE VEN-ITM-NO
               WHEN "00"

                 MOVE VEN-NAME TO VDE-NAME

               WHEN "01" THRU "06"

                 ADD 1 TO SUB
                 MOVE VEN-ADDRESS TO VDE-ADDRESS(SUB)

               WHEN "07"

                 MOVE VEN-CITY TO VDE-CITY
                 MOVE VEN-STATE-CODE TO VDE-STATE
                 MOVE VEN-PROV-CODE TO VDE-PROVINCE
                 MOVE VEN-ZIP TO VDE-POSTAL-CODE
                 MOVE VEN-ZIP-BEFORE-CITY TO VDE-ZIP-PLACEMENT

               WHEN "08"

                 MOVE VEN-COUNTRY TO VDE-COUNTRY
                 IF VEN-EDI-FLAGS > SPACES
                     MOVE VEN-EDI-FLAGS TO VDE-EDI-FLAGS
                 ELSE
                     MOVE SPACES        TO VDE-EDI-FLAGS
                 END-IF

               WHEN "09"

                 MOVE VEN-CONTACT TO VDE-CONTACT
                 MOVE VEN-CONTACT-PHONE TO VDE-PHONE

               WHEN "10"

                 MOVE VEN-FAX TO VDE-FAX
                 MOVE VEN-MIN-ORDER TO VDE-MIN-ORDER
                 MOVE VEN-TELEX TO VDE-TELEX
                 MOVE VEN-INVLESS-IND TO VDE-INVLESS-IND
                 MOVE VEN-CC TO VDE-CC, UM-ARG
                 PERFORM 9999-GETKEY-MVALIDUM-UM-I
                 IF NO-ENTRY
                   MOVE "????????????" TO VDE-CC-DESC
                 ELSE
                   MOVE VALID-CURRENCY-DESC TO VDE-CC-DESC
                 END-IF

               WHEN "12"

                 MOVE VEN-12-RCD TO VDE-NOTE1

               WHEN "13"

                 MOVE VEN-13-RCD TO VDE-NOTE2

               WHEN "14"

                 MOVE "Y" TO VDE-EDI-VENDOR
                 MOVE VEN-DOLLAR-MAX TO VDE-DOLLAR-MAX
                 MOVE VEN-EDIFACT-ID TO VDE-EDIFACT-ID
                 MOVE VEN-GOODYEAR-CODE TO VDE-GOODYEAR-CODE
                 MOVE VEN-TRADING-ID TO VDE-TRADING-ID
                 MOVE VEN-STATUS-IND TO VDE-STATUS-IND
                 MOVE VEN-EXCODE-IND TO VDE-EXCODE-IND

               WHEN "16"

                 MOVE VEN-PO-FOB     TO VDE-FOB
                 MOVE VEN-PO-TERMS   TO VDE-TERMS

               WHEN "17"

                 MOVE VEN-17-RCD     TO VDE-INSTRUCTIONS

             END-EVALUATE

             PERFORM 9999-GETNEXT-DVENDOR-VN-O

           END-PERFORM.

      ****************************************************************
      * PARAGRAPH : 94-DELETE-VENDOR-RECORDS                         *
      * PURPOSE   : TO DELETE THE VENDOR RECORDS VENDOR = VEN-ARG    *
      ****************************************************************
       94-DELETE-VENDOR-RECORDS.

           PERFORM 9999-CHAINHD-DVENDOR-VN-O.
           PERFORM 9999-GETNEXT-DVENDOR-VN-O.
           PERFORM UNTIL END-OF-CHAIN

             PERFORM 9999-DELETE-DVENDOR-VN-O
             PERFORM 9999-GETNEXT-DVENDOR-VN-O

           END-PERFORM.

           PERFORM 9999-GETKEY-KVENDOR-VN-O.
           IF GOOD-CALL
             PERFORM 9999-DELETE-KVENDOR-VN-O
           END-IF.

      ****************************************************************
      * PARAGRAPH : 95-DELETE-DPORECD-RECORDS                        *
      * PURPOSE   : TO DELETE THE DPORECD RECORDS  VENDOR = VEN-ARG  *
      ****************************************************************
       95-DELETE-DPORECD-RECORDS.

           PERFORM 9999-CHAINHD-DPORECD-VN-O.
           PERFORM 9999-GETNEXT-DPORECD-VN-O.
           PERFORM UNTIL END-OF-CHAIN

             PERFORM 9999-DELETE-DPORECD-VN-O
             PERFORM 9999-GETNEXT-DPORECD-VN-O

           END-PERFORM.

      ****************************************************************
      * PARAGRAPH : 96-DELETE-DVENDITM-RECORDS                       *
      * PURPOSE   : TO DELETE THE DVENDITM RECORDS VENDOR = VEN-ARG  *
      ****************************************************************
       96-DELETE-DVENDITM-RECORDS.

           PERFORM 9999-CHAINHD-DVENDITM-VN-O.
           PERFORM 9999-GETNEXT-DVENDITM-VN-O.
           PERFORM UNTIL END-OF-CHAIN

             PERFORM 9999-DELETE-DVENDITM-VN-O
             PERFORM 9999-GETNEXT-DVENDITM-VN-O

           END-PERFORM.

      ****************************************************************
      * PARAGRAPH : 97-DELETE-MALTVEN-RECORDS                        *
      * PURPOSE   : TO DELETE THE MALTVEN RECORDS ALT-VEN = VEN-ARG  *
      ****************************************************************
       97-DELETE-MALTVEN-RECORDS.

           MOVE VEN-ARG TO SALTVDEL-VEN-CODE.
           CALL "SALTVDEL" USING SALTVDEL-VEN-CODE
                                 BU-DISPLAY-MSG
                                 BU-DISPLAY-FLDS.
           IF BU-DISPLAY-MSG NOT = SPACES
              PERFORM 2100-BLOWUP.

      ****************************************************************
      * PARAGRAPH : 99-DISPLAY-FOB-HELP                              *
      * PURPOSE   : TO CHANGE TO FOB HELP SCREEN AND CALL PROGRAM TO *
      *             HANDLE FOB HELP.                                 *
      ****************************************************************
       99-DISPLAY-FOB-HELP.
           MOVE SPACES TO CGENHELP-PARMS, BU-DISPLAY-MSG.
           MOVE "FOBCOD" TO CGENHELP-TYPE.
           CALL "CGENHELP" USING BU-DISPLAY-AREA,
                                 BU-DISPLAY-MSG,
                                 CGENHELP-PARMS,
                                 VIEW-COMAREA.
           IF BU-DISPLAY-MSG NOT = SPACES
               PERFORM 2100-BLOWUP.
           IF CGENHELP-CODE NOT = SPACES
               MOVE "FB"               TO MPLTINFO-ARG-1-2
               MOVE CGENHELP-CODE      TO MPLTINFO-ARG-3-4
      *-------------- GET FOB DESCRIPTION.
               MOVE MPLTINFO-ARG   TO PLTINFOKEY OF MPLTINFO-PK-REC-I
               START MPLTINFO-PK-I KEY = PLTINFOKEY OF MPLTINFO-PK-REC-I
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-START
               READ MPLTINFO-PK-I INTO BUF-MPLTINFO
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS = "00"
                   MOVE MPLTINFO-FOB   TO VDE-FOB.
           IF ADD-VENDOR-CALL
               MOVE "ADDVEND"          TO VIEW-NFNAME
           ELSE
               MOVE "CHGVEND_2"        TO VIEW-NFNAME.
           PERFORM 9999-GETNEXTFORM.
           MOVE "Y" TO SRF-MSG-AND-GO.
           MOVE SPACES TO MESSAGE-BUFFER.
           PERFORM 9999-SETERROR-2.

      ****************************************************************
      * PARAGRAPH : 100-DISPLAY-PAY-HELP                             *
      * PURPOSE   : TO CHANGE TO TERMS HELP SCREEN AND CALL PROGRAM  *
      *             TO HANDLE PAY TERMS HELP.                        *
      ****************************************************************
       100-DISPLAY-PAY-HELP.
           MOVE SPACES TO CGENHELP-PARMS, BU-DISPLAY-MSG.
           MOVE "PAYCOD" TO CGENHELP-TYPE.
           CALL "CGENHELP" USING BU-DISPLAY-AREA,
                                 BU-DISPLAY-MSG,
                                 CGENHELP-PARMS,
                                 VIEW-COMAREA.
           IF BU-DISPLAY-MSG NOT = SPACES
               PERFORM 2100-BLOWUP.
           IF CGENHELP-CODE NOT = SPACES
               MOVE CGENHELP-CODE      TO VDE-TERMS.
           IF ADD-VENDOR-CALL
               MOVE "ADDVEND"          TO VIEW-NFNAME
           ELSE
               MOVE "CHGVEND_2"        TO VIEW-NFNAME.
           PERFORM 9999-GETNEXTFORM.
           MOVE "Y" TO SRF-MSG-AND-GO.
           MOVE SPACES TO MESSAGE-BUFFER.
           PERFORM 9999-SETERROR-2.

      ****************************************************************
      * PARAGRAPH : 101-VALIDATE-INSTR                               *
      * PURPOSE   : TO VALIDATE STANDARD INSTRUCTIONS ENTERED ON     *
      *             THE SCREEN.                                      *
      ****************************************************************
       101-VALIDATE-INSTR.
           MOVE "Y"                              TO INSTR-EXIST-SW.
           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 4
                                              OR INSTR-EXIST-SW = "N"
               IF VDE-STD-INSTR (SUB) > SPACES
                   MOVE VDE-STD-INSTR (SUB)      TO BUILD-COM-NO
                   MOVE "C"                      TO BUILD-COM-PREFIX
                   MOVE BUILD-COMMENT-NO         TO COMMENT-ARG
                   MOVE 0                        TO FILE-STATUS
                   MOVE COMMENT-ARG TO MCOMCOMMNT OF MCOMMENT-REC-I
                   READ MCOMMENT-I INTO BUF-MCOMMENT
                       INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                   END-READ
                   IF FILE-STATUS NOT = "00"
                       MOVE  9                   TO LANG-SETNUM
                       MOVE 60                   TO LANG-MSGNUM
                       PERFORM 999-CATREAD
                       MOVE SUB                  TO SRF-ERROR-FLD
                       ADD 39                    TO SRF-ERROR-FLD
                       MOVE "N"                  TO INSTR-EXIST-SW
                   ELSE
                       MOVE 0                    TO SRF-ERROR-FLD
                       MOVE "Y"                  TO INSTR-EXIST-SW
                   END-IF
               END-IF
           END-PERFORM.

      ****************************************************************
      * PARAGRAPH : 102-CHECK-BEF-AFT                                *
      * PURPOSE   : TO MAKE SURE A "B" OR "A" IS ENTERED TO SPECIFY  *
      *             IF THE INSTRUCTION SHOULD PRINT BEFORE OR        *
      *             AFTER THE ITEMS ON THE PO PRINTOUT.              *
      ****************************************************************
       102-CHECK-BEF-AFT.
           MOVE "Y"                              TO BEFORE-AFTER-SW.
           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 4
                                              OR BEFORE-AFTER-SW = "N"
               IF VDE-STD-INSTR (SUB) > SPACES
                   IF VDE-BEFORE-AFTER (SUB) = "A" OR "B"
                       MOVE 0                    TO SRF-ERROR-FLD
                       MOVE "Y"                  TO BEFORE-AFTER-SW
                   ELSE
                       MOVE   5                  TO LANG-SETNUM
                       MOVE 108                  TO LANG-MSGNUM
                       PERFORM 999-CATREAD
                       MOVE SUB                  TO SRF-ERROR-FLD
                       ADD 43                    TO SRF-ERROR-FLD
                       MOVE "N"                  TO BEFORE-AFTER-SW
                   END-IF
               END-IF
           END-PERFORM.

      ****************************************************************
      * PARAGRAPH : 103-DISPLAY-EDI-SCREEN                           *
      * PURPOSE   : TO DISPLAY THE SCREEN TO CHOOSE WHICH EDI        *
      *             TRANSACTIONS WILL BE SENT FOR EDI VENDORS.       *
      ****************************************************************
       103-DISPLAY-EDI-SCREEN.
           MOVE VDE-VENDOR      TO  VDE-EDI-VENDOR-CODE.
           MOVE VDE-NAME        TO  VDE-EDI-VENDOR-NAME.
           MOVE "EDIVEND" TO VIEW-NFNAME.
           PERFORM 9999-GETNEXTFORM.
           PERFORM 9999-DO-SCREEN-EDI.

       9999-OPENS.
           OPEN INPUT MPLTINFO-PK-I.
           OPEN INPUT MVALIDUM-UM-I.
           OPEN INPUT MVALID-I.
           OPEN INPUT MCOMMENT-I.
           OPEN I-O DVENDOR-VN-O.
           OPEN I-O KVENDOR-VN-O.
           OPEN I-O DVENDITM-VN-O.
           OPEN I-O DPORECD-VN-O.
           OPEN I-O DISPLAY-FILE.

       9999-CLOSES.
           CLOSE MPLTINFO-PK-I,
                 MVALIDUM-UM-I,
                 DVENDOR-VN-O,
                 KVENDOR-VN-O,
                 DVENDITM-VN-O,
                 DPORECD-VN-O,
                 MVALID-I,
                 MCOMMENT-I,
                 DISPLAY-FILE.

       9999-OPEN-KVENDOR.
       9999-CLOSE-KVENDOR.

       9999-CSWITCHF.
           MOVE "N" TO CSF-OPENFORM-ERR-SW.

       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
           IF MESSAGE-BUFFER-1  = SPACES
               MOVE "* ERROR ON THIS FIELD *" TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.

       9999-GETNEXTFORM.
       9999-PUTWINDOW.
       9999-INITFORM.
       9999-SHOWFORM.
       9999-SETKEYLABEL.
       998-WRITE-SCREEN.
           IF SRF-CURSOR-FLD > ZERO
               MOVE B"1" TO IND (SRF-CURSOR-FLD)
               MOVE ZERO TO SRF-CURSOR-FLD.
           WRITE DISPLAY-REC  FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

       998-READ-SCREEN.
           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO SRF-INDICATORS.

      *------ A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *------ IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.
           IF DISPLAY-STATUS NOT = "00"
               MOVE EXIT-PROGRAM TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.
           IF SRF-KEYSET = 1 OR 3 OR 5 OR 7
               MOVE "I" TO SRF-FKEY (7).
      *    IF SRF-KEYSET > 0
      *        MOVE "I" TO SRF-FKEY (5).
      *    IF SRF-KEYSET = 1 OR 2 OR 5 OR 6 OR 7 OR 8
      *        MOVE "I" TO SRF-FKEY (4).
           IF SRF-KEYSET = 5 OR 6
               MOVE "I" TO SRF-FKEY (8), SRF-FKEY (6)
           ELSE
           IF SRF-KEYSET = 7 OR 8
               MOVE "I" TO SRF-FKEY (1), SRF-FKEY (2), SRF-FKEY (8).
           MOVE SPACES TO MESSAGE-BUFFER-1.
           IF VIEW-LASTKEY = ENTER-KEY
               IF SRF-ENTER-FLAG = "I"
      *            "E28: 'ENTER' NOT VALID HERE"
                   MOVE 5 TO LANG-SETNUM
                   MOVE 28 TO LANG-MSGNUM
                   MOVE 05028 TO CATREAD-MSG-NUMBER
                   MOVE 1 TO SRF-ERROR-FLD
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               ELSE
                   NEXT SENTENCE
           ELSE
           IF SRF-FKEY (VIEW-LASTKEY) = "I"
      *        "I10: INVALID FUNCTION KEY"
               MOVE 9 TO LANG-SETNUM
               MOVE 10 TO LANG-MSGNUM
               MOVE 09010 TO CATREAD-MSG-NUMBER
               MOVE 1 TO SRF-ERROR-FLD
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           IF MESSAGE-BUFFER-1 = SPACES
               MOVE SPACES TO SRF-FKEY-AREA, SRF-ENTER-FLAG.
       9989-WS-X.
           EXIT.

       9999-RESET-SCREEN.
           MOVE B"1" TO IND(97).
           MOVE B"1" TO IND(96).

       9999-GETBUFFER-1.
           MOVE DISPLAY-REC TO DE-FIELDS-1.

       9999-PUTBUFFER-1.
           MOVE DE-FIELDS-1 TO DISPLAY-REC.

       9999-SETERROR-1.
      *    MOVE MESSAGE-BUFFER TO DE-COMMAND-LINE-1.
           MOVE MESSAGE-BUFFER TO DE-ERROR-LINE-1.
           IF MESSAGE-BUFFER NOT = SPACES
               MOVE B"1" TO IND (99).
           IF SRF-MSG-AND-GO = "Y"
             MOVE "N" TO SRF-MSG-AND-GO
             MOVE B"1" TO IND (98)
             MOVE DE-FIELDS-1 TO DISPLAY-REC
             PERFORM 998-WRITE-SCREEN
             READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC ARE SRF-INDICATORS
               NO DATA CONTINUE
             END-READ
             MOVE B"0" TO IND(98)
             PERFORM 998-WRITE-SCREEN
             MOVE SPACES TO MESSAGE-BUFFER
           ELSE
             MOVE B"1" TO IND (SRF-ERROR-FLD).

       9999-DO-SCREEN-1.
           MOVE SRF-SAVE-COMMAND-LINE TO DE-COMMAND-LINE-1.
           IF SRF-ERROR-FLD > ZERO
               PERFORM 9999-SETERROR-1.
           PERFORM 9999-PUTBUFFER-1.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           PERFORM 9999-GETBUFFER-1.
           IF SRF-LAST-FORM NOT = VIEW-NFNAME
               MOVE VIEW-NFNAME       TO SRF-LAST-FORM
               MOVE DE-COMMAND-LINE-1 TO SRF-SAVE-COMMAND-LINE.
           IF MESSAGE-BUFFER-1 NOT = SPACES
               GO TO 9999-DO-SCREEN-1.
           IF SRF-ERROR-FLD > ZERO
               MOVE ZERO TO SRF-ERROR-FLD
               MOVE SRF-SAVE-COMMAND-LINE TO DE-COMMAND-LINE-1.

       9999-GETBUFFER-2.
           MOVE DISPLAY-REC TO DE-FIELDS-2.

       9999-PUTBUFFER-2.
           MOVE DE-FIELDS-2 TO DISPLAY-REC.

       9999-SETERROR-2.
      *    MOVE MESSAGE-BUFFER TO DE-COMMAND-LINE-2.
           MOVE MESSAGE-BUFFER TO DE-ERROR-LINE-2.
           IF MESSAGE-BUFFER NOT = SPACES
               MOVE B"1" TO IND (99).
           IF SRF-MSG-AND-GO = "Y"
             MOVE "N" TO SRF-MSG-AND-GO
             MOVE B"1" TO IND (98)
             MOVE DE-FIELDS-2 TO DISPLAY-REC
             PERFORM 998-WRITE-SCREEN
             READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC ARE SRF-INDICATORS
               NO DATA CONTINUE
             END-READ
             MOVE B"0" TO IND (98)
             PERFORM 998-WRITE-SCREEN
             MOVE SPACES TO MESSAGE-BUFFER
           ELSE
             MOVE B"1" TO IND (SRF-ERROR-FLD).

       9999-DO-SCREEN-2.
           MOVE SRF-SAVE-COMMAND-LINE TO DE-COMMAND-LINE-2.
           IF SRF-ERROR-FLD > ZERO
               PERFORM 9999-SETERROR-2.
           PERFORM 9999-PUTBUFFER-2.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           PERFORM 9999-GETBUFFER-2.
           IF SRF-LAST-FORM NOT = VIEW-NFNAME
               MOVE VIEW-NFNAME       TO SRF-LAST-FORM
               MOVE DE-COMMAND-LINE-2 TO SRF-SAVE-COMMAND-LINE.
           IF MESSAGE-BUFFER-1 NOT = SPACES
               GO TO 9999-DO-SCREEN-2.
           IF SRF-ERROR-FLD > ZERO
               MOVE ZERO TO SRF-ERROR-FLD
               MOVE SRF-SAVE-COMMAND-LINE TO DE-COMMAND-LINE-2.

       9999-GETBUFFER-3.
           MOVE DISPLAY-REC TO DE-FIELDS-3.

       9999-PUTBUFFER-3.
           MOVE DE-FIELDS-3 TO DISPLAY-REC.

       9999-SETERROR-3.
      *    MOVE MESSAGE-BUFFER TO DE-COMMAND-LINE-3.
           MOVE MESSAGE-BUFFER TO DE-ERROR-LINE-3.
           IF MESSAGE-BUFFER NOT = SPACES
               MOVE B"1" TO IND (99).
           IF SRF-MSG-AND-GO = "Y"
             MOVE "N" TO SRF-MSG-AND-GO
             MOVE B"1" TO IND (98)
             MOVE DE-FIELDS-3 TO DISPLAY-REC
             PERFORM 998-WRITE-SCREEN
             READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC ARE SRF-INDICATORS
               NO DATA CONTINUE
             END-READ
             MOVE B"0" TO IND (98)
             PERFORM 998-WRITE-SCREEN
             MOVE SPACES TO MESSAGE-BUFFER
           ELSE
             MOVE B"1" TO IND (SRF-ERROR-FLD).

       9999-DO-SCREEN-3.
           MOVE SRF-SAVE-COMMAND-LINE TO DE-COMMAND-LINE-3.
           IF SRF-ERROR-FLD > ZERO
               PERFORM 9999-SETERROR-3.
           PERFORM 9999-PUTBUFFER-3.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           PERFORM 9999-GETBUFFER-3.
           IF SRF-LAST-FORM NOT = VIEW-NFNAME
               MOVE VIEW-NFNAME       TO SRF-LAST-FORM
               MOVE DE-COMMAND-LINE-3 TO SRF-SAVE-COMMAND-LINE.
           IF MESSAGE-BUFFER-1 NOT = SPACES
               GO TO 9999-DO-SCREEN-3.
           IF SRF-ERROR-FLD > ZERO
               MOVE ZERO TO SRF-ERROR-FLD
               MOVE SRF-SAVE-COMMAND-LINE TO DE-COMMAND-LINE-3.

       9999-GETBUFFER-EDI.
           MOVE DISPLAY-REC   TO DE-FIELDS-EDI.

       9999-PUTBUFFER-EDI.
           MOVE DE-FIELDS-EDI TO DISPLAY-REC.

       9999-DO-SCREEN-EDI.
           PERFORM 9999-PUTBUFFER-EDI.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
             INDIC ARE SRF-INDICATORS
             NO DATA CONTINUE.
           PERFORM 9999-GETBUFFER-EDI.

       9999-DSET-LOCK.
      * DUMMY COPYLIB MEMBER ON AS/400

       9999-MULTI-LOCK.
      * DUMMY COPYLIB MEMBER ON AS/400

       9999-UNLOCK.
      * DUMMY COPYLIB MEMBER ON AS/400

       9999-CHAINHD-DPORECD-VN-O.
           MOVE 0 TO COND-WORD.
           MOVE VEN-ARG TO VENCDE OF DPORECD-VN-REC-O.
           START DPORECD-VN-O KEY = VENCDE OF DPORECD-VN-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DPORECD-VN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-DELETE-DPORECD-VN-O.
           MOVE 0 TO COND-WORD.
           DELETE DPORECD-VN-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "DELETE ERR 9999-DELETE-DPORECD-VN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DPORECD-VN-O.
           MOVE 0 TO COND-WORD.
           READ DPORECD-VN-O NEXT INTO BUF-DPORECD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DPORECD-VN-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DPORECD-VN-O"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF VENCDE OF DPORECD-VN-REC-O NOT = VEN-ARG
               PERFORM 9999-RESET-DPORECD-VN-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DPORECD-VN-O.
           MOVE HIGH-VALUES TO VENCDE OF DPORECD-VN-REC-O.
           START DPORECD-VN-O KEY > VENCDE OF DPORECD-VN-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-CHAINHD-DVENDITM-VN-O.
           MOVE 0 TO COND-WORD.
           MOVE VEN-ARG TO VENCDE OF DVENDITM-VN-REC-O.
           START DVENDITM-VN-O KEY = VENCDE OF DVENDITM-VN-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DVENDITM-VN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-DELETE-DVENDITM-VN-O.
           MOVE 0 TO COND-WORD.
           DELETE DVENDITM-VN-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "DELETE ERR 9999-DELETE-DVENDITM-VN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DVENDITM-VN-O.
           MOVE 0 TO COND-WORD.
           READ DVENDITM-VN-O NEXT INTO BUF-DVENDITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DVENDITM-VN-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DVENDITM-VN-O"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF VENCDE OF DVENDITM-VN-REC-O NOT = VEN-ARG
               PERFORM 9999-RESET-DVENDITM-VN-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DVENDITM-VN-O.
           MOVE HIGH-VALUES TO VENCDE OF DVENDITM-VN-REC-O.
           START DVENDITM-VN-O KEY > VENCDE OF DVENDITM-VN-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-CHAINHD-DVENDOR-VN-O.
           MOVE 0 TO COND-WORD.
           MOVE VEN-ARG TO VENCDE OF DVENDOR-VN-REC-O.
           START DVENDOR-VN-O KEY = VENCDE OF DVENDOR-VN-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DVENDOR-VN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-DELETE-DVENDOR-VN-O.
           MOVE 0 TO COND-WORD.
           DELETE DVENDOR-VN-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "DELETE ERR 9999-DELETE-DVENDOR-VN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DVENDOR-VN-O.
           MOVE 0 TO COND-WORD.
           READ DVENDOR-VN-O NEXT INTO BUF-DVENDOR
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DVENDOR-VN-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DVENDOR-VN-O"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF VENCDE OF DVENDOR-VN-REC-O NOT = VEN-ARG
               PERFORM 9999-RESET-DVENDOR-VN-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DVENDOR-VN-O.
           MOVE HIGH-VALUES TO VENCDE OF DVENDOR-VN-REC-O.
           START DVENDOR-VN-O KEY > VENCDE OF DVENDOR-VN-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-PUT-DVENDOR-VN-O.
           MOVE 0 TO COND-WORD.
           WRITE DVENDOR-VN-REC-O FROM BUF-DVENDOR
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-DVENDOR-VN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-DELETE-KVENDOR-VN-O.
           MOVE 0 TO COND-WORD.
           DELETE KVENDOR-VN-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "DELETE ERR 9999-DELETE-KVENDOR-VN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETKEY-KVENDOR-VN-O.
           MOVE 0 TO COND-WORD.
           MOVE VEN-ARG TO KVENCDE OF KVENDOR-VN-REC-O.
           READ KVENDOR-VN-O INTO BUF-KVENDOR
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-KVENDOR-VN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-RESET-KVENDOR-VN-O.
           MOVE HIGH-VALUES TO KVENCDE OF KVENDOR-VN-REC-O.
           START KVENDOR-VN-O KEY > KVENCDE OF KVENDOR-VN-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-PUT-KVENDOR-VN-O.
           MOVE 0 TO COND-WORD.
           WRITE KVENDOR-VN-REC-O FROM BUF-KVENDOR
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-KVENDOR-WK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETKEY-MVALIDUM-UM-I.
           MOVE 0 TO COND-WORD.
           MOVE UM-ARG TO VALIDUM OF MVALIDUM-UM-REC-I.
           READ MVALIDUM-UM-I INTO BUF-MVALIDUM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MVALIDUM-UM-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

