000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. T7PODELT.
000400 AUTHOR.  KURT MOVSESIAN.
000500 DATE-WRITTEN. JULY 15, 1981.
000700
000800***********************************************************
000900**                                                       **
001000*D    T 7 P O D E L T . S O U R C E                      **
001100**                                                       **
001200*D    THIS IS A SPECIAL PO                               **
001300*D    DELETE PROGRAM THAT DELETES P.Os GREATER THAN      **
001400*D    A CERTAIN DELETE-DATE.  THE P.O. DOES NOT HAVE     **
001500*D    HAVE TO BE COMPLETE FOR IT TO BE DELETED.          **
001100**                                                       **
001600*D     NOTE: ONORDER IS ADJUSTED TO QTY DELIVERED IF     **
001700*D           ONORDER IS LESS THAN DELIVERED AND MSTORERM **
001800*D           ONORDER IS ADJUSTED ACCORDINGLY. A TC '321' **
001900*D           IS ALSO CUT IF QTY ORDERED IS CHANGED       **
002000*D           TO QTY DELIVERED THUS KEEPING THE IBM       **
002100*D           IN SINK WITH THE HP.                        **
001100**                                                       **
002200*D    IT CALLS...                                        **
002300*D      'SPOHIST' TO COPY THE PO INTO THE HISTORY DB     **
002400*D      AND THEN CALLS 'SDELTPO' TO DO THE ACTUAL PO     **
002500*D      DELETION.                                        **
      *****************************************************************


      *****************************************************************
      **            M O D I F I C A T I O N    H I S T O R Y
      *****************************************************************
      *C 09/05/96   JEFF BUNGO
      *C    EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C    COMPUTE CENTURY ON ENTERED DELETION DATE AND
      *C    COMPARE AGAINST CCYYMMDD PO DATE.
      *C---------------------------------------------------------------
      *C  04/02/2003    DCR  DAN RAUCH
      *C  DCR01 - ADDED LOGIC FOR PO LOGGING
      *C
      *C   JAN 08, 2004   CA YODER
      *C   ADDED LOGIC TO PASS PARAMETER TO SDELTPO THAT THE ITEM
      *C   IS BEING MOVED TO HISTORY.
      *C
      *****************************************************************

006900 ENVIRONMENT DIVISION.
007000 CONFIGURATION SECTION.
007100 SOURCE-COMPUTER.   HP-3000.
007200 OBJECT-COMPUTER.   HP-3000.
007300
007400 INPUT-OUTPUT SECTION.
007500 FILE-CONTROL.
           SELECT PO-DELETE-FILE ASSIGN TO DISK-PODELT.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DPORECD-I
                  ASSIGN TO DATABASE-MCFLCS0901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT MPORCV-O
                  ASSIGN TO DATABASE-MCFLCS0101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

007800 DATA DIVISION.
007900 FILE SECTION.
008000
008100 FD  PO-DELETE-FILE
008200     LABEL RECORDS ARE OMITTED
008300     RECORD CONTAINS 14 CHARACTERS.
008400 01  PO-DEL-RCD.
008500     05  PO-DEL-NUM         PIC X(14).
008600
       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0501.

       FD  DPORECD-I
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0901.

       FD  MPORCV-O
           LABEL RECORDS ARE STANDARD.
       01  MPORCV-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLCS0101.
008700
008800 WORKING-STORAGE SECTION.
008900 77  COMPANY-SAVE               PIC X(3)  VALUE SPACES.
009000 77  PO-DELETE-MONTHS           PIC 9(2)  VALUE ZEROS.
009100 77  ACCEPT-CO-CODE             PIC X(3)  VALUE SPACES.
009200 77  CONT-SW                    PIC X(1)  VALUE SPACES.
009300
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

009400 01  INVOICE-INDIC-SW           PIC X     VALUE SPACES.
009500     88  INVOICING                        VALUE "Y".
009600
009700 01  BUILD-PO-LAST-PAYMENT.
009800     05  BUILD-PO-LAST-PAY-YYMM PIC X(4)  VALUE SPACES.
009900     05  BUILD-PO-LAST-PAY-DD   PIC 9(2)  VALUE ZEROS.
010000
010100 01  BUILD-PO-NUM.
010200     05  FILLER                   PIC X(1) VALUE SPACES.
010300     05  PO-NUM1-2                PIC X(2) VALUE SPACES.
010400     05  FILLER                   PIC X(11) VALUE SPACES.

DCR01 *--------------------------------------------------------------
DCR01  01  WS-Z000-EXTRA-FLDS.
DCR01      03  WS-Z000-PGM        PIC X(10)       VALUE "T7PODELT".
DCR01  COPY POLOGSUBWS  IN COPYLIB.
DCR01 *--------------------------------------------------------------

010600**************************************************************
010700**************************************************************
010800**                                                          **
010900**                DATABASE I/O BUFFER AREA                  **
011000**                                                          **
011100**************************************************************
011200**************************************************************
011400
011500 COPY MPORCV IN COPYLIB.
011600
011700 COPY DPORECD IN COPYLIB.
011800
011900 COPY MPLTINFO IN COPYLIB.
012000
012000
012000
012100*********************
012200*                   *
012300*   DATA SET NAMES  *
012400*                   *
012500*********************
012600
012700 01  DSET-NAMES.
012800     05  DSET-NAME              PIC X(16)  VALUE SPACES.
012900     05  DSET-MPORCV            PIC X(16)  VALUE "MPORCV;".
013000     05  DSET-DPORECD           PIC X(16)  VALUE "DPORECD;".
013100     05  DSET-MPLTINFO          PIC X(16)  VALUE "MPLTINFO;".
013200
013300 COPY DATAB IN COPYLIB.
013400
013500 COPY DBSTHIST IN COPYLIB.
013600
013700 01 ITEMS-LISTING.
013800     05  ALL-ITEMS              PIC XX    VALUE "@;".
013900     05  PO-SEARCH              PIC X(10) VALUE "PO-RCV-NO;".
014000
014100 01 ARG-VALUES.
014200     05  PO-ARG                 PIC X(14) VALUE SPACES.
014300     05  PLT-ARG                PIC X(4)  VALUE SPACES.
014400
014800 01  DATES-AND-TIMES.
014900     05  TODAYS-DATE.
015000         10  YY               PIC 99.
015100         10  MM               PIC 99.
015200         10  DD               PIC 99.
015300
           05  DELETE-DATE-CN.
               10  DELETE-DATE-CC   PIC 99.
015400         10  DELETE-DATE.
015500             15  DELETE-DATE-YY   PIC 99.
015600             15  DELETE-DATE-MM   PIC 99.
015700             15  DELETE-DATE-DD   PIC 99.
015800
015900 COPY TDATECHK IN COPYLIB.
016000
       COPY CCRTFILE IN COPYLIB.

016100 COPY TBLOWUP IN COPYLIB.
016200
016300
016400 PROCEDURE DIVISION.
016500 BEGIN SECTION.
       BEGIN-HERE.
016600
016700     PERFORM 1-HSK  THRU  1-HSK-X.
016800     PERFORM 6-MAIN  THRU  6-MAIN-X.
016900     PERFORM 2-CLOSE-FILES  THRU  2-CLOSE-FILES-X.
017000     GOBACK.
017100
017200
017300 1-HSK.
017400*************************************************************
017500*    ACCEPT DELETION DATE AND COMPANY CODE
017600*************************************************************
017700
017800     DISPLAY "** THIS PROGRAM WILL DELETE ALL POs OLDER THAN A".
017900     DISPLAY "** CERTAIN DATE.  PLEASE BE CAREFUL WITH ENTERING".
018000     DISPLAY "** THE DATE!!!!!".
018100     DISPLAY "  ".
018200     DISPLAY "ENTER THE DELETION DATE (MMDDYY)".
018300     ACCEPT DELETE-DATE.
018400     MOVE DELETE-DATE             TO DATE-VALIDATE-IN.
018500     MOVE 3                       TO DATE-MODE.
018600     CALL "TDATECHK" USING DATE-CHECK-AREA.
018700     IF DATE-RET-CODE NOT = 0
018800         DISPLAY "INVALID DATE; LETS START OVER"
018900         GO TO 1-HSK
019000     ELSE
019100         MOVE DATE-YMD-OUT        TO DELETE-DATE.

      *----FIGURE OUT CENTURY OF DELETION DATE.
           IF DELETE-DATE-YY > 70
               MOVE 19 TO DELETE-DATE-CC
           ELSE
               MOVE 20 TO DELETE-DATE-CC.
019200
019300     DISPLAY "DELETION DATE = ", DELETE-DATE-CN.
019400     DISPLAY "  ".
019500     DISPLAY "ENTER COMPANY CODE (nnn)".
019600     ACCEPT ACCEPT-CO-CODE.
019700     DISPLAY "COMPANY CODE = ", ACCEPT-CO-CODE.
019800     DISPLAY " ".
019900     DISPLAY "OK TO CONTINUE?".
020000     ACCEPT CONT-SW.
020100     IF CONT-SW = "Y" OR "N"
020200         NEXT SENTENCE
020300     ELSE
020400         DISPLAY "INVALID RESPONSE; LETS START OVER"
020500         GO TO 1-HSK.
020600     IF CONT-SW = "N"
020700         GO TO 1-HSK.
020800
020900*************************************************************
021000*     OPEN STORES DATA BASE 'STORES'
021100*************************************************************
021200
           OPEN INPUT MPLTINFO-I, DPORECD-I.
           OPEN I-O MPORCV-O.
022700
022800**********************************************
022900*  GET NO. OF MONTHS PO SHOULD STAY AFTER
023000*  DELETION REQUIREMENTS MEET AND THE INDICATOR
023100*  THAT DENOTES IF PLANT HAS INVOICE SOFTWARE
023200**********************************************
023300
023400     MOVE "PODL"       TO PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
023800         MOVE "GET MPLTINFO 'PODL' *1-HSK" TO BU-DISPLAY-MSG
023900         GO TO 2-BLOWUP
024000     ELSE
024100         MOVE MPLTINFO-PO-DEL-MTH   TO  PO-DELETE-MONTHS
024200         MOVE MPLTINFO-INVOICE-IND  TO  INVOICE-INDIC-SW.
024300
024400     DISPLAY "DELETE DATE ", DELETE-DATE-CN.
024600
024700******************************************
024800*   GET CO. CODE FROM MPLTINFO
024900******************************************
025000
025100     MOVE "P 01"       TO PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
025500         MOVE "GET MPLTINFO 'P 01' *1-HSK" TO BU-DISPLAY-MSG
025600         GO TO 2-BLOWUP
025700     ELSE
025800         MOVE MPLTINFO-COMPANY  TO  COMPANY-SAVE.
DCR01      MOVE MPLTINFO-COMPANY  TO  WS-Z000-PLANT-CODE.
025900
026000     IF COMPANY-SAVE = ACCEPT-CO-CODE
026100         NEXT SENTENCE
026200     ELSE
026300         MOVE "CO CODE ENTERED DOES NOT MATCH DATA BASE"
026400             TO BU-DISPLAY-MSG
026500         GO TO 2-BLOWUP.
026600
DCR01 *---------------------------------------------------------
DCR01      PERFORM Z000-PGM-SETUP         THRU Z000-PS-EXIT.
DCR01 *---------------------------------------------------------
026700 1-HSK-X.
026800     EXIT.
026900
DCR01 *---------------------------------------------------------
DCR01  Z000-PGM-SETUP.
DCR01 *****************************************************
DCR01 *   MAKE SURE PO LOGGING IS ACTIVE FOR THIS PLANT
DCR01 *****************************************************
DCR01      SET  Z000-POLG-ACTIVE-NO TO TRUE.
DCR01
DCR01      MOVE WS-Z000-POLG-KEY         TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO.
DCR01      IF FILE-STATUS = "00"
DCR01         IF  PLTINFODTA OF MPLTINFO-REC-I(1:1) = "Y"
DCR01             SET  Z000-POLG-ACTIVE-YES TO TRUE
DCR01         END-IF
DCR01      END-IF.
DCR01
DCR01      IF   Z000-POLG-ACTIVE-NO
DCR01           GO TO Z000-PS-EXIT
DCR01      END-IF.
DCR01
DCR01      PERFORM Z001-SETUP-PO-LOGGING  THRU Z001-EXIT.
DCR01      PERFORM Z110-RMV-USER-TRIGGER  THRU Z110-EXIT.
DCR01
DCR01  Z000-PS-EXIT.
DCR01       EXIT.
DCR01 *---------------------------------------------------------
027000
027100 2-CLOSE-FILES.
           CLOSE MPLTINFO-I, DPORECD-I, MPORCV-O.
028200
028300 2-CLOSE-FILES-X.
028400     EXIT.
028500
028600
028700
028800******************************************************
028900**                                                  **
029000**   BLOWUP ROUTINE                                 **
029100**                                                  **
029200******************************************************
029300
029400 2-BLOWUP.
029500     MOVE "T7PODELT" TO BU-PGM-NAME.
029600     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
029700         DUMMY-VIEW-AREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
029800             BU-DISPLAY-FLDS.
030100
030200 6-MAIN.
      *----- CALL CCRTFILE TO CREATE A FILE 'PODELT'
      *----- LIBRARY '*LIBL' IS USED.
           MOVE SPACES        TO CCRTFILE-PARMS.
           MOVE "PODELT"      TO CCRTFILE-FILE.
           MOVE "0014"        TO CCRTFILE-RECORD-LENGTH.
           MOVE "01000"       TO CCRTFILE-NO-RECORDS.
           MOVE "01000"       TO CCRTFILE-INCREMENT-AMT.
           MOVE "30"          TO CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               MOVE "CCRTFILE CREATE OF 'PODELT' FAILED"
                   TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

030300     OPEN OUTPUT PO-DELETE-FILE.
030400     PERFORM 61-READ-PO-HEADER-DSET  THRU 61-RPHD-X.
030500     CLOSE PO-DELETE-FILE.
030600
030700     OPEN INPUT PO-DELETE-FILE.
030800     PERFORM 62-DELETE-PO  THRU  62-DP-X.
030900     CLOSE PO-DELETE-FILE.
031000
031100 6-MAIN-X.
031200     EXIT.
031300
031400
031500 61-READ-PO-HEADER-DSET.
031600**************************************
031700*                                    *
031800*  SERIAL READ ON DPORECD TO FIND    *
031900*  HEADER DATA                       *
032000*                                    *
032100**************************************
032200
           READ DPORECD-I NEXT INTO BUF-DPORECD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
032700             GO TO 61-RPHD-X
032800         ELSE
032900             MOVE "GET DPORECD *61-RPHD" TO BU-DISPLAY-MSG
033000             GO TO 2-BLOWUP.
033100     MOVE PO-RCV-NO  TO  PO-ARG,
033200                         BU-DISPLAY-FLD (1).
033300
033400********** CHECK RELEASE FIELD FOR '999' WHICH MEANS THIS
033500********** THIS IS A REQUIREMENT ORDER AND THEY ARE NOT
033600********** DELETED AUTOMATICALLY
033700
033800     IF PO-RLS-NO = "999"
033900         GO TO 61-READ-PO-HEADER-DSET.
034000
034100******* CHECK PO DATE TO SEE IF IT IS OLDER THAN DELETE
034200******* DATE. IF IT ISNT THEN THE PO COULD'NT POSSIBLY MEET
034300******* THE DELETE REQUIREMENTS.
034400
034500     IF PO-DATE-CN < DELETE-DATE-CN
034600         NEXT SENTENCE
034700     ELSE
034800         GO TO 61-READ-PO-HEADER-DSET.
034900
035000*----- THE FOLLOWING LOGIG WHEN NOT COMMENTED OUT WILL DELETE
035100*----- INTERNAL ORDERS ONLY.  CHECKS FOR A PO NUMBER STARTING WITH
035200*----- 'IT'.
035300
035400**   MOVE PO-RCV-NO               TO BUILD-PO-NUM.
035500**   IF PO-NUM1-2 = "IT"
035600**       NEXT SENTENCE
035700**   ELSE
035800**       GO TO 61-READ-PO-HEADER-DSET.
035900
036000 61-CALL-SPOHIST.
036100     PERFORM 613-UPDATE-STORES-HISTORY  THRU  613-USH-X.
036200
036300 61-WRITE-PO-DELETE-FILE.
036400     MOVE PO-RCV-NO       TO PO-DEL-NUM.
036500     WRITE PO-DEL-RCD.
036600     GO TO 61-READ-PO-HEADER-DSET.
036700
036800 61-RPHD-X.
036900     EXIT.
037000
037100
037200*********************************************
037300*                                           *
037400*   THE NEXT PROCEDURE CALLS 'SPOHIST'      *
037500*   WHICH IS THE SUBROUTINE WHICH ABSTRACTS *
037600*   ALL THE PO HISTORY FOR A GIVEN PO AND   *
037700*   PLACES THIS INFO. IN THE HISTORY DB     *
037800*   'STHIST'                                *
037900*                                           *
038000*********************************************
038100
038200
038300 613-UPDATE-STORES-HISTORY.
           MOVE PO-ARG TO PORCVNO OF MPORCV-REC-O.
           READ MPORCV-O INTO BUF-MPORCV
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
059400         MOVE "GET MPORCV*613-USH" TO BU-DISPLAY-MSG
059500         GO TO 2-BLOWUP.
039900
040000********* IF 'PO-RCV-SEQ' IS = 'HISTOK' ON THE PO MASTER
040100********* 'MPORCV' THEN THIS MEANS THE PO HAS ALREADY BEEN
040200********* MOVED TO THE HISTORY DATA BASE AND THEREFORE IS
040300********* NOT COPIED OVER AGAIN.  OTHERWISE MARK 'PO-RCV-SEQ'
040400********* WITH 'HISTSP' AND CALL 'SPOHIST'.  IF 'SPOHIST'
040500********* SUCCESSFULLY COPYS THE PO OVER INTO THE HISTORY DB
040600********* THEN IT WILL MARK 'PO-RCV-SEQ' WITH A 'HISTOK'
040700********* INDICATOR
040800
040900     IF M-PO-RCV-SEQ = "HISTOK"
041100         GO TO 613-USH-X.
041200
041300     MOVE "HISTSP" TO  M-PO-RCV-SEQ.
           REWRITE MPORCV-REC-O FROM BUF-MPORCV
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
061400         MOVE "UPDATE MPORCV*613-USH" TO BU-DISPLAY-MSG
061500         GO TO 2-BLOWUP.
042100
042200     CALL "SPOHIST" USING BASE,
042300                          BASE-STHIST,
042400                          BUF-DPORECD,
042500                          PO-ARG.
042600
042700 613-USH-X.
042800     EXIT.
042900
043900*******************************************
044000*                                         *
044100*  THIS PROCEDURE CALLS 'SDELTPO' WHICH   *
044200*  DOES THE ACTUAL DELETION OF A PO FROM  *
044300*  THE STORES DATA BASE.  BY THE TIME     *
044400*  THIS SUBROUTINE IS CALLED THE PO HAS   *
044500*  ALREADY BEEN COPIED OVER TO THE        *
044600*  HISTORY DATA BASE 'STHIST'             *
044700*                                         *
044800*******************************************
044900
045000
045100 62-DELETE-PO.
045200     READ PO-DELETE-FILE
045300         AT END  GO TO 62-DP-X.
045400
045500     MOVE PO-DEL-NUM            TO  PO-ARG.
      *-------- SET SWITCH TO INDICATE ITEM GOING TO HISTORY.  SWITCH
      *-------- IS RESET IN SDELTPO.
           MOVE "H"                   TO  BASE (1:1).
045600     CALL "SDELTPO" USING BASE,
045700                          PO-ARG,
045800                          COMPANY-SAVE.
DCR01 *---------------------------------------------------------
DCR01 *****PERFORM Z100-PROCESS-PO-LOGGING  THRU Z100-EXIT.
DCR01      PERFORM Z110-RMV-USER-TRIGGER    THRU Z110-EXIT.
DCR01 *---------------------------------------------------------
046000     GO TO 62-DELETE-PO.
046100
046200 62-DP-X.
046300     EXIT.
DCR01
DCR01  COPY POLOGSUBR   IN COPYLIB.
