000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.     TACCUMFX.
000400 AUTHOR.         C.I.HILLES.
000500 DATE-WRITTEN.   04/15/88.
000600 DATE-COMPILED.
000700*INSTALLATION.   GOODYEAR TIRE AND RUBBER - AKRON.
000900*REMARKS.
001000*D   BY ADDING UP ALL RECEIVING SLIP QUANTITIES FOR DELIVERED AND
001100*D   STORED, THOSE QUANTITIES SHOULD MATCH THE ACCUMULATOR QUANTITIES
001200*D   IN DPOITEM.  IF THEY DO NOT, THEY WILL BE DISPLAYED.  IF THE
001210*D   UPDATE FLAG IS SET, THE QUANTITIES IN DPOITEM WILL BE CHANGED
001220*D   TO MATCH THE RECEIVERS TOTALS.
001230
      *C 06/12/96    JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   INCLUDE CENTURY FOR DATE RECEIVED AND STORED FOR
      *C   BOTH DRCVITEM AND DPOITEM.

001300 ENVIRONMENT DIVISION.
001400 CONFIGURATION SECTION.
001500 SOURCE-COMPUTER.  HP-3000.
001600 OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.

           SELECT MPORCV-PO-O
               ASSIGN TO DATABASE-MCFLCS0101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DRCVITEM-PO-O
               ASSIGN TO DATABASE-MCFLCS1201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DPOITEM-PO-O
               ASSIGN TO DATABASE-MCFLCS1002
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
001700
       DATA DIVISION.
       FILE SECTION.
       FD  MPORCV-PO-O
           LABEL RECORDS ARE STANDARD.
       01  MPORCV-PO-REC-O.
           COPY DDS-MCRPCS0100  OF MCFLCS0101.

       FD  DRCVITEM-PO-O
           LABEL RECORDS ARE STANDARD.
       01  DRCVITEM-PO-REC-O.
           COPY DDS-MCRPCS1200  OF MCFLCS1201.

       FD  DPOITEM-PO-O
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-PO-REC-O.
           COPY DDS-MCRPCS1000  OF MCFLCS1002.
      *------ FD STATEMENT AREA FOR IBM ONLY ------*

       FD  PRINT-FILE
           RECORD CONTAINS 132 CHARACTERS.
       01  PRINT-REC               PIC X(132).

001900 WORKING-STORAGE SECTION.
       01  WORK-STRING              PIC X(132).
       01  UPDATE-COUNT             PIC 9(6).
       01  QTY-TO-RCV               PIC S9(8)V9(4).
       01  NO-DRCVITEM-FLAG         PIC X(1).
       01  NO-DPOITEM-FLAG          PIC X(1).
       01  FILE-STATUS.
           05  FILE-STATUS-1        PIC X.
           05  FILE-STATUS-2        PIC X.
002100 01  X                             PIC 9(4)  VALUE ZEROES COMP-4.
002200 01  DONE-YET                      PIC X     VALUE SPACE.
002300     88  ALL-FINISHED                        VALUE "Y".
002400 01  ITEM-X                        PIC 9(4)  VALUE ZEROES COMP-4.
002500
002510 01  ITEM-TABLE1.
002520     05  ITEM-TABLE-AREA1 OCCURS 1000 TIMES.
002530         07  T-QTY-DLVR            PIC 9(8)V9(4).
002540         07  T-QTY-STORED          PIC 9(8)V9(4).
002510 01  ITEM-TABLE2.
002520     05  ITEM-TABLE-AREA2 OCCURS 1000 TIMES.
               07  T-DATE-RCV-CN.
                   10  T-DATE-RCV-CC     PIC X(2).
002550             10  T-DATE-RCV        PIC X(6).
               07  T-DATE-STORED-CN.
                   10  T-DATE-STORED-CC  PIC X(2).
002560             10  T-DATE-STORED     PIC X(6).
002570
002600******************************************************************
002800**          S U B P R O G R A M   A R E A S                     **
003000******************************************************************
003100
003200 COPY TBLOWUP    IN COPYLIB.
       COPY TDATECHK   IN COPYLIB.
      *------ PARMS FOR 'CRLSTRCV': "REAL" LAST RECEIVER
       01  BASE2                         PIC X(10).
       01  REAL-LAST-RCVR                PIC 9(3).
003300
005200*************************************************************
005400**           D A T A B A S E   W O R K                     **
005600*************************************************************
005700 COPY DATAB OF COPYLIB.
007000 01  PO-SEARCH                     PIC X(16) VALUE "PO-RCV-NO;".
007010 01  NO-ARG                        PIC X(14) VALUE SPACES.
007100 01  PO-ARG.
007200     05  PO-ARG-PO                 PIC X(8).
007300     05  PO-ARG-REL                PIC X(3).
007400     05  PO-ARG-RS                 PIC X(3).
007500 01  PO-RCV-ARG.
007600     05  PO-RCV-ARG-PO             PIC X(8).
007700     05  PO-RCV-ARG-REL            PIC X(3).
007800     05  PO-RCV-ARG-RS             PIC 9(3).
       01  PO-ARG-ALL                    PIC X(14).
009200
009300 COPY MPORCV     IN COPYLIB.
009400 COPY DPOITEM    IN COPYLIB.
009500 COPY DRCVITEM   IN COPYLIB.
010100
       01  DETAIL-LINE.
           05  PRT-PO                PIC X(14).
           05  FILLER                PIC X(1).
           05  PRT-ITEM              PIC X(4).
           05  FILLER                PIC X(1).
           05  PRT-PO-DLV            PIC Z(7)9.9999.
           05  FILLER                PIC X(2).
           05  PRT-PO-DLV-DATE       PIC X(8).
           05  FILLER                PIC X(1).
           05  PRT-RCV-DLV           PIC Z(7)9.9999.
           05  FILLER                PIC X(2).
           05  PRT-RCV-DLV-DATE      PIC X(8).
           05  FILLER                PIC X(1).
           05  PRT-PO-STR            PIC Z(7)9.9999.
           05  FILLER                PIC X(2).
           05  PRT-PO-STR-DATE       PIC X(8).
           05  FILLER                PIC X(1).
           05  PRT-RCV-STR           PIC Z(7)9.9999.
           05  FILLER                PIC X(2).
           05  PRT-RCV-STR-DATE      PIC X(8).
           05  FILLER                PIC X(2).
           05  PRT-CORP-CODE         PIC X(7).
           05  FILLER                PIC X(1).
           05  PRT-NO-DRCVITEM       PIC X(11).

       01  HDR-1.
           05  FIL PIC X(11) VALUE "P.O. NUMBER".
           05  FIL PIC X(4)  VALUE SPACES.
           05  FIL PIC X(4)  VALUE "ITEM".
           05  FIL PIC X(4)  VALUE SPACES.
           05  FIL PIC X(10) VALUE "PO QTY DLV".
           05  FIL PIC X(2)  VALUE SPACES.
           05  FIL PIC X(8)  VALUE "PO DV DT".
           05  FIL PIC X(3)  VALUE SPACES.
           05  FIL PIC X(11) VALUE "RCV QTY DLV".
           05  FIL PIC X(2)  VALUE SPACES.
           05  FIL PIC X(8)  VALUE "RC DV DT".
           05  FIL PIC X(4)  VALUE SPACES.
           05  FIL PIC X(10) VALUE "PO QTY STR".
           05  FIL PIC X(2)  VALUE SPACES.
           05  FIL PIC X(8)  VALUE "PO ST DT".
           05  FIL PIC X(3)  VALUE SPACES.
           05  FIL PIC X(11) VALUE "RCV QTY STR".
           05  FIL PIC X(2)  VALUE SPACES.
           05  FIL PIC X(8)  VALUE "RC ST DT".

       01  QTY-TO-RCV-LINE.
           05  FILLER          PIC X(18) VALUE "      *** RECEIVE ".
           05  PRT-QTY-TO-RCV  PIC Z(7)9.9999.
           05  FILLER          PIC X(17) VALUE " OF THIS ITEM ***".

       LINKAGE SECTION.
       01  PROGRAM-FLAGS.
           05  UPDATE-FLAG     PIC X(1).
           05  SKIP-FLAG       PIC X(1).
           05  DATE-FLAG       PIC X(1).
           05  NUM-OF-UPDATES  PIC 9(6).
           05  GIVE-TO-NAME    PIC X(15).

010200 PROCEDURE DIVISION USING PROGRAM-FLAGS.
010300
010400 0000-START.
           IF NUM-OF-UPDATES NOT NUMERIC
               MOVE "999999" TO NUM-OF-UPDATES.
           MOVE ZERO TO UPDATE-COUNT.
           DISPLAY "UPDATE-FLAG              = ", UPDATE-FLAG.
           DISPLAY "SKIP RECALLED RCVRS FLAG = ", SKIP-FLAG.
           DISPLAY "CHECK PO/RCVR DATES FLAG = ", DATE-FLAG.
           DISPLAY "NUM-OF-UPDATES           = ", NUM-OF-UPDATES.
           OPEN OUTPUT PRINT-FILE.
           STRING "***** PLEASE GIVE THIS REPORT TO ",
              GIVE-TO-NAME, " ******" DELIMITED BY SIZE
              INTO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1.
           WRITE PRINT-REC AFTER ADVANCING 1.
           WRITE PRINT-REC AFTER ADVANCING 1.
           WRITE PRINT-REC AFTER ADVANCING 1.
           WRITE PRINT-REC AFTER ADVANCING 1.
           WRITE PRINT-REC AFTER ADVANCING 1.
           WRITE PRINT-REC AFTER ADVANCING 1.
           WRITE PRINT-REC FROM HDR-1 AFTER ADVANCING 1.

           PERFORM 9999-OPEN-STUFF.
010435
           PERFORM 9999-INIT-MPORCV-PO-O.
010440 0001-LOOP-THROUGH-PO.
           MOVE "N" TO NO-DRCVITEM-FLAG.
           MOVE "N" TO NO-DPOITEM-FLAG.
010500     PERFORM 100-ZERO-TABLE THRU 199-EXIT.
010600     PERFORM 200-READ-MPORCV THRU 299-EXIT.
010700     IF ALL-FINISHED
010800        GO TO 09-EXIT.
010900     PERFORM 300-READ-DRCVITEM THRU 399-EXIT.
011000     PERFORM 400-UPDATE-DPOITEM THRU 499-EXIT.
011100     GO TO 0001-LOOP-THROUGH-PO.
011200 09-EXIT.
           PERFORM 9999-CLOSE-STUFF.
           CLOSE PRINT-FILE.
           GOBACK.
011300
024100 2100-BLOWUP.
024200     MOVE "TACCUMFX"  TO BU-PGM-NAME.
024300     MOVE PO-RCV-ARG  TO BU-DISPLAY-FLD (1).
024400     MOVE PO-ARG TO   BU-DISPLAY-FLD (2).
024600     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
024700          DUMMY-VIEW-AREA, FILE-STATUS, BU-DISPLAY-MSG,
024800           BU-DISPLAY-FLDS.
024900
011400 100-ZERO-TABLE.
011500     MOVE 1 TO X.
011600
011700 105-LOOP.
011800     MOVE ZEROES TO T-QTY-DLVR (X), T-QTY-STORED (X).
011900     MOVE SPACES TO T-DATE-RCV-CN (X), T-DATE-STORED-CN (X).
012000     ADD 1 TO X.
012100     IF X > 1000
012200        GO TO 199-EXIT
012300     ELSE
012400        GO TO 105-LOOP.
012500 199-EXIT.  EXIT.
012600
012700 200-READ-MPORCV.
           PERFORM 9999-DBGET2-MPORCV-PO-O.
013000     IF NOT GOOD-CALL
013010        MOVE "Y" TO DONE-YET
013100        GO TO 299-EXIT.
           IF M-PO-RCV-NO = "PIT6654 000000"
               MOVE "N" TO DONE-YET.
013200
013300     MOVE M-PO-RCV-NO TO PO-ARG.
013310
013320*----------  ONLY LOOK FOR PO NUMBERS
013400     IF PO-ARG-RS NOT = "000"
013500        GO TO 200-READ-MPORCV.
013600
013605*----------  IGNORE REQUIREMENT'S ORDERS
013606     IF PO-ARG-REL = "999"
013607        GO TO 200-READ-MPORCV.
013608
013609*----------  IGNORE HISTORY RECALLED RECORDS IF FLAG IS SET
013610     IF M-PO-RCV-SEQ = SPACES
013611        NEXT SENTENCE
013612     ELSE
013613        IF M-PO-RCV-SEQ IS ALPHABETIC
013620        IF SKIP-FLAG = "Y"
013630           GO TO 200-READ-MPORCV.
013640
      *------ GUESS WHAT? THE M-PO-LAST-RCVR MAY NOT BE CORRECT!
      *------ THE ONLY WAY TO KNOW FOR SURE IS TO CYCLE THRU
      *------ MPORCV STARTING AT THE '000' RECIEVER AND STOPPING
      *------ WHEN THE PO NUMBER CHANGES:
      *------     P14     000000
      *------     P14     000001
      *------     P14     000003 - THE REAL LAST RCVR IS 3!
           CALL "CRLSTRCV" USING BASE2, M-PO-RCV-NO, REAL-LAST-RCVR.
           IF REAL-LAST-RCVR = ZERO
               GO TO 200-READ-MPORCV.
      *------ THERE MIGHT BE A LAST RCVR AND M-PO-LAST-RCVR MIGHT STILL
      *-----  BE SPACES
           IF M-PO-LAST-RCVR NOT NUMERIC
               MOVE ZERO TO M-PO-LAST-RCVR.
           IF M-PO-LAST-RCVR NOT = REAL-LAST-RCVR AND UPDATE-FLAG = "Y"
               MOVE REAL-LAST-RCVR TO M-PO-LAST-RCVR
               PERFORM 9999-DBUPDATE-MPORCV-PO-O.

013650     MOVE M-PO-RCV-NO TO PO-RCV-ARG.
013700     MOVE 1 TO PO-RCV-ARG-RS.
013800 299-EXIT.  EXIT.
013900
014000 300-READ-DRCVITEM.
           MOVE PO-RCV-ARG TO PO-ARG-ALL.
           PERFORM 9999-DBFIND-DRCVITEM-PO-O.
      *------ THE FOLLOWING HAPPENS IF THERE IS AN MPORCV FOR THE RCVR
      *------ BUT NOT DRCVITEM.  IN THAT CASE CYCLE TO THE NEXT RCVR
      *------ SO WE CAN ADD UP THE TRUE QTY FROM RCVRS TO UPDATE
      *------ DPOITEM: FOR THESE THE RCVR MUST BE RE-CUT.
014300     IF NOT GOOD-CALL
              MOVE PO-RCV-ARG      TO  PO-ARG-ALL
              PERFORM 9999-DBGET7-MPORCV-PO-O
              IF GOOD-CALL
014301           MOVE "Y" TO NO-DRCVITEM-FLAG
                 MOVE SPACES TO WORK-STRING
                 STRING "MPORCV ENTRY ", PO-RCV-ARG, " HAD NO DRCVITEM"
                   DELIMITED BY SIZE INTO WORK-STRING
                 WRITE PRINT-REC FROM WORK-STRING AFTER ADVANCING 1
                 IF UPDATE-FLAG = "Y"
                     PERFORM 9999-DBDELETE-MPORCV-PO-O
                 END-IF
                 MOVE PO-ARG TO PO-ARG-ALL
                 PERFORM 9999-DBGET7-MPORCV-PO-O
                 GO TO 350-NEXT-RCVR
              ELSE
                 MOVE SPACES TO WORK-STRING
                 STRING "RECEIVER ", PO-RCV-ARG, " WAS SKIPPED"
                   DELIMITED BY SIZE INTO WORK-STRING
                 WRITE PRINT-REC FROM WORK-STRING AFTER ADVANCING 1
                 MOVE PO-ARG TO PO-ARG-ALL
                 PERFORM 9999-DBGET7-MPORCV-PO-O
                 GO TO 350-NEXT-RCVR.
014500
014600 305-LOOP-RCVR.
           PERFORM 9999-DBGET5-DRCVITEM-PO-O.
014900     IF END-OF-CHAIN
015000        GO TO 350-NEXT-RCVR.
015400
015410     IF RCV-ITEM-UM = "LT" OR "AS"
015420        GO TO 305-LOOP-RCVR.
           IF RCV-ITEM-NUMBER > "1000"
               GO TO 305-LOOP-RCVR.

015500     MOVE RCV-ITEM-NUMBER TO ITEM-X.
015600     ADD RCV-QTY-DLVR TO T-QTY-DLVR (ITEM-X).
015700     ADD RCV-QTY-STORED TO T-QTY-STORED (ITEM-X).
015800     MOVE RCV-DATE-RCVD-CN TO T-DATE-RCV-CN (ITEM-X).
015900     MOVE RCV-DATE-STORED-CN TO T-DATE-STORED-CN (ITEM-X).
015901
015902     GO TO 305-LOOP-RCVR.
015910
016000
016100 350-NEXT-RCVR.
016200     ADD 1 TO PO-RCV-ARG-RS.
016300     IF PO-RCV-ARG-RS > REAL-LAST-RCVR
016400        GO TO 399-EXIT.
016500
016600     GO TO 300-READ-DRCVITEM.
016700 399-EXIT.  EXIT.
016800
016900 400-UPDATE-DPOITEM.
           MOVE PO-ARG TO PO-ARG-ALL.
           PERFORM 9999-DBFIND-DPOITEM-PO-O.
017200     IF NOT GOOD-CALL
017300        GO TO 499-EXIT.
017400
017500 405-LOOP-PO.
           PERFORM 9999-DBGET5-DPOITEM-PO-O.
017800     IF END-OF-CHAIN
017900        GO TO 499-EXIT.
018300
018310     IF ITM-UM = "LT" OR "AS"
018320        GO TO 405-LOOP-PO.
018400     MOVE ITM-NUMBER TO ITEM-X.
           IF ITEM-X  > 999
              GO TO 405-LOOP-PO.
           IF ITEM-X < 1
              GO TO 405-LOOP-PO.
018401*----------  IF DATE FLAG IS YES, COMPARE DATES WITH QUANTITIES
018410     IF DATE-FLAG = "Y"
018500     IF ITM-QTY-DLVR = T-QTY-DLVR (ITEM-X)
018600        IF ITM-QTY-STORED = T-QTY-STORED (ITEM-X)
018700           IF ITM-DATE-RCVD-CN = T-DATE-RCV-CN (ITEM-X)
018800              IF ITM-DATE-STORED-CN = T-DATE-STORED-CN (ITEM-X)
018900                 GO TO 405-LOOP-PO.
018910
018920     IF DATE-FLAG NOT = "Y"
018960     IF ITM-QTY-DLVR = T-QTY-DLVR (ITEM-X)
018970        IF ITM-QTY-STORED = T-QTY-STORED (ITEM-X)
018980             GO TO 405-LOOP-PO.

           MOVE SPACES                  TO  DETAIL-LINE.
           MOVE PO-ARG                  TO  PRT-PO.
           MOVE ITEM-X                  TO  PRT-ITEM.
           MOVE ITM-QTY-DLVR            TO  PRT-PO-DLV.
           MOVE ITM-DATE-RCVD           TO  PRT-PO-DLV-DATE.
           MOVE T-QTY-DLVR (ITEM-X)     TO  PRT-RCV-DLV.
           MOVE T-DATE-RCV (ITEM-X)     TO  PRT-RCV-DLV-DATE.
           MOVE ITM-QTY-STORED          TO  PRT-PO-STR.
           MOVE ITM-DATE-STORED         TO  PRT-PO-STR-DATE.
           MOVE T-QTY-DLVR (ITEM-X)     TO  PRT-RCV-STR.
           MOVE T-DATE-STORED (ITEM-X)  TO  PRT-RCV-STR-DATE.
           MOVE ITM-CORP-CODE           TO  PRT-CORP-CODE.
           IF NO-DRCVITEM-FLAG = "Y"
               MOVE "NO DRCVITEM"       TO  PRT-NO-DRCVITEM.
           WRITE PRINT-REC FROM DETAIL-LINE AFTER ADVANCING 1.
           IF ITM-QTY-DLVR > T-QTY-DLVR (ITEM-X)
               SUBTRACT T-QTY-DLVR (ITEM-X) FROM ITM-QTY-DLVR
                 GIVING QTY-TO-RCV
               MOVE QTY-TO-RCV TO PRT-QTY-TO-RCV
               WRITE PRINT-REC FROM QTY-TO-RCV-LINE AFTER ADVANCING 1.
020100
020200     IF UPDATE-FLAG NOT = "Y"
020300        GO TO 405-LOOP-PO.
020400
020410     IF ITEM-X > 1000
020420        DISPLAY "%%%%%%%%%%%%%%%%%%%%%%%  ITEM NUMBER = ",
020430           ITEM-X, "  PO = ", PO-ARG, " --- CANNOT CHANGE ",
020440           "ITEMS OVER 1000"
020450        GO TO 405-LOOP-PO.
020460
           IF UPDATE-COUNT >= NUM-OF-UPDATES
               GO TO 405-LOOP-PO.

           ADD 1 TO UPDATE-COUNT.

020500     MOVE T-QTY-DLVR (ITEM-X) TO ITM-QTY-DLVR.
020600     MOVE T-QTY-STORED (ITEM-X) TO ITM-QTY-STORED.
020610     IF DATE-FLAG = "Y"
020700        MOVE T-DATE-RCV-CN (ITEM-X) TO ITM-DATE-RCVD-CN
020800        MOVE T-DATE-STORED-CN (ITEM-X) TO ITM-DATE-STORED-CN.
020900
           PERFORM 9931-LOCK-DPOITEM.
           PERFORM 9999-DBUPDATE-DPOITEM-PO-O.
           PERFORM 9940-UNLOCK.
022000
022600     GO TO 405-LOOP-PO.
022700 499-EXIT.  EXIT.
022800
       9930-LOCK.
       9931-LOCK-DPOITEM.
       9932-LOCK-DRCVITEM.
       9940-UNLOCK.
       9999-DBGET2-MPORCV-PO-O.
           MOVE 0 TO COND-WORD.
           READ MPORCV-PO-O NEXT INTO BUF-MPORCV
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1" OR FILE-STATUS = "46"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET2 ERR 9999-DBGET2-MPORCV-PO-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-INIT-MPORCV-PO-O.
           MOVE SPACES TO PORCVNO OF MPORCV-PO-REC-O.
           START MPORCV-PO-O KEY >= PORCVNO OF MPORCV-PO-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-DBGET7-MPORCV-PO-O.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG-ALL TO PORCVNO OF MPORCV-PO-REC-O.
           READ MPORCV-PO-O INTO BUF-MPORCV
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET7 ERR 9999-DBGET7-MPORCV-PO-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-RESET-MPORCV-PO-O.
           MOVE HIGH-VALUES TO PORCVNO OF MPORCV-PO-REC-O.
           START MPORCV-PO-O KEY > PORCVNO OF MPORCV-PO-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-DBDELETE-MPORCV-PO-O.
           MOVE 0 TO COND-WORD.
           DELETE MPORCV-PO-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBDELETE ERR 9999-DBDELETE-MPORCV-PO-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBUPDATE-MPORCV-PO-O.
           MOVE 0 TO COND-WORD.
           REWRITE MPORCV-PO-REC-O FROM BUF-MPORCV
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBUPDATE ERR 9999-DBUPDATE-MPORCV-PO-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBFIND-DRCVITEM-PO-O.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG-ALL TO PORCVNO OF DRCVITEM-PO-REC-O.
           START DRCVITEM-PO-O KEY = PORCVNO OF DRCVITEM-PO-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "DBFIND ERR 9999-DBFIND-DRCVITEM-PO-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBGET5-DRCVITEM-PO-O.
           MOVE 0 TO COND-WORD.
           READ DRCVITEM-PO-O NEXT INTO BUF-DRCVITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DRCVITEM-PO-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DRCVITEM-PO-O"
                       TO BU-MSG-AREA
                   MOVE 99 TO COND-WORD
                   PERFORM 2100-BLOWUP
           ELSE
           IF PORCVNO OF DRCVITEM-PO-REC-O NOT = PO-ARG-ALL
               PERFORM 9999-RESET-DRCVITEM-PO-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DRCVITEM-PO-O.
           MOVE HIGH-VALUES TO PORCVNO OF DRCVITEM-PO-REC-O.
           START DRCVITEM-PO-O KEY > PORCVNO OF DRCVITEM-PO-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-DBFIND-DPOITEM-PO-O.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG-ALL TO PORCVNO OF DPOITEM-PO-REC-O.
           START DPOITEM-PO-O KEY = PORCVNO OF DPOITEM-PO-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DPOITEM-PO-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBGET5-DPOITEM-PO-O.
           MOVE 0 TO COND-WORD.
           READ DPOITEM-PO-O NEXT INTO BUF-DPOITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DPOITEM-PO-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DPOITEM-PO-O"
                       TO BU-MSG-AREA
                   MOVE 99 TO COND-WORD
                   PERFORM 2100-BLOWUP
           ELSE
           IF PORCVNO OF DPOITEM-PO-REC-O NOT = PO-ARG-ALL
               PERFORM 9999-RESET-DPOITEM-PO-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DPOITEM-PO-O.
           MOVE HIGH-VALUES TO PORCVNO OF DPOITEM-PO-REC-O.
           START DPOITEM-PO-O KEY > PORCVNO OF DPOITEM-PO-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-DBUPDATE-DPOITEM-PO-O.
           MOVE 0 TO COND-WORD.
           REWRITE DPOITEM-PO-REC-O FROM BUF-DPOITEM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBUPDATE ERR 9999-DBUPDATE-DPOITEM-PO-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBPUT-DRCVITEM-PO-O.
           MOVE 0 TO COND-WORD.
           WRITE DRCVITEM-PO-REC-O FROM BUF-DRCVITEM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBPUT ERR 9999-DBPUT-DRCVITEM-PO-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-OPEN-STUFF.
           OPEN I-O   MPORCV-PO-O          .
           OPEN I-O   DRCVITEM-PO-O        .
           OPEN I-O   DPOITEM-PO-O         .

       9999-CLOSE-STUFF.
           CLOSE      MPORCV-PO-O          .
           CLOSE      DRCVITEM-PO-O        .
           CLOSE      DPOITEM-PO-O         .
