       IDENTIFICATION DIVISION.
       PROGRAM-ID.     TACTSTUP.
       AUTHOR.         ANNETTE M. TREUDLER.
       DATE-WRITTEN.   DECEMBER 15 1987.
      *REMARKS.
      **************************************************************
      *                                                            *
      *D   TACTSTUP           ACCOUNTING SETUP MAIN PROGRAM        *
      *                                                            *
      *C   09/04/1996    CA YODER                                  *
      *C     MODIFIED PROGRAM FOR CENTURY DATABASE CHANGES.        *
      **************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZACTSTUP-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.
           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT MREPORT-I
                  ASSIGN TO DATABASE-MCFLCA0401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT MREPORT-O
                  ASSIGN TO DATABASE-MCFLCA0401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT MLEDGER-I
                  ASSIGN TO DATABASE-MCFLCA0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT MLEDGER-O
                  ASSIGN TO DATABASE-MCFLCA0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT MATLACCUM-I
                  ASSIGN TO DATABASE-MCFLCA0601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT MATLACCUM-O
                  ASSIGN TO DATABASE-MCFLCA0601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT MACCTINFO-I
                  ASSIGN TO DATABASE-MCFLCA0101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT MACCTINFO-O
                  ASSIGN TO DATABASE-MCFLCA0101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT MCHTACCTS-I
                  ASSIGN TO DATABASE-MCFLCA0301
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT MCHTACCTS-O
                  ASSIGN TO DATABASE-MCFLCA0301
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT MCLASS-I
                  ASSIGN TO DATABASE-MCFLCS4901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT MCLASS-O
                  ASSIGN TO DATABASE-MCFLCS4901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).
       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.
       FD  MREPORT-I
           LABEL RECORDS ARE STANDARD.
       01  MREPORT-REC-I.
           COPY DDS-MCRPCA0400  OF MCFLCA0401.
       FD  MREPORT-O
           LABEL RECORDS ARE STANDARD.
       01  MREPORT-REC-O.
           COPY DDS-MCRPCA0400  OF MCFLCA0401.
       FD  MLEDGER-I
           LABEL RECORDS ARE STANDARD.
       01  MLEDGER-REC-I.
           COPY DDS-MCRPCA0500  OF MCFLCA0501.
       FD  MLEDGER-O
           LABEL RECORDS ARE STANDARD.
       01  MLEDGER-REC-O.
           COPY DDS-MCRPCA0500  OF MCFLCA0501.
       FD  MATLACCUM-I
           LABEL RECORDS ARE STANDARD.
       01  MATLACCUM-REC-I.
           COPY DDS-MCRPCA0600  OF MCFLCA0601.
       FD  MATLACCUM-O
           LABEL RECORDS ARE STANDARD.
       01  MATLACCUM-REC-O.
           COPY DDS-MCRPCA0600  OF MCFLCA0601.
       FD  MACCTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MACCTINFO-REC-I.
           COPY DDS-MCRPCA0100  OF MCFLCA0101.
       FD  MACCTINFO-O
           LABEL RECORDS ARE STANDARD.
       01  MACCTINFO-REC-O.
           COPY DDS-MCRPCA0100  OF MCFLCA0101.
       FD  MCHTACCTS-I
           LABEL RECORDS ARE STANDARD.
       01  MCHTACCTS-REC-I.
           COPY DDS-MCRPCA0300  OF MCFLCA0301.
       FD  MCHTACCTS-O
           LABEL RECORDS ARE STANDARD.
       01  MCHTACCTS-REC-O.
           COPY DDS-MCRPCA0300  OF MCFLCA0301.
       FD  MCLASS-I
           LABEL RECORDS ARE STANDARD.
       01  MCLASS-REC-I.
           COPY DDS-MCRPCS4900  OF MCFLCS4901.
       FD  MCLASS-O
           LABEL RECORDS ARE STANDARD.
       01  MCLASS-REC-O.
           COPY DDS-MCRPCS4900  OF MCFLCS4901.

       WORKING-STORAGE SECTION.
       01  MODIFY-STRM-SW                PIC X(1)  VALUE "N".
           88  MODIFY-STRM-DISALLOWED              VALUE "Y".

       01  WDWN-SW                       PIC X(1)  VALUE "N".
           88  WDWN-CLASS-FOUND                    VALUE "Y".
           88  WDWN-CLASS-NOT-FOUND                VALUE "N".

       01  SAVE-AREA-VAR-DEPTS.
           05  SAVE-RUBBER-DEPT          PIC X(4)  VALUE SPACES.
           05  SAVE-RUBBER-DATE          PIC X(6)  VALUE SPACES.
           05  SAVE-FABRIC-DEPT          PIC X(4)  VALUE SPACES.
           05  SAVE-FABRIC-DATE          PIC X(6)  VALUE SPACES.
           05  SAVE-ALL-OTHER-DEPT       PIC X(4)  VALUE SPACES.
           05  SAVE-ALL-OTHER-DATE       PIC X(6)  VALUE SPACES.

       01  SAVE-AREA-WDWN.
           05  SAVE-WDWN-CLASS OCCURS 10 TIMES
                INDEXED BY WDWN-INDEX
                                         PIC X(3).
       01  INDEX-AREA.
           05  INDX                      PIC 9(2)  VALUE 1.
           05  INDX2                     PIC 9(2)  VALUE 1.
           05  INDX3                     PIC 9(2)  VALUE 1.
           05  RPT-SUB                   PIC 9(2)  VALUE 0.
           05  LEDGER-SUB                PIC 9(2)  VALUE 0.
           05  INTR-SUB                  PIC 9(2)  VALUE 0.

       01  DATE-CHECK.
           05  DATE-CHECK-YY             PIC X(2).
           05  DATE-CHECK-MM             PIC X(2).
           05  DATE-CHECK-DD             PIC X(2).

      *************************************************************
      *************************************************************
      **                                                         **
      **              D A T A    B A S E    A R E A              **
      **                                                         **
      *************************************************************
      *************************************************************

       COPY DBCSACCT   IN COPYLIB.
       COPY DATAB      IN COPYLIB.
       01  DSET-MACCTINFO            PIC X(16)  VALUE "MACCOUNT-INFO;".
       01  DSET-MCHTACCTS            PIC X(16)  VALUE "MCHT-ACCTS;".
       01  DSET-MCLASS               PIC X(16)  VALUE "MCLASS;".
       01  DSET-MLEDGER              PIC X(16)  VALUE "MLEDGER;".
       01  DSET-MREPORT              PIC X(16)  VALUE "MREPORT;".
       01  DSET-MATLACCUM            PIC X(16)  VALUE "MMATL-ACCUM;".
       01  DSET-MPLTINFO             PIC X(16)  VALUE "MPLTINFO;".
       01  DSET-NAME                 PIC X(16)  VALUE SPACES.
       01  DEPT-ARG                  PIC X(6)   VALUE SPACES.
       01  CLASS-ARG                 PIC X(4)   VALUE SPACES.
       01  CODE-ARG.
           05  FILLER                PIC X(4)   VALUE "ACCR".
           05  CODE-ARG-CLASS        PIC X(4)   VALUE SPACES.
       01  PLT-ARG                   PIC X(4)   VALUE "P 01".
       01  ALL-ITEMS                 PIC X(2)   VALUE "@;".

       COPY MACTINFO   IN COPYLIB.

       COPY MCHTACCT   IN COPYLIB.

       COPY MCLASS     IN COPYLIB.

       COPY MLEDGER    IN COPYLIB.

       COPY MREPORT    IN COPYLIB.

       COPY MATLACUM   IN COPYLIB.

       COPY MPLTINFO   IN COPYLIB.

       COPY VCOMAREA   IN COPYLIB.

       01  FORMFILE.
           05  FORM-FNAME                PIC X(8)  VALUE "FACTSTUP".
           05  FILLER                    PIC X(1)  VALUE ".".
           05  FORM-GNAME.
               10  FORM-GNAME1           PIC X(5)  VALUE "FLANG".
               10  FORM-GNAME2           PIC X(3)  VALUE SPACES.
           05  FILLER                    PIC X(19) VALUE SPACES.

       01  MESSAGE-BUFFER.
           05  MSG-TEXT                  PIC X(64) VALUE SPACES.
           05  MSG-FLD                   PIC X(12) VALUE SPACES.
           05  MSG-FLD-9 REDEFINES MSG-FLD
                                         PIC Z(11)9.

       01  MESSAGE-BUFLEN                PIC S9(4)  COMP-4 VALUE 76.
       01  MESSAGE-ACTLEN                PIC S9(4)  COMP-4 VALUE 76.
       01  FIELD-NUMBER                  PIC S9(4)  COMP-4 VALUE 1.

       01  FILE-STATUS.
           05  FILE-STATUS-1          PIC X(1)   VALUE SPACES.
           05  FILE-STATUS-2          PIC X(1)   VALUE SPACES.
       01  COMMAND-AREA.
           05  OVERRIDE-ZACTSTUP     PIC X(34)    VALUE
               "OVRDSPF FILE(ZACTSTUP) SHARE(*YES)".
           05  OVERRIDE-PARM2        PIC S9(10)V9(5) COMP-3 VALUE 34.
      *************************************************************
      *************************************************************
      **                                                         **
      **                 TERMINAL I/O DATA AREA                  **
      **                                                         **
      *************************************************************
      *************************************************************

       01  MAIN-MENU-SCREEN.
           05  WRITE-DOWN-CLASS          PIC X(1).
           05  STOREROOM-DEPT            PIC X(1).
           05  RM-VARIANCE-DEPT          PIC X(1).
           05  IT-DEPT                   PIC X(1).
           05  CUTOFF-DATE-TIME          PIC X(1).
           05  CURRENT-ACTG-MONTH        PIC X(1).
           05  STORE-ROOM-ACCT           PIC X(1).
           05  MM-CMDLINE                PIC X(79).
           05  MM-MSGLINE                PIC X(79).

       01  WDWN-CLASS-SCREEN.
           05  WDWN-CLASS-ARRAY          PIC X(30).
           05  WDWN-CLASS-RDF REDEFINES WDWN-CLASS-ARRAY.
               10  WDWN-CLASS-DISPLAY    OCCURS 10 TIMES
                                         PIC X(3).
           05  WDWN-MOD-DATE             PIC X(6).
           05  WDWN-CLASS-ENTRY OCCURS 4 TIMES.
               10  WDWN-CLASS-CODE       PIC X(3).
               10  WDWN-CLASS-FUNC       PIC X(1).
           05  WDWN-MSG                  PIC X(79).
           05  WDWN-CMDLINE              PIC X(79).
           05  WDWN-MSGLINE              PIC X(79).

       01  STRMDEPT-SCREEN.
           05  STRMDEPT-NO               PIC X(4).
           05  STRMDEPT-MSG              PIC X(79).
           05  STRMDEPT-CMDLINE          PIC X(79).
           05  STRMDEPT-MSGLINE          PIC X(79).

       01  RM-VAR-DEPT-SCREEN.
           05  RUBBER-VAR-DEPT           PIC X(4).
           05  RUBBER-MOD-DATE           PIC X(6).
           05  FABRIC-VAR-DEPT           PIC X(4).
           05  FABRIC-MOD-DATE           PIC X(6).
           05  ALL-OTHER-VAR-DEPT        PIC X(4).
           05  ALL-OTHER-MOD-DATE        PIC X(6).
           05  RMTL-MSG                  PIC X(79).
           05  RMTL-CMDLINE              PIC X(79).
           05  RMTL-MSGLINE              PIC X(79).

       01  IT-DEPT-SCREEN.
           05  IT-DEPT1                  PIC X(4).
           05  IT-DEPT2                  PIC X(4).
           05  IT-MSG                    PIC X(78).
           05  IT-CMDLINE                PIC X(79).
           05  IT-MSGLINE                PIC X(79).

       01  CLS-DATE-TIME-SCREEN.
           05  CLS-DATE.
               10  CLS-DATE-YY           PIC X(2).
               10  CLS-DATE-MM           PIC X(2).
               10  CLS-DATE-DD           PIC X(2).
           05  CLS-TIME.
               10  CLS-TIME-HH           PIC X(2).
               10  CLS-TIME-MM           PIC X(2).
               10  CLS-TIME-SS           PIC X(2).
           05  CLS-DATE-TIME-MSG         PIC X(79).
           05  CLS-CMDLINE               PIC X(79).
           05  CLS-MSGLINE               PIC X(79).

       01  HOLD-DATE-YMD-OUT-CN.
           05  HOLD-DATE-CC              PIC X(2).
           05  HOLD-DATE-YMD-OUT.
               10  HOLD-DATE-YY          PIC X(2).
               10  HOLD-DATE-MM          PIC X(2).
               10  HOLD-DATE-DD          PIC X(2).

       01  HOLD-CLS-DATE-CN.
           05  HOLD-CLS-DATE-CC          PIC X(2).
           05  HOLD-CLS-DATE.
               10  HOLD-CLS-DATE-YY      PIC X(2).
               10  HOLD-CLS-DATE-MM      PIC X(2).
               10  HOLD-CLS-DATE-DD      PIC X(2).

       01  CURRENT-MONTH-SCREEN.
           05  CURR-ACTG-MONTH           PIC X(2).
           05  CURR-ACTG-YEAR            PIC X(2).
           05  CURR-MONTH-MSG            PIC X(79).
           05  CURR-CMDLINE              PIC X(79).
           05  CURR-MSGLINE              PIC X(79).

       01  STORE-ROOM-ACCT-SCRN.
           05  STROOM-ACCT-NO-9          PIC 9(6).
           05  STROOM-ACCT-NO  REDEFINES STROOM-ACCT-NO-9  PIC X(6).
           05  STROOM-CMDLINE            PIC X(79).
           05  STROOM-MSGLINE            PIC X(79).


      ***************************************************************
      **             I N I T I A L   L O A D   A R E A             **
      ***************************************************************
       01  MREPORT-TABLE.
           05  FILLER  PIC X(2)  VALUE "01".
           05  FILLER  PIC X(60) VALUE "VOUCHER 21                    ".
           05  FILLER  PIC X(2)  VALUE "02".
           05  FILLER  PIC X(60) VALUE "VOUCHER 24                    ".
           05  FILLER  PIC X(2)  VALUE "04".
           05  FILLER  PIC X(60) VALUE "STORES MATERIAL TO N.W.O.     ".
           05  FILLER  PIC X(2)  VALUE "05".
           05  FILLER  PIC X(60) VALUE "ENGINEERING MATERIAL CHARGES  ".
           05  FILLER  PIC X(2)  VALUE "06".
           05  FILLER  PIC X(60) VALUE "DIRECT CHARGES TO N.W.O.      ".

       01  MREPORT-ENTRIES     REDEFINES   MREPORT-TABLE.
           05  MREPORT-ENTRY  OCCURS  5  TIMES.
               10  MRPT-KEY            PIC X(2).
               10  MRPT-DATA           PIC X(60).

       01  MLEDGER-TABLE.
           05  FILLER  PIC X(4)  VALUE "00  ".
           05  FILLER  PIC X(60) VALUE "DEFAULT LEDGER                ".
           05  FILLER  PIC X(4)  VALUE "01  ".
           05  FILLER  PIC X(60) VALUE "GENERAL LEDGER                ".
           05  FILLER  PIC X(4)  VALUE "02  ".
           05  FILLER  PIC X(60) VALUE "STORES LEDGER                 ".
           05  FILLER  PIC X(4)  VALUE "03  ".
           05  FILLER  PIC X(60) VALUE "GENERAL EXPENSE LEDGER        ".
           05  FILLER  PIC X(4)  VALUE "04  ".
           05  FILLER  PIC X(60) VALUE "DISTRIBUTED EXPENSE LEDGER    ".
           05  FILLER  PIC X(4)  VALUE "05  ".
           05  FILLER  PIC X(60) VALUE "ENGINEERING EXPENSE LEDGER    ".
           05  FILLER  PIC X(4)  VALUE "06  ".
           05  FILLER  PIC X(60) VALUE "MANUFACTURING EXPENSE LEDGER  ".
           05  FILLER  PIC X(4)  VALUE "07  ".
           05  FILLER  PIC X(60) VALUE "PROCESS LEDGER                ".
           05  FILLER  PIC X(4)  VALUE "08  ".
           05  FILLER  PIC X(60) VALUE "MISCELLANEOUS EXPENSE LEDGER  ".

       01  MLEDGER-ENTRIES REDEFINES MLEDGER-TABLE.
           05  MLEDGER-ENTRY OCCURS 9 TIMES.
               10  MLEDGER-KEY           PIC X(4).
               10  MLEDGER-DESC          PIC X(60).

       01  MATLACCUM-TABLE.
           05  FILLER  PIC X(8)  VALUE "INTR197 ".
           05  FILLER  PIC X(8)  VALUE "INTR198 ".
           05  FILLER  PIC X(8)  VALUE "INTR297 ".
           05  FILLER  PIC X(8)  VALUE "INTR347 ".
           05  FILLER  PIC X(8)  VALUE "INTR397 ".

       01  MATLACCUM-INTR-ENTRIES REDEFINES MATLACCUM-TABLE.
           05  MATLACCUM-ENTRY OCCURS 5 TIMES.
               10  MATLACCUM-INTR        PIC X(4).
               10  MATLACCUM-CLASS       PIC X(4).

      *************************************************************
      *************************************************************
      **                                                         **
      **                 COMMUNICATIONS AREAS                    **
      **                                                         **
      *************************************************************
      *************************************************************
       01  PASSED-SPOOL-PRT              PIC S9(2) COMP-4 VALUE 0.

       COPY TBLOWUP    IN COPYLIB.

       COPY LANGUAGE   IN COPYLIB.

       COPY TDATECHK   IN COPYLIB.

       COPY CATREAD    IN COPYLIB.

       COPY DISPDATA   IN COPYLIB.

       COPY IOFEEDBACK IN COPYLIB.

      *************************************************************
      **#########################################################**
      *************************************************************
      **                                                         **
      **          P R O C E D U R E    D I V I S I O N           **
      **                                                         **
      *************************************************************
      **#########################################################**
      *************************************************************

       PROCEDURE DIVISION.

       MAIN-PGM SECTION 01.

       BEGIN-HERE.
           PERFORM 1-HSK           THRU 1-HSK-X.
           PERFORM 3-INITIAL-LOADS THRU 3-INITIAL-LOADS-X.
           PERFORM 6-MAIN          THRU 6-MAIN-X.
           PERFORM 2-EOJ           THRU 2-EOJ-X.
           GOBACK.

       1-HSK.
           MOVE "TACTSTUP" TO BU-PGM-NAME.
           CALL "QCMDEXC" USING OVERRIDE-ZACTSTUP, OVERRIDE-PARM2.
           OPEN I-O DISPLAY-FILE, MATLACCUM-O, MACCTINFO-O,
                    MCHTACCTS-O, MLEDGER-O, MREPORT-O.
           OPEN INPUT MREPORT-I, MLEDGER-I, MCLASS-I, MPLTINFO-I,
                      MATLACCUM-I, MACCTINFO-I, MCHTACCTS-I.
           MOVE "1"                      TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.

       1-HSK-X.
           EXIT.

       2-EOJ.
           CLOSE  DISPLAY-FILE, MATLACCUM-O, MACCTINFO-O,
                  MCHTACCTS-O, MLEDGER-O, MREPORT-O.
           CLOSE  MREPORT-I, MLEDGER-I, MCLASS-I, MPLTINFO-I
                  MATLACCUM-I, MACCTINFO-I, MCHTACCTS-I.
       2-EOJ-X.
           EXIT.

      ******************************************************
      **                 BLOWUP ROUTINE                   **
      ******************************************************

       2-BLOWUP.
           CALL "TBLOWUP" USING ACCTG-BASE, BU-PGM-NAME, STATUS-AREA,
                 VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                 BU-DISPLAY-AREA.

      ******************************************************
      **              INITIAL DATABASE LOADS              **
      ******************************************************

       3-INITIAL-LOADS.
           PERFORM 31-LOAD-MREPORT-SEG        THRU 31-L-MR-EXIT.
           PERFORM 32-LOAD-MLEDGER-SEG        THRU 32-L-ML-EXIT.
      * COMMENTED OUT 1/90 - NO LONGER ACCUMALATING INTRANSIT
      * IN MATLACCUM INTRXXX KEYS.
      *    PERFORM 36-LOAD-INTR-CLASS-SEG     THRU 36-L-IC-EXIT.

           MOVE "PLT"                    TO DEPT-ARG.
           PERFORM 9-GET-MACCTINFO.
           IF NO-ENTRY
               MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I
               READ MPLTINFO-I INTO BUF-MPLTINFO
                  INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS NOT = "00"
                   MOVE "GET MPLTINFO - ERROR 3-INITIAL-LOADS"
                                         TO BU-DISPLAY-MSG
                   MOVE PLT-ARG          TO BU-DISPLAY-FLD (1)
               ELSE
                   MOVE SPACES           TO BUF-MACCT-INFO
                   MOVE "PLT"            TO MACCT-INFO-KEY
                   MOVE MPLTINFO-COMPANY TO MACCT-PLT-CODE
                   MOVE MPLTINFO-TERR    TO MACCT-TERR-CODE
                   PERFORM 9-PUT-MACCTINFO.

           MOVE SPACES               TO BUF-MCHTACCTS.
           MOVE "0000  "             TO MCHT-DEPT.
           MOVE "0000"               TO MCHT-LEDGERT.
           MOVE "DEFAULT DEPARTMENT" TO MCHT-DESC.
           MOVE "ME"                 TO MCHT-DEPT-TYPE.
           PERFORM 9-PUT-MCHTACCTS.

       3-INITIAL-LOADS-X.
           EXIT.

       31-LOAD-MREPORT-SEG.
           ADD          1                TO RPT-SUB.
           MOVE SPACES                   TO BUF-MREPORT.
           MOVE MRPT-KEY  (RPT-SUB)      TO MREPORT-CODE.
           MOVE MRPT-DATA (RPT-SUB)      TO MREPORT-DESC.
           WRITE MREPORT-REC-O FROM BUF-MREPORT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00" OR FILE-STATUS-1 = "2"
               NEXT SENTENCE
           ELSE
               MOVE "PUT MREPORT ERROR IN 31-LOAD-MREPORT-SEG"
                   TO BU-DISPLAY-MSG
               MOVE MRPT-KEY (RPT-SUB) TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

           IF RPT-SUB < 5
               GO TO 31-LOAD-MREPORT-SEG.

       31-L-MR-EXIT.
           EXIT.


       32-LOAD-MLEDGER-SEG.
           ADD          1                TO LEDGER-SUB.
           MOVE SPACES                   TO BUF-MLEDGER.
           MOVE MLEDGER-KEY (LEDGER-SUB) TO MLEDGER-CODE.
           MOVE MLEDGER-DESC (LEDGER-SUB) TO MLEDGER-DESCR.
           WRITE MLEDGER-REC-O FROM BUF-MLEDGER
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS  = "00" OR FILE-STATUS-1 = "2"
               NEXT SENTENCE
           ELSE
               MOVE "PUT MREPORT ERROR IN 31-LOAD-MREPORT-SEG"
                   TO BU-DISPLAY-MSG
               MOVE MRPT-KEY (RPT-SUB) TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

           IF LEDGER-SUB < 9
               GO TO 32-LOAD-MLEDGER-SEG.

       32-L-ML-EXIT.
           EXIT.

       36-LOAD-INTR-CLASS-SEG.
           ADD  1                        TO INTR-SUB.
           MOVE SPACES                   TO BUF-MATLACUM.
           MOVE MATLACCUM-ENTRY (INTR-SUB)  TO MATL-STORES-CODE.
           MOVE MATLACCUM-CLASS (INTR-SUB)  TO MATL-CLASS.

       36-SET-UP-MATLACCUM-BUFFER.
           MOVE ZEROS                    TO MATL-BEG-BAL-DOLLARS,
                                            MATL-BEG-BAL-UNITS,
                                            MATL-INV-DOLLARS,
                                            MATL-RCPT-UNITS,
                                            MATL-ISSUE-UNITS,
                                            MATL-RTN-UNITS,
                                            MATL-ADJ-UNITS,
                                            MATL-RTN-DOLLARS,
                                            MATL-RCPT-DOLLARS,
                                            MATL-UNITS-RCVD-NOT-INV,
                                            MATL-INV-DOL-NOT-RCVD,
                                            MATL-UNITS-INV-NOT-RCVD,
                                            MATL-INTRANSIT-DOLLARS,
                                            MATL-ACCTG-UNIT-CORR,
                                            MATL-ACCTG-DOLLAR-CORR,
                                            MATL-INTRANSIT-UNITS,
                                            MATL-WDOWN-PERC,
                                            MATL-TOT-ISS-DOLLARS,
                                            MATL-TOT-ADJ-DOLLARS,
                                            MATL-RTNVAL-UNITS,
                                            MATL-RTNVAL-DOLLARS.
           MOVE "EA"                     TO MATL-UNIT-MEASURE.

       36-PUT-MATLACCUM-BUFFER.
           WRITE MATLACCUM-REC-O FROM BUF-MATLACUM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00" OR FILE-STATUS-1 = "2"
               NEXT SENTENCE
           ELSE
               MOVE "PUT MATLACCUM  ERROR IN 36-PUT-MATLACCUM-BUFFER"
                   TO BU-DISPLAY-MSG
               MOVE MATL-STORES-CODE     TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

       36-CONTINUE.
           IF INTR-SUB < 5
               GO TO 36-LOAD-INTR-CLASS-SEG.

           MOVE "NON-STR"                TO MATL-STORES-CODE.
           MOVE "000"                    TO MATL-CLASS.
           PERFORM 36-SET-UP-MATLACCUM-BUFFER.
           PERFORM 36-PUT-MATLACCUM-BUFFER.

       36-L-IC-EXIT.
           EXIT.

       4-PGM-ERROR.
           MOVE B"1" TO IND(99), IND(FIELD-NUMBER).
       4-PGM-ERROR-X.
           EXIT.


      **************************************************
      *                                                *
      *                  6 - M A I N                   *
      *                                                *
      **************************************************

       6-MAIN.
           MOVE "MAINMENU" TO VIEW-NFNAME.
           MOVE SPACES TO MAIN-MENU-SCREEN.

       6-MAIN-SHOW-FORM.
           MOVE MAIN-MENU-SCREEN TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC      TO MAIN-MENU-SCREEN.

       6-MAIN-READ-FIELDS.
           IF VIEW-LASTKEY = 3
               GO TO 6-MAIN-X.
           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE B"1" TO IND(99)
               MOVE MESSAGE-BUFFER TO MM-MSGLINE
               GO TO 6-MAIN-SHOW-FORM.

       6-GET-BUFFER.
           IF WRITE-DOWN-CLASS = "X"
               PERFORM 71-WD-CLASS        THRU 71-WD-CLASS-X
           ELSE
           IF STOREROOM-DEPT = "X"
               PERFORM 72-STRMDEPT        THRU 72-STRMDEPT-X
           ELSE
           IF RM-VARIANCE-DEPT = "X"
               PERFORM 73-RM-VAR-DEPT     THRU 73-RM-VAR-DEPT-X
           ELSE
           IF IT-DEPT = "X"
               PERFORM 76-IT-DEPT         THRU 76-IT-DEPT-X
           ELSE
           IF CUTOFF-DATE-TIME = "X"
               PERFORM 74-CUTOFF-DATA     THRU 74-CUTOFF-DATA-X
           ELSE
           IF CURRENT-ACTG-MONTH = "X"
               PERFORM 75-CURR-ACTG-MONTH THRU 75-CURR-ACTG-MONTH-X
           ELSE
           IF STORE-ROOM-ACCT = "X"
               PERFORM 77-STORE-ROOM-ACCT THRU 77-STORE-ROOM-ACCT-X.
           GO TO 6-MAIN.

       6-MAIN-X.
           EXIT.

       71-WD-CLASS.
           MOVE "WDCLASSES" TO VIEW-NFNAME.

       71-PUT-BUFFER.
           MOVE SPACES TO WDWN-CLASS-SCREEN.
           MOVE "WDWN"                   TO DEPT-ARG.
           PERFORM 9-GET-MACCTINFO.
           IF GOOD-CALL
               MOVE MACCT-WDWN-CLASS (1) TO WDWN-CLASS-DISPLAY (1)
               MOVE MACCT-WDWN-CLASS (2) TO WDWN-CLASS-DISPLAY (2)
               MOVE MACCT-WDWN-CLASS (3) TO WDWN-CLASS-DISPLAY (3)
               MOVE MACCT-WDWN-CLASS (4) TO WDWN-CLASS-DISPLAY (4)
               MOVE MACCT-WDWN-CLASS (5) TO WDWN-CLASS-DISPLAY (5)
               MOVE MACCT-WDWN-CLASS (6) TO WDWN-CLASS-DISPLAY (6)
               MOVE MACCT-WDWN-CLASS (7) TO WDWN-CLASS-DISPLAY (7)
               MOVE MACCT-WDWN-CLASS (8) TO WDWN-CLASS-DISPLAY (8)
               MOVE MACCT-WDWN-CLASS (9) TO WDWN-CLASS-DISPLAY (9)
               MOVE MACCT-WDWN-CLASS (10) TO WDWN-CLASS-DISPLAY (10)
               MOVE WDWN-CLASS-ARRAY     TO SAVE-AREA-WDWN
               MOVE MACCT-WDWN-MOD-DATE  TO WDWN-MOD-DATE.

      *****  INPUT DATA ABOVE AND PRESS 'ENTER' *****
           MOVE   9 TO LANG-SETNUM.
           MOVE  20 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.

       71-SHOW-FORM.
           MOVE MESSAGE-BUFFER TO WDWN-MSG.
           MOVE WDWN-CLASS-SCREEN TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC       TO WDWN-CLASS-SCREEN.

       71-READ-FIELDS.
           IF VIEW-LASTKEY = 3
               GO TO 71-WD-CLASS-X.
           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE B"1" TO IND(99)
               MOVE MESSAGE-BUFFER TO WDWN-MSGLINE
               GO TO 71-SHOW-FORM.

           MOVE "1"                      TO INDX.

       71-DATA-EDITS.
           IF WDWN-CLASS-CODE (INDX) = SPACES
               IF INDX < 4
                   ADD  1                TO INDX
                   GO TO 71-DATA-EDITS
               ELSE
                   GO TO 71-UPDATE-WDWN-CLASS.

           IF WDWN-CLASS-FUNC (INDX) = SPACES
               MOVE "A" TO WDWN-CLASS-FUNC (INDX).
           SET WDWN-INDEX TO 1.
           MOVE "N" TO WDWN-SW.
           PERFORM 711-SEARCH-AREA-WDWN THRU 711-SAW-X.
           IF WDWN-CLASS-FUNC (INDX) = "A"
               IF WDWN-CLASS-FOUND
      **** WRITE DOWN CLASS ALREADY EXISTS - CANNOT ADD
                   MOVE  23 TO LANG-SETNUM
                   MOVE  24 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   PERFORM 711-SET-FIELD-NUMBER
                   PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
                   GO TO 71-SHOW-FORM
               ELSE
                   MOVE WDWN-CLASS-CODE (INDX) TO CLASS-ARG
                   PERFORM 9-GET-MCLASS
                   IF NOT GOOD-CALL
      *****   INVALID ACCOUNTING CLASS   *****
                       MOVE    9 TO LANG-SETNUM
                       MOVE   64 TO LANG-MSGNUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       PERFORM 711-SET-FIELD-NUMBER
                       PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
                       GO TO 71-SHOW-FORM
                   ELSE
                       NEXT SENTENCE
           ELSE
           IF WDWN-CLASS-FUNC (INDX) = "D"
               IF WDWN-CLASS-NOT-FOUND
      **** WRITE DOWN CLASS DOES NOT EXIST - CANNOT DELETE
                   MOVE  23 TO LANG-SETNUM
                   MOVE  25 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   PERFORM 711-SET-FIELD-NUMBER
                   PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
                   GO TO 71-SHOW-FORM.

           ADD  1                        TO INDX.
           IF INDX < 4
               GO TO 71-DATA-EDITS.


       71-UPDATE-WDWN-CLASS.
           MOVE "WDWN"                   TO DEPT-ARG.

           PERFORM 9-LOCK-MACCTINFO.

           MOVE  1                       TO INDX, INDX2.
           IF NO-ENTRY
               MOVE SPACES               TO BUF-MACCT-INFO
               MOVE "WDWN"               TO MACCT-INFO-KEY
               PERFORM 711-CHECK-DATA THRU 711-CD-X
               MOVE DATE-YMD-OUT         TO MACCT-WDWN-MOD-DATE
               PERFORM 9-PUT-MACCTINFO
           ELSE
               PERFORM 711-CHECK-DATA THRU 711-CD-X
               IF INDX2 = 11
      ***  CANNOT ADD WRITE DOWN CLASS - MAXIMUM OF 10 ALLOWED
                   MOVE   3 TO LANG-SETNUM
                   MOVE 171 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   PERFORM 711-SET-FIELD-NUMBER
                   PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
                   GO TO 71-SHOW-FORM
               ELSE
                   MOVE 1 TO INDX, INDX2
                   MOVE SPACES           TO MACCT-WDWN-ARRAY
                   PERFORM 714-MOVE-DATA 10 TIMES
                   MOVE DATE-YMD-OUT     TO MACCT-WDWN-MOD-DATE
                   PERFORM 9-UPDATE-MACCTINFO.

           GO TO 71-PUT-BUFFER.

       71-WD-CLASS-X.
           EXIT.

       711-SEARCH-AREA-WDWN.
           IF WDWN-INDEX > 10
               GO TO 711-SAW-X.
           IF SAVE-WDWN-CLASS (WDWN-INDEX) = WDWN-CLASS-CODE (INDX)
               MOVE "Y" TO WDWN-SW
               GO TO 711-SAW-X.
           SET WDWN-INDEX UP BY 1.
           GO TO 711-SEARCH-AREA-WDWN.

       711-SAW-X.
           EXIT.

       711-CHECK-DATA.
           IF WDWN-CLASS-CODE (INDX) > SPACES
               MOVE 1                    TO INDX2
               IF WDWN-CLASS-FUNC (INDX) = "D"
                   PERFORM 712-DELETE-CLASS  THRU 712-DC-X
               ELSE
                   PERFORM 713-ADD-CLASS     THRU 713-AC-X
                   IF INDX2 = 11
                       GO TO 711-CD-X.

           IF INDX < 4
               ADD 1   TO INDX
               GO TO 711-CHECK-DATA.

       711-CD-X.
           EXIT.

       711-SET-FIELD-NUMBER.
           IF INDX = 1
               MOVE  13                  TO FIELD-NUMBER
           ELSE
           IF INDX = 2
               MOVE  15                  TO FIELD-NUMBER
           ELSE
           IF INDX = 3
               MOVE  17                  TO FIELD-NUMBER
           ELSE
               MOVE  19                  TO FIELD-NUMBER.

       712-DELETE-CLASS.
           IF WDWN-CLASS-CODE (INDX) = SAVE-WDWN-CLASS (INDX2)
               COMPUTE INDX3 = INDX2 + 1
               PERFORM 7121-MOVE-LEFT-CLASS UNTIL INDX3 = 11
               MOVE SPACES  TO SAVE-WDWN-CLASS (10)
               GO TO 712-DC-X
           ELSE
               ADD  1                    TO INDX2
               GO TO 712-DELETE-CLASS.

       712-DC-X.
           EXIT.

       7121-MOVE-LEFT-CLASS.
           MOVE SAVE-WDWN-CLASS (INDX3)  TO SAVE-WDWN-CLASS (INDX2).
           ADD  1                        TO INDX2, INDX3.

       713-ADD-CLASS.
           IF SAVE-WDWN-CLASS (INDX2) = SPACES
               MOVE WDWN-CLASS-CODE (INDX)
                                         TO SAVE-WDWN-CLASS (INDX2)
               GO TO 713-AC-X
           ELSE
               ADD  1                    TO INDX2.

           IF INDX2 = 11
               GO TO 713-AC-X
           ELSE
               GO TO 713-ADD-CLASS.

       713-AC-X.
           EXIT.

       714-MOVE-DATA.
           IF SAVE-WDWN-CLASS (INDX) > SPACES
               MOVE SAVE-WDWN-CLASS (INDX)
                                         TO MACCT-WDWN-CLASS (INDX2)
               ADD  1                    TO INDX2.
           ADD  1                        TO INDX.


       72-STRMDEPT.
           MOVE "SDPT"                   TO DEPT-ARG.
           MOVE SPACES TO STRMDEPT-SCREEN.

           PERFORM 9-GET-MACCTINFO.

           IF GOOD-CALL
               MOVE MACCT-STR-DEPT       TO STRMDEPT-NO
               MOVE "Y"                  TO MODIFY-STRM-SW
               MOVE "STRMDEPT2"          TO VIEW-NFNAME
           ELSE
               MOVE "STRMDEPT" TO VIEW-NFNAME.


       72-PUT-WINDOW.
           MOVE SPACES TO MESSAGE-BUFFER.

       72-PUT-BUFFER.
           IF MODIFY-STRM-DISALLOWED
               MOVE "** CANNOT MODIFY AN ACTIVE STOREROOM DEPT **"
                   TO STRMDEPT-MSG
           ELSE
      *****  INPUT DATA ABOVE AND PRESS 'ENTER'  *****
               MOVE   9 TO LANG-SETNUM
               MOVE  20 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO STRMDEPT-MSG.

       72-SHOW-FORM.
           MOVE STRMDEPT-SCREEN TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC     TO STRMDEPT-SCREEN.

       72-READ-FIELDS.
           IF VIEW-LASTKEY = 3
               GO TO 72-STRMDEPT-X.
           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE B"1" TO IND(99)
               MOVE MESSAGE-BUFFER TO STRMDEPT-MSGLINE
               GO TO 72-SHOW-FORM.

           IF MODIFY-STRM-DISALLOWED
               GO TO 72-STRMDEPT-X.

       72-UPDATE-MACCTINFO.
           MOVE STRMDEPT-NO              TO DEPT-ARG.

           PERFORM 9-GET-MCHTACCTS.

           IF NOT GOOD-CALL
      *****  INVALID DEPARTMENT NUMBER   *****
               MOVE   9 TO LANG-SETNUM
               MOVE  65 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE B"1" TO IND(99), IND(1)
               MOVE MESSAGE-BUFFER TO STRMDEPT-MSGLINE
               GO TO 72-SHOW-FORM.

           MOVE SPACES                   TO BUF-MACCT-INFO.
           MOVE "SDPT"                   TO MACCT-INFO-KEY.
           MOVE STRMDEPT-NO              TO MACCT-STR-DEPT.
           PERFORM 9-PUT-MACCTINFO.

       72-STRMDEPT-X.
           EXIT.

       73-RM-VAR-DEPT.
           MOVE "RMVARDEPT" TO VIEW-NFNAME.

       73-PUT-BUFFER.
           MOVE SPACES TO RM-VAR-DEPT-SCREEN.
           MOVE "VAR"                   TO DEPT-ARG.
           PERFORM 9-GET-MACCTINFO.

           IF GOOD-CALL
               MOVE MACCT-RUBBER-VAR-DEPT TO RUBBER-VAR-DEPT
                                             SAVE-RUBBER-DEPT
               MOVE MACCT-RUBBER-MOD-DATE TO RUBBER-MOD-DATE
                                             SAVE-RUBBER-DATE
               MOVE MACCT-FABRIC-VAR-DEPT TO FABRIC-VAR-DEPT
                                             SAVE-FABRIC-DEPT
               MOVE MACCT-FABRIC-MOD-DATE TO FABRIC-MOD-DATE
                                             SAVE-FABRIC-DATE
               MOVE MACCT-ALL-OTHER-VAR-DEPT
                                          TO ALL-OTHER-VAR-DEPT
                                             SAVE-ALL-OTHER-DEPT
               MOVE MACCT-ALL-OTHER-MOD-DATE
                                          TO ALL-OTHER-MOD-DATE
                                             SAVE-ALL-OTHER-DATE.

      *****  INPUT DATA ABOVE AND PRESS 'ENTER'  *****
           MOVE   9 TO LANG-SETNUM.
           MOVE  20 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.

       73-SHOW-FORM.
           MOVE MESSAGE-BUFFER TO RMTL-MSG.
           MOVE RM-VAR-DEPT-SCREEN TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC        TO RM-VAR-DEPT-SCREEN.

       73-READ-FIELDS.
           IF VIEW-LASTKEY = 3
               GO TO 73-RM-VAR-DEPT-X.
           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE B"1" TO IND(99)
               GO TO 73-SHOW-FORM.

       73-FIELD-EDITS.
           IF RUBBER-VAR-DEPT = SPACES
      *****    VARIANCE DEPARTMENT REQUIRED  ****
               MOVE  66282  TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE B"1" TO IND(99), IND(1)
               GO TO 73-SHOW-FORM.
           IF FABRIC-VAR-DEPT = SPACES
      *****    VARIANCE DEPARTMENT REQUIRED  ****
               MOVE  66282  TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE B"1" TO IND(99), IND(3)
               GO TO 73-SHOW-FORM.
           IF ALL-OTHER-VAR-DEPT = SPACES
      *****    VARIANCE DEPARTMENT REQUIRED  ****
               MOVE  66282  TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE B"1" TO IND(99), IND(5)
               GO TO 73-SHOW-FORM.

       73-DATA-EDITS.
           IF RUBBER-VAR-DEPT NOT = SAVE-RUBBER-DEPT
               MOVE RUBBER-VAR-DEPT     TO DEPT-ARG
               PERFORM 9-GET-MCHTACCTS
               IF NOT GOOD-CALL
      *****  INVALID DEPARTMENT NUMBER   *****
                   MOVE   9 TO LANG-SETNUM
                   MOVE  65 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE   1 TO FIELD-NUMBER
                   PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
                   GO TO 73-SHOW-FORM.

           IF FABRIC-VAR-DEPT NOT = SAVE-FABRIC-DEPT
               MOVE FABRIC-VAR-DEPT     TO DEPT-ARG
               PERFORM 9-GET-MCHTACCTS
               IF NOT GOOD-CALL
      *****  INVALID DEPARMENT NUMBER  *****
                   MOVE   9 TO LANG-SETNUM
                   MOVE  65 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE   3 TO FIELD-NUMBER
                   PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
                   GO TO 73-SHOW-FORM.

           IF ALL-OTHER-VAR-DEPT NOT = SAVE-ALL-OTHER-DEPT
               MOVE ALL-OTHER-VAR-DEPT  TO DEPT-ARG
               PERFORM 9-GET-MCHTACCTS
               IF NOT GOOD-CALL
      *****  INVALID DEPARTMENT NUMBER  *****
                   MOVE   9 TO LANG-SETNUM
                   MOVE  65 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE   5 TO FIELD-NUMBER
                   PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
                   GO TO 73-SHOW-FORM.

       73-UPDATE-MACCTINFO.
           MOVE "VAR"                   TO DEPT-ARG.

           PERFORM 9-LOCK-MACCTINFO.

           IF NO-ENTRY
               MOVE SPACES              TO BUF-MACCT-INFO
               MOVE "VAR"               TO MACCT-INFO-KEY
               MOVE RUBBER-VAR-DEPT     TO MACCT-RUBBER-VAR-DEPT
               MOVE FABRIC-VAR-DEPT     TO MACCT-FABRIC-VAR-DEPT
               MOVE ALL-OTHER-VAR-DEPT  TO MACCT-ALL-OTHER-VAR-DEPT
               MOVE DATE-YMD-OUT        TO MACCT-RUBBER-MOD-DATE
                                           MACCT-FABRIC-MOD-DATE
                                           MACCT-ALL-OTHER-MOD-DATE
               PERFORM 9-PUT-MACCTINFO
               GO TO 73-RM-VAR-DEPT-X.

           IF RUBBER-VAR-DEPT NOT = SAVE-RUBBER-DEPT
               MOVE RUBBER-VAR-DEPT     TO MACCT-RUBBER-VAR-DEPT
               MOVE DATE-YMD-OUT        TO MACCT-RUBBER-MOD-DATE.

           IF FABRIC-VAR-DEPT NOT = SAVE-FABRIC-DEPT
               MOVE FABRIC-VAR-DEPT     TO MACCT-FABRIC-VAR-DEPT
               MOVE DATE-YMD-OUT        TO MACCT-FABRIC-MOD-DATE.

           IF ALL-OTHER-VAR-DEPT NOT = SAVE-ALL-OTHER-DEPT
               MOVE ALL-OTHER-VAR-DEPT  TO MACCT-ALL-OTHER-VAR-DEPT
               MOVE DATE-YMD-OUT        TO MACCT-ALL-OTHER-MOD-DATE.

           PERFORM 9-UPDATE-MACCTINFO.

       73-RM-VAR-DEPT-X.
           EXIT.

       731-VALIDATE-DEPT.
           PERFORM 9-GET-MCHTACCTS.
           IF NOT GOOD-CALL
      *****  INVALID DEPARTMENT NUMBER  *****
               MOVE   9 TO LANG-SETNUM
               MOVE  65 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE B"1" TO IND(99)
               GO TO 73-SHOW-FORM.

       74-CUTOFF-DATA.
           MOVE "CLSDATE" TO VIEW-NFNAME.

       74-PUT-BUFFER.
           MOVE SPACES TO CLS-DATE-TIME-SCREEN.
           MOVE ZEROS  TO CLS-DATE, CLS-TIME.
           MOVE "MTED"                   TO DEPT-ARG.
           PERFORM 9-GET-MACCTINFO.
           IF GOOD-CALL
               MOVE MACCT-MONTH-END-DATE TO CLS-DATE
               MOVE MACCT-MONTH-END-TIME TO CLS-TIME.

      *****   INPUT DATA ABOVE AND PRESS 'ENTER'  *****
           MOVE   9 TO LANG-SETNUM.
           MOVE  20 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.

       74-SHOW-FORM.
           MOVE MESSAGE-BUFFER TO CLS-DATE-TIME-MSG.
           MOVE CLS-DATE-TIME-SCREEN TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC          TO CLS-DATE-TIME-SCREEN.

       74-READ-FIELDS.
           IF VIEW-LASTKEY = 3
               GO TO 74-CUTOFF-DATA-X.
           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE B"1" TO IND(99)
               GO TO 74-SHOW-FORM.

       74-EDIT-DATA.
           IF CLS-TIME-HH = "24"
                MOVE "00" TO CLS-TIME-MM, CLS-TIME-SS.

      *-------------- ACCOUNT FOR CENTURY.
           MOVE CLS-DATE       TO  HOLD-CLS-DATE.
           IF HOLD-CLS-DATE-YY > "70"
               MOVE "19"             TO HOLD-CLS-DATE-CC
           ELSE
               MOVE "20"             TO HOLD-CLS-DATE-CC.

           MOVE DATE-YMD-OUT   TO  HOLD-DATE-YMD-OUT.
           IF HOLD-DATE-YY >  "70"
               MOVE "19"       TO  HOLD-DATE-CC
           ELSE
               MOVE "20"       TO  HOLD-DATE-CC.

           IF HOLD-CLS-DATE-CN > HOLD-DATE-YMD-OUT-CN
               GO TO 74-UPDATE-MACCTINFO.

           IF HOLD-CLS-DATE-CN < HOLD-DATE-YMD-OUT-CN
      *****  DATE MUST BE A FUTURE DATE   *****
               MOVE   4 TO LANG-SETNUM
               MOVE  15 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE  29 TO FIELD-NUMBER
               PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
               GO TO 74-SHOW-FORM.

           IF CLS-TIME < DATE-UNFORMATTED-TIME-OUT
      *****  TIME MUST BE A FUTURE TIME   *****
               MOVE  20 TO LANG-SETNUM
               MOVE  59 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE  26 TO FIELD-NUMBER
               PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
               GO TO 74-SHOW-FORM.

       74-UPDATE-MACCTINFO.
           MOVE "MTED"                   TO DEPT-ARG.

           PERFORM 9-LOCK-MACCTINFO.

           IF NO-ENTRY
               MOVE SPACES               TO BUF-MACCT-INFO
               MOVE "MTED"               TO MACCT-INFO-KEY
               MOVE CLS-DATE             TO MACCT-MONTH-END-DATE
               MOVE CLS-TIME             TO MACCT-MONTH-END-TIME
               PERFORM 9-PUT-MACCTINFO
           ELSE
               MOVE CLS-DATE             TO MACCT-MONTH-END-DATE
               MOVE CLS-TIME             TO MACCT-MONTH-END-TIME
               PERFORM 9-UPDATE-MACCTINFO.

       74-CUTOFF-DATA-X.
           EXIT.

       75-CURR-ACTG-MONTH.
           MOVE "CURRENT_MONTH" TO VIEW-NFNAME.

       75-PUT-BUFFER.
           MOVE SPACES TO CURRENT-MONTH-SCREEN.
           MOVE ZEROS  TO CURR-ACTG-MONTH, CURR-ACTG-YEAR.
           MOVE "MY"                     TO DEPT-ARG.
           PERFORM 9-GET-MACCTINFO.
           IF GOOD-CALL
               MOVE MACCT-MONTH          TO CURR-ACTG-MONTH
               MOVE MACCT-YEAR           TO CURR-ACTG-YEAR
           ELSE
               MOVE DATE-YMD-OUT         TO DATE-CHECK
               MOVE SPACES               TO BUF-MACCT-INFO
               MOVE "MY"                 TO MACCT-INFO-KEY
               MOVE DATE-CHECK-MM        TO MACCT-MONTH,
                                            CURR-ACTG-MONTH
               MOVE DATE-CHECK-YY        TO MACCT-YEAR,
                                            CURR-ACTG-YEAR
               PERFORM 9-LOCK-MACCTINFO
               PERFORM 9-PUT-MACCTINFO.

      *****   INPUT DATA ABOVE AND PRESS 'ENTER'  *****
           MOVE   9 TO LANG-SETNUM.
           MOVE  20 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.

       75-SHOW-FORM.
           MOVE MESSAGE-BUFFER TO CURR-MONTH-MSG.
           MOVE CURRENT-MONTH-SCREEN TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC          TO CURRENT-MONTH-SCREEN.

       75-READ-FIELDS.
           IF VIEW-LASTKEY = 3
               GO TO 75-CURR-ACTG-MONTH-X.
           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE B"1" TO IND(99)
               GO TO 75-SHOW-FORM.

       75-UPDATE-MACCTINFO.
           MOVE "MY"                     TO DEPT-ARG.

           PERFORM 9-LOCK-MACCTINFO.
           MOVE CURR-ACTG-MONTH          TO MACCT-MONTH.
           MOVE CURR-ACTG-YEAR           TO MACCT-YEAR.
           PERFORM 9-UPDATE-MACCTINFO.

       75-CURR-ACTG-MONTH-X.
           EXIT.

       76-IT-DEPT.
           MOVE "ITDEPT" TO VIEW-NFNAME.

       76-PUT-BUFFER.
           MOVE SPACES TO IT-DEPT-SCREEN.
           MOVE "IT"                    TO DEPT-ARG.
           PERFORM 9-GET-MACCTINFO.

           IF GOOD-CALL
               MOVE MACCT-IT-DEPT1       TO IT-DEPT1
               MOVE MACCT-IT-DEPT2       TO IT-DEPT2.

      *****  INPUT DATA ABOVE AND PRESS 'ENTER'  *****
           MOVE   9 TO LANG-SETNUM.
           MOVE  20 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.


       76-SHOW-FORM.
           MOVE MESSAGE-BUFFER TO IT-MSG.
           MOVE IT-DEPT-SCREEN TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC    TO IT-DEPT-SCREEN.

       76-READ-FIELDS.
           IF VIEW-LASTKEY = 3
               GO TO 76-IT-DEPT-X.
           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE B"1" TO IND(99)
               GO TO 76-SHOW-FORM.

       76-DATA-EDITS.
           IF IT-DEPT1 NOT = SPACES
               MOVE IT-DEPT1            TO DEPT-ARG
               PERFORM 9-GET-MCHTACCTS
               IF NOT GOOD-CALL
      *****  INVALID DEPARTMENT NUMBER   *****
                   MOVE   9 TO LANG-SETNUM
                   MOVE  65 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE   1 TO FIELD-NUMBER
                   PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
                   GO TO 76-SHOW-FORM.

           IF IT-DEPT2 NOT = SPACES
               MOVE IT-DEPT2            TO DEPT-ARG
               PERFORM 9-GET-MCHTACCTS
               IF NOT GOOD-CALL
      *****  INVALID DEPARMENT NUMBER  *****
                   MOVE   9 TO LANG-SETNUM
                   MOVE  65 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE   3 TO FIELD-NUMBER
                   PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
                   GO TO 76-SHOW-FORM.


       76-UPDATE-MACCTINFO.
           MOVE "IT"                    TO DEPT-ARG.

           PERFORM 9-LOCK-MACCTINFO.

           MOVE SPACES                  TO BUF-MACCT-INFO.
           MOVE "IT"                    TO MACCT-INFO-KEY.
           MOVE IT-DEPT1                TO MACCT-IT-DEPT1.
           MOVE IT-DEPT2                TO MACCT-IT-DEPT2.

           IF NO-ENTRY
               PERFORM 9-PUT-MACCTINFO
           ELSE
               PERFORM 9-UPDATE-MACCTINFO.

       76-IT-DEPT-X.
           EXIT.

       77-STORE-ROOM-ACCT.
           MOVE SPACES                   TO STORE-ROOM-ACCT-SCRN.
           MOVE "SADJ"                   TO DEPT-ARG.

           PERFORM 9-GET-MACCTINFO.

           IF GOOD-CALL
               MOVE MACCT-SADJ-ACCT      TO STROOM-ACCT-NO
               MOVE "Y"                  TO MODIFY-STRM-SW
           ELSE
               MOVE "N"                  TO MODIFY-STRM-SW.

           MOVE "STRMADAJ"               TO VIEW-NFNAME.

      *****  INPUT DATA ABOVE AND PRESS 'ENTER'  *****
               MOVE   9 TO LANG-SETNUM
               MOVE  20 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.


       77-SHOW-FORM.
           MOVE MESSAGE-BUFFER TO STROOM-MSGLINE.
           MOVE STORE-ROOM-ACCT-SCRN   TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC   TO   STORE-ROOM-ACCT-SCRN.

       77-READ-FIELDS.
           IF VIEW-LASTKEY = 3
               GO TO 77-STORE-ROOM-ACCT-X.

           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *****    INVALID FUNCTION KEY    *****
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 1   TO FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 77-SHOW-FORM.

      *    IF MODIFY-STRM-DISALLOWED
      *        GO TO 72-STRMDEPT-X.

       77-FIELD-EDITS.

       77-UPDATE-STOREROOM-ADJUSTACCT.
           PERFORM 9-LOCK-MACCTINFO.

           PERFORM 9-GET-MACCTINFO.

           IF  NOT GOOD-CALL
                  MOVE SPACES    TO  BUF-MACCT-INFO
                  MOVE "SADJ"    TO  MACCT-INFO-KEY
                  MOVE STROOM-ACCT-NO TO MACCT-SADJ-ACCT
                  PERFORM 9-PUT-MACCTINFO
               ELSE
                  MOVE STROOM-ACCT-NO TO MACCT-SADJ-ACCT
                  PERFORM 9-UPDATE-MACCTINFO.
      *    IF GOOD-CALL
      *        GO TO 72-STRMDEPT-X.
      *
      *    MOVE STROOM-ACCT-NO           TO MACCT-SADJ-ACCT.
      *
      *    PERFORM 9-GET-MCHTACCTS.
      *
      *    IF NOT GOOD-CALL
      *        PERFORM 9-UNLOCK-MACCTINFO
      *****  INVALID DEPARTMENT NUMBER   *****
      *        MOVE   9 TO LANG-SETNUM
      *        MOVE  65 TO LANG-MSGNUM
      *        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
      *        PERFORM 4-VIEW-PUTWINDOW THRU 4-VIEW-ERROR-X
      *        GO TO 72-SHOW-FORM.
      *
      *    MOVE SPACES                   TO BUF-MACCT-INFO.
      *    MOVE "SDPT"                   TO MACCT-INFO-KEY.
      *    MOVE STRMDEPT-NO              TO MACCT-STR-DEPT.
      *    PERFORM 9-PUT-MACCTINFO.
      *    PERFORM 9-UNLOCK-MACCTINFO.

       77-STORE-ROOM-ACCT-X.
           EXIT.


      ***************************************************************
      **                                                           **
      **          P E R F O R M E D    R O U T I N E S             **
      **                                                           **
      ***************************************************************

      ****
      **** M C H T A C C T S
      ****
       9-GET-MCHTACCTS.
           MOVE 0 TO COND-WORD.
           MOVE DEPT-ARG TO DEPT OF MCHTACCTS-REC-I.
           READ MCHTACCTS-I INTO BUF-MCHTACCTS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF NOT GOOD-CALL
               IF NOT NO-ENTRY
                   MOVE "GET MCHTACCTS ERROR IN 9-GET-MCHTACCTS"
                       TO BU-DISPLAY-MSG
                   MOVE DEPT-ARG TO BU-DISPLAY-FLD (1)
                   PERFORM 2-BLOWUP.

       9-LOCK-MCHTACCTS.
           MOVE 0 TO COND-WORD.
           MOVE DEPT-ARG TO DEPT OF MCHTACCTS-REC-O.
           READ MCHTACCTS-O INTO BUF-MCHTACCTS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF NOT GOOD-CALL
               IF NOT NO-ENTRY
                   MOVE "GET MCHTACCTS ERROR IN 9-LOCK-MCHTACCTS"
                       TO BU-DISPLAY-MSG
                   MOVE DEPT-ARG TO BU-DISPLAY-FLD (1)
                   PERFORM 2-BLOWUP.

       9-PUT-MCHTACCTS.
           WRITE MCHTACCTS-REC-O FROM BUF-MCHTACCTS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 NOT = "2"
               MOVE "PUT MCHTACCTS ERROR IN 9-PUT-MCHTACCTS"
                   TO BU-DISPLAY-MSG
               MOVE DEPT-ARG TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

      ****
      **** M C L A S S
      ****
       9-GET-MCLASS.
           MOVE 0 TO COND-WORD.
           MOVE CLASS-ARG TO ACTGCLASS OF MCLASS-REC-I.
           READ MCLASS-I INTO BUF-MCLASS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF NOT GOOD-CALL
               IF NOT NO-ENTRY
                   MOVE "GET MCLASS ERROR IN 9-GET-MCLASS"
                       TO BU-DISPLAY-MSG
                   MOVE CLASS-ARG TO BU-DISPLAY-FLD (1)
                   PERFORM 2-BLOWUP.

      ****
      **** M A C C T I N F O
      ****
       9-GET-MACCTINFO.
           MOVE 0 TO COND-WORD.
           MOVE DEPT-ARG TO INFOKEY OF MACCTINFO-REC-I.
           READ MACCTINFO-I INTO BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF NOT GOOD-CALL
               IF NOT NO-ENTRY
                   MOVE "GET MACCTINFO ERROR IN 9-GET-MACCTINFO"
                       TO BU-DISPLAY-MSG
                   MOVE DEPT-ARG TO BU-DISPLAY-FLD (1)
                   PERFORM 2-BLOWUP.

       9-LOCK-MACCTINFO.
           MOVE 0 TO COND-WORD.
           MOVE DEPT-ARG TO INFOKEY OF MACCTINFO-REC-O.
           READ MACCTINFO-O INTO BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF NOT GOOD-CALL
               IF NOT NO-ENTRY
                   MOVE "GET MACCTINFO ERROR IN 9-LOCK-MACCTINFO"
                       TO BU-DISPLAY-MSG
                   MOVE DEPT-ARG TO BU-DISPLAY-FLD (1)
                   PERFORM 2-BLOWUP.

       9-PUT-MACCTINFO.
           WRITE MACCTINFO-REC-O FROM BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "PUT MACCTINFO ERROR IN 9-PUT-MACCTINFO"
                   TO BU-DISPLAY-MSG
               MOVE DEPT-ARG TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

       9-UPDATE-MACCTINFO.
           REWRITE MACCTINFO-REC-O FROM BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBUPDATE ERROR IN 9-UPDATE-MACCTINFO"
                   TO BU-DISPLAY-MSG
               MOVE DEPT-ARG TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

      ****
      **** M A T L A C C U M
      ****
       9-GET-MATLACCUM.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO MATLCODE OF MATLACCUM-REC-I.
           READ MATLACCUM-I INTO BUF-MATLACUM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF NOT GOOD-CALL
               IF NOT NO-ENTRY
                   MOVE "GET MATLACCUM ERROR IN 9-GET-MATLACCUM"
                       TO BU-DISPLAY-MSG
                   MOVE CODE-ARG TO BU-DISPLAY-FLD (1)
                   PERFORM 2-BLOWUP.

       9-PUT-MATLACCUM.
           WRITE MATLACCUM-REC-O FROM BUF-MATLACUM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 NOT = "2"
                   MOVE "PUT MATLACCUM ERROR IN 9-PUT-MATLACCUM"
                       TO BU-DISPLAY-MSG
                   MOVE CODE-ARG TO BU-DISPLAY-FLD (1)
                   PERFORM 2-BLOWUP.

       9-DELETE-MATLACCUM.
           DELETE MATLACCUM-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DELETE MATLACCUM ERROR IN 9-DEL-MATLACCUM"
                   TO BU-DISPLAY-MSG
               MOVE CODE-ARG TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

       9-LOCK-MATLACCUM.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO MATLCODE OF MATLACCUM-REC-O.
           READ MATLACCUM-O INTO BUF-MATLACUM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF NOT GOOD-CALL
               IF NOT NO-ENTRY
                   MOVE "GET MATLACCUM ERROR IN 9-LOCK-MATLACCUM"
                       TO BU-DISPLAY-MSG
                   MOVE CODE-ARG TO BU-DISPLAY-FLD (1)
                   PERFORM 2-BLOWUP.

       COPY DISPCALL IN COPYLIB.
      *********************************************************
       999-CATREAD.
           MOVE SPACES TO MESSAGE-BUFFER.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.
