000300 IDENTIFICATION DIVISION.
000400 PROGRAM-ID. TADDCODE.
000800*REMARKS.
000900*        ########################################################
001000*        # Adds personnel absence codes to the master file .... #
001100*        ########################################################.
001500 ENVIRONMENT DIVISION.
001600 CONFIGURATION SECTION.
001700 SOURCE-COMPUTER. AS400.
001800 OBJECT-COMPUTER. AS400.
       SPECIAL-NAMES.      I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                           LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZPERSON-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT PER-ABSENCE-MSTR
               ASSIGN TO DATABASE-MCFLMM2901
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS PAM-STATUS.
002200 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).
       FD  PER-ABSENCE-MSTR
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS PAMREC.
       01  PAMREC.
           COPY DDS-ALL-FORMATS OF MCFLMM2901.
002300 WORKING-STORAGE SECTION.
       COPY CATREAD OF COPYLIB.
003800 01  CODE-BUFFER.
003900     05  CODE-B                    PIC XX.
004000     05  DESC-B                    PIC X(30).
           05  CODE-CMD-LINE             PIC X(79).
           05  CODE-ERR-LINE             PIC X(79).
       COPY CPYIND  OF COPYLIB.
003700 01  ERROR-BUFFER.
           05  FILLER                    PIC X(14).
           05  ERR-CODE                  PIC XX.
           05  FILLER                    PIC X(64).
       01  FILE-STATUSES.
           05  DSPLY-STATUS              PIC XX.
           05  PAM-STATUS                PIC XX.
       COPY IOFEEDBACK OF COPYLIB.
004100 01  GO-BACK                       PIC X VALUE "N".
004200     88 TIME-TO-GO-BACK                  VALUE "Y".
002400 01  PASSWORD-INFORMATION.
002500     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TADDCODE".
002600     05  PROGRAM-TYPE        PIC X(02) VALUE "MA".
002700     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
002800     05  PROGRAM-DESCRIPTION.
002900         10  PROG-DESC-A     PIC X(60) VALUE
003000            "ADDS ABSENCE CODES IN THE PERSONNEL SYSTEM "        .
003100         10  PROG-DESC-B     PIC X(60) VALUE SPACES.
003300         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
003500     05  PASSWORD-FLAG       PIC X.
       01  TRUE-VAL                      PIC 1 VALUE B"1".
004300 COPY DBSTAT    OF COPYLIB.
       COPY WSCONTROL OF COPYLIB.
004800 LINKAGE SECTION.
004900 01  DBPARAMETERS.                 COPY DBPARMS  OF COPYLIB.
005000 COPY VCOMLINK  OF COPYLIB.
005100 01  PLT-IDT                       PIC X(4).
005600 PROCEDURE DIVISION USING DBPARAMETERS
005700                          VIEW-COMAREA
005800                          PLT-IDT.
       BEGIN-PGM.
           PERFORM 1-HSK.
007100     PERFORM 6-MAIN THRU 6-MAIN-EXIT UNTIL VIEW-LASTKEY = 3.
       2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE PER-ABSENCE-MSTR.
           GOBACK.
006200 1-HSK.
           OPEN I-O   DISPLAY-FILE.
           OPEN I-O   PER-ABSENCE-MSTR.
006300     CALL "TPWORD" USING PASSWORD-INFORMATION.
006700     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
           MOVE SPACES TO CODE-BUFFER.
009200 6-MAIN.
010100     MOVE "FADDCODE" TO VIEW-CFNAME.
           IF INDS (99) = TRUE-VAL
               MOVE ERROR-BUFFER TO CODE-ERR-LINE.
           MOVE CODE-BUFFER TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO CODE-BUFFER.
012500     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
009500     PERFORM 61-ADD THRU 61-ADD-EXIT.
009600 6-MAIN-EXIT.    EXIT.

012800 61-ADD.
013400     IF CODE-B = SPACES GO TO 61-ADD-EXIT.
014300     MOVE 0 TO COND-WORD.
           WRITE PAMREC FROM CODE-BUFFER
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF PAM-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17
016200         MOVE 29082 TO CATREAD-MSG-NUMBER
016400         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (1) INDS (99)
017400         GO TO 61-ADD-EXIT.
           MOVE 66194 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE CODE-B TO ERR-CODE.
           MOVE ERROR-BUFFER TO CODE-CMD-LINE.
           MOVE CODE-BUFFER TO DSPLY-REC.
           MOVE TRUE-VAL TO INDS (98).
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98A-SCREEN-READ.
           CALL "CLPAUSE2".
           MOVE SPACES TO ERROR-BUFFER CODE-BUFFER.
018600 61-ADD-EXIT.
018700     EXIT.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0" TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

051100 999-CATREAD.
024000     MOVE SPACES TO ERROR-BUFFER.
024100     CALL "CCATREAD" USING CATREAD-PARMS.
024200     MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
052100 999-CATREAD-EXIT.
052200     EXIT.
