       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TADDWOII.
      *                        THIS PROGRAM ADDS W/O'S TO WO-PLANNED.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        AS400.
       OBJECT-COMPUTER.        AS400.

       INPUT-OUTPUT            SECTION.
       FILE-CONTROL.
           SELECT WO-NUMBER
                  ASSIGN       TO DATABASE-MCFLMM0101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS RANDOM
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-PLANNED
                  ASSIGN       TO DATABASE-MCFLMM1101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS RANDOM
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

       DATA DIVISION.
       FILE SECTION.
       FD  WO-NUMBER
           LABEL RECORDS       ARE STANDARD.
       01  WO-NUMBER-REC.
           COPY DD-MCRPMM0100  OF MCFLMM0101.

       FD  WO-PLANNED
           LABEL RECORDS       ARE STANDARD.
       01  WO-PLANNED-REC.
           COPY DD-MCRPMM1100  OF MCFLMM1101.

       WORKING-STORAGE SECTION.
       01  FILE-STAT           PIC XX.
       01  FILE-STAT1          REDEFINES FILE-STAT
                               PIC 99.
       01  WO-NUM-KEY          PIC X(10).

       LINKAGE SECTION.
       01  DBPARAMETERS.       COPY DBPARMS IN COPYLIB.

           COPY DBSTAT         IN COPYLIB.

       01  WO-PLANNED-DATA.    COPY DWOPLAN IN COPYLIB.

       01  CONDIT-CODE         PIC X.
       01  ERROR-SWITCH.
           05  ERROR-SW        PIC S9(4) COMP-4.

       PROCEDURE DIVISION      USING DBPARAMETERS
                               STATUS-AREA
                               WO-PLANNED-DATA
                               CONDIT-CODE
                               ERROR-SWITCH.
       BEGIN-PROCESSING.
           PERFORM 1-HSK.
           PERFORM 6-MAIN.

       2-EOJ.
           CLOSE               WO-NUMBER.
           CLOSE               WO-PLANNED.
           GOBACK.

       1-HSK.
           MOVE WO-NUM-PLANNED TO WO-NUM-KEY.
           OPEN I-O            WO-NUMBER
                               WO-PLANNED.
           MOVE ZERO           TO ERROR-SW.

       6-MAIN.
           IF CONDIT-CODE NOT = "1"
               PERFORM 60-WRITE-MASTER-RECORDS.

           PERFORM 61-WRITE-PLANNED-RECORDS.

       60-WRITE-MASTER-RECORDS.
           WRITE WO-NUMBER-REC FROM WO-NUM-KEY
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE FILE-STAT1 TO ERROR-SW
               GO TO 2-EOJ.

       61-WRITE-PLANNED-RECORDS.
           WRITE WO-PLANNED-REC FROM WO-PLANNED-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE FILE-STAT1 TO ERROR-SW
               GO TO 2-EOJ.

