000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          TALTLST.
000400 AUTHOR.              W L MCINTYRE
000500 DATE-WRITTEN.        07/25/95.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*D   THIS IS THE VENDOR CODE/ALTERNATE KEY CROSS-REFERENCE
001100*D   ONLINE LISTING.  USER WILL HAVE THE ABILITY TO PRODUCE
001100*D   A LISTING BY EITHER ALERNATE KEY (DEFAULT) OR VENDOR CODE.
001300
001400 ENVIRONMENT DIVISION.
001500 CONFIGURATION SECTION.
001600 SOURCE-COMPUTER.  HP-3000.
001700 OBJECT-COMPUTER.  HP-3000.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MALTVEN1-I
               ASSIGN TO DATABASE-MCFLCS5801
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MALTVEN2-I
               ASSIGN TO DATABASE-MCFLCS5802
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DVENDOR-I
               ASSIGN TO DATABASE-MCFLCS0701
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZALTVEN-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DISPLAY-STATUS
               CONTROL-AREA IS WS-CONTROL.
001800
001900 DATA DIVISION.
       FILE SECTION.
       FD  MALTVEN1-I
           LABEL RECORDS ARE STANDARD.
       01  MALTVEN1-REC-I.
           COPY DDS-MCRPCS5800 OF MCFLCS5801.

       FD  MALTVEN2-I
           LABEL RECORDS ARE STANDARD.
       01  MALTVEN2-REC-I.
           COPY DDS-MCRPCS5800 OF MCFLCS5802.

       FD  DVENDOR-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-REC-I.
           COPY DDS-MCRPCS0700 OF MCFLCS0701.

       FD  DISPLAY-FILE
           LABEL RECORD ARE OMITTED.
       01  DISPLAY-REC       PIC X(1500).

002000 WORKING-STORAGE SECTION.
002100
       77  MCXCBLERR-SCOPE               PIC X(1)  VALUE "C".
       77  WS-LSTKEY                     PIC X(03) VALUE "ALT".
       77  BASE                          PIC X(10) VALUE SPACES.

002200**************************************************************
002300**                                                          **
002400**           S U B P R O G R A M   A R E A S                **
002500**                                                          **
002600**************************************************************
002700
002800 COPY TBLOWUP    IN COPYLIB.
       COPY DISPDAT2   IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.
       COPY CATREAD    IN COPYLIB.
003100
003200**************************************************************
003300**                                                          **
003400**                  V I E W   W O R K                       **
003500**                                                          **
003600**************************************************************
003700
       COPY VCOMAREA IN COPYLIB.
       COPY CPYIND   IN COPYLIB.
009400
009500 01  MESSAGE-BUFFER.
009600     05  MSG-TEXT              PIC X(68)    VALUE SPACE.
009700     05  MSG-FLD               PIC X(8)     VALUE SPACE.
009800     05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC ZZZZZZZ9.
005200
005300 01  FIELD-NUMBER              PIC S9(4) BINARY VALUE 1.
       01  REC-NUM                   PIC S9(4)    VALUE 0.
       01  LINE-LIMIT                PIC S9(2)    VALUE 15.
       01  NEXT-PAGE                 PIC S9(2)    VALUE 16.
       01  LINES-ON-PAGE             PIC S9(2)    VALUE 00.
       01  FIND-PREV                 PIC S9(2)    VALUE 00.

       01  NEXT-PAGE-SW              PIC X(01)    VALUE "N".
       01  PREV-PAGE-SW              PIC X(01)    VALUE "N".
009900
010000**************************************************************
010100**                                                          **
010200**            D A T A B A S E   W O R K                     **
010300**                                                          **
010400**************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

011300 COPY DBSTAT     IN COPYLIB.

007400 01  MALTVEN-ARG                   PIC X(10).
007500 01  VENCODE-ARG                   PIC X(10).
007600
       COPY MALTVEN    IN COPYLIB.
       COPY DVENDOR    IN COPYLIB.

008600**************************************************************
008700**                                                          **
008800**                  S C R E E N   D A T A                   **
008900**                                                          **
009000**************************************************************
009100
009200 01  DE-FIELDS.
009300     05  DE-COL1HDR                PIC X(10).
009400     05  DE-COL2HDR                PIC X(10).
           05  DE-LIST.
               10 DE-LIST-DATA  OCCURS 15 TIMES.
                  15  DE-COL1            PIC X(10).
                  15  DE-COL2            PIC X(10).
                  15  DE-NAME            PIC X(44).
           05  DE-LSTBYLIT               PIC X(09).
           05  DE-COMMAND-LINE           PIC X(79).
           05  DE-MESSAGE-LINE           PIC X(79).
009500
013000
013100 PROCEDURE DIVISION.
           PERFORM 1-HOUSEKEEPING THRU 1-X.
016700     PERFORM 6-MAIN         THRU 6-X.
           PERFORM 2-EOJ          THRU 2-X.

013200 1-HOUSEKEEPING.
013300
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.

           OPEN I-O DISPLAY-FILE.
           OPEN INPUT DVENDOR-I MALTVEN1-I MALTVEN2-I.
           MOVE "FALTLST" TO VIEW-NFNAME.
           MOVE "ALT"  TO WS-LSTKEY.
           PERFORM 10-START-LIST THRU 10-X.
      *----  IF NO RECORDS IN ALTERNATE FILE, MOVE MESSAGE TO SCREEN
           IF WS-LSTKEY = "ALT" AND FILE-STATUS = "10"
              MOVE "NO ALTERNATE KEYS IN VENDOR ALTERNATE FILE  "
                TO DE-NAME (1)
              GO TO 1-X.
           MOVE 1      TO REC-NUM.
           MOVE 0      TO LINES-ON-PAGE.
           PERFORM 11-NEXT-PAGE THRU 11-X
             UNTIL REC-NUM > LINE-LIMIT.

       1-X.
           EXIT.

       10-START-LIST.
           MOVE SPACES TO DE-FIELDS.
           MOVE "N"    TO NEXT-PAGE-SW PREV-PAGE-SW.
           IF WS-LSTKEY = "ALT"
              MOVE "ALTERNATE"   TO DE-COL1HDR
              MOVE "VENDOR"      TO DE-COL2HDR
              MOVE "VENDOR"      TO DE-LSTBYLIT
           ELSE
              MOVE "VENDOR"      TO DE-COL1HDR
              MOVE "ALTERNATE"   TO DE-COL2HDR
              MOVE "ALTERNATE"   TO DE-LSTBYLIT.
           IF WS-LSTKEY = "ALT"
              PERFORM 30-READ-FIRST-ALT1 THRU 30-X
           ELSE IF WS-LSTKEY = "VEN"
              PERFORM 31-READ-FIRST-ALT2 THRU 31-X.
           IF FILE-STATUS = "00" OR "10"
              NEXT SENTENCE
           ELSE
              MOVE "READ FIRST ERR 10-STR-LST" TO BU-DISPLAY-MSG
              MOVE WS-LSTKEY                   TO BU-DISPLAY-FLD (1)
              PERFORM 2-BLOWUP.

       10-X.
           EXIT.
016800
       11-NEXT-PAGE.
           PERFORM 110-MOVE-DATA THRU 110-X.
           MOVE 0 TO COND-WORD.
           IF WS-LSTKEY = "ALT"
              PERFORM 32-READ-NEXT-ALT1 THRU 32-X
           ELSE IF WS-LSTKEY = "VEN"
              PERFORM 33-READ-NEXT-ALT2 THRU 33-X.
           IF FILE-STATUS = "00"
              NEXT SENTENCE
           ELSE IF FILE-STATUS = "10" OR "14" OR "46"
              MOVE 15 TO COND-WORD
           ELSE
              MOVE "READ NEXT ERR 11-NXT-PGE" TO BU-DISPLAY-MSG
              MOVE WS-LSTKEY                  TO BU-DISPLAY-FLD (1)
              PERFORM 2-BLOWUP.
           IF END-OF-CHAIN
              MOVE REC-NUM   TO LINES-ON-PAGE
              MOVE NEXT-PAGE TO REC-NUM
              MOVE 0 TO COND-WORD
              IF WS-LSTKEY = "ALT"
                 PERFORM 34-READ-LAST-ALT1 THRU 34-X
              ELSE
                 PERFORM 35-READ-LAST-ALT2 THRU 35-X
              END-IF
      *-----  AT THIS STAGE OF THE 'BALL-GAME', MUST BE ABLE TO READ
      *-----  A LAST RECORD, SINCE PGM READ PAST RECORDS TO GET HERE
              IF FILE-STATUS = "00"
                 GO TO 11-X
              ELSE
                 MOVE "READ LAST ERR 11-NXT-PGE" TO BU-DISPLAY-MSG
                 MOVE WS-LSTKEY                  TO BU-DISPLAY-FLD (1)
                 PERFORM 2-BLOWUP
              END-IF
           END-IF.
           ADD 1 TO REC-NUM.
           IF REC-NUM = NEXT-PAGE
              MOVE LINE-LIMIT TO LINES-ON-PAGE
              MOVE "Y" TO NEXT-PAGE-SW
              GO TO 11-X.

       11-X.
           EXIT.

       110-MOVE-DATA.
           IF WS-LSTKEY = "ALT"
              MOVE VENDOR-ALT-KEY  TO DE-COL1 (REC-NUM)
              MOVE ALT-VENDOR-CODE TO DE-COL2 (REC-NUM)
           ELSE
              MOVE ALT-VENDOR-CODE TO DE-COL1 (REC-NUM)
              MOVE VENDOR-ALT-KEY  TO DE-COL2 (REC-NUM).
           MOVE ALT-VENDOR-CODE TO VENCODE-ARG.
           MOVE VENCODE-ARG     TO VENCDE OF DVENDOR-REC-I.
           MOVE 0 TO COND-WORD.
           PERFORM 38-START-VENDOR THRU 38-X.
           IF FILE-STATUS = "00"
              NEXT SENTENCE
           ELSE IF FILE-STATUS-1 = "2"
              MOVE "VENDOR CODE NOT ON SYSTEM" TO DE-NAME (REC-NUM)
              GO TO 110-X
           ELSE
              MOVE "START ERR 110-MVE-DTA" TO BU-DISPLAY-MSG
              MOVE "DVENDOR"               TO BU-DISPLAY-FLD (1)
              PERFORM 2-BLOWUP.
           MOVE 0 TO COND-WORD.
           PERFORM 39-READ-NEXT-VENDOR THRU 39-X.
           IF FILE-STATUS = "00"
              NEXT SENTENCE
           ELSE IF FILE-STATUS = "10" OR "14" OR "46"
              MOVE "VENDOR CODE NOT ON SYSTEM" TO DE-NAME (REC-NUM)
           ELSE
              MOVE "READ NXT ERR 110-MVE-DTA" TO BU-DISPLAY-MSG
              MOVE "DVENDOR"                  TO BU-DISPLAY-FLD (1)
              PERFORM 2-BLOWUP.
           IF VEN-ITM-NO NOT = 00
              MOVE "VENDOR CODE NOT ON SYSTEM" TO DE-NAME (REC-NUM)
           ELSE
              MOVE VEN-NAME                    TO DE-NAME (REC-NUM).

       110-X.
           EXIT.

016900 2-EOJ.
           CLOSE DISPLAY-FILE DVENDOR-I MALTVEN1-I MALTVEN2-I.
           GOBACK.
017600
       2-X.
           EXIT.

017700 2-BLOWUP.
017800     MOVE "TALTLST"                TO   BU-PGM-NAME.
017900     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
018000       VIEW-COMAREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
018100       BU-DISPLAY-FLDS.
018200
       30-READ-FIRST-ALT1.
           READ MALTVEN1-I FIRST INTO BUF-MALTVEN
             AT END MOVE FILE-STATUS TO FILE-STATUS.

       30-X.
           EXIT.

       31-READ-FIRST-ALT2.
           READ MALTVEN2-I FIRST INTO BUF-MALTVEN
             AT END MOVE FILE-STATUS TO FILE-STATUS.

       31-X.
           EXIT.

       32-READ-NEXT-ALT1.
           READ MALTVEN1-I NEXT INTO BUF-MALTVEN
             AT END MOVE FILE-STATUS TO FILE-STATUS.

       32-X.
           EXIT.

       33-READ-NEXT-ALT2.
           READ MALTVEN2-I NEXT INTO BUF-MALTVEN
             AT END MOVE FILE-STATUS TO FILE-STATUS.

       33-X.
           EXIT.

       34-READ-LAST-ALT1.
           READ MALTVEN1-I LAST INTO BUF-MALTVEN
             AT END MOVE FILE-STATUS TO FILE-STATUS.

       34-X.
           EXIT.

       35-READ-LAST-ALT2.
           READ MALTVEN2-I LAST INTO BUF-MALTVEN
             AT END MOVE FILE-STATUS TO FILE-STATUS.

       35-X.
           EXIT.

       36-READ-PREV-ALT1.
           READ MALTVEN1-I PRIOR INTO BUF-MALTVEN
             AT END MOVE FILE-STATUS TO FILE-STATUS.

       36-X.
           EXIT.

       37-READ-PREV-ALT2.
           READ MALTVEN2-I PRIOR INTO BUF-MALTVEN
             AT END MOVE FILE-STATUS TO FILE-STATUS.

       37-X.
           EXIT.

       38-START-VENDOR.
           START DVENDOR-I KEY = VENCDE OF DVENDOR-REC-I
             INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       38-X.
           EXIT.

       39-READ-NEXT-VENDOR.
           READ DVENDOR-I NEXT INTO BUF-DVENDOR
             AT END MOVE FILE-STATUS TO FILE-STATUS.

       39-X.
           EXIT.

018300 6-MAIN.
           PERFORM 60-SET-PAGING-INDICATORS THRU 60-X.
018400     PERFORM 61-SCREEN-WRITE THRU 61-X.
           PERFORM 62-SCREEN-READ  THRU 62-X.
           IF VIEW-LASTKEY = 3
              GO TO 6-X
           ELSE
           IF VIEW-LASTKEY = 1 OR 2
              PERFORM 63-PAGING-RQST THRU 63-X
           ELSE
           IF VIEW-LASTKEY = 6
              PERFORM 64-CHANGE-LSTKEY THRU 64-X.
           GO TO 6-MAIN.
018500
018700 6-X.
018800     EXIT.

       60-SET-PAGING-INDICATORS.
           IF NEXT-PAGE-SW = "Y"
              MOVE B"1" TO INDS (19)
           ELSE
              MOVE B"0" TO INDS (19).
           IF PREV-PAGE-SW = "Y"
              MOVE B"1" TO INDS (20)
           ELSE
              MOVE B"0" TO INDS (20).

       60-X.
           EXIT.

       61-SCREEN-WRITE.
           MOVE DE-FIELDS TO DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
             INDICATORS ARE INDICS.

       61-X.
           EXIT.

       62-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-NFNAME
             INDICATORS ARE INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DISPLAY-STATUS NOT = "00"
              MOVE 3 TO VIEW-LASTKEY
           ELSE
              MOVE FUNCTION-NUM TO VIEW-LASTKEY.
           MOVE SPACES TO DE-MESSAGE-LINE.
           MOVE DISPLAY-REC TO DE-FIELDS.

       62-X.
           EXIT.

       63-PAGING-RQST.
           IF (NEXT-PAGE-SW = "Y") AND (PREV-PAGE-SW = "Y")
              MOVE SPACES TO DE-LIST
              IF VIEW-LASTKEY = 2
                 MOVE SPACES TO NEXT-PAGE-SW
                 MOVE 1 TO REC-NUM
                 PERFORM 11-NEXT-PAGE THRU 11-X
                   UNTIL REC-NUM > LINE-LIMIT
                 GO TO 63-X
              ELSE
      *-----  DETERMINE VALUE TO MOVE POINTER BACK TO FIRST RECORD OF
      *-----  NEXT PAGE.  NEED TO ADD 1 TO TOTAL TO ATTEMPT TO READ
      *-----  PAST DESIRED POINTER TO CHECK FOR ANY MORE PREVIOUS
      *-----  PAGES EXISTING, SINCE FILE POINTER NOW AT FIRST RECORD
      *-----  OF NEXT PAGE
                 COMPUTE FIND-PREV = (LINES-ON-PAGE + LINE-LIMIT) + 1
                 PERFORM 630-LOC-PREV-PAGE THRU 630-X
                 MOVE 1 TO REC-NUM
                 PERFORM 11-NEXT-PAGE THRU 11-X
                   UNTIL REC-NUM > LINE-LIMIT
                 GO TO 63-X
              END-IF
           END-IF.
           IF PREV-PAGE-SW = "Y"
              IF VIEW-LASTKEY = 1
      *-----  DETERMINE VALUE TO MOVE POINTER BACK TO FIRST RECORD OF
      *-----  NEXT PAGE.  JUST USE TOTAL TO ATTEMPT TO READ PAST
      *-----  DESIRED POINTER TO CHECK FOR ANY MORE PREVIOUS PAGES
      *-----  EXISTING, SINCE FILE POINTER NOW AT LAST RECORD OF
      *-----  CURRENT PAGE AND LAST RECORD IN FILE
                 COMPUTE FIND-PREV = LINES-ON-PAGE + LINE-LIMIT
                 MOVE SPACES TO DE-LIST
                 PERFORM 630-LOC-PREV-PAGE THRU 630-X
                 MOVE 1 TO REC-NUM
                 PERFORM 11-NEXT-PAGE THRU 11-X
                   UNTIL REC-NUM > LINE-LIMIT
                 GO TO 63-X
              ELSE
      *          MOVE TRUE-VAL TO INDS (99)
      *          MOVE ERROR-MESSAGE (04) TO ERRMSG OF FDOCLST-O
                 GO TO 63-X
              END-IF
           END-IF.
           IF NEXT-PAGE-SW = "Y"
              IF VIEW-LASTKEY = 2
                 MOVE SPACES TO DE-LIST
                 MOVE "Y" TO PREV-PAGE-SW
                 MOVE SPACES TO NEXT-PAGE-SW
                 MOVE 1 TO REC-NUM
                 PERFORM 11-NEXT-PAGE THRU 11-X
                   UNTIL REC-NUM > LINE-LIMIT
                 GO TO 63-X
              ELSE
      *          MOVE TRUE-VAL TO INDS (99)
      *          MOVE "N" TO INVALID-SW
      *          MOVE ERROR-MESSAGE (03) TO ERRMSG OF FDOCLST-O
                 GO TO 63-X
              END-IF
           END-IF.

       63-X.
           EXIT.

       630-LOC-PREV-PAGE.
           MOVE 0 TO REC-NUM.
           MOVE SPACES TO NEXT-PAGE-SW.
      *-----  PERFORM LOGIC TO FIND BEGINNING KEY FOR PREVIOUS PAGE
           MOVE 0 TO COND-WORD.
           PERFORM 6300-FIND-PREV THRU 6300-X
             UNTIL REC-NUM = FIND-PREV
             OR  END-OF-CHAIN.
           IF END-OF-CHAIN
              MOVE SPACES TO PREV-PAGE-SW
              MOVE 0 TO COND-WORD
              IF WS-LSTKEY = "ALT"
                 PERFORM 30-READ-FIRST-ALT1 THRU 30-X
               ELSE
                 PERFORM 31-READ-FIRST-ALT2 THRU 31-X
              END-IF
      *-----  AT THIS STAGE OF THE 'BALL-GAME', MUST BE ABLE TO READ
      *-----  A FIRST RECORD, SINCE PGM IS EXPECTING TO PAGE BACK.
              IF FILE-STATUS = "00"
                 GO TO 630-X
              ELSE
                 MOVE "READ FIRST ERR 630-LPP" TO BU-DISPLAY-MSG
                 MOVE WS-LSTKEY                TO BU-DISPLAY-FLD (1)
                 PERFORM 2-BLOWUP
              END-IF
           END-IF.
           IF REC-NUM = FIND-PREV
      *-----  READ FORWARD TO GET BACK TO FIRST RECORD OF PREV PAGE
              IF WS-LSTKEY = "ALT"
                 PERFORM 32-READ-NEXT-ALT1 THRU 32-X
              ELSE
                 PERFORM 33-READ-NEXT-ALT2 THRU 33-X
              END-IF
      *-----  BLOWUP THE PROGRAM IF CANNOT COMPLETE THIS READ, SINCE
      *-----  HAD TO READ PAST THIS RECORD TO GET THIS DEEP INTO LOGIC
              IF FILE-STATUS NOT = "00"
                 MOVE "READ NEXT ERR 630-LPP" TO BU-DISPLAY-MSG
                 MOVE WS-LSTKEY               TO BU-DISPLAY-FLD (1)
                 PERFORM 2-BLOWUP
              END-IF
           END-IF.

       630-X.
           EXIT.

       6300-FIND-PREV.
           MOVE 0 TO COND-WORD.
           IF WS-LSTKEY = "ALT"
              PERFORM 36-READ-PREV-ALT1 THRU 36-X
           ELSE
              PERFORM 37-READ-PREV-ALT2 THRU 37-X
           END-IF.
           IF FILE-STATUS = "00"
              NEXT SENTENCE
           ELSE IF FILE-STATUS = "10" OR "14" OR "46"
              MOVE 15 TO COND-WORD
              GO TO 6300-X
           ELSE
              MOVE "READ PREV ERR 6300-FP" TO BU-DISPLAY-MSG
              MOVE WS-LSTKEY               TO BU-DISPLAY-FLD (1)
              PERFORM 2-BLOWUP.
           ADD 1 TO REC-NUM.

       6300-X.
           EXIT.

       64-CHANGE-LSTKEY.
           IF WS-LSTKEY = "ALT"
              MOVE "VEN" TO WS-LSTKEY
           ELSE
              MOVE "ALT" TO WS-LSTKEY.
           PERFORM 10-START-LIST THRU 10-X.
      *----  IF NO RECORDS IN ALTERNATE FILE, MOVE MESSAGE TO SCREEN
           IF FILE-STATUS = "10"
              MOVE "NO ALTERNATE KEYS IN VENDOR ALTERNATE FILE  "
                TO DE-NAME (1)
              GO TO 64-X.
           MOVE 1      TO REC-NUM.
           PERFORM 11-NEXT-PAGE THRU 11-X
             UNTIL REC-NUM > LINE-LIMIT.

       64-X.
           EXIT.
