001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.          TALTKEY.
001300 AUTHOR.              C HILLES.
001400 DATE-WRITTEN.        AUGUST 23, 1984.
001500 DATE-COMPILED.
001600*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
001700*SECURITY.
001800*REMARKS.  THIS SUBPROGRAM PERFORMS 3 FUNCTIONS:
001900*    1.  ADD AN ALTERNATE KEY TO THE "MALTKEY" DATASET.  "AD"
002000*        IS PASSED IN RET-CODE, AND THE ALTERNATE KEY AND ACTUAL
002100*        CORP CODE ARE PASSED.
002200*
002300*    2.  DELETE AN ALTERNATE KEY FROM THE "MALTKEY" DATASET.  "DL"
002400*        IS PASSED IN RET-CODE, AND THE ALTERNATE KEY TO DELETE
002500*        MUST BE PASSED.
002600*
002700*    3.  INQUIRE ON AN ALTERNATE KEY.  ANYTHING BUT "AD" OR "DL"
002800*        IS IN RET-CODE (THE DEFAULT).  THIS IS USED IF THE CALLING
002900*        PROGRAM WANTS TO CHECK FOR THE POSSIBILITY THAT THE USER
003000*        IS ENTERING AN "ALTERNATE KEY" IN PLACE OF A CORP-CODE
003100*        FIELD (IE "ADAMAX" IN PLACE OF "2610154").  IF IT IS
003200*        DETERMINED BY THIS ROUTINE (USING THE "MALTKEY" DATASET)
003300*        THAT THE USER HAS ENTERED AND ALTERNATE KEY, THIS PGM
003400*        RETURNS THE ACTUAL CORP CODE TO THE CALLING PROGRAM.
003500*        IF NO ALT KEY WAS FOUND, THIS PGM RETURNS THE ORIGINAL
003600*        CODE PASSED TO IT.
003700*
003800*    PARAMETERS:
003900*
004000*    RET-CODE            -  "AD" IS PASSED FOR AN ADD, "DL" IS
004100*                           PASSED FOR A DELETE, AND THE DEFAULT
004200*                           (ANYTHING ELSE PASSED) IS INQUIRE.
004300*                           "00" IS RETURNED IF NO FATAL ERRORS
004400*                           ENCOUNTERED, "AT" IS RETURNED IF KEY
004500*                           ALREADY EXISTS, AND "BU" IS RETURNED
004600*                           IF ANOTHER FATAL ERROR OCCURS.
004700*
004800*    BASE                -  THE "BASE" FIELD OF THE OPENED "STORES"
004900*                           DATABASE MUST BE PASSED TO THIS PROGRAM.
005000*
005100*    STATUS-AREA         -  ANY DATABASE ERRORS WILL BE RETURNED
005200*                           IN THE "COND-WORD" PARAMETER OF THE
005300*                           STATUS AREA.
005400*
005500*    ALT-KEY             -  THE ENTERED CODE THAT IS SUSPECTED OF
005600*                           BEING AN "ALTERNATE KEY", OR THE ALT
005700*                           KEY TO DELETE OR ADD MUST BE PASSED
005800*                           HERE.
005900*
006000*    CORP-CODE           -  ON AN ADD, THE ACTUAL CORP CODE
006100*                           FOR THE ALTERNATE KEY MUST BE PASSED.
006200*                           ON AN INQUIRY, THE ACTUAL CORP CODE
006300*                           FOR THE ALT KEY IS RETURNED IF THERE
006400*                           IS ONE, OTHERWISE THE "ALT KEY" PASSED
006500*                           IS RETURNED.  ON A DELETE, THIS PARM
006600*                           IS IGNORED.
006700*
006800*
006900*    PROGRAMMING NOTES:
007000*       IN ORDER TO MAKE YOUR PROGRAM MORE EFFECIENT, IT IS
007100*       ADVISED TO USE THE SEGMENTER TO PUT THIS SUBPROGRAM
007200*       RBMs INTO THE SAME SEGMENT AS YOUR MAIN PROGRAM
007300*       IN YOUR FINAL VERSION. THIS WILL AVOID THE OVERHEAD
007400*       OF GOING FROM ONE SEGMENT TO ANOTHER (AND THEN BACK
007500*       AGAIN) UPON DATA ENTRY OF THE CORPORATE CODE.
007600*
007700 ENVIRONMENT DIVISION.
007800 CONFIGURATION SECTION.
007900 SOURCE-COMPUTER.  HP-3000.
008000 OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MALTKEY
                  ASSIGN TO DATABASE-MCFLCS3001
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

008100
008200 DATA DIVISION.
       FILE SECTION.
       FD  MALTKEY
           LABEL RECORDS ARE STANDARD.
       01  MALTKEY-REC.
           COPY DDS-MCRPCS3000  OF MCFLCS3001.

008300 WORKING-STORAGE SECTION.
008400
008500 77  SAVE-RET-CODE              PIC X(2)  VALUE SPACES.
008600**************************************************************
008700**                                                          **
008800**            D A T A B A S E   W O R K                     **
008900**                                                          **
009000**************************************************************
009100
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

009200 01  DSET-NAMES.
009300     05  DSET-MALTKEY           PIC X(16)  VALUE "MALTKEY;".
009400
009500 01  MALTKEY-LIST.
009600     05  FILLER            PIC X(17) VALUE "CORPCODE-ALT-KEY,".
009700     05  FILLER            PIC X(10) VALUE "CORP-CODE;".
009800
009900 01  CORPCODE-ALT-KEY-ARG  PIC X(40) VALUE SPACES.
010000
010100 01  MODE-AREA.
010200     05  MODE1                  PIC S9(4)   COMP       VALUE 1.
010300     05  MODE3                  PIC S9(4)   COMP       VALUE 3.
010400     05  MODE7                  PIC S9(4)   COMP       VALUE 7.
010500
010600**************************************************************
010700**                                                          **
010800**             D A T A B A S E   B U F F E R S              **
010900**                                                          **
011000**************************************************************
011100
011200 01  BUF-MALTKEY.
011300     05  CORPCODE-ALT-KEY         PIC X(40).
011400     05  ALT-CORP-CODE            PIC X(8).
011500
011600**************************************************************
011700**                                                          **
011800**            L I N K A G E   S E C T I O N                 **
011900**                                                          **
012000**************************************************************
012100
012200 LINKAGE SECTION.
012300 01  RET-CODE                  PIC X(2).
012400
012500 01  BASE                      PIC X(20).
012600
012700 01  STATUS-AREA.
012800     05  COND-WORD              PIC S9(4)  COMP-4.
012900     05  DATA-LENG              PIC S9(4)  COMP-4.
013000     05  RCD-NO                 PIC S9(9)  COMP-4.
013100     05  CHAIN-LENG             PIC S9(9)  COMP-4.
013200     05  BKWD-ADDR              PIC S9(9)  COMP-4.
013300     05  FWRD-ADDR              PIC S9(9)  COMP-4.
013400
013500 01  ALT-KEY.
013600     05  ALT-KEY-1-7       PIC X(7).
013700     05  ALT-KEY-8-40      PIC X(33).
013800
013900 01  CORP-CODE             PIC X(8).
014000
014100 PROCEDURE DIVISION USING RET-CODE, BASE, STATUS-AREA,
014200     ALT-KEY CORP-CODE.
014300 6000-MAIN.

014400     MOVE RET-CODE   TO  SAVE-RET-CODE.
014500     MOVE "00"       TO  RET-CODE.
014600
014700     IF SAVE-RET-CODE = "AD"
014800         PERFORM 6300-ADD THRU 6390-A-X
014900     ELSE
015000     IF SAVE-RET-CODE = "DL"
015100         PERFORM 6400-DELETE THRU 6490-D-X
015200     ELSE
015300         PERFORM 6200-INQUIRE THRU 6290-I-X.
015400
015500     GOBACK.
015600
015700 6110-DBLOCK.
015800*    CALL "DBLOCK" USING BASE, DSET-MALTKEY, MODE3, STATUS-AREA.
015900*    IF COND-WORD NOT = 0
016000*        MOVE "BU"   TO  RET-CODE
016100*        GOBACK.
016200*
016300 6120-DBUNLOCK.
016400*    CALL "DBUNLOCK" USING BASE, DSET-MALTKEY, MODE1, STATUS-AREA.
016500*    IF COND-WORD NOT = 0
016600*        MOVE "BU"   TO  RET-CODE
016700*        GOBACK.
016800*
016900 6300-ADD.
017000     PERFORM 6110-DBLOCK.
           OPEN I-O MALTKEY.
017100
017200     MOVE ALT-KEY    TO  CORPCODE-ALT-KEY.
017300     MOVE CORP-CODE  TO  ALT-CORP-CODE.
017400*    CALL "DBPUT" USING BASE, DSET-MALTKEY, MODE1, STATUS-AREA,
017500*       MALTKEY-LIST, BUF-MALTKEY.
           MOVE 0 TO COND-WORD.
           WRITE MALTKEY-REC FROM BUF-MALTKEY
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS = 22
               MOVE 43 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
017600     IF COND-WORD = 43
017700         MOVE "AT"  TO RET-CODE
017800     ELSE
017900     IF COND-WORD NOT = 0
018000         PERFORM 6120-DBUNLOCK
018100         MOVE "BU"  TO RET-CODE
018200         GO TO 6390-A-X.
018300
           CLOSE MALTKEY.
018400     PERFORM 6120-DBUNLOCK.
018500
018600 6390-A-X.
018700     EXIT.
018800
018900 6400-DELETE.
019000     PERFORM 6110-DBLOCK.
           OPEN I-O MALTKEY.
019100
019200     MOVE ALT-KEY             TO  CORPCODE-ALT-KEY-ARG.
019300*    CALL "DBGET" USING BASE, DSET-MALTKEY, MODE7, STATUS-AREA,
019400*      MALTKEY-LIST, BUF-MALTKEY, CORPCODE-ALT-KEY-ARG.
           MOVE 0 TO COND-WORD.
           MOVE CORPCODE-ALT-KEY-ARG TO CORPALTKEY OF MALTKEY-REC.
           READ MALTKEY INTO BUF-MALTKEY
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
019500     IF COND-WORD = 17
019600         GO TO 6410-UNLOCK
019700     ELSE
019800     IF COND-WORD NOT = 0
019900         PERFORM 6120-DBUNLOCK
020000         MOVE "BU"             TO  RET-CODE
020100         GO TO 6490-D-X.
020200
020300*    CALL "DBDELETE" USING BASE, DSET-MALTKEY, MODE1, STATUS-AREA.
           MOVE 0 TO COND-WORD.
           DELETE MALTKEY INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
020400     IF COND-WORD NOT = 0
020500         PERFORM 6120-DBUNLOCK
020600         MOVE "BU"             TO  RET-CODE
020700         GO TO 6490-D-X.
020800
020900 6410-UNLOCK.
           CLOSE MALTKEY.
021000     PERFORM 6120-DBUNLOCK.
021100
021200 6490-D-X.
021300     EXIT.
021400
021500 6200-INQUIRE.
021600*---------- THIS ROUTINE CHECKS THE ALT KEY DATASET FOR THE
021700*           POSSIBILITY THAT THE USER IS ACTUALLY ENTERING AN
021800*           "ALTERNATE KEY" (IE "ADAMAX" FOR 2610154).  IF SO,
021900*           PUT THE ACTUAL CORP CODE, AS DETERMINED BY THE ALT
022000*           KEY DATASET, INTO THE CORP CODE RETURN FIELD.
022100
           OPEN INPUT MALTKEY.
022200     MOVE "00"                 TO  RET-CODE.
022300
022400*---------- IF THE CORP CODE IS 7 DIGITS, IT CANT BE AN ALTERNATE
022500*           KEY
022600
022700     IF ALT-KEY-1-7 NUMERIC
022800         IF ALT-KEY-8-40 = SPACES
022900             MOVE ALT-KEY      TO  CORP-CODE
023000             GO TO 6290-I-X.
023100
023200*---------- NOTE - THE CHECK FOR COND CODE -21 (DATA SET NOT
023300*           EXIST) IS FOR SOME PLANTS THAT DO NOT YET HAVE THE
023400*           NEW DATABASE.  ONCE ALL PLANTS HAVE THE NEW DATABASE,
023500*           THIS CODE CAN BE REMOVED.
023600
023700     MOVE ALT-KEY         TO  CORPCODE-ALT-KEY-ARG.
023800*    CALL "DBGET" USING BASE DSET-MALTKEY MODE7 STATUS-AREA
023900*      MALTKEY-LIST BUF-MALTKEY CORPCODE-ALT-KEY-ARG.
           MOVE 0 TO COND-WORD.
           MOVE CORPCODE-ALT-KEY-ARG TO CORPALTKEY OF MALTKEY-REC.
           READ MALTKEY INTO BUF-MALTKEY
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
024000     IF COND-WORD = 0
024100         MOVE ALT-CORP-CODE    TO  CORP-CODE
024200     ELSE
024300     IF COND-WORD = 17 OR -21
024400         MOVE ALT-KEY          TO  CORP-CODE
024500     ELSE
024600         MOVE "BU"             TO  RET-CODE
024700         GO TO 6290-I-X.
024800
           CLOSE MALTKEY.

024900 6290-I-X.
025000     EXIT.
