001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.          TALTVENK.
001300 AUTHOR.              W L MCINTYRE
001400 DATE-WRITTEN.        MAY, 01 1995.
001500 DATE-COMPILED.
001600*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
001700*SECURITY.
001800*REMARKS.  THIS SUBPROGRAM PERFORMS THE FOLLOWING FUNCTION:
002700*    1.  INQUIRE ON AN ALTERNATE KEY.  ANYTHING BUT "AD" OR "DL"
002800*        IS IN RET-CODE (THE DEFAULT).  THIS IS USED IF THE CALLING
002900*        PROGRAM WANTS TO CHECK FOR THE POSSIBILITY THAT THE USER
003000*        IS ENTERING AN "ALTERNATE KEY" IN PLACE OF A VENDOR CODE
003100*        FIELD (IE "BARCO1" IN PLACE OF "0801056000").  IF IT IS
003200*        DETERMINED BY THIS ROUTINE (USING THE "MALTVEN" DATASET)
003300*        THAT THE USER HAS ENTERED AND ALTERNATE KEY, THIS PGM
003400*        RETURNS THE ACTUAL VENDOR CODE TO THE CALLING PROGRAM.
003500*        IF NO ALT KEY WAS FOUND, THIS PGM RETURNS THE ORIGINAL
003600*        CODE PASSED TO IT.
003700*
003800*    PARAMETERS:
003900*
004000*    RET-CODE            -  THE DEFAULT RETURN CODE IS SET FOR
004100*                           INQUIRE.  "00" IS RETURNED IF NO
004200*                           FATAL ERRORS ENCOUNTERED, "BU" IS
004300*                           RETURNED IF A FATAL ERROR OCCURS.
004700*
004800*    BASE                -  THE "BASE" FIELD OF THE OPENED "STORES"
004900*                           DATABASE MUST BE PASSED TO THIS PROGRAM.
005000*
005100*    STATUS-AREA         -  ANY DATABASE ERRORS WILL BE RETURNED
005200*                           IN THE "COND-WORD" PARAMETER OF THE
005300*                           STATUS AREA.
005400*
005500*    ALT-KEY             -  THE ENTERED CODE THAT IS SUSPECTED OF
005600*                           BEING AN "ALTERNATE KEY", OR THE ALT
005700*                           KEY TO DELETE OR ADD MUST BE PASSED
005800*                           HERE.
005900*
006000*    VENDOR-CODE         -  THE ACTUAL VENDOR CODE FOR THE ALT
006100*                           KEY IS RETURNED IF THERE IS ONE,
006400*                           OTHERWISE THE "ALT KEY" PASSED
006500*                           IS RETURNED.
006700*
006800*
006900*    PROGRAMMING NOTES:
007000*       IN ORDER TO MAKE YOUR PROGRAM MORE EFFECIENT, IT IS
007100*       ADVISED TO USE THE SEGMENTER TO PUT THIS SUBPROGRAM
007200*       RBMs INTO THE SAME SEGMENT AS YOUR MAIN PROGRAM
007300*       IN YOUR FINAL VERSION. THIS WILL AVOID THE OVERHEAD
007400*       OF GOING FROM ONE SEGMENT TO ANOTHER (AND THEN BACK
007500*       AGAIN) UPON DATA ENTRY OF THE CORPORATE CODE.
007600*
007700 ENVIRONMENT DIVISION.
007800 CONFIGURATION SECTION.
007900 SOURCE-COMPUTER.  HP-3000.
008000 OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MALTVEN
                  ASSIGN TO DATABASE-MCFLCS5801
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

008100
008200 DATA DIVISION.
       FILE SECTION.
       FD  MALTVEN
           LABEL RECORDS ARE STANDARD.
       01  MALTVEN-REC.
           COPY DDS-MCRPCS5800  OF MCFLCS5801.

008300 WORKING-STORAGE SECTION.
008400
008500 77  SAVE-RET-CODE              PIC X(2)  VALUE SPACES.
008600**************************************************************
008700**                                                          **
008800**            D A T A B A S E   W O R K                     **
008900**                                                          **
009000**************************************************************
009100
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

009200 01  DSET-NAMES.
009300     05  DSET-MALTVEN             PIC X(16)  VALUE "MALTVEN;".
009400
009500 01  MALTVEN-LIST.
009600     05  FILLER            PIC X(15) VALUE "VENDOR-ALT-KEY,".
009700     05  FILLER            PIC X(10) VALUE "VEND-CODE;".
009800
009900 01  VENDOR-ALT-KEY-ARG  PIC X(10) VALUE SPACES.
010000
010100 01  MODE-AREA.
010200     05  MODE1                  PIC S9(4)   COMP       VALUE 1.
010300     05  MODE3                  PIC S9(4)   COMP       VALUE 3.
010400     05  MODE7                  PIC S9(4)   COMP       VALUE 7.
010500
010600**************************************************************
010700**                                                          **
010800**             D A T A B A S E   B U F F E R S              **
010900**                                                          **
011000**************************************************************
011100 COPY MALTVEN OF COPYLIB.
011500
011600**************************************************************
011700**                                                          **
011800**            L I N K A G E   S E C T I O N                 **
011900**                                                          **
012000**************************************************************
012100
012200 LINKAGE SECTION.
012300 01  RET-CODE                  PIC X(2).
012400
012500 01  BASE                      PIC X(20).
012600
012700 01  STATUS-AREA.
012800     05  COND-WORD              PIC S9(4)  COMP-4.
012900     05  DATA-LENG              PIC S9(4)  COMP-4.
013000     05  RCD-NO                 PIC S9(9)  COMP-4.
013100     05  CHAIN-LENG             PIC S9(9)  COMP-4.
013200     05  BKWD-ADDR              PIC S9(9)  COMP-4.
013300     05  FWRD-ADDR              PIC S9(9)  COMP-4.
013400
013500 01  ALT-KEY               PIC X(10).
013800
013900 01  VEND-CODE             PIC X(10).
014000
014100 PROCEDURE DIVISION USING RET-CODE, BASE, STATUS-AREA,
014200     ALT-KEY VEND-CODE.
014300 6000-MAIN.

014400     MOVE RET-CODE   TO  SAVE-RET-CODE.
014500     MOVE "00"       TO  RET-CODE.
014600
015300     PERFORM 6100-INQUIRE THRU 6190-I-X.
015400
015500     GOBACK.
015600
021500 6100-INQUIRE.
021600*---------- THIS ROUTINE CHECKS THE ALT KEY DATASET FOR THE
021700*           POSSIBILITY THAT THE USER IS ACTUALLY ENTERING AN
021800*           "ALTERNATE KEY" (IE "BARCO1" FOR 0801056000).  IF SO,
021900*           PUT THE ACTUAL VENDOR CODE, AS DETERMINED BY THE ALT
022000*           KEY DATASET, INTO THE VENDOR CODE RETURN FIELD.
022100
           OPEN INPUT MALTVEN.
022200     MOVE "00"                 TO  RET-CODE.
022300
023200*---------- NOTE - THE CHECK FOR COND CODE -21 (DATA SET NOT
023300*           EXIST) IS FOR SOME PLANTS THAT DO NOT YET HAVE THE
023400*           NEW DATABASE.  ONCE ALL PLANTS HAVE THE NEW DATABASE,
023500*           THIS CODE CAN BE REMOVED.
023600
023700     MOVE ALT-KEY         TO  VENDOR-ALT-KEY-ARG.
023800*    CALL "DBGET" USING BASE DSET-MALTVEN MODE7 STATUS-AREA
023900*      MALTVEN-LIST BUF-MALTVEN VENDOR-ALT-KEY-ARG.
           MOVE 0 TO COND-WORD.
           MOVE VENDOR-ALT-KEY-ARG TO VENCALTKEY OF MALTVEN-REC.
           READ MALTVEN INTO BUF-MALTVEN
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
024000     IF COND-WORD = 0
024100         MOVE ALT-VENDOR-CODE  TO  VEND-CODE
024200     ELSE
024300     IF COND-WORD = 17 OR -21
024400         MOVE ALT-KEY          TO  VEND-CODE
024500     ELSE
024600         MOVE "BU"             TO  RET-CODE
024700         GO TO 6190-I-X.
024800
           CLOSE MALTVEN.

024900 6190-I-X.
025000     EXIT.
