000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          TALTMAIN.
000400 AUTHOR.              C HILLES.
000500 DATE-WRITTEN.        02/19/88.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*D   THIS IS THE EXECUTIVE PROGRAM FOR THE ALTERNATE KEY PROGRAMS
001100*D   ADD, MODIFY, AND DELETE OF ALTERNATE KEYS FOR CORPORATE
001200*D   CODES.
      *C
      *C   03FEB1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
001300
001400 ENVIRONMENT DIVISION.
001500 CONFIGURATION SECTION.
001600 SOURCE-COMPUTER.  HP-3000.
001700 OBJECT-COMPUTER.  HP-3000.
001800
001900 DATA DIVISION.
002000 WORKING-STORAGE SECTION.
002100
       77  MCXCBLERR-SCOPE               PIC X(1)  VALUE "C".

002200**************************************************************
002300**                                                          **
002400**           S U B P R O G R A M   A R E A S                **
002500**                                                          **
002600**************************************************************
002700
002800 COPY TBLOWUP    IN COPYLIB.
002900 COPY TSHWRDFM   IN COPYLIB.
003000 COPY CSWITCHF   IN COPYLIB.
003100
003200**************************************************************
003300**                                                          **
003400**                  V I E W   W O R K                       **
003500**                                                          **
003600**************************************************************
003700
       COPY VCOMAREA IN COPYLIB.
008400 01  FORMFILE.
008500     05  FORM-FNAME                PIC X(8)  VALUE "FALTMAIN".
008600     05  FORM-GNAME.
008700         10  FORM-GNAME1           PIC X(5)  VALUE "FLANG".
008800         10  FORM-GNAME2           PIC X(3)  VALUE SPACES.
008900     05  FILLER                    PIC X(19) VALUE SPACES.
009000
009100 01  MESSAGE-BUFLEN            PIC S9(4)    VALUE 76      BINARY.
009200
009300 01  MESSAGE-ACTLEN            PIC S9(4)    VALUE ZERO    BINARY.
009400
009500 01  MESSAGE-BUFFER.
009600     05  MSG-TEXT              PIC X(68)    VALUE SPACE.
009700     05  MSG-FLD               PIC X(8)     VALUE SPACE.
009800     05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC ZZZZZZZ9.
009900
010000**************************************************************
010100**                                                          **
010200**            D A T A B A S E   W O R K                     **
010300**                                                          **
010400**************************************************************
010500
010600 01  BASE                          PIC X(24) VALUE "  STORES;".
010700 01  PASSWORD                      PIC X(5)  VALUE "JADE;".
010800 01  BASE-MMISA                    PIC X(24) VALUE "  MMISA;".
010900 01  BASE-BUDGET                   PIC X(24) VALUE "  BUDGET;".
011000 01  MMIS-PASSWORD                 PIC X(7)  VALUE "DO-ALL;".
011100 01  DSET-DUMMY                    PIC X(2)  VALUE SPACES.
011200
011300 COPY DBSTAT     IN COPYLIB.
011400 01  MODE-AREA.
011500     05  MODE1                     PIC S9(4) BINARY VALUE 1.
011600     05  MODE7                     PIC S9(4) BINARY VALUE 7.
011700
011800 01  ALL-ITEMS                     PIC X(2)  VALUE "@;".
011900
012000 01  PLT-ARG                       PIC X(4)  VALUE SPACES.
012100
012200**************************************
012300*                                    *
012400*    NATIVE LANGUAGE SUPPORT AREA    *
012500*                                    *
012600**************************************
012700
012800 COPY LANGUAGE IN COPYLIB.
012900
013000
013100 PROCEDURE DIVISION.
013200 1-HOUSEKEEP SECTION.
013300
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.

013400*-------- STORES DB WILL BE OPENED BEHIND-THE-BACK
           PERFORM 9999-OPEN-STUFF.

015900*------- USE SUBPROG TO OPEN FORMFILE - HANDLES VIEW ERRORS
016000     MOVE "Y"                      TO   CSF-FIRST-OPENFORMF-FLAG.
016100     PERFORM 7150-CALL-CSWITCHF.
016200
016300     CALL "SOPENTRM" USING VIEW-COMAREA, BU-DISPLAY-MSG.
016400     IF BU-DISPLAY-MSG-1 NOT = SPACES
016500         PERFORM 2100-BLOWUP.
016600
016700     PERFORM 6000-MAIN THRU 6990-MAIN-X.
016800
016900 1-EOJ.
           PERFORM 9999-CLOSE-STUFF.
           GOBACK.
017600
017700 2100-BLOWUP.
017800     MOVE "TALTMAIN"                TO   BU-PGM-NAME.
017900     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
018000       VIEW-COMAREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
018100       BU-DISPLAY-FLDS.
018200
018300 6000-MAIN.
018400     CALL "SALTKEYS" USING BASE, VIEW-COMAREA, SRF-COMAREA,
018500       LANGUAGE-PARMS.
018600
018700 6990-MAIN-X.
018800     EXIT.
018900
019000 7150-CALL-CSWITCHF.
019100     CALL "CSWITCHF" USING VIEW-COMAREA, LANGUAGE-PARMS,
019200       FORMFILE, CSF-PARMS, BU-DISPLAY-MSG.
019300     IF BU-DISPLAY-MSG-1 NOT = SPACES
019400         PERFORM 2100-BLOWUP.

       9999-OPEN-STUFF.
       9999-CLOSE-STUFF.
