000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TALTLOAD.
000400 AUTHOR.     C HILLES.
000500 DATE-WRITTEN. AUGUST, 1984.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*
001100*    THIS PROGRAM LOADS UP THE "MALTKEY" (ALTERNATE KEY)
001200*    DATASET FROM THE "DDESC" DATASET, FOR CHEMICALS.  IT
001300*    FINDS MAJOR GROUP 26 AND 27 KEYWORD/ADJECTIVE AND PUTS
001400*    THE ADJECTIVE IN AS THE ALTERNATE KEY.  FOR EXAMPLE,
001500*    THE CORPCODE 26464502 "CODE      ACTINE" WOULD BE ADDED
001600*    INTO THE ALTERNATE KEY DATASET AS "ACTINE" WITH A
001700*    CROSS REFERENCE TO 2646502.
001800*
      *C
      *C   07FEB1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
      *C   07APR1994    DAVE PLUM       REQUEST #6490
      *C     REMOVED REFERENCES TO "C O P Y D B" TYPE COPYLIBS.
      *C
001900 ENVIRONMENT DIVISION.
002000 CONFIGURATION SECTION.
002100 SOURCE-COMPUTER.  HP-3000.
002200 OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DDESC-CD-I
               ASSIGN TO DATABASE-MCFLCS1401
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
002400
002500 DATA DIVISION.
002600*------ FD STATEMENT AREA FOR IBM ONLY ------*
002700 FILE SECTION.
002800 FD  DDESC-CD-I
002900     LABEL RECORDS ARE STANDARD.
003000 01  DDESC-CD-REC-I.
003100     COPY DDS-MCRPCS1400  OF MCFLCS1401.
003200
003400*------ FD STATEMENT AREA FOR IBM ONLY ------*
003500 WORKING-STORAGE SECTION.
003600 01  HANDLE-BLOWUP-FLAG            PIC X(1)  VALUE "Y".
003700
003800*************************************************************
003900**                                                          **
004000**          C O M M U N I C A T I O N S   A R E A S         **
004100**                                                          **
004200**************************************************************
004300
       01  MCXCBLERR-SCOPE               PIC X(1)  VALUE "C".

004400 COPY TBLOWUP IN COPYLIB.
004500
004600*** PARMS FOR CALL TO "TALTKEY"
004700
004800 01  ALT-KEY                       PIC X(40).
004900
005000*** PARM FOR CALL TO ANY SUBPROGRAM
005100
005200 01  RET-CODE                      PIC X(2)  VALUE SPACES.
005300
005400
005500**************************************************************
005600**                                                          **
005700**            D A T A B A S E   W O R K                     **
005800**                                                          **
005900**************************************************************
006000 01  FILE-STATUS.
006100     05  FILE-STATUS-1             PIC X  VALUE "0".
006200     05  FILE-STATUS-2             PIC X  VALUE "0".
006300 COPY DBSTAT IN COPYLIB.
006400 01  BASE                          PIC X(10) VALUE "  STORES;".
006500 01  PASSWORD                      PIC X(8)  VALUE "JADE;   ".
006600 01  DB-DATASETS.
006700     05  DSET-DDESC                PIC X(16)  VALUE "DDESC;".
006800
006900 01  MODE-AREA.
007000     05  MODE1                  PIC S9(4)   COMP       VALUE 1.
007100     05  MODE2                  PIC S9(4)   COMP       VALUE 2.
007200     05  MODE3                  PIC S9(4)   COMP       VALUE 3.
007300     05  MODE7                  PIC S9(4)   COMP       VALUE 7.
007400
007500 01  ITEM-LISTS.
007600     05  CODE-SEARCH               PIC X(10) VALUE "CORP-CODE;".
007700
007800 01  CODE-ARG                      PIC X(8)  VALUE SPACES.
007900 01  ALL-ITEMS                     PIC X(2)  VALUE "@;".
008000
008100**************************************************************
008200**                                                          **
008300**           D A T A B A S E   B U F F E R S                **
008400**                                                          **
008500**************************************************************
008600
008700 01  BUF-DDESC.
008800     05  DDESC-CORP-CODE.
008900         10  DDESC-CORP-CODE-1-2   PIC X(2).
009000         10  FILLER                PIC X(6).
009100     05  DDESC-ID-NUM              PIC X(2).
009200     05  DDESC-DATA.
009300         10  DDESC-KEYWORD         PIC X(20).
009400         10  DDESC-ADJECTIVE       PIC X(30).
009500         10  FILLER                PIC X(30).
009600
009700 PROCEDURE DIVISION.
009800 1-HOUSEKEEP SECTION.
009900 1-BEGIN-HOUSEKEEP.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.
010000     PERFORM 9999-OPEN-STUFF.
010100     PERFORM 6000-MAIN THRU 6990-MAIN-X.
010200
010300 2000-EOJ.
010400     PERFORM 9999-CLOSE-STUFF.
010500     GOBACK.
010600
010700 2100-BLOWUP.
010800     MOVE DDESC-ADJECTIVE          TO  BU-DISPLAY-FLD (1).
010900     MOVE DDESC-CORP-CODE          TO  BU-DISPLAY-FLD (2).
011000     MOVE ALT-KEY                  TO  BU-DISPLAY-FLD (3).
011100     MOVE RET-CODE                 TO  BU-DISPLAY-FLD (4).
011200     CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
011300       DUMMY-VIEW-AREA FILE-STATUS BU-DISPLAY-MSG
011400       BU-DISPLAY-FLDS.
011500
011600 6000-MAIN.
011700 6100-SERIAL-READ.
011800     PERFORM 9999-GETSER-DDESC-CD-I.
011900     IF END-OF-FILE
012000         GO TO 6990-MAIN-X.
012100
012200     IF DDESC-CORP-CODE-1-2 = "27" AND
012300     DDESC-KEYWORD = "CODE                " AND
012400     DDESC-ADJECTIVE > " "
012500         MOVE DDESC-ADJECTIVE      TO  ALT-KEY
012600         MOVE "AD"                 TO  RET-CODE
012700         CALL "TALTKEY" USING RET-CODE, BASE, STATUS-AREA,
012800           ALT-KEY, DDESC-CORP-CODE
012900         IF RET-CODE = "AT"
013000             DISPLAY "CODE ", DDESC-CORP-CODE, " ALT KEY ",
013100             DDESC-ADJECTIVE, " ALREADY EXISTS"
013200         ELSE
013300         IF RET-CODE = "BU"
013400             MOVE "TALTKEY ERROR"  TO  BU-DISPLAY-MSG
013500                 PERFORM 2100-BLOWUP.
013600
013700     IF DDESC-CORP-CODE-1-2 = "26"
013800         IF DDESC-ID-NUM = "00"
013900             MOVE DDESC-ADJECTIVE  TO  ALT-KEY
014000             MOVE "AD"             TO  RET-CODE
014100             CALL "TALTKEY" USING RET-CODE, BASE, STATUS-AREA,
014200               ALT-KEY, DDESC-CORP-CODE
014300             IF RET-CODE = "AT"
014400                 DISPLAY "CODE ", DDESC-CORP-CODE, " ALT KEY ",
014500                 DDESC-ADJECTIVE, " ALREADY EXISTS"
014600             ELSE
014700             IF RET-CODE = "BU"
014800                 MOVE "TALTKEY ERROR" TO BU-DISPLAY-MSG
014900                 PERFORM 2100-BLOWUP.
015000
015100*---------- FOR RAW MATERIAL FABRICS, THE FABRIC CODE IS CONTAINED
015200*           SOMEWHERE WITHIN THE 2CD LINE OF DESCRIPTION.  THIS
015300*           CODE IS TO BE USED AS THE ALTERNATE KEY.  THE SUBPROG
015400*           "TDETCODE" DETERMINES THIS CODE GIVEN 2CD LINE OF DESC.
015500
015600     IF DDESC-CORP-CODE-1-2 = "27"
015700         IF DDESC-ID-NUM = "01"
015800             CALL "TDETCODE" USING RET-CODE, DDESC-DATA,
015900               ALT-KEY
016000             IF RET-CODE = "00"
016100                  MOVE "AD"        TO  RET-CODE
016200                  CALL "TALTKEY" USING RET-CODE, BASE, STATUS-AREA,
016300                    ALT-KEY, DDESC-CORP-CODE
016400                  IF RET-CODE = "AT"
016500                     DISPLAY "CODE ", DDESC-CORP-CODE, " ALT KEY ",
016600                     ALT-KEY, " ALREADY EXISTS"
016700                  ELSE
016800                  IF RET-CODE NOT = "00"
016900                      MOVE "TALTKEY ERROR" TO BU-DISPLAY-MSG
017000                      PERFORM 2100-BLOWUP.
017100
017200     GO TO 6100-SERIAL-READ.
017300
017400 6990-MAIN-X.
017500     EXIT.
017600
       9999-OPEN-STUFF.
           OPEN INPUT DDESC-CD-I                                 .

       9999-CLOSE-STUFF.
           CLOSE      DDESC-CD-I                                 .

       9999-GETSER-DDESC-CD-I.
           MOVE 0 TO COND-WORD.
           READ DDESC-CD-I NEXT INTO BUF-DDESC
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETSER ERR 9999-GETSER-DDESC-CD-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.
