000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TALWONO.
000400 INSTALLATION.  GOODYEAR TIRE & RUBBER CO.
000500 DATE-WRITTEN.  SEPT 26, 1978.
001200 ENVIRONMENT DIVISION.
001300 CONFIGURATION SECTION.
001400 SOURCE-COMPUTER.    AS400.
001500 OBJECT-COMPUTER.    AS400.
001700 DATA DIVISION.
001800 WORKING-STORAGE SECTION.
001900 77  ALL-RECS-SW                     PIC X.
002000
002100 LINKAGE SECTION.
002200 01  WO-NUMBER.
002300     05  WO-NUM-NUMBER.
002400         10  WO-NUM-01.
002500             15  WO-NUM-01-9         PIC 9.
002600         10  WO-NUM-02.
002700             15  WO-NUM-02-9         PIC 9.
002800         10  WO-NUM-03.
002900             15  WO-NUM-03-9         PIC 9.
003000         10  WO-NUM-04.
003100             15  WO-NUM-04-9         PIC 9.
003200         10  WO-NUM-05.
003300             15  WO-NUM-05-9         PIC 9.
003400         10  WO-NUM-06.
003500             15  WO-NUM-06-9         PIC 9.
003600     05  WO-NUM-YEAR                 PIC X.
003700     05  WO-NUM-SUFFIX.
003800         10  WO-SUFFIX-1.
003900             15  WO-SUFFIX-1-9       PIC 9.
004000         10  WO-SUFFIX-2.
004100             15  WO-SUFFIX-2-9       PIC 9.
004200         10  WO-SUFFIX-3.
004300             15  WO-SUFFIX-3-9       PIC 9.
004400
004500 01  RETURN-CODE.
004600     05  RET-CODE                    PIC X.
004700     05  FILLER                      PIC X.
004800
004900 PROCEDURE DIVISION USING WO-NUMBER,
005000                          RETURN-CODE.
005100 BEGIN.
005200     PERFORM 1-HSK.
005300     PERFORM 6-MAIN.
005400
005500 2-EOJ.
005600     GOBACK.
005700
005800 1-HSK.
005900     MOVE "N" TO ALL-RECS-SW.
006000     IF WO-NUM-YEAR IS ALPHABETIC AND WO-NUM-YEAR NOT = " "
006100         PERFORM 11-FILL-BLANKS UNTIL ALL-RECS-SW = "Y".
006200
006300 11-FILL-BLANKS.
006400     IF WO-NUM-06 IS NUMERIC
006500         IF WO-NUM-05 IS NUMERIC
006600             IF WO-NUM-04 IS NUMERIC
006700                 IF WO-NUM-03 IS NUMERIC
006800                     IF WO-NUM-02 IS NUMERIC
006900                         IF WO-NUM-01 IS NUMERIC
007000                             MOVE "Y" TO ALL-RECS-SW
007100                         ELSE
007200                             MOVE 0 TO WO-NUM-01
007300                     ELSE
007400                         MOVE WO-NUM-01 TO WO-NUM-02
007500                         MOVE 0 TO WO-NUM-01
007600                  ELSE
007700                     MOVE WO-NUM-02 TO WO-NUM-03
007800                     MOVE WO-NUM-01 TO WO-NUM-02
007900                     MOVE 0 TO WO-NUM-01
008000             ELSE
008100                 MOVE WO-NUM-03 TO WO-NUM-04
008200                 MOVE WO-NUM-02 TO WO-NUM-03
008300                 MOVE WO-NUM-01 TO WO-NUM-02
008400                 MOVE 0 TO WO-NUM-01
008500         ELSE
008600             MOVE WO-NUM-04 TO WO-NUM-05
008700             MOVE WO-NUM-03 TO WO-NUM-04
008800             MOVE WO-NUM-02 TO WO-NUM-03
008900             MOVE WO-NUM-01 TO WO-NUM-02
009000             MOVE 0 TO WO-NUM-01
009100     ELSE
009200         MOVE WO-NUM-05 TO WO-NUM-06
009300         MOVE WO-NUM-04 TO WO-NUM-05
009400         MOVE WO-NUM-03 TO WO-NUM-04
009500         MOVE WO-NUM-02 TO WO-NUM-03
009600         MOVE WO-NUM-01 TO WO-NUM-02
009700         MOVE 0 TO WO-NUM-01.
009800
009900 6-MAIN.
010000     IF WO-NUM-01 IS ALPHABETIC
010100         MOVE "1" TO RET-CODE
010200     ELSE
010300     MOVE "0" TO RET-CODE
010400     IF WO-NUM-02 IS ALPHABETIC AND WO-NUM-02 NOT = " "
010500         IF WO-NUM-03 NOT = " "
010600             MOVE WO-NUM-03 TO WO-SUFFIX-1
010700             MOVE WO-NUM-04 TO WO-SUFFIX-2
010800             MOVE WO-NUM-05 TO WO-SUFFIX-3
010900             MOVE SPACES TO WO-NUM-03 WO-NUM-04 WO-NUM-05
011000             MOVE WO-NUM-02 TO WO-NUM-YEAR
011100             MOVE WO-NUM-01 TO WO-NUM-06
011200             MOVE 0 TO WO-NUM-01-9 WO-NUM-02-9 WO-NUM-03-9
011300                 WO-NUM-04-9 WO-NUM-05-9
011400         ELSE
011500             MOVE WO-NUM-02 TO WO-NUM-YEAR
011600             MOVE WO-NUM-01 TO WO-NUM-06
011700             MOVE 0 TO WO-NUM-01-9 WO-NUM-02-9 WO-NUM-03-9
011800                 WO-NUM-04-9 WO-NUM-05-9
011900     ELSE
012000     IF WO-NUM-03 IS ALPHABETIC AND WO-NUM-03 NOT = " "
012100         IF WO-NUM-04 NOT = " "
012200             MOVE WO-NUM-04 TO WO-SUFFIX-1
012300             MOVE WO-NUM-05 TO WO-SUFFIX-2
012400             MOVE WO-NUM-06 TO WO-SUFFIX-3
012500             MOVE SPACES TO WO-NUM-04 WO-NUM-05 WO-NUM-06
012600             MOVE WO-NUM-03 TO WO-NUM-YEAR
012700             MOVE WO-NUM-02 TO WO-NUM-06
012800             MOVE WO-NUM-01 TO WO-NUM-05
012900             MOVE 0 TO WO-NUM-01-9 WO-NUM-02-9 WO-NUM-03-9
013000                 WO-NUM-04-9
013100         ELSE
013200             MOVE WO-NUM-03 TO WO-NUM-YEAR
013300             MOVE WO-NUM-02 TO WO-NUM-06
013400             MOVE WO-NUM-01 TO WO-NUM-05
013500             MOVE 0 TO WO-NUM-01-9 WO-NUM-02-9 WO-NUM-03-9
013600                 WO-NUM-04-9
013700     ELSE
013800     IF WO-NUM-04 IS ALPHABETIC AND WO-NUM-04 NOT = " "
013900         IF WO-NUM-05 NOT = " "
014000             MOVE WO-NUM-05 TO WO-SUFFIX-1
014100             MOVE WO-NUM-06 TO WO-SUFFIX-2
014200             MOVE WO-NUM-YEAR TO WO-SUFFIX-3
014300             MOVE SPACES TO WO-NUM-05 WO-NUM-06
014400             MOVE WO-NUM-04 TO WO-NUM-YEAR
014500             MOVE WO-NUM-03 TO WO-NUM-06
014600             MOVE WO-NUM-02 TO WO-NUM-05
014700             MOVE WO-NUM-01 TO WO-NUM-04
014800             MOVE 0 TO WO-NUM-01-9 WO-NUM-02-9 WO-NUM-03-9
014900         ELSE
015000             MOVE WO-NUM-04 TO WO-NUM-YEAR
015100             MOVE WO-NUM-03 TO WO-NUM-06
015200             MOVE WO-NUM-02 TO WO-NUM-05
015300             MOVE WO-NUM-01 TO WO-NUM-04
015400             MOVE 0 TO WO-NUM-01-9 WO-NUM-02-9 WO-NUM-03-9
015500     ELSE
015600     IF WO-NUM-05 IS ALPHABETIC AND WO-NUM-05 NOT = " "
015700         IF WO-NUM-06 NOT = " "
015800             MOVE WO-SUFFIX-1 TO WO-SUFFIX-3
015900             MOVE WO-NUM-YEAR TO WO-SUFFIX-2
016000             MOVE WO-NUM-06 TO WO-SUFFIX-1
016100             MOVE SPACES TO WO-NUM-06
016200             MOVE WO-NUM-05 TO WO-NUM-YEAR
016300             MOVE WO-NUM-04 TO WO-NUM-06
016400             MOVE WO-NUM-03 TO WO-NUM-05
016500             MOVE WO-NUM-02 TO WO-NUM-04
016600             MOVE WO-NUM-01 TO WO-NUM-03
016700             MOVE 0 TO WO-NUM-01-9 WO-NUM-02-9
016800         ELSE
016900             MOVE WO-NUM-05 TO WO-NUM-YEAR
017000             MOVE WO-NUM-04 TO WO-NUM-06
017100             MOVE WO-NUM-03 TO WO-NUM-05
017200             MOVE WO-NUM-02 TO WO-NUM-04
017300             MOVE WO-NUM-01 TO WO-NUM-03
017400             MOVE 0 TO WO-NUM-01-9 WO-NUM-02-9
017500     ELSE
017600     IF WO-NUM-06 IS ALPHABETIC AND WO-NUM-06 NOT = " "
017700         IF WO-NUM-YEAR NOT = " "
017800             MOVE WO-SUFFIX-2 TO WO-SUFFIX-3
017900             MOVE WO-SUFFIX-1 TO WO-SUFFIX-2
018000             MOVE WO-NUM-YEAR TO WO-SUFFIX-1
018100             MOVE WO-NUM-06 TO WO-NUM-YEAR
018200             MOVE WO-NUM-05 TO WO-NUM-06
018300             MOVE WO-NUM-04 TO WO-NUM-05
018400             MOVE WO-NUM-03 TO WO-NUM-04
018500             MOVE WO-NUM-02 TO WO-NUM-03
018600             MOVE WO-NUM-01 TO WO-NUM-02
018700             MOVE 0 TO WO-NUM-01-9
018800         ELSE
018900             MOVE WO-NUM-06 TO WO-NUM-YEAR
019000             MOVE WO-NUM-05 TO WO-NUM-06
019100             MOVE WO-NUM-04 TO WO-NUM-05
019200             MOVE WO-NUM-03 TO WO-NUM-04
019300             MOVE WO-NUM-02 TO WO-NUM-03
019400             MOVE WO-NUM-01 TO WO-NUM-02
019500             MOVE 0 TO WO-NUM-01-9.
