       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TAPPORTN.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       SPECIAL-NAMES.          REQUESTOR IS WORK-STATION
                               SYSTEM-CONSOLE IS CONSOLE
                               LOCAL-DATA IS LOCAL-DATA-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT WO-BASIC
                  ASSIGN       TO DATABASE-MCFLMM1001
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-PLANNED
                  ASSIGN       TO DATABASE-MCFLMM1101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-OPEN-Q-CC
                  ASSIGN       TO DATABASE-MCFLMM1903
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-OPEN-Q-WO
                  ASSIGN       TO DATABASE-MCFLMM1902
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZCFTHELP-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  WO-BASIC
           LABEL RECORDS ARE STANDARD.
       01  VWO-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1001.

       FD  WO-PLANNED
           LABEL RECORDS ARE STANDARD.
       01  PWO-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.

       FD  WO-OPEN-Q-CC
           LABEL RECORDS ARE STANDARD.
       01  QCC-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1903.

       FD  WO-OPEN-Q-WO
           LABEL RECORDS ARE STANDARD.
       01  QWO-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1902.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  LOOP-CTR            PIC S9(4) COMP-4 VALUE 0.
       77  FIND-SW             PIC S9(4) COMP-4 VALUE 0.
       77  DATE-SW             PIC S9(4) COMP-4 VALUE 0.
       77  SHORT-SW            PIC S9(4) COMP-4 VALUE 0.
       77  RESERVE-SW          PIC S9(4) COMP-4 VALUE 0.
       77  CW-SW               PIC S9(4) COMP-4 VALUE 0.
       77  TMIN                PIC S9(4) COMP-4 VALUE 0.
       77  LMIN                PIC S9(4) COMP-4 VALUE 0.
       77  STRT-MIN            PIC S9(4) COMP-4 VALUE 0.
       77  STOP-MIN            PIC S9(4) COMP-4 VALUE 0.
       77  ROOT-HOURS          PIC S9(4) COMP-4 VALUE 0.
       77  HR-MIN              PIC S9(4) COMP-4 VALUE 0.
       77  SAVE-LASTKEY        PIC S9(4) COMP-4 VALUE 0.
       77  MAIN-SW             PIC X.
       77  FILE-SW             PIC X          VALUE "B".
       77  QUEUE-SW            PIC X          VALUE SPACE.
       77  CALL-PGM            PIC X          VALUE SPACE.
       77  QUEUE-ERROR         PIC X(76).
       77  WO-KEY              PIC X(10).
       77  WO-HOLD-AREA        PIC X(900).
       77  TRUE-VAL            PIC 1          VALUE B"1".

       01  FILE-STAT.
           05  FILE-STAT-1     PIC X  VALUE "0".
           05  FILE-STAT-2     PIC X  VALUE "0".

       01  CURR-DATE.
           05  C-DATE-CC       PIC 99.
           05  CUR-DATE-99.
               10  C-DATE-YY   PIC 99.
               10  C-DATE-MM   PIC 99.
               10  C-DATE-DD   PIC 99.

       01  DATE-HOLD.
           05  DH-YY           PIC 99.
           05  DH-MM           PIC 99.
           05  DH-DD           PIC 99.

       01  TIME-BUFF.
           05  TIME-HM.
               10  TIME-HRS    PIC 99.
               10  TIME-MIN    PIC 99.
           05  FILLER          PIC XXXX.

       01  SCREEN-ONE.
           05  START-DT1.
               10  START-DATE1.
                   15  STRT-MM1              PIC 99.
                   15  STRT-DD1              PIC 99.
                   15  STRT-YY1              PIC 99.
               10  START-TIME1.
                   15  STRT-HR               PIC 99.
                   15  STRT-MN               PIC 99.
           05  STOP-DT1.
               10  STOP-DATE1.
                   15  STOP-MM1              PIC 99.
                   15  STOP-DD1              PIC 99.
                   15  STOP-YY1              PIC 99.
               10  STOP-TIME1.
                   15  STOP-HR               PIC 99.
                   15  STOP-MN               PIC 99.
           05  TABLE-ONE.
               10  WO-A.
                   15  A-SELECT              PIC X.
                   15  A-WO-NUM              PIC X(10).
                   15  A-DESC1               PIC X(30).
               10  WO-B.
                   15  B-SELECT              PIC X.
                   15  B-WO-NUM              PIC X(10).
                   15  B-DESC1               PIC X(30).
               10  WO-C.
                   15  C-SELECT              PIC X.
                   15  C-WO-NUM              PIC X(10).
                   15  C-DESC1               PIC X(30).
               10  WO-D.
                   15  D-SELECT              PIC X.
                   15  D-WO-NUM              PIC X(10).
                   15  D-DESC1               PIC X(30).
               10  WO-E.
                   15  E-SELECT              PIC X.
                   15  E-WO-NUM              PIC X(10).
                   15  E-DESC1               PIC X(30).
               10  WO-F.
                   15  F-SELECT              PIC X.
                   15  F-WO-NUM              PIC X(10).
                   15  F-DESC1               PIC X(30).
           05  CMDMSG1                       PIC X(79).
           05  ERRMSG1                       PIC X(79).

       01  HOLD1-BUFFER.
           05  WO-H1.
               10  H1-SELECT   PIC X.
               10  H1-WO-NUM   PIC X(10).
               10  H1-DESC1    PIC X(30).

       01  SCREEN-TWO.
           05  START-DT2.
               10  START-DATE2.
                   15  STRT-MM2              PIC 99.
                   15  STRT-DD2              PIC 99.
                   15  STRT-YY2              PIC 99.
               10  START-TIME2               PIC 9999.
           05  STOP-DT2.
               10  STOP-DATE2.
                   15  STOP-MM2              PIC 99.
                   15  STOP-DD2              PIC 99.
                   15  STOP-YY2              PIC 99.
               10  STOP-TIME2                PIC 9999.
           05  TOTAL-MINUTES                 PIC ZZZ9.
           05  MINUTES-LEFT                  PIC ZZZ9.
           05  TABLE-TWO.
               10  WO-A2.
                   15  A-STATUS              PIC XX.
                   15  A-WO-NUM2             PIC X(10).
                   15  A-DESC2               PIC X(27).
                   15  A-START.
                       20  ASD.
                           25  AS-MM         PIC 99.
                           25  AS-DD         PIC 99.
                           25  AS-YY         PIC 99.
                       20  AST               PIC 9999.
                   15  A-STOP.
                       20  ACD.
                           25  AC-MM         PIC 99.
                           25  AC-DD         PIC 99.
                           25  AC-YY         PIC 99.
                       20  ACT               PIC 9999.
                   15  A-MNX                 PIC XXXX.
                   15  A-MIN REDEFINES A-MNX PIC ZZZ9.
                   15  A-X                   PIC XXXX.
                   15  A-9 REDEFINES A-X     PIC 9999.
               10  WO-B2.
                   15  B-STATUS              PIC XX.
                   15  B-WO-NUM2             PIC X(10).
                   15  B-DESC2               PIC X(27).
                   15  B-START.
                       20  BSD.
                           25  BS-MM         PIC 99.
                           25  BS-DD         PIC 99.
                           25  BS-YY         PIC 99.
                       20  BST               PIC 9999.
                   15  B-STOP.
                       20  BCD.
                           25  BC-MM         PIC 99.
                           25  BC-DD         PIC 99.
                           25  BC-YY         PIC 99.
                       20  BCT               PIC 9999.
                   15  B-MNX                 PIC XXXX.
                   15  B-MIN REDEFINES B-MNX PIC ZZZ9.
                   15  B-X                   PIC XXXX.
                   15  B-9 REDEFINES B-X     PIC 9999.
               10  WO-C2.
                   15  C-STATUS              PIC XX.
                   15  C-WO-NUM2             PIC X(10).
                   15  C-DESC2               PIC X(27).
                   15  C-START.
                       20  CSD.
                           25  CS-MM         PIC 99.
                           25  CS-DD         PIC 99.
                           25  CS-YY         PIC 99.
                       20  CST               PIC 9999.
                   15  C-STOP.
                       20  CCD.
                           25  CC-MM         PIC 99.
                           25  CC-DD         PIC 99.
                           25  CC-YY         PIC 99.
                       20  CCT               PIC 9999.
                   15  C-MNX                 PIC XXXX.
                   15  C-MIN REDEFINES C-MNX PIC ZZZ9.
                   15  C-X                   PIC XXXX.
                   15  C-9 REDEFINES C-X     PIC 9999.
               10  WO-D2.
                   15  D-STATUS              PIC XX.
                   15  D-WO-NUM2             PIC X(10).
                   15  D-DESC2               PIC X(27).
                   15  D-START.
                       20  DSD.
                           25  DS-MM         PIC 99.
                           25  DS-DD         PIC 99.
                           25  DS-YY         PIC 99.
                       20  DST               PIC 9999.
                   15  D-STOP.
                       20  DCD.
                           25  DC-MM         PIC 99.
                           25  DC-DD         PIC 99.
                           25  DC-YY         PIC 99.
                       20  DCT               PIC 9999.
                   15  D-MNX                 PIC XXXX.
                   15  D-MIN REDEFINES D-MNX PIC ZZZ9.
                   15  D-X                   PIC XXXX.
                   15  D-9 REDEFINES D-X     PIC 9999.
               10  WO-E2.
                   15  E-STATUS              PIC XX.
                   15  E-WO-NUM2             PIC X(10).
                   15  E-DESC2               PIC X(27).
                   15  E-START.
                       20  ESD.
                           25  ES-MM         PIC 99.
                           25  ES-DD         PIC 99.
                           25  ES-YY         PIC 99.
                       20  EST               PIC 9999.
                   15  E-STOP.
                       20  ECD.
                           25  EC-MM         PIC 99.
                           25  EC-DD         PIC 99.
                           25  EC-YY         PIC 99.
                       20  ECT               PIC 9999.
                   15  E-MNX                 PIC XXXX.
                   15  E-MIN REDEFINES E-MNX PIC ZZZ9.
                   15  E-X                   PIC XXXX.
                   15  E-9 REDEFINES E-X     PIC 9999.
               10  WO-F2.
                   15  F-STATUS              PIC XX.
                   15  F-WO-NUM2             PIC X(10).
                   15  F-DESC2               PIC X(27).
                   15  F-START.
                       20  FSD.
                           25  FS-MM         PIC 99.
                           25  FS-DD         PIC 99.
                           25  FS-YY         PIC 99.
                       20  FST               PIC 9999.
                   15  F-STOP.
                       20  FCD.
                           25  FC-MM         PIC 99.
                           25  FC-DD         PIC 99.
                           25  FC-YY         PIC 99.
                       20  FCT               PIC 9999.
                   15  F-MNX                 PIC XXXX.
                   15  F-MIN REDEFINES F-MNX PIC ZZZ9.
                   15  F-X                   PIC XXXX.
                   15  F-9 REDEFINES F-X     PIC 9999.
           05  CMDMSG2                       PIC X(79).
           05  ERRMSG2                       PIC X(79).

       01  HOLD2-BUFFER.
           05  WO-H2.
               10  H2-STATUS                 PIC XX.
               10  H2-WO-NUM                 PIC X(10).
               10  H2-DESC                   PIC X(27).
               10  H2-START.
                   15  HSD2.
                       20  HS2-MM            PIC 99.
                       20  HS2-DD            PIC 99.
                       20  HS2-YY            PIC 99.
                   15  HST2                  PIC 9999.
               10  H2-STOP.
                   15  HCD2.
                       20  HC2-MM            PIC 99.
                       20  HC2-DD            PIC 99.
                       20  HC2-YY            PIC 99.
                   15  HCT2                  PIC 9999.
               10  H2-MIN                    PIC ZZZ9.
               10  H2-X                      PIC XXXX.
               10  H2-9 REDEFINES H2-X       PIC 9999.

       01  SCREEN-THREE.
           05  ERRMSG3         PIC X(79).

       01  ADJ.
           05  X-1             PIC X.
           05  X-2             PIC X.
           05  X-3             PIC X.
           05  X-4             PIC X.
       01  ADJ-9               REDEFINES ADJ PIC 9999.

       01  CALC-BUFFERS.
           05  CALC-START.
               10  CALC-STRT-D.
                   15  CSTR-MM PIC 99.
                   15  CSTR-DD PIC 99.
                   15  CSTR-YY PIC 99.
               10  CALC-STRT-T.
                   15  CSTR-HR PIC 99.
                   15  CSTR-MN PIC 99.
           05  CALC-DT.
               10  CALC-DATE.
                   15  CALC-MM PIC 99.
                   15  CALC-DD PIC 99.
                   15  CALC-YY PIC 99.
               10  CALC-TIME.
                   15  CALC-HR PIC 99.
                   15  CALC-HR-X REDEFINES CALC-HR  PIC XX.
                   15  CALC-MN PIC 99.
                   15  CALC-MN-X REDEFINES CALC-MN  PIC XX.
           05  CALC-MIN        PIC S9(4)   COMP-4  VALUE 0.
           05  CALC-STRT       PIC S9(4)   COMP-4  VALUE 0.
           05  CALC-DIFF       PIC S9(4)   COMP-4  VALUE 0.

       01  WO-CALCS.
           05  A-CALC          PIC S9(4)   COMP-4  VALUE 0.
           05  B-CALC          PIC S9(4)   COMP-4  VALUE 0.
           05  C-CALC          PIC S9(4)   COMP-4  VALUE 0.
           05  D-CALC          PIC S9(4)   COMP-4  VALUE 0.
           05  E-CALC          PIC S9(4)   COMP-4  VALUE 0.
           05  F-CALC          PIC S9(4)   COMP-4  VALUE 0.

       01  DB-ERROR.
           05  DB-FUNC   PIC X(10) VALUE SPACES.
           05  DB-FILE   PIC X(18) VALUE SPACES.
           05  FILLER    PIC X(20) VALUE "ERROR - FILE-STAT = ".
           05  CON-WORD  PIC XX.

           COPY SCREENIO       IN COPYLIB.

           COPY CATREAD        IN COPYLIB.

           COPY JCWAREA        IN COPYLIB.

       01  WO-BASIC-DATA.
           COPY DWOBASIC       IN COPYLIB.

       01  WO-PLANNED-DATA.
           COPY DWOPLAN        IN COPYLIB.

       01  PERSONNEL-DATA.
           COPY MPERSONL       IN COPYLIB.

       01  WO-QUEUE-DATA.
           COPY DWOOPENQ       IN COPYLIB.

       01  MESSAGE-BUF-DATA.
           COPY ERRORLIN       IN COPYLIB.

       LINKAGE SECTION.
       01  CNUM-BUFFER.
           05  CNUM-BUF        PIC XXXX.
           05  CNAM-BUF        PIC X(16).

       01  FUNCTION-CODE       PIC XX.

       01  DATA-BUFFER.
           05  WOCW-BUF        PIC X(10).
           05  FAILC-BUF       PIC X(06).
           05  EDOWN-BUF       PIC X.
           05  EDOWN-CW-BUF    PIC X.

       01  LV-BUF-DATA.
           05  LV-DATA.
               10  LV-SKILL    PIC XX.
               10  LV-NS-FLAG  PIC X.
               10  FILLER      PIC X(07).
           05  LV-SW           PIC 9.

       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  WO-TRACK-DATA.
           COPY DWOTRACK       IN COPYLIB.

       01  LABOR-CURR-DATA.
           COPY DCURRLBR       IN COPYLIB.

       PROCEDURE DIVISION      USING CNUM-BUFFER
                               FUNCTION-CODE
                               DATA-BUFFER
                               LV-BUF-DATA
                               DBPARAMETERS
                               WO-TRACK-DATA
                               LABOR-CURR-DATA.

       BEGIN.
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          WO-BASIC.
           OPEN INPUT          WO-PLANNED.
           OPEN INPUT          WO-OPEN-Q-CC.
           OPEN INPUT          WO-OPEN-Q-WO.
           MOVE 0              TO FIND-SW LOOP-CTR DATE-SW SHORT-SW
                               RESERVE-SW CW-SW TMIN LMIN STRT-MIN
                               STOP-MIN ROOT-HOURS HR-MIN SAVE-LASTKEY.
           ACCEPT MC-LOCAL-DATA-AREA FROM LOCAL-DATA-AREA.

           ACCEPT CUR-DATE-99  FROM DATE.
           MOVE 20             TO C-DATE-CC.
           IF C-DATE-YY > 70
               MOVE 19         TO C-DATE-CC.

           IF RETURN-BYTE = "S"
               MOVE RETURN-BYTE TO CALL-PGM
               PERFORM CLEAR-RESERVE THRU CR-EXIT
               PERFORM CLOSE-FUNCTION
               MOVE SPACE      TO RETURN-BYTE
               GO TO END-OF-JOB.

      *********************************************************
      **  IF JCW `MULTIWO' IS SET TO ANY NON-BLANK VALUE,    **
      **  THE SYSTEM WILL ALLOW RESERVATION OF MULTIPLE WO's **
      *********************************************************
           IF JCW-MULTIWO-264 NOT = " "
               GO TO START-PROCEDURE.

       MAIN-LOOP.
           ACCEPT CUR-DATE-99  FROM DATE.
           MOVE 20             TO C-DATE-CC.
           IF C-DATE-YY > 70
               MOVE 19         TO C-DATE-CC.
           MOVE CURR-DATE      TO C-COMPL-DATE-CN.
           ACCEPT TIME-BUFF    FROM TIME.
           MOVE TIME-HM        TO C-COMPL-TIME.

           IF FUNCTION-CODE = "LV"
               MOVE WO-NO-CLS  TO WOCW-BUF
               PERFORM LEAVE-FUNCTION
           ELSE
               PERFORM CLOSE-FUNCTION.

           GO TO END-OF-JOB.

       START-PROCEDURE.
           MOVE SPACES         TO SCREEN-ONE SCREEN-TWO MESSAGE-BUFFER.
           MOVE SPACES         TO HOLD1-BUFFER HOLD2-BUFFER.
           MOVE SPACES         TO WO-BASIC-DATA WO-PLANNED-DATA.
           IF LV-BUF-DATA = SPACES
               MOVE 2          TO A-SELECT
           ELSE
               MOVE 1          TO A-SELECT.

           ACCEPT CUR-DATE-99  FROM DATE.
           MOVE 20             TO C-DATE-CC.
           IF C-DATE-YY > 70
               MOVE 19         TO C-DATE-CC.

           MOVE C-DATE-YY      TO STOP-YY1 STOP-YY2.
           MOVE C-DATE-MM      TO STOP-MM1 STOP-MM2.
           MOVE C-DATE-DD      TO STOP-DD1 STOP-DD2.
           IF DATE-FLAG = 3
               MOVE C-DATE-DD  TO STOP-MM1 STOP-MM2
               MOVE C-DATE-MM  TO STOP-DD1 STOP-DD2.

           MOVE LCS-START-DATE TO DATE-HOLD.
           MOVE DH-YY          TO STRT-YY1 STRT-YY2.
           MOVE DH-MM          TO STRT-MM1 STRT-MM2.
           MOVE DH-DD          TO STRT-DD1 STRT-DD2.
           IF DATE-FLAG = 3
               MOVE DH-DD      TO STOP-MM1 STOP-MM2
               MOVE DH-MM      TO STOP-DD1 STOP-DD2.

           ACCEPT TIME-BUFF    FROM TIME.
           MOVE TIME-HM        TO STOP-TIME1 STOP-TIME2.
           MOVE LCS-START-TIME TO START-TIME1 START-TIME2.

           MOVE START-TIME1    TO CALC-TIME.
           PERFORM TIME-TO-MINUTES.
           MOVE CALC-DIFF      TO STRT-MIN.

           MOVE STOP-TIME1     TO CALC-TIME.
           PERFORM TIME-TO-MINUTES.
           MOVE CALC-DIFF      TO STOP-MIN.

           IF STRT-MIN > STOP-MIN
               ADD 1440        TO STOP-MIN.
           COMPUTE TMIN = STOP-MIN - STRT-MIN.
           MOVE TMIN           TO LMIN TOTAL-MINUTES MINUTES-LEFT.

       READ-QUEUE.
           MOVE CNUM-BUF       TO PERCCNUM OF WO-OPEN-Q-CC.
           START WO-OPEN-Q-CC  KEY = PERCCNUM OF WO-OPEN-Q-CC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT-1 = "2"
                   IF FIND-SW = 1
                       GO TO SCREEN-DISPLAY
                   ELSE
                       GO TO MAIN-LOOP
               ELSE
                   MOVE "START   " TO DB-FUNC
                   MOVE "WO-OPEN-Q-CC" TO DB-FILE
                   MOVE FILE-STAT  TO CON-WORD
                   DISPLAY DB-ERROR
                   GO TO END-OF-JOB.

       DBGET-LOOP.
           READ WO-OPEN-Q-CC   NEXT INTO WO-QUEUE-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT = "10" OR "14" OR "46"
                   IF FIND-SW = 1
                       GO TO SCREEN-DISPLAY
                   ELSE
                       GO TO MAIN-LOOP
               ELSE
                   MOVE "READ    " TO DB-FUNC
                   MOVE "WO-OPEN-Q-CC" TO DB-FILE
                   MOVE FILE-STAT  TO CON-WORD
                   DISPLAY DB-ERROR
                   GO TO END-OF-JOB.

           IF Q-CC-NUM NOT = CNUM-BUF
               IF FIND-SW = 1
                   GO TO SCREEN-DISPLAY
               ELSE
                   GO TO MAIN-LOOP.

           IF Q-RESERVE NOT = "XX"
               GO TO DBGET-LOOP.

           MOVE 1              TO FIND-SW.
           ADD 1               TO LOOP-CTR.
           PERFORM LOAD-HOLD1.
           IF LOOP-CTR = 1
               MOVE HOLD1-BUFFER TO WO-B
           ELSE
           IF LOOP-CTR = 2
               MOVE HOLD1-BUFFER TO WO-C
           ELSE
           IF LOOP-CTR = 3
               MOVE HOLD1-BUFFER TO WO-D
           ELSE
           IF LOOP-CTR = 4
               MOVE HOLD1-BUFFER TO WO-E
           ELSE
           IF LOOP-CTR = 5
               MOVE HOLD1-BUFFER TO WO-F
           ELSE
           IF LOOP-CTR > 5
               GO TO SCREEN-DISPLAY.

           GO TO DBGET-LOOP.

       LOAD-HOLD1.
           MOVE SPACE          TO H1-SELECT.
           MOVE Q-WO-NUM       TO H1-WO-NUM.
           MOVE Q-DESCRIPTION  TO H1-DESC1.

       SCREEN-DISPLAY.
           MOVE 0              TO LOOP-CTR.
           MOVE SPACES         TO WO-BASIC-DATA WO-PLANNED-DATA.
           MOVE WOCW-BUF       TO WONUM OF WO-BASIC
                                  WONUM OF WO-PLANNED.
           START WO-BASIC      KEY = WONUM OF WO-BASIC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = ZEROS
               IF WOCW-BUF = WONUM OF WO-BASIC
                   GO TO READ-BASIC.

           START WO-PLANNED    KEY = WONUM OF WO-PLANNED
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = ZEROS
               IF WOCW-BUF = WONUM OF WO-PLANNED
                   GO TO READ-PLANNED.

           MOVE WOCW-BUF       TO DB-FUNC.
           MOVE "NOT FOUND IN FILE!" TO DB-FILE.
           MOVE FILE-STAT      TO CON-WORD.
           DISPLAY DB-ERROR.
           GO TO END-OF-JOB.

       READ-BASIC.
           READ WO-BASIC       INTO WO-BASIC-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               MOVE FILE-STAT  TO CON-WORD
               MOVE "READ    " TO DB-FUNC
               MOVE "WO-BASIC" TO DB-FILE
               DISPLAY DB-ERROR
               GO TO END-OF-JOB.

           MOVE "B"            TO MAIN-SW.
           MOVE WO-BASIC-DATA  TO WO-HOLD-AREA.
           MOVE DESCRIPTION-1  TO A-DESC1.
           GO TO CONT-PROC.

       READ-PLANNED.
           READ WO-PLANNED     INTO WO-PLANNED-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               MOVE FILE-STAT  TO CON-WORD
               MOVE "READ    " TO DB-FUNC
               MOVE "WO-PLANNED" TO DB-FILE
               DISPLAY DB-ERROR
               GO TO END-OF-JOB.

           MOVE "P"             TO MAIN-SW.
           MOVE WO-PLANNED-DATA TO WO-HOLD-AREA.
           MOVE DESCRIPTION-1-P TO A-DESC1.

       CONT-PROC.
           MOVE WOCW-BUF       TO A-WO-NUM.
           MOVE "VMULTILV1"    TO SCREEN-NAME.
           MOVE MESSAGE-BUFFER TO ERRMSG1.

       SHOWFORM1.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-ONE     TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCREEN-ONE.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 3
               GO TO END-OF-JOB.

           IF KEY-HIT = 7
               PERFORM HELP-FUNCTION THRU HELP-EXIT
               MOVE "VMULTILV1" TO SCREEN-NAME
               MOVE MESSAGE-BUFFER TO ERRMSG1
               GO TO SHOWFORM1.

           IF KEY-HIT = 1
               MOVE A-WO-NUM   TO WO-KEY
               MOVE MAIN-SW    TO FILE-SW
               MOVE SPACES     TO WO-BASIC-DATA WO-PLANNED-DATA
               IF MAIN-SW = "B"
                   MOVE WO-HOLD-AREA TO WO-BASIC-DATA
                   PERFORM DISPLAY-CALL THRU DISPLAY-EXIT
                   GO TO SHOWFORM1
               ELSE
                   MOVE WO-HOLD-AREA TO WO-PLANNED-DATA
                   PERFORM DISPLAY-CALL THRU DISPLAY-EXIT
                   GO TO SHOWFORM1.

           IF KEY-HIT = 2
               MOVE B-WO-NUM   TO WO-KEY
               MOVE "B"        TO FILE-SW
               PERFORM DISPLAY-WO THRU DISPLAY-EXIT
               GO TO SHOWFORM1.

           IF KEY-HIT = 8
               IF C-WO-NUM NOT = SPACES
                   MOVE C-WO-NUM TO WO-KEY
                   MOVE "B"    TO FILE-SW
                   PERFORM DISPLAY-WO THRU DISPLAY-EXIT
                   GO TO SHOWFORM1
               ELSE
                   GO TO SHOWFORM1.

           IF KEY-HIT = 4
               IF D-WO-NUM NOT = SPACES
                   MOVE D-WO-NUM TO WO-KEY
                   MOVE "B"    TO FILE-SW
                   PERFORM DISPLAY-WO THRU DISPLAY-EXIT
                   GO TO SHOWFORM1
               ELSE
                   GO TO SHOWFORM1.

           IF KEY-HIT = 5
               IF E-WO-NUM NOT = SPACES
                   MOVE E-WO-NUM TO WO-KEY
                   MOVE "B"      TO FILE-SW
                   PERFORM DISPLAY-WO THRU DISPLAY-EXIT
                   GO TO SHOWFORM1
               ELSE
                   GO TO SHOWFORM1.

           IF KEY-HIT = 6
               IF F-WO-NUM NOT = SPACES
                   MOVE F-WO-NUM TO WO-KEY
                   MOVE "B"      TO FILE-SW
                   PERFORM DISPLAY-WO THRU DISPLAY-EXIT
                   GO TO SHOWFORM1
               ELSE
                   GO TO SHOWFORM1.

       EDIT-CODE.
           IF B-WO-NUM NOT = SPACES
               IF B-SELECT = SPACE
      **********************************************************************
      **    MESSAGE 031/079:
      ** Entry Required - Enter `0' for No-Work, `1' for LV, or `2' for CW
      **********************************************************************
                   MOVE  31    TO CATREAD-MSG-SET
                   MOVE  79    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 95     TO FIELD-NUMBER
                   PERFORM SCREEN1-ERROR
                   GO TO SHOWFORM1
               ELSE
               IF B-SELECT = "0" OR "1" OR "2"
                   NEXT SENTENCE
               ELSE
      **********************************************************************
      **    MESSAGE 035/076:
      ** Invalid Entry - Enter `0' for No-Work, `1' for LV, or `2' for CW
      **********************************************************************
                   MOVE  35    TO CATREAD-MSG-SET
                   MOVE  76    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 95     TO FIELD-NUMBER
                   PERFORM SCREEN1-ERROR
                   GO TO SHOWFORM1.

           IF C-WO-NUM NOT = SPACES
               IF C-SELECT = SPACE
      **********************************************************************
      **    MESSAGE 031/079:
      ** Entry Required - Enter `0' for No-Work, `1' for LV, or `2' for CW
      **********************************************************************
                   MOVE  31    TO CATREAD-MSG-SET
                   MOVE  79    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 96     TO FIELD-NUMBER
                   PERFORM SCREEN1-ERROR
                   GO TO SHOWFORM1
               ELSE
               IF C-SELECT = "0" OR "1" OR "2"
                   NEXT SENTENCE
               ELSE
      **********************************************************************
      **    MESSAGE 035/076:
      ** Invalid Entry - Enter `0' for No-Work, `1' for LV, or `2' for CW
      **********************************************************************
                   MOVE  35    TO CATREAD-MSG-SET
                   MOVE  76    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 96     TO FIELD-NUMBER
                   PERFORM SCREEN1-ERROR
                   GO TO SHOWFORM1.

           IF D-WO-NUM NOT = SPACES
               IF D-SELECT = SPACE
      **********************************************************************
      **    MESSAGE 031/079:
      ** Entry Required - Enter `0' for No-Work, `1' for LV, or `2' for CW
      **********************************************************************
                   MOVE  31    TO CATREAD-MSG-SET
                   MOVE  79    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 97     TO FIELD-NUMBER
                   PERFORM SCREEN1-ERROR
                   GO TO SHOWFORM1
               ELSE
               IF D-SELECT = "0" OR "1" OR "2"
                   NEXT SENTENCE
               ELSE
      **********************************************************************
      **    MESSAGE 035/076:
      ** Invalid Entry - Enter `0' for No-Work, `1' for LV, or `2' for CW
      **********************************************************************
                   MOVE  35    TO CATREAD-MSG-SET
                   MOVE  76    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 97     TO FIELD-NUMBER
                   PERFORM SCREEN1-ERROR
                   GO TO SHOWFORM1.

           IF E-WO-NUM NOT = SPACES
               IF E-SELECT = SPACE
      **********************************************************************
      **    MESSAGE 031/079:
      ** Entry Required - Enter `0' for No-Work, `1' for LV, or `2' for CW
      **********************************************************************
                   MOVE  31    TO CATREAD-MSG-SET
                   MOVE  79    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 98     TO FIELD-NUMBER
                   PERFORM SCREEN1-ERROR
                   GO TO SHOWFORM1
               ELSE
               IF E-SELECT = "0" OR "1" OR "2"
                   NEXT SENTENCE
               ELSE
      **********************************************************************
      **    MESSAGE 035/076:
      ** Invalid Entry - Enter `0' for No-Work, `1' for LV, or `2' for CW
      **********************************************************************
                   MOVE  35    TO CATREAD-MSG-SET
                   MOVE  76    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 98     TO FIELD-NUMBER
                   PERFORM SCREEN1-ERROR
                   GO TO SHOWFORM1.

           IF F-WO-NUM NOT = SPACES
               IF F-SELECT = SPACE
      **********************************************************************
      **    MESSAGE 031/079:
      ** Entry Required - Enter `0' for No-Work, `1' for LV, or `2' for CW
      **********************************************************************
                   MOVE  31    TO CATREAD-MSG-SET
                   MOVE  79    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 99     TO FIELD-NUMBER
                   PERFORM SCREEN1-ERROR
                   GO TO SHOWFORM1
               ELSE
               IF F-SELECT = "0" OR "1" OR "2"
                   NEXT SENTENCE
               ELSE
      **********************************************************************
      **    MESSAGE 035/076:
      ** Invalid Entry - Enter `0' for No-Work, `1' for LV, or `2' for CW
      **********************************************************************
                   MOVE  35    TO CATREAD-MSG-SET
                   MOVE  76    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 99     TO FIELD-NUMBER
                   PERFORM SCREEN1-ERROR
                   GO TO SHOWFORM1.

       SCREEN-DISPLAY-2.
           ADD 1               TO LOOP-CTR.
           MOVE 0              TO A-MIN.
           IF A-SELECT = "1"
               MOVE "LV"       TO A-STATUS
               MOVE A-WO-NUM   TO A-WO-NUM2
               MOVE A-DESC1    TO A-DESC2
           ELSE
               MOVE "CW"       TO A-STATUS
               MOVE A-WO-NUM   TO A-WO-NUM2
               MOVE A-DESC1    TO A-DESC2.

           IF B-SELECT = " "
               NEXT SENTENCE
           ELSE
           IF B-SELECT = "0"
               MOVE B-WO-NUM   TO WO-KEY
               PERFORM CLEAR-QUEUE THRU CLEAR-EXIT
           ELSE
           ADD 1               TO LOOP-CTR
           MOVE 0              TO B-MIN
           IF B-SELECT = "1"
               MOVE "LV"       TO B-STATUS
               MOVE B-WO-NUM   TO B-WO-NUM2
               MOVE B-DESC1    TO B-DESC2
           ELSE
               MOVE "CW"       TO B-STATUS
               MOVE B-WO-NUM   TO B-WO-NUM2
               MOVE B-DESC1    TO B-DESC2.

           IF C-SELECT = " "
               NEXT SENTENCE
           ELSE
           IF C-SELECT = "0"
               MOVE C-WO-NUM   TO WO-KEY
               PERFORM CLEAR-QUEUE THRU CLEAR-EXIT
           ELSE
           ADD 1               TO LOOP-CTR
           MOVE 0              TO C-MIN
           IF C-SELECT = "1"
               MOVE "LV"       TO C-STATUS
               MOVE C-WO-NUM   TO C-WO-NUM2
               MOVE C-DESC1    TO C-DESC2
           ELSE
               MOVE "CW"       TO C-STATUS
               MOVE C-WO-NUM   TO C-WO-NUM2
               MOVE C-DESC1    TO C-DESC2.

           IF D-SELECT = " "
               NEXT SENTENCE
           ELSE
           IF D-SELECT = "0"
               MOVE D-WO-NUM   TO WO-KEY
               PERFORM CLEAR-QUEUE THRU CLEAR-EXIT
           ELSE
           ADD 1               TO LOOP-CTR
           MOVE 0              TO D-MIN
           IF D-SELECT = "1"
               MOVE "LV"       TO D-STATUS
               MOVE D-WO-NUM   TO D-WO-NUM2
               MOVE A-DESC1    TO D-DESC2
           ELSE
               MOVE "CW"       TO D-STATUS
               MOVE D-WO-NUM   TO D-WO-NUM2
               MOVE D-DESC1    TO D-DESC2.

           IF E-SELECT = " "
               NEXT SENTENCE
           ELSE
           IF E-SELECT = "0"
               MOVE E-WO-NUM   TO WO-KEY
               PERFORM CLEAR-QUEUE THRU CLEAR-EXIT
           ELSE
           ADD 1               TO LOOP-CTR
           MOVE 0              TO E-MIN
           IF E-SELECT = "1"
               MOVE "LV"       TO E-STATUS
               MOVE E-WO-NUM   TO E-WO-NUM2
               MOVE E-DESC1    TO E-DESC2
           ELSE
               MOVE "CW"       TO E-STATUS
               MOVE E-WO-NUM   TO E-WO-NUM2
               MOVE E-DESC1    TO E-DESC2.

           IF F-SELECT = " "
               NEXT SENTENCE
           ELSE
           IF F-SELECT = "0"
               MOVE F-WO-NUM   TO WO-KEY
               PERFORM CLEAR-QUEUE THRU CLEAR-EXIT
           ELSE
           ADD 1               TO LOOP-CTR
           MOVE 0              TO F-MIN
           IF F-SELECT = "1"
               MOVE "LV"       TO F-STATUS
               MOVE F-WO-NUM   TO F-WO-NUM2
               MOVE F-DESC1    TO F-DESC2
           ELSE
               MOVE "CW"       TO F-STATUS
               MOVE F-WO-NUM   TO F-WO-NUM2
               MOVE F-DESC1    TO F-DESC2.

           IF B-WO-NUM = SPACES MOVE SPACES TO B-STATUS B-MNX.
           IF C-WO-NUM = SPACES MOVE SPACES TO C-STATUS C-MNX.
           IF D-WO-NUM = SPACES MOVE SPACES TO D-STATUS D-MNX.
           IF E-WO-NUM = SPACES MOVE SPACES TO E-STATUS E-MNX.
           IF F-WO-NUM = SPACES MOVE SPACES TO F-STATUS F-MNX.

           PERFORM MOVE-UP.
           MOVE START-DATE2    TO ASD.
           MOVE START-TIME2    TO AST.
           MOVE 0 TO A-CALC B-CALC C-CALC D-CALC E-CALC F-CALC.

           MOVE "VMULTILV2"    TO SCREEN-NAME.

      **********************************************************************
      **    MESSAGE 042/060:
      ** PRESS 'ENTER' TO CALCULATE START TIMES
      **********************************************************************
           MOVE  42            TO CATREAD-MSG-SET.
           MOVE  60            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CMDMSG2.

           ADD 1               TO LOOP-CTR.
           IF TMIN < LOOP-CTR
               MOVE 1          TO SHORT-SW
               SUBTRACT 1      FROM LOOP-CTR
               MOVE LOOP-CTR   TO TMIN LMIN
               MOVE "1   "     TO A-X
               SUBTRACT 1      FROM LOOP-CTR
               IF LOOP-CTR NOT = 0
                   MOVE "1   " TO B-X
                   SUBTRACT 1  FROM LOOP-CTR
                   IF LOOP-CTR NOT = 0
                       MOVE "1   " TO C-X
                       SUBTRACT 1  FROM LOOP-CTR
                       IF LOOP-CTR NOT = 0
                           MOVE "1   " TO D-X
                           SUBTRACT 1  FROM LOOP-CTR
                           IF LOOP-CTR NOT = 0
                               MOVE "1   " TO E-X
                               SUBTRACT 1  FROM LOOP-CTR
                               IF LOOP-CTR NOT = 0
                                   MOVE "1   " TO F-X.

           IF SHORT-SW > 0
               GO TO EDIT-1.

       SHOWFORM2.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-TWO     TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCREEN-TWO.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 3
               GO TO END-OF-JOB.

           IF KEY-HIT = 7
               PERFORM HELP-FUNCTION THRU HELP-EXIT
               MOVE "VMULTILV2" TO SCREEN-NAME
               MOVE MESSAGE-BUFFER TO ERRMSG2
               GO TO SHOWFORM2.

           IF KEY-HIT = 5
               NEXT SENTENCE
           ELSE
           IF KEY-HIT NOT = 0
               GO TO SHOWFORM2.

      **********************************************************************
      **    MESSAGE 042/060:
      ** PRESS 'ENTER' TO CALCULATE START TIMES
      **********************************************************************
           MOVE  42            TO CATREAD-MSG-SET.
           MOVE  60            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CMDMSG2.

           IF KEY-HIT = 5
               IF LMIN = 0
                   IF A-MNX = "   0"
      **********************************************************************
      **    MESSAGE 040/010:
      ** NO LABOR HAS BEEN RECORDED AGAINST W/O
      **********************************************************************
                       MOVE 40 TO CATREAD-MSG-SET
                       MOVE 10 TO CATREAD-MSG-NUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE  1 TO FIELD-NUMBER
                       PERFORM SCREEN2-ERROR
                       GO TO SHOWFORM2
                   ELSE
                   IF B-MNX = "   0"
      **********************************************************************
      **    MESSAGE 040/010:
      ** NO LABOR HAS BEEN RECORDED AGAINST W/O
      **********************************************************************
                       MOVE 40 TO CATREAD-MSG-SET
                       MOVE 10 TO CATREAD-MSG-NUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE  2 TO FIELD-NUMBER
                       PERFORM SCREEN2-ERROR
                       GO TO SHOWFORM2
                   ELSE
                   IF C-MNX = "   0"
      **********************************************************************
      **    MESSAGE 040/010:
      ** NO LABOR HAS BEEN RECORDED AGAINST W/O
      **********************************************************************
                       MOVE 40 TO CATREAD-MSG-SET
                       MOVE 10 TO CATREAD-MSG-NUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE  3 TO FIELD-NUMBER
                       PERFORM SCREEN2-ERROR
                       GO TO SHOWFORM2
                   ELSE
                   IF D-MNX = "   0"
      **********************************************************************
      **    MESSAGE 040/010:
      ** NO LABOR HAS BEEN RECORDED AGAINST W/O
      **********************************************************************
                       MOVE 40 TO CATREAD-MSG-SET
                       MOVE 10 TO CATREAD-MSG-NUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE  4 TO FIELD-NUMBER
                       PERFORM SCREEN2-ERROR
                       GO TO SHOWFORM2
                   ELSE
                   IF E-MNX = "   0"
      **********************************************************************
      **    MESSAGE 040/010:
      ** NO LABOR HAS BEEN RECORDED AGAINST W/O
      **********************************************************************
                       MOVE 40 TO CATREAD-MSG-SET
                       MOVE 10 TO CATREAD-MSG-NUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE  5 TO FIELD-NUMBER
                       PERFORM SCREEN2-ERROR
                       GO TO SHOWFORM2
                   ELSE
                   IF F-MNX = "   0"
      **********************************************************************
      **    MESSAGE 040/010:
      ** NO LABOR HAS BEEN RECORDED AGAINST W/O
      **********************************************************************
                       MOVE 40 TO CATREAD-MSG-SET
                       MOVE 10 TO CATREAD-MSG-NUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE  6 TO FIELD-NUMBER
                       PERFORM SCREEN2-ERROR
                       GO TO SHOWFORM2
                   ELSE
                   GO TO WRITE-LOOP.

       EDIT-1.
           IF A-X = SPACES
               NEXT SENTENCE
           ELSE
               MOVE A-X        TO ADJ
               PERFORM ADJUST
               IF ADJ NOT NUMERIC
      **********************************************************************
      **    MESSAGE 035/105:
      ** INVALID ENTRY
      **********************************************************************
                   MOVE  35    TO CATREAD-MSG-SET
                   MOVE 105    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE   1    TO FIELD-NUMBER
                   PERFORM CALCULATE-MINUTES-LEFT
                   PERFORM SCREEN2-ERROR
                   GO TO SHOWFORM2
               ELSE
               ADD A-CALC      TO LMIN
               IF ADJ-9 > LMIN
                   SUBTRACT A-CALC FROM LMIN
      **********************************************************************
      **    MESSAGE 039/012:
      ** MINUTES INPUT IS GREATER THAN TOTAL MINUTES LEFT ON JOB
      **********************************************************************
                   MOVE  39    TO CATREAD-MSG-SET
                   MOVE  12    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE   1    TO FIELD-NUMBER
                   PERFORM CALCULATE-MINUTES-LEFT
                   PERFORM SCREEN2-ERROR
                   GO TO SHOWFORM2
               ELSE
               SUBTRACT ADJ-9  FROM LMIN
               MOVE ADJ-9      TO A-MIN A-CALC
               PERFORM A-ARITHMETIC THRU ARITH-EXIT
               MOVE SPACES     TO A-X.

           IF B-WO-NUM = SPACES
               NEXT SENTENCE
           ELSE
           IF B-X = SPACES
               NEXT SENTENCE
           ELSE
               MOVE B-X        TO ADJ
               PERFORM ADJUST
               IF ADJ NOT NUMERIC
      **********************************************************************
      **    MESSAGE 035/105:
      ** INVALID ENTRY
      **********************************************************************
                   MOVE  35    TO CATREAD-MSG-SET
                   MOVE 105    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE   2    TO FIELD-NUMBER
                   PERFORM ERASE-EMPTIES
                   PERFORM CALCULATE-MINUTES-LEFT
                   PERFORM SCREEN2-ERROR
                   GO TO SHOWFORM2
               ELSE
               ADD B-CALC      TO LMIN
               IF ADJ-9 > LMIN
                   SUBTRACT B-CALC FROM LMIN
      **********************************************************************
      **    MESSAGE 039/012:
      ** MINUTES INPUT IS GREATER THAN TOTAL MINUTES LEFT ON JOB
      **********************************************************************
                   MOVE  39    TO CATREAD-MSG-SET
                   MOVE  12    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE   2    TO FIELD-NUMBER
                   PERFORM ERASE-EMPTIES
                   PERFORM CALCULATE-MINUTES-LEFT
                   PERFORM SCREEN2-ERROR
                   GO TO SHOWFORM2
               ELSE
               SUBTRACT ADJ-9  FROM LMIN
               MOVE ADJ-9      TO B-MIN B-CALC
               PERFORM B-ARITHMETIC THRU ARITH-EXIT
               MOVE SPACES     TO B-X.

           IF C-WO-NUM = SPACES
               NEXT SENTENCE
           ELSE
           IF C-X = SPACES
               NEXT SENTENCE
           ELSE
               MOVE C-X        TO ADJ
               PERFORM ADJUST
               IF ADJ NOT NUMERIC
      **********************************************************************
      **    MESSAGE 035/105:
      ** INVALID ENTRY
      **********************************************************************
                   MOVE  35    TO CATREAD-MSG-SET
                   MOVE 105    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE   3    TO FIELD-NUMBER
                   PERFORM ERASE-EMPTIES
                   PERFORM CALCULATE-MINUTES-LEFT
                   PERFORM SCREEN2-ERROR
                   GO TO SHOWFORM2
               ELSE
               ADD C-CALC      TO LMIN
               IF ADJ-9 > LMIN
                   SUBTRACT C-CALC FROM LMIN
      **********************************************************************
      **    MESSAGE 039/012:
      ** MINUTES INPUT IS GREATER THAN TOTAL MINUTES LEFT ON JOB
      **********************************************************************
                   MOVE  39    TO CATREAD-MSG-SET
                   MOVE  12    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE   3    TO FIELD-NUMBER
                   PERFORM ERASE-EMPTIES
                   PERFORM CALCULATE-MINUTES-LEFT
                   PERFORM SCREEN2-ERROR
                   GO TO SHOWFORM2
               ELSE
               SUBTRACT ADJ-9  FROM LMIN
               MOVE ADJ-9      TO C-MIN C-CALC
               PERFORM C-ARITHMETIC THRU ARITH-EXIT
               MOVE SPACES     TO C-X.

           IF D-WO-NUM = SPACES
               NEXT SENTENCE
           ELSE
           IF D-X = SPACES
               NEXT SENTENCE
           ELSE
               MOVE D-X        TO ADJ
               PERFORM ADJUST
               IF ADJ NOT NUMERIC
      **********************************************************************
      **    MESSAGE 035/105:
      ** INVALID ENTRY
      **********************************************************************
                   MOVE  35    TO CATREAD-MSG-SET
                   MOVE 105    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE   4    TO FIELD-NUMBER
                   PERFORM ERASE-EMPTIES
                   PERFORM CALCULATE-MINUTES-LEFT
                   PERFORM SCREEN2-ERROR
                   GO TO SHOWFORM2
               ELSE
               ADD D-CALC      TO LMIN
               IF ADJ-9 > LMIN
                   SUBTRACT D-CALC FROM LMIN
      **********************************************************************
      **    MESSAGE 039/012:
      ** MINUTES INPUT IS GREATER THAN TOTAL MINUTES LEFT ON JOB
      **********************************************************************
                   MOVE  39    TO CATREAD-MSG-SET
                   MOVE  12    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE   4    TO FIELD-NUMBER
                   PERFORM ERASE-EMPTIES
                   PERFORM CALCULATE-MINUTES-LEFT
                   PERFORM SCREEN2-ERROR
                   GO TO SHOWFORM2
               ELSE
               SUBTRACT ADJ-9  FROM LMIN
               MOVE ADJ-9      TO D-MIN D-CALC
               PERFORM D-ARITHMETIC THRU ARITH-EXIT
               MOVE SPACES     TO D-X.

           IF E-WO-NUM = SPACES
               NEXT SENTENCE
           ELSE
           IF E-X = SPACES
               NEXT SENTENCE
           ELSE
               MOVE E-X        TO ADJ
               PERFORM ADJUST
               IF ADJ NOT NUMERIC
      **********************************************************************
      **    MESSAGE 035/105:
      ** INVALID ENTRY
      **********************************************************************
                   MOVE  35    TO CATREAD-MSG-SET
                   MOVE 105    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE   5    TO FIELD-NUMBER
                   PERFORM ERASE-EMPTIES
                   PERFORM CALCULATE-MINUTES-LEFT
                   PERFORM SCREEN2-ERROR
                   GO TO SHOWFORM2
               ELSE
               ADD E-CALC      TO LMIN
               IF ADJ-9 > LMIN
                   SUBTRACT E-CALC FROM LMIN
      **********************************************************************
      **    MESSAGE 039/012:
      ** MINUTES INPUT IS GREATER THAN TOTAL MINUTES LEFT ON JOB
      **********************************************************************
                   MOVE  39    TO CATREAD-MSG-SET
                   MOVE  12    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE   5    TO FIELD-NUMBER
                   PERFORM ERASE-EMPTIES
                   PERFORM SCREEN2-ERROR
                   GO TO SHOWFORM2
               ELSE
               SUBTRACT ADJ-9  FROM LMIN
               MOVE ADJ-9      TO E-MIN E-CALC
               PERFORM E-ARITHMETIC THRU ARITH-EXIT
               MOVE SPACES     TO E-X.

           IF F-WO-NUM = SPACES
               NEXT SENTENCE
           ELSE
           IF F-X = SPACES
               NEXT SENTENCE
           ELSE
               MOVE F-X        TO ADJ
               PERFORM ADJUST
               IF ADJ NOT NUMERIC
      **********************************************************************
      **    MESSAGE 035/105:
      ** INVALID ENTRY
      **********************************************************************
                   MOVE  35    TO CATREAD-MSG-SET
                   MOVE 105    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE   6    TO FIELD-NUMBER
                   PERFORM ERASE-EMPTIES
                   PERFORM CALCULATE-MINUTES-LEFT
                   PERFORM SCREEN2-ERROR
                   GO TO SHOWFORM2
               ELSE
               ADD F-CALC      TO LMIN
               IF ADJ-9 > LMIN
                   SUBTRACT F-CALC FROM LMIN
      **********************************************************************
      **    MESSAGE 039/012:
      ** MINUTES INPUT IS GREATER THAN TOTAL MINUTES LEFT ON JOB
      **********************************************************************
                   MOVE  39    TO CATREAD-MSG-SET
                   MOVE  12    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE   6    TO FIELD-NUMBER
                   PERFORM ERASE-EMPTIES
                   PERFORM CALCULATE-MINUTES-LEFT
                   PERFORM SCREEN2-ERROR
                   GO TO SHOWFORM2
               ELSE
               SUBTRACT ADJ-9  FROM LMIN
               MOVE ADJ-9      TO F-MIN F-CALC
               PERFORM F-ARITHMETIC THRU ARITH-EXIT
               MOVE SPACES     TO F-X.

       ERASE-EMPTIES.
           IF B-WO-NUM2 = SPACES
               MOVE SPACES     TO WO-B2
               MOVE 0          TO B-CALC.

           IF C-WO-NUM2 = SPACES
               MOVE SPACES     TO WO-C2
               MOVE 0          TO C-CALC.

           IF D-WO-NUM2 = SPACES
               MOVE SPACES     TO WO-D2
               MOVE 0          TO D-CALC.

           IF E-WO-NUM2 = SPACES
               MOVE SPACES     TO WO-E2
               MOVE 0          TO E-CALC.

           IF F-WO-NUM2 = SPACES
               MOVE SPACES     TO WO-F2
               MOVE 0          TO F-CALC.

       CALCULATE-MINUTES-LEFT.
           COMPUTE CALC-DIFF = A-CALC + B-CALC + C-CALC +
                               D-CALC + E-CALC + F-CALC.
           COMPUTE LMIN = TMIN - CALC-DIFF.
           MOVE LMIN           TO MINUTES-LEFT.

       CONTINUE-CALCULATIONS.
           IF SHORT-SW = 0
               GO TO SHOWFORM2
           ELSE
               GO TO WRITE-LOOP.

       A-ARITHMETIC.
           MOVE ZEROS          TO CALC-BUFFERS.
           MOVE A-START        TO CALC-START.
           MOVE A-CALC         TO CALC-DIFF.
           PERFORM CALC-STOP.
           MOVE CALC-DT        TO A-STOP B-START.

       B-ARITHMETIC.
           MOVE ZEROS          TO CALC-BUFFERS.
           MOVE B-START        TO CALC-START.
           MOVE B-CALC         TO CALC-DIFF.
           PERFORM CALC-STOP.
           MOVE CALC-DT        TO B-STOP C-START.

       C-ARITHMETIC.
           MOVE ZEROS          TO CALC-BUFFERS.
           MOVE C-START        TO CALC-START.
           MOVE C-CALC         TO CALC-DIFF.
           PERFORM CALC-STOP.
           MOVE CALC-DT        TO C-STOP D-START.

       D-ARITHMETIC.
           MOVE ZEROS          TO CALC-BUFFERS.
           MOVE D-START        TO CALC-START.
           MOVE D-CALC         TO CALC-DIFF.
           PERFORM CALC-STOP.
           MOVE CALC-DT        TO D-STOP E-START.

       E-ARITHMETIC.
           MOVE ZEROS          TO CALC-BUFFERS.
           MOVE E-START        TO CALC-START.
           MOVE E-CALC         TO CALC-DIFF.
           PERFORM CALC-STOP.
           MOVE CALC-DT        TO E-STOP F-START.

       F-ARITHMETIC.
           MOVE ZEROS          TO CALC-BUFFERS.
           MOVE F-START        TO CALC-START.
           MOVE F-CALC         TO CALC-DIFF.
           PERFORM CALC-STOP.
           MOVE CALC-DT        TO F-STOP.

       ARITH-EXIT.             EXIT.

       WRITE-LOOP.
           MOVE 1              TO RESERVE-SW.
           IF A-STATUS = "CW"
               MOVE CNUM-BUF   TO EMP-NO
               MOVE A-WO-NUM2  TO WO-NO-CLS WOCW-BUF
               MOVE AS-DD      TO C-START-DD
               MOVE AS-MM      TO C-START-MM
               MOVE AS-YY      TO C-START-YY
               MOVE 20         TO C-START-CC
               IF C-START-YY > 70
                   MOVE 19     TO C-START-CC
               END-IF
               MOVE AST        TO C-START-TIME
               MOVE AC-DD      TO C-COMPL-DD
               MOVE AC-MM      TO C-COMPL-MM
               MOVE AC-YY      TO C-COMPL-YY
               MOVE 20         TO C-COMPL-CC
               IF C-COMPL-YY > 70
                   MOVE 19     TO C-COMPL-CC
               END-IF
               MOVE ACT        TO C-COMPL-TIME
               IF DATE-FLAG = 3
                   MOVE AS-MM  TO C-START-DD
                   MOVE AS-DD  TO C-START-MM
                   MOVE AC-MM  TO C-COMPL-DD
                   MOVE AC-DD  TO C-COMPL-MM
                   PERFORM CLOSE-FUNCTION
               ELSE
                   PERFORM CLOSE-FUNCTION
           ELSE
           IF A-STATUS = "LV"
               MOVE CNUM-BUF   TO EMP-NO
               MOVE A-WO-NUM2  TO WO-NO-CLS WOCW-BUF
               MOVE AS-DD      TO C-START-DD
               MOVE AS-MM      TO C-START-MM
               MOVE AS-YY      TO C-START-YY
               MOVE 20         TO C-START-CC
               IF C-START-YY > 70
                   MOVE 19     TO C-START-CC
               END-IF
               MOVE AST        TO C-START-TIME
               MOVE AC-DD      TO C-COMPL-DD
               MOVE AC-MM      TO C-COMPL-MM
               MOVE AC-YY      TO C-COMPL-YY
               MOVE 20         TO C-COMPL-CC
               IF C-COMPL-YY > 70
                   MOVE 19     TO C-COMPL-CC
               END-IF
               MOVE ACT        TO C-COMPL-TIME
               IF DATE-FLAG = 3
                   MOVE AS-MM  TO C-START-DD
                   MOVE AS-DD  TO C-START-MM
                   MOVE AC-MM  TO C-COMPL-DD
                   MOVE AC-DD  TO C-COMPL-MM
                   MOVE 1      TO LV-SW
                   PERFORM LEAVE-FUNCTION
               ELSE
                   MOVE 1      TO LV-SW
                   PERFORM LEAVE-FUNCTION.

           IF B-STATUS = "CW"
               MOVE CNUM-BUF   TO EMP-NO
               MOVE B-WO-NUM2  TO WO-NO-CLS WOCW-BUF
               MOVE BS-DD      TO C-START-DD
               MOVE BS-MM      TO C-START-MM
               MOVE BS-YY      TO C-START-YY
               MOVE 20         TO C-START-CC
               IF C-START-YY > 70
                   MOVE 19     TO C-START-CC
               END-IF
               MOVE BST        TO C-START-TIME
               MOVE BC-DD      TO C-COMPL-DD
               MOVE BC-MM      TO C-COMPL-MM
               MOVE BC-YY      TO C-COMPL-YY
               MOVE 20         TO C-COMPL-CC
               IF C-COMPL-YY > 70
                   MOVE 19     TO C-COMPL-CC
               END-IF
               MOVE BCT        TO C-COMPL-TIME
               IF DATE-FLAG = 3
                   MOVE BS-MM  TO C-START-DD
                   MOVE BS-DD  TO C-START-MM
                   MOVE BC-MM  TO C-COMPL-DD
                   MOVE BC-DD  TO C-COMPL-MM
                   PERFORM CLOSE-FUNCTION
               ELSE
                   PERFORM CLOSE-FUNCTION
           ELSE
           IF B-STATUS = "LV"
               MOVE CNUM-BUF   TO EMP-NO
               MOVE B-WO-NUM2  TO WO-NO-CLS WOCW-BUF
               MOVE BS-DD      TO C-START-DD
               MOVE BS-MM      TO C-START-MM
               MOVE BS-YY      TO C-START-YY
               MOVE 20         TO C-START-CC
               IF C-START-YY > 70
                   MOVE 19     TO C-START-CC
               END-IF
               MOVE BST        TO C-START-TIME
               MOVE BC-DD      TO C-COMPL-DD
               MOVE BC-MM      TO C-COMPL-MM
               MOVE BC-YY      TO C-COMPL-YY
               MOVE 20         TO C-COMPL-CC
               IF C-COMPL-YY > 70
                   MOVE 19     TO C-COMPL-CC
               END-IF
               MOVE BCT        TO C-COMPL-TIME
               IF DATE-FLAG = 3
                   MOVE BS-MM  TO C-START-DD
                   MOVE BS-DD  TO C-START-MM
                   MOVE BC-MM  TO C-COMPL-DD
                   MOVE BC-DD  TO C-COMPL-MM
                   MOVE 1      TO LV-SW
                   PERFORM LEAVE-FUNCTION
               ELSE
                   MOVE 1      TO LV-SW
                   PERFORM LEAVE-FUNCTION.

           IF C-STATUS = "CW"
               MOVE CNUM-BUF   TO EMP-NO
               MOVE C-WO-NUM2  TO WO-NO-CLS WOCW-BUF
               MOVE CS-DD      TO C-START-DD
               MOVE CS-MM      TO C-START-MM
               MOVE CS-YY      TO C-START-YY
               MOVE 20         TO C-START-CC
               IF C-START-YY > 70
                   MOVE 19     TO C-START-CC
               END-IF
               MOVE CST        TO C-START-TIME
               MOVE CC-DD      TO C-COMPL-DD
               MOVE CC-MM      TO C-COMPL-MM
               MOVE CC-YY      TO C-COMPL-YY
               MOVE 20         TO C-COMPL-CC
               IF C-COMPL-YY > 70
                   MOVE 19     TO C-COMPL-CC
               END-IF
               MOVE CCT        TO C-COMPL-TIME
               IF DATE-FLAG = 3
                   MOVE CS-MM  TO C-START-DD
                   MOVE CS-DD  TO C-START-MM
                   MOVE CC-MM  TO C-COMPL-DD
                   MOVE CC-DD  TO C-COMPL-MM
                   PERFORM CLOSE-FUNCTION
               ELSE
                   PERFORM CLOSE-FUNCTION
           ELSE
           IF C-STATUS = "LV"
               MOVE CNUM-BUF   TO EMP-NO
               MOVE C-WO-NUM2  TO WO-NO-CLS WOCW-BUF
               MOVE CS-DD      TO C-START-DD
               MOVE CS-MM      TO C-START-MM
               MOVE CS-YY      TO C-START-YY
               MOVE 20         TO C-START-CC
               IF C-START-YY > 70
                   MOVE 19     TO C-START-CC
               END-IF
               MOVE CST        TO C-START-TIME
               MOVE CC-DD      TO C-COMPL-DD
               MOVE CC-MM      TO C-COMPL-MM
               MOVE CC-YY      TO C-COMPL-YY
               MOVE 20         TO C-COMPL-CC
               IF C-COMPL-YY > 70
                   MOVE 19     TO C-COMPL-CC
               END-IF
               MOVE CCT        TO C-COMPL-TIME
               IF DATE-FLAG = 3
                   MOVE CS-MM  TO C-START-DD
                   MOVE CS-DD  TO C-START-MM
                   MOVE CC-MM  TO C-COMPL-DD
                   MOVE CC-DD  TO C-COMPL-MM
                   MOVE 1      TO LV-SW
                   PERFORM LEAVE-FUNCTION
               ELSE
                   MOVE 1      TO LV-SW
                   PERFORM LEAVE-FUNCTION.

           IF D-STATUS = "CW"
               MOVE CNUM-BUF   TO EMP-NO
               MOVE D-WO-NUM2  TO WO-NO-CLS WOCW-BUF
               MOVE DS-DD      TO C-START-DD
               MOVE DS-MM      TO C-START-MM
               MOVE DS-YY      TO C-START-YY
               MOVE 20         TO C-START-CC
               IF C-START-YY > 70
                   MOVE 19     TO C-START-CC
               END-IF
               MOVE DST        TO C-START-TIME
               MOVE DC-DD      TO C-COMPL-DD
               MOVE DC-MM      TO C-COMPL-MM
               MOVE DC-YY      TO C-COMPL-YY
               MOVE 20         TO C-COMPL-CC
               IF C-COMPL-YY > 70
                   MOVE 19     TO C-COMPL-CC
               END-IF
               MOVE DCT        TO C-COMPL-TIME
               IF DATE-FLAG = 3
                   MOVE DS-MM  TO C-START-DD
                   MOVE DS-DD  TO C-START-MM
                   MOVE DC-MM  TO C-COMPL-DD
                   MOVE DC-DD  TO C-COMPL-MM
                   PERFORM CLOSE-FUNCTION
               ELSE
                   PERFORM CLOSE-FUNCTION
           ELSE
           IF D-STATUS = "LV"
               MOVE CNUM-BUF   TO EMP-NO
               MOVE D-WO-NUM2  TO WO-NO-CLS WOCW-BUF
               MOVE DS-DD      TO C-START-DD
               MOVE DS-MM      TO C-START-MM
               MOVE DS-YY      TO C-START-YY
               MOVE 20         TO C-START-CC
               IF C-START-YY > 70
                   MOVE 19     TO C-START-CC
               END-IF
               MOVE DST        TO C-START-TIME
               MOVE DC-DD      TO C-COMPL-DD
               MOVE DC-MM      TO C-COMPL-MM
               MOVE DC-YY      TO C-COMPL-YY
               MOVE 20         TO C-COMPL-CC
               IF C-COMPL-YY > 70
                   MOVE 19     TO C-COMPL-CC
               END-IF
               MOVE DCT        TO C-COMPL-TIME
               IF DATE-FLAG = 3
                   MOVE DS-MM  TO C-START-DD
                   MOVE DS-DD  TO C-START-MM
                   MOVE DC-MM  TO C-COMPL-DD
                   MOVE DC-DD  TO C-COMPL-MM
                   MOVE 1      TO LV-SW
                   PERFORM LEAVE-FUNCTION
               ELSE
                   MOVE 1      TO LV-SW
                   PERFORM LEAVE-FUNCTION.

           IF E-STATUS = "CW"
               MOVE CNUM-BUF   TO EMP-NO
               MOVE E-WO-NUM2  TO WO-NO-CLS WOCW-BUF
               MOVE ES-DD      TO C-START-DD
               MOVE ES-MM      TO C-START-MM
               MOVE ES-YY      TO C-START-YY
               MOVE 20         TO C-START-CC
               IF C-START-YY > 70
                   MOVE 19     TO C-START-CC
               END-IF
               MOVE EST        TO C-START-TIME
               MOVE EC-DD      TO C-COMPL-DD
               MOVE EC-MM      TO C-COMPL-MM
               MOVE EC-YY      TO C-COMPL-YY
               MOVE 20         TO C-COMPL-CC
               IF C-COMPL-YY > 70
                   MOVE 19     TO C-COMPL-CC
               END-IF
               MOVE ECT        TO C-COMPL-TIME
               IF DATE-FLAG = 3
                   MOVE ES-MM  TO C-START-DD
                   MOVE ES-DD  TO C-START-MM
                   MOVE EC-MM  TO C-COMPL-DD
                   MOVE EC-DD  TO C-COMPL-MM
                   PERFORM CLOSE-FUNCTION
               ELSE
                   PERFORM CLOSE-FUNCTION
           ELSE
           IF E-STATUS = "LV"
               MOVE CNUM-BUF   TO EMP-NO
               MOVE E-WO-NUM2  TO WO-NO-CLS WOCW-BUF
               MOVE ES-DD      TO C-START-DD
               MOVE ES-MM      TO C-START-MM
               MOVE ES-YY      TO C-START-YY
               MOVE 20         TO C-START-CC
               IF C-START-YY > 70
                   MOVE 19     TO C-START-CC
               END-IF
               MOVE EST        TO C-START-TIME
               MOVE EC-DD      TO C-COMPL-DD
               MOVE EC-MM      TO C-COMPL-MM
               MOVE EC-YY      TO C-COMPL-YY
               MOVE 20         TO C-COMPL-CC
               IF C-COMPL-YY > 70
                   MOVE 19     TO C-COMPL-CC
               END-IF
               MOVE ECT        TO C-COMPL-TIME
               IF DATE-FLAG = 3
                   MOVE ES-MM  TO C-START-DD
                   MOVE ES-DD  TO C-START-MM
                   MOVE EC-MM  TO C-COMPL-DD
                   MOVE EC-DD  TO C-COMPL-MM
                   MOVE 1      TO LV-SW
                   PERFORM LEAVE-FUNCTION
               ELSE
                   MOVE 1      TO LV-SW
                   PERFORM LEAVE-FUNCTION.

           IF F-STATUS = "CW"
               MOVE CNUM-BUF   TO EMP-NO
               MOVE F-WO-NUM2  TO WO-NO-CLS WOCW-BUF
               MOVE FS-DD      TO C-START-DD
               MOVE FS-MM      TO C-START-MM
               MOVE FS-YY      TO C-START-YY
               MOVE 20         TO C-START-CC
               IF C-START-YY > 70
                   MOVE 19     TO C-START-CC
               END-IF
               MOVE FST        TO C-START-TIME
               MOVE FC-DD      TO C-COMPL-DD
               MOVE FC-MM      TO C-COMPL-MM
               MOVE FC-YY      TO C-COMPL-YY
               MOVE 20         TO C-COMPL-CC
               IF C-COMPL-YY > 70
                   MOVE 19     TO C-COMPL-CC
               END-IF
               MOVE FCT        TO C-COMPL-TIME
               IF DATE-FLAG = 3
                   MOVE FS-MM  TO C-START-DD
                   MOVE FS-DD  TO C-START-MM
                   MOVE FC-MM  TO C-COMPL-DD
                   MOVE FC-DD  TO C-COMPL-MM
                   PERFORM CLOSE-FUNCTION
               ELSE
                   PERFORM CLOSE-FUNCTION
           ELSE
           IF F-STATUS = "LV"
               MOVE CNUM-BUF   TO EMP-NO
               MOVE F-WO-NUM2  TO WO-NO-CLS WOCW-BUF
               MOVE FS-DD      TO C-START-DD
               MOVE FS-MM      TO C-START-MM
               MOVE FS-YY      TO C-START-YY
               MOVE 20         TO C-START-CC
               IF C-START-YY > 70
                   MOVE 19     TO C-START-CC
               END-IF
               MOVE FST        TO C-START-TIME
               MOVE FC-DD      TO C-COMPL-DD
               MOVE FC-MM      TO C-COMPL-MM
               MOVE FC-YY      TO C-COMPL-YY
               MOVE 20         TO C-COMPL-CC
               IF C-COMPL-YY > 70
                   MOVE 19     TO C-COMPL-CC
               END-IF
               MOVE FCT        TO C-COMPL-TIME
               IF DATE-FLAG = 3
                   MOVE FS-MM  TO C-START-DD
                   MOVE FS-DD  TO C-START-MM
                   MOVE FC-MM  TO C-COMPL-DD
                   MOVE FC-DD  TO C-COMPL-MM
                   MOVE 1      TO LV-SW
                   PERFORM LEAVE-FUNCTION
               ELSE
                   MOVE 1      TO LV-SW
                   PERFORM LEAVE-FUNCTION.

           GO TO END-OF-JOB.

       CALC-STOP.
           MOVE 0              TO DATE-SW.
           IF DATE-FLAG = 3
               MOVE CSTR-DD    TO DH-DD
               MOVE CSTR-MM    TO CSTR-DD
               MOVE DH-DD      TO CSTR-MM.

           MOVE CALC-STRT-T    TO CALC-TIME.
           MOVE CALC-DIFF      TO CALC-MIN.
           PERFORM TIME-TO-MINUTES.
           MOVE CALC-DIFF      TO CALC-STRT.
           COMPUTE CALC-DIFF = CALC-MIN + CALC-STRT.
           IF CALC-DIFF > 1440
               SUBTRACT 1440   FROM CALC-DIFF
               MOVE 1          TO DATE-SW.
           MOVE CALC-START     TO CALC-DT.
           PERFORM MINUTES-TO-TIME.
           IF DATE-SW = 1
               MOVE C-DATE-YY  TO CALC-YY
               MOVE C-DATE-MM  TO CALC-MM
               MOVE C-DATE-DD  TO CALC-DD
               IF DATE-FLAG = 3
                   MOVE C-DATE-MM  TO CALC-DD
                   MOVE C-DATE-DD  TO CALC-MM.

       MOVE-UP.
           IF A-STATUS = SPACES
               PERFORM SHIFT-1 THRU SHIFT-EXIT.

           IF B-STATUS = SPACES
               PERFORM SHIFT-2 THRU SHIFT-EXIT.

           IF C-STATUS = SPACES
               PERFORM SHIFT-3 THRU SHIFT-EXIT.

           IF D-STATUS = SPACES
               PERFORM SHIFT-4 THRU SHIFT-EXIT.

       SHIFT-1.
           MOVE WO-B2          TO WO-A2.

       SHIFT-2.
           MOVE WO-C2          TO WO-B2.

       SHIFT-3.
           MOVE WO-D2          TO WO-C2.

       SHIFT-4.
           MOVE WO-E2          TO WO-D2.

       SHIFT-5.
           MOVE SPACES         TO WO-E2.

       SHIFT-EXIT.             EXIT.

       CLEAR-QUEUE.
           MOVE WO-KEY         TO WONUM OF WO-OPEN-Q-WO.
           START WO-OPEN-Q-WO  KEY = WONUM OF WO-OPEN-Q-WO
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT-1 = "2"
                   GO TO CLEAR-EXIT
               ELSE
                   MOVE "START   " TO DB-FUNC
                   MOVE "WO-OPEN-Q-WO" TO DB-FILE
                   MOVE FILE-STAT  TO CON-WORD
                   DISPLAY DB-ERROR
                   GO TO END-OF-JOB.

           READ WO-OPEN-Q-WO   NEXT INTO WO-QUEUE-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT = "10" OR "14" OR "46"
                   GO TO CLEAR-EXIT
               ELSE
                   MOVE "READ    " TO DB-FUNC
                   MOVE "WO-OPEN-Q-WO" TO DB-FILE
                   MOVE FILE-STAT  TO CON-WORD
                   DISPLAY DB-ERROR
                   GO TO END-OF-JOB.

           IF Q-WO-NUM NOT = WO-KEY
               GO TO CLEAR-EXIT.

           MOVE WO-QUEUE-DATA  TO WO-HOLD-AREA.
           MOVE "D"            TO QUEUE-SW.
           CALL "TQUPDATE"     USING DBPARAMETERS
                               WO-QUEUE-DATA
                               QUEUE-SW
                               QUEUE-ERROR.

           MOVE WO-HOLD-AREA   TO WO-QUEUE-DATA.
           MOVE SPACES         TO Q-RESERVE.
           MOVE "9999"         TO Q-CC-NUM.
           MOVE "A"            TO QUEUE-SW.
           CALL "TQUPDATE"     USING DBPARAMETERS
                               WO-QUEUE-DATA
                               QUEUE-SW
                               QUEUE-ERROR.

       CLEAR-EXIT.             EXIT.

       CLEAR-RESERVE.
           MOVE CNUM-BUF       TO PERCCNUM OF WO-OPEN-Q-CC.
           START WO-OPEN-Q-CC  KEY = PERCCNUM OF WO-OPEN-Q-CC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT-1 = "2"
                   GO TO CR-EXIT
               ELSE
                   MOVE "START   " TO DB-FUNC
                   MOVE "WO-OPEN-Q-CC" TO DB-FILE
                   MOVE FILE-STAT  TO CON-WORD
                   DISPLAY DB-ERROR
                   GO TO END-OF-JOB.

       CLEAR-LOOP.
           READ WO-OPEN-Q-CC   NEXT INTO WO-QUEUE-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT = "10" OR "14" OR "46"
                   GO TO CR-EXIT
               ELSE
                   MOVE "READ    " TO DB-FUNC
                   MOVE "WO-OPEN-Q-CC" TO DB-FILE
                   MOVE FILE-STAT  TO CON-WORD
                   DISPLAY DB-ERROR
                   GO TO END-OF-JOB.

           IF Q-CC-NUM NOT = CNUM-BUF
               GO TO CR-EXIT.

           IF Q-RESERVE NOT = "XX"
               GO TO CLEAR-LOOP.

           MOVE 0              TO CW-SW.
           IF Q-CW-LINK = "CW"
               MOVE 1          TO CW-SW.

           MOVE WO-QUEUE-DATA  TO WO-HOLD-AREA.
           MOVE "D"            TO QUEUE-SW.
               CALL "TQUPDATE" USING DBPARAMETERS
                               WO-QUEUE-DATA
                               QUEUE-SW
                               QUEUE-ERROR.

           IF CW-SW = 0
               MOVE WO-HOLD-AREA TO WO-QUEUE-DATA
               MOVE SPACES     TO Q-RESERVE
               MOVE "9999"     TO Q-CC-NUM
               MOVE "A"        TO QUEUE-SW
               CALL "TQUPDATE" USING DBPARAMETERS
                               WO-QUEUE-DATA
                               QUEUE-SW
                               QUEUE-ERROR.

           GO TO CLEAR-LOOP.

       CR-EXIT.                EXIT.

       DISPLAY-WO.
           MOVE WO-KEY         TO WONUM OF WO-BASIC.
           START WO-BASIC      KEY = WONUM OF WO-BASIC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT-1 = "2"
      **********************************************************************
      **    MESSAGE 035/040:
      ** INVALID WORKORDER NUMBER
      **********************************************************************
                   MOVE  35    TO CATREAD-MSG-SET
                   MOVE  40    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO ERRMSG2
                   GO TO DISPLAY-EXIT
               ELSE
                   MOVE "START   " TO DB-FUNC
                   MOVE "WO-BASIC" TO DB-FILE
                   MOVE FILE-STAT  TO CON-WORD
                   MOVE DB-ERROR   TO MESSAGE-BUFFER
                   MOVE MESSAGE-BUFFER TO ERRMSG2
                   GO TO DISPLAY-EXIT.

           READ WO-BASIC       NEXT INTO WO-BASIC-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT = "10" OR "14" OR "46"
      **********************************************************************
      **    MESSAGE 035/040:
      ** INVALID WORKORDER NUMBER
      **********************************************************************
                   MOVE  35    TO CATREAD-MSG-SET
                   MOVE  40    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO ERRMSG2
                   GO TO DISPLAY-EXIT
               ELSE
                   MOVE "READ    " TO DB-FUNC
                   MOVE "WO-BASIC" TO DB-FILE
                   MOVE FILE-STAT  TO CON-WORD
                   MOVE DB-ERROR   TO MESSAGE-BUFFER
                   MOVE MESSAGE-BUFFER TO ERRMSG2
                   GO TO DISPLAY-EXIT.

           IF WO-NUM NOT = WO-KEY
      **********************************************************************
      **    MESSAGE 035/040:
      ** INVALID WORKORDER NUMBER
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE  40        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSG2
               GO TO DISPLAY-EXIT.

       DISPLAY-CALL.
           CALL "TDISPWO"      USING DBPARAMETERS
                               WO-BASIC-DATA
                               WO-PLANNED-DATA
                               FILE-SW.

           MOVE "VMULTILV1"    TO SCREEN-NAME.
           MOVE MESSAGE-BUFFER TO ERRMSG1.

       DISPLAY-EXIT.           EXIT.

       TIME-TO-MINUTES.
           IF CALC-HR-X = "  " MOVE ZEROES TO CALC-HR.
           IF CALC-MN-X = "  " MOVE ZEROES TO CALC-MN.
           COMPUTE CALC-DIFF = (CALC-HR * 60) + CALC-MN.

       MINUTES-TO-TIME.
           DIVIDE 60 INTO CALC-DIFF GIVING ROOT-HOURS.
           MOVE ROOT-HOURS     TO CALC-HR.
           COMPUTE HR-MIN = ROOT-HOURS * 60.
           SUBTRACT HR-MIN     FROM CALC-DIFF GIVING CALC-MN.

       ADJUST.
           PERFORM ELIMINATE   UNTIL X-4 NOT = SPACE.
           IF X-1 = SPACE      MOVE "0" TO X-1.
           IF X-2 = SPACE      MOVE "0" TO X-2.
           IF X-3 = SPACE      MOVE "0" TO X-3.

       ELIMINATE.
           MOVE X-3            TO X-4.
           MOVE X-2            TO X-3.
           MOVE X-1            TO X-2.
           MOVE "0"            TO X-1.

       SCREEN1-ERROR.
           MOVE MESSAGE-BUFFER TO ERRMSG1.
           MOVE TRUE-VAL       TO IND (FIELD-NUMBER) IND (99).

       SCREEN2-ERROR.
           MOVE MESSAGE-BUFFER TO ERRMSG2.
           MOVE TRUE-VAL       TO IND (FIELD-NUMBER) IND (99).

       LEAVE-FUNCTION.
           MOVE 0              TO CW-SW.
           IF RESERVE-SW > 0
               PERFORM CW-READ-QUEUE THRU CWRQ-EXIT
               MOVE SPACES     TO WO-QUEUE-DATA
               MOVE WO-NO-CLS  TO Q-WO-NUM
               MOVE "D"        TO QUEUE-SW
               CALL "TQUPDATE" USING DBPARAMETERS
                               WO-QUEUE-DATA
                               QUEUE-SW
                               QUEUE-ERROR.

           CALL "TLVWORK"      USING DBPARAMETERS
                               CNUM-BUFFER
                               LV-BUF-DATA
                               RESERVE-SW
                               LABOR-CURR-DATA
                               WO-TRACK-DATA.

           IF CW-SW = 1
               MOVE SPACES     TO WO-QUEUE-DATA
               MOVE WO-NO-CLS  TO Q-WO-NUM
               MOVE "D"        TO QUEUE-SW
               CALL "TQUPDATE" USING DBPARAMETERS
                               WO-QUEUE-DATA
                               QUEUE-SW
                               QUEUE-ERROR.

       CLOSE-FUNCTION.
           IF RESERVE-SW > 0
               MOVE SPACES     TO WO-QUEUE-DATA
               MOVE WO-NO-CLS  TO Q-WO-NUM
               MOVE "D"        TO QUEUE-SW
               CALL "TQUPDATE" USING DBPARAMETERS
                               WO-QUEUE-DATA
                               QUEUE-SW
                               QUEUE-ERROR.

           CALL "TNEWCOMP"     USING DBPARAMETERS
                               CNUM-BUFFER
                               DATA-BUFFER
                               RESERVE-SW
                               LABOR-CURR-DATA
                               WO-TRACK-DATA.

           IF RETURN-BYTE = "L"
               MOVE 1          TO LV-SW
               IF CALL-PGM = "S"
                  MOVE CALL-PGM TO RETURN-BYTE
               END-IF
      *        MOVE SPACE      TO RETURN-BYTE
               MOVE WO-NO-CLS  TO WOCW-BUF
               PERFORM LEAVE-FUNCTION.

       CW-READ-QUEUE.
           MOVE WO-NO-CLS      TO WONUM OF WO-OPEN-Q-WO.
           START WO-OPEN-Q-WO  KEY = WONUM OF WO-OPEN-Q-WO
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT-1 = "2"
                   GO TO CWRQ-EXIT
               ELSE
                   MOVE "START   " TO DB-FUNC
                   MOVE "WO-OPEN-Q-WO" TO DB-FILE
                   MOVE FILE-STAT  TO CON-WORD
                   MOVE DB-ERROR   TO MESSAGE-BUFFER
                   GO TO CWRQ-EXIT.

           READ WO-OPEN-Q-WO   NEXT INTO WO-QUEUE-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT = "10" OR "14" OR "46"
                   GO TO CLEAR-EXIT
               ELSE
                   MOVE "READ    " TO DB-FUNC
                   MOVE "WO-OPEN-Q-WO" TO DB-FILE
                   MOVE FILE-STAT  TO CON-WORD
                   MOVE DB-ERROR   TO MESSAGE-BUFFER
                   GO TO CWRQ-EXIT.

           IF Q-WO-NUM NOT = WO-NO-CLS
               GO TO CWRQ-EXIT.

           IF Q-CW-LINK = "CW" OR "IP"
               MOVE 1          TO CW-SW.

       CWRQ-EXIT.              EXIT.

       END-OF-JOB.
           CLOSE               WO-BASIC.
           CLOSE               WO-PLANNED.
           CLOSE               WO-OPEN-Q-CC.
           CLOSE               WO-OPEN-Q-WO.
           CLOSE               DISPLAY-FILE.
           GOBACK.

       HELP-FUNCTION.
           MOVE "VMULTHELP"    TO SCREEN-NAME.
           MOVE MESSAGE-BUFFER TO ERRMSG3.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-THREE   TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.

       HELP-EXIT.              EXIT.

       999-CATREAD.
           MOVE SPACES         TO MESSAGE-BUFFER.
           CALL "CCATREAD"     USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.       EXIT.

