       IDENTIFICATION DIVISION.

       PROGRAM-ID.     TARBEXCP1.
       AUTHOR.         EXLTECH, LLC - DAN RAUCH

      ***************************************************************
      **                    T A R I B A R P T
      ***************************************************************
      **         ARIBA CATALOG PREFERRED ITEM EXCEPTION REPORT
      ***************************************************************
      **
      ** ------------------------------------------------------------
      ** NOTE:  THIS PROGRAM RUNS AS PART OF THE CATALOG LOAD PROCESS
      ** ------------------------------------------------------------
      **
      ** FIND THE PREFERRED CATALOG ITEM AND THE PREFERRED DMANPART
      ** ITEM - PRINT WHEN:
      **
      **      1)  CATALOG ITEM MANF NAME NOT = DMANPART MANF NAME
      **      OR  CATALOG ITEM MANF PART NOT = DMANPART MANF PART
      **
      ***************************************************************
      * Modification History:                                       *
      *                                                             *
      *    Date     Name             Description                    *
      * ----------  ---------------  ------------------------------ *
      * mm/dd/yyyy                                                  *
      ***************************************************************


      *================================================================
       ENVIRONMENT DIVISION.
      *===============================================================
       CONFIGURATION SECTION.

       SOURCE-COMPUTER.       IBM-AS400.
       OBJECT-COMPUTER.       IBM-AS400.
       SPECIAL-NAMES.         LOCAL-DATA LDA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.


           SELECT CATALOG-FILE  ASSIGN TO DATABASE-MCFLAB2004
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS IS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

           SELECT CATALOG-FILE-2  ASSIGN TO DATABASE-MCFLAB2003
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS IS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES.

           SELECT OVERRIDE-FILE ASSIGN TO DATABASE-MCFLAB2702
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS IS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

           SELECT DMANPART-FILE ASSIGN TO DATABASE-MCFLCS3603
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS IS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

           SELECT REPORT-FILE     ASSIGN TO FORMATFILE-XARBEXCP1.

      *================================================================
       DATA DIVISION.
      *================================================================
       FILE SECTION.

       FD  CATALOG-FILE.
       01  CATALOG-REC.
       COPY DDS-ALL-FORMATS OF MCFLAB2004.
       COPY DARIBACAT  IN COPYLIB.

       FD  CATALOG-FILE-2.
       01  CATALOG-REC-2.
       COPY DDS-ALL-FORMATS OF MCFLAB2003.
       COPY DARIBACAT2 IN COPYLIB.

       FD  OVERRIDE-FILE.
       01  OVERRIDE-REC.
       COPY DDS-ALL-FORMATS OF MCFLAB2702.
       COPY DARIBAOVR  IN COPYLIB.

       FD  DMANPART-FILE.
       01  DMANPART-REC.
       COPY DDS-ALL-FORMATS OF MCFLCS3603.
       COPY DMANPART  IN COPYLIB.

       FD  REPORT-FILE.
       01  REPORT-REC.
       COPY DDS-ALL-FORMATS OF XARBEXCP1.

      *----------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *----------------------------------------------------------------
       COPY FILESTATUS IN COPYLIB.
       COPY DTSPARMS2  IN COPYLIB.
       COPY ZMPLTWS     IN COPYLIB.

       01  WS-ALL-INDICATORS.
           03  IN83              PIC 1   INDIC 83   VALUE B"0".

       01  WS-PRINT-LINE-FLDS.

           03  WS-HDG00-FLDS.
               05  HDRDAT            PIC X(10)          VALUE SPACE.
               05  HDPLNT            PIC X(20)          VALUE SPACE.
               05  HDRTIM            PIC X(08)          VALUE SPACE.
               05  HDPAGE            PIC 9(05)          VALUE ZERO.
               05  HDPROG            PIC X(10)          VALUE SPACE.

            03  WS-DTL00-FLDS.
                05  DLCC              PIC X(08)          VALUE SPACE.
                05  DLNAME1           PIC X(30)          VALUE SPACE.
                05  DLNAME2           PIC X(30)          VALUE SPACE.
                05  DLPART1           PIC X(30)          VALUE SPACE.
                05  DLPART2           PIC X(30)          VALUE SPACE.
                05  DLTYPE            PIC X(10)          VALUE SPACE.
                05  DLVENDR           PIC X(10)          VALUE SPACE.
                05  DLREASN           PIC X(04)          VALUE SPACE.
                05  DLPPRIC           PIC 9(11)V9999     VALUE ZERO.
                05  DLOPRIC           PIC 9(11)V9999     VALUE ZERO.

            03  WS-TOT00-FLDS.
                05  TLREAD            PIC 9(07)          VALUE ZERO.
                05  TLPRNT            PIC 9(07)          VALUE ZERO.

      *****************************************************************
      *  PROGRAM COUNTERS
      *****************************************************************
       01  WS-PROGRAM-COUNTERS.
           03  WS-L0-READ-CNT      PIC  9(07)      VALUE ZERO.
           03  WS-L0-PRNT-CNT      PIC  9(07)      VALUE ZERO.

      *****************************************************************
      *  MISCELLANEOUS WORK FIELDS
      *****************************************************************
       01  WS-MISCELLANEOUS-FIELDS.

           03  WS-KEY-CORPCODE     PIC  X(08)      VALUE SPACE.
           03  WS-SAVE-CORPCODE    PIC  X(08)      VALUE SPACE.
           03  WS-DMP-MANF-NAME    PIC  X(50)      VALUE SPACE.
           03  WS-DMP-MANF-PART    PIC  X(50)      VALUE SPACE.
           03  WS-PROGRAM-NAME     PIC  X(10)      VALUE "TARBEXCP1".
           03  WS-PREFERRD         PIC  X(10)  VALUE "*PREFERRD*".
           03  WS-OVERRIDE         PIC  X(10)  VALUE "*OVERRIDE*".

           03  WS-ITEM-OVRD-SW     PIC  X(01)      VALUE SPACE.
               88  ITEM-OVERRIDE-NO                VALUE "N".
               88  ITEM-OVERRIDE-YES               VALUE "Y".

           03  WS-PLTNUM-KEY.
               05  FILLER        PIC X(4)           VALUE "P 01".

           03  WS-PLTNAME-KEY.
               05  FILLER        PIC X              VALUE "Z".
               05  WS-PLTNUM     PIC X(3)           VALUE SPACE.

           03  WS-RUN-DATE.
               05  WS-RUN-MM     PIC XX             VALUE SPACE.
               05  FILLER        PIC X              VALUE "-".
               05  WS-RUN-DD     PIC XX             VALUE SPACE.
               05  FILLER        PIC X              VALUE "-".
               05  WS-RUN-CC     PIC XX             VALUE SPACE.
               05  WS-RUN-YY     PIC XX             VALUE SPACE.

           03  WS-RUN-TIME.
               05  WS-RUN-HH     PIC XX             VALUE SPACE.
               05  FILLER        PIC X              VALUE ":".
               05  WS-RUN-MN     PIC XX             VALUE SPACE.
               05  FILLER        PIC X              VALUE ":".
               05  WS-RUN-SS     PIC XX             VALUE SPACE.

           03  WS-PLANT-NAME     PIC  X(20)         VALUE SPACE.
           03  WS-PAGE-NBR       PIC  9(05)         VALUE ZERO.
           03  WS-REC-CNTR       PIC  9(05)         VALUE ZERO.

           03  WS-PRINT-HEADINGS-SW   PIC X         VALUE  SPACE.
               88  PRINT-HEADINGS-NO                VALUE  "N".
               88  PRINT-HEADINGS-YES               VALUE  "Y".

           03  WS-MATCH-FOUND-SW      PIC X         VALUE  SPACE.
               88  MATCH-FOUND-NO                   VALUE  "N".
               88  MATCH-FOUND-YES                  VALUE  "Y".


      *================================================================
      *=             P R O C E D U R E    D I V I S I O N
      *================================================================
       PROCEDURE DIVISION.
       0000-PROGRAM-ENTRY.

           OPEN  INPUT  CATALOG-FILE
                        CATALOG-FILE-2
                        OVERRIDE-FILE
                        DMANPART-FILE
                 OUTPUT REPORT-FILE.


           PERFORM 0010-INITIALIZE       THRU 0010-EXIT.

           PERFORM 1000-MAIN-LOGIC       THRU 1000-EXIT
                   UNTIL FS-END-OF-FILE.

           PERFORM 0099-EOJ              THRU 0099-EXIT.


           CLOSE        CATALOG-FILE
                        CATALOG-FILE-2
                        OVERRIDE-FILE
                        DMANPART-FILE
                        REPORT-FILE.

       0000-PROGRAM-END.
           GOBACK.

      *****************************************************************
      ** 1ST TIME PROCESSING ROUTINE
      *****************************************************************
       0010-INITIALIZE.

           SET  PRINT-HEADINGS-YES  TO TRUE.

           CALL "GETDTSTMP2" USING WS-SYSTEM-DATE-TIME2.
           MOVE WS-SYSTEM-DATE2-MON   TO  WS-RUN-MM.
      ** EDIT THE LEADING ZERO
           IF   WS-RUN-MM(1:1) = "0"
                MOVE SPACE            TO  WS-RUN-MM(1:1)
           END-IF.
           MOVE WS-SYSTEM-DATE2-DAY   TO  WS-RUN-DD.
           MOVE WS-SYSTEM-DATE2-CEN   TO  WS-RUN-CC.
           MOVE WS-SYSTEM-DATE2-YEAR  TO  WS-RUN-YY.

           MOVE WS-SYSTEM-TIME2-HRS   TO  WS-RUN-HH.
           MOVE WS-SYSTEM-TIME2-MIN   TO  WS-RUN-MN.
           MOVE WS-SYSTEM-TIME2-SEC   TO  WS-RUN-SS.
      ** EDIT THE LEADING ZERO
           IF   WS-RUN-HH(1:1) = "0"
                MOVE SPACE            TO  WS-RUN-HH(1:1)
           END-IF.

      ** GET THE PLANT NBR
           MOVE WS-PLTNUM-KEY      TO  WS-ZMPLT-KEY.
           PERFORM ZMPLT-GET-MPLTINFO  THRU ZMPLT-EXIT.
           MOVE WS-ZMPLT-PLTINFODTA(1:3)  TO WS-PLTNUM.

      ** CONCATENATE PLT NBR WITH "Z" TO BUILD PLANT NAME KEY FOR HDG
           MOVE WS-PLTNAME-KEY     TO  WS-ZMPLT-KEY.
           PERFORM ZMPLT-GET-MPLTINFO  THRU ZMPLT-EXIT.
           MOVE WS-ZMPLT-PLTINFODTA(1:30)  TO WS-PLANT-NAME.

           PERFORM 9100-START-CATALOG    THRU 9100-START-EXIT.
           PERFORM 9100-READN-CATALOG    THRU 9100-READN-EXIT.

       0010-EXIT.
            EXIT.

      *****************************************************************
      ** END OF JOB PROCESSING
      *****************************************************************
       0099-EOJ.

           IF  PRINT-HEADINGS-YES
               PERFORM 2999-PRINT-HEADINGS   THRU 2999-EXIT
           END-IF.

           MOVE WS-L0-READ-CNT    TO TLREAD   OF WS-TOT00-FLDS.
           MOVE WS-L0-PRNT-CNT    TO TLPRNT   OF WS-TOT00-FLDS.
           MOVE CORR WS-TOT00-FLDS   TO  TOTAL1-O.

           WRITE REPORT-REC FORMAT "TOTAL1"
           END-WRITE.

           WRITE REPORT-REC FORMAT "EOR"
           END-WRITE.

       0099-EXIT.
           EXIT.

      *****************************************************************
      ***  MAIN PROCESSING LOOP ROUTINE
      *****************************************************************
       1000-MAIN-LOGIC.

           PERFORM 9300-READK-OVERRIDE   THRU 9300-READK-EXIT.

           SET  MATCH-FOUND-NO    TO TRUE.
           MOVE ZERO              TO WS-REC-CNTR.
           PERFORM 9000-START-DMANPART   THRU 9000-START-EXIT.
           PERFORM 1100-FIND-A-MATCH     THRU 1100-EXIT.

           IF  MATCH-FOUND-NO
           AND WS-REC-CNTR > ZERO
               PERFORM 9000-START-DMANPART   THRU 9000-START-EXIT
               MOVE ZERO           TO WS-REC-CNTR
               PERFORM 1200-READ-AND-PRINT   THRU 1200-EXIT
           END-IF.

      *----------------------------------------------------------------
      ***  READ THE NEXT CATALOG PREFERENCE RECORD
      *----------------------------------------------------------------
           PERFORM 9100-READN-CATALOG    THRU 9100-READN-EXIT.

       1000-EXIT.
            EXIT.

      *****************************************************************
      ***  FIND A MATCH BETWEEN PREFERRED CATALOG & PREFERRED DMANPART
      ***  IF A MATCH IS FOUND - STOP - GET THE NEXT PREFERRED CAT REC
      *****************************************************************
       1100-FIND-A-MATCH.

           PERFORM 9000-READN-DMANPART   THRU 9000-READN-EXIT.
           IF  FS-END-OF-FILE
               GO TO 1100-EXIT
           END-IF.

           ADD  1               TO WS-REC-CNTR.
           IF  ITEM-OVERRIDE-NO

               IF  ARIBACAT-MANUFACT-NAME    = WS-DMP-MANF-NAME
               AND ARIBACAT-MANUFACT-PARTNO  = WS-DMP-MANF-PART
                   SET MATCH-FOUND-YES  TO TRUE
                   GO TO 1100-EXIT
               END-IF

           ELSE

              IF  ITEM-OVERRIDE-YES

                  IF  ARIBAOVR-MANUFACT-NAME    = WS-DMP-MANF-NAME
                  AND ARIBAOVR-MANUFACT-PARTNO  = WS-DMP-MANF-PART
                      SET MATCH-FOUND-YES  TO TRUE
                      GO TO 1100-EXIT
                  END-IF

              END-IF

           END-IF.

           GO TO 1100-FIND-A-MATCH.

       1100-EXIT.
           EXIT.

      *****************************************************************
      ***  FIND A MATCH BETWEEN PREFERRED CATALOG AND DMANPART
      *****************************************************************
       1200-READ-AND-PRINT.

           PERFORM 9000-READN-DMANPART   THRU 9000-READN-EXIT.
           IF  FS-END-OF-FILE
               PERFORM 2200-PRINT-BLANK-LINE   THRU 2200-EXIT
               GO TO 1200-EXIT
           END-IF.

           ADD  1               TO WS-REC-CNTR.
           IF  WS-REC-CNTR = 1
               PERFORM 2000-PRINT-CATALOG-DATA THRU 2000-EXIT
           END-IF.

           PERFORM 2100-PRINT-DMANPART-DATA   THRU 2100-EXIT.
           GO TO 1200-READ-AND-PRINT.

       1200-EXIT.
           EXIT.
      *****************************************************************
      ***  PRINT REPORT DATA
      *****************************************************************
       2000-PRINT-CATALOG-DATA.

           IF  PRINT-HEADINGS-YES
               PERFORM 2999-PRINT-HEADINGS   THRU 2999-EXIT
           END-IF.


      ***  LOAD & WRITE 1ST DETAIL LINE - ARIBA CATALOG DATA
      ***  IF THE ITEM IS PREFERRED, LOAD CATALOG DATA
      ***  ELSE ITEM IS AN OVERRIDE, LOAD CATALOG OVERRIDE DATA
           IF  ITEM-OVERRIDE-NO
               MOVE ARIBACAT-CORP-CODE TO DLCC OF  WS-DTL00-FLDS
               MOVE ARIBACAT-MANUFACT-NAME
                                      TO DLNAME1 OF  WS-DTL00-FLDS
               MOVE ARIBACAT-MANUFACT-PARTNO
                                      TO DLPART1 OF  WS-DTL00-FLDS
               MOVE ARIBACAT-VENDOR-CODE
                                      TO DLVENDR OF  WS-DTL00-FLDS
               MOVE ARIBACAT-CONVER-PRICE
                                      TO DLPPRIC OF  WS-DTL00-FLDS
               MOVE ZERO              TO DLOPRIC OF  WS-DTL00-FLDS
               MOVE WS-PREFERRD       TO DLTYPE  OF  WS-DTL00-FLDS
               MOVE SPACE             TO DLREASN OF  WS-DTL00-FLDS
           ELSE
               PERFORM 9200-START-CATALOG-2  THRU 9200-START-EXIT
               PERFORM 9200-READN-CATALOG-2  THRU 9200-READN-EXIT
               MOVE ARIBAOVR-CORP-CODE TO DLCC OF  WS-DTL00-FLDS
               MOVE ARIBAOVR-MANUFACT-NAME
                                      TO DLNAME1 OF  WS-DTL00-FLDS
               MOVE ARIBAOVR-MANUFACT-PARTNO
                                      TO DLPART1 OF  WS-DTL00-FLDS
               MOVE ARIBAOVR-VENDOR-CODE
                                      TO DLVENDR OF  WS-DTL00-FLDS
               MOVE ARIBACAT2-CONVER-PRICE
                                      TO DLPPRIC OF  WS-DTL00-FLDS
               MOVE ARIBAOVR-CONVER-PRICE
                                      TO DLOPRIC OF  WS-DTL00-FLDS
               MOVE WS-OVERRIDE       TO DLTYPE  OF  WS-DTL00-FLDS
               MOVE ARIBAOVR-REASON-CODE TO DLREASN OF  WS-DTL00-FLDS
           END-IF.

           MOVE CORR WS-DTL00-FLDS   TO  DETAIL1-O.

           WRITE REPORT-REC FORMAT "DETAIL1"
      ********   INDICATORS ARE WS-ALL-INDICATORS
                 AT EOP
                 SET PRINT-HEADINGS-YES  TO TRUE
           END-WRITE.

           ADD  1                 TO WS-L0-PRNT-CNT.

       2000-EXIT.
           EXIT.

      *****************************************************************
      ***  PRINT DMANPART DATA
      *****************************************************************
       2100-PRINT-DMANPART-DATA.

           IF  PRINT-HEADINGS-YES
               PERFORM 2999-PRINT-HEADINGS   THRU 2999-EXIT
           END-IF.


      ***  LOAD & WRITE 1ST DETAIL LINE - DMANPART DATA
           MOVE MAN-CORPCODE     TO DLCC     OF  WS-DTL00-FLDS.
           MOVE MAN-NAME         TO DLNAME2  OF  WS-DTL00-FLDS.
           MOVE MAN-PARTNO       TO DLPART2  OF  WS-DTL00-FLDS.

           MOVE CORR WS-DTL00-FLDS   TO  DETAIL2-O.

           WRITE REPORT-REC FORMAT "DETAIL2"
      ********   INDICATORS ARE WS-ALL-INDICATORS
                 AT EOP
                 SET PRINT-HEADINGS-YES  TO TRUE
           END-WRITE.

       2100-EXIT.
           EXIT.

      *****************************************************************
      ***  PRINT A BLANK LINE
      *****************************************************************
       2200-PRINT-BLANK-LINE.

           IF  PRINT-HEADINGS-YES
               GO TO 2200-EXIT
           END-IF.

           WRITE REPORT-REC FORMAT "BLANK1"
      ********   INDICATORS ARE WS-ALL-INDICATORS
                 AT EOP
                 SET PRINT-HEADINGS-YES  TO TRUE
           END-WRITE.

       2200-EXIT.
           EXIT.


      *****************************************************************
      ** PRINT REPORT HEADINGS
      *****************************************************************
       2999-PRINT-HEADINGS.

           INITIALIZE  WS-HDG00-FLDS.

           ADD  1    TO WS-PAGE-NBR.
           MOVE WS-PAGE-NBR      TO HDPAGE   OF WS-HDG00-FLDS
           MOVE WS-RUN-DATE      TO HDRDAT   OF WS-HDG00-FLDS.
           MOVE WS-RUN-TIME      TO HDRTIM   OF WS-HDG00-FLDS.
           MOVE WS-PLANT-NAME    TO HDPLNT   OF WS-HDG00-FLDS.
           MOVE WS-PROGRAM-NAME  TO HDPROG   OF WS-HDG00-FLDS.

           MOVE CORR WS-HDG00-FLDS  TO HEAD01-O.
           WRITE REPORT-REC FORMAT "HEAD01"
      ********   INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

           MOVE CORR WS-HDG00-FLDS  TO HEAD02-O.
           WRITE REPORT-REC FORMAT "HEAD02"
      ********   INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

           WRITE REPORT-REC FORMAT "HEAD03"
      ********   INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

           SET  PRINT-HEADINGS-NO   TO TRUE.

       2999-EXIT.
           EXIT.


       COPY ZMPLTSUBR  IN COPYLIB.


      *----------------------------------------------------------------
      *
      *            ALL DATABASE FILE I-O'S BELOW THIS POINT
      *
      *----------------------------------------------------------------

      *****************************************************************
      ***  START DMANPART FILE
      *****************************************************************
       9000-START-DMANPART.

           INITIALIZE DMANPART-REC.
           MOVE WS-SAVE-CORPCODE  TO MAN-CORPCODE.

           START DMANPART-FILE
                 KEY IS >= EXTERNALLY-DESCRIBED-KEY
           END-START.

       9000-START-EXIT.
            EXIT.

      *****************************************************************
      *** READ DMANPART FILE SEQUENTIALLY - GET "PREFERRED"
      *****************************************************************
       9000-READN-DMANPART.

           READ DMANPART-FILE NEXT RECORD
           END-READ.

           IF  FS-END-OF-FILE
               GO TO 9000-READN-EXIT
           END-IF.

           IF  MAN-CORPCODE NOT = WS-SAVE-CORPCODE
               SET  FS-END-OF-FILE  TO TRUE
               GO TO 9000-READN-EXIT
           END-IF.

           IF  MAN-PARTNO-SELECT NOT = "B"
               GO TO 9000-READN-DMANPART
           END-IF.

           MOVE MAN-NAME         TO WS-DMP-MANF-NAME.
           MOVE MAN-PARTNO       TO WS-DMP-MANF-PART.

       9000-READN-EXIT.
            EXIT.

      *****************************************************************
      ***  START INPUT1 FILE
      *****************************************************************
       9100-START-CATALOG.

           INITIALIZE CATALOG-REC.

           MOVE LOW-VALUES         TO ARIBACAT-CORP-CODE.

           START CATALOG-FILE
                 KEY IS >= EXTERNALLY-DESCRIBED-KEY
           END-START.

       9100-START-EXIT.
            EXIT.

      *****************************************************************
      *** READ CATALOG FILE SEQUENTIALLY - GET PREFERRED
      *****************************************************************
       9100-READN-CATALOG.

           READ CATALOG-FILE   NEXT RECORD
           END-READ.

           IF  FS-END-OF-FILE
               GO TO 9100-READN-EXIT
           END-IF.

           ADD  1                 TO WS-L0-READ-CNT.
           IF  ARIBACAT-PREF-FLAG NOT = "Y"
               GO TO 9100-READN-CATALOG
           END-IF.

           MOVE ARIBACAT-CORP-CODE  TO  WS-SAVE-CORPCODE.

       9100-READN-EXIT.
            EXIT.
      *****************************************************************
      ***  START CATALOG FILE - LOGICAL MCFLAB2003 BY CORPCODE/PRICE
      *****************************************************************
       9200-START-CATALOG-2.

           INITIALIZE CATALOG-REC-2.

           MOVE ARIBACAT-CORP-CODE    TO ARIBACAT2-CORP-CODE.
           MOVE ZERO                  TO ARIBACAT2-CONVER-PRICE.

           START CATALOG-FILE-2
                 KEY IS >= EXTERNALLY-DESCRIBED-KEY
           END-START.

       9200-START-EXIT.
            EXIT.
      *****************************************************************
      *** READ CATALOG FILE-2 SEQUENTIALLY   GET PREFERRED  PRICE
      *****************************************************************
       9200-READN-CATALOG-2.

           READ CATALOG-FILE-2 NEXT RECORD
           END-READ.

           IF  FS-END-OF-FILE
               GO TO 9200-READN-EXIT
           END-IF.

       9200-READN-EXIT.
            EXIT.

      *****************************************************************
      *** READ OVERRIDE FILE BY KEY(CORPCODE)
      *****************************************************************
       9300-READK-OVERRIDE.

           SET ITEM-OVERRIDE-YES  TO TRUE.

           INITIALIZE OVERRIDE-REC.

           MOVE WS-SAVE-CORPCODE  TO ARIBAOVR-CORP-CODE.

           READ OVERRIDE-FILE
           END-READ.

           IF  FS-RECORD-NOT-FOUND
               SET ITEM-OVERRIDE-NO   TO TRUE
           END-IF.

           IF  ARIBAOVR-ACTIVE-FLAG = "N"
               SET ITEM-OVERRIDE-NO   TO TRUE
           END-IF.

       9300-READK-EXIT.
            EXIT.
      *****************************************************************
      ***              END  OF  SOURCE  MEMBER
      *****************************************************************
