       IDENTIFICATION DIVISION.

       PROGRAM-ID.     TARBEXCP3.
       AUTHOR.         EXLTECH, LLC - DAN RAUCH

      ***************************************************************
      **                 T A R B E X C P 3
      ***************************************************************
      **         ARIBA CATALOG SOURCING EXCEPTION REPORTING
      ** READ DMANPART PREFERRED ITEMS AND READ SAME ITEM FROM ARIBA
      ** CATALOG. WRITE MCFPAB3500(EXCEPTION FILE) IF NOT FOUND.
      **                    --------------------
      ** NOTE: ACTUAL "NOT FOUNDS" ARE BYPASSED - WRITE EXCEPTION REC
      **       WHERE MANUF NAME AND PARTNO DIFFERS
      **                    --------------------
      ** NOTE: THIS PROGRAM IS A COPY OF TARBEXCP2 WHERE THE PRINTED
      **       REPORT IS REPLACED BY DATABASE FILE MCFPAB3500. SLEEPER
      **       RUNS THIS PROGRAM AT EACH PLANT AND THE DATABASE FILE
      **       IS FTP'D BACK TO AKRON60 TO AID SOURCING
      ***************************************************************
      * Modification History:                                       *
      ***************************************************************
      *                                                             *
      *    Date     Name             Description                    *
      * ----------  ---------------  ------------------------------ *
      * mm/dd/yyyy                                                  *
      ***************************************************************


      *================================================================
       ENVIRONMENT DIVISION.
      *===============================================================
       CONFIGURATION SECTION.

       SOURCE-COMPUTER.       IBM-AS400.
       OBJECT-COMPUTER.       IBM-AS400.
       SPECIAL-NAMES.         LOCAL-DATA LDA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT DMANPART-FILE ASSIGN TO DATABASE-MCFLCS3603
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS IS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.


           SELECT EXCEPTION-FILE  ASSIGN TO DATABASE-MCFPAB3500
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS IS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

      *================================================================
       DATA DIVISION.
      *================================================================
       FILE SECTION.

       FD  DMANPART-FILE.
       01  DMANPART-REC.
       COPY DDS-ALL-FORMATS OF MCFLCS3603.
       COPY DMANPART  IN COPYLIB.


       FD  EXCEPTION-FILE.
       01  EXCEPTION-REC.
       COPY DDS-ALL-FORMATS OF MCFPAB3500.
       COPY EXCPTN3  IN COPYLIB.

      *----------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *----------------------------------------------------------------
       COPY FILESTATUS IN COPYLIB.
       COPY DTSPARMS2  IN COPYLIB.
       COPY ZMPLTWS    IN COPYLIB.
       COPY ZCATPWS    IN COPYLIB.

      *****************************************************************
      *  MISCELLANEOUS WORK FIELDS
      *****************************************************************
       01  WS-MISCELLANEOUS-FIELDS.

           03  WS-SAVE-MFGR-NAME   PIC  X(50)      VALUE SPACE.
           03  WS-SAVE-MFGR-PART   PIC  X(50)      VALUE SPACE.

           03  WS-PLTNUM-KEY       PIC X(04)       VALUE "P 01".
           03  WS-PLTNUM           PIC X(03)       VALUE SPACE.


       COPY DARIBACAT  IN COPYLIB.


      *================================================================
      *=             P R O C E D U R E    D I V I S I O N
      *================================================================
       PROCEDURE DIVISION.
       0000-PROGRAM-ENTRY.

           OPEN  INPUT  DMANPART-FILE
                 OUTPUT EXCEPTION-FILE.


           PERFORM 0010-INITIALIZE       THRU 0010-EXIT.

           PERFORM 1000-MAIN-LOGIC       THRU 1000-EXIT
                   UNTIL FS-END-OF-FILE.


           CLOSE        DMANPART-FILE
                        EXCEPTION-FILE.

       0000-PROGRAM-END.
           GOBACK.

      *****************************************************************
      ** 1ST TIME PROCESSING ROUTINE
      *****************************************************************
       0010-INITIALIZE.

      ** GET THE PLANT NBR
           MOVE WS-PLTNUM-KEY      TO  WS-ZMPLT-KEY.
           PERFORM ZMPLT-GET-MPLTINFO  THRU ZMPLT-EXIT.
           MOVE WS-ZMPLT-PLTINFODTA(1:3)  TO WS-PLTNUM.

           PERFORM 9000-START-DMANPART   THRU 9000-START-EXIT.
           PERFORM 9000-READN-DMANPART   THRU 9000-READN-EXIT.

       0010-EXIT.
            EXIT.

      *****************************************************************
      ***  MAIN PROCESSING LOOP ROUTINE
      *****************************************************************
       1000-MAIN-LOGIC.

           PERFORM 3000-GET-CATALOG-PREF THRU 3000-GETPRF-EXIT.
           IF  FS-RECORD-NOT-FOUND
               PERFORM 2000-BUILD-EXCEPTION-RECORD THRU 2000-EXIT
           END-IF.

      *----------------------------------------------------------------
      ***  READ THE NEXT DMANPART RECORD
      *----------------------------------------------------------------
           PERFORM 9000-READN-DMANPART   THRU 9000-READN-EXIT.

       1000-EXIT.
            EXIT.

      *****************************************************************
      ***  PRINT DMANPART DATA
      *****************************************************************
       2000-BUILD-EXCEPTION-RECORD.

           INITIALIZE  BUF-EXCPTN3.

           MOVE WS-PLTNUM        TO EXCPTN3-PLANT-CODE.
           MOVE MAN-CORPCODE     TO EXCPTN3-CORP-CODE.
           MOVE "1"              TO EXCPTN3-REC-TYPE.
           MOVE "CSIS"           TO EXCPTN3-REC-DESC.
           MOVE MAN-NAME         TO EXCPTN3-PRF-MANF-NAME.
           MOVE MAN-PARTNO       TO EXCPTN3-PRF-MANF-PART.
           MOVE MAN-PARTNO-TYPE  TO EXCPTN3-TYPE-FLAG.
           MOVE MAN-PARTNO-SELECT TO EXCPTN3-PREFERRD-FLAG.

           CALL "GETDTSTMP2" USING WS-SYSTEM-DATE-TIME2.
           MOVE WS-SYSTEM-DATE-TIME2  TO  EXCPTN3-DATETIME-STAMP.

           PERFORM 9100-WRITE-EXCEPTION  THRU 9100-WRITE-EXIT.

           INITIALIZE  BUF-EXCPTN3.
           MOVE WS-PLTNUM        TO EXCPTN3-PLANT-CODE.
           MOVE MAN-CORPCODE     TO EXCPTN3-CORP-CODE.
           MOVE "2"              TO EXCPTN3-REC-TYPE.
           MOVE "ARIBA CATALOG"  TO EXCPTN3-REC-DESC.
           MOVE ARIBACAT-MANUFACT-NAME   TO EXCPTN3-PRF-MANF-NAME.
           MOVE ARIBACAT-MANUFACT-PARTNO TO EXCPTN3-PRF-MANF-PART.
           MOVE WS-SYSTEM-DATE-TIME2  TO  EXCPTN3-DATETIME-STAMP.

           PERFORM 9100-WRITE-EXCEPTION  THRU 9100-WRITE-EXIT.

       2000-EXIT.
           EXIT.


      *****************************************************************
      *** GET PREFERRED ITEM CATALOG RECORD
      *****************************************************************
       3000-GET-CATALOG-PREF.

           INITIALIZE BUF-DARIBCAT.

           SET ZCATP-MODE-1     TO TRUE.
           MOVE MAN-CORPCODE    TO WS-ZCATP-CORPCODE.

           PERFORM ZCATP-GET-PREFERRED-ITEM THRU ZCATP-EXIT.
           MOVE WS-ZCATP-CATREC TO BUF-DARIBCAT.
           MOVE WS-ZCATP-FILE-STATUS  TO WS-FILE-STATUS.

      **===============================================================
      ** BYPASS RECORDS "NOT FOUND" IN ARIBA CATALOG
      ** PRINT ONLY RECS WHERE THERE IS A "NAME OR PARTNO" DIFFERENCE
      **===============================================================
           IF  FS-RECORD-NOT-FOUND
               SET FS-GOOD-FILE-IO      TO TRUE
      **PRT*** MOVE WS-NFND-MSSG    TO ARIBACAT-MANUFACT-NAME
               GO TO 3000-GETPRF-EXIT
           END-IF.

           IF  ARIBACAT-MANUFACT-NAME NOT = WS-SAVE-MFGR-NAME
               SET FS-RECORD-NOT-FOUND  TO TRUE
               GO TO 3000-GETPRF-EXIT
           END-IF.

           IF  ARIBACAT-MANUFACT-PARTNO NOT = WS-SAVE-MFGR-PART
               SET FS-RECORD-NOT-FOUND  TO TRUE
               GO TO 3000-GETPRF-EXIT
           END-IF.

       3000-GETPRF-EXIT.
           EXIT.


       COPY ZMPLTSUBR  IN COPYLIB.
       COPY ZCATPSUBR  IN COPYLIB.

      *----------------------------------------------------------------
      *
      *            ALL DATABASE FILE I-O'S BELOW THIS POINT
      *
      *----------------------------------------------------------------

      *****************************************************************
      ***  START DMANPART FILE
      *****************************************************************
       9000-START-DMANPART.

           INITIALIZE DMANPART-REC.

           START DMANPART-FILE
                 KEY IS >= EXTERNALLY-DESCRIBED-KEY
           END-START.

       9000-START-EXIT.
            EXIT.

      *****************************************************************
      *** READ DMANPART FILE SEQUENTIALLY - GET "PREFERRED"
      *****************************************************************
       9000-READN-DMANPART.

           READ DMANPART-FILE NEXT RECORD
           END-READ.

           IF  FS-END-OF-FILE
               GO TO 9000-READN-EXIT
           END-IF.

           IF  MAN-PARTNO-SELECT = "B"
               MOVE MAN-NAME       TO WS-SAVE-MFGR-NAME
               MOVE MAN-PARTNO     TO WS-SAVE-MFGR-PART
               GO TO 9000-READN-EXIT
           END-IF.

           GO TO 9000-READN-DMANPART.

       9000-READN-EXIT.
            EXIT.

      *****************************************************************
      *** WRITE EXCEPTION RPTG FILE
      *****************************************************************
       9100-WRITE-EXCEPTION.

           WRITE  EXCEPTION-REC
           END-WRITE.

       9100-WRITE-EXIT.
            EXIT.
      *****************************************************************
      ***              END  OF  SOURCE  MEMBER
      *****************************************************************
