       IDENTIFICATION DIVISION.

       PROGRAM-ID.     TARIBA01.
       AUTHOR.         EXLTECH, INC - DAN RAUCH

      *****************************************************************
      **               MONITOR DATAQ TARIBADQ1
      **             ---------------------------
      **
      ** THIS PROGRAM WILL MONITOR A DATAQ UNTIL IT RECEIVES THE
      ** SHUTDOWN COMMAND FROM PROGRAM TARIBA99. THE WAIT PARAMETER
      ** ON THE "RECEIVE DATAQ" COMMAND DEFINES THE PROCESSING
      ** INTERVAL. AT THE END OF EACH "WAIT" INTERVAL THE PROGRAM
      ** PROCESSING STEPS ARE INITIATED. THESE STEPS ARE:
      **
      **  1) RESTABLISH DATAQ PARMS FROM FILE MCFPAB1900
      **  2) RETRIEVE THE PROCESS & JOB PARMS (MCFPAB1100 MCFPAB1200)
      **  3) FOR EACH PROCESS RECORD(MCFPAB1200)
      **     A) READ THRU JOBS FILE(MCFPAB1100) AND DETERMINE IF THE
      **        PROGRAM TO BE CALLED IS BATCH OR INTERACTIVE AND CALL
      **        THE APPROPRIATE CL TO PROCESS JOB PROGRAM
      **
      *****************************************************************

      *================================================================
       ENVIRONMENT DIVISION.
      *===============================================================

       CONFIGURATION SECTION.

       SOURCE-COMPUTER.       IBM-AS400.
       OBJECT-COMPUTER.       IBM-AS400.
       SPECIAL-NAMES.         LOCAL-DATA IS LDA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT MONITOR-PROCESS-FILE ASSIGN TO DATABASE-MCFLAB1201
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

           SELECT MONITOR-JOB-FILE   ASSIGN TO DATABASE-MCFLAB1101
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

           SELECT DATAQ-PARMS-FILE   ASSIGN TO DATABASE-MCFLAB1901
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

      *================================================================
       DATA DIVISION.
      *================================================================
       FILE SECTION.

       FD  MONITOR-PROCESS-FILE.
       01  MONITOR-PROCESS-REC.
       COPY DDS-ALL-FORMATS OF MCFLAB1201.
       COPY MONPROCESS IN COPYLIB.

       FD  MONITOR-JOB-FILE.
       01  MONITOR-JOB-REC.
       COPY DDS-ALL-FORMATS OF MCFLAB1101.
       COPY MONJOBPARM IN COPYLIB.

       FD  DATAQ-PARMS-FILE.
       01  DATAQ-PARMS-REC.
       COPY DDS-ALL-FORMATS OF MCFLAB1901.
       COPY DATAQPARMS IN COPYLIB.

      *----------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *----------------------------------------------------------------

      *****************************************************************
      * FILE STATUS AREA
      *****************************************************************
       COPY FILESTATUS IN COPYLIB.
       COPY DTSPARMS2  IN COPYLIB.

      *****************************************************************
      *  MISCELLANEOUS PROGRAM WORK FIELDS
      *****************************************************************
       01  WS-MISC-PROGRAM-FIELDS.
           03  WS-SBMJOB-CL             PIC X(10) VALUE "TARIBA02C".
           03  WS-CALL-CL               PIC X(10) VALUE "TARIBA03C".
           03  WS-DATAQ-NAME            PIC X(10) VALUE "TARIBADQ1".
           03  WS-START-PROCESS         PIC X(10) VALUE SPACE.

      *****************************************************************
      *  DATAQ KEY         LENGTH = 30   PROCESS NAME/DATETIME STAMP
      *****************************************************************
       01  WS-DATAQ-KEY.
           03  DQK-PROCESS       PIC X(10)  VALUE "TARIBAPO".
           03  DQK-DATE-TIME     PIC X(14)  VALUE SPACES.
           03  FILLER            PIC X(06)  VALUE SPACES.

      *****************************************************************
      *  RCV DATAQ RECORD     PIC X(80)
      *****************************************************************
       01  RCV-DATAQ-RECORD.
           03  RCV-DATA          PIC X(30)  VALUE SPACES.
           03  FILLER            PIC X(50)  VALUE SPACES.

      *****************************************************************
      *  PROGRAM SWITCHES
      *****************************************************************
       01  WS-ALL-PROGRAM-SWITCHES.
           03  WS-SHUTDOWN-SW    PIC X(30)  VALUE SPACES.
               88  DATAQ-SHUTDOWN-YES       VALUE "SHUTDOWN".

      *****************************************************************
      *  LDA LAYOUT    PIC X(80)
      *****************************************************************
       01  WS-LDA-JOB-PARMS.
           03  WS-LDA-JOBNAME     PIC X(10)         VALUE SPACE.
           03  WS-LDA-JOBDESC     PIC X(10)         VALUE SPACE.
           03  WS-LDA-JOBPROG     PIC X(10)         VALUE SPACE.
           03  WS-LDA-JOBPROC     PIC X(10)         VALUE SPACE.
           03  FILLER             PIC X(984)        VALUE SPACE.

       COPY DATAQSTUFF IN COPYLIB.

      *****************************************************************
      *  PROGRAM MESSAGES
      *****************************************************************
       01  WS-ALL-PROGRAM-MESSAGES.
           03  WS-DATAQ-REC-NFND-MSG   PIC X(70)          VALUE
           "DATAQ PARM RECORD FOR TARIBADQ1 NOT FOUND - JOB ENDING".

      *================================================================
      *===        P R O C E D U R E    D I V I S I O N              ===
      *================================================================
       PROCEDURE DIVISION.
       0000-PROGRAM-ENTRY.

           OPEN  INPUT  MONITOR-JOB-FILE
                        MONITOR-PROCESS-FILE
                        DATAQ-PARMS-FILE.

           PERFORM 0010-INITIALIZE  THRU 0010-EXIT.

           PERFORM 1000-MAIN-LOGIC-RTN  THRU 1000-EXIT
                        UNTIL  DATAQ-SHUTDOWN-YES.

           CLOSE        MONITOR-JOB-FILE
                        MONITOR-PROCESS-FILE
                        DATAQ-PARMS-FILE.

       0000-PROGRAM-END.
           GOBACK.

      *****************************************************************
      ** 1ST TIME PROCESSING ROUTINE
      *****************************************************************
       0010-INITIALIZE.

           CALL "GETDTSTMP2" USING WS-SYSTEM-DATE-TIME2.
           MOVE WS-SYSTEM-DATE-TIME2 TO  DQK-DATE-TIME.

       0010-EXIT.
            EXIT.

      *****************************************************************
      ***  MAIN PROCESSING LOOP ROUTINE
      *****************************************************************
       1000-MAIN-LOGIC-RTN.

           PERFORM 9100-READK-DATAQ-PARMS  THRU 9100-READK-EXIT.
           IF FS-RECORD-NOT-FOUND
              SET  DATAQ-SHUTDOWN-YES  TO TRUE
              DISPLAY WS-DATAQ-REC-NFND-MSG
              GO TO 1000-EXIT
           END-IF.

           PERFORM 2000-PROCESS-JOBS       THRU 2000-EXIT.

           PERFORM 8000-RECEIVE-DATAQ      THRU 8000-EXIT.

       1000-EXIT.
            EXIT.
      *****************************************************************
      ** PROCESS MONITOR JOBS
      *****************************************************************
       2000-PROCESS-JOBS.

           PERFORM 9200-START-MONITOR-PROCESS THRU 9200-START-EXIT.

       2000-PROCESS-LOOP.

           PERFORM 9200-READN-MONITOR-PROCESS THRU 9200-READN-EXIT.
           IF  FS-END-OF-FILE
               GO TO 2000-EXIT
           END-IF.

           MOVE  MPP-PROCESS        TO WS-START-PROCESS.
           PERFORM 9000-START-MONITOR-JOBS THRU 9000-START-EXIT.

           SET FS-GOOD-FILE-IO TO TRUE.
           PERFORM 2500-READN-PROCESS-JOBS THRU 2500-EXIT
                        UNTIL FS-END-OF-FILE.

           GO TO 2000-PROCESS-LOOP.

       2000-EXIT.
            EXIT.
      *****************************************************************
      ** PROCESS MONITOR JOBS BY PROCESS
      *****************************************************************
       2500-READN-PROCESS-JOBS.

           PERFORM 9000-READN-MONITOR-JOBS THRU 9000-READN-EXIT.
           IF FS-END-OF-FILE
              GO TO 2500-EXIT
           END-IF.

           IF MJP-CALL-FLAG NOT = "Y"
              GO TO 2500-READN-PROCESS-JOBS
           END-IF.

      ***  PUT JOB PARMS ON *LDA AND CALL SBMJOB CL
           MOVE  MJP-JOB-NAME       TO WS-LDA-JOBNAME.
           MOVE  MJP-JOB-DESC       TO WS-LDA-JOBDESC.
           MOVE  MJP-JOB-PROGRAM    TO WS-LDA-JOBPROG.
           MOVE  MJP-JOB-PROCESS    TO WS-LDA-JOBPROC.
           DISPLAY WS-LDA-JOB-PARMS UPON LDA.

      ***  INTERACTIVE PROGRAM CALL
           IF MJP-JOB-TYPE   = "I"

              CALL WS-CALL-CL USING MJP-JOB-PROGRAM

           ELSE

      ***  BATCH JOB SUBMIT
              IF MJP-JOB-TYPE   = "B"

                 CALL WS-SBMJOB-CL

              END-IF

           END-IF.

       2500-EXIT.
            EXIT.
      *****************************************************************
      ** RECEIVE DATAQ TARIBADQ1
      *****************************************************************
       8000-RECEIVE-DATAQ.

           MOVE WS-DATAQ-KEY   TO DATAQ-KEY.
           CALL "QRCVDTAQ"  USING RCV-DATAQ-NAME
                                  RCV-DATAQ-LIBRARY
                                  RCV-DATAQ-LENGTH
                                  RCV-DATAQ-RECORD
                                  RCV-DATAQ-WAIT
                                  RCV-DATAQ-KEYORD
                                  RCV-DATAQ-KEYLEN
                                  DATAQ-KEY
                                  RCV-DATAQ-SNDRLEN
                                  RCV-DATAQ-SNDR.

           IF RCV-DATAQ-LENGTH > ZERO
              MOVE RCV-DATA   TO WS-SHUTDOWN-SW
           END-IF.

       8000-EXIT.
            EXIT.
      *****************************************************************
      ***  READ BY KEY MONITOR JOB PARM FILE
      *****************************************************************
       9000-START-MONITOR-JOBS.

           INITIALIZE MONITOR-JOB-REC.
           MOVE WS-START-PROCESS    TO MJP-JOB-PROCESS.

           START MONITOR-JOB-FILE
                 KEY IS >= EXTERNALLY-DESCRIBED-KEY
           END-START.


       9000-START-EXIT.
            EXIT.
      *****************************************************************
      ***  READ SEQUENTIALLY MONITOR JOB FILE
      *****************************************************************
       9000-READN-MONITOR-JOBS.

           READ MONITOR-JOB-FILE  NEXT RECORD
           END-READ.

           IF FS-END-OF-FILE
              GO TO 9000-READN-EXIT
           END-IF.

           IF MJP-JOB-PROCESS NOT = WS-START-PROCESS
              SET FS-END-OF-FILE  TO TRUE
              GO TO 9000-READN-EXIT
           END-IF.

       9000-READN-EXIT.
            EXIT.

      *****************************************************************
      ***  READ BY KEY DATAQ PARMS FILE
      *****************************************************************
       9100-READK-DATAQ-PARMS.

           INITIALIZE DATAQ-PARMS-REC.
           MOVE  WS-DATAQ-NAME      TO DQ-DATAQ-NAME.

           READ DATAQ-PARMS-FILE
           END-READ.

           IF  FS-RECORD-NOT-FOUND
               GO TO 9100-READK-EXIT
           END-IF.

           MOVE DQ-DATAQ-NAME      TO  SND-DATAQ-NAME.
           MOVE DQ-DATAQ-NAME      TO  RCV-DATAQ-NAME.
           MOVE DQ-DATAQ-LIBRARY   TO  SND-DATAQ-LIBRARY.
           MOVE DQ-DATAQ-LIBRARY   TO  RCV-DATAQ-LIBRARY.
           MOVE DQ-DATAQ-SNDLEN    TO  SND-DATAQ-LENGTH.
           MOVE DQ-DATAQ-RCVLEN    TO  RCV-DATAQ-LENGTH.
           MOVE DQ-DATAQ-SND-KEYLEN TO SND-DATAQ-KEYLEN.
           MOVE DQ-DATAQ-RCV-KEYLEN TO RCV-DATAQ-KEYLEN.
           MOVE DQ-DATAQ-WAIT      TO  RCV-DATAQ-WAIT.
           MOVE DQ-DATAQ-KEYORD    TO  RCV-DATAQ-KEYORD.
           MOVE DQ-DATAQ-RMVMSG    TO  RCV-DATAQ-REMOVE.
           MOVE DQ-DATAQ-SNDR-DATA-LEN TO  RCV-DATAQ-SNDRLEN.
           MOVE DQ-DATAQ-ASYNC-RQST TO SND-DATAQ-ASYNC-RQST.
           MOVE DQ-DATAQ-RCVR-SIZE  TO RCV-DATAQ-RCVR-SIZE.

       9100-READK-EXIT.
            EXIT.
      *****************************************************************
      ***  READ BY KEY MONITOR PROCESS FILE
      *****************************************************************
       9200-START-MONITOR-PROCESS.

           INITIALIZE MONITOR-PROCESS-REC.

           START MONITOR-PROCESS-FILE
                 KEY IS >= EXTERNALLY-DESCRIBED-KEY
           END-START.


       9200-START-EXIT.
            EXIT.
      *****************************************************************
      ***  READ SEQUENTIALLY MONITOR PROCESS FILE
      *****************************************************************
       9200-READN-MONITOR-PROCESS.

           READ MONITOR-PROCESS-FILE NEXT RECORD
           END-READ.

           IF FS-END-OF-FILE
              GO TO 9200-READN-EXIT
           END-IF.

           IF MPP-ACTIVE-FLAG NOT = "Y"
              GO TO 9200-READN-MONITOR-PROCESS
           END-IF.

       9200-READN-EXIT.
            EXIT.

      *****************************************************************
      ***              END  OF  SOURCE  MEMBER
      *****************************************************************
