       IDENTIFICATION DIVISION.

       PROGRAM-ID.     TARIBA110.
       AUTHOR.         EXLTECH, INC - DAN RAUCH

      ***************************************************************
      **            MAINTAIN DATAQ PARM FILE - MCFPAB1900
      **      -------------------------------------------------
      ** NOTE: MCFPAB1100 MCFPAB1200 MCFPAB1900 HAVE TO BE COMMON TO
      **       ALL ENVIRONMENTS, SO THEY "LIVE" IN LIBRARY MCPRD
      ***************************************************************

      *================================================================
       ENVIRONMENT DIVISION.
      *===============================================================
       CONFIGURATION SECTION.

       SOURCE-COMPUTER.       IBM-AS400.
       OBJECT-COMPUTER.       IBM-AS400.
       SPECIAL-NAMES.         LOCAL-DATA LDA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT DISPLAY-FILE  ASSIGN TO WORKSTATION-TARIBA110D-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS DYNAMIC
                  FILE STATUS IS WS-FILE-STATUS
                  RELATIVE KEY IS WS-RRN
                  CONTROL-AREA IS WS-KEYBOARD-RETURN-AREA.

           SELECT PROCESS-FILE  ASSIGN TO DATABASE-MCFLAB1201
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS IS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

           SELECT DATAQ-FILE    ASSIGN TO DATABASE-MCFLAB1901
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS IS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

      *================================================================
       DATA DIVISION.
      *================================================================
       FILE SECTION.

       FD  DISPLAY-FILE.
       01  DISPLAY-REC.
       COPY DD-ALL-FORMATS OF TARIBA110D.

       FD  PROCESS-FILE.
       01  PROCESS-REC.
       COPY DDS-ALL-FORMATS OF MCFLAB1201.
       COPY MONPROCESS IN COPYLIB.

       FD  DATAQ-FILE.
       01  DATAQ-REC.
       COPY DDS-ALL-FORMATS OF MCFLAB1901.
       COPY DATAQPARMS IN COPYLIB.

      *----------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *----------------------------------------------------------------
       COPY FILESTATUS IN COPYLIB.
       COPY DTSPARMS2  IN COPYLIB.
       COPY KEYBDRTN   IN COPYLIB.


      *****************************************************************
      *  ALL PROGRAM INDICATORS
      *****************************************************************
       01  WS-ALL-INDICATORS.
           03  IN83              PIC 1   INDIC 83   VALUE B"0".
               88  SFL-END-OFF                      VALUE B"0".
               88  SFL-END-ON                       VALUE B"1".
           03  IN84              PIC 1   INDIC 84   VALUE B"0".
               88  SFL-CLEAR-OFF                    VALUE B"0".
               88  SFL-CLEAR-ON                     VALUE B"1".
           03  IN85              PIC 1   INDIC 85   VALUE B"0".
               88  SFL-DISPLAY-OFF                  VALUE B"0".
               88  SFL-DISPLAY-ON                   VALUE B"1".
           03  IN86              PIC 1   INDIC 86   VALUE B"0".
               88  SFL-NXTCHG-OFF                   VALUE B"0".
               88  SFL-NXTCHG-ON                    VALUE B"1".

           03  IN99              PIC 1   INDIC 99   VALUE B"0".
               88  DISPLAY-ERROR-MSSG-OFF           VALUE B"0".
               88  DISPLAY-ERROR-MSSG-ON            VALUE B"1".

           03  IN50              PIC 1   INDIC 50   VALUE B"0".
               88  DATAQ-NAME-ERROR-OFF             VALUE B"0".
               88  DATAQ-NAME-ERROR-ON              VALUE B"1".
           03  IN51              PIC 1   INDIC 51   VALUE B"0".
               88  DATAQ-LIBRARY-ERROR-OFF          VALUE B"0".
               88  DATAQ-LIBRARY-ERROR-ON           VALUE B"1".
           03  IN52              PIC 1   INDIC 52   VALUE B"0".
               88  DATAQ-PROCESS-ERROR-OFF          VALUE B"0".
               88  DATAQ-PROCESS-ERROR-ON           VALUE B"1".
           03  IN53              PIC 1   INDIC 53   VALUE B"0".
               88  DATAQ-PROGRAM-ERROR-OFF          VALUE B"0".
               88  DATAQ-PROGRAM-ERROR-ON           VALUE B"1".
           03  IN54              PIC 1   INDIC 54   VALUE B"0".
               88  DATAQ-SNDLEN-ERROR-OFF            VALUE B"0".
               88  DATAQ-SNDLEN-ERROR-ON             VALUE B"1".
           03  IN55              PIC 1   INDIC 55    VALUE B"0".
               88  DATAQ-RCVLEN-ERROR-OFF            VALUE B"0".
               88  DATAQ-RCVLEN-ERROR-ON             VALUE B"1".
           03  IN56              PIC 1   INDIC 56    VALUE B"0".
               88  DATAQ-WAIT-ERROR-OFF              VALUE B"0".
               88  DATAQ-WAIT-ERROR-ON               VALUE B"1".
           03  IN57              PIC 1   INDIC 57    VALUE B"0".
               88  DATAQ-SNDKYL-ERROR-OFF            VALUE B"0".
               88  DATAQ-SNDKYL-ERROR-ON             VALUE B"1".
           03  IN58              PIC 1   INDIC 58    VALUE B"0".
               88  DATAQ-RCVKYL-ERROR-OFF            VALUE B"0".
               88  DATAQ-RCVKYL-ERROR-ON             VALUE B"1".
           03  IN59              PIC 1   INDIC 59    VALUE B"0".
               88  DATAQ-SNDRDT-ERROR-OFF            VALUE B"0".
               88  DATAQ-SNDRDT-ERROR-ON             VALUE B"1".
           03  IN60              PIC 1   INDIC 60    VALUE B"0".
               88  DATAQ-KEYORD-ERROR-OFF            VALUE B"0".
               88  DATAQ-KEYORD-ERROR-ON             VALUE B"1".
           03  IN61              PIC 1   INDIC 61    VALUE B"0".
               88  DATAQ-RMVMSG-ERROR-OFF            VALUE B"0".
               88  DATAQ-RMVMSG-ERROR-ON             VALUE B"1".
           03  IN62              PIC 1   INDIC 62    VALUE B"0".
               88  DATAQ-ASYNCR-ERROR-OFF            VALUE B"0".
               88  DATAQ-ASYNCR-ERROR-ON             VALUE B"1".
           03  IN63              PIC 1   INDIC 63    VALUE B"0".
               88  DATAQ-RCVRSZ-ERROR-OFF            VALUE B"0".
               88  DATAQ-RCVRSZ-ERROR-ON             VALUE B"1".


       01  WS-ALL-SCREEN-FIELDS.
            03  WS-H01-FLDS.
                05  HDDATE            PIC X(13)          VALUE SPACE.
                05  HDTIME            PIC X(08)          VALUE SPACE.

            03  WS-CTL01-FLDS.
                05  CRRN              PIC S9(04)         VALUE +0.
                05  CREC              PIC X(10)          VALUE SPACE.
                05  CFLD              PIC X(10)          VALUE SPACE.
                05  CLOC              PIC S9(05)         VALUE +0.

            03  WS-SFL01-FLDS.
                05  SELECT-FLD        PIC X(01)          VALUE SPACE.
                05  DATAQ-NAME        PIC X(10)          VALUE SPACE.

            03  WS-S02-FLDS.
                05  DATAQ-NAME            PIC X(10)       VALUE SPACE.
                05  DATAQ-LIBRARY         PIC X(10)       VALUE SPACE.
                05  DATAQ-PROCESS-NAME    PIC X(10)       VALUE SPACE.
                05  DATAQ-PROCESS-PROGRAM PIC X(10)       VALUE SPACE.
                05  DATAQ-SND-LEN         PIC S9(05)      VALUE +0.
                05  DATAQ-RCV-LEN         PIC S9(05)      VALUE +0.
                05  DATAQ-WAIT            PIC S9(05)      VALUE +0.
                05  DATAQ-SND-KEYLEN      PIC S9(05)      VALUE +0.
                05  DATAQ-RCV-KEYLEN      PIC S9(05)      VALUE +0.
                05  DATAQ-SNDR-DATA       PIC S9(03)      VALUE +0.
                05  DATAQ-KEY-ORDER       PIC XX          VALUE SPACE.
                05  DATAQ-RMV-MSG         PIC X(10)       VALUE SPACE.
                05  DATAQ-ASYNC-RQST      PIC X(10)       VALUE SPACE.
                05  DATAQ-RCVR-SIZE       PIC S9(05)      VALUE +0.

            03  WS-B01-FLDS.
                05  MSSG              PIC X(78)          VALUE SPACE.

            03  WS-B02-FLDS.
                05  MSSG              PIC X(78)          VALUE SPACE.

      *****************************************************************
      *  PROGRAM MESSAGES
      *****************************************************************
       01  WS-PROGRAM-MESSAGES.
           03  WS-PROCESS-NAME-ERROR-MSG  PIC X(78)     VALUE
               "ENTER PROCESS NAME - CAN NOT BE BLANK".
           03  WS-PROCESS-NAME-ERROR-MSG2 PIC X(78)     VALUE
               "PROCESS NAME DOES NOT EXIST".

           03  WS-DATAQ-NAME-ERROR-MSG    PIC X(78)     VALUE
               "ENTER A DATAQ NAME - CAN NOT BE BLANK".
           03  WS-DATAQ-NAME-ERROR-MSG2   PIC X(78)     VALUE
               "DATAQ NAME ALREADY EXISTS".

           03  WS-DATAQ-PROGRAM-ERROR-MSG   PIC X(78)     VALUE
               "ENTER A DATAQ PROCESSING PROGRAM - CAN NOT BE BLANK".

           03  WS-DATAQ-SNDLEN-ERROR-MSG PIC X(78)     VALUE
               "ENTER SEND DATA LENGTH - CAN NOT BE ZERO".

           03  WS-DATAQ-RCVLEN-ERROR-MSG PIC X(78)     VALUE
               "ENTER RECEIVING DATA LENGTH - CAN NOT BE ZERO".

           03  WS-DATAQ-KEYLEN-ERROR-MSG PIC X(78)     VALUE
               "KEY LENGTH MUST BE > OR = ZERO".

           03  WS-DATAQ-KEYORD-ERROR-MSG     PIC X(78)     VALUE
               "KEY ORDER MUST BE (EQ GT LT GE LE)".

           03  WS-DATAQ-WAIT-ERROR-MSG    PIC X(78)     VALUE
               "DATAQ WAIT PARM CAN NOT BE ZERO".

      *****************************************************************
      *  MISCELLANEOUS WORK FIELDS
      *****************************************************************
       01  WS-MISCELLANEOUS-FIELDS.

           03  WS-EDIT-ERRORS-SW PIC X(01)          VALUE "N".
               88  EDIT-ERRORS-NO                   VALUE "N".
               88  EDIT-ERRORS-YES                  VALUE "Y".

           03  WS-ADD-MODE-SW    PIC X(01)          VALUE "N".
               88  ADD-MODE-YES                     VALUE "Y".
               88  ADD-MODE-NO                      VALUE "N".

           03  WS-HEADING-TIME   PIC X(08)          VALUE SPACE.
           03  WS-HEADING-DATE   PIC X(13)          VALUE SPACE.
           03  WS-DEFAULT-LIB    PIC X(10)          VALUE "*LIBL".
           03  WS-KEY-DQNAME     PIC X(10)          VALUE SPACE.
           03  WS-KEY-PROCESS    PIC X(10)          VALUE SPACE.
           03  WS-RRN            PIC  9(05)         VALUE ZERO.
           03  WS-RRN1           PIC  9(05)         VALUE ZERO.
           03  WS-RRN2           PIC  9(05)         VALUE ZERO.
           03  WS-RRN3           PIC  9(05)         VALUE ZERO.
           03  WS-DSP-RRN        PIC  9(05)         VALUE ZERO.

      *================================================================
      *=             P R O C E D U R E    D I V I S I O N
      *================================================================
       PROCEDURE DIVISION.
       0000-PROGRAM-ENTRY.

           OPEN  I-O    DISPLAY-FILE
                        DATAQ-FILE
                 INPUT  PROCESS-FILE.

           PERFORM 0010-INITIALIZE       THRU 0010-EXIT.

           PERFORM 1000-PROCESS-SCREEN-1 THRU 1000-EXIT
                   UNTIL KB-F03-KEY.

           CLOSE        DISPLAY-FILE
                        PROCESS-FILE
                        DATAQ-FILE.


       0000-PROGRAM-END.
           GOBACK.

      *****************************************************************
      ** 1ST TIME PROCESSING ROUTINE
      *****************************************************************
       0010-INITIALIZE.

           SET  KB-ENTER-KEY     TO TRUE.
           PERFORM 1999-BUILD-SFL01      THRU 1999-EXIT.

       0010-EXIT.
            EXIT.

      *****************************************************************
      ***  MAIN PROCESSING LOOP ROUTINE
      *****************************************************************
       1000-PROCESS-SCREEN-1.

           PERFORM 8000-DISPLAY-SCREEN-1  THRU 8000-DSP-EXIT.
           IF  KB-F03-KEY
               GO TO 1000-EXIT
           END-IF.

           IF  KB-F06-KEY
               SET  ADD-MODE-YES   TO TRUE
               PERFORM 2999-BUILD-SCREEN-2   THRU 2999-EXIT
               PERFORM 2000-PROCESS-SCREEN-2 THRU 2000-EXIT
           END-IF.

           IF  SFL-DISPLAY-ON
               IF  ADD-MODE-NO
                   PERFORM 1100-CHECK-SFL01  THRU 1100-EXIT
               END-IF
           END-IF.

           PERFORM 1999-BUILD-SFL01          THRU 1999-EXIT.

       1000-EXIT.
            EXIT.

      *****************************************************************
      ***  CHECK SFL01 FOR USER SELECTION
      *****************************************************************
       1100-CHECK-SFL01.

           PERFORM 8000-READN-SFL01      THRU 8000-READN-EXIT.
           IF  FS-END-OF-FILE
               GO TO 1100-EXIT
           END-IF.

           IF  SELECT-FLD OF WS-SFL01-FLDS = 'X'
               PERFORM 2999-BUILD-SCREEN-2   THRU 2999-EXIT
               PERFORM 2000-PROCESS-SCREEN-2 THRU 2000-EXIT
           END-IF.

           IF  SELECT-FLD OF WS-SFL01-FLDS = 'D'
               MOVE DATAQ-NAME    OF WS-SFL01-FLDS TO WS-KEY-DQNAME
               PERFORM 9000-READK-DATAQ2     THRU 9000-READK2-EXIT
               PERFORM 3300-DLT-RECORD       THRU 3300-EXIT
           END-IF.

           SET  SFL-NXTCHG-OFF  TO TRUE.
           MOVE SPACE           TO SELECT-FLD OF WS-SFL01-FLDS.
           PERFORM 8000-REWRT-SFL01      THRU 8000-REWRT-EXIT.

           GO TO 1100-CHECK-SFL01.

       1100-EXIT.
            EXIT.

      *****************************************************************
      ***  CLEAR SFL01
      *****************************************************************
       1998-CLEAR-SFL01.

           INITIALIZE  WS-SFL01-FLDS.
           MOVE ZERO             TO WS-RRN  WS-RRN1.
           MOVE 1                TO WS-DSP-RRN.

           SET  SFL-CLEAR-ON     TO TRUE.
           PERFORM 8000-WRITE-CTL01      THRU 8000-WRTCR-EXIT.
           SET  SFL-CLEAR-OFF    TO TRUE.
           SET  SFL-END-ON       TO TRUE.
           SET  SFL-DISPLAY-OFF  TO TRUE.

       1998-EXIT.
            EXIT.

      *****************************************************************
      ***  BUILD SFL01 - LIST ALL DATAQ FILE RECORDS
      *****************************************************************
       1999-BUILD-SFL01.

           PERFORM 1998-CLEAR-SFL01      THRU 1998-EXIT.

           MOVE LOW-VALUES    TO WS-KEY-DQNAME.
           PERFORM 9000-START-DATAQ      THRU 9000-START-EXIT.

       1999-READ-LOOP1.

           PERFORM 9000-READN-DATAQ      THRU 9000-READN-EXIT.
           IF  FS-END-OF-FILE
               GO TO 1999-EXIT
           END-IF.

           MOVE SPACE         TO SELECT-FLD    OF WS-SFL01-FLDS.
           MOVE DQ-DATAQ-NAME TO DATAQ-NAME    OF WS-SFL01-FLDS.

           ADD  1  TO WS-RRN.
           SET  SFL-NXTCHG-OFF  TO TRUE.

           PERFORM 8000-WRITE-SFL01      THRU 8000-WRTSF-EXIT.
           GO TO 1999-READ-LOOP1.

       1999-EXIT.
            EXIT.

      *****************************************************************
      ***  PROCESS SCREEN 2 - ADD MODE SCREEN
      *****************************************************************
       2000-PROCESS-SCREEN-2.

           PERFORM 8100-DISPLAY-SCREEN-2 THRU 8100-DSP-EXIT.
           IF  KB-F03-KEY
           OR  KB-F12-KEY
               GO TO 2000-EXIT
           END-IF.

           PERFORM 2100-EDIT-SCREEN-2    THRU 2100-EXIT.
           IF  EDIT-ERRORS-YES
               GO TO  2000-PROCESS-SCREEN-2
           END-IF.

           PERFORM 3000-UPDATE-DATABASE  THRU 3000-EXIT.

       2000-EXIT.
            EXIT.

      *****************************************************************
      ***  BUILD SCREEN 2
      *****************************************************************
       2100-EDIT-SCREEN-2.

           SET EDIT-ERRORS-NO  TO TRUE.

      **===============================================================
      ***  FIELD CAN'T BE BLANK
      **===============================================================
           IF  DATAQ-NAME    OF WS-S02-FLDS = SPACE
               SET  DATAQ-NAME-ERROR-ON  TO TRUE
               MOVE WS-DATAQ-NAME-ERROR-MSG TO MSSG OF WS-B02-FLDS
               GO TO 2100-EDIT-ERRORS
           END-IF.

      **===============================================================
      ***  ADD MODE AND DATAQ ALREADY EXISTS  -  NO DUPES
      **===============================================================
           MOVE DATAQ-NAME      OF WS-S02-FLDS   TO WS-KEY-DQNAME.
           PERFORM 9000-READK-DATAQ2     THRU 9000-READK2-EXIT.
           IF  FS-GOOD-FILE-IO
           AND ADD-MODE-YES
               SET  DATAQ-NAME-ERROR-ON  TO TRUE
               MOVE WS-DATAQ-NAME-ERROR-MSG2 TO MSSG OF WS-B02-FLDS
               GO TO 2100-EDIT-ERRORS
           END-IF.

      **===============================================================
      ***  IF LIBRARY IS BLANK, DEFAULT TO *LIBL
      **===============================================================
           IF  DATAQ-LIBRARY OF WS-S02-FLDS = SPACE
               MOVE WS-DEFAULT-LIB   TO DATAQ-LIBRARY OF WS-S02-FLDS
           END-IF.

      **===============================================================
      ***  FIELD CAN'T BE BLANK
      **===============================================================
           IF  DATAQ-PROCESS-PROGRAM  OF WS-S02-FLDS = SPACE
               SET  DATAQ-PROGRAM-ERROR-ON  TO TRUE
               MOVE WS-DATAQ-PROGRAM-ERROR-MSG TO MSSG OF WS-B02-FLDS
               GO TO 2100-EDIT-ERRORS
           END-IF.

      **===============================================================
      ***  SEND LEN MUST BE > ZERO
      **===============================================================
           IF  DATAQ-SND-LEN    OF WS-S02-FLDS = ZERO
           OR  DATAQ-SND-LEN    OF WS-S02-FLDS < ZERO
               SET  DATAQ-SNDLEN-ERROR-ON  TO TRUE
               MOVE WS-DATAQ-SNDLEN-ERROR-MSG TO MSSG OF WS-B02-FLDS
               GO TO 2100-EDIT-ERRORS
           END-IF.

      **===============================================================
      ***  RCV LEN MUST BE > ZERO
      **===============================================================
           IF  DATAQ-RCV-LEN    OF WS-S02-FLDS = ZERO
           OR  DATAQ-RCV-LEN    OF WS-S02-FLDS < ZERO
               SET  DATAQ-RCVLEN-ERROR-ON  TO TRUE
               MOVE WS-DATAQ-RCVLEN-ERROR-MSG TO MSSG OF WS-B02-FLDS
               GO TO 2100-EDIT-ERRORS
           END-IF.

      **===============================================================
      ***  PROCESS MUST EXIST
      **===============================================================
           MOVE DATAQ-PROCESS-NAME OF WS-S02-FLDS   TO WS-KEY-PROCESS.
           PERFORM 9100-READK-PROCESS    THRU 9100-READK-EXIT.
           IF  FS-RECORD-NOT-FOUND
               SET  DATAQ-PROCESS-ERROR-ON TO TRUE
               MOVE WS-PROCESS-NAME-ERROR-MSG2 TO MSSG OF WS-B02-FLDS
               GO TO 2100-EDIT-ERRORS
           END-IF.

      **===============================================================
      ***  FIELD MUST NOT BE BLANK
      **===============================================================
           IF  DATAQ-WAIT  OF WS-S02-FLDS = ZERO
               SET  DATAQ-WAIT-ERROR-ON  TO TRUE
               MOVE WS-DATAQ-WAIT-ERROR-MSG TO MSSG OF WS-B02-FLDS
               GO TO 2100-EDIT-ERRORS
           END-IF.

      **===============================================================
      ***  SND AND RCV KEY LEN MUST BE > OR = ZERO
      **===============================================================
           IF  DATAQ-RCV-KEYLEN OF WS-S02-FLDS < ZERO
               SET  DATAQ-RCVKYL-ERROR-ON  TO TRUE
               MOVE WS-DATAQ-KEYLEN-ERROR-MSG TO MSSG OF WS-B02-FLDS
               GO TO 2100-EDIT-ERRORS
           END-IF.

      **===============================================================
      ***  SND AND RCV KEY LEN MUST BE > OR = ZERO
      **===============================================================
           IF  DATAQ-SND-KEYLEN OF WS-S02-FLDS < ZERO
               SET  DATAQ-SNDKYL-ERROR-ON  TO TRUE
               MOVE WS-DATAQ-KEYLEN-ERROR-MSG TO MSSG OF WS-B02-FLDS
               GO TO 2100-EDIT-ERRORS
           END-IF.

      **===============================================================
      ***  KEY ORDER SHOULD BE EQ LT GT GE LE OR BLANK
      **===============================================================
           IF  DATAQ-KEY-ORDER  OF WS-S02-FLDS NOT = "  "
           AND DATAQ-KEY-ORDER  OF WS-S02-FLDS NOT = "EQ"
           AND DATAQ-KEY-ORDER  OF WS-S02-FLDS NOT = "LT"
           AND DATAQ-KEY-ORDER  OF WS-S02-FLDS NOT = "GT"
           AND DATAQ-KEY-ORDER  OF WS-S02-FLDS NOT = "GE"
           AND DATAQ-KEY-ORDER  OF WS-S02-FLDS NOT = "LE"
               SET  DATAQ-KEYORD-ERROR-ON  TO TRUE
               MOVE WS-DATAQ-KEYORD-ERROR-MSG TO MSSG OF WS-B02-FLDS
               GO TO 2100-EDIT-ERRORS
           END-IF.

           GO TO 2100-EXIT.

       2100-EDIT-ERRORS.

           SET DISPLAY-ERROR-MSSG-ON  TO TRUE.
           SET EDIT-ERRORS-YES TO TRUE.

       2100-EXIT.
            EXIT.

      *****************************************************************
      ***  BUILD SCREEN 2
      *****************************************************************
       2999-BUILD-SCREEN-2.

           INITIALIZE  WS-S02-FLDS.
           IF  ADD-MODE-YES
               MOVE WS-DEFAULT-LIB TO DATAQ-LIBRARY OF WS-S02-FLDS
               GO TO 2999-EXIT
           END-IF.

           MOVE DATAQ-NAME    OF WS-SFL01-FLDS TO WS-KEY-DQNAME.
           PERFORM 9000-READK-DATAQ      THRU 9000-READK-EXIT.

           MOVE DQ-DATAQ-NAME TO DATAQ-NAME    OF WS-S02-FLDS.
           MOVE DQ-DATAQ-LIBRARY TO DATAQ-LIBRARY OF WS-S02-FLDS.
           MOVE DQ-DATAQ-PROCESS TO DATAQ-PROCESS-NAME OF WS-S02-FLDS.
           MOVE DQ-DATAQ-PROGRAM TO DATAQ-PROCESS-PROGRAM
                                                     OF WS-S02-FLDS.
           MOVE DQ-DATAQ-KEYORD  TO DATAQ-KEY-ORDER OF WS-S02-FLDS.
           MOVE DQ-DATAQ-SND-KEYLEN
                                 TO DATAQ-SND-KEYLEN OF WS-S02-FLDS.
           MOVE DQ-DATAQ-RCV-KEYLEN
                                 TO DATAQ-RCV-KEYLEN OF WS-S02-FLDS.
           MOVE DQ-DATAQ-SNDLEN  TO DATAQ-SND-LEN    OF WS-S02-FLDS.
           MOVE DQ-DATAQ-RCVLEN  TO DATAQ-RCV-LEN    OF WS-S02-FLDS.
           MOVE DQ-DATAQ-WAIT    TO DATAQ-WAIT       OF WS-S02-FLDS.
           MOVE DQ-DATAQ-SNDR-DATA-LEN TO DATAQ-SNDR-DATA
                                                     OF WS-S02-FLDS.
           MOVE DQ-DATAQ-RMVMSG  TO DATAQ-RMV-MSG    OF WS-S02-FLDS.
           MOVE DQ-DATAQ-ASYNC-RQST TO DATAQ-ASYNC-RQST
                                                     OF WS-S02-FLDS.
           MOVE DQ-DATAQ-RCVR-SIZE TO DATAQ-RCVR-SIZE OF WS-S02-FLDS.

       2999-EXIT.
            EXIT.

      *****************************************************************
      ***  UPDATE DATABASE
      *****************************************************************
       3000-UPDATE-DATABASE.

           MOVE DATAQ-NAME    OF WS-S02-FLDS   TO WS-KEY-DQNAME.
           PERFORM 9000-READK-DATAQ2     THRU 9000-READK2-EXIT.
           IF FS-RECORD-NOT-FOUND
              PERFORM 3100-ADD-RECORD    THRU 3100-EXIT
           ELSE
              IF FS-GOOD-FILE-IO
                 IF SELECT-FLD OF WS-SFL01-FLDS = "X"
                    PERFORM 3200-CHG-RECORD THRU 3200-EXIT
                 ELSE
                    IF SELECT-FLD OF WS-SFL01-FLDS = "D"
                       PERFORM 3300-DLT-RECORD THRU 3300-EXIT
                    END-IF
                 END-IF
              END-IF
           END-IF.

       3000-EXIT.
            EXIT.

      *****************************************************************
      *** ADD A RECORD
      *****************************************************************
       3100-ADD-RECORD.

           INITIALIZE  DATAQ-REC.

           MOVE DATAQ-NAME    OF WS-S02-FLDS TO DQ-DATAQ-NAME.
           MOVE DATAQ-LIBRARY OF WS-S02-FLDS TO DQ-DATAQ-LIBRARY.
           MOVE DATAQ-PROCESS-NAME OF WS-S02-FLDS TO DQ-DATAQ-PROCESS.
           MOVE DATAQ-PROCESS-PROGRAM OF WS-S02-FLDS
                                                  TO DQ-DATAQ-PROGRAM.
           MOVE DATAQ-SND-LEN OF WS-S02-FLDS TO DQ-DATAQ-SNDLEN.
           MOVE DATAQ-RCV-LEN OF WS-S02-FLDS TO DQ-DATAQ-RCVLEN.
           MOVE DATAQ-WAIT    OF WS-S02-FLDS TO DQ-DATAQ-WAIT.
           MOVE DATAQ-KEY-ORDER OF WS-S02-FLDS TO DQ-DATAQ-KEYORD.
           MOVE DATAQ-SNDR-DATA OF WS-S02-FLDS
                                         TO DQ-DATAQ-SNDR-DATA-LEN.
           MOVE DATAQ-SND-KEYLEN OF WS-S02-FLDS TO DQ-DATAQ-SND-KEYLEN.
           MOVE DATAQ-RCV-KEYLEN OF WS-S02-FLDS TO DQ-DATAQ-RCV-KEYLEN.
           MOVE DATAQ-RMV-MSG OF WS-S02-FLDS TO DQ-DATAQ-RMVMSG.
           MOVE DATAQ-ASYNC-RQST OF WS-S02-FLDS TO DQ-DATAQ-ASYNC-RQST.
           MOVE DATAQ-RCVR-SIZE OF WS-S02-FLDS TO DQ-DATAQ-RCVR-SIZE.
           PERFORM 9000-WRITE-DATAQ      THRU 9000-WRITE-EXIT.

       3100-EXIT.
            EXIT.

      *****************************************************************
      *** CHANGE A RECORD
      *****************************************************************
       3200-CHG-RECORD.

           MOVE DATAQ-NAME    OF WS-S02-FLDS TO DQ-DATAQ-NAME.
           MOVE DATAQ-LIBRARY OF WS-S02-FLDS TO DQ-DATAQ-LIBRARY.
           MOVE DATAQ-PROCESS-NAME OF WS-S02-FLDS TO DQ-DATAQ-PROCESS.
           MOVE DATAQ-PROCESS-PROGRAM OF WS-S02-FLDS
                                                  TO DQ-DATAQ-PROGRAM.
           MOVE DATAQ-SND-LEN OF WS-S02-FLDS TO DQ-DATAQ-SNDLEN.
           MOVE DATAQ-RCV-LEN OF WS-S02-FLDS TO DQ-DATAQ-RCVLEN.
           MOVE DATAQ-KEY-ORDER OF WS-S02-FLDS TO DQ-DATAQ-KEYORD.
           MOVE DATAQ-WAIT    OF WS-S02-FLDS TO DQ-DATAQ-WAIT.
           MOVE DATAQ-SND-KEYLEN OF WS-S02-FLDS TO DQ-DATAQ-SND-KEYLEN.
           MOVE DATAQ-RCV-KEYLEN OF WS-S02-FLDS TO DQ-DATAQ-RCV-KEYLEN.
           MOVE DATAQ-SNDR-DATA OF WS-S02-FLDS
                                         TO DQ-DATAQ-SNDR-DATA-LEN.
           MOVE DATAQ-RMV-MSG OF WS-S02-FLDS TO DQ-DATAQ-RMVMSG.
           MOVE DATAQ-ASYNC-RQST OF WS-S02-FLDS TO DQ-DATAQ-ASYNC-RQST.
           MOVE DATAQ-RCVR-SIZE OF WS-S02-FLDS TO DQ-DATAQ-RCVR-SIZE.
           PERFORM 9000-REWRT-DATAQ      THRU 9000-REWRT-EXIT.

       3200-EXIT.
            EXIT.

      *****************************************************************
      *** DELETE A RECORD
      *****************************************************************
       3300-DLT-RECORD.

      *** DELETE THE DATAQ RECORD
           PERFORM 9000-DELET-DATAQ      THRU 9000-DELET-EXIT.

       3300-EXIT.
            EXIT.

      *****************************************************************
      ***  GET DATE AND TIME STAMP
      *****************************************************************
       7000-GET-DATE-TIME.

      **** CALL WS-DTS-PGM2  USING WS-SYSTEM-DATE-TIME2.
           CALL "GETDTSTMP2" USING WS-SYSTEM-DATE-TIME2.

       7000-GDT-EXIT.
           EXIT.

      *****************************************************************
      ***  BUILD HEADING FLDS
      *****************************************************************
       7200-BUILD-HEADING-FLDS.

           PERFORM 7000-GET-DATE-TIME    THRU 7000-GDT-EXIT.
           MOVE WS-SYSTEM-HEADING-DATE2 TO WS-HEADING-DATE.
           MOVE WS-SYSTEM-TIME2-HRS     TO WS-HEADING-TIME(1:2)
           MOVE ":"                     TO WS-HEADING-TIME(3:1)
           MOVE WS-SYSTEM-TIME2-MIN     TO WS-HEADING-TIME(4:2)
           MOVE ":"                     TO WS-HEADING-TIME(6:1)
           MOVE WS-SYSTEM-TIME2-SEC     TO WS-HEADING-TIME(7:2)
           IF  WS-HEADING-TIME(1:1) = "0"
               MOVE SPACE               TO WS-HEADING-TIME(1:1)
           END-IF.

       7200-EXIT.
           EXIT.

      *****************************************************************
      ** DISPLAY SCREEN 1 - LIST PROCESSES & ALLOW SELECTION
      *****************************************************************
       8000-DISPLAY-SCREEN-1.

           PERFORM 7200-BUILD-HEADING-FLDS THRU 7200-EXIT.
           MOVE WS-HEADING-DATE          TO HDDATE OF WS-H01-FLDS.
           MOVE WS-HEADING-TIME          TO HDTIME OF WS-H01-FLDS.

           SET  ADD-MODE-NO    TO TRUE.

           MOVE CORR WS-H01-FLDS    TO H01-O.
           WRITE DISPLAY-REC FORMAT "H01"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

           MOVE CORR WS-B01-FLDS    TO B01-O.
           WRITE DISPLAY-REC FORMAT "B01"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

           IF  WS-RRN1 > ZERO
               SET SFL-DISPLAY-ON   TO TRUE
           END-IF.
           MOVE WS-DSP-RRN TO CRRN OF WS-CTL01-FLDS.

           MOVE CORR WS-CTL01-FLDS  TO CTL01-O.
           WRITE DISPLAY-REC FORMAT "CTL01"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

           INITIALIZE  WS-CTL01-FLDS.

           READ  DISPLAY-FILE FORMAT "CTL01"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-READ.
           MOVE CORR CTL01-I TO WS-CTL01-FLDS.

       8000-DSP-EXIT.
            EXIT.

      *****************************************************************
      *** CTL01 WRITE CONTROL RECORD
      *****************************************************************
       8000-WRITE-CTL01.

           WRITE DISPLAY-REC FORMAT "CTL01"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

       8000-WRTCR-EXIT.
            EXIT.
      *****************************************************************
      *** SFL01 READ NEXT MODIFIED RECORD
      *****************************************************************
       8000-READN-SFL01.

           READ SUBFILE DISPLAY-FILE
                NEXT MODIFIED RECORD FORMAT IS "SFL01"
                     INDICATORS ARE WS-ALL-INDICATORS
           END-READ.
           MOVE CORR SFL01-I        TO WS-SFL01-FLDS.

       8000-READN-EXIT.
            EXIT.
      *****************************************************************
      *** SFL01 WRITE SUBFILE RECORD
      *****************************************************************
       8000-WRITE-SFL01.

           MOVE WS-RRN              TO WS-RRN1.

           MOVE CORR WS-SFL01-FLDS  TO SFL01-O.
           WRITE SUBFILE DISPLAY-REC FORMAT "SFL01"
                         INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

       8000-WRTSF-EXIT.
            EXIT.
      *****************************************************************
      *** SFL01 REWRITE SUBFILE RECORD
      *****************************************************************
       8000-REWRT-SFL01.

           MOVE CORR WS-SFL01-FLDS  TO SFL01-O.
           REWRITE SUBFILE DISPLAY-REC FORMAT "SFL01"
                         INDICATORS ARE WS-ALL-INDICATORS
           END-REWRITE.

       8000-REWRT-EXIT.
            EXIT.

      *****************************************************************
      ** DISPLAY SCREEN 2 - S02 - ADD MODE SCREEN
      *****************************************************************
       8100-DISPLAY-SCREEN-2.

           PERFORM 7200-BUILD-HEADING-FLDS THRU 7200-EXIT.
           MOVE WS-HEADING-DATE     TO HDDATE OF WS-H01-FLDS.
           MOVE WS-HEADING-TIME     TO HDTIME OF WS-H01-FLDS.

           MOVE CORR WS-H01-FLDS    TO H01-O.
           WRITE DISPLAY-REC FORMAT "H01"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

           MOVE CORR WS-B02-FLDS    TO B02-O.
           WRITE DISPLAY-REC FORMAT "B02"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

           MOVE CORR WS-S02-FLDS  TO S02-O.
           WRITE DISPLAY-REC FORMAT "S02"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

           PERFORM 8100-INIT-SCREEN-2    THRU 8100-INIT-EXIT.

           READ  DISPLAY-FILE FORMAT "S02"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-READ.
           MOVE CORR S02-I TO WS-S02-FLDS.

       8100-DSP-EXIT.
            EXIT.

      *****************************************************************
      ** INIT S02
      *****************************************************************
       8100-INIT-SCREEN-2.

           INITIALIZE  WS-S02-FLDS  WS-B02-FLDS.
           SET  DISPLAY-ERROR-MSSG-OFF  TO TRUE.

           SET  DATAQ-NAME-ERROR-OFF    TO TRUE.
           SET  DATAQ-LIBRARY-ERROR-OFF TO TRUE.
           SET  DATAQ-PROCESS-ERROR-OFF TO TRUE.
           SET  DATAQ-PROGRAM-ERROR-OFF TO TRUE.
           SET  DATAQ-SNDLEN-ERROR-OFF TO TRUE.
           SET  DATAQ-RCVLEN-ERROR-OFF TO TRUE.
           SET  DATAQ-KEYORD-ERROR-OFF TO TRUE.
           SET  DATAQ-SNDKYL-ERROR-OFF TO TRUE.
           SET  DATAQ-RCVKYL-ERROR-OFF TO TRUE.
           SET  DATAQ-RMVMSG-ERROR-OFF TO TRUE.
           SET  DATAQ-SNDRDT-ERROR-OFF TO TRUE.
           SET  DATAQ-ASYNCR-ERROR-OFF TO TRUE.
           SET  DATAQ-RCVRSZ-ERROR-OFF TO TRUE.
           SET  DATAQ-WAIT-ERROR-OFF    TO TRUE.

       8100-INIT-EXIT.
            EXIT.

      *----------------------------------------------------------------
      *
      *                ALL FILE I-O'S BELOW THIS POINT
      *
      *----------------------------------------------------------------

      *****************************************************************
      ***  START DATAQ  FILE
      *****************************************************************
       9000-START-DATAQ.

           INITIALIZE DATAQ-REC.

           MOVE WS-KEY-DQNAME    TO DQ-DATAQ-NAME

           START DATAQ-FILE
                 KEY IS >= EXTERNALLY-DESCRIBED-KEY
           END-START.

       9000-START-EXIT.
            EXIT.

      *****************************************************************
      *** READ DATAQ FILE SEQUENTIALLY
      *****************************************************************
       9000-READN-DATAQ.

           READ DATAQ-FILE  NEXT RECORD  NO LOCK
           END-READ.

       9000-READN-EXIT.
            EXIT.
      *****************************************************************
      *** READ DATAQ FILE BY KEY  - NO RECORD LOCKING
      *****************************************************************
       9000-READK-DATAQ.

           INITIALIZE DATAQ-REC.

           MOVE WS-KEY-DQNAME    TO DQ-DATAQ-NAME.

           READ DATAQ-FILE  NO LOCK
           END-READ.

       9000-READK-EXIT.
            EXIT.
      *****************************************************************
      *** READ DATAQ FILE BY KEY FOR UPDATE
      *****************************************************************
       9000-READK-DATAQ2.

           INITIALIZE DATAQ-REC.

           MOVE WS-KEY-DQNAME    TO DQ-DATAQ-NAME.

           READ DATAQ-FILE
           END-READ.

       9000-READK2-EXIT.
            EXIT.
      *****************************************************************
      *** REWRITE DATAQ FILE
      *****************************************************************
       9000-REWRT-DATAQ.

           REWRITE DATAQ-REC
           END-REWRITE.

       9000-REWRT-EXIT.
            EXIT.
      *****************************************************************
      *** WRITE DATAQ FILE
      *****************************************************************
       9000-WRITE-DATAQ.

           WRITE DATAQ-REC
           END-WRITE.

       9000-WRITE-EXIT.
            EXIT.
      *****************************************************************
      *** DELETE DATAQ FILE
      *****************************************************************
       9000-DELET-DATAQ.

           DELETE  DATAQ-FILE
           END-DELETE.

       9000-DELET-EXIT.
            EXIT.
      *****************************************************************
      *** READ PROCESS FILE BY KEY WITH NO RECORD LOCK
      *****************************************************************
       9100-READK-PROCESS.

           INITIALIZE PROCESS-REC.

           MOVE WS-KEY-PROCESS   TO MPP-PROCESS.

           READ PROCESS-FILE
           END-READ.

       9100-READK-EXIT.
            EXIT.
      *****************************************************************
      ***              END  OF  SOURCE  MEMBER
      *****************************************************************
