       IDENTIFICATION DIVISION.

       PROGRAM-ID.     TARIBA99.
       AUTHOR.         EXLTECH, INC - DAN RAUCH

      ***************************************************************
      ** WRITE DATAQ SHUTDOWN RECORD TO END MONITOR JOB TARIBAMON
      ***************************************************************

      *================================================================
       ENVIRONMENT DIVISION.
      *===============================================================

       CONFIGURATION SECTION.

       SOURCE-COMPUTER.       IBM-AS400.
       OBJECT-COMPUTER.       IBM-AS400.
       SPECIAL-NAMES.         LOCAL-DATA IS LDA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT DATAQ-PARMS-FILE   ASSIGN TO DATABASE-MCFLAB1901
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

      *================================================================
       DATA DIVISION.
      *================================================================
       FILE SECTION.

       FD  DATAQ-PARMS-FILE.
       01  DATAQ-PARMS-REC.
       COPY DDS-ALL-FORMATS OF MCFLAB1901.
       COPY DATAQPARMS IN COPYLIB.

      *----------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *----------------------------------------------------------------
      *****************************************************************
      * FILE STATUS AREA
      *****************************************************************
       COPY FILESTATUS IN COPYLIB.

      *****************************************************************
      * SYSTEM DATE AREA
      *****************************************************************
       COPY DTSPARMS2  IN COPYLIB.

      *****************************************************************
      *  MISCELLANEOUS PROGRAM WORK FIELDS
      *****************************************************************
       01  WS-MISC-PROGRAM-FIELDS.
           03  WS-DATAQ-NAME     PIC X(10)        VALUE "TARIBADQ1".

      *****************************************************************
      *  DATAQ KEY         LENGTH = 30
      *****************************************************************
       01  WS-DATAQ-KEY.
           03  DQK-PROCESS       PIC X(10)  VALUE "TARIBAPO".
           03  DQK-DATE-TIME     PIC X(14)  VALUE SPACES.
           03  FILLER            PIC X(06)  VALUE SPACES.

      *****************************************************************
      *  RCV DATAQ RECORD
      *****************************************************************
       01  SND-DATAQ-RECORD.
           03  SND-DATA          PIC X(30)  VALUE "SHUTDOWN".
           03  FILLER            PIC X(50)  VALUE SPACES.

       COPY DATAQSTUFF IN COPYLIB.

      *****************************************************************
      *  PROGRAM MESSAGES
      *****************************************************************
       01  WS-ALL-PROGRAM-MESSAGES.
           03  WS-DATAQ-REC-NFND-MSG.
               05  FILLER          PIC X(22)          VALUE
                   "DATAQ PARM RECORD FOR ".
               05  WS-DATAQ-MSG-DQN   PIC X(10)       VALUE SPACE.
               05  FILLER          PIC X(58)          VALUE
                   " NOT FOUND - JOB ENDING".

      *================================================================
      *===        P R O C E D U R E    D I V I S I O N              ===
      *================================================================
       PROCEDURE DIVISION.
       0000-PROGRAM-ENTRY.

           OPEN  INPUT  DATAQ-PARMS-FILE.

           PERFORM 0010-INITIALIZE  THRU 0010-EXIT.

           IF  FS-GOOD-FILE-IO
               PERFORM 1000-MAIN-LOGIC-RTN  THRU 1000-EXIT
           END-IF.

           CLOSE        DATAQ-PARMS-FILE.

       0000-PROGRAM-END.
           GOBACK.

      *****************************************************************
      ** 1ST TIME PROCESSING ROUTINE
      *****************************************************************
       0010-INITIALIZE.

           MOVE WS-DATAQ-NAME    TO WS-DATAQ-MSG-DQN.

           CALL "GETDTSTMP2" USING WS-SYSTEM-DATE-TIME2.
           MOVE WS-SYSTEM-DATE-TIME2 TO  DQK-DATE-TIME.

           PERFORM 9000-READK-DATAQ-PARMS  THRU 9000-READK-EXIT.
           IF FS-RECORD-NOT-FOUND
              DISPLAY WS-DATAQ-REC-NFND-MSG
           END-IF.

       0010-EXIT.
            EXIT.

      *****************************************************************
      ***  MAIN PROCESSING LOOP ROUTINE
      *****************************************************************
       1000-MAIN-LOGIC-RTN.

           PERFORM 8000-SEND-DATAQ         THRU 8000-EXIT.

       1000-EXIT.
            EXIT.
      *****************************************************************
      ** RECEIVE DATAQ TARIBADQ1
      *****************************************************************
       8000-SEND-DATAQ.

           MOVE WS-DATAQ-KEY   TO DATAQ-KEY.
           CALL "QSNDDTAQ"  USING SND-DATAQ-NAME
                                  SND-DATAQ-LIBRARY
                                  SND-DATAQ-LENGTH
                                  SND-DATAQ-RECORD
                                  SND-DATAQ-KEYLEN
                                  DATAQ-KEY.

       8000-EXIT.
            EXIT.
      *****************************************************************
      ***  READ BY KEY DATAQ PARMS FILE
      *****************************************************************
       9000-READK-DATAQ-PARMS.

           INITIALIZE DATAQ-PARMS-REC.
           MOVE  WS-DATAQ-NAME      TO DQ-DATAQ-NAME.

           READ DATAQ-PARMS-FILE
           END-READ.

           IF  FS-RECORD-NOT-FOUND
               GO TO 9000-READK-EXIT
           END-IF.

           MOVE DQ-DATAQ-NAME      TO  SND-DATAQ-NAME.
           MOVE DQ-DATAQ-LIBRARY   TO  SND-DATAQ-LIBRARY.
           MOVE DQ-DATAQ-SNDLEN    TO  SND-DATAQ-LENGTH.
           MOVE DQ-DATAQ-SND-KEYLEN TO SND-DATAQ-KEYLEN.
           MOVE DQ-DATAQ-ASYNC-RQST TO SND-DATAQ-ASYNC-RQST.

           MOVE DQ-DATAQ-NAME      TO  RCV-DATAQ-NAME.
           MOVE DQ-DATAQ-LIBRARY   TO  RCV-DATAQ-LIBRARY.
           MOVE DQ-DATAQ-RCVLEN    TO  RCV-DATAQ-LENGTH.
           MOVE DQ-DATAQ-RCV-KEYLEN TO  RCV-DATAQ-KEYLEN.
           MOVE DQ-DATAQ-WAIT      TO  RCV-DATAQ-WAIT.
           MOVE DQ-DATAQ-KEYORD    TO  RCV-DATAQ-KEYORD.
           MOVE DQ-DATAQ-RMVMSG    TO  RCV-DATAQ-REMOVE.
           MOVE DQ-DATAQ-SNDR-DATA-LEN TO  RCV-DATAQ-SNDRLEN.
           MOVE DQ-DATAQ-RCVR-SIZE  TO RCV-DATAQ-RCVR-SIZE.

       9000-READK-EXIT.
            EXIT.
      *****************************************************************
      ***              END  OF  SOURCE  MEMBER
      *****************************************************************
