       IDENTIFICATION DIVISION.

       PROGRAM-ID.     TARIBASUP.
       AUTHOR.         EXLTECH, LLC - DAN RAUCH

      ***************************************************************
      **          LOAD ARIBA BUYER KEYS ON 1ST TIME SET UP
      **            1)  LOAD BUYER CODE
      **            2)  LOAD VALIDATA KEYS
      **            3)  LOAD PLTINFO KEYS
      ***************************************************************
      **                  --- N  O  T  E ---
      *** THIS CODE ORIGINALLY RESIDED IN THE COMMODITY CODE FILTER
      *** LOAD PROGRAM(TCODFLTR). IT'S STILL PART OF THE CODE FILTER
      *** LOAD PROCESS BUT NOW AS A SEPARATE PROGRAM. THIS WAS DONE
      *** SO IT COULD ALSO BE INCORPORATED INTO CATALOG LOAD PROCESS.
      ***************************************************************

      *****************************************************************
      **                MODIFICATION   HISTORY
      *****************************************************************
      ** --------- ----------  ----------------------------------------
      **    WHO       WHEN     WHAT (DESCRIPTION)
      ** --------- ----------  ----------------------------------------
      ** XXXXXXXXX XXXXXXXXXXX XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
      *****************************************************************


      *================================================================
       ENVIRONMENT DIVISION.
      *===============================================================

       CONFIGURATION SECTION.

       SOURCE-COMPUTER.       IBM-AS400.
       OBJECT-COMPUTER.       IBM-AS400.
       SPECIAL-NAMES.         LOCAL-DATA IS LDA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT PLANT-INFO-FILE   ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

           SELECT VALID-DATA-FILE   ASSIGN TO DATABASE-MCFLCS1701
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

           SELECT MBUYER-FILE       ASSIGN TO DATABASE-MCFLCS0601
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

           SELECT SETUP-FILE        ASSIGN TO DATABASE-MCFLAB0901
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

      *================================================================
       DATA DIVISION.
      *================================================================
       FILE SECTION.

       FD  PLANT-INFO-FILE.
       01  PLANT-INFO-REC.
       COPY DDS-ALL-FORMATS OF MCFLCS0501.

       FD  VALID-DATA-FILE.
       01  VALID-DATA-REC.
       COPY DDS-ALL-FORMATS OF MCFLCS1701.

       FD  MBUYER-FILE.
       01  MBUYER-REC.
       COPY DDS-ALL-FORMATS OF MCFLCS0601.

       FD  SETUP-FILE.
       01  SETUP-REC.
       COPY DDS-ALL-FORMATS OF MCFLAB0901.
       COPY MCFPFILKY  IN COPYLIB.

      *----------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *----------------------------------------------------------------

       COPY FILESTATUS IN COPYLIB.

      *****************************************************************
      *  MISCELLANEOUS PROGRAM WORK FIELDS
      *****************************************************************
       01  WS-MISC-PROGRAM-FIELDS.

      *  INITIAL ARIBA SETUP FILE KEYS
           03  WS-PLTINFO-KEY           PIC X(10)  VALUE "PLTINFO".
           03  WS-MBUYER-KEY            PIC X(10)  VALUE "BUYER".
           03  WS-VALDATA-KEY           PIC X(10)  VALUE "VALDATA".

      *  START SETUP FILE KEY
           03  WS-SETUP-KEY             PIC X(10)  VALUE SPACE.

      *================================================================
      *===        P R O C E D U R E    D I V I S I O N              ===
      *================================================================
       PROCEDURE DIVISION.
       0000-PROGRAM-ENTRY.

           OPEN  INPUT  SETUP-FILE
                 I-O    MBUYER-FILE
                        VALID-DATA-FILE
                        PLANT-INFO-FILE.


           PERFORM 0010-INITIALIZE  THRU 0010-EXIT.

           PERFORM 1000-MAIN-LOGIC-RTN  THRU 1000-EXIT.

           PERFORM 0099-END-OF-JOB  THRU 0099-EXIT.


           CLOSE        SETUP-FILE
                        PLANT-INFO-FILE
                        MBUYER-FILE
                        VALID-DATA-FILE.

       0000-PROGRAM-END.
           GOBACK.

      *****************************************************************
      ** 1ST TIME PROCESSING ROUTINE
      *****************************************************************
       0010-INITIALIZE.

           SET  FS-GOOD-FILE-IO   TO TRUE.

       0010-EXIT.
            EXIT.

      *****************************************************************
      ** END OF JOB PROCESSING ROUTINE
      *****************************************************************
       0099-END-OF-JOB.

       0099-EXIT.
            EXIT.

      *****************************************************************
      ***  MAIN PROCESSING LOOP ROUTINE
      *****************************************************************
       1000-MAIN-LOGIC-RTN.

      ***  SETUP PLTINFO KEYS
           MOVE  WS-PLTINFO-KEY     TO WS-SETUP-KEY.
           PERFORM 9300-START-SETUP-FILE   THRU 9300-START-EXIT.
           PERFORM 1100-LOAD-PLTINFO-KEYS  THRU 1100-EXIT
                   UNTIL FS-END-OF-FILE.

      ***  SETUP VALID DATA KEYS
           MOVE  WS-VALDATA-KEY     TO WS-SETUP-KEY.
           PERFORM 9300-START-SETUP-FILE   THRU 9300-START-EXIT.
           PERFORM 1200-LOAD-VALDATA-KEYS  THRU 1200-EXIT
                   UNTIL FS-END-OF-FILE.

      ***  SETUP BUYER DATA KEYS
           MOVE  WS-MBUYER-KEY      TO WS-SETUP-KEY.
           PERFORM 9300-START-SETUP-FILE   THRU 9300-START-EXIT.
           PERFORM 1300-LOAD-MBUYER-KEYS   THRU 1300-EXIT
                   UNTIL FS-END-OF-FILE.

       1000-EXIT.
            EXIT.
      *****************************************************************
      ***  SETUP ARIBA PLTINFO KEYS
      *****************************************************************
       1100-LOAD-PLTINFO-KEYS.

           PERFORM 9300-READN-SETUP-FILE THRU 9300-READN-EXIT.
           IF  FS-END-OF-FILE
               GO TO 1100-EXIT
           END-IF.

           PERFORM 9100-READK-PLANT-INFO   THRU 9100-READK-EXIT.
           IF  FS-RECORD-NOT-FOUND
               PERFORM 9100-WRITE-PLANT-INFO THRU 9100-WRITE-EXIT
           END-IF.

       1100-EXIT.
            EXIT.
      *****************************************************************
      ***  SETUP ARIBA VALID DATA KEYS
      *****************************************************************
       1200-LOAD-VALDATA-KEYS.

           PERFORM 9300-READN-SETUP-FILE THRU 9300-READN-EXIT.
           IF  FS-END-OF-FILE
               GO TO 1200-EXIT
           END-IF.

           PERFORM 9400-READK-VALID-DATA   THRU 9400-READK-EXIT.
           IF  FS-RECORD-NOT-FOUND
               PERFORM 9400-WRITE-VALID-DATA THRU 9400-WRITE-EXIT
           END-IF.

       1200-EXIT.
            EXIT.
      *****************************************************************
      ***  SETUP ARIBA BUYER KEYS
      *****************************************************************
       1300-LOAD-MBUYER-KEYS.

           PERFORM 9300-READN-SETUP-FILE THRU 9300-READN-EXIT.
           IF  FS-END-OF-FILE
               GO TO 1300-EXIT
           END-IF.

           PERFORM 9500-READK-MBUYER       THRU 9500-READK-EXIT.
           IF  FS-RECORD-NOT-FOUND
               PERFORM 9500-WRITE-MBUYER   THRU 9500-WRITE-EXIT
           END-IF.

       1300-EXIT.
            EXIT.
      *****************************************************************
      ***  READ BY KEY PLANT INFO FILE
      *****************************************************************
       9100-READK-PLANT-INFO.

           INITIALIZE PLANT-INFO-REC.
           MOVE  FK-SETUP-DATA TO PLANT-INFO-REC.

           READ PLANT-INFO-FILE    NO LOCK
           END-READ.

       9100-READK-EXIT.
            EXIT.
      *****************************************************************
      *** WRITE A PLANT INFO RECORD
      *****************************************************************
       9100-WRITE-PLANT-INFO.

           INITIALIZE PLANT-INFO-REC.
           MOVE  FK-SETUP-DATA TO PLANT-INFO-REC.

           WRITE PLANT-INFO-REC
           END-WRITE.

       9100-WRITE-EXIT.
            EXIT.
      *****************************************************************
      ***  START SETUP FILE
      *****************************************************************
       9300-START-SETUP-FILE.

           INITIALIZE SETUP-REC.
           MOVE WS-SETUP-KEY            TO FK-SETUP-KEY.

           START SETUP-FILE
                 KEY IS >= EXTERNALLY-DESCRIBED-KEY
           END-START.

       9300-START-EXIT.
            EXIT.
      *****************************************************************
      ***  READ NEXT SETUP RECORD
      *****************************************************************
       9300-READN-SETUP-FILE.

           READ SETUP-FILE   NEXT RECORD
           END-READ.

           IF FS-END-OF-FILE
              GO TO 9300-READN-EXIT
           END-IF.

           IF FK-SETUP-KEY NOT = WS-SETUP-KEY
              SET FS-END-OF-FILE TO TRUE
              GO TO 9300-READN-EXIT
           END-IF.

       9300-READN-EXIT.
            EXIT.
      *****************************************************************
      *** READK VALID DATA   -- MCFLCS1701
      *****************************************************************
       9400-READK-VALID-DATA.

           INITIALIZE VALID-DATA-REC.
           MOVE  FK-SETUP-DATA TO VALID-DATA-REC.

           READ VALID-DATA-FILE  NO LOCK
           END-READ.

       9400-READK-EXIT.
            EXIT.
      *****************************************************************
      *** WRITE VALID DATA RECORD
      *****************************************************************
       9400-WRITE-VALID-DATA.

           INITIALIZE VALID-DATA-REC.
           MOVE  FK-SETUP-DATA TO VALID-DATA-REC.

           WRITE VALID-DATA-REC
           END-WRITE.

       9400-WRITE-EXIT.
            EXIT.
      *****************************************************************
      *** READK MBUYER   MCFLCS0601
      *****************************************************************
       9500-READK-MBUYER.

           INITIALIZE MBUYER-REC.
           MOVE  FK-SETUP-DATA TO MBUYER-REC.

           READ MBUYER-FILE NO LOCK
           END-READ.

       9500-READK-EXIT.
            EXIT.
      *****************************************************************
      *** WRITE BUYER RECORD
      *****************************************************************
       9500-WRITE-MBUYER.

           INITIALIZE MBUYER-REC.
           MOVE  FK-SETUP-DATA TO MBUYER-REC.

           WRITE MBUYER-REC
           END-WRITE.

       9500-WRITE-EXIT.
            EXIT.
      *****************************************************************
      ***              END  OF  SOURCE  MEMBER
      *****************************************************************
