       IDENTIFICATION DIVISION.

       PROGRAM-ID.     TARIBA100.
       AUTHOR.         EXLTECH, INC - DAN RAUCH

      ***************************************************************
      **            MAINTAIN PROCESS/JOB/DATAQ PARM FILES
      **      -------------------------------------------------
      ** NOTE: MCFPAB1100 MCFPAB1200 MCFPAB1900 HAVE TO BE COMMON TO
      **       ALL ENVIRONMENTS, SO THEY "LIVE" IN LIBRARY MCPRD
      ***************************************************************

      *================================================================
       ENVIRONMENT DIVISION.
      *===============================================================
       CONFIGURATION SECTION.

       SOURCE-COMPUTER.       IBM-AS400.
       OBJECT-COMPUTER.       IBM-AS400.
       SPECIAL-NAMES.         LOCAL-DATA LDA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT DISPLAY-FILE  ASSIGN TO WORKSTATION-TARIBA100D-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS DYNAMIC
                  FILE STATUS IS WS-FILE-STATUS
                  RELATIVE KEY IS WS-RRN
                  CONTROL-AREA IS WS-KEYBOARD-RETURN-AREA.

           SELECT PROCESS-FILE  ASSIGN TO DATABASE-MCFLAB1201
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS IS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

           SELECT JOBS-FILE     ASSIGN TO DATABASE-MCFLAB1101
                  ORGANIZATION IS INDEXED
                  ACCESS IS DYNAMIC
                  FILE STATUS IS WS-FILE-STATUS
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.

      *================================================================
       DATA DIVISION.
      *================================================================
       FILE SECTION.

       FD  DISPLAY-FILE.
       01  DISPLAY-REC.
       COPY DD-ALL-FORMATS OF TARIBA100D.

       FD  PROCESS-FILE.
       01  PROCESS-REC.
       COPY DDS-ALL-FORMATS OF MCFLAB1201.
       COPY MONPROCESS IN COPYLIB.

       FD  JOBS-FILE.
       01  JOBS-REC.
       COPY DDS-ALL-FORMATS OF MCFLAB1101.
       COPY MONJOBPARM IN COPYLIB.

      *----------------------------------------------------------------
       WORKING-STORAGE SECTION.
      *----------------------------------------------------------------
       COPY FILESTATUS IN COPYLIB.
       COPY DTSPARMS2  IN COPYLIB.
       COPY KEYBDRTN    IN COPYLIB.

      *****************************************************************
      *  ALL PROGRAM INDICATORS
      *****************************************************************
       01  WS-ALL-INDICATORS.
           03  IN83              PIC 1   INDIC 83   VALUE B"0".
               88  SFL-END-OFF                      VALUE B"0".
               88  SFL-END-ON                       VALUE B"1".
           03  IN84              PIC 1   INDIC 84   VALUE B"0".
               88  SFL-CLEAR-OFF                    VALUE B"0".
               88  SFL-CLEAR-ON                     VALUE B"1".
           03  IN85              PIC 1   INDIC 85   VALUE B"0".
               88  SFL-DISPLAY-OFF                  VALUE B"0".
               88  SFL-DISPLAY-ON                   VALUE B"1".
           03  IN86              PIC 1   INDIC 86   VALUE B"0".
               88  SFL-NXTCHG-OFF                   VALUE B"0".
               88  SFL-NXTCHG-ON                    VALUE B"1".

           03  IN99              PIC 1   INDIC 99   VALUE B"0".
               88  DISPLAY-ERROR-MSSG-OFF           VALUE B"0".
               88  DISPLAY-ERROR-MSSG-ON            VALUE B"1".

           03  IN40              PIC 1   INDIC 40   VALUE B"0".
               88  HILIGHT-JOBNAME-OFF              VALUE B"0".
               88  HILIGHT-JOBNAME-ON               VALUE B"1".
           03  IN41              PIC 1   INDIC 41   VALUE B"0".
               88  HILIGHT-CALLFLG-OFF              VALUE B"0".
               88  HILIGHT-CALLFLG-ON               VALUE B"1".
           03  IN50              PIC 1   INDIC 50   VALUE B"0".
               88  PROCESS-NAME-ERROR-OFF           VALUE B"0".
               88  PROCESS-NAME-ERROR-ON            VALUE B"1".
           03  IN51              PIC 1   INDIC 51   VALUE B"0".
               88  ACTIVE-FLAG-ERROR-OFF            VALUE B"0".
               88  ACTIVE-FLAG-ERROR-ON             VALUE B"1".
           03  IN52              PIC 1   INDIC 52   VALUE B"0".
               88  JOB-NAME-ERROR-OFF               VALUE B"0".
               88  JOB-NAME-ERROR-ON                VALUE B"1".
           03  IN53              PIC 1   INDIC 53   VALUE B"0".
               88  JOB-DESC-ERROR-OFF               VALUE B"0".
               88  JOB-DESC-ERROR-ON                VALUE B"1".
           03  IN54              PIC 1   INDIC 54   VALUE B"0".
               88  JOB-PROGRAM-ERROR-OFF            VALUE B"0".
               88  JOB-PROGRAM-ERROR-ON             VALUE B"1".
           03  IN55              PIC 1   INDIC 55   VALUE B"0".
               88  JOB-TYPE-ERROR-OFF               VALUE B"0".
               88  JOB-TYPE-ERROR-ON                VALUE B"1".
           03  IN56              PIC 1   INDIC 56   VALUE B"0".
               88  JOB-CALL-FLAG-ERROR-OFF          VALUE B"0".
               88  JOB-CALL-FLAG-ERROR-ON           VALUE B"1".


       01  WS-ALL-SCREEN-FIELDS.
            03  WS-H01-FLDS.
                05  HDDATE            PIC X(13)          VALUE SPACE.
                05  HDTIME            PIC X(08)          VALUE SPACE.

            03  WS-CTL01-FLDS.
                05  CRRN              PIC S9(04)         VALUE +0.
                05  CREC              PIC X(10)          VALUE SPACE.
                05  CFLD              PIC X(10)          VALUE SPACE.
                05  CLOC              PIC S9(05)         VALUE +0.

            03  WS-SFL01-FLDS.
                05  SELECT-FLD        PIC X(01)          VALUE SPACE.
                05  PROCESS-NAME      PIC X(10)          VALUE SPACE.
                05  JOB-NAME          PIC X(10)          VALUE SPACE.
                05  JOB-CALL-FLAG     PIC X(01)          VALUE SPACE.

            03  WS-S02-FLDS.
                05  PROCESS-NAME      PIC X(10)          VALUE SPACE.
                05  ACTIVE-FLAG       PIC X(01)          VALUE SPACE.
                05  JOB-NAME          PIC X(10)          VALUE SPACE.
                05  JOB-DESC          PIC X(10)          VALUE SPACE.
                05  JOB-PROGRAM       PIC X(10)          VALUE SPACE.
                05  JOB-TYPE          PIC X(01)          VALUE SPACE.
                05  JOB-CALL-FLAG     PIC X(01)          VALUE SPACE.

            03  WS-B01-FLDS.
                05  MSSG              PIC X(78)          VALUE SPACE.

            03  WS-B02-FLDS.
                05  MSSG              PIC X(78)          VALUE SPACE.

      *****************************************************************
      *  PROGRAM MESSAGES
      *****************************************************************
       01  WS-PROGRAM-MESSAGES.
           03  WS-PROCESS-NAME-ERROR-MSG  PIC X(78)     VALUE
               "ENTER PROCESS NAME - CAN NOT BE BLANK".

           03  WS-ACTIVE-FLAG-ERROR-MSG  PIC X(78)     VALUE
               "ACTIVE FLAG MUST = Y OR N".

           03  WS-JOB-NAME-ERROR-MSG      PIC X(78)     VALUE
               "ENTER A JOB NAME - CAN NOT BE BLANK".

           03  WS-JOB-DESC-ERROR-MSG      PIC X(78)     VALUE
               "ENTER A JOB DESCRIPTION - CAN NOT BE BLANK".

           03  WS-JOB-PROGRAM-ERROR-MSG   PIC X(78)     VALUE
               "ENTER A PRIMARY PROGRAM TO CALL - CAN NOT BE BLANK".

           03  WS-JOB-TYPE-ERROR-MSG     PIC X(78)     VALUE
               "JOB TYPE MUST = I OR B(INTERACTIVE OR BATCH)".

           03  WS-JOB-CALL-FLAG-ERROR-MSG     PIC X(78)     VALUE
               "JOB CALL FLAG MUST = Y OR N".

      *****************************************************************
      *  MISCELLANEOUS WORK FIELDS
      *****************************************************************
       01  WS-MISCELLANEOUS-FIELDS.
           03  WS-DATAQ-PGM      PIC X(10)      VALUE "TARIBA110C".
           03  WS-EDIT-ERRORS-SW PIC X(01)          VALUE "N".
               88  EDIT-ERRORS-NO                   VALUE "N".
               88  EDIT-ERRORS-YES                  VALUE "Y".
           03  WS-ADD-MODE-SW    PIC X(01)          VALUE "N".
               88  ADD-MODE-YES                     VALUE "Y".
               88  ADD-MODE-NO                      VALUE "N".
           03  WS-KEY-PROCESS    PIC X(10)          VALUE SPACE.
           03  WS-KEY-JOBNAME    PIC X(10)          VALUE SPACE.
           03  WS-RRN            PIC  9(05)         VALUE ZERO.
           03  WS-RRN1           PIC  9(05)         VALUE ZERO.
           03  WS-RRN2           PIC  9(05)         VALUE ZERO.
           03  WS-RRN3           PIC  9(05)         VALUE ZERO.
           03  WS-DSP-RRN        PIC  9(05)         VALUE ZERO.

           03  WS-HEADING-DATE   PIC  X(13)         VALUE SPACE.
           03  WS-HEADING-TIME   PIC  X(08)         VALUE SPACE.
      *================================================================
      *=             P R O C E D U R E    D I V I S I O N
      *================================================================
       PROCEDURE DIVISION.
       0000-PROGRAM-ENTRY.

           OPEN  I-O    DISPLAY-FILE
                        PROCESS-FILE
                        JOBS-FILE.

           PERFORM 0010-INITIALIZE       THRU 0010-EXIT.

           PERFORM 1000-PROCESS-SCREEN-1 THRU 1000-EXIT
                   UNTIL KB-F03-KEY.

           CLOSE        DISPLAY-FILE
                        PROCESS-FILE
                        JOBS-FILE.


       0000-PROGRAM-END.
           GOBACK.

      *****************************************************************
      ** 1ST TIME PROCESSING ROUTINE
      *****************************************************************
       0010-INITIALIZE.

           SET  KB-ENTER-KEY     TO TRUE.

           PERFORM 1999-BUILD-SFL01      THRU 1999-EXIT.

       0010-EXIT.
            EXIT.

      *****************************************************************
      ***  MAIN PROCESSING LOOP ROUTINE
      *****************************************************************
       1000-PROCESS-SCREEN-1.

           PERFORM 8000-DISPLAY-SCREEN-1  THRU 8000-DSP-EXIT.
           IF  KB-F03-KEY
               GO TO 1000-EXIT
           END-IF.

           IF  KB-F06-KEY
               SET  ADD-MODE-YES   TO TRUE
               PERFORM 2999-BUILD-SCREEN-2   THRU 2999-EXIT
               PERFORM 2000-PROCESS-SCREEN-2 THRU 2000-EXIT
           END-IF.

           IF  KB-F10-KEY
               PERFORM 7100-CALL-DATAQ-PGM   THRU 7100-EXIT
               GO TO 1000-EXIT
           END-IF.

           IF  SFL-DISPLAY-ON
               IF  ADD-MODE-NO
                   PERFORM 1100-CHECK-SFL01  THRU 1100-EXIT
               END-IF
           END-IF.

           PERFORM 1999-BUILD-SFL01          THRU 1999-EXIT.

       1000-EXIT.
            EXIT.

      *****************************************************************
      ***  CHECK SFL01 FOR USER SELECTION
      *****************************************************************
       1100-CHECK-SFL01.

           PERFORM 8000-READN-SFL01      THRU 8000-READN-EXIT.
           IF  FS-END-OF-FILE
               GO TO 1100-EXIT
           END-IF.

           IF  SELECT-FLD OF WS-SFL01-FLDS = 'X'
               PERFORM 2999-BUILD-SCREEN-2   THRU 2999-EXIT
               PERFORM 2000-PROCESS-SCREEN-2 THRU 2000-EXIT
           END-IF.

           IF  SELECT-FLD OF WS-SFL01-FLDS = 'D'
               MOVE PROCESS-NAME  OF WS-SFL01-FLDS TO WS-KEY-PROCESS
               MOVE JOB-NAME      OF WS-SFL01-FLDS TO WS-KEY-JOBNAME
               PERFORM 9100-READK-JOBS2      THRU 9100-READK2-EXIT
               PERFORM 3300-DLT-RECORD       THRU 3300-EXIT
           END-IF.

           SET  SFL-NXTCHG-OFF  TO TRUE.
           MOVE SPACE           TO SELECT-FLD OF WS-SFL01-FLDS.
           PERFORM 8000-REWRT-SFL01      THRU 8000-REWRT-EXIT.

           GO TO 1100-CHECK-SFL01.

       1100-EXIT.
            EXIT.

      *****************************************************************
      ***  CLEAR SFL01
      *****************************************************************
       1998-CLEAR-SFL01.

           INITIALIZE  WS-SFL01-FLDS.
           MOVE ZERO             TO WS-RRN  WS-RRN1.
           MOVE 1                TO WS-DSP-RRN.

           SET  SFL-CLEAR-ON     TO TRUE.
           PERFORM 8000-WRITE-CTL01      THRU 8000-WRTCR-EXIT.
           SET  SFL-CLEAR-OFF    TO TRUE.
           SET  SFL-END-ON       TO TRUE.
           SET  SFL-DISPLAY-OFF  TO TRUE.

       1998-EXIT.
            EXIT.

      *****************************************************************
      ***  BUILD SFL01 - LIST ALL PROCESS RECORDS
      *****************************************************************
       1999-BUILD-SFL01.

           PERFORM 1998-CLEAR-SFL01      THRU 1998-EXIT.

           MOVE LOW-VALUES    TO WS-KEY-PROCESS.
           PERFORM 9000-START-PROCESS    THRU 9000-START-EXIT.

       1999-READ-LOOP1.

           PERFORM 9000-READN-PROCESS    THRU 9000-READN-EXIT.
           IF  FS-END-OF-FILE
               GO TO 1999-EXIT
           END-IF.

           MOVE MPP-PROCESS   TO WS-KEY-PROCESS.
           MOVE LOW-VALUES    TO WS-KEY-JOBNAME.
           PERFORM 9100-START-JOBS       THRU 9100-START-EXIT.

       1999-READ-LOOP2.

           PERFORM 9100-READN-JOBS       THRU 9100-READN-EXIT.
           IF  FS-END-OF-FILE
               GO TO 1999-READ-LOOP1
           END-IF.

           MOVE SPACE         TO SELECT-FLD    OF WS-SFL01-FLDS.
           MOVE MPP-PROCESS   TO PROCESS-NAME  OF WS-SFL01-FLDS.
           MOVE MJP-JOB-NAME  TO JOB-NAME      OF WS-SFL01-FLDS.
           MOVE MJP-CALL-FLAG TO JOB-CALL-FLAG OF WS-SFL01-FLDS.

           SET HILIGHT-JOBNAME-OFF         TO TRUE.
           SET HILIGHT-CALLFLG-OFF         TO TRUE.
           IF  MJP-CALL-FLAG = "Y"
               SET HILIGHT-JOBNAME-ON      TO TRUE
               SET HILIGHT-CALLFLG-ON      TO TRUE
           END-IF.

           ADD  1  TO WS-RRN.
           SET  SFL-NXTCHG-OFF  TO TRUE.

           PERFORM 8000-WRITE-SFL01      THRU 8000-WRTSF-EXIT.
           GO TO 1999-READ-LOOP2.

       1999-EXIT.
            EXIT.

      *****************************************************************
      ***  PROCESS SCREEN 2 - ADD MODE SCREEN
      *****************************************************************
       2000-PROCESS-SCREEN-2.

           PERFORM 8100-DISPLAY-SCREEN-2 THRU 8100-DSP-EXIT.
           IF  KB-F03-KEY
           OR  KB-F12-KEY
               GO TO 2000-EXIT
           END-IF.

           PERFORM 2100-EDIT-SCREEN-2    THRU 2100-EXIT.
           IF  EDIT-ERRORS-YES
               GO TO  2000-PROCESS-SCREEN-2
           END-IF.

           PERFORM 3000-UPDATE-DATABASE  THRU 3000-EXIT.

       2000-EXIT.
            EXIT.

      *****************************************************************
      ***  BUILD SCREEN 2
      *****************************************************************
       2100-EDIT-SCREEN-2.

           SET EDIT-ERRORS-NO  TO TRUE.

      **===============================================================
      ***  FIELD CAN'T BE BLANK
      **===============================================================
           IF  PROCESS-NAME  OF WS-S02-FLDS = SPACE
               SET  PROCESS-NAME-ERROR-ON  TO TRUE
               MOVE WS-PROCESS-NAME-ERROR-MSG TO MSSG OF WS-B02-FLDS
               GO TO 2100-EDIT-ERRORS
           END-IF.

      **===============================================================
      ***  FIELD MUST = "Y" OR "N"
      **===============================================================
           IF  ACTIVE-FLAG   OF WS-S02-FLDS NOT = "Y"
           AND ACTIVE-FLAG   OF WS-S02-FLDS NOT = "N"
               SET  ACTIVE-FLAG-ERROR-ON  TO TRUE
               MOVE WS-ACTIVE-FLAG-ERROR-MSG TO MSSG OF WS-B02-FLDS
               GO TO 2100-EDIT-ERRORS
           END-IF.

      **===============================================================
      ***  FIELD CAN'T BE BLANK
      **===============================================================
           IF  JOB-NAME  OF WS-S02-FLDS  = SPACE
               SET  JOB-NAME-ERROR-ON TO TRUE
               MOVE WS-JOB-NAME-ERROR-MSG TO MSSG OF WS-B02-FLDS
               GO TO 2100-EDIT-ERRORS
           END-IF.

      **===============================================================
      ***  FIELD CAN'T BE BLANK
      **===============================================================
           IF  JOB-DESC  OF WS-S02-FLDS = SPACE
               SET  JOB-DESC-ERROR-ON  TO TRUE
               MOVE WS-JOB-DESC-ERROR-MSG TO MSSG OF WS-B02-FLDS
               GO TO 2100-EDIT-ERRORS
           END-IF.

      **===============================================================
      ***  FIELD CAN'T BE BLANK
      **===============================================================
           IF  JOB-PROGRAM  OF WS-S02-FLDS = SPACE
               SET  JOB-PROGRAM-ERROR-ON  TO TRUE
               MOVE WS-JOB-PROGRAM-ERROR-MSG TO MSSG OF WS-B02-FLDS
               GO TO 2100-EDIT-ERRORS
           END-IF.

      **===============================================================
      ***  FIELD MUST = "I" OR "B"
      **===============================================================
           IF  JOB-TYPE      OF WS-S02-FLDS NOT = "I"
           AND JOB-TYPE      OF WS-S02-FLDS NOT = "B"
               SET  JOB-TYPE-ERROR-ON TO TRUE
               MOVE WS-JOB-TYPE-ERROR-MSG TO MSSG OF WS-B02-FLDS
               GO TO 2100-EDIT-ERRORS
           END-IF.

      **===============================================================
      ***  FIELD MUST = "Y" OR "N"
      **===============================================================
           IF  JOB-CALL-FLAG OF WS-S02-FLDS NOT = "Y"
           AND JOB-CALL-FLAG OF WS-S02-FLDS NOT = "N"
               SET  JOB-CALL-FLAG-ERROR-ON  TO TRUE
               MOVE WS-JOB-CALL-FLAG-ERROR-MSG TO MSSG OF WS-B02-FLDS
               GO TO 2100-EDIT-ERRORS
           END-IF.

           GO TO 2100-EXIT.

       2100-EDIT-ERRORS.

           SET DISPLAY-ERROR-MSSG-ON  TO TRUE.
           SET EDIT-ERRORS-YES TO TRUE.

       2100-EXIT.
            EXIT.

      *****************************************************************
      ***  BUILD SCREEN 2
      *****************************************************************
       2999-BUILD-SCREEN-2.

           INITIALIZE  WS-S02-FLDS.
           IF  ADD-MODE-YES
               GO TO 2999-EXIT
           END-IF.

           MOVE PROCESS-NAME  OF WS-SFL01-FLDS TO WS-KEY-PROCESS.
           MOVE JOB-NAME      OF WS-SFL01-FLDS TO WS-KEY-JOBNAME.
           PERFORM 9000-READK-PROCESS    THRU 9000-READK-EXIT.
           PERFORM 9100-READK-JOBS1      THRU 9100-READK1-EXIT.

           MOVE MPP-PROCESS   TO PROCESS-NAME  OF WS-S02-FLDS.
           MOVE MPP-ACTIVE-FLAG TO ACTIVE-FLAG OF WS-S02-FLDS.
           MOVE MJP-JOB-NAME  TO JOB-NAME      OF WS-S02-FLDS.
           MOVE MJP-JOB-DESC  TO JOB-DESC      OF WS-S02-FLDS.
           MOVE MJP-JOB-TYPE  TO JOB-TYPE      OF WS-S02-FLDS.
           MOVE MJP-JOB-PROGRAM TO JOB-PROGRAM OF WS-S02-FLDS.
           MOVE MJP-CALL-FLAG TO JOB-CALL-FLAG OF WS-S02-FLDS.

       2999-EXIT.
            EXIT.

      *****************************************************************
      ***  UPDATE DATABASE
      *****************************************************************
       3000-UPDATE-DATABASE.

           MOVE PROCESS-NAME  OF WS-S02-FLDS   TO WS-KEY-PROCESS.
           MOVE JOB-NAME      OF WS-S02-FLDS   TO WS-KEY-JOBNAME.
           PERFORM 9100-READK-JOBS2      THRU 9100-READK2-EXIT.
           IF FS-RECORD-NOT-FOUND
              PERFORM 3100-ADD-RECORD    THRU 3100-EXIT
           ELSE
              IF FS-GOOD-FILE-IO
                 IF SELECT-FLD OF WS-SFL01-FLDS = "X"
                    PERFORM 3200-CHG-RECORD THRU 3200-EXIT
                 ELSE
                    IF SELECT-FLD OF WS-SFL01-FLDS = "D"
                       PERFORM 3300-DLT-RECORD THRU 3300-EXIT
                    END-IF
                 END-IF
              END-IF
           END-IF.

       3000-EXIT.
            EXIT.

      *****************************************************************
      *** ADD A RECORD
      *****************************************************************
       3100-ADD-RECORD.

           INITIALIZE  JOBS-REC.
           MOVE PROCESS-NAME  OF WS-S02-FLDS TO MJP-JOB-PROCESS.
           MOVE JOB-NAME      OF WS-S02-FLDS TO MJP-JOB-NAME.
           MOVE JOB-DESC      OF WS-S02-FLDS TO MJP-JOB-DESC.
           MOVE JOB-PROGRAM   OF WS-S02-FLDS TO MJP-JOB-PROGRAM.
           MOVE JOB-TYPE      OF WS-S02-FLDS TO MJP-JOB-TYPE.
           MOVE JOB-CALL-FLAG OF WS-S02-FLDS TO MJP-CALL-FLAG.
           PERFORM 9100-WRITE-JOBS       THRU 9100-WRITE-EXIT.

           MOVE PROCESS-NAME  OF WS-S02-FLDS TO WS-KEY-PROCESS.
           PERFORM 9000-READK-PROCESS    THRU 9000-READK-EXIT.
           IF  FS-GOOD-FILE-IO
               MOVE ACTIVE-FLAG OF WS-S02-FLDS TO MPP-ACTIVE-FLAG
               PERFORM 9000-REWRT-PROCESS THRU 9000-REWRT-EXIT
           ELSE
               INITIALIZE PROCESS-REC
               MOVE PROCESS-NAME  OF WS-S02-FLDS TO MPP-PROCESS
               MOVE ACTIVE-FLAG   OF WS-S02-FLDS TO MPP-ACTIVE-FLAG
               PERFORM 9000-WRITE-PROCESS  THRU 9000-WRITE-EXIT
           END-IF.

       3100-EXIT.
            EXIT.

      *****************************************************************
      *** CHANGE A RECORD
      *****************************************************************
       3200-CHG-RECORD.

           MOVE PROCESS-NAME  OF WS-S02-FLDS TO MJP-JOB-PROCESS.
           MOVE JOB-NAME      OF WS-S02-FLDS TO MJP-JOB-NAME.
           MOVE JOB-DESC      OF WS-S02-FLDS TO MJP-JOB-DESC.
           MOVE JOB-PROGRAM   OF WS-S02-FLDS TO MJP-JOB-PROGRAM.
           MOVE JOB-TYPE      OF WS-S02-FLDS TO MJP-JOB-TYPE.
           MOVE JOB-CALL-FLAG OF WS-S02-FLDS TO MJP-CALL-FLAG.
           PERFORM 9100-REWRT-JOBS       THRU 9100-REWRT-EXIT.

           MOVE PROCESS-NAME  OF WS-S02-FLDS TO WS-KEY-PROCESS.
           PERFORM 9000-READK-PROCESS     THRU 9000-READK-EXIT.
           IF  FS-GOOD-FILE-IO
               MOVE ACTIVE-FLAG OF WS-S02-FLDS TO MPP-ACTIVE-FLAG
               PERFORM 9000-REWRT-PROCESS THRU 9000-REWRT-EXIT
           ELSE
               INITIALIZE PROCESS-REC
               MOVE PROCESS-NAME  OF WS-S02-FLDS TO MPP-PROCESS
               MOVE ACTIVE-FLAG   OF WS-S02-FLDS TO MPP-ACTIVE-FLAG
               PERFORM 9000-WRITE-PROCESS  THRU 9000-WRITE-EXIT
           END-IF.

       3200-EXIT.
            EXIT.

      *****************************************************************
      *** DELETE A RECORD
      *****************************************************************
       3300-DLT-RECORD.

      *** DELETE THE JOBS RECORD
           PERFORM 9100-DELET-JOBS       THRU 9100-DELET-EXIT.

      ***==============================================================
      *** CHECK TO SEE IF MORE JOB RECORDS FOR THIS PROCESS
      *** IF NOT THEN DELETE THE PROCESS RECORD
      ***==============================================================
           MOVE PROCESS-NAME  OF WS-SFL01-FLDS TO WS-KEY-PROCESS.
           MOVE LOW-VALUES                     TO WS-KEY-JOBNAME.
           PERFORM 9100-START-JOBS        THRU 9100-START-EXIT.
           PERFORM 9100-READN-JOBS        THRU 9100-READN-EXIT.

           IF  FS-END-OF-FILE
               PERFORM 9000-READK-PROCESS THRU 9000-READK-EXIT
               PERFORM 9000-DELET-PROCESS THRU 9000-DELET-EXIT
               GO TO 3300-EXIT
           END-IF.

       3300-EXIT.
            EXIT.

      *****************************************************************
      ***  GET DATE AND TIME STAMP
      *****************************************************************
       7000-GET-DATE-TIME.

      **** CALL WS-DTS-PGM2  USING WS-SYSTEM-DATE-TIME2.
           CALL "GETDTSTMP2" USING WS-SYSTEM-DATE-TIME2.

       7000-GDT-EXIT.
           EXIT.

      *****************************************************************
      ***  CALL THE DATAQ MAINT PROGRAM
      *****************************************************************
       7100-CALL-DATAQ-PGM.

           CALL WS-DATAQ-PGM.

       7100-EXIT.
            EXIT.

      *****************************************************************
      ***  CALL THE DATAQ MAINT PROGRAM
      *****************************************************************
       7200-BUILD-HEADING-FLDS.

           PERFORM 7000-GET-DATE-TIME    THRU 7000-GDT-EXIT.
           MOVE WS-SYSTEM-HEADING-DATE2 TO WS-HEADING-DATE.
           MOVE WS-SYSTEM-TIME2-HRS     TO WS-HEADING-TIME(1:2)
           MOVE ":"                     TO WS-HEADING-TIME(3:1)
           MOVE WS-SYSTEM-TIME2-MIN     TO WS-HEADING-TIME(4:2)
           MOVE ":"                     TO WS-HEADING-TIME(6:1)
           MOVE WS-SYSTEM-TIME2-SEC     TO WS-HEADING-TIME(7:2)
           IF  WS-HEADING-TIME(1:1) = "0"
               MOVE SPACE               TO WS-HEADING-TIME(1:1)
           END-IF.

       7200-EXIT.
            EXIT.

      *****************************************************************
      ** DISPLAY SCREEN 1 - LIST PROCESSES & ALLOW SELECTION
      *****************************************************************
       8000-DISPLAY-SCREEN-1.

           PERFORM 7200-BUILD-HEADING-FLDS THRU 7200-EXIT.
           MOVE WS-HEADING-DATE          TO HDDATE OF WS-H01-FLDS.
           MOVE WS-HEADING-TIME          TO HDTIME OF WS-H01-FLDS.

           SET  ADD-MODE-NO    TO TRUE.

           MOVE CORR WS-H01-FLDS    TO H01-O.
           WRITE DISPLAY-REC FORMAT "H01"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

           MOVE CORR WS-B01-FLDS    TO B01-O.
           WRITE DISPLAY-REC FORMAT "B01"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

           IF  WS-RRN1 > ZERO
               SET SFL-DISPLAY-ON   TO TRUE
           END-IF.
           MOVE WS-DSP-RRN TO CRRN OF WS-CTL01-FLDS.

           MOVE CORR WS-CTL01-FLDS  TO CTL01-O.
           WRITE DISPLAY-REC FORMAT "CTL01"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

           INITIALIZE  WS-CTL01-FLDS.

           READ  DISPLAY-FILE FORMAT "CTL01"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-READ.
           MOVE CORR CTL01-I TO WS-CTL01-FLDS.

       8000-DSP-EXIT.
            EXIT.

      *****************************************************************
      *** CTL01 WRITE CONTROL RECORD
      *****************************************************************
       8000-WRITE-CTL01.

           WRITE DISPLAY-REC FORMAT "CTL01"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

       8000-WRTCR-EXIT.
            EXIT.
      *****************************************************************
      *** SFL01 READ NEXT MODIFIED RECORD
      *****************************************************************
       8000-READN-SFL01.

           READ SUBFILE DISPLAY-FILE
                NEXT MODIFIED RECORD FORMAT IS "SFL01"
                     INDICATORS ARE WS-ALL-INDICATORS
           END-READ.
           MOVE CORR SFL01-I        TO WS-SFL01-FLDS.

       8000-READN-EXIT.
            EXIT.
      *****************************************************************
      *** SFL01 WRITE SUBFILE RECORD
      *****************************************************************
       8000-WRITE-SFL01.

           MOVE WS-RRN              TO WS-RRN1.

           MOVE CORR WS-SFL01-FLDS  TO SFL01-O.
           WRITE SUBFILE DISPLAY-REC FORMAT "SFL01"
                         INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

       8000-WRTSF-EXIT.
            EXIT.
      *****************************************************************
      *** SFL01 REWRITE SUBFILE RECORD
      *****************************************************************
       8000-REWRT-SFL01.

           MOVE CORR WS-SFL01-FLDS  TO SFL01-O.
           REWRITE SUBFILE DISPLAY-REC FORMAT "SFL01"
                         INDICATORS ARE WS-ALL-INDICATORS
           END-REWRITE.

       8000-REWRT-EXIT.
            EXIT.

      *****************************************************************
      ** DISPLAY SCREEN 2 - S02 - ADD MODE SCREEN
      *****************************************************************
       8100-DISPLAY-SCREEN-2.

           PERFORM 7200-BUILD-HEADING-FLDS THRU 7200-EXIT.
           MOVE WS-HEADING-DATE          TO HDDATE OF WS-H01-FLDS.
           MOVE WS-HEADING-TIME          TO HDTIME OF WS-H01-FLDS.

           MOVE CORR WS-H01-FLDS    TO H01-O.
           WRITE DISPLAY-REC FORMAT "H01"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

           MOVE CORR WS-B02-FLDS    TO B02-O.
           WRITE DISPLAY-REC FORMAT "B02"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

           MOVE CORR WS-S02-FLDS  TO S02-O.
           WRITE DISPLAY-REC FORMAT "S02"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-WRITE.

           PERFORM 8100-INIT-SCREEN-2    THRU 8100-INIT-EXIT.

           READ  DISPLAY-FILE FORMAT "S02"
                 INDICATORS ARE WS-ALL-INDICATORS
           END-READ.
           MOVE CORR S02-I TO WS-S02-FLDS.

       8100-DSP-EXIT.
            EXIT.

      *****************************************************************
      ** INIT S02
      *****************************************************************
       8100-INIT-SCREEN-2.

           INITIALIZE  WS-S02-FLDS  WS-B02-FLDS.
           SET  DISPLAY-ERROR-MSSG-OFF  TO TRUE.

           SET  PROCESS-NAME-ERROR-OFF  TO TRUE.
           SET  ACTIVE-FLAG-ERROR-OFF   TO TRUE.
           SET  JOB-NAME-ERROR-OFF      TO TRUE.
           SET  JOB-PROGRAM-ERROR-OFF   TO TRUE.
           SET  JOB-DESC-ERROR-OFF      TO TRUE.
           SET  JOB-TYPE-ERROR-OFF      TO TRUE.
           SET  JOB-CALL-FLAG-ERROR-OFF TO TRUE.

       8100-INIT-EXIT.
            EXIT.

      *----------------------------------------------------------------
      *
      *                ALL FILE I-O'S BELOW THIS POINT
      *
      *----------------------------------------------------------------

      *****************************************************************
      ***  START PROCESS FILE
      *****************************************************************
       9000-START-PROCESS.

           INITIALIZE PROCESS-REC.

           MOVE WS-KEY-PROCESS   TO MPP-PROCESS.

           START PROCESS-FILE
                 KEY IS >= EXTERNALLY-DESCRIBED-KEY
           END-START.

       9000-START-EXIT.
            EXIT.

      *****************************************************************
      *** READ PROCESS FILE SEQUENTIALLY
      *****************************************************************
       9000-READN-PROCESS.

           READ PROCESS-FILE  NEXT RECORD  NO LOCK
           END-READ.

       9000-READN-EXIT.
            EXIT.
      *****************************************************************
      *** READ PROCESS FILE BY KEY FOR UPDATE
      *****************************************************************
       9000-READK-PROCESS.

           INITIALIZE PROCESS-REC.

           MOVE WS-KEY-PROCESS   TO MPP-PROCESS.

           READ PROCESS-FILE
           END-READ.

       9000-READK-EXIT.
            EXIT.
      *****************************************************************
      *** REWRITE PROCESS FILE
      *****************************************************************
       9000-REWRT-PROCESS.

           REWRITE PROCESS-REC
           END-REWRITE.

       9000-REWRT-EXIT.
            EXIT.
      *****************************************************************
      *** WRITE PROCESS FILE
      *****************************************************************
       9000-WRITE-PROCESS.

           WRITE PROCESS-REC
           END-WRITE.

       9000-WRITE-EXIT.
            EXIT.
      *****************************************************************
      *** DELETE  PROCESS FILE
      *****************************************************************
       9000-DELET-PROCESS.

           DELETE  PROCESS-FILE
           END-DELETE.

       9000-DELET-EXIT.
            EXIT.
      *****************************************************************
      ***  START JOBS FILE
      *****************************************************************
       9100-START-JOBS.

           INITIALIZE JOBS-REC.

           MOVE WS-KEY-PROCESS   TO MJP-JOB-PROCESS.
           MOVE WS-KEY-JOBNAME   TO MJP-JOB-NAME.

           START JOBS-FILE
                 KEY IS >= EXTERNALLY-DESCRIBED-KEY
           END-START.

       9100-START-EXIT.
            EXIT.

      *****************************************************************
      *** READ JOBS  FILE SEQUENTIALLY
      *****************************************************************
       9100-READN-JOBS.

           READ JOBS-FILE     NEXT RECORD  NO LOCK
           END-READ.

           IF FS-END-OF-FILE
              GO TO 9100-READN-EXIT
           END-IF.

           IF MJP-JOB-PROCESS NOT = WS-KEY-PROCESS
              SET  FS-END-OF-FILE   TO TRUE
              GO TO 9100-READN-EXIT
           END-IF.

       9100-READN-EXIT.
            EXIT.
      *****************************************************************
      *** READ JOBS FILE BY KEY WITH NO RECORD LOCK
      *****************************************************************
       9100-READK-JOBS1.

           INITIALIZE JOBS-REC.

           MOVE WS-KEY-PROCESS   TO MJP-JOB-PROCESS.
           MOVE WS-KEY-JOBNAME   TO MJP-JOB-NAME.

           READ JOBS-FILE  NO LOCK
           END-READ.

       9100-READK1-EXIT.
            EXIT.
      *****************************************************************
      *** READ JOBS  BY KEY WITH RECORD LOCK (RETRIEVE FOR UPDATE)
      *****************************************************************
       9100-READK-JOBS2.

           INITIALIZE JOBS-REC.

           MOVE WS-KEY-PROCESS   TO MJP-JOB-PROCESS.
           MOVE WS-KEY-JOBNAME   TO MJP-JOB-NAME.

           READ JOBS-FILE
           END-READ.

       9100-READK2-EXIT.
            EXIT.
      *****************************************************************
      *** REWRITE JOBS RECORD
      *****************************************************************
       9100-REWRT-JOBS.

           REWRITE JOBS-REC
           END-REWRITE.

       9100-REWRT-EXIT.
            EXIT.
      *****************************************************************
      *** WRITE JOBS RECORD
      *****************************************************************
       9100-WRITE-JOBS.

           WRITE JOBS-REC
           END-WRITE.

       9100-WRITE-EXIT.
            EXIT.
      *****************************************************************
      *** DELET JOBS RECORD
      *****************************************************************
       9100-DELET-JOBS.

           DELETE JOBS-FILE
           END-DELETE.

       9100-DELET-EXIT.
            EXIT.
      *****************************************************************
      ***              END  OF  SOURCE  MEMBER
      *****************************************************************
