       IDENTIFICATION DIVISION.
       PROGRAM-ID. TASBMANT.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. AS400.
       OBJECT-COMPUTER. AS400.

      *D*************************************************************
      *C  16 SEP 1994     WILL MCINTYRE     REQUEST # 94-040
      *D  TASBMANT - ABESTOS MESSAGE FILE MAINTENANCE SCREEN
      *D     THIS PROGRAM WILL ALLOW THE USER TO ADD, CHANGE OR
      *D     DELETE RECORDS FROM THE ASBESTOS MESSAGE FILE.
      *D*************************************************************
      *C  11 JAN 1995     WILL MCINTYRE     REQUEST # 94-040
      *C     REVISED READ FIRST AND READ LAST CALLS TO BETTER
      *C     ACCOMODATE SCROLLING THRU EMPTY MESSAGE FILE
      *C*************************************************************

       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.

       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZASBESTOS-SI
               ORGANIZATION IS TRANSACTION
               FILE STATUS IS FILE-STATUS
               CONTROL-AREA IS WS-CONTROL.

           SELECT MASBMSG
               ASSIGN TO DATABASE-MCFLMM4801
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).

       FD  MASBMSG
           LABEL RECORDS ARE STANDARD.
       01  MASBMSG-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM4801.

       WORKING-STORAGE SECTION.

       77  BASE                       PIC X(10).

       COPY CATREAD  OF COPYLIB.
       COPY MASBMSG  IN COPYLIB.
       COPY TDATECHK IN COPYLIB.
       COPY LANGSUB  IN COPYLIB.
       COPY CPYIND   OF COPYLIB.
       COPY IOFEEDBACK OF COPYLIB.
       COPY WSCONTROL  OF COPYLIB.
       COPY TBLOWUP    OF COPYLIB.
       COPY VCOMAREA    OF COPYLIB.

       COPY DBSTAT IN COPYLIB.

       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X     VALUE "0".
           05  FILE-STATUS-2             PIC X     VALUE "0".

       01  SWITCHES.
           05  FUNC-COMP-SW              PIC X     VALUE "N".
           05  LOCK-SW                   PIC X     VALUE "N".
           05  CLEAR-SW                  PIC X     VALUE "N".

       01  WS-DISPLAY-AREA.
           05    FILLER                  PIC XX.
           05  WS-DISPLAY-MSG            PIC X(27).
           05    FILLER                  PIC XX.
           05  WS-DISPLAY-STAT           PIC S9(4).
           05    FILLER                  PIC XX.
           05  WS-DISPLAY-FLD            PIC X(14).
           05    FILLER                  PIC XX.

       01  DEFAULT-MESSAGE               PIC X(79)  VALUE
            "                                               ".

       01  MESSAGE-BUFFER.
           05  FILLER                    PIC X(80).

       01  WS-SCREEN.
           05  DISP-MSG-CODE             PIC X(02).
           05  DISP-LINES.
               10  DISP-MESSAGE1         PIC X(70).
               10  DISP-MESSAGE2         PIC X(70).
               10  DISP-MESSAGE3         PIC X(70).
               10  DISP-MESSAGE4         PIC X(70).
               10  DISP-MESSAGE5         PIC X(70).
           05  DISP-COMMAND-LINE         PIC X(79).
           05  DISP-MESSAGE-LINE         PIC X(79).

       PROCEDURE DIVISION.

       START-PROGRAM.
           PERFORM 1-HOUSEKEEPING THRU 1-EXIT.
           PERFORM 6-MAIN         THRU 6-EXIT
           PERFORM 2-END-OF-JOB   THRU 2-EXIT.

       1-HOUSEKEEPING.
           MOVE "FMANTMSG" TO VIEW-NFNAME.
           OPEN I-O DISPLAY-FILE MASBMSG.
           MOVE SPACES     TO BU-DISPLAY-MSG.

           MOVE 1          TO  DATE-MODE.
           CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
           PERFORM 10-INIT-READ THRU 10-EXIT.

       1-EXIT.
           EXIT.

       10-INIT-READ.
           PERFORM 30-READ-FIRST-MASBMSG THRU 30-EXIT.
           IF FILE-STATUS = "00"
              MOVE "Y" TO LOCK-SW
              MOVE B"1" TO INDS (10) INDS (11)
              MOVE ASB-MSG-CODE TO DISP-MSG-CODE
              MOVE ASB-MESSAGE1 TO DISP-MESSAGE1
              MOVE ASB-MESSAGE2 TO DISP-MESSAGE2
              MOVE ASB-MESSAGE3 TO DISP-MESSAGE3
              MOVE ASB-MESSAGE4 TO DISP-MESSAGE4
              MOVE ASB-MESSAGE5 TO DISP-MESSAGE5
           ELSE
              MOVE "N" TO LOCK-SW
              MOVE SPACES TO WS-SCREEN.

       10-EXIT.
           EXIT.

       2-END-OF-JOB.
           CLOSE MASBMSG.
           CLOSE DISPLAY-FILE.
           GOBACK.
       2-EXIT.
           EXIT.

       2-BLOWUP.
           MOVE "TASBMANT" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
             VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG, BU-DISPLAY-AREA.

       30-READ-FIRST-MASBMSG.
           READ MASBMSG FIRST INTO BUF-MASBMSG WITH NO LOCK
             AT END MOVE FILE-STATUS TO FILE-STATUS.

       30-EXIT.
           EXIT.

       31-READ-NEXT-MASBMSG.
           READ MASBMSG NEXT INTO BUF-MASBMSG WITH NO LOCK
             AT END MOVE FILE-STATUS TO FILE-STATUS.

       31-EXIT.
           EXIT.

       32-READ-PREV-MASBMSG.
           READ MASBMSG PRIOR INTO BUF-MASBMSG WITH NO LOCK
             AT END MOVE FILE-STATUS TO FILE-STATUS.

       32-EXIT.
           EXIT.

       33-READ-LAST-MASBMSG.
           READ MASBMSG LAST INTO BUF-MASBMSG WITH NO LOCK
             AT END MOVE FILE-STATUS TO FILE-STATUS.

       33-EXIT.
           EXIT.

       34-READ-MASBMSG.
           READ MASBMSG NEXT INTO BUF-MASBMSG
             AT END MOVE FILE-STATUS TO FILE-STATUS.

       34-EXIT.
           EXIT.

       6-MAIN.
           MOVE SPACES TO BUF-MASBMSG.
           MOVE ZEROS  TO STATUS-AREA.
           MOVE ZEROS  TO FILE-STATUS.
           MOVE "N"    TO FUNC-COMP-SW.

      *-----CHECK FOR SUCCESSFUL MAINTENANCE FUNCTION, LEAVE MESSAGE.
           IF VIEW-LASTKEY = 6
      *M****************************************************************
      *M   Message Set: 03   Number: 020
      *M  C20  CODE ADDED
      *M****************************************************************
              MOVE   03        TO CATREAD-MSG-SET
              MOVE  020        TO CATREAD-MSG-NUM
              PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT.

           IF VIEW-LASTKEY = 7
      *M****************************************************************
      *M   Message Set: 03   Number: 214
      *M  C214 CODE CHANGED
      *M****************************************************************
              MOVE   03        TO CATREAD-MSG-SET
              MOVE  215        TO CATREAD-MSG-NUM
              PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT.

           IF VIEW-LASTKEY = 8
      *M****************************************************************
      *M   Message Set: 03   Number: 022
      *M  C22 CODE DELETED
      *M****************************************************************
              MOVE   03        TO CATREAD-MSG-SET
              MOVE  022        TO CATREAD-MSG-NUM
              PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT.

       6-PUT-BUFFER.
           MOVE WS-SCREEN TO DSPLY-REC.
           IF LOCK-SW = "Y"
              MOVE B"1" TO INDS(10) INDS(11).

       6-SHOW.
           PERFORM 99-SCREEN-WRITE THRU 99-EXIT.

       6-READ.
           PERFORM 98-SCREEN-READ  THRU 98-EXIT.
           MOVE SPACES TO DISP-MESSAGE-LINE.
           MOVE DSPLY-REC TO WS-SCREEN.

       6-PROCESS.
           IF VIEW-LASTKEY = 3
              GO TO 6-EXIT
           ELSE IF VIEW-LASTKEY = 6
              PERFORM 60-ADD-MSG THRU 60-EXIT
           ELSE IF VIEW-LASTKEY = 7 OR 8
              PERFORM 61-INT-UPD THRU 61-EXIT
           ELSE IF VIEW-LASTKEY = 2
              PERFORM 62-NXT-MSG THRU 62-EXIT
           ELSE IF VIEW-LASTKEY = 1
              PERFORM 63-PRV-MSG THRU 63-EXIT
           ELSE GO TO 6-PUT-BUFFER.

      *----CHECK FOR EXIT FROM MAINTENANCE FUNCTION
           IF VIEW-LASTKEY = 3
              GO TO 6-EXIT.

           IF FUNC-COMP-SW = "Y"
              MOVE "Y" TO LOCK-SW
              GO TO 6-MAIN
           ELSE
              GO TO 6-PROCESS.

       6-EXIT.
           EXIT.

       60-ADD-MSG.
           MOVE "N" TO LOCK-SW.
           IF CLEAR-SW = "Y"
              MOVE SPACES TO WS-SCREEN
              MOVE "N" TO CLEAR-SW.
      *M****************************************************************
      *M  Message Set: 00    Number: 048
      *M  F6 TO CONFIRM ADD
      *M****************************************************************
           MOVE  00             TO CATREAD-MSG-SET.
           MOVE 048             TO CATREAD-MSG-NUM.
           PERFORM  999-CATREAD THRU 999-CATREAD-EXIT.
           PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT.
           MOVE WS-SCREEN TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE THRU 99-EXIT.
           PERFORM 98-SCREEN-READ  THRU 98-EXIT.
           MOVE DSPLY-REC TO WS-SCREEN.
           IF VIEW-LASTKEY = 3 OR 7 OR 8 OR 1 OR 2
              GO TO 60-EXIT
           ELSE IF VIEW-LASTKEY = 6
              NEXT SENTENCE
           ELSE
              GO TO 60-ADD-MSG.

           PERFORM 600-EDT-ADD THRU 600-EXIT.
           IF VIEW-LASTKEY = 3 OR 7 OR 8 OR 1 OR 2
              GO TO 60-EXIT.

      *-----GOOD RECORD, MOVE FIELDS AND ADD RECORD
           MOVE DISP-MSG-CODE TO ASB-MSG-CODE.
           MOVE DISP-MESSAGE1 TO ASB-MESSAGE1.
           MOVE DISP-MESSAGE2 TO ASB-MESSAGE2.
           MOVE DISP-MESSAGE3 TO ASB-MESSAGE3.
           MOVE DISP-MESSAGE4 TO ASB-MESSAGE4.
           MOVE DISP-MESSAGE5 TO ASB-MESSAGE5.

           WRITE MASBMSG-REC FROM BUF-MASBMSG
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              MOVE "INSERT ERR 60-ADDMSG" TO BU-MSG-AREA
              MOVE DISP-MSG-CODE          TO BU-DISPLAY-FLD (1)
              MOVE 99 TO COND-WORD
              PERFORM 2-BLOWUP.
           MOVE "Y" TO FUNC-COMP-SW.

       60-EXIT.
           EXIT.

       600-EDT-ADD.
           IF DISP-MSG-CODE = SPACES
      *M****************************************************************
      *M   Message Set: 03   Number: 103
      *M   CODE IS A REQUIRED FIELD
      *M****************************************************************
              MOVE    3        TO CATREAD-MSG-SET
              MOVE  103        TO CATREAD-MSG-NUM
              PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT
              GO TO 600-PUT-BUFFER.

           IF  DISP-MESSAGE1 = SPACES
           AND DISP-MESSAGE2 = SPACES
           AND DISP-MESSAGE3 = SPACES
           AND DISP-MESSAGE4 = SPACES
           AND DISP-MESSAGE5 = SPACES
      *M****************************************************************
      *M   Message Set: 39   Number: 018
      *M   MESSAGE IS REQUIRED
      *M****************************************************************
               MOVE   39        TO CATREAD-MSG-SET
               MOVE  018        TO CATREAD-MSG-NUM
               PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
               PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT
               GO TO 600-PUT-BUFFER.

           MOVE DISP-MSG-CODE TO MSGCODE OF MASBMSG-REC.
           START MASBMSG KEY NOT < MSGCODE OF MASBMSG-REC
             INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
              MOVE "START ERR MASBMSG 600-EDTADD" TO BU-DISPLAY-MSG
              MOVE  DISP-MSG-CODE                 TO BU-DISPLAY-FLD (1)
              PERFORM 2-BLOWUP.
           MOVE 0 TO COND-WORD.

           PERFORM 34-READ-MASBMSG THRU 34-EXIT.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS = "10" OR "14" OR "46"
                 NEXT SENTENCE
              ELSE
                 MOVE "READNXT ERR MASBMSG 600-EDTADD" TO BU-DISPLAY-MSG
                 MOVE DISP-MSG-CODE                 TO BU-DISPLAY-FLD(1)
                 PERFORM 2-BLOWUP.

           IF ASB-MSG-CODE = DISP-MSG-CODE
      *M****************************************************************
      *M   Message Set: 29   Number: 082
      *M   CODE ALREADY EXISTS
      *M****************************************************************
              MOVE   29        TO CATREAD-MSG-SET
              MOVE  082        TO CATREAD-MSG-NUM
              PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT
              GO TO 600-PUT-BUFFER.

      *-----SUCCESSFULLY PASSED ALL EDITS, EXIT PARAGRAPH
           GO TO 600-EXIT.

       600-PUT-BUFFER.
           MOVE WS-SCREEN TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE THRU 99-EXIT.
           PERFORM 98-SCREEN-READ  THRU 98-EXIT.
           MOVE DSPLY-REC TO WS-SCREEN.

           IF VIEW-LASTKEY = 3 OR 7 OR 8 OR 1 OR 2
              GO TO 600-EXIT
           ELSE IF VIEW-LASTKEY = 6
              GO TO 600-EDT-ADD
           ELSE
      *-----TURN ON IND TO DISPLAY PREVIOUS MESSAGE IF IND IS OFF
              IF INDS (99) = B"0"
                 MOVE B"1" TO INDS (99)
              END-IF
              GO TO 600-PUT-BUFFER.

       600-EXIT.
           EXIT.

       61-INT-UPD.
           MOVE "N" TO LOCK-SW.
           PERFORM 610-EDT-UPD THRU 610-EXIT.
           IF VIEW-LASTKEY = 3 OR 6 OR 1 OR 2
              GO TO 61-EXIT.

           MOVE "Y" TO CLEAR-SW.
           MOVE ASB-MESSAGE1 TO DISP-MESSAGE1.
           MOVE ASB-MESSAGE2 TO DISP-MESSAGE2.
           MOVE ASB-MESSAGE3 TO DISP-MESSAGE3.
           MOVE ASB-MESSAGE4 TO DISP-MESSAGE4.
           MOVE ASB-MESSAGE5 TO DISP-MESSAGE5.

           IF VIEW-LASTKEY = 7
      *M****************************************************************
      *M  Message Set: 00    Number: 002
      *M  MAKE CHANGES - F7 TO COMPLETE MODIFY
      *M****************************************************************
              MOVE 00             TO CATREAD-MSG-SET
              MOVE 02             TO CATREAD-MSG-NUM
              PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT
              PERFORM 611-MOD-MSG THRU 611-EXIT
           ELSE
      *M****************************************************************
      *M  Message Set: 00    Number: 006
      *M  F8 TO CONFIRM DELETE
      *M****************************************************************
              MOVE 00             TO CATREAD-MSG-SET
              MOVE 06             TO CATREAD-MSG-NUM
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT
              PERFORM 612-DEL-MSG THRU 612-EXIT.

       61-EXIT.
           EXIT.

       610-EDT-UPD.
           IF DISP-MSG-CODE = SPACES
      *M****************************************************************
      *M   Message Set: 03   Number: 103
      *M   CODE IS A REQUIRED FIELD
      *M****************************************************************
              MOVE    3        TO CATREAD-MSG-SET
              MOVE  103        TO CATREAD-MSG-NUM
              PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT
              GO TO 610-PUT-BUFFER.

           MOVE DISP-MSG-CODE TO MSGCODE OF MASBMSG-REC.
           START MASBMSG KEY NOT < MSGCODE OF MASBMSG-REC
             INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
              MOVE "START ERR MASBMSG 610-EDTUPD" TO BU-DISPLAY-MSG
              MOVE  DISP-MSG-CODE                 TO BU-DISPLAY-FLD (1)
              PERFORM 2-BLOWUP.
           MOVE 0 TO COND-WORD.

           PERFORM 34-READ-MASBMSG THRU 34-EXIT.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS = "10" OR "14" OR "46"
                 NEXT SENTENCE
              ELSE
                 MOVE "READNXT ERR MASBMSG 610-EDTUPD" TO BU-DISPLAY-MSG
                 MOVE DISP-MSG-CODE                 TO BU-DISPLAY-FLD(1)
                 PERFORM 2-BLOWUP.

           IF ASB-MSG-CODE NOT = DISP-MSG-CODE
      *M****************************************************************
      *M   Message Set: 29   Number: 083
      *M   CODE DOES NOT EXIST
      *M****************************************************************
              MOVE   29        TO CATREAD-MSG-SET
              MOVE  083        TO CATREAD-MSG-NUM
              PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT
              GO TO 610-PUT-BUFFER.
      *-----SUCCESSFULLY PASSED ALL EDITS, EXIT PARAGRAPH
           GO TO 610-EXIT.

       610-PUT-BUFFER.
           MOVE WS-SCREEN TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE THRU 99-EXIT.
           PERFORM 98-SCREEN-READ  THRU 98-EXIT.
           MOVE DSPLY-REC TO WS-SCREEN.

           IF VIEW-LASTKEY = 3 OR 6 OR 1 OR 2
              GO TO 610-EXIT
           ELSE IF VIEW-LASTKEY = 7 OR 8
              GO TO 610-EDT-UPD
           ELSE
      *-----TURN ON IND TO DISPLAY PREVIOUS MESSAGE IF IND IS OFF
              IF INDS (99) = B"0"
                 MOVE B"1" TO INDS (99)
              END-IF
              GO TO 610-PUT-BUFFER.

       610-EXIT.
           EXIT.

       611-MOD-MSG.
           MOVE WS-SCREEN TO DSPLY-REC.
           MOVE B"1" TO INDS (10).
           PERFORM 99-SCREEN-WRITE THRU 99-EXIT.
           PERFORM 98-SCREEN-READ  THRU 98-EXIT.
           MOVE DSPLY-REC TO WS-SCREEN.

           IF VIEW-LASTKEY = 3 OR 6 OR 8 OR 1 OR 2
              GO TO 611-EXIT
           ELSE IF VIEW-LASTKEY = 7
              NEXT SENTENCE
           ELSE
      *-----TURN ON IND TO DISPLAY PREVIOUS MESSAGE IF IND IS OFF
              IF INDS (99) = B"0"
                 MOVE B"1" TO INDS (99)
              END-IF
              GO TO 611-MOD-MSG.

           IF  DISP-MESSAGE1 = SPACES
           AND DISP-MESSAGE2 = SPACES
           AND DISP-MESSAGE3 = SPACES
           AND DISP-MESSAGE4 = SPACES
           AND DISP-MESSAGE5 = SPACES
      *M****************************************************************
      *M   Message Set: 39   Number: 018
      *M   MESSAGE IS REQUIRED
      *M****************************************************************
               MOVE   39        TO CATREAD-MSG-SET
               MOVE  018        TO CATREAD-MSG-NUM
               PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
               PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT
               GO TO 611-MOD-MSG.

           MOVE SPACES TO BUF-MASBMSG MASBMSG-REC.
           MOVE DISP-MSG-CODE TO MSGCODE OF MASBMSG-REC.
           START MASBMSG KEY NOT < MSGCODE OF MASBMSG-REC
             INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
              MOVE "START ERR MASBMSG 611-MODMSG" TO BU-DISPLAY-MSG
              MOVE  DISP-MSG-CODE                 TO BU-DISPLAY-FLD (1)
              PERFORM 2-BLOWUP.
           MOVE 0 TO COND-WORD.

           PERFORM 31-READ-NEXT-MASBMSG THRU 31-EXIT.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS = "10" OR "14" OR "46"
                 NEXT SENTENCE
              ELSE
                 MOVE "READ NXT ERR MASBMSG 611-MODMG" TO BU-DISPLAY-MSG
                 MOVE DISP-MSG-CODE                 TO BU-DISPLAY-FLD(1)
                 PERFORM 2-BLOWUP.

           IF ASB-MSG-CODE NOT = DISP-MSG-CODE
              MOVE "CODE DEL BEFORE UPD 611-MODMSG" TO BU-DISPLAY-MSG
              MOVE DISP-MSG-CODE                    TO BU-DISPLAY-FLD(1)
              PERFORM 2-BLOWUP.

           MOVE DISP-MSG-CODE TO ASB-MSG-CODE.
           MOVE DISP-MESSAGE1 TO ASB-MESSAGE1.
           MOVE DISP-MESSAGE2 TO ASB-MESSAGE2.
           MOVE DISP-MESSAGE3 TO ASB-MESSAGE3.
           MOVE DISP-MESSAGE4 TO ASB-MESSAGE4.
           MOVE DISP-MESSAGE5 TO ASB-MESSAGE5.

           REWRITE MASBMSG-REC FROM BUF-MASBMSG
             INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              MOVE "MODIFY ERR 611-MODMSG" TO BU-MSG-AREA
              MOVE DISP-MSG-CODE           TO BU-DISPLAY-FLD (1)
              MOVE 99 TO COND-WORD
              PERFORM 2-BLOWUP.
           MOVE "Y" TO FUNC-COMP-SW.

       611-EXIT.
           EXIT.

       612-DEL-MSG.
           MOVE "N" TO LOCK-SW.
           MOVE WS-SCREEN TO DSPLY-REC.
           MOVE B"1" TO INDS (10) INDS (11).
           PERFORM 99-SCREEN-WRITE THRU 99-EXIT.
           PERFORM 98-SCREEN-READ  THRU 98-EXIT.
           MOVE DSPLY-REC TO WS-SCREEN.

           IF VIEW-LASTKEY = 3 OR 6 OR 7 OR 1 OR 2
              GO TO 612-EXIT
           ELSE IF VIEW-LASTKEY = 8
              NEXT SENTENCE
           ELSE
      *-----TURN ON IND TO DISPLAY PREVIOUS MESSAGE IF IND IS OFF
              IF INDS (99) = B"0"
                 MOVE B"1" TO INDS (99)
              END-IF
              GO TO 612-DEL-MSG.

           MOVE SPACES TO BUF-MASBMSG MASBMSG-REC.
           MOVE DISP-MSG-CODE TO MSGCODE OF MASBMSG-REC.
           START MASBMSG KEY NOT < MSGCODE OF MASBMSG-REC
             INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
              MOVE "START ERR MASBMSG 612-DELMSG" TO BU-DISPLAY-MSG
              MOVE  DISP-MSG-CODE                 TO BU-DISPLAY-FLD (1)
              PERFORM 2-BLOWUP.
           MOVE 0 TO COND-WORD.

           PERFORM 31-READ-NEXT-MASBMSG THRU 31-EXIT.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS = "10" OR "14" OR "46"
                 NEXT SENTENCE
              ELSE
                 MOVE "READNXT ERR MASBMSG 612-DELMSG" TO BU-DISPLAY-MSG
                 MOVE DISP-MSG-CODE                 TO BU-DISPLAY-FLD(1)
                 PERFORM 2-BLOWUP.

           IF ASB-MSG-CODE NOT = DISP-MSG-CODE
              MOVE "CODE ALREADY DEL -  612-DELMSG" TO BU-DISPLAY-MSG
              MOVE DISP-MSG-CODE                    TO BU-DISPLAY-FLD(1)
              PERFORM 2-BLOWUP.

           DELETE MASBMSG RECORD.
           IF FILE-STATUS NOT = "00"
              MOVE "DELETE ERR 612-DELMSG" TO BU-MSG-AREA
              MOVE DISP-MSG-CODE           TO BU-DISPLAY-FLD (1)
              MOVE 99 TO COND-WORD
              PERFORM 2-BLOWUP.
           MOVE "Y" TO FUNC-COMP-SW.

       612-EXIT.
           EXIT.

       62-NXT-MSG.
           MOVE "Y" TO CLEAR-SW.
           PERFORM 31-READ-NEXT-MASBMSG THRU 31-EXIT.
           IF FILE-STATUS = "00"
              NEXT SENTENCE
           ELSE
              PERFORM 30-READ-FIRST-MASBMSG THRU 30-EXIT
              IF FILE-STATUS = "00" OR "10"
                 NEXT SENTENCE
              ELSE
                 MOVE "READ FIRST ERR 62-NXT-MSG" TO BU-DISPLAY-MSG
                 MOVE  DISP-MSG-CODE              TO BU-DISPLAY-FLD (1)
                 PERFORM 2-BLOWUP.
           MOVE 0 TO COND-WORD.
      *-----NOW EITHER HAVE NEXT RECORD, FIRST RECORD IN DATABASE,
      *-----OR EMPTY DATABASE
           IF FILE-STATUS NOT = "00"
              MOVE "N" TO LOCK-SW
              MOVE "N" TO CLEAR-SW
              MOVE SPACES TO WS-SCREEN
           ELSE
              MOVE "Y" TO LOCK-SW
              MOVE ASB-MSG-CODE TO DISP-MSG-CODE
              MOVE ASB-MESSAGE1 TO DISP-MESSAGE1
              MOVE ASB-MESSAGE2 TO DISP-MESSAGE2
              MOVE ASB-MESSAGE3 TO DISP-MESSAGE3
              MOVE ASB-MESSAGE4 TO DISP-MESSAGE4
              MOVE ASB-MESSAGE5 TO DISP-MESSAGE5.

       62-PUT-BUFFER.
           IF LOCK-SW = "Y"
              MOVE B"1" TO INDS (10) INDS (11).
           MOVE WS-SCREEN TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE THRU 99-EXIT.
           PERFORM 98-SCREEN-READ  THRU 98-EXIT.
           MOVE DSPLY-REC TO WS-SCREEN.

           IF VIEW-LASTKEY = 3 OR 6 OR 7 OR 8 OR 1
              GO TO 62-EXIT
           ELSE IF VIEW-LASTKEY = 2
              GO TO 62-NXT-MSG
           ELSE GO TO 62-PUT-BUFFER.

       62-EXIT.
           EXIT.

       63-PRV-MSG.
           MOVE "Y" TO CLEAR-SW.
           PERFORM 32-READ-PREV-MASBMSG THRU 32-EXIT.
           IF FILE-STATUS = "00"
              NEXT SENTENCE
           ELSE
              PERFORM 33-READ-LAST-MASBMSG THRU 33-EXIT
              IF FILE-STATUS = "00" OR "10"
                 NEXT SENTENCE
              ELSE
                 MOVE "READ LAST ERR 63-PRV-MSG" TO BU-DISPLAY-MSG
                 MOVE  DISP-MSG-CODE             TO BU-DISPLAY-FLD (1)
                 PERFORM 2-BLOWUP.
           MOVE 0 TO COND-WORD.
      *-----NOW EITHER HAVE NEXT RECORD, LAST RECORD IN DATABASE,
      *-----OR EMPTY DATABASE
           IF FILE-STATUS NOT = "00"
              MOVE "N" TO LOCK-SW
              MOVE "N" TO CLEAR-SW
              MOVE SPACES TO WS-SCREEN
           ELSE
              MOVE "Y" TO LOCK-SW
              MOVE ASB-MSG-CODE TO DISP-MSG-CODE
              MOVE ASB-MESSAGE1 TO DISP-MESSAGE1
              MOVE ASB-MESSAGE2 TO DISP-MESSAGE2
              MOVE ASB-MESSAGE3 TO DISP-MESSAGE3
              MOVE ASB-MESSAGE4 TO DISP-MESSAGE4
              MOVE ASB-MESSAGE5 TO DISP-MESSAGE5.

       63-PUT-BUFFER.
           IF LOCK-SW = "Y"
              MOVE B"1" TO INDS (10) INDS (11).
           MOVE WS-SCREEN TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE THRU 99-EXIT.
           PERFORM 98-SCREEN-READ  THRU 98-EXIT.
           MOVE DSPLY-REC TO WS-SCREEN.

           IF VIEW-LASTKEY = 3 OR 6 OR 7 OR 8 OR 2
              GO TO 63-EXIT
           ELSE IF VIEW-LASTKEY = 1
              GO TO 63-PRV-MSG
           ELSE GO TO 63-PUT-BUFFER.

       63-EXIT.
           EXIT.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDICATORS ARE INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF FILE-STATUS NOT = "00"
             MOVE 3 TO VIEW-LASTKEY
           ELSE
             MOVE FUNCTION-NUM TO VIEW-LASTKEY.
       98-EXIT.
           EXIT.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-NFNAME
               INDICATORS ARE INDICS.
       99-EXIT.
           EXIT.

       999-CATREAD.
           MOVE SPACES TO MESSAGE-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.
           EXIT.

       9999-MOVE-CATREAD-MSG.
            MOVE B"1" TO INDS (99).
            IF CATREAD-MSG-TEXT = SPACES
               MOVE DEFAULT-MESSAGE TO DISP-MESSAGE-LINE
            ELSE
               MOVE MESSAGE-BUFFER  TO DISP-MESSAGE-LINE
            END-IF.
            MOVE SPACES TO MESSAGE-BUFFER.

       9999-EXIT.
            EXIT.
