       IDENTIFICATION DIVISION.
       PROGRAM-ID.     TASNBUYR.
       AUTHOR.         ANNETTE M. KRAUSS.
       DATE-WRITTEN.   MAY 30, 1986.
       DATE-COMPILED.
      *REMARKS.
      *************************************************************
      *************************************************************
      *D                    TASNBUYR                              *
      *D                                                          *
      *D        THIS PROGRAM WILL ASSIGN A VALID BUYER CODE       *
      *D        TO A CORPORATE CODE MAJOR GROUP OR CLASS OR       *
      *D        TO ANOTHER BUYER CODE.                            *
      *D                                                          *
      *************************************************************
      *************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.    IBM-AS400.
       OBJECT-COMPUTER.    IBM-AS400.
       SPECIAL-NAMES.      C01 IS NEW-PAGE.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.
           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-O
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MBUYER-I
                  ASSIGN TO DATABASE-MCFLCS0601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-I-REC.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  MSTORERM-O
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-O-REC.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  MBUYER-I
           LABEL RECORDS ARE STANDARD.
       01  MBUYER-I-REC.
           COPY DDS-MCRPCS0600  OF MCFLCS0601.

       FD  PRINT-FILE
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 132 CHARACTERS
           DATA RECORD IS PRINT-REC.
       01  PRINT-REC             PIC X(132).

       WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
       01  PAGE-NUM                   PIC 9(3)   VALUE 0.
       01  PLANT-NUMBER               PIC X(3)   VALUE SPACES.
       01  TBL-INDEX                  PIC 9(2)   VALUE ZERO.
       01  MSG-LINE                   PIC X(132) VALUE SPACES.
       01  NO-BUYER-CODE-EXISTS.
           05  FILLER                 PIC X(11)  VALUE
               "BUYER CODE ".
           05  NO-BUYER-CODE          PIC X(4).
           05  FILLER                 PIC X(118) VALUE
               " DOES NOT EXIST IN CSIS DATABASE|||||".
       01  NO-OPTION                  PIC X(132) VALUE
           "NO OPTION WAS CHOSEN FOR THE BUYER CODE ASSIGNMENT".
       01  SUCCESSFUL-COMPLETION.
           05  FILLER                 PIC X(11)  VALUE
               "BUYER CODE ".
           05  BUYER-CODE-OUT         PIC X(4).
           05  FILLER                 PIC X(35)  VALUE
               " HAS BEEN SUCCESSFULLY ASSIGNED TO ".
           05  OPTION-OUT             PIC X(15).
           05  TBL-OUT                PIC X(63)  VALUE SPACES.
           05  MAJOR-GROUPS-OUT REDEFINES TBL-OUT
                             OCCURS 9 TIMES.
               10  M-G-F-OUT          PIC X(2).
               10  DASH-OUT           PIC X(1).
               10  M-G-T-OUT          PIC X(2).
               10  FILLER             PIC X(2).
           05  CLASSES-OUT REDEFINES TBL-OUT.
               10  CLASS-OUT-TBL OCCURS 8 TIMES.
                 15  CLASS-OUT        PIC X(3).
                 15  FILLER           PIC X(2).
               10  FILLER             PIC X(23).
           05  BUYER-CODES-OUT REDEFINES TBL-OUT.
               10 BUYR-CODES-TBL OCCURS 4 TIMES.
                  15  BUYR-OUT        PIC X(4).
                  15  FILLER          PIC X(2).
               10  FILLER             PIC X(39).
           05  FILLER                 PIC X(3)   VALUE SPACES.

       01  WS-FLAGS.
           05  MAJOR-GROUPS-FLAG       PIC X(3)  VALUE "NO".
           05  CLASS-FLAG              PIC X(3)  VALUE "NO".
           05  BUYER-CODE-FLAG         PIC X(3)  VALUE "NO".

      *-------------- ESCAPE SEQUENCES
       COPY ESCNAM2 IN COPYLIB.

       01  COMPRESS-PRINT              PIC X(8).

       01  NORMAL-PRINT                PIC X(8).

       01  ESC-TEXT-61                 PIC X(8).
       COPY OVRPFDATA IN COPYLIB.
       COPY CCHKOBJ   IN COPYLIB.


       COPY TBLOWUP  IN COPYLIB.
       01  VIEW-COMAREA.
           05  FILLER                  PIC X(118)  VALUE ALL "0".
           05  FILLER                  PIC S9(4)   COMP VALUE 9999.

      *---------- PARMS FOR CALL TO "THDPRT2" - HEADER PAGE SUBPROG.
       01  HD-RET-CODE                 PIC S9(4) COMP VALUE 0.
       01  HD-FILE-NAME                PIC X(17) VALUE SPACES.
       01  FNUM                        PIC S9(4) COMP VALUE 0.

       COPY TDATECHK IN COPYLIB.

      *------------- PRINT AREAS
       01  PRINT-LINE                 PIC X(132)  VALUE SPACES.

       01  HEAD1 REDEFINES PRINT-LINE.
           05  FILLER                 PIC X(28).
           05  HEAD1-TITLE1           PIC X(38).
           05  HEAD1-TITLE2           PIC X(38).
           05  FILLER                 PIC X(28).

       01  HEAD2 REDEFINES PRINT-LINE.
           05  FILLER                 PIC X(1).
           05  HEAD2-DATE             PIC X(8).
           05  FILLER                 PIC X(5).
           05  HEAD2-TIME             PIC X(8).
           05  FILLER                 PIC X(98).
           05  HEAD2-PAGE             PIC X(5).
           05  HEAD2-PAGE-NO          PIC Z,ZZ9.
           05  FILLER                 PIC X(2).

       01  HEAD3 REDEFINES PRINT-LINE.
           05  FILLER                 PIC X(45).
           05  HEAD3-TITLE            PIC X(36).
           05  HEAD3-PLANT            PIC X(3).
           05  FILLER                 PIC X(48).

      *------------- DATABASE AREA
       COPY DATAB IN COPYLIB.

       01  DSET-NAME-AREA.
           05  DSET-NAME               PIC X(16)  VALUE SPACES.
           05  DSET-MSTORERM           PIC X(16)  VALUE "MSTORERM;".
           05  DSET-MBUYER             PIC X(16)  VALUE "MBUYER;".
           05  DSET-MPLTINFO           PIC X(16)  VALUE "MPLTINFO;".

       01  SEARCH-ITEMS.
           05  ALL-ITEMS               PIC X(2)   VALUE "@;".

       01  DATABASE-ARGS.
           05  BUYER-ARG               PIC X(4)   VALUE SPACES.
           05  DUMMY-ARG               PIC X(50)  VALUE SPACES.
           05  PLT-ARG                 PIC X(4)   VALUE "P 01".

      *------------- DATABASE BUFFERS
       COPY MSTORERM IN COPYLIB.
       COPY MBUYER   IN COPYLIB.
       COPY MPLTINFO IN COPYLIB.

      *------------- LINKAGE SECTION
       LINKAGE SECTION.
       COPY THDPRTB IN COPYLIB.
       01  DATA-LINE.
           05  BUYER-CODE-IN           PIC X(4).
           05  OPTION-MAJOR-GROUPS.
               10  GROUP1-FROM         PIC X(2).
               10  GROUP1-TO           PIC X(2).
               10  GROUP2-FROM         PIC X(2).
               10  GROUP2-TO           PIC X(2).
               10  GROUP3-FROM         PIC X(2).
               10  GROUP3-TO           PIC X(2).
               10  GROUP4-FROM         PIC X(2).
               10  GROUP4-TO           PIC X(2).
               10  GROUP5-FROM         PIC X(2).
               10  GROUP5-TO           PIC X(2).
               10  GROUP6-FROM         PIC X(2).
               10  GROUP6-TO           PIC X(2).
               10  GROUP7-FROM         PIC X(2).
               10  GROUP7-TO           PIC X(2).
               10  GROUP8-FROM         PIC X(2).
               10  GROUP8-TO           PIC X(2).
               10  GROUP9-FROM         PIC X(2).
               10  GROUP9-TO           PIC X(2).
           05  OPTION-GROUPS-TBL REDEFINES OPTION-MAJOR-GROUPS
                           OCCURS 9 TIMES.
                10  GROUP-FROM         PIC X(2).
                10  GROUP-TO           PIC X(2).
           05  OPTION-CLASS.
               10  CLASS1              PIC X(3).
               10  CLASS2              PIC X(3).
               10  CLASS3              PIC X(3).
               10  CLASS4              PIC X(3).
               10  CLASS5              PIC X(3).
               10  CLASS6              PIC X(3).
               10  CLASS7              PIC X(3).
               10  CLASS8              PIC X(3).
           05  OPTION-CLASS-TBL REDEFINES OPTION-CLASS
                           OCCURS 8 TIMES.
               10  CLASSX              PIC X(3).
           05  OPTION-BUYER-CODE.
               10  BUYER1              PIC X(4).
               10  BUYER2              PIC X(4).
               10  BUYER3              PIC X(4).
               10  BUYER4              PIC X(4).
           05  OPTION-BUYER-TBL REDEFINES OPTION-BUYER-CODE
                           OCCURS 4 TIMES.
               10  BUYERX              PIC X(4).
           05  FILLER                  PIC X(32).


      *************************************************************
      *************************************************************
      *           P R O C E D U R E     D I V I S I O N           *
      *************************************************************
      *************************************************************
       PROCEDURE DIVISION USING HD-ROUTE-DATA, DATA-LINE.
       00-BEGIN-HERE.
           PERFORM 10-OPEN-FILES     THRU 10-EXIT.
           PERFORM 30-GET-PARAMETERS THRU 30-EXIT.
           PERFORM 60-MAIN           THRU 60-EXIT.
           PERFORM 70-PRINT-RPT      THRU 70-EXIT.
           PERFORM 20-CLOSE-FILES    THRU 20-EXIT.
           GOBACK.


       10-OPEN-FILES.
           MOVE "TASNBUYR"                 TO BU-PGM-NAME.
           OPEN INPUT MPLTINFO-I, MBUYER-I.
           OPEN I-O   MSTORERM-O.

       10-EXIT.  EXIT.

       20-CLOSE-FILES.
           CLOSE MPLTINFO-I, MSTORERM-O, MBUYER-I, PRINT-FILE.

       20-EXIT.  EXIT.

      *************************************************************
      *                    BLOWUP   ROUTINE                       *
      *************************************************************
       2-BLOWUP.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
                 VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                 BU-DISPLAY-AREA.

      *************************************************************
      *************************************************************
      *   ACCEPT TWO LINES OF DATA: 1) ALL HEADER INFORMATION -   *
      *     WHO AND WHERE THIS REPORT WILL BE ROUTED TO  2) A     *
      *     BUYER CODE AND A RANGE(S) OF CORP. CODE GROUPS OR     *
      *     CLASSES OR BUYER CODES.                               *
      *                                                           *
      *************************************************************
      *************************************************************
       30-GET-PARAMETERS.
           MOVE BUYER-CODE-IN TO BUYER-CODE-OUT, NO-BUYER-CODE.
           MOVE 1 TO TBL-INDEX.

           IF GROUP1-FROM NOT = SPACES
              MOVE "MAJOR GROUPS :" TO OPTION-OUT
              PERFORM 61-LOAD-GROUPS UNTIL TBL-INDEX > 9
              MOVE "YES" TO MAJOR-GROUPS-FLAG
           ELSE
           IF CLASS1 NOT = SPACES
              MOVE "CLASSES :" TO OPTION-OUT
              PERFORM 61-LOAD-CLASSES UNTIL TBL-INDEX > 8
              MOVE "YES" TO CLASS-FLAG
           ELSE
           IF BUYER1 NOT = SPACES
              MOVE "BUYERS :" TO OPTION-OUT
              PERFORM 61-LOAD-BUYERS UNTIL TBL-INDEX > 4
              MOVE "YES" TO BUYER-CODE-FLAG.

           MOVE HD-SPOOLER-NUMBER       TO  OVRPRTF-TOFILE-NUM.
           MOVE "*YES"                  TO  OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES         TO  OVRPRTF-COPIES.
           MOVE "MCPRT"                 TO  OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.

           OPEN OUTPUT PRINT-FILE.
           MOVE "DHDR19.PUB"   TO HD-FILE-NAME.
           CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM,
               HD-ROUTE-DATA, ESC-NAME.
           IF HD-RET-CODE NOT = 0
               MOVE "THDPRT2 ERROR * TASNBUYR" TO BU-DISPLAY-MSG
               MOVE "HD-RET-CODE = "           TO BU-DISPLAY-FLD (1)
               MOVE HD-RET-CODE                TO BU-DISPLAY-FLD9 (1)
               PERFORM 2-BLOWUP.

      *------------- GET RECORD FOR PLANT NUMBER
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-I-REC.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ ERROR IN 010-OPEN-FILES"
                   TO BU-DISPLAY-MSG
               MOVE "P 01" TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.
           MOVE MPLTINFO-COMPANY TO PLANT-NUMBER.

           MOVE CHAR-1636PI     TO COMPRESS-PRINT.
           MOVE CHAR-10PI       TO NORMAL-PRINT.

       30-EXIT.  EXIT.

       60-MAIN.
           MOVE BUYER-CODE-IN TO BUYER-ARG.
           MOVE BUYER-ARG TO BUYERCDE OF MBUYER-I-REC.
           READ MBUYER-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE NO-BUYER-CODE-EXISTS TO MSG-LINE
                   GO TO 60-EXIT
               ELSE
                   MOVE "DBGET MBUYER ERROR IN 60-MAIN"
                       TO BU-DISPLAY-MSG
                   PERFORM 2-BLOWUP.

           IF MAJOR-GROUPS-FLAG = "YES"
               PERFORM 61-MAJOR-GROUPS THRU 61-EXIT
               MOVE SUCCESSFUL-COMPLETION TO MSG-LINE
           ELSE
           IF CLASS-FLAG = "YES"
               PERFORM 62-CLASSES THRU 62-EXIT
               MOVE SUCCESSFUL-COMPLETION TO MSG-LINE
           ELSE
           IF BUYER-CODE-FLAG = "YES"
               PERFORM 63-BUYER-CODES THRU 63-EXIT
               MOVE SUCCESSFUL-COMPLETION TO MSG-LINE
           ELSE
               MOVE NO-OPTION TO MSG-LINE.

       60-EXIT.  EXIT.

       61-MAJOR-GROUPS.
           READ MSTORERM-O NEXT INTO BUF-MSTORERM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "1"
                   GO TO 61-EXIT
               ELSE
                   MOVE "READN MSTORERM IN 61-MAJOR-GROUPS"
                       TO BU-DISPLAY-MSG
                   PERFORM 2-BLOWUP.

           IF (CORP-CODE-1-2 IS = GROUP1-FROM OR > GROUP1-FROM) AND
              (CORP-CODE-1-2 IS = GROUP1-TO   OR < GROUP1-TO)
               IF BUYER-CODE-IN NOT = STR-BUYER
                    PERFORM 6X-REPLACE-MSTORERM THRU 6X-EXIT
               ELSE
                   NEXT SENTENCE
           ELSE
           IF (CORP-CODE-1-2 IS = GROUP2-FROM OR > GROUP2-FROM) AND
              (CORP-CODE-1-2 IS = GROUP2-TO   OR < GROUP2-TO)
               IF BUYER-CODE-IN NOT = STR-BUYER
                    PERFORM 6X-REPLACE-MSTORERM THRU 6X-EXIT
               ELSE
                   NEXT SENTENCE
           ELSE
           IF (CORP-CODE-1-2 IS = GROUP3-FROM OR > GROUP3-FROM) AND
              (CORP-CODE-1-2 IS = GROUP3-TO   OR < GROUP3-TO)
               IF BUYER-CODE-IN NOT = STR-BUYER
                    PERFORM 6X-REPLACE-MSTORERM THRU 6X-EXIT
               ELSE
                   NEXT SENTENCE
           ELSE
           IF (CORP-CODE-1-2 IS = GROUP4-FROM OR > GROUP4-FROM) AND
              (CORP-CODE-1-2 IS = GROUP4-TO   OR < GROUP4-TO)
               IF BUYER-CODE-IN NOT = STR-BUYER
                    PERFORM 6X-REPLACE-MSTORERM THRU 6X-EXIT
               ELSE
                   NEXT SENTENCE
           ELSE
           IF (CORP-CODE-1-2 IS = GROUP5-FROM OR > GROUP5-FROM) AND
              (CORP-CODE-1-2 IS = GROUP5-TO   OR < GROUP5-TO)
               IF BUYER-CODE-IN NOT = STR-BUYER
                    PERFORM 6X-REPLACE-MSTORERM THRU 6X-EXIT
               ELSE
                   NEXT SENTENCE
           ELSE
           IF (CORP-CODE-1-2 IS = GROUP6-FROM OR > GROUP6-FROM) AND
              (CORP-CODE-1-2 IS = GROUP6-TO   OR < GROUP6-TO)
               IF BUYER-CODE-IN NOT = STR-BUYER
                    PERFORM 6X-REPLACE-MSTORERM THRU 6X-EXIT
               ELSE
                   NEXT SENTENCE
           ELSE
           IF (CORP-CODE-1-2 IS = GROUP7-FROM OR > GROUP7-FROM) AND
              (CORP-CODE-1-2 IS = GROUP7-TO   OR < GROUP7-TO)
               IF BUYER-CODE-IN NOT = STR-BUYER
                    PERFORM 6X-REPLACE-MSTORERM THRU 6X-EXIT
               ELSE
                   NEXT SENTENCE
           ELSE
           IF (CORP-CODE-1-2 IS = GROUP8-FROM OR > GROUP8-FROM) AND
              (CORP-CODE-1-2 IS = GROUP8-TO   OR < GROUP8-TO)
               IF BUYER-CODE-IN NOT = STR-BUYER
                    PERFORM 6X-REPLACE-MSTORERM THRU 6X-EXIT
               ELSE
                   NEXT SENTENCE
           ELSE
           IF (CORP-CODE-1-2 IS = GROUP9-FROM OR > GROUP9-FROM) AND
              (CORP-CODE-1-2 IS = GROUP9-TO   OR < GROUP9-TO)
               IF BUYER-CODE-IN NOT = STR-BUYER
                    PERFORM 6X-REPLACE-MSTORERM THRU 6X-EXIT.

           GO TO 61-MAJOR-GROUPS.

       61-EXIT.  EXIT.

       61-LOAD-GROUPS.
           MOVE GROUP-FROM (TBL-INDEX) TO M-G-F-OUT (TBL-INDEX).
           MOVE "-"                    TO DASH-OUT (TBL-INDEX).
           MOVE GROUP-TO (TBL-INDEX)   TO M-G-T-OUT (TBL-INDEX).
           ADD  1           TO TBL-INDEX.

       61-LOAD-CLASSES.
           MOVE CLASSX (TBL-INDEX) TO CLASS-OUT (TBL-INDEX).
           ADD  1           TO TBL-INDEX.

       61-LOAD-BUYERS.
           MOVE BUYERX (TBL-INDEX) TO BUYR-OUT (TBL-INDEX).
           ADD  1           TO TBL-INDEX.


       62-CLASSES.
           READ MSTORERM-O NEXT INTO BUF-MSTORERM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "1"
                   GO TO 62-EXIT
               ELSE
                   MOVE "READN MSTORERM IN 62-CLASSES"
                       TO BU-DISPLAY-MSG
                   PERFORM 2-BLOWUP.


           IF (ST-CLASS = CLASS1 AND CLASS1 NOT = SPACES)
             OR (ST-CLASS = CLASS2 AND CLASS2 NOT = SPACES)
             OR (ST-CLASS = CLASS3 AND CLASS3 NOT = SPACES)
             OR (ST-CLASS = CLASS4 AND CLASS4 NOT = SPACES)
             OR (ST-CLASS = CLASS5 AND CLASS5 NOT = SPACES)
             OR (ST-CLASS = CLASS6 AND CLASS6 NOT = SPACES)
             OR (ST-CLASS = CLASS7 AND CLASS7 NOT = SPACES)
             OR (ST-CLASS = CLASS8 AND CLASS8 NOT = SPACES)
               IF BUYER-CODE-IN NOT = STR-BUYER
                   PERFORM 6X-REPLACE-MSTORERM THRU 6X-EXIT.

           GO TO 62-CLASSES.

       62-EXIT.  EXIT.

       63-BUYER-CODES.
           READ MSTORERM-O NEXT INTO BUF-MSTORERM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "1"
                   GO TO 63-EXIT
               ELSE
                   MOVE "READN MSTORERM IN 63-BUYER-CODES"
                       TO BU-DISPLAY-MSG
                   PERFORM 2-BLOWUP.

           IF (STR-BUYER = BUYER1 AND BUYER1 NOT = SPACES)
             OR (STR-BUYER = BUYER2 AND BUYER2 NOT = SPACES)
             OR (STR-BUYER = BUYER3 AND BUYER3 NOT = SPACES)
             OR (STR-BUYER = BUYER4 AND BUYER4 NOT = SPACES)
               IF BUYER-CODE-IN NOT = STR-BUYER
                   PERFORM 6X-REPLACE-MSTORERM THRU 6X-EXIT.

           GO TO 63-BUYER-CODES.

       63-EXIT.  EXIT.

       6X-REPLACE-MSTORERM.
           MOVE BUYER-CODE-IN TO STR-BUYER.
           REWRITE MSTORERM-O-REC FROM BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
                MOVE "REWRITE ERROR IN 6X-REPLACE-MSTORERM"
                    TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

       6X-EXIT.  EXIT.

       70-PRINT-RPT.
           IF PAPER-IS-132-COLS
               NEXT SENTENCE
           ELSE
              WRITE PRINT-REC FROM COMPRESS-PRINT AFTER ADVANCING 0.

           MOVE SPACES                TO PRINT-LINE.
           ADD 1                      TO PAGE-NUM.
           MOVE "G O O D Y E A R   C O R P O R A T E   "
                                      TO HEAD1-TITLE1.
           MOVE " I N F O R M A T I O N   S Y S T E M"
                                      TO HEAD1-TITLE2.
           WRITE PRINT-REC FROM PRINT-LINE AFTER ADVANCING NEW-PAGE.
           MOVE SPACES                TO PRINT-LINE.

           MOVE 1                     TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-FORMATTED-TIME-OUT TO HEAD2-TIME.
           MOVE DATE-SLASH-OUT        TO HEAD2-DATE.
           MOVE "PAGE "               TO HEAD2-PAGE.
           MOVE PAGE-NUM              TO HEAD2-PAGE-NO.
           WRITE PRINT-REC FROM PRINT-LINE AFTER ADVANCING 1 LINES.
           MOVE SPACES                TO PRINT-LINE.
           MOVE "       ASSIGN BUYER CODES  -  PLANT "
                                      TO HEAD3-TITLE.
           MOVE PLANT-NUMBER          TO HEAD3-PLANT.
           WRITE PRINT-REC FROM PRINT-LINE AFTER ADVANCING 1 LINES.
           MOVE SPACES                 TO PRINT-LINE.
           MOVE MSG-LINE               TO PRINT-LINE.
           WRITE PRINT-REC FROM PRINT-LINE AFTER ADVANCING 4 LINES.

       70-EXIT.  EXIT.
       COPY OVRPFCALL IN COPYLIB.
