       IDENTIFICATION DIVISION.
       PROGRAM-ID.  TBADPATH.
       AUTHOR.        C HILLES.
      *INSTALLATION.  GOODYEAR TIRE & RUBBER CO.
      *DATE-WRITTEN.  FEBRUARY, 1983.
      *REMARKS.   THIS PROGRAM CALLS 'CEACHKPH' AND 'CEAFIXPH' TO CHECK
      *           FOR AND FIX REQS WITH BAD PATHS.
      *C
      *C   08JUN2001  DAVE PLUM
      *C    RECOMPILED TO PICK UP TABLE SIZE CHANGE IN COPYLIB
      *C    MEMBER CEACHKPH.
      *C
      *C   08JUN2001  DAVE PLUM
      *C    REVERTED BACK TO A TABLE SIZE OF 12 - RECOMPILED AGAIN.
      *C
      *C   22JUL2004  BRUCE GEISER
      *C    PREVENT DISPLAYING BLANK LINES TO SPEED UP PROGRAM.
      *C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.    HP-3000.
       OBJECT-COMPUTER.    HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MREQ-RQ-I
               ASSIGN TO DATABASE-MCFLCS2001
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       FD  MREQ-RQ-I
           LABEL RECORDS ARE STANDARD.
       01  MREQ-RQ-REC-I.
           COPY DDS-MCRPCS2000  OF MCFLCS2001.


      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       WORKING-STORAGE SECTION.

       77  PASSWORD                      PIC X(16) VALUE "JADE;".
       77  PASSWORD-MMIS                 PIC X(16) VALUE "DO-ALL;".
       77  BASE                          PIC X(10) VALUE "  STORES;".
       77  BASE-MMIS                     PIC X(10) VALUE "  MMISA;".
       77  BASE-BUDGET                   PIC X(10) VALUE "  BUDGET;".
       77  BASE-DUMMY                    PIC X(10) VALUE SPACES.
       77  REQ-ARG                       PIC X(12) VALUE SPACES.
       77  DSET-MREQ                     PIC X(16) VALUE "MREQ;".
       77  ALL-ITEMS                     PIC X(2)  VALUE "@;".
       77  FIX-FLAG                      PIC X(1).
       01  ERROR-BUF                     PIC X(72) VALUE SPACES.
       01  ERROR-LEN                     PIC S9(4) BINARY VALUE 0.
       01  SUB                           PIC 9(2).
       01  DISP-LINE                     PIC X(50).

       COPY TBLOWUP    IN COPYLIB.
       COPY CEACHKPH   IN COPYLIB.
       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X  VALUE "0".
           05  FILE-STATUS-2             PIC X  VALUE "0".
       COPY DBSTAT     IN COPYLIB.
       COPY DBMODES    IN COPYLIB.
       COPY REQGLOB    IN COPYLIB.
       COPY MREQ       IN COPYLIB.



       PROCEDURE DIVISION.
       1-HOUSEKEEP SECTION.
       1-HSK.

           PERFORM 9999-OPEN-STUFF.

       6-DISPLAY-LOOP.
           MOVE SPACES                   TO  REQ-ARG.
           DISPLAY "ENTER REQ NUMBER".
           ACCEPT REQ-ARG.
           IF REQ-ARG = SPACES
               GO TO 2-EOJ.

           PERFORM 9999-DBGET7-MREQ-RQ-I.
           IF NO-ENTRY
               DISPLAY "REQ DOESN'T EXIST"
               GO TO 6-DISPLAY-LOOP.

           CALL "CEACHKPH" USING BASE, STATUS-AREA, CHKPH-RET-CODE,
             SAVE-DREQQUE-TABLE, BUF-MREQ, BU-DISPLAY-MSG.
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               PERFORM 2100-BLOWUP.
           IF CHKPH-RET-CODE = "BC"
               DISPLAY "*** BAD APPROVAL COUNT ***"
           ELSE
           IF CHKPH-RET-CODE = "BP"
               DISPLAY "*** BAD PATH ***"
           ELSE
           IF CHKPH-RET-CODE = "IP"
               DISPLAY "*** INVALID PATH ***"
           ELSE
           IF CHKPH-RET-CODE = "OK"
               DISPLAY "*** REQ IS OK ***"
           ELSE
               DISPLAY "*** UNKNOWN RETURN CODE IS ", CHKPH-RET-CODE.
           MOVE ZERO                     TO  SUB.
           PERFORM CHKPH-SUB TIMES
               ADD 1                     TO  SUB
               IF CHKPH-LINE (SUB) NOT EQUAL SPACES
                   MOVE CHKPH-LINE (SUB) TO  DISP-LINE
                   DISPLAY DISP-LINE
               END-IF
           END-PERFORM.

           DISPLAY "RE-QUEUE IT?".
           ACCEPT FIX-FLAG.
           IF FIX-FLAG = "Y"
               MOVE "BP" TO REQ-BADPATH-ID
           ELSE
               GO TO 6-DISPLAY-LOOP.

           CALL "CEAFIXPH" USING BASE, STATUS-AREA, CHKPH-RET-CODE,
             SAVE-DREQQUE-TABLE, BUF-MREQ, BU-DISPLAY-MSG.
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               PERFORM 2100-BLOWUP.
           MOVE ZERO                     TO  SUB.
           PERFORM CHKPH-SUB TIMES
               ADD 1                     TO  SUB
               IF CHKPH-LINE (SUB) NOT EQUAL SPACES
                   MOVE CHKPH-LINE (SUB) TO  DISP-LINE
                   DISPLAY DISP-LINE
               END-IF
           END-PERFORM.


           GO TO 6-DISPLAY-LOOP.

       2-EOJ.
           PERFORM 9999-CLOSE-STUFF.
           GOBACK.

       2100-BLOWUP.
           DISPLAY "FATAL ERROR, FILE-STATUS = ", FILE-STATUS.
           DISPLAY "COND-WORD = ", COND-WORD.
           DISPLAY BU-DISPLAY-MSG.
           GOBACK.

       9999-DBGET7-MREQ-RQ-I.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF MREQ-RQ-REC-I.
           READ MREQ-RQ-I INTO BUF-MREQ
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET7 ERR 9999-DBGET7-MREQ-RQ-I"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-OPEN-STUFF.
           OPEN INPUT MREQ-RQ-I.

       9999-CLOSE-STUFF.
           CLOSE      MREQ-RQ-I.
