000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          TBADWS.
000400 AUTHOR.              C HILLES.
000500 DATE-WRITTEN.        10/28/87.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*D   FINDS AND DELETES DWLITEM ENTRIES WITH NO MWRKLIST ENTRY.
      *C***********************************************************
      *C   05/03/94                                               *
      *C      REMOVED ALL REFERENCES TO PORTABILITY COPYLIB       *
      *C      MEMBERS.                              W.L.M.        *
      *C
      *C   06/12/96    JEFF BUNGO
      *C      EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C      RECOMPILE PROGRAM TO PICK UP NEW FILE FORMATS.
      *C***********************************************************
002400 ENVIRONMENT DIVISION.
002500 CONFIGURATION SECTION.
002600 SOURCE-COMPUTER.  HP-3000.
002700 OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
      *COPY SLMWKWKO IN COPY DBCS.
           SELECT MWRKLIST-WK-O
               ASSIGN TO DATABASE-MCFLCS0301
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

      *COPY SLDWLWKO IN COPY DBCS.
           SELECT DWLITEM-WK-O
               ASSIGN TO DATABASE-MCFLCS1501
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

002800
002900 DATA DIVISION.
       FILE SECTION.
      *------ FD STATEMENTS FOR IBM ONLY ------*
       FD  MWRKLIST-WK-O
           LABEL RECORDS ARE STANDARD.
       01  MWRKLIST-WK-REC-O.
           COPY DDS-MCRPCS0300  OF MCFLCS0301.

       FD  DWLITEM-WK-O
           LABEL RECORDS ARE STANDARD.
       01  DWLITEM-WK-REC-O.
           COPY DDS-MCRPCS1500  OF MCFLCS1501.
      *------ FD STATEMENTS FOR IBM ONLY ------*

003000 WORKING-STORAGE SECTION.
       01  HANDLE-BLOWUP-FLAG  PIC X(1)  VALUE "Y".
       01  BASE   PIC X(10)  VALUE "  STORES;".
       COPY DBSTAT IN COPYLIB.
       COPY FILESTAT IN COPYLIB.
       01  WL-ARG   PIC X(6).
       COPY TBLOWUP IN COPYLIB.
       COPY MWRKLIST IN COPYLIB.
       COPY DWLITEM IN COPYLIB.
007900 PROCEDURE DIVISION.
008500 6000-MAIN.
           PERFORM 9999-OPEN-STUFF.
           PERFORM 9999-BEGFIL-DWLITEM-WK-O.
           PERFORM 9999-GETSER-DWLITEM-WK-O.
           PERFORM UNTIL NOT GOOD-CALL
               MOVE WL-KEY TO WL-ARG
               PERFORM 9999-GETKEY-MWRKLIST-WK-O
               IF NOT GOOD-CALL
                   DISPLAY "DWLITEM ENTRY WS# ", WL-KEY,
                     " CODE ", WL-CODE, " NO MWRKLIST "
                   PERFORM 9999-DELETE-DWLITEM-WK-O
               END-IF
               PERFORM 9999-GETSER-DWLITEM-WK-O
           END-PERFORM.
       6990-MAIN-X.
           PERFORM 9999-CLOSE-STUFF.
           GOBACK.

       9999-OPEN-STUFF.
      *COPY OPMWKWKO IN COPY DBCS.
           OPEN I-O MWRKLIST-WK-O.
      *COPY OPDWLWKO IN COPY DBCS.
           OPEN I-O DWLITEM-WK-O.
       9999-CLOSE-STUFF.
      *COPY CLMWKWKO IN COPY DBCS.
           CLOSE MWRKLIST-WK-O.
      *COPY CLDWLWKO IN COPY DBCS.
           CLOSE DWLITEM-WK-O.
      *COPY GSDWLWKO IN COPY DBCS.
       9999-GETSER-DWLITEM-WK-O.
           MOVE 0 TO COND-WORD.
           READ DWLITEM-WK-O NEXT INTO BUF-DWLITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETSER ERR 9999-GETSER-DWLITEM-WK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-BEGFIL-DWLITEM-WK-O.
           MOVE SPACES TO WLKEY OF DWLITEM-WK-REC-O.
           START DWLITEM-WK-O KEY >= WLKEY OF DWLITEM-WK-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

      *COPY GKMWKWKO IN COPY DBCS.
       9999-GETKEY-MWRKLIST-WK-O.
           MOVE 0 TO COND-WORD.
           MOVE WL-ARG TO WLKEY OF MWRKLIST-WK-REC-O.
           READ MWRKLIST-WK-O INTO BUF-MWRKLIST
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MWRKLIST-WK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-RESET-MWRKLIST-WK-O.
           MOVE HIGH-VALUES TO WLKEY OF MWRKLIST-WK-REC-O.
           START MWRKLIST-WK-O KEY > WLKEY OF MWRKLIST-WK-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

      *COPY DLDWLWKO IN COPY DBCS.
       9999-DELETE-DWLITEM-WK-O.
           MOVE 0 TO COND-WORD.
           DELETE DWLITEM-WK-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "DELETE ERR 9999-DELETE-DWLITEM-WK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.


       2100-BLOWUP.
041600     MOVE "TBADWS"                 TO  BU-PGM-NAME.
041900     CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
042000       DUMMY-VIEW-AREA, FILE-STATUS BU-DISPLAY-MSG
042100       BU-DISPLAY-FLDS.
042200
