000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.           TBALWOFF.
000400 AUTHOR.               MK MADDEN.
000500 DATE-WRITTEN.         FEB 25, 1987.
000600*INSTALLATION.         GOODYEAR TIRE AND RUBBER CO.
000700
000800*REMARKS.              THIS PROGRAM WILL CREATE AN ACCOUNTING
000900*                      ADJUSTMENT FOR ALL CODES WHICH END THE
001000*                      MONTH WITH A DOLLAR BALANCE BUT NO UNIT
001100*                      BALANCE.  THESE ADJUSTMENTS WILL BE CHARGED
001200*                      TO THE DEFAULT DEPT AND ACCOUNT RELATED
001300*                      TO THE CODE.  A REPORT WILL BE PRINTED
001400*                      ITEMIZING EACH OF THESE ADJUSTMENTS.
      *C
      *C   07FEB1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
      *C   11/08/1994   CATHY ZUBEK     REQ. #: 6231
      *C     ADDED LOGIC TO VALIDATE THE DEPARTMENT USING MCHT-ACCTS
      *C     PRIOR TO WRITING AADJ RECORDS TO DTRANS.  IF NO DEPARTMENT
      *C     IS FOUND, ZEROES WILL BE MOVED TO THE FIELD AND A MESSAGE
      *C     WILL BE DISPLAYED.
      *C
      *C   12SEP1996    DAVE PLUM
      *C     REVISED FOR CENTURY DATABASE CHANGES.
      *C
001600 ENVIRONMENT DIVISION.
001700 CONFIGURATION SECTION.
001800 SOURCE-COMPUTER.      HP-3000.
001900 OBJECT-COMPUTER.      HP-3000.
       COPY SPECIALN IN COPYLIB.
002100
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MMATL-ACCUM-MC-I
               ASSIGN TO DATABASE-MCFLCA0601
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DTRANS-MC-O
               ASSIGN TO DATABASE-MCFLCA0701
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MACCOUNT-INFO-IK-O
               ASSIGN TO DATABASE-MCFLCA0101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MCHT-ACCTS-DP-I
               ASSIGN TO DATABASE-MCFLCA0301
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.

           SELECT SORT-FILE ASSIGN TO DISK-SORT.

002700
002800 DATA DIVISION.
003100
      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       FILE SECTION.
       FD  MMATL-ACCUM-MC-I
           LABEL RECORDS ARE STANDARD.
       01  MMATL-ACCUM-MC-REC-I.
           COPY DDS-MCRPCA0600  OF MCFLCA0601.

       FD  MCHT-ACCTS-DP-I
           LABEL RECORDS ARE STANDARD.
       01  MCHT-ACCTS-DP-REC-I.
           COPY DDS-MCRPCA0300  OF MCFLCA0301.

       FD  DTRANS-MC-O
           LABEL RECORDS ARE STANDARD.
       01  DTRANS-MC-REC-O.
           COPY DDS-MCRPCA0700  OF MCFLCA0701.

       FD  MACCOUNT-INFO-IK-O
           LABEL RECORDS ARE STANDARD.
       01  MACCOUNT-INFO-IK-REC-O.
           COPY DDS-MCRPCA0100  OF MCFLCA0101.

      *------ FD STATEMENT AREA FOR IBM ONLY ------*

003300 FD  ONLINE-PRT
003400     DATA RECORD IS PRT-REC
003500     RECORD CONTAINS 133 CHARACTERS
003600     LABEL RECORDS ARE OMITTED.
003700
003800 01  PRT-REC                       PIC X(133).
003900
004000 SD  SORT-FILE
004100     DATA RECORD IS SORT-REC
004200     RECORD CONTAINS 50  CHARACTERS.
004300
004400 01  SORT-REC.
004500     05  SORT-CLASS               PIC X(4).
004600     05  SORT-MATL-CODE           PIC X(8).
004700     05  SORT-BEG-UNITS           PIC S9(10).
004800     05  SORT-BEG-DOLLARS         PIC S9(12)V99.
004900     05  SORT-DEPT                PIC X(6).
005000     05  SORT-ACCOUNT             PIC X(6).
005100     05  SORT-UM                  PIC XX.
005200
005400 WORKING-STORAGE SECTION.
005500
005600 77  NO-MORE-SORT                  PIC XXX     VALUE SPACES.
005700 77  LINE-CNT                      PIC 99     VALUE 0.
005800 77  PAGE-CNT                      PIC 9(4)    VALUE 0.
005900 77  TOT-CODES                     PIC 9(4) VALUE ZERO.
006000 77  TOT-DOLLARS                   PIC S9(12)V99 VALUE 0.
006100 77  GOOD-PUT                      PIC X    VALUE SPACES.
006200 77  NEW-BEG-BAL-UNITS             PIC S9(10) VALUE ZEROS.
006300 77  NEW-BEG-BAL-DOLLARS           PIC S9(12)V99 VALUE ZEROS.
       77  MCXCBLERR-SCOPE               PIC X(1)  VALUE "C".
006400
006500 01  MONTH-YEAR.
006600     05  MONTH-PARM                PIC 99   VALUE ZEROS.
006700     05  YEAR-PARM                 PIC 99   VALUE ZEROS.
006800
006900 01  MONTH-TABLE.
007000     05  FILLER                    PIC X(9) VALUE "JANUARY".
007100     05  FILLER                    PIC X(9) VALUE "FEBRUARY".
007200     05  FILLER                    PIC X(9) VALUE "MARCH".
007300     05  FILLER                    PIC X(9) VALUE "APRIL".
007400     05  FILLER                    PIC X(9) VALUE "MAY".
007500     05  FILLER                    PIC X(9) VALUE "JUNE".
007600     05  FILLER                    PIC X(9) VALUE "JULY".
007700     05  FILLER                    PIC X(9) VALUE "AUGUST".
007800     05  FILLER                    PIC X(9) VALUE "SEPTEMBER".
007900     05  FILLER                    PIC X(9) VALUE "OCTOBER".
008000     05  FILLER                    PIC X(9) VALUE "NOVEMBER".
008100     05  FILLER                    PIC X(9) VALUE "DECEMBER".
008200
008300 01  MONTH-TAB REDEFINES MONTH-TABLE.
008400     05  MONTH-T OCCURS 12 TIMES   PIC X(9).
008500
       01  IMAGE-ARGS.
           05  DEPT-ARG                  PIC X(6) VALUE SPACES.

008700************************************************************
008800**     REPORT PRINT LINES                                 **
008900************************************************************
009000
009100 01  HEADER1.
009200     05  FILLER                     PIC X      VALUE SPACES.
009300     05  FILLER                     PIC X(49)
009400         VALUE "TBALWOFF".
009500     05  FILLER                     PIC X(69)
009600         VALUE "CORPORATE STORES ACCOUNTING SYSTEM".
009700     05  FILLER                     PIC X(5)   VALUE "DATE ".
009800     05  DATE-H1                    PIC X(8)   VALUE SPACES.
009900
010000 01  HEADER2.
010100     05  FILLER                     PIC X      VALUE SPACES.
010200     05  FILLER                     PIC X(6)   VALUE "PAGE".
010300     05  PAGE-H2                    PIC ZZZ9   VALUE ZERO.
010400     05  FILLER                     PIC X(37)  VALUE SPACES.
010500     05  FILLER                     PIC X(71)
010600         VALUE " ENDING DOLLAR BALANCES WRITTEN OFF".
010700     05  FILLER                     PIC X(5)   VALUE "TIME ".
010800     05  TIME-H2                    PIC X(8)   VALUE SPACES.
010900
011000 01  HEADER3.
011100     05  FILLER                     PIC X      VALUE SPACES.
011200     05  FILLER                     PIC X(56)  VALUE SPACES.
011300     05  MONTH-H3                   PIC X(9)   VALUE SPACES.
011400     05  FILLER                     PIC X(3)   VALUE SPACES.
011500     05  YEAR-H3A                   PIC X(2)   VALUE "20".
011600     05  YEAR-H3B                   PIC X(2)  VALUE SPACES.
011700
011900 01  HEADER4.
012000     05  FILLER                     PIC X      VALUE SPACES.
012100     05  FILLER                     PIC X(20)
012200         VALUE "CLS CODE".
012300     05  FILLER                     PIC X(27)
012400         VALUE "BEG BAL     BEG BAL".
012500     05  FILLER                     PIC X(31)
012600         VALUE "DEPT CHG    ACCT CHG".
012700     05  FILLER                     PIC X(56)
012800         VALUE "UM".
012900
013000 01  HEADER5.
013100     05  FILLER                     PIC X(21)  VALUE SPACES.
013200     05  FILLER                     PIC X(29)
013300         VALUE "DOLLARS       UNITS".
013400     05  FILLER                     PIC X(83)  VALUE SPACES.
013500
013600 01  BLANK-LINE.
013700     05  FILLER                     PIC X(133) VALUE SPACES.
013800
013900 01  DETAIL-LINE.
014000     05  FILLER                   PIC X  VALUE SPACES.
014100     05  PRT-CLASS                PIC XXX  VALUE SPACES.
014200     05  FILLER                   PIC X    VALUE SPACES.
014300     05  PRT-CODE                 PIC X(8)  VALUE SPACES.
014400     05  FILLER                   PIC X      VALUE SPACES.
014500     05  PRT-BEG-DLRS             PIC Z(11)9.99-.
014600     05  FILLER                   PIC X  VALUE SPACES.
014700     05  PRT-BEG-UNITS            PIC Z(9)9-.
014800     05  FILLER                   PIC X(6)  VALUE SPACES.
014900     05  PRT-DEPT                 PIC X(6)  VALUE SPACES.
015000     05  FILLER                   PIC X(6)  VALUE SPACES.
015100     05  PRT-ACCOUNT              PIC X(6)  VALUE SPACES.
015200     05  FILLER                   PIC X(13)  VALUE SPACES.
015300     05  PRT-UM                   PIC XX  VALUE SPACES.
015400     05  FILLER                   PIC X(61)  VALUE SPACES.
015500
015600 01  TOT-LINE.
015700     05  TOT-DESCR                 PIC X(14)  VALUE SPACES.
015800     05  PRT-TOT-DOLLARS           PIC Z(11)9.99-.
015900
016000************************************************************
016100**                                                        **
016200**           D A T A B A S E   B U F F E R S              **
016300**                                                        **
016400************************************************************
016500
016600*********************
016700**  MMATL-ACCUM    **
016800*********************
016900
017000 COPY MATLACUM IN COPYLIB.
017100
017200*****************
017300* MACCOUNT-INFO *
017400*****************
017500
017600 COPY MACTINFO IN COPYLIB.
017700
017800*****************
017900*   DTRANS      *
018000*****************
018100
018200 COPY DTRANS IN COPYLIB.
018300
017800*****************
017900*   MCHT-ACCTS  *
018000*****************
018100
018200 COPY MCHTACCT IN COPYLIB.
018300
018500**********************************************************
018600*              D A T A    B A S E                        *
018700**********************************************************
018800
       01  FILE-STATUS.
           05  FILE-STATUS-1    PIC X(1)   VALUE "0".
           05  FILE-STATUS-2    PIC X(1)   VALUE "0".

018900 COPY DBCSACCT IN COPYLIB.
019000
019100 COPY DBMODES IN COPYLIB.
019200
019300 COPY DBSTAT IN COPYLIB.
019400
019500 01  DATASET-NAMES.
           05  DSET-NAME        PIC X(16)  VALUE SPACES.
019600     05  DSET-MMATL-ACCUM PIC X(16)  VALUE "MMATL-ACCUM;".
019700     05  DSET-MACCT       PIC X(16)  VALUE "MACCOUNT-INFO;".
019800     05  DSET-DTRANS      PIC X(16)   VALUE "DTRANS;".
019900
020000 01  ITEMS-LISTING.
020100     05  ALL-ITEMS        PIC X(2)   VALUE "@;".
020200
020300 01  IMAGE-ARGS.
020400     05  MMATL-CODE-ARG   PIC X(8)   VALUE SPACES.
020500     05  MACCT-KEY        PIC X(4)  VALUE SPACES.
020600
020700 COPY MULTLOCK IN COPYLIB.
020800
020900****************************************************
021000**   PARAMETERS FOR CALLING 'SVARDEPT'
021100****************************************************
021200
021300 COPY SVARDEPT IN COPYLIB.
021400
021500****************************************************
021600**   PARAMETERS FOR CALLING 'TDATECHK'
021700****************************************************
021800
021900 COPY TDATECHK IN COPYLIB.
022000
022100*******************************************************
022200*   PARAMETERS USED IN 'TBLOWUP' ROUTINE (PRINTS      *
022300*   ERRORS AND ABORTS PROGRAM.  RUN XBLPRT.OBJECT TO  *
022400*   READ ERRORS).                                     *
022500*******************************************************
022600
022700 COPY TBLOWUP IN COPYLIB.
022800
022900******************************************
023000**   PARAMETERS FOR CALLING 'CBLOWSRT'
023100******************************************
023200
023300 COPY CBLOWSRT IN COPYLIB.
023600
023700 PROCEDURE DIVISION.
023800
023900 001-BEGIN SECTION.
024000
024100 010-MAINLINE.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.
024200
024300*******************************************************
024400**   CALL 'CBLOWSRT' FIRST BEFORE GOING INTO THE
024500**   SORT VERB.  THE FIRST CALL TO 'CBLOWSRT' OPENS
024600**   UP A NEW TEMPORARY FILE 'BLUPDATA' THAT IS USED
024700**   TO WRITE THE BLOWUP INFORMATION IF A BLOWUP
024800**   OCCURS
024900*******************************************************
025000
025100     CALL "CBLOWSRT" USING CBLOWSRT-PARMS,
025200                           ACCTG-BASE,
025300                           BU-PGM-NAME,
025400                           STATUS-AREA,
025500                           DUMMY-VIEW-AREA,
025600                           FILE-STATUS,
025700                           BU-DISPLAY-MSG,
025800                           BU-DISPLAY-FLDS.
025900
026000     SORT SORT-FILE ON ASCENDING KEY SORT-CLASS
026100                                     SORT-MATL-CODE
026200     INPUT PROCEDURE IS 050-PROCESS-TRANS
026300     OUTPUT PROCEDURE IS 700-CREATE-REPORT.
026400     PERFORM 1000-CLOSE-FILES.
026500     GOBACK.
026600
026800 050-PROCESS-TRANS SECTION.
       050-PROCESS-TRANS-PARA.
026900     PERFORM 100-BEGIN.
027000     PERFORM 200-PROCESS-DETAIL
027100         UNTIL END-OF-FILE.
027200
027300**********************************************************
027400*  TRANSFER CONTROL TO LAST STATEMENT IN INPUT PROCEDURE *
027500*  FOR SORTING OF RECORDS.                               *
027600**********************************************************
027700
027800     GO TO 699-PROCESS-EXIT.
027900
028000 100-BEGIN.
           PERFORM 9999-OPEN-STUFF.
029000
029100     MOVE SPACES                  TO SVARDEPT-PARMS.
029200     CALL "SVARDEPT" USING ACCTG-BASE,
029300                           SVARDEPT-PARMS,
029400                           STATUS-AREA,
029500                           BU-DISPLAY-MSG,
029600                           BU-DISPLAY-FLDS.
029700     IF BU-DISPLAY-MSG NOT = SPACES
029800         PERFORM 990-BLOWUP.
029900
030000     MOVE SPACES TO SORT-REC.
           PERFORM 9999-INIT-MMATL-ACCUM-MC-I.
030100     PERFORM 400-GET-MMATL-ACCUM.
030200
030400 200-PROCESS-DETAIL.
030500     IF MATL-STORES-CODE = "NON-STR"
030600         NEXT SENTENCE
030700     ELSE
030800         IF MATL-STORES-CODE-1-4 = "INTR" OR "ACCR" OR "OPNR"
030900             NEXT SENTENCE
031000         ELSE
031100             PERFORM 600-BUILD-SORT-REC.
031200     PERFORM 400-GET-MMATL-ACCUM.
031300
031500 400-GET-MMATL-ACCUM.
           PERFORM 9999-DBGET2-MMATL-ACCUM-MC-I.
032300     IF GOOD-CALL
032400         NEXT SENTENCE
032500     ELSE
032600         IF END-OF-FILE
032700             NEXT SENTENCE
032800         ELSE
032900             MOVE "GET MMATL-ACCUM * 400-GMA" TO BU-DISPLAY-MSG
033000             PERFORM 990-BLOWUP.
033100
033300 600-BUILD-SORT-REC.
033400     COMPUTE NEW-BEG-BAL-UNITS = MATL-BEG-BAL-UNITS +
033500                                 MATL-RCPT-UNITS +
033600                                 MATL-ADJ-UNITS +
033700                                 MATL-RTN-UNITS +
033800                                 MATL-RTNVAL-UNITS +
033900                                 MATL-ACCTG-UNIT-CORR -
034000                                 MATL-ISSUE-UNITS.
034100
034200     COMPUTE NEW-BEG-BAL-DOLLARS = MATL-BEG-BAL-DOLLARS +
034300                                   MATL-INV-DOLLARS +
034400                                   MATL-TOT-ADJ-DOLLARS +
034500                                   MATL-RTN-DOLLARS +
034600                                   MATL-RTNVAL-DOLLARS +
034700                                   MATL-ACCTG-DOLLAR-CORR -
034800                                   MATL-TOT-ISS-DOLLARS.
034900
035000     IF NEW-BEG-BAL-UNITS = 0
035100         IF NEW-BEG-BAL-DOLLARS NOT = 0
035200*************DISPLAY "CODE = " MATL-STORES-CODE
035300             MOVE SPACES               TO BUF-DTRANS
035400             MOVE NEW-BEG-BAL-UNITS    TO SORT-BEG-UNITS
035500             MOVE NEW-BEG-BAL-DOLLARS  TO SORT-BEG-DOLLARS
035600             PERFORM 650-GET-DEPT
035700             MOVE MATL-ACCOUNT         TO SORT-ACCOUNT,
035800                                          TRANS-ACCT
035900             MOVE MATL-UNIT-MEASURE    TO SORT-UM,
036000                                          TRANS-UNIT-MEASURE
036100             MOVE MATL-STORES-CODE     TO SORT-MATL-CODE,
036200                                          TRANS-STORES-CODE
036300             MOVE MATL-CLASS           TO SORT-CLASS,
036400                                          TRANS-CLASS
036500             MOVE ZERO                 TO TRANS-QTY
036600             COMPUTE TRANS-VALUE = NEW-BEG-BAL-DOLLARS * -1
036700             MOVE "AADJ"               TO TRANS-CODE
036800             MOVE 1                    TO DATE-MODE
036900             CALL "TDATECHK" USING DATE-CHECK-AREA
037000             MOVE DATE-YMD-OUT         TO TRANS-DATE

                   IF TRANS-YY > "70"
                       MOVE "19"             TO TRANS-DATE-CC
                   ELSE
                       MOVE "20"             TO TRANS-DATE-CC
                   END-IF

                   MOVE TRANS-DATE-CN  TO  MATL-DATE-LAST-UPDATE-CN
037100             MOVE DATE-UNFORMATTED-TIME-OUT  TO TRANS-TIME
037200             MOVE ZERO                 TO TRANS-BALANCE-QTY
037300             MOVE "TBALWOFF"           TO TRANS-DOCUMENT-NUM
037400             COMPUTE MATL-ACCTG-DOLLAR-CORR =
037500                     MATL-ACCTG-DOLLAR-CORR + TRANS-VALUE
                   PERFORM 640-VALIDATE-DEPT
037600             PERFORM 670-PUT-DTRANS
037800             PERFORM 680-UPDATE-MMATL-ACCUM
037900             RELEASE SORT-REC
038000             MOVE SPACES               TO SORT-REC
038100             MOVE ZERO                 TO SORT-BEG-UNITS
038200                                          SORT-BEG-DOLLARS.
038300
      *----------------------------------------------------------------*
      * 640-VALIDATE-DEPT:                      11/3/1994    CAZ       *
      *   THIS PARAGRAPH MAKES SURE THE DEPARTMENT NUMBER EXISTS IN    *
      *   THE MCHT-ACCTS DATABASE.  IF IT DOESN'T, ZEROES ARE MOVED    *
      *   TO THE FIELD AND A MESSAGE IS DISPLAYED SHOWING THE          *
      *   DEPARTMENT IN ERROR.                                         *
      *----------------------------------------------------------------*

       640-VALIDATE-DEPT.
           MOVE TRANS-DEPT           TO DEPT-ARG.
           PERFORM 9999-DBGET7-MCHT-ACCTS-DP-I.
           IF GOOD-CALL
               NEXT SENTENCE
           ELSE
               IF NO-ENTRY
                   DISPLAY "NO MATCHING DEPT MASTER ENTRY FOR ",
                                                            TRANS-DEPT,
                           "   CORP CODE = ", MATL-STORES-CODE
                   MOVE "0000"       TO TRANS-DEPT
                                        SORT-DEPT
               ELSE
                   MOVE "DBGET MCHT-ACCTS * 640-VALIDATE-DEPT"
                     TO BU-DISPLAY-MSG
                   MOVE DEPT-ARG TO BU-DISPLAY-FLD (1)
                   PERFORM 990-BLOWUP.

038400 650-GET-DEPT.
038500     IF (MATL-CLASS > 099 AND MATL-CLASS < 200)  OR
038600        (MATL-CLASS > 399 AND MATL-CLASS < 500)
038700         MOVE MATL-CLASS          TO SVARDEPT-MATL-CLASS
038800         CALL "SVARDEPT" USING ACCTG-BASE,
038900                               SVARDEPT-PARMS,
039000                               STATUS-AREA,
039100                               BU-DISPLAY-MSG,
039200                               BU-DISPLAY-FLDS
039300         IF BU-DISPLAY-MSG NOT = SPACES
039400             PERFORM 990-BLOWUP
039500         ELSE
039600             MOVE SVARDEPT-DEPT-CLASS-VAR  TO SORT-DEPT,
039700                                              TRANS-DEPT
039800     ELSE
039900         MOVE MATL-DEPT           TO SORT-DEPT,
040000                                     TRANS-DEPT.
040100
040300 670-PUT-DTRANS.
           MOVE "DTRANS;" TO DSET-NAME.
           PERFORM 9999-DBPUT-DTRANS-MC-O.
042100     IF GOOD-CALL
042200         NEXT SENTENCE
042300     ELSE
042700         MOVE "DBPUT DTRANS * 670-PD" TO BU-DISPLAY-MSG
042800         PERFORM 990-BLOWUP.
042900
043900
044100 680-UPDATE-MMATL-ACCUM.
044200     CALL "SUPDMATL" USING ACCTG-BASE,
044300                           BUF-MATLACUM,
044400                           STATUS-AREA,
044500                           BU-DISPLAY-AREA,
044600                           BU-DISPLAY-FLDS.
044700     IF BU-DISPLAY-MSG NOT = SPACES
044800         PERFORM 990-BLOWUP.
044900
045100 699-PROCESS-EXIT.
045200     EXIT.
045300
045500 700-CREATE-REPORT SECTION.
       700-CREATE-REPORT-PARA.
045600     DISPLAY "BEGIN REPORT".
045700     PERFORM 710-BEGIN-REPORT.
045800     PERFORM 722-PROCESS-TRANS
045900        UNTIL NO-MORE-SORT = "YES".
046000     PERFORM 723-END-REPORT.
046100     PERFORM 780-UPDATE-BALWOFF-SW.
046200
046300**************************************************
046400**  BRANCH TO LAST STATEMENT OF OUTPUT SECTION  **
046500**  TO COMPLETE PROCESSING OF REPORT            **
046600**************************************************
046700
046800     GO TO 799-CREATE-EXIT.
046900
047000 710-BEGIN-REPORT.
047100     OPEN OUTPUT ONLINE-PRT.
047200     RETURN SORT-FILE
047300        AT END
047400            MOVE "YES" TO NO-MORE-SORT.
047500     PERFORM 750-PRINT-HEADINGS.
047600
047800 722-PROCESS-TRANS.
047900     MOVE SORT-CLASS              TO PRT-CLASS.
048000     MOVE SORT-MATL-CODE          TO PRT-CODE.
048100     MOVE SORT-DEPT               TO PRT-DEPT.
048200     MOVE SORT-ACCOUNT            TO PRT-ACCOUNT.
048300     MOVE SORT-UM                 TO PRT-UM.
048400     MOVE SORT-BEG-UNITS          TO PRT-BEG-UNITS.
048500     MOVE SORT-BEG-DOLLARS        TO PRT-BEG-DLRS.
048600     WRITE PRT-REC FROM DETAIL-LINE AFTER 2.
048700     ADD 2                        TO LINE-CNT.
048800     ADD 1                        TO TOT-CODES.
048900     ADD SORT-BEG-DOLLARS         TO TOT-DOLLARS.
049000     IF LINE-CNT > 55
049100         PERFORM 750-PRINT-HEADINGS.
049200     RETURN SORT-FILE
049300        AT END
049400             MOVE "YES" TO NO-MORE-SORT.
049500
049600 723-END-REPORT.
049700     MOVE "TOTAL DOLLARS"         TO TOT-DESCR.
049800     MOVE TOT-DOLLARS             TO PRT-TOT-DOLLARS.
049900     WRITE PRT-REC FROM TOT-LINE AFTER 3.
050000     MOVE ZERO                    TO TOT-CODES.
050100
050300 750-PRINT-HEADINGS.
050400     MOVE 1                       TO DATE-MODE.
050500     CALL "TDATECHK" USING DATE-CHECK-AREA.
050600     MOVE DATE-SLASH-OUT          TO DATE-H1.
050700     MOVE DATE-FORMATTED-TIME-OUT TO TIME-H2.
050800     MOVE "MY"                    TO MACCT-KEY.
           PERFORM 9999-DBGET7-MACCOUNT-INFO-IK-O.
051600     IF GOOD-CALL
051700         NEXT SENTENCE
051800     ELSE
051900         MOVE "DBGET MACCOUNT-INFO * 750-PH" TO BU-DISPLAY-MSG
052000         MOVE MACCT-KEY TO BU-DISPLAY-FLD (1)
052100         PERFORM 990-BLOWUP.
052200
           PERFORM 9999-RESET-MACCOUNT-INFO-IK-O.

052300     MOVE MACCT-MONTH             TO MONTH-PARM.
052400     MOVE MACCT-YEAR              TO YEAR-PARM.
052500     MOVE MONTH-T (MONTH-PARM)    TO MONTH-H3.
052600     MOVE YEAR-PARM               TO YEAR-H3B.
052700     ADD 1                        TO PAGE-CNT.
052800     MOVE PAGE-CNT                TO PAGE-H2.
052900     WRITE PRT-REC FROM HEADER1 AFTER ADVANCING NEW-PAGE.
053000     WRITE PRT-REC FROM HEADER2 AFTER ADVANCING 1.
053100     WRITE PRT-REC FROM HEADER3 AFTER ADVANCING 1.
053200     WRITE PRT-REC FROM HEADER4 AFTER ADVANCING 2.
053300     WRITE PRT-REC FROM HEADER5 AFTER ADVANCING 1.
053400     WRITE PRT-REC FROM BLANK-LINE AFTER ADVANCING 1.
053500     MOVE 7                       TO LINE-CNT.
053600
053800*********************************************************
053900**                                                     **
054000**   THIS PROCEDURE UPDATES AN INDICATOR THAT STATES   **
054100**   THIS PROGRAM WAS EXECUTED SUCCESSFULLY.  THIS IS  **
054200**   PART OF THE MONTH-END PROCEDURE.  THE INDICATOR   **
054300**   IS LOCATED IN THE DATA SET 'MACCOUNT-INFO' UNDER  **
054400**   THE KEY 'MTED'                                    **
054500**                                                     **
054600*********************************************************
054700
054800 780-UPDATE-BALWOFF-SW.
054900     MOVE 1                       TO  NUMBER-OF-DSETS-LOCKED.
055000     MOVE DSET-MACCT              TO  DSET-NAME-1.
055100     MOVE "INFO-KEY;"             TO  ITEM-LIST-1.
055200     MOVE "MTED"                  TO  LOCK-VALUE-1.

055900     MOVE "MTED" TO MACCT-KEY.
           PERFORM 9999-DBGET7-MACCOUNT-INFO-IK-O.
056700     IF GOOD-CALL
056800         NEXT SENTENCE
056900     ELSE
057000         MOVE "DBGET MACCT 'MTED'* 780-UBS" TO BU-DISPLAY-MSG
057100         MOVE MACCT-KEY           TO  BU-DISPLAY-FLD (2)
057200         PERFORM 990-BLOWUP.
057300
057400     MOVE "X"                     TO  MACCT-BALWOFF-SW.
           PERFORM 9999-DBUPDATE-MACCOUNT-INFO-O.
058100     IF GOOD-CALL
058200         NEXT SENTENCE
058300     ELSE
058400         MOVE "DBUPDATE MACCT * 780-UBS" TO BU-DISPLAY-MSG
058500         MOVE MACCT-KEY           TO BU-DISPLAY-FLD (2)
058600         PERFORM 990-BLOWUP.
058700
059800
059900 799-CREATE-EXIT.
060000     EXIT.
060100
060200 900-ERROR SECTION.
060300
060400 990-BLOWUP.
060500
060600***************************************************************
060700**   CALL 'CBLOWSRT' INSTEAD OF 'TBLOWUP' WHEN A BLOWUP      **
060800**   SITUATION OCCURS SINCE THIS PROGRAM USES THE 'SORT'     **
060900**   VERB.  'CBLOWSRT' WRITES ALL THE BLOWUP INFORMATION     **
061000**   TO A TEMPORARY FILE 'BLUPDATA' (WHICH WAS OPENED AT     **
061100**   THE BEGINNING OF THE PROGRAM) THE CLOSES IT. THEN IT    **
061200**   CREATESA A SON PROCESS 'XBLOWSRT' THAT READS THE        **
061300**   BLOWUP INFORMATION OUT OF 'BLUPDATA' AND CALLS          **
061400**   'TBLOWUP' USING THIS INFO.  SINCE THE NEW PROCESS       **
061500**   'XBLOWSRT' HAS ITS OWN STACK THE STACK OVERFLOW         **
061600**   PROBLEM IS AVOIDED.                                     **
061700***************************************************************
061800
061900     MOVE "TBALWOFF"              TO  BU-PGM-NAME.
062000     CALL "CBLOWSRT" USING CBLOWSRT-PARMS,
062100                           ACCTG-BASE,
062200                           BU-PGM-NAME,
062300                           STATUS-AREA,
062400                           DUMMY-VIEW-AREA,
062500                           FILE-STATUS,
062600                           BU-DISPLAY-MSG,
062700                           BU-DISPLAY-FLDS.
062800
063000 1000-CLOSE-FILES.
063100     CLOSE ONLINE-PRT.
           PERFORM 9999-CLOSE-STUFF.

       9999-ROUTINES SECTION.

       9999-DBGET2-MMATL-ACCUM-MC-I.
           MOVE 0 TO COND-WORD.
           READ MMATL-ACCUM-MC-I NEXT INTO BUF-MATLACUM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1" OR FILE-STATUS = "46"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-INIT-MMATL-ACCUM-MC-I.
           MOVE SPACES TO MATLCODE OF MMATL-ACCUM-MC-REC-I.
           START MMATL-ACCUM-MC-I KEY >= MATLCODE OF
              MMATL-ACCUM-MC-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-DBPUT-DTRANS-MC-O.
           MOVE 0 TO COND-WORD.
           WRITE DTRANS-MC-REC-O FROM BUF-DTRANS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBGET7-MACCOUNT-INFO-IK-O.
           MOVE 0 TO COND-WORD.
           MOVE MACCT-KEY TO INFOKEY OF MACCOUNT-INFO-IK-REC-O.
           READ MACCOUNT-INFO-IK-O INTO BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-RESET-MACCOUNT-INFO-IK-O.
           MOVE HIGH-VALUES TO INFOKEY OF MACCOUNT-INFO-IK-REC-O.
           START MACCOUNT-INFO-IK-O KEY > INFOKEY OF
              MACCOUNT-INFO-IK-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-DBUPDATE-MACCOUNT-INFO-O.
           MOVE 0 TO COND-WORD.
           REWRITE MACCOUNT-INFO-IK-REC-O FROM BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBGET7-MCHT-ACCTS-DP-I.
           MOVE 0 TO COND-WORD.
           MOVE DEPT-ARG TO DEPT OF MCHT-ACCTS-DP-REC-I.
           READ MCHT-ACCTS-DP-I INTO BUF-MCHTACCTS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
               IF FILE-STATUS NOT = "00"
                   MOVE 99 TO COND-WORD.

       9999-OPEN-STUFF.
           OPEN INPUT MMATL-ACCUM-MC-I     .
           OPEN INPUT MCHT-ACCTS-DP-I      .
           OPEN I-O   DTRANS-MC-O          .
           OPEN I-O   MACCOUNT-INFO-IK-O   .

       9999-CLOSE-STUFF.
           CLOSE      MMATL-ACCUM-MC-I     .
           CLOSE      MCHT-ACCTS-DP-I      .
           CLOSE      DTRANS-MC-O          .
           CLOSE      MACCOUNT-INFO-IK-O   .
