       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TBBDISP.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT BULLETIN-BOARD
                  ASSIGN       TO DATABASE-MCFLMM2701
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT NEWS-TABLE
                  ASSIGN       TO DATABASE-MCFLMM2801
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZBBNEW-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS DYNAMIC
                  RELATIVE KEY IS RECNO
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  BULLETIN-BOARD
           LABEL RECORDS       ARE STANDARD.
       01  BB-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM2701.

       FD  NEWS-TABLE
           LABEL RECORDS       ARE STANDARD.
       01  DL-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM2801.

       FD  DISPLAY-FILE
           LABEL RECORDS       ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  FIND-SW             PIC 9     VALUE 0.
       77  REC-SW              PIC 9     VALUE 0.
           88  FILE-EMPTY                VALUE 1.
       77  MODEX               PIC 9999  VALUE 3.
       77  RECNO               PIC 9999  VALUE 3.
       77  TRUE-VAL            PIC 1  VALUE B"1".
       77  NEG-VAL             PIC 1  VALUE B"0".

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM PIC X(08) VALUE "TBBDISP ".
           05  PROGRAM-TYPE    PIC X(02) VALUE "UP".
           05  PROGRAM-RELEASE PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESCA1 PIC X(30) VALUE
                   "DISPLAY MODULE FOR THE MMIS BU".
               10  PROG-DESCA2 PIC X(30) VALUE
                   "LLETIN BOARD MAINTENANCE PROG.".
               10  PROG-DESCB1 PIC X(30) VALUE
                   "DISPLAYS MMIS NEWS RECORDS AS ".
               10  PROG-DESCB2 PIC X(30) VALUE
                   "THEY WILL BE SEEN BY FLOOR    ".
               10  PROG-FUNC1  PIC X(30) VALUE
                   "PERSONNEL.  RUNS FROM THE f4 K".
               10  PROG-FUNC2  PIC X(30) VALUE
                   "EY OF THE BULLETIN BOARD MENU.".
           05  PASSWORD-FLAG   PIC X.

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       01  TIME-BUFF.
           05  TIME-HM.
               10  TIME-HRS    PIC 99.
               10  TIME-MINS   PIC 99.
           05  TIME-SECS       PIC 99.
           05  TIME-TENTHS     PIC 99.

       01  SCREEN-DATA.
           05  LOCA-ID           PIC X(40).
           05  DATE-BUF          PIC X(18).
           05  TIME-BUF.
               10  T-BUF-HR      PIC X(02).
               10  T-BUF-C1      PIC X.
               10  T-BUF-MN      PIC X(02).
               10  T-BUF-C2      PIC X.
               10  T-BUF-SC      PIC X(02).
           05  MESSAGE-BUF.
               10  MESSAGE-1-BUF PIC X(70).
               10  MESSAGE-2-BUF PIC X(70).
               10  MESSAGE-3-BUF PIC X(70).
               10  MESSAGE-4-BUF PIC X(70).
               10  MESSAGE-5-BUF PIC X(70).
               10  MESSAGE-6-BUF PIC X(70).
               10  MESSAGE-7-BUF PIC X(70).
               10  MESSAGE-8-BUF PIC X(70).
               10  MESSAGE-9-BUF PIC X(70).
               10  MESSAGE-0-BUF PIC X(70).
               10  DLIST-CODE    PIC X(06).
           05  HELP-LINE         PIC X(70).
           05  SCREEN-MSGS.
               10  CMDMSG        PIC X(79).
               10  ERRMSG        PIC X(79).

       01  DLIST-LINE.
           05  DIST-CC         PIC X(04).
           05  DIST-ZN         PIC X(04).
           05  DIST-CR         PIC X(02).

       01  DATE-HOLD.
           05  DH-YY           PIC 99.
           05  DH-MM           PIC 99.
           05  DH-DD           PIC 99.

       01  DATE-BUFFER.
           05  DATE-CURR.
               10  CURR-DATE.
                   15  D-BUF-MD  PIC X(02).
                   15  D-BUF-S1  PIC X.
                   15  D-BUF-DM  PIC X(02).
                   15  D-BUF-S2  PIC X.
                   15  D-BUF-YY  PIC X(02).
               10  FILLER        PIC X(09).
           05  FILLER            PIC X(10).

       01  DB-ERROR.
           05  DB-FUNC         PIC X(10) VALUE SPACES.
           05  DB-FILE         PIC X(18) VALUE SPACES.
           05  FILLER          PIC X(20) VALUE "ERROR - FILE-STAT = ".
           05  CON-WORD        PIC XX.

           COPY SCREENIO       IN COPYLIB.

           COPY CATREAD        IN COPYLIB.

       01  NEWS-FILE-DATA.
           COPY DBBOARD        IN COPYLIB.

       01  DISTRIBUTION-TABLE.
           COPY DNEWSTBL       IN COPYLIB.

       01  MESSAGE-BUFFER-DATA.
           COPY ERRORLIN       IN COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  HELP-DATA.
           05  HELP-SW         PIC 9(04) BINARY.
           05  HELP-LOCA       PIC X(40).
           05  HELP-MSGLINE    PIC X(70).

       PROCEDURE DIVISION      USING DBPARAMETERS
                               HELP-DATA.
       CHECK-PASSWORD.
           CALL "TPWORD"       USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG NOT = "N"
               GO TO BEGIN.
           GOBACK.

       BEGIN.
           OPEN I-O            BULLETIN-BOARD.
           OPEN INPUT          NEWS-TABLE.
           OPEN I-O            DISPLAY-FILE.

           MOVE "VBBDISP"      TO SCREEN-NAME.
           MOVE 0              TO FIND-SW REC-SW RECNO.
           MOVE 3              TO MODEX.
           MOVE SPACES         TO SCREEN-DATA MESSAGE-BUFFER.
           MOVE SPACES         TO NEWS-FILE-DATA DATE-BUFFER.
           ACCEPT DATE-HOLD    FROM DATE.

           MOVE "/"            TO D-BUF-S1 D-BUF-S2.
           MOVE DH-YY          TO D-BUF-YY.
           MOVE DH-MM          TO D-BUF-MD.
           MOVE DH-DD          TO D-BUF-DM.
           IF DATE-FLAG = 3
               MOVE DH-MM      TO D-BUF-DM
               MOVE DH-DD      TO D-BUF-MD.
           MOVE DATE-BUFFER    TO DATE-BUF.

           PERFORM TIME-UPDATE.
           MOVE HELP-LOCA      TO LOCA-ID.
           MOVE HELP-MSGLINE   TO HELP-LINE.

           READ BULLETIN-BOARD LAST RECORD INTO NEWS-FILE-DATA
                AT END         GO TO NO-RECORD-RESET.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT-1 = "2" OR "4"
      **********************************************************************
      **    MESSAGE 040/035:
      **  NO NEWS ITEMS AT THIS TIME
      **********************************************************************
                   MOVE  40    TO CATREAD-MSG-SET
                   MOVE  35    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE FILE-STAT TO MSG-FLD
                   MOVE MESSAGE-BUFFER TO ERRMSG
                   MOVE TRUE-VAL TO IND(99)
                   GO TO SHOWFORM
               ELSE
                 MOVE "READ LST" TO DB-FUNC
                 MOVE "BULLETIN-BOARD" TO DB-FILE
                 MOVE FILE-STAT  TO CON-WORD
                 MOVE DB-ERROR   TO ERRMSG
                 MOVE TRUE-VAL   TO IND(99)
                 GO TO SHOWFORM.

           GO TO DBGET-CONTINUE.

       DBGET-LOOP.
           IF MODEX = 3
               GO TO REVERSE-READ
           ELSE
               GO TO FORWARD-READ.

       DBGET-CONTINUE.
           IF NEWS-KEY = "111111"
               GO TO DBGET-LOOP.

           MOVE 1              TO FIND-SW.
           MOVE NEWS-1         TO MESSAGE-1-BUF.
           MOVE NEWS-2         TO MESSAGE-2-BUF.
           MOVE NEWS-3         TO MESSAGE-3-BUF.
           MOVE NEWS-4         TO MESSAGE-4-BUF.
           MOVE NEWS-5         TO MESSAGE-5-BUF.
           MOVE NEWS-6         TO MESSAGE-6-BUF.
           MOVE NEWS-7         TO MESSAGE-7-BUF.
           MOVE NEWS-8         TO MESSAGE-8-BUF.
           MOVE NEWS-9         TO MESSAGE-9-BUF.
           MOVE NEWS-0         TO MESSAGE-0-BUF.
           MOVE NEWS-KEY       TO DLIST-CODE.

           IF NEWS-KEY = "000000"
               MOVE "ALL   "   TO DLIST-CODE.

           PERFORM TIME-UPDATE.

       SHOWFORM.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 1 OR 3
               MOVE "CANCEL"   TO MSG-TEXT
               GO TO END-OF-JOB.

           IF KEY-HIT = 0 OR 8
               MOVE 3          TO MODEX
               GO TO DBGET-LOOP.

           IF KEY-HIT = 4
               MOVE 2          TO MODEX
               GO TO DBGET-LOOP.

           IF KEY-HIT = 5
               IF NEWS-KEY = "000000"
                   GO TO SHOWFORM
               ELSE
                   PERFORM SUBF-CLEAR
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SHOWFORM.

           IF KEY-HIT = 7
               MOVE 40         TO HELP-SW
               CALL "TBBHELP"  USING HELP-DATA
               MOVE "VBBDISP"  TO SCREEN-NAME
               GO TO SHOWFORM.

           IF KEY-HIT NOT = 0
               PERFORM TIME-UPDATE
               MOVE 31         TO FIELD-NUMBER
               GO TO SHOWFORM.

           GO TO DBGET-LOOP.

       REVERSE-READ.
           READ BULLETIN-BOARD PRIOR RECORD INTO NEWS-FILE-DATA
            AT END             GO TO RE-START-REVERSE.

           IF FILE-STAT NOT = "00"
             IF FILE-STAT-1 = "2" OR "4"
               IF FIND-SW = 0
      **********************************************************************
      **    MESSAGE 040/035:
      **  NO NEWS ITEMS AT THIS TIME
      **********************************************************************
                   MOVE  40    TO CATREAD-MSG-SET
                   MOVE  35    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE FILE-STAT  TO MSG-FLD
                   MOVE MESSAGE-BUFFER TO ERRMSG
                   MOVE TRUE-VAL   TO IND(99)
                   GO TO SHOWFORM
               ELSE
                   GO TO RE-START-REVERSE
             ELSE
                 MOVE "READ PRI" TO DB-FUNC
                 MOVE "BULLETIN-BOARD" TO DB-FILE
                 MOVE FILE-STAT  TO CON-WORD
                 MOVE DB-ERROR   TO ERRMSG
                 MOVE TRUE-VAL   TO IND(99)
                 GO TO SHOWFORM.

           GO TO DBGET-CONTINUE.

       FORWARD-READ.
           READ BULLETIN-BOARD NEXT RECORD INTO NEWS-FILE-DATA
            AT END             GO TO RE-START-FORWARD.

           IF FILE-STAT NOT = "00"
             IF FILE-STAT-1 = "2" OR "4"
               IF FIND-SW = 0
      **********************************************************************
      **    MESSAGE 040/035:
      **  NO NEWS ITEMS AT THIS TIME
      **********************************************************************
                   MOVE  40    TO CATREAD-MSG-SET
                   MOVE  35    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE FILE-STAT  TO MSG-FLD
                   MOVE MESSAGE-BUFFER TO ERRMSG
                   MOVE TRUE-VAL   TO IND(99)
                   GO TO SHOWFORM
               ELSE
                   GO TO RE-START-FORWARD
             ELSE
                 MOVE "READ NXT" TO DB-FUNC
                 MOVE "BULLETIN-BOARD" TO DB-FILE
                 MOVE FILE-STAT  TO CON-WORD
                 MOVE DB-ERROR   TO ERRMSG
                 MOVE TRUE-VAL   TO IND(99)
                 GO TO SHOWFORM.

           GO TO DBGET-CONTINUE.

       RE-START-REVERSE.
           MOVE 0              TO FIND-SW.
           READ BULLETIN-BOARD LAST RECORD INTO NEWS-FILE-DATA
              AT END           GO TO NO-RECORD-RESET.
           IF NEWS-KEY = "111111"
           READ BULLETIN-BOARD PRIOR RECORD INTO NEWS-FILE-DATA
              AT END           GO TO NO-RECORD-RESET.
           GO TO DBGET-CONTINUE.

       RE-START-FORWARD.
           MOVE 0              TO FIND-SW.
           READ BULLETIN-BOARD FIRST RECORD INTO NEWS-FILE-DATA
               AT END          GO TO NO-RECORD-RESET.
           IF NEWS-KEY = "111111"
           READ BULLETIN-BOARD NEXT RECORD INTO NEWS-FILE-DATA
               AT END          GO TO NO-RECORD-RESET.
           GO TO DBGET-CONTINUE.

       NO-RECORD-RESET.
           MOVE 1              TO REC-SW.
           MOVE SPACES         TO SCREEN-DATA.
      **********************************************************************
      **    MESSAGE 040/035:
      **  NO NEWS ITEMS AT THIS TIME
      **********************************************************************
           MOVE  40            TO CATREAD-MSG-SET.
           MOVE  35            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE FILE-STAT      TO MSG-FLD.
           MOVE MESSAGE-BUFFER TO ERRMSG.
           MOVE TRUE-VAL       TO IND(99).
           GO TO SHOWFORM.

       TIME-UPDATE.
           ACCEPT TIME-BUFF    FROM TIME.
           MOVE ":"            TO T-BUF-C1 T-BUF-C2.
           MOVE TIME-HRS       TO T-BUF-HR.
           MOVE TIME-MINS      TO T-BUF-MN.
           MOVE TIME-SECS      TO T-BUF-SC.

       GET-DLIST.
           MOVE DLIST-CODE     TO NEWSKEY OF NEWS-TABLE.
           START NEWS-TABLE    KEY = NEWSKEY OF NEWS-TABLE
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      **********************************************************************
      **    MESSAGE 040/015:
      **  NO RECORDS FOUND
      **********************************************************************
               MOVE  40        TO CATREAD-MSG-SET
               MOVE  15        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSG
               MOVE TRUE-VAL   TO IND(99)
               GO TO GDL-EXIT.

       DBGET-DLIST.
           READ NEWS-TABLE     NEXT INTO DISTRIBUTION-TABLE
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT = "10" OR "14" OR "46"
                   GO TO GDL-CONT
               ELSE
                   MOVE "READ    " TO DB-FUNC
                   MOVE "NEWS-TABLE" TO DB-FILE
                   MOVE FILE-STAT  TO CON-WORD
                   MOVE DB-ERROR   TO ERRMSG
                   MOVE TRUE-VAL   TO IND(99)
                   GO TO GDL-EXIT.

           IF DIST-KEY NOT = DLIST-CODE
               GO TO GDL-CONT.

           IF DIST-CC-NUM = "9999"
               MOVE SPACES     TO DIST-CC
           ELSE
              MOVE DIST-CC-NUM TO DIST-CC.

           MOVE DIST-ZONE      TO DIST-ZN.
           MOVE DIST-CRFT      TO DIST-CR.
           MOVE DLIST-LINE     TO DISPLAY-REC.
           ADD  1              TO RECNO.
           WRITE SUBFILE       DISPLAY-REC FORMAT "RDSF"
                               INDIC ARE SCREEN-INDICATORS
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           GO TO DBGET-DLIST.

       GDL-CONT.
           WRITE DISPLAY-REC   FORMAT "RDSB"
                               INDIC ARE SCREEN-INDICATORS.
           MOVE B"1"           TO IND(76).
           IF RECNO > 0
               MOVE TRUE-VAL   TO IND(75)
           ELSE
               MOVE NEG-VAL    TO IND(75).
           MOVE DLIST-CODE     TO DISPLAY-REC.
           WRITE DISPLAY-REC   FORMAT "RDSC"
                               INDIC ARE SCREEN-INDICATORS.
           READ DISPLAY-FILE   FORMAT "RDSC"
                               INDIC ARE SCREEN-INDICATORS.

       GDL-EXIT.               EXIT.

       SUBF-CLEAR.
           MOVE 0              TO RECNO.
           MOVE NEG-VAL        TO IND(75) IND(76).
           MOVE TRUE-VAL       TO IND(77).
           MOVE SPACES         TO DISPLAY-REC.
           WRITE DISPLAY-REC   FORMAT "RDSC"
                               INDIC ARE SCREEN-INDICATORS.
           MOVE NEG-VAL        TO IND(77).

       END-OF-JOB.
           CLOSE               BULLETIN-BOARD.
           CLOSE               NEWS-TABLE.
           CLOSE               DISPLAY-FILE.

           IF MESSAGE-BUFFER NOT = SPACES
               GO TO LEAVE-PROG.

      **********************************************************************
      **    MESSAGE 040/035:
      **  NO NEWS ITEMS AT THIS TIME
      **********************************************************************
           MOVE  40            TO CATREAD-MSG-SET.
           MOVE  35            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.

       LEAVE-PROG.
           GOBACK.

       999-CATREAD.
           MOVE SPACES         TO MESSAGE-BUFFER.
           CALL "CCATREAD"     USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.       EXIT.

