       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TBBHELP.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
      *REMARKS.      **** BULLETIN BOARD MAINTENANCE
      *                   HELP DISPLAY PROGRAM
      *                   WITH DISTRIBUTION TABLE
      *                   ****.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZBBNEW-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS SCREEN-STATUS
                  MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TBBHELP ".
           05  PROGRAM-TYPE        PIC X(02) VALUE "IN".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A     PIC X(60) VALUE
         "HELP DISPLAY SCREENS FOR THE BULLETIN-BOARD MAINTENANCE     ".
               10  PROG-DESC-B     PIC X(60) VALUE
         "PROGRAMS.                                                   ".
               10  PROG-FUNCTION   PIC X(60) VALUE
         "    DO NOT APPLY A PASSWORD                                 ".
           05  PASSWORD-FLAG       PIC X.

       01  SCREEN-DATA.
           05  HLOC-BUF             PIC X(40).
           05  HMSG-BUF             PIC X(70).
           05  SCREEN-MSGS.
               10  CMDMSG           PIC X(79).
               10  ERRMSG           PIC X(79).

           COPY SCREENIO       IN COPYLIB.

       LINKAGE SECTION.
       01  HELP-DATA.
           05  HELP-SW               PIC 9(04) BINARY.
           05  HELP-LOCA             PIC X(40).
           05  HELP-MSGLINE          PIC X(70).

       PROCEDURE DIVISION USING HELP-DATA.
       BEGIN.
           OPEN I-O            DISPLAY-FILE.
           MOVE SPACES         TO SCREEN-DATA.
           IF HELP-SW < 0 OR > 60
                MOVE 0         TO HELP-SW.
           MOVE HELP-LOCA      TO HLOC-BUF.
           MOVE HELP-MSGLINE   TO HMSG-BUF.
           PERFORM GET-FORM.

       SHOWFORM.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.
           IF HELP-SW = 0
               MOVE SPACES     TO DISPLAY-REC.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 3
               GO TO END-OF-JOB
           ELSE
           IF KEY-HIT = 1
               MOVE 10         TO HELP-SW
               PERFORM GET-FORM
               GO TO SHOWFORM
           ELSE
           IF KEY-HIT = 2
               MOVE 20         TO HELP-SW
               PERFORM GET-FORM
               GO TO SHOWFORM
           ELSE
           IF KEY-HIT = 8
               MOVE 30         TO HELP-SW
               PERFORM GET-FORM
               GO TO SHOWFORM
           ELSE
           IF KEY-HIT = 4
               MOVE 40         TO HELP-SW
               PERFORM GET-FORM
               GO TO SHOWFORM
           ELSE
           IF KEY-HIT = 5
               MOVE 50         TO HELP-SW
               PERFORM GET-FORM
               GO TO SHOWFORM
           ELSE
           IF KEY-HIT = 6
               MOVE 60         TO HELP-SW
               PERFORM GET-FORM
               GO TO SHOWFORM
           ELSE
           IF KEY-HIT = 7
               MOVE  0         TO HELP-SW
               PERFORM GET-FORM
               GO TO SHOWFORM
           ELSE
               ADD 10          TO HELP-SW
               PERFORM GET-FORM
               GO TO SHOWFORM.

       GET-FORM.
           IF HELP-SW = 70
               MOVE 0          TO HELP-SW.

           IF HELP-SW = 0
               MOVE "VBBHELP"  TO SCREEN-NAME
           ELSE
           IF HELP-SW = 10
               MOVE "VHELP1"   TO SCREEN-NAME
           ELSE
           IF HELP-SW = 20
               MOVE "VHELP2"   TO SCREEN-NAME
           ELSE
           IF HELP-SW = 30
               MOVE "VHELP3"   TO SCREEN-NAME
           ELSE
           IF HELP-SW = 40
               MOVE "VHELP4"   TO SCREEN-NAME
           ELSE
           IF HELP-SW = 50
               MOVE "VHELP5"   TO SCREEN-NAME
           ELSE
           IF HELP-SW = 60
               MOVE "VHELP6"   TO SCREEN-NAME.

       END-OF-JOB.
           CLOSE               DISPLAY-FILE.
           GOBACK.

