       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TBBINIT.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT BULLETIN-BOARD
                  ASSIGN TO DATABASE-MCFLMM2701
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STAT.

           SELECT NEWS-TABLE
                  ASSIGN TO DATABASE-MCFLMM2801
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZBBNEW-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS SCREEN-STATUS
                  MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  BULLETIN-BOARD
           LABEL RECORDS ARE STANDARD.
       01  BB-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM2701.

       FD  NEWS-TABLE
           LABEL RECORDS ARE STANDARD.
       01  DL-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM2801.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  TRUE-VAL                PIC 1  VALUE B"1".

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TBBINIT ".
           05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A     PIC X(60) VALUE
         "MMIS NEWS INITIATE PROGRAM WITH DISTRIBUTION LISTS.         ".
               10  PROG-DESC-B     PIC X(60) VALUE
         "ADDS NEWS RECORDS TO THE MMIS BULLETIN BOARD.               ".
               10  PROG-FUNCTION   PIC X(60) VALUE
         "RUNS FROM f1 KEY OF THE BULLETIN BOARD MENU.                ".
           05  PASSWORD-FLAG       PIC X.

       01  DLIST-DATA.
           05  DIST-CODE           PIC X(06).
           05  DIST-LOCA           PIC X(40).
           05  DIST-HELP           PIC X(70).

       01  SCREEN-DATA.
           05  LOCA-ID                         PIC X(40).
           05  MESSAGE-BUF.
               10  MESSAGE-1-BUF               PIC X(70).
               10  MESSAGE-2-BUF               PIC X(70).
               10  MESSAGE-3-BUF               PIC X(70).
               10  MESSAGE-4-BUF               PIC X(70).
               10  MESSAGE-5-BUF               PIC X(70).
               10  MESSAGE-6-BUF               PIC X(70).
               10  MESSAGE-7-BUF               PIC X(70).
               10  MESSAGE-8-BUF               PIC X(70).
               10  MESSAGE-9-BUF               PIC X(70).
               10  MESSAGE-0-BUF               PIC X(70).
               10  DIST-LIST                   PIC X(06).
           05  HELP-LINE                       PIC X(70).
           05  SCREEN-MSGS.
               10  CMDMSG                      PIC X(79).
               10  ERRMSG                      PIC X(79).

       01  DB-ERROR.
           05  DB-FUNC   PIC X(10) VALUE SPACES.
           05  DB-FILE   PIC X(18) VALUE SPACES.
           05  FILLER    PIC X(20) VALUE "ERROR - FILE-STAT = ".
           05  CON-WORD  PIC XX.

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

           COPY SCREENIO       IN COPYLIB.

       01  NEWS-FILE-DATA.
           COPY DBBOARD        IN COPYLIB.

       01  MESSAGE-BUFFER-DATA.
           COPY ERRORLIN       IN COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  HELP-DATA.
           05  HELP-SW         PIC 9(04) BINARY.
           05  HELP-LOCA       PIC X(40).
           05  HELP-MSGLINE    PIC X(70).

       PROCEDURE DIVISION USING DBPARAMETERS
                                HELP-DATA.
       CHECK-PASSWORD.
           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG NOT = "N"
               GO TO BEGIN-PROC.
           GOBACK.

       BEGIN-PROC.
           OPEN I-O            BULLETIN-BOARD.
           OPEN INPUT          NEWS-TABLE.
           OPEN I-O            DISPLAY-FILE.
           MOVE "VBBINIT"      TO SCREEN-NAME.
           MOVE SPACES         TO SCREEN-DATA MESSAGE-BUFFER.
           MOVE SPACES         TO NEWS-FILE-DATA.
           MOVE HELP-LOCA      TO LOCA-ID DIST-LOCA.
           MOVE HELP-MSGLINE   TO HELP-LINE DIST-HELP.

       MAIN.
           MOVE SPACES         TO MESSAGE-BUF MESSAGE-BUFFER.

       SHOWFORM.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 1 OR 3
               GO TO END-OF-JOB.

           IF KEY-HIT = 7
               MOVE 10         TO HELP-SW
               CALL "TBBHELP" USING HELP-DATA
               MOVE "VBBINIT"  TO SCREEN-NAME
               GO TO SHOWFORM.

           IF KEY-HIT NOT = 0
               GO TO SHOWFORM.

           IF MESSAGE-BUF = SPACES
               GO TO SHOWFORM.

       ADD-NEWS-RECORD.
           IF DIST-LIST = SPACES
               MOVE "000000"   TO NEWS-KEY
           ELSE
               MOVE DIST-LIST  TO NEWS-KEY.

           MOVE MESSAGE-1-BUF  TO NEWS-1.
           MOVE MESSAGE-2-BUF  TO NEWS-2.
           MOVE MESSAGE-3-BUF  TO NEWS-3.
           MOVE MESSAGE-4-BUF  TO NEWS-4.
           MOVE MESSAGE-5-BUF  TO NEWS-5.
           MOVE MESSAGE-6-BUF  TO NEWS-6.
           MOVE MESSAGE-7-BUF  TO NEWS-7.
           MOVE MESSAGE-8-BUF  TO NEWS-8.
           MOVE MESSAGE-9-BUF  TO NEWS-9.
           MOVE MESSAGE-0-BUF  TO NEWS-0.

           WRITE BB-REC        FROM NEWS-FILE-DATA.
           IF FILE-STAT NOT = "00"
               MOVE FILE-STAT  TO CON-WORD
               MOVE "WRITE   " TO DB-FUNC
               MOVE "BULLETIN-BOARD" TO DB-FUNC
               MOVE DB-ERROR   TO ERRMSG
               MOVE TRUE-VAL   TO IND(6) IND(99)
               GO TO SHOWFORM.

           IF DIST-LIST = SPACES
               GO TO MAIN.

       CHECK-DISTRIBUTION.
           MOVE DIST-LIST      TO DIST-CODE
                                  NEWSKEY OF NEWS-TABLE.
           START NEWS-TABLE    KEY = NEWSKEY OF NEWS-TABLE.
           IF FILE-STAT = "00"
               GO TO MAIN.

           CALL "TDLINIT" USING DBPARAMETERS
                                DLIST-DATA
               IF KEY-HIT = 3
                   GO TO END-OF-JOB.

           MOVE "VBBINIT"      TO SCREEN-NAME.
           MOVE SPACES         TO SCREEN-DATA MESSAGE-BUFFER.
           MOVE SPACES         TO NEWS-FILE-DATA.
           GO TO MAIN.

       END-OF-JOB.
           CLOSE               BULLETIN-BOARD.
           CLOSE               NEWS-TABLE.
           CLOSE               DISPLAY-FILE.
           GOBACK.

