       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TBBMAST.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT BULLETIN-BOARD
                  ASSIGN TO DATABASE-MCFLMM2701
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZBBNEW-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS SCREEN-STATUS
                  MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  BULLETIN-BOARD
           LABEL RECORDS ARE STANDARD.
       01  BB-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM2701.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  TRUE-VAL               PIC 1     VALUE B"1".
       77  RECORD-FLAG            PIC S9(4) VALUE 0.
           88  RECORD-FLAG-UP               VALUE 1.

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TBBMAST ".
           05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A     PIC X(60) VALUE
         "MASTER RECORD MODULE FOR THE MMIS NEWS BULLETIN BOARD SYSTEM".
               10  PROG-DESC-B     PIC X(60) VALUE
         "ALLOWS CREATION OF THE BULLETIN BOARD MASTER RECORD.        ".
               10  PROG-FUNCTION   PIC X(60) VALUE
         "RUNS FROM THE f5 KEY OF THE BULLETIN BOARD MENU.            ".
           05  PASSWORD-FLAG       PIC X.

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       01  SCREEN-DATA.
           05  LOCA-ID            PIC X(40).
           05  HELP-TEXT          PIC X(26).
           05  SCREEN-MSGS.
               10  CMDMSG                      PIC X(79).
               10  ERRMSG                      PIC X(79).

       01  MESSAGE-HOLD.
           05  MSG-HOLD              PIC X(60)    VALUE SPACE.
           05  FILLER                PIC X(60)    VALUE SPACE.

       01  LOCATION.
           05  LOCATN        PIC X(40).
           05  FILL-DATA     PIC X(30).

       01  HELPLINE-BUF.
           05  FILLER        PIC X(43).
           05  CONTACT-BUF   PIC X(26).
           05  FILLER        PIC X.

       01  HELPLINE-MESSAGE.
           05  FILLER        PIC X(21) VALUE " FOR MMIS HELP OR PRO".
           05  FILLER        PIC X(22) VALUE "BLEMS, PLEASE CONTACT ".
           05  CONTACT-DATA  PIC X(26).
           05  FILL-SPACE    PIC X     VALUE SPACE.

       01  NEWS9-DATA.
           05  TEST-FIELD    PIC X(07).
           05  FILLER        PIC X(63).

       01  DAILY-MESSAGE.
           05  FILLER        PIC X(19) VALUE SPACES.
           05  FILLER        PIC X(16) VALUE "DISPLAY YOUR NEW".
           05  FILLER        PIC X(16) VALUE "S MESSAGES DAILY".
           05  FILLER        PIC X(19) VALUE SPACES.

       01  DB-ERROR.
           05  DB-FUNC   PIC X(10) VALUE SPACES.
           05  DB-FILE   PIC X(18) VALUE SPACES.
           05  FILLER    PIC X(20) VALUE "ERROR - FILE-STAT = ".
           05  CON-WORD  PIC XX.

           COPY SCREENIO       IN COPYLIB.

           COPY CATREAD        IN COPYLIB.

       01  NEWS-FILE-DATA.
           COPY DBBOARD        IN COPYLIB.

       01  MESSAGE-BUFFER-DATA.
           COPY ERRORLIN       IN COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  HELP-DATA.
           05  HELP-SW             PIC 9(04) BINARY.
           05  HELP-LOCA           PIC X(40).
           05  HELP-MSGLINE        PIC X(70).

       PROCEDURE DIVISION USING DBPARAMETERS
                                HELP-DATA.
       CHECK-PASSWORD.
           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG NOT = "N"
               GO TO BEGIN-PROC.
           GOBACK.

       BEGIN-PROC.
           OPEN I-O            BULLETIN-BOARD.
           OPEN I-O            DISPLAY-FILE.
           MOVE 0              TO RECORD-FLAG.
           MOVE "VBBMAST"      TO SCREEN-NAME.
           MOVE SPACES         TO SCREEN-DATA MESSAGE-BUFFER.
           MOVE SPACES         TO NEWS-FILE-DATA.

       DBGET-SETUP.
           MOVE "111111"       TO NEWSKEY OF BULLETIN-BOARD.
           READ BULLETIN-BOARD INTO NEWS-FILE-DATA.
           IF FILE-STAT NOT = "00"
               GO TO SHOWFORM.

           IF NEWS-KEY NOT = "111111"
               GO TO SHOWFORM.

           MOVE 1              TO RECORD-FLAG.
           MOVE NEWS-1         TO LOCATION.
           MOVE LOCATN         TO LOCA-ID.
           MOVE NEWS-9         TO NEWS9-DATA.
           IF TEST-FIELD = "CONTACT"
               MOVE NEWS-0     TO HELPLINE-BUF
               MOVE CONTACT-BUF TO HELP-TEXT.

       SHOWFORM.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 1 OR 3
               GO TO END-OF-JOB.

           IF KEY-HIT = 7
               MOVE 50         TO HELP-SW
               CALL "TBBHELP" USING HELP-DATA
               MOVE "VBBMAST"  TO SCREEN-NAME
               GO TO SHOWFORM.

           IF KEY-HIT NOT = 0
               GO TO SHOWFORM.

       BUILD-RECORD.
           MOVE SPACES         TO NEWS-FILE-DATA.
           MOVE "111111"       TO NEWS-KEY.
           MOVE LOCA-ID        TO LOCATN HELP-LOCA.
           MOVE SPACES         TO FILL-DATA.
           MOVE LOCATION       TO NEWS-1.
           MOVE HELP-TEXT      TO CONTACT-DATA.

           IF HELP-TEXT = SPACES
               MOVE "DEFAULT"  TO NEWS-9
               MOVE SPACES     TO MESSAGE-HOLD
      **********************************************************************
      **    MESSAGE 030/043:
      **              DISPLAY YOUR NEWS MESSAGES DAILY
      **********************************************************************
               MOVE  30        TO CATREAD-MSG-SET
               MOVE  43        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO MSG-HOLD
               IF MSG-HOLD = SPACES
                   MOVE DAILY-MESSAGE TO NEWS-0 HELP-MSGLINE
               ELSE
                   MOVE MESSAGE-HOLD  TO NEWS-0 HELP-MSGLINE
                   MOVE SPACES        TO MESSAGE-HOLD
           ELSE
               MOVE "CONTACT"  TO NEWS-9
               MOVE SPACES     TO MESSAGE-BUFFER
      **********************************************************************
      **    MESSAGE 032/012:
      **  FOR MMIS HELP OR PROBLEMS, PLEASE CONTACT
      **********************************************************************
               MOVE  32        TO CATREAD-MSG-SET
               MOVE  12        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               IF MSG-TEXT = SPACES
                   MOVE HELPLINE-MESSAGE TO NEWS-0 HELP-MSGLINE
               ELSE
                   MOVE MESSAGE-BUFFER   TO HELPLINE-MESSAGE
                   MOVE HELP-TEXT        TO CONTACT-DATA
                   MOVE SPACE            TO FILL-SPACE
                   MOVE HELPLINE-MESSAGE TO NEWS-0 HELP-MSGLINE
                   MOVE SPACES           TO MESSAGE-BUFFER.

           IF RECORD-FLAG-UP GO TO CHANGE-RECORD.

       ADD-RECORD.
           WRITE BB-REC        FROM NEWS-FILE-DATA.
           IF FILE-STAT NOT = "00"
               MOVE FILE-STAT  TO CON-WORD
               MOVE "WRITE   " TO DB-FUNC
               MOVE "BULLETIN-BOARD" TO DB-FILE
               MOVE DB-ERROR   TO ERRMSG
               MOVE TRUE-VAL   TO IND(1) IND(99)
               GO TO SHOWFORM.

           GO TO END-OF-JOB.

       CHANGE-RECORD.
           REWRITE BB-REC      FROM NEWS-FILE-DATA.
           IF FILE-STAT NOT = "00"
               MOVE FILE-STAT  TO CON-WORD
               MOVE "REWRITE " TO DB-FUNC
               MOVE "BULLETIN-BOARD" TO DB-FILE
               MOVE DB-ERROR   TO ERRMSG
               MOVE TRUE-VAL   TO IND(1) IND(99)
               GO TO SHOWFORM.

       END-OF-JOB.
           CLOSE               BULLETIN-BOARD.
           CLOSE               DISPLAY-FILE.
           GOBACK.

       999-CATREAD.
           MOVE SPACES         TO MESSAGE-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE  CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.    EXIT.

