       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TBBNEWS.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        AS-400.
       OBJECT-COMPUTER.        AS-400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT BULLETIN-BOARD
                  ASSIGN       TO DATABASE-MCFLMM2701
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT NEWS-TABLE
                  ASSIGN       TO DATABASE-MCFLMM2801
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT PER-PERSONNEL
                  ASSIGN       TO DATABASE-MCFLMM0301
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZBBNEW-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  BULLETIN-BOARD
           LABEL RECORDS ARE STANDARD.
       01  BB-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM2701.

       FD  NEWS-TABLE
           LABEL RECORDS ARE STANDARD.
       01  NT-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM2801.

       FD  PER-PERSONNEL
           LABEL RECORDS ARE STANDARD.
       01  PER-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0301.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  REC-CTR             PIC 9(04) VALUE 0.
       77  TRUE-VAL            PIC 1     VALUE B"1".

       01  FILE-STAT.
           05  FILE-STAT-1     PIC X  VALUE "0".
           05  FILE-STAT-2     PIC X  VALUE "0".

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM PIC X(08) VALUE "TBBNEWS ".
           05  PROGRAM-TYPE    PIC X(02) VALUE "IN".
           05  PROGRAM-RELEASE PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC1  PIC X(30) VALUE
                   "BULLETIN BOARD DISPLAY PROGRAM".
               10  PROG-DESC2  PIC X(30) VALUE
                   "TO VIEW PLANT NEWS IN THE    ".
               10  PROG-DESC3  PIC X(30) VALUE
                   "MMIS SYSTEM FROM THE CRAFTSMAN".
               10  PROG-DESC4  PIC X(30) VALUE
                   "'s EXECUTIVE PROGRAM.         ".
               10  PROG-FUNC1  PIC X(30) VALUE
                   "RUNS WHEN `NEWS' IS ENTERED IN".
               10  PROG-FUNC2  PIC X(30) VALUE
                   "TO THE CLOCK-CARD FIELD.      ".
           05  PASSWORD-FLAG   PIC X.

       01  TIME-BUFF.
           05  TIME-HM.
               10  TIME-HRS    PIC 99.
               10  TIME-MINS   PIC 99.
           05  TIME-SECS       PIC 99.
           05  TIME-TENTHS     PIC 99.

       01  GETCC-SCREEN.
           05  LOCA-ID-2       PIC X(40).
           05  CC-BUFFER       PIC XXXX.
           05  HELP-LINE-2     PIC X(70).
           05  SCREEN-MSGCC.
               10  CMDMSGCC    PIC X(79).
               10  ERRMSGCC    PIC X(79).

       01  SCREEN-DATA.
           05  LOCA-ID             PIC X(40).
           05  DATE-BUF            PIC X(18).
           05  TIME-BUF.
               10  T-BUF-HR        PIC X(02).
               10  T-BUF-C1        PIC X.
               10  T-BUF-MN        PIC X(02).
               10  T-BUF-C2        PIC X.
               10  T-BUF-SC        PIC X(02).
           05  MESSAGE-BUF.
               10  MESSAGE-1-BUF   PIC X(70).
               10  MESSAGE-2-BUF   PIC X(70).
               10  MESSAGE-3-BUF   PIC X(70).
               10  MESSAGE-4-BUF   PIC X(70).
               10  MESSAGE-5-BUF   PIC X(70).
               10  MESSAGE-6-BUF   PIC X(70).
               10  MESSAGE-7-BUF   PIC X(70).
               10  MESSAGE-8-BUF   PIC X(70).
               10  MESSAGE-9-BUF   PIC X(70).
               10  MESSAGE-0-BUF   PIC X(70).
           05  DIST-BUF            PIC X(06).
           05  HELP-LINE           PIC X(70).
           05  SCREEN-MSGS.
               10  CMDMSG          PIC X(79).
               10  ERRMSG          PIC X(79).

       01  LOCATION.
           05  LOCATN          PIC X(40).
           05  FILLER          PIC X(30).

       01  CURR-DATE.
           10  CD-YY           PIC XX.
           10  CD-MM           PIC XX.
           10  CD-DD           PIC XX.

       01  DATE-BUFFER.
           05  D-BUF-MM        PIC XX.
           05  D-BUF-S1        PIC X.
           05  D-BUF-DD        PIC XX.
           05  D-BUF-S2        PIC X.
           05  D-BUF-YY        PIC XX.

       01  DB-ERROR.
           05  DB-FUNC   PIC X(10) VALUE SPACES.
           05  DB-FILE   PIC X(18) VALUE SPACES.
           05  FILLER    PIC X(20) VALUE "ERROR - FILE-STAT = ".
           05  CON-WORD  PIC XX.

           COPY SCREENIO       IN COPYLIB.

           COPY CATREAD        IN COPYLIB.

       01  WO-PERS-DATA.
           COPY MPERSONL       IN COPYLIB.

       01  BB-DATA.
           COPY DBBOARD        IN COPYLIB.

       01  DIST-TAB.
           COPY DNEWSTBL       IN COPYLIB.

       01  MESSAGE-DATA.
           COPY ERRORLIN       IN COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  PERS-DATA.
           05  PER-CC          PIC XXXX.
           05  PER-ZONE        PIC XXXX.
           05  PER-SKILL       PIC XX.

       PROCEDURE DIVISION USING DBPARAMETERS
                                PERS-DATA.
       CHECK-PASSWORD.
           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG NOT = "N"
               GO TO BEGIN.
           GOBACK.

       BEGIN.
           OPEN INPUT          BULLETIN-BOARD.
           OPEN INPUT          NEWS-TABLE.
           OPEN INPUT          PER-PERSONNEL.
           OPEN I-O            DISPLAY-FILE.
           MOVE SPACES         TO SCREEN-DATA MESSAGE-BUFFER.
           MOVE SPACES         TO BB-DATA DATE-BUFFER.
           MOVE SPACES         TO GETCC-SCREEN.

           ACCEPT CURR-DATE    FROM DATE.
           MOVE "/"            TO D-BUF-S1 D-BUF-S2.
           MOVE CD-MM          TO D-BUF-MM.
           MOVE CD-DD          TO D-BUF-DD.
           MOVE CD-YY          TO D-BUF-YY.
           IF DATE-FLAG = 3
               MOVE CD-MM      TO D-BUF-DD
               MOVE CD-DD      TO D-BUF-MM.

           MOVE DATE-BUFFER    TO DATE-BUF.

       1-SETUP.
           MOVE "111111"       TO NEWSKEY OF BULLETIN-BOARD.
           READ BULLETIN-BOARD INTO BB-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               STRING
               " BULLETIN-BOARD ERROR - FILE-STAT = " FILE-STAT
               "  (KEY '111111' NOT FOUND)"
               DELIMITED BY SIZE INTO MSG-TEXT
               DISPLAY MESSAGE-BUFFER
               GO TO END-OF-JOB.

           IF NEWS-KEY NOT = "111111"
               STRING
               " BULLETIN-BOARD ERROR - FILE-STAT = " FILE-STAT
               "  (KEY '111111' NOT FOUND)"
               DELIMITED BY SIZE INTO MSG-TEXT
               DISPLAY MESSAGE-BUFFER
               GO TO END-OF-JOB.

           MOVE NEWS-1         TO LOCATION.
           MOVE LOCATN         TO LOCA-ID LOCA-ID-2.
           MOVE NEWS-0         TO HELP-LINE HELP-LINE-2.

       CHECK-DLIST.
           IF PER-CC = SPACES
               PERFORM GET-PERS-DATA THRU GPD-EXIT.
           MOVE "VBBOARD"      TO SCREEN-NAME.
           MOVE 0              TO REC-CTR.

       DBCLOSE.
           READ BULLETIN-BOARD LAST RECORD INTO BB-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      ******************************************************************
      **   MESSAGE:  040/035:
      **  NO NEWS MESSAGES AT THIS TIME
      ******************************************************************
               MOVE  40        TO CATREAD-MSG-SET
               MOVE  35        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSG
               MOVE TRUE-VAL   TO IND(99)
               GO TO SHOWFORM.

           GO TO DBGET-CONTINUE.

       DBGET-LOOP.
           READ BULLETIN-BOARD PRIOR RECORD INTO BB-DATA
               AT END          GO TO DBCHECK.
           IF FILE-STAT NOT = "00"
               MOVE "READ PRI" TO DB-FUNC
               MOVE "BULLETIN-BOARD" TO DB-FILE
               MOVE FILE-STAT  TO CON-WORD
               MOVE DB-ERROR   TO ERRMSG
               MOVE TRUE-VAL   TO IND(99)
               GO TO SHOWFORM.

       DBGET-CONTINUE.
           IF NEWS-KEY = "111111"
               GO TO DBGET-LOOP.

           IF NEWS-KEY = "000000"
               MOVE "ALL    "  TO NEWS-KEY
               GO TO WRITE-RECORD.

       GET-DISTRIBUTION.
           MOVE NEWS-KEY       TO NEWSKEY OF NEWS-TABLE.
           START NEWS-TABLE    KEY = NEWSKEY OF NEWS-TABLE
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO DBGET-LOOP.

       DBGET-DLIST.
           READ NEWS-TABLE     NEXT RECORD INTO DIST-TAB
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "10" OR "14" OR "46"
               GO TO DBGET-LOOP
           ELSE
           IF FILE-STAT NOT = "00"
               DISPLAY  " READ NEWS-TABLE ERROR = " FILE-STAT
               GO TO WRITE-RECORD.

           IF NEWS-KEY NOT = DIST-KEY
               GO TO DBGET-LOOP.

           IF DIST-CC-NUM NOT = "9999"
               IF DIST-CC-NUM = PER-CC
                   GO TO WRITE-RECORD
               ELSE
                   GO TO DBGET-DLIST.

           IF DIST-ZONE = PER-ZONE AND DIST-CRFT = SPACES
               GO TO WRITE-RECORD.

           IF DIST-CRFT = PER-SKILL AND DIST-ZONE = SPACES
               GO TO WRITE-RECORD.

           IF DIST-ZONE = PER-ZONE AND DIST-CRFT = PER-SKILL
               GO TO WRITE-RECORD.

           GO TO DBGET-DLIST.

       DBCHECK.
           IF REC-CTR = 0
      ******************************************************************
      **   MESSAGE:  040/035:
      **  NO NEWS MESSAGES AT THIS TIME
      ******************************************************************
               MOVE  40        TO CATREAD-MSG-SET
               MOVE  35        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSG
               MOVE TRUE-VAL   TO IND(99)
               GO TO SHOWFORM.

           GO TO DBCLOSE.

       WRITE-RECORD.
           ADD 1               TO REC-CTR.
           MOVE NEWS-KEY       TO DIST-BUF.
           MOVE NEWS-1         TO MESSAGE-1-BUF.
           MOVE NEWS-2         TO MESSAGE-2-BUF.
           MOVE NEWS-3         TO MESSAGE-3-BUF.
           MOVE NEWS-4         TO MESSAGE-4-BUF.
           MOVE NEWS-5         TO MESSAGE-5-BUF.
           MOVE NEWS-6         TO MESSAGE-6-BUF.
           MOVE NEWS-7         TO MESSAGE-7-BUF.
           MOVE NEWS-8         TO MESSAGE-8-BUF.
           MOVE NEWS-9         TO MESSAGE-9-BUF.
           MOVE NEWS-0         TO MESSAGE-0-BUF.

       SHOWFORM.
           ACCEPT TIME-BUFF    FROM TIME.
           MOVE ":"            TO T-BUF-C1 T-BUF-C2.
           MOVE TIME-HRS       TO T-BUF-HR.
           MOVE TIME-MINS      TO T-BUF-MN.
           MOVE TIME-SECS      TO T-BUF-SC.

           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 1 OR 3
               GO TO END-OF-JOB.

           IF KEY-HIT NOT = 0
               GO TO SHOWFORM.

           GO TO DBGET-LOOP.

       GET-PERS-DATA.
           MOVE "VBBGETCC"     TO SCREEN-NAME.

       PER-SHOWFORM.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE GETCC-SCREEN   TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO GETCC-SCREEN.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 1 OR 3
               GO TO END-OF-JOB.

           IF KEY-HIT NOT = 0
               GO TO PER-SHOWFORM.

           IF CC-BUFFER = SPACES OR "NEWS" OR "9999"
               MOVE SPACES     TO CC-BUFFER
               GO TO PER-SHOWFORM.

           MOVE CC-BUFFER      TO PERCCNUM OF PER-PERSONNEL.
           READ PER-PERSONNEL  INTO WO-PERS-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      **********************************************************************
      **    MESSAGE 035/047:
      **  INVALID CLOCK CARD NUMBER
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE  47        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSGCC
               MOVE TRUE-VAL   TO IND(99)
               GO TO PER-SHOWFORM.

           MOVE PER-CC-NUM     TO PER-CC.
           MOVE PER-MAINT-ZONE TO PER-ZONE.
           IF PER-TEMP-ZONE NOT = SPACES
               MOVE PER-TEMP-ZONE TO PER-ZONE.
           MOVE PER-CRAFT      TO PER-SKILL.

       GPD-EXIT.               EXIT.

       END-OF-JOB.
           CLOSE               BULLETIN-BOARD.
           CLOSE               NEWS-TABLE.
           CLOSE               PER-PERSONNEL.
           CLOSE               DISPLAY-FILE.
           GOBACK.

       999-CATREAD.
           MOVE SPACES         TO MESSAGE-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.       EXIT.

